[[{"date": "15 Jun 2022", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Pioneer Center for Human Services (McHenry, IL)", "Interview Descriptions": "I worked with a recruiter and initially the process was smooth. I moved onto the next phase which was a video interview.  It was originally scheduled at a certain time then the interviewer emailed me directly  that the time was now 15 mins later, no big deal. I joined 5 mins before it started and waited 10 mins after the meeting start time and the interviewer never joined. I let the recruiter know and she called me an hour later to let me know the interviewer had an emergency  and can join right now. Luckily I was still home so I agreed and joined. The interview was only supposed to go for 30 mins and it went almost an hour! We had just a great conversation and it felt very comfortable.\n\nI was then asked to come in for an in-person interview with the video interviewer and the rest of the team. This interview ended up going on for an hour and a half! I loved getting to know the other team members and the conversation was natural and we were laughing having a great time! They even showed me around the office and if I got the position, my office. If they would’ve given me an offer that day or that week I would’ve accepted.\n\nThe in-person interview was Monday late afternoon. By Wednesday that week, the recruiter reached out with some additional questions from them which I thought I answered during both the video and in-person, so I answered it to her to relay. I was then asked to submit references that same day. \n\nBy Friday, I was told I was a strong candidate, but they had an internal referral they had to interview and they were going to make a decision/offer on Tuesday. Tuesday rolls around and I don’t hear anything. I did reach out to the recruiter that evening asking for an update. The following day, the recruiter said she got in touch and the internal referral interview got delayed and for me to “hang in there just one more day” and an answer would be made by Thursday. The recruiter messaged me on Thursday late afternoon stating she hasn’t gotten a hold of them to get an update. The recruiter essentially was ghosted and she couldn’t get a hold of anyone.\n\n2 weeks go by and the recruiter finally got an update, the person who left which made the position available came back and they gave her the job back. I completely understand that happens, but I thought it was completely unprofessional how the latter part of the process was handled by them. \n\nThe recruiter was AMAZING throughout the process. She would touch base with me and let me know that she reached out etc.", "Interview Questions": "What made you want to leave your current position?"}, {"date": "19 Jan 2021", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pioneer Center for Human Services (Nashmī ‘Afrī)", "Interview Descriptions": "Very nice and essential blah blah bland not too good with a lot of the food that you have had a good time to try the new food with the same price as a little too expensive and not a lot to try to make a lot more money and food", "Interview Questions": "For sure if that would happen?"}, {"date": "28 Feb 2020", "title": "Peer Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pioneer Center for Human Services (Marysville, WA) in Feb 2020", "Interview Descriptions": "One on one and was laid back and informative. Interview took an hour. Person conducting interview was pleasant and informative. She made me feel relaxed and valued. She was flexible regarding when and where to meet.", "Interview Questions": "Do you have a Peer Support certification? "}, {"date": "14 Nov 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pioneer Center for Human Services", "Interview Descriptions": "Interview process went fairly quickly. Staff was friendly and accommodating. Interview questions were standard. Be honest and be yourself and you will be fine. Interviewer was pleasant and asked typical questions", "Interview Questions": "What would you say is your biggest strength?"}, {"date": "15 Jun 2015", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pioneer Center for Human Services", "Interview Descriptions": "I felt like the whole interview process was pretty easy and quick. However, the work itself seemed like too much and not really compensate well to the worker...... ..... ...... ...... .. ................. ........... ...........  ....... ..... ..... ...... .... ......... ..... .. ........ ........ .........", "Interview Questions": "they asked me about my background and experiences"}, {"date": "15 Jul 2015", "title": "House Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Pioneer Center for Human Services in May 2015", "Interview Descriptions": "It was a fairly easy interview process. The people that interviewed me were very nice and so easy to talk to. The questions were normal interview questions. They also asked about my background to see if i would be a good fit for the job.", "Interview Questions": "Tell us something you have failed at?"}, {"date": "4 Aug 2014", "title": "Program Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pioneer Center for Human Services (McHenry, IL)", "Interview Descriptions": "I applied online. I heard back from someone immediately to set up an interview. There was a little bit of phone pre-screening and then my interview took place later that week.\r\nThe interview was pretty basic questions of \"tell me about a time when\" and included things like having to solve a problem, dispute with a co worker, something didn't go the way you expected it to go, etc.", "Interview Questions": "The hardest part was coming up with a different story for each question. Some of them all ran together. For example \"tell me about a time when you had a disagreement with a co worker\" and \"how do you feel staff should handle conflict\" etc. They want to hear your stories, not just a list of characteristcs. "}, {"date": "9 Sept 2018", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pioneer Center for Human Services (McHenry, IL) in May 2014", "Interview Descriptions": "They asked you the typical questions about your theoretical orientation and such. They asked why I felt I would be a good fit for that environment because community mental health can be very taxing.", "Interview Questions": "What is your theoretical orientation?"}, {"date": "1 Jan 2018", "title": "Community Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pioneer Center for Human Services in Mar 2014", "Interview Descriptions": "The interview was brief and to the point. The interview questions were behavioral questions Met with the manager and she discussed the job expectations of Community Inclusion. The interview tool around 20-25 minutes and there was time for question and answer afterwards", "Interview Questions": "What skills do you bring to the job?"}, {"date": "13 Aug 2012", "title": "Outpatient Therapist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pioneer Center for Human Services", "Interview Descriptions": "Phone call, 30 minute interview and offer", "Interview Questions": "Pretty basic stuff"}], [{"date": "12 Jul 2016", "title": "Program Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pioneer Center for Human Services (McHenry, IL) in Feb 2012", "Interview Descriptions": "Very informal but thorough.  The interview was at a residence for the clients the organizaiton served.  The person performing the interview was obviously very passionate about their role in providing the best care and staff for the clients.", "Interview Questions": "Physical ability to assist disabled individuals"}]]