[[{"date": "25 Mar 2023", "title": "Mathematics Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado College", "Interview Descriptions": "There was no interview for this job. In fact, they only required a resume and some experience in mathematics. The process between submission and offer was quite fast, and since they are always looking for employees, it is easy to get.", "Interview Questions": "N/A"}, {"date": "8 Nov 2022", "title": "Covid-19 Contact Tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado College", "Interview Descriptions": "Very easy interview, seemed like they were trying to get all the help they could get. Asked about previous experience and if I could take a contact tracing course. Overall very easy interview and selection process.", "Interview Questions": "Are you willing to take a COVID-19 contact tracing course?"}, {"date": "21 Feb 2023", "title": "Creative Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Colorado College in Oct 2022", "Interview Descriptions": "Offered an interview through a referral. Went through two 1:1 interviews with department leaders, a group interview with the creative team and an interview with the department executive. After the VP offered me the role moving forward, things went radio silent. Basically ghosted after the fourth interview.", "Interview Questions": "This is a hybrid role, are you able to work out of Colorado? We need to rebrand and revise our website. Is that something you have experience with?"}, {"date": "22 Sept 2022", "title": "Paraprofessional Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Colorado College in May 2022", "Interview Descriptions": "The Colorado College Paraprofessional position requires a written statement of interest and an interview process. \n\nThe interview took less than an hour with an administrator on campus. \n\nBe prepared for your interview and always be early! \n\n", "Interview Questions": "They asked me my name "}, {"date": "2 Oct 2021", "title": "GIS Technical Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Colorado College", "Interview Descriptions": "Phone Interview. After that two candidates were selected to tour the campus. During this tour there were two interviews. One with the hiring committee and the second with the supervisor", "Interview Questions": "What is the difference between geocoding, georeferncing and geoprocessing? "}, {"date": "1 Nov 2021", "title": "Art Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Colorado College (Colorado Springs, CO) in Oct 2021", "Interview Descriptions": "Very Relaxed conversation with Fine Arts Director after application fill out. Afterwards introduced to other members of the team all of who were inviting and encouraging about what I could offer.", "Interview Questions": "What class  can you envision yourself running?"}, {"date": "9 Nov 2021", "title": "Off Campus Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Colorado College (Colorado Springs, CO) in Oct 2021", "Interview Descriptions": "It was a zoom interview with six people and twelve questions. They sent me the questions beforehand but with minimal time to prepare. They also allowed for me to ask a few questions at the end.", "Interview Questions": "Could you please describe your communication style?  How do you communicate with colleagues who have a different communication style than you?"}, {"date": "1 Sept 2021", "title": "GIS Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado College", "Interview Descriptions": "Simple, straightforward interview. Must meet qualifications but the staff is willing to work with you on the hiring process. Experience is a must for this position but training will be provided on an as-needed basis.", "Interview Questions": "Q: What is your level of experience."}, {"date": "27 Mar 2023", "title": "Digital Collections Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado College (Colorado Springs, CO) in Dec 2019", "Interview Descriptions": "Single interview for grant position. Skype interview with three employees. Gave a question to consider ahead of time. Interviewers were friendly and informative, and the interview felt more like a conversation than an interview.", "Interview Questions": "How do you manage data in your current position and what are some difficulties?"}, {"date": "11 Aug 2020", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Colorado College (Colorado Springs, CO) in Sept 2019", "Interview Descriptions": "I met the main manager and a student manager at a job fair and wrote my name, student ID number and email address down on an “interested list” and patiently waited for a response email which came a week later", "Interview Questions": "The manager emailed everyone who wrote their names down at the job fair and asked us if we wanted the job"}], [{"date": "27 Mar 2017", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Colorado College (Colorado Springs, CO) in Feb 2017", "Interview Descriptions": "Two day interview. Arrived early on Tuesday morning. Gave a student oriented talk on Tuesday, then dinner with faculty. On Wednesday I had a second faculty oriented research talk. I met with the dean and president.", "Interview Questions": "What would you like to teach next year"}, {"date": "22 Mar 2016", "title": "Fitness Center Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Colorado College (Colorado Springs, CO) in Sept 2015", "Interview Descriptions": "Asked about academic history, availability, work experience, CPR certification, leadership experience, familiarity with gym equipment... One-on-one interview after submitting an application via email with an employee referral. Training took place during one shift (took approximately one hour)", "Interview Questions": "Are you willing to maintain CPR certification?"}, {"date": "8 Jan 2015", "title": "Fitness Center Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Colorado College", "Interview Descriptions": "was told of opening by friend. submitted resume and cover letter and received an e-mail back within the week. then i had a phone interview. pretty basic questions meant to give more real world experience than anything else.", "Interview Questions": "pretty typical questions. do you feel comfortable intervening in safety cases?`"}, {"date": "2 Jan 2015", "title": "Sexual Assault Response Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Colorado College", "Interview Descriptions": "The person who would have been my supervisor called me, and emailed me, asking me for an interview. I had a phone interview with about five people in attendance; they each asked me 1 - 2 questions; the interview lasted approximately twenty minutes. About a week or two later, my would-be supervisor called me and invited me out for a campus interview. The campus interview lasted a full day, starting at 8 am and ending at about 5 pm. During the campus visit, I met one-on-one with quite a few different people, and I also did a presentation that lasted approximately 45 minutes.\r\n\r\nMy would-be supervisor was incredibly friendly, professional, and organized. I would have loved working for her because she demonstrated such high levels of professionalism. During my full-day campus interview, which was grueling, she made sure to schedule several small breaks for me so I could spend some time alone and recover a bit. Everyone I interacted with was very friendly and courteous. \r\n\r\nMy would-be supervisor called me approximately 3 weeks after my campus interview to let me know that they chose the other candidate. She apologized for taking so long to contact me -- she was incredibly friendly and professional throughout the entire process. I really appreciated the fact that she called me with the rejection, rather than just emailing me.", "Interview Questions": "How would you deal with parents who do not want students to attend a college that have high reported rates of rape?"}, {"date": "9 May 2016", "title": "Riley Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Colorado College (Colorado Springs, CO) in Jan 2015", "Interview Descriptions": "Four days of interviews with administrations, faculty, and students.  Presentation of research.  Met with the associate dean of faculty recruitment.  Met with the faculty in my prospective department.  Some of the faculty were very helpful in preparing me for meeting with the administration and aided in the negotiation which I thought was incredibly helpful.", "Interview Questions": "What community projects will you be interested in initiating?"}, {"date": "15 Mar 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Colorado College (Colorado Springs, CO) in Sept 2013", "Interview Descriptions": "Was interviewed by two supervisors. Very straightforward questions. Nothing too unexpected. Sent resume and expressed interest to the supervisors. After they narrowed down the applications they contacted a couple of the candidates for in person interviews. After a short waiting period, maybe a week, they let me know that I got the position.", "Interview Questions": "What kind of administrative experience do you have?"}, {"date": "27 Jul 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado College", "Interview Descriptions": "Lots of committee based hiring. People from divisions that have nothing to do with your job will be in the room. Generally there is a phone interview and then a sit down interview in front of the hiring committee where each committee member will ask a few questions. Try to be personable and get the room to laugh with you. Chances are, few of them will be professional interviewers or managers, so you may be able to work this to your advantage. The selection process will probably be long, 2 weeks or more.", "Interview Questions": "Women's and minority concerns will be addressed, and that is probably the toughest one. Be prepared, as there is usually someone from women's concerns on the committee. Most people do not have an answer because they don't want to sound as though they have a problem with diverse groups of people. It's tough to talk about in an interview because if you are not a minority or a woman, you feel like you're walking through a minefield."}, {"date": "3 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado College (Colorado Springs, CO) in May 2013", "Interview Descriptions": "I was asked about my interests. Dependent on that I was given the job. More than anything my employers wanted to know whether my personality would have fit into the current workplace culture. Luckily it did and the interview process was pretty quick. I was registered onto payroll by the next week. I was also", "Interview Questions": "Describe an event you would host to attract the diverse population of CC to our space."}, {"date": "31 Aug 2015", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado College (Colorado Springs, CO) in Feb 2012", "Interview Descriptions": "Pretty straightforward. Hand in an application, along with your resumer. You were contacted to set up an interview time. When you're invited for the interview, you are interviewed by the head librarian but are also introduced to other workers in the library. They show you around the library and see gauge your interest.", "Interview Questions": "Why are you interested in this position?"}, {"date": "21 Sept 2012", "title": "Career Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado College (Colorado Springs, CO) in Mar 2009", "Interview Descriptions": "Phone interview, personal interview, selection process", "Interview Questions": "Where do you see yourself in 5 years?"}]]