[[{"date": "7 Jun 2023", "title": "HR Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Central Arkansas (Conway, AR)", "Interview Descriptions": "Simple 2 step interview process. Phone call with the department then department interview with 4 or more established members of the team. Process was simple and straight forward. Took less than a few weeks.", "Interview Questions": "First Question: Tell me about yourself"}, {"date": "3 Mar 2021", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Central Arkansas", "Interview Descriptions": "First, I had a phone interview with the chair of the department. Next, I was invited to do a teaching demonstration and  an interview with the full search committee via Zoom. Finally, I was offered the job.", "Interview Questions": "Why do you want to work at UCA?"}, {"date": "1 Aug 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Central Arkansas", "Interview Descriptions": "It was a nice atmosphere, not intimidating at all. Interviewers were nice and made me feel comfortable.  It took about two weeks after I applied to receive an interview offer and another 2 weeks after the interview to hear back from the employer. I received the offer and accepted.", "Interview Questions": "What can you contribute to the company? "}, {"date": "18 Dec 2018", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Central Arkansas", "Interview Descriptions": "I’m just filling this out so I can get to see other information. Please disregard. It’s not impossible for y’all though I gotta was it the last day of my two", "Interview Questions": "Yeah I think so we are going"}, {"date": "13 Apr 2021", "title": "Center for Writing and Communication Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Central Arkansas (Conway, AR) in Feb 2017", "Interview Descriptions": "You can only interview for a job here if you are a student or graduate student. Overall, though, I thoroughly enjoyed the interview/recruiting process. I was able to represent myself well and ask plenty of questions about the position.", "Interview Questions": "What is your greatest accomplishment in writing?"}, {"date": "7 Apr 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Central Arkansas (Conway, AR) in Jan 2016", "Interview Descriptions": "The interview process involved a skype interview and on-campus visit. The skype interview was a few weeks after the application. About 2 weeks after the skype interview, they contacted me to let me know that they wanted to bring me to campus for an interview. The on-campus involved meeting with the key administrators in the college, HR, departmental faculty, and a presentation. The interview went well and at the end of the interview, they told me that they'd be making their decision and had very confident hopes of making an offer within the next two weeks. About a week later, they let me know that HR was requiring them to bring in another candidate for administrative purposes. I was continually assured I'd be getting an offer. After 4 weeks of waiting, I finally said that I needed to know. They told me that they'd offered to another candidate earlier in the week. The mixed messages were incredibly unprofessional.", "Interview Questions": "Would you be able to handle teaching 3 preps in one semester?"}, {"date": "20 Jul 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Central Arkansas (Conway, AR) in Jul 2015", "Interview Descriptions": "Pretty straight forward, I met with the head of the MBA's and he wanted to gauge my character more than anything else. Behavior questions were asked and small talk to see f I was a good fit for the work environment.", "Interview Questions": "Name a time you disagreed with a team member"}, {"date": "2 May 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Central Arkansas (Conway, AR) in Jul 2015", "Interview Descriptions": "Very low-key. I got the position through a former employee of UCA who sent my resume to the hiring department head. We corresponded over email and eventually had a face-to-face meeting, where we chatted and discussed the goals of the course and the department.", "Interview Questions": "They asked about my experience teaching college students, experience with the language I was teaching, textbooks, etc."}, {"date": "27 Nov 2013", "title": "Executive Assistant to the Advancement Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at University of Central Arkansas (Conway, AR) in Oct 2011", "Interview Descriptions": "The HR Dept on campus found me this position. The HR Director set up interview with the Advancement VP. It wasn't anything too detailed pretty simple and it worked out well. After the interview I received a call within 3 days or so offering the position to me.", "Interview Questions": "I did not feel there were any difficult or unexpected questions asked. The questions that were asked were regarding my previous work experience and how those experiences would help things run better at this office."}, {"date": "6 May 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Central Arkansas (Conway, AR) in May 2011", "Interview Descriptions": "Panel interview with mix of faculty and staff. Pleasant and welcoming.  Took about an hour and a half. Interview was half questions and half tour of the building and meeting some of the graduate students and other faculty.", "Interview Questions": "How woul you deal with crying students and helicopter parents?"}], [{"date": "5 May 2022", "title": "Security Guard Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sacred Heart University", "Interview Descriptions": "What appeals to you most about this position?\nDo you have any similar work experience?\nHow would your friends describe you?\nHave you ever had to intervene in a physical conflict?", "Interview Questions": "Tell me little about yourself"}, {"date": "14 Jan 2021", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sacred Heart University", "Interview Descriptions": "Had a great experience. People are friendly, campus is pretty. Overall the interview was easy, standard questions. Nothing too difficult. I do not think you need to really prepare too much for an interview in my opinion.", "Interview Questions": "Tell me about yourself etc"}, {"date": "13 Oct 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sacred Heart University (Fairfield, CT) in Jan 2021", "Interview Descriptions": "Very hands on, was able to voice my options on events and many of my ideas were used. Pay was good and was provided a very good work environment. Everyone is understanding and built a connection with everyone I work with", "Interview Questions": "One of your biggest accomplishments"}, {"date": "30 Jan 2019", "title": "AP Spanish TEACHER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sacred Heart University (Columbus, OH) in Jan 2019", "Interview Descriptions": "Interviewer asked me questions.Asked about content, methods of teaching; about myself, what did I like to do when I was not teaching, How did I handle situations: WHAT IF THE STUDENT OR A PARENT MENTIONS TO YOU THAT IS NOT THE WAY THEY SPEAK. AN INTERVIEWER WAS ON THE SCREEN. SAID HELLO.  EXPLAINED HOW THE INTERVIEW WAS GOING TO BE.", "Interview Questions": "Read this passage and tell me what grade you would give to it. Difficult because I had forgotten to review  the grading system."}, {"date": "18 Sept 2018", "title": "JWCOB Assistant Director Student Experience Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sacred Heart University (Fairfield, CT) in Aug 2018", "Interview Descriptions": "Applied online. Phone Interview with Director who asked many questions that pertained to the job. In-person Interview with Dean & Asst. Dean but was very quick. They didn't seem interested in the interview and made it seem as though they already  picked someone. No follow up after the interview and didn't receive a rejection letter/email.", "Interview Questions": "Why do you want to work in this position?"}, {"date": "16 Sept 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sacred Heart University (Fairfield, CT) in Aug 2018", "Interview Descriptions": "It was on time, 5 interviewers, lasted approximately 30 min. Nice experience,  I made a mistake at the end and didn’t get the job. They notified me via email they selected someone else.", "Interview Questions": "Tell us your strengths and weaknesses\r\nWhat would you do if a person calls you and is really upset\r\nWhat would your co-workers say about you\r\nWhy did you apply to this job\r\nWhat are you looking in a new job that you didn’t “have” in your previous employment "}, {"date": "21 Jan 2020", "title": "Technical Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Sacred Heart University (Fairfield, CT) in Aug 2018", "Interview Descriptions": "1:1 in-person meeting. They asked basic technical questions regarding how I go about troubleshooting and solving problems. Some questions related to customer service abilities. The interview is a process where they are looking to see if you are a social and kind individual capable of problem solving.", "Interview Questions": "They asked basic technical questions regarding how I go about troubleshooting and solving problems."}, {"date": "31 Jul 2019", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 days. I interviewed at Sacred Heart University (Fairfield, CT) in May 2018", "Interview Descriptions": "Met with department heads and staff in a group interview. Was given a tour of the campus and met with different offices. The process overall was a few days but took time to schedule.", "Interview Questions": "If given the role how would you be able to handle your work, life, school balance?"}, {"date": "22 Jul 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Sacred Heart University (Fairfield, CT) in Nov 2015", "Interview Descriptions": "It is an easy process. You meet with several people who ask a lot of behavioral questions. They ask about you, your work with past employers. How you would handle confidential information, they tell you students come first which is not true, to them the tuition money is what is most important", "Interview Questions": "What is one thing you would change about yourself and why?"}, {"date": "18 Nov 2014", "title": "Business Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Sacred Heart University", "Interview Descriptions": "I met with the full office team and had a basic conversation about computer skills, attention to detail, etc.  Nothing too challenging, and overall a very positive experience.  All the team members were very open and upfront about the job requirements and expectations.  The whole process took only a few hours, and then received an offer later that week.", "Interview Questions": "N/A"}], [{"date": "17 Mar 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sacred Heart University", "Interview Descriptions": "Two interviews. Both in person but with different staff members.", "Interview Questions": "Nothing unexpected. Not experienced interviewers."}, {"date": "15 Mar 2014", "title": "Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Sacred Heart University", "Interview Descriptions": "Was very quick and to the point.", "Interview Questions": "Know your tech items!"}, {"date": "5 Aug 2015", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sacred Heart University (Fairfield, CT) in Mar 2014", "Interview Descriptions": "Friendly, thoughtful interview conducted by supervisor.   Genuinely seemed interested in my background and ideas.  I was given an opportunity to discuss how I would like to construct my class and what I would bring to the learning environment.", "Interview Questions": "How did my education contribute to my educational philosophy and curriculum design?"}, {"date": "16 Feb 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Sacred Heart University (Fairfield, CT) in Jan 2014", "Interview Descriptions": "Quick interview with department head. Interview also included the ability to explain past lecture powerpoints and answer questions on material. The follow-up was immediate regarding how I did during the interview and the job was offered then.", "Interview Questions": "Comfort speaking to large groups."}, {"date": "1 Oct 2013", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sacred Heart University", "Interview Descriptions": "Quick and good", "Interview Questions": "All were reasonable."}, {"date": "8 Jul 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Sacred Heart University (Fairfield, CT) in Jun 2013", "Interview Descriptions": "I had applied for full-time position at SHU as per a job posting in www.indeed.com. I directly contacted the head of the department (with my CV) and asked him if I could teach as full time. However, he said that I was not a perfect match for the full-time position but he could consider me for an adjunct for the time being till a matching position comes up. He called me for a 1:1 interview, asked me about my researcgh, experiences in teaching and research and finally offered me the position after a week.", "Interview Questions": "N/A"}, {"date": "29 Jul 2014", "title": "Assistant Professor, Management Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sacred Heart University in Mar 2013", "Interview Descriptions": "Vitae submitted to a search committee, followed by interviews with the committee, dean of business school, and provost. Need to do a research presentation and have to teach in a classroom setting in front of  a search committee member if there is no established record of teaching ability through student evaluations", "Interview Questions": "How your research area overlaps with Catholic intellect"}, {"date": "10 Apr 2013", "title": "Senior Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sacred Heart University (Fairfield, CT) in May 2009", "Interview Descriptions": "Applied through the university's website. Got a phone call to schedule an interview early in the morning. I was interviewed by the hiring manager and he gave me a short SQL test: left/right joins, pivot tables and select records from one table that do not exist in the other.\r\n\r\nIf you had a good interview with the hiring manager, you get to be interview by the IT director which basically goes over your resume with no technical questions. After this interview, if they believe you're a potential candidate you will be interview by the VP of Information Technology.", "Interview Questions": "How to select all records from one tables that don't exist in another?"}]]