[[{"date": "N/A", "title": "Patient Safety Companion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA) in May 2022", "Interview Descriptions": "Great experience. Manager was very nice! \nEasy and made me feel comfortable. \nAnswered all my questions and explained the job position thoroughly. \nA great interview experience indeed. Would recommend setting one up to anyone if interested in healthcare", "Interview Questions": "What was one challenging situation you dealt with at your previous job? How did you handle it? \nTell me about yourself. "}, {"date": "26 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn State Health", "Interview Descriptions": "I was contacted by a recruiter to set up an interview. The date was set and I arrived. I was greeted by a manager who led me to an office where another manager and nurse educator were waiting. I sat down with them for about an hour. It went well and they were all friendly and welcoming.", "Interview Questions": "What is one thing that you're concerned about coming into the ED?"}, {"date": "10 May 2022", "title": "Buisness Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health", "Interview Descriptions": "A number of interviews and needed to follow up often as they were disorganized at the time.\r\nThe process took over three months.\r\nIt was between me and one other person at the end but I got another offer in the meantime.", "Interview Questions": "normal questions were asked during the interview."}, {"date": "19 Oct 2022", "title": "Sr Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn State Health in May 2022", "Interview Descriptions": "Multiple hours-long interviews with different layers of management. Repeat personality questions with not a great look into tech stack. After devoting all this time to the process, and providing 5 positive references asked of me, I was completely ghosted by recruitment. Probably the most unprofessional interview process I've been a part of.", "Interview Questions": "How do you handle conflict within your team"}, {"date": "22 Feb 2022", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn State Health", "Interview Descriptions": "You were asked to put top choices for unit then they sent your information to those units. Afterward you received back what interviews you got. Separate interviews for each unit.", "Interview Questions": "Most questions were scenario based"}, {"date": "10 Feb 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health in Feb 2022", "Interview Descriptions": "Very professional during the interview and asked very important questions to get a better understanding of the person personality, experience, and overall first impression. I was very please and felt comfortable.", "Interview Questions": "What experience do you have related to this position?"}, {"date": "2 Mar 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health in Jan 2022", "Interview Descriptions": "Recruter send out email to schedule phone interview.  She/he called that day and asked questions, told me about the position and what to expect.  The interview took 15min.  After she was done, she let me know what would happen next and asked if I had any questions.", "Interview Questions": "What skills do you posses that will help you in this posotion?"}, {"date": "28 Nov 2021", "title": "Vice President Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at Penn State Health (Hershey, PA) in Oct 2021", "Interview Descriptions": "13 individual 1-hour interviews over the course of 3 months - same questions asked again and again - zero feedback along the way - recruiters ignore candidate after the first interview", "Interview Questions": "What would You do first?"}, {"date": "9 Feb 2022", "title": "Regional Safety Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA) in Oct 2021", "Interview Descriptions": "Initially completed a phone screen.  After phone screen, completed a p hone interview with hiring manager.  Last step in the process was an in person interview.  Revenue check was requested prior to offer, which seemed odd to me.", "Interview Questions": "Please provide summary of background experience. "}, {"date": "20 Sept 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Penn State Health", "Interview Descriptions": "Managers were always extremely friendly and want to see you succeed. They are interested if you are pursuing further education and will make you feel comfortable from the start. I felt supported even through a phone interview.", "Interview Questions": "Why are you interested in this particular unit?"}], [{"date": "29 Jul 2021", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Penn State Health (Penn, PA) in Jul 2021", "Interview Descriptions": "It went smoothly,  very informative. they will ask great questions pertaining to you and what you bring to the company. Overall it was a great interview and would recommend anyone to to work for them", "Interview Questions": "what are your strengths and weaknesses "}, {"date": "12 Apr 2021", "title": "Health Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA) in Mar 2021", "Interview Descriptions": "Interviewed on ZOOM with entire staff. The process was fun and informative. Easy to log on. Great staff. The questions were fun. They explained the entire job which was more general in the job description. Got notice I didn't get the job via email unfortunately.", "Interview Questions": "What presentation could you do for 30 minutes with minimal preperation?"}, {"date": "5 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Penn State Health", "Interview Descriptions": "Three-step process. Met with both management and several clinical members. The questions and discussions varied from both personal questions to in-depth discussions of clinical scenarios and background. Overall it was a fairly straightforward process, nothing unusual or unexpected.", "Interview Questions": "Why do you want to leave your current health system and join Penn State Health "}, {"date": "8 Feb 2021", "title": "IT Security Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Pen Argyl, PA) in Feb 2021", "Interview Descriptions": "I got an email for times and then it was a video interview with the manager and engineer. It lasted about 30 minutes. After which they do not  give a response.", "Interview Questions": "How would you go about x?"}, {"date": "3 Mar 2021", "title": "IT Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Penn State Health (Mechanicsburg, PA) in Feb 2021", "Interview Descriptions": "Application submitted end of January.  Interview was middle of February with other IT managers and Director of department.  Following week requested to provide references from HR.  No communication or offer now in 1st week of March.  Interview method was situational based.", "Interview Questions": "What is the percentage you coach staff, delegate to staff and be hands on?"}, {"date": "2 Mar 2021", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA) in Jan 2021", "Interview Descriptions": "I had a 30 min call with recruiter.  It was a pretty typical STAR interview. Recruiter was very polite and listened.   Questions were not very difficult, but very cookie cutter.", "Interview Questions": "What area of HR do you enjoy the most?"}, {"date": "9 Nov 2020", "title": "Cyber Security Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Penn State Health (Hershey, PA) in Oct 2020", "Interview Descriptions": "Multilayered and timely. Great hiring best practices. Interviews were completed in timely fashion. There were multiple staff members that participated. Each interview allowed you exposure to higher level team members..", "Interview Questions": "Very task oriented  and position specific."}, {"date": "30 Sept 2020", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health", "Interview Descriptions": "Very straightforward. A lot of behavioral questions which is expected. The nurses were really nice and answered any questions I had. The whole process of applying, interviewing, getting an offer takes around 1 month.", "Interview Questions": "Tell us about yourself, why this unit, etc. "}, {"date": "1 Oct 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA)", "Interview Descriptions": "Met with several faculty, administration and office manager all in the same interview day but in 3 separate settings. I had to wait in between until attendings were available to meet with me. The interview went fairly smoothly and I was offered the job.", "Interview Questions": "N/A"}, {"date": "26 Sept 2019", "title": "Office Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn State Health", "Interview Descriptions": "Received phone call then had in person interview that was quick and easy. They asked simple questions that are normally asked at interviews. Strengths and weaknesses why you want to work for the company. What you like about your previous job", "Interview Questions": "What are your strengths and weaknesses "}], [{"date": "17 Apr 2019", "title": "Human Research Technologist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health", "Interview Descriptions": "Initial phone interview followed up by an in-person/Skype interview. Met with every person of the research team with each of them having individual questions. Asked about previous research experience and how you could apply it to this position.", "Interview Questions": "What separates you from other candidates applying to this role?"}, {"date": "22 Nov 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn State Health (Hershey, PA) in Sept 2018", "Interview Descriptions": "Unprofessional interview process -- very obviously placed low priority and emphasis on the internship scheme. Asked vague questions and didn't provide concrete details about the expectations of the job. Too broad.", "Interview Questions": "Reason for pursuing an internship at Hershey vs. other organizations/other professional roles."}, {"date": "13 Apr 2021", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn State Health in Sept 2018", "Interview Descriptions": "The interview process was straightword. They asked me if I would be able to perform the duties required for the job. They gave me info onto where I submit the reference letters.", "Interview Questions": "Would you be able to perform the duties related to job?"}, {"date": "22 Aug 2018", "title": "Environmental Health and Safety Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Penn State Health (New York, NY) in Aug 2018", "Interview Descriptions": "I was invited to a group session to learn about position, qualifications, etc.  And then had an interview afterwards. I later recieved emails to complete a \"checkster\" background check where you needed 4 business references to complete a questionnaire. Kind of asking alot of ppl to do this. After completed I waited and a few days later I recieved a voicemail from HR wanting to update me. I have a bad feeling about it. Called back and no answer. So just waiting now.", "Interview Questions": "I provided the interviewing team with my resume, which I was the only candidate that did this. Was asked if I have my diploma, which I responded that yes I do. Asked me if I have transportation,  etc."}, {"date": "3 Jul 2018", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at Penn State Health (Hershey, PA)", "Interview Descriptions": "Submitted online application, within 1 week heard back for telephone interview. After telephone interview, which was generic personality questions, it took about 2 weeks to hear back for an in-person interview. The in-person interview was conducted by 6 employees of the respiratory management team. They asked more job related and patient scenario questions. Two weeks after the in-person interview I was called and offered a position.", "Interview Questions": "Tell me what you know about Penn State Hershey Medical Center."}, {"date": "9 Feb 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Penn State Health in Mar 2018", "Interview Descriptions": "Multiple interviews needed both virtual and in person with single interviewer and panel interviewers. Process is slow. Questions are a combination of technical and soft skills questions. They do a lot of temp to hire positions though contract employers.", "Interview Questions": "What are areas that you feel you need to improve?"}, {"date": "31 Oct 2022", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA) in Mar 2018", "Interview Descriptions": "It was quick very quick. I had actually applied after college graduation but never heard back from the hospital that was my top choice. I thought applying for another position I was applicable for would help me get my foot in the door with hopes of internally transferring to the job I wanted.", "Interview Questions": "When can you start. Next week?"}, {"date": "17 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn State Health (Hershey, PA) in Jan 2018", "Interview Descriptions": "I participated in the nurse residency program right out of school. The interview process was interesting because I interviewed and shadowed with multiple units. I interviewed with about 2-4 people per interview.  Everyone was friendly. I liked that I was able to shadow a nurse for 30 minutes to an hour after each interview because it gave me a better feel for the unit.", "Interview Questions": "How would you handle certain situations in which you felt ethics might need to be involved? \r\nWhat do you think is your biggest weakness and biggest strength?"}, {"date": "9 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Penn State Health in Aug 2017", "Interview Descriptions": "The Nurse Manager had a list of general interview questions that he asked, while recording some answers. Basic questions like favorite clinical, weaknesses, why become a nurse, why hershey, interests, etc.", "Interview Questions": "Why did you choose to become a nurse?"}, {"date": "13 Dec 2017", "title": "Finance and Revenue Cycle Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Penn State Health (Hershey, PA) in Jun 2017", "Interview Descriptions": "Attended an interview a few weeks prior to the start of the internship, where I met with two company executives. Overall atmosphere was relaxed yet professional. Questions ranged from my college education to greatest strengths.", "Interview Questions": "How would you say your experiences in the classroom can translate to this specific job?"}], [{"date": "4 Mar 2017", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn State Health (Hershey, PA) in Mar 2017", "Interview Descriptions": "Interviewed on three different units. First was an hour and 10 minutes long, second and third were a half hour or less. Interviewed with the nurse manager of the floor, had the opportunity to tour the unit and shadow an RN for a little bit. They all asked basic questions- name your strengths and weaknesses, name a time you had a misunderstanding with a coworker or patient and how you resolved, name a time you made a mistake and corrected it, name some things you need to work on as a new grad nurse, why you want to work at hershey, why you want to be a nurse, etc. Pretty laid back interviews.", "Interview Questions": "Describe a time you had a misunderstanding with a patient or a coworker"}, {"date": "12 Jul 2017", "title": "LMS Trainer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health in Feb 2017", "Interview Descriptions": "First round interviews were with the head of the department where she asked 10-20 questions based on your experience, if you are selected you come in for a second round interview where you teach a lesson", "Interview Questions": "Describe the process for creating curriculum."}, {"date": "23 Apr 2017", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Reading, PA) in Jan 2017", "Interview Descriptions": "Hiring is done through the department manager and HR.  HR selects the qualified candidates and the department manager chooses from the qualified candidates.  It takes months for the process to be completed.", "Interview Questions": "What is one of my weaknesses?"}, {"date": "12 Sept 2016", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn State Health (Reading, PA)", "Interview Descriptions": "I applied online and 3-4 weeks later got a call asking for an interview. After my interview someone from HR called and asked for references and a copy of my GED.", "Interview Questions": "What do you know about us?"}, {"date": "30 Jul 2016", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn State Health", "Interview Descriptions": "Applied online. Recruiter scheduled and conducted phone interview. Then panel interview which consisted of personality type questions, then knowledge based questions, then finally a tour of the unit you may be hired for. Be prepared for a written \"test\" before the interview.", "Interview Questions": "Think of a time you made a mistake. How did you deal with it?"}, {"date": "16 May 2018", "title": "Technical Lab Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Penn State Health (Hershey, PA) in Jul 2016", "Interview Descriptions": "Applied online, and shortly thereafter received a call for an in person interview.  Following the on site interview, I received a job offer. It was a very easy interview process, and the questions were not overly difficult.", "Interview Questions": "Would you let your supervisor know if one of your coworkers was not abiding by SOP? How would you address this situation?"}, {"date": "5 Feb 2020", "title": "Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn State Health (Milton, PA) in Jul 2016", "Interview Descriptions": "they asked me about past employment, why i was currently out of work, about my education, and about my personal values when being a member of a team.  I felt that they were very open and honest up front", "Interview Questions": "How did you find us?"}, {"date": "16 Aug 2017", "title": "Lead Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA) in Jun 2016", "Interview Descriptions": "Asked about experiences, as well as how you would better the call center. Looked for areas of opportunity to better the call board. I'd been in an interim role before moving into the position so I already knew the work and processes they were looking for. Showed examples of how I helped better the call center", "Interview Questions": "Where is an area of weakness in the call center and what could you do to improve this? "}, {"date": "29 Mar 2017", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Penn State Health in Feb 2016", "Interview Descriptions": "2 phone interviews, 1 with the manager and 1 with the rest of the team members, very long and so much details required, compared to the actual job you will be doing", "Interview Questions": "all behavioral questionnaires, details past experiences"}, {"date": "3 Feb 2016", "title": "Departmental Manager Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn State Health (Hershey, PA) in Jan 2016", "Interview Descriptions": "Each department has individual testing and interview processes.  Each Department will have a range from written tests to hands on testing to show developmental skills.  Also will encourage phone interview due to out of state candidates.", "Interview Questions": "Why would should we hire you?"}], [{"date": "24 Sept 2016", "title": "Audiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Penn State Health in Jan 2016", "Interview Descriptions": "Two interviews: one on the phone and one in person. Phone interview was pretty informal, with generic questions. The in person interview mainly consisted of talking what you are comfortable with and what you have experience with.", "Interview Questions": "How much experience do you have with (insert test here)?"}, {"date": "6 Nov 2015", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn State Health (Hershey, PA)", "Interview Descriptions": "Took 2 months to get an interview then several weeks before I received a call for a face-to-face.  Offer came about 2 weeks after face-to-face. I took the job offer.", "Interview Questions": "Tell me about yourself"}, {"date": "24 Oct 2018", "title": "MOA I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Penn State Health (Hershey, PA) in Aug 2015", "Interview Descriptions": "One interview with 9 different offices at a time, then one one-on-one interview. The group interview was very stressful, but looking back i had the opportunity to get hired 9 times. Which I did. So that's a plus.", "Interview Questions": "N/A"}, {"date": "10 Jun 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Penn State Health (Hershey, PA)", "Interview Descriptions": "disorganized.  after joining the organization I recognized that I did not interview with important and relevant stakeholders to my position.  This made it difficult to be effective initially as it was even more challenging to connect with the proper employees.  It also created confusion as to who is responsible for what.\r\n\r\nThe interview process itself was easy.  I was brought in for a series of interviews, a mixture of 1:1 and group sessions.  There were no hardball questions - focus was on past experience and education, as well as any concerns/issues with shared background.  No case-style questions or presentations required.\r\n\r\nThere was one group session that last approximately 1 hours - in a group of 6 interviewers, I spoke for only 5 minutes out the entire meeting, as interviewers lost focus and chatted amongst themselves.  I had to force myself into the conversations so as to not be lost in the disorganization.", "Interview Questions": "Why an academic medical center?"}, {"date": "31 May 2015", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn State Health", "Interview Descriptions": "First contact was an email from the manager. I had a phone interview and an in person interview. The questions were straightforward with a test on MRI physics. The HR part involves fingerprinting and a physical that involves more lifting than any other job I have applied. I had to interview with 3 different managers. There were no physicians involved. In my other job interviews there were physicians involved.", "Interview Questions": "What is your strongest and weakest suits in relation to the job?\r\nDo you mind working overtime?\r\nDo you have problems working in a situation of being behind schedule?"}, {"date": "17 Nov 2014", "title": "Medical Office Associate Training Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Penn State Health in Oct 2014", "Interview Descriptions": "Was contacted to come for a meet and greet where they explained about the opportunity. Then had a typing test which wasn't explained about before completing. After the meet and greet session, then had a \"rapid\" interview. Was contacted for a second interview with a panel. Overall the interviews were not very personal and it seemed like they really didn't care about your schooling, precious work experiences, or background in the field. They didn't really care about getting to know how qualified an individual was, they were just interested in looking for a pretty face. Also, reference checks were not personal. They were completed by email which was a pain due to references not having access to computers in the time frame available. (48 hours)", "Interview Questions": "N/A"}, {"date": "20 Apr 2014", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn State Health", "Interview Descriptions": "Written exam similar to CPhT exam. Maybe two rounds of interview. One from the Pharmacy manager, and second  with Operation Manager and small group. Very easy process.", "Interview Questions": "N/A"}, {"date": "25 Feb 2014", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Penn State Health", "Interview Descriptions": "Initial communication via online application; asked to submit behavior assessment survey; Drug testing; 4-5 references were sent link to submit their opinion by deadlines(1 month); Review of references; got a phone call about offer; sent by email first", "Interview Questions": "Describe a situation where your experienced coworkers not helping"}, {"date": "5 Aug 2014", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn State Health in Nov 2012", "Interview Descriptions": "Initial communication was by phone to set up an interview date and time. Met with department manager for a 30 minute interview and then met with 4 other managers in the department for about another 30 minutes.  The group went around the table asking questions about experience and technical ability.", "Interview Questions": "The most difficult question for me was what I dislike about my current employer and why I want to leave."}, {"date": "9 Jul 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Penn State Health (Hershey, PA) in Sept 2011", "Interview Descriptions": "I was contacted the day after I submitted my on-line application.  Then a 1:1 interview. Then background check and review of references", "Interview Questions": "What makes a good working environment"}]]