[[{"date": "31 Jan 2023", "title": "Assessment Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England) in Dec 2022", "Interview Descriptions": "15 minute written exercise on prioritising tasks, prep time for a role play activity where you have to call a client and advise them on their next steps. Competency based interview questions, specific examples required.", "Interview Questions": "Can you tell me about a time you received negative feedback and how you handled it? Can you tell me about a time you had to confront someone in the workplace about a diversity/inclusion matter?"}, {"date": "18 Nov 2022", "title": "Hub Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England) in Oct 2022", "Interview Descriptions": "They asked about 10 questions in the format of \"when were you in an X situation and what did you do\". I find that process was very stressful especially because there were three interviewers in the room with me. Only one question did not follow that format. For me personally at least, it is very difficult to remember so many scenarios from your past in just a few minutes. The interview process also contained a written assignment which I did not mind. But, overall I think the difficulty of the interview was unreasonable considering the relatively low pay of the role. I think the interview did not give me the opportunity to give best of myself at all and I can imagine it is the same for a lot of people.", "Interview Questions": "A lot of questions in the format of \"when were you in an X situation and what did you do\"? The only different type of question was why I wanted the job."}, {"date": "25 Aug 2022", "title": "Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St Mungo's (Bristol, England) in Aug 2022", "Interview Descriptions": "My general experience with St. Mungo's Bristol, was very negative one. I myself have learning difficulties, i made the company extra aware of this. They said they would give me an extra 15 minutes on assesment,  which was fine but still not great. I asked if I could type my answers rather than write and I recieved no answer back. The lack of communication was worrying to start with. \r\n\r\nI was placed into a room where I had to complete three assements where they were all writing based. I don't have the best writing or grammar, due to my disability I can struggle. I was stopped 15 minutes earlier, before my allocated time and made to hurry. These were also all unpaid. I also did a role play with two managers, the two people were very nice if slightly uninterestes.\r\n\r\nAs the previous candidate said 'The whole experience left a bad taste in my mouth' and i feel that is justified and the perfect summary. I took time out my busy schedule with the NHS to attend the interview, and my NHS management were great in placating this. It seemed to be one 'generic one size fits all' assement for everyone, which I think is wrong. I think the procedure was ableist if not slightly out dated. Everyone has different skill sets, regardless of how you communicate in writing or typing.  \r\n\r\nThis whole experience has taught me a invaluable lesson though. That is to not have anything similar to this recruitment process when I start my own charity.", "Interview Questions": "Have you had to deal with challanges situations"}, {"date": "27 Jun 2022", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St Mungo's", "Interview Descriptions": "The staff at the centre were friendly and welcoming and I was interviewed by two people- one of them would be the line manager of the role for the interview. \r\n\r\nFirst I answered standard competency and culture questions and then we moved on to a roleplay conversation that would be with a volunteer. \r\n\r\nThe interview ended with some competency activities to complete, including designing a prospective volunteer timetable using Excel.", "Interview Questions": "Explain a time when you've challenged a senior that you didn't agree with. "}, {"date": "6 Jun 2022", "title": "Night Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St Mungo's", "Interview Descriptions": "was straightforward, they give you a task to complete before interview and you have 45 minutes to complete before you then go for the interview where you have to perform a role play activity", "Interview Questions": "give an example of when you have managed to work well under pressure"}, {"date": "10 Mar 2022", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St Mungo's in Feb 2022", "Interview Descriptions": "Very very nice interviewers who were welcoming and were reassuring when it came to the role play aspect, it was my first time doing this interview task and they were very welcoming.", "Interview Questions": "What are you career goals and how will this position help you reach that point?"}, {"date": "15 Dec 2021", "title": "Resourcing Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St Mungo's (London, England) in Dec 2021", "Interview Descriptions": "Interview consisted of 3 stages, a test, role play, then interview. All were related to the role applied for. \nThere was enough time for each stage. Information and instructions were clear. I actually like this method\nAlthough I did not get the role I found the whole experience  a positive one. The role play gets you thinking! I was especially grateful for the feedback I received.\nThe whole process took place  online.\n\n I experienced some technical difficulties on my side when  it came to sending the work.  I would advise  to make sure to leave enough time during the test to send any work just in case you experience any issues.\n\nMy advice to future applicants use the job description, and person specification to prepare. When answering your questions be specific.\nBe confident.\nRemember, even if you are not successful there is always something to be learned.", "Interview Questions": "Competency based questions. Read job description  and person specification to get an idea of questions that could be asked.\n\n"}, {"date": "24 Dec 2021", "title": "Caseworker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (Bristol, England) in Dec 2021", "Interview Descriptions": "Very lengthy and intensive interview process including case study, role play and interview consisting of competency based questions surrounding role duties. Extremely competitive in comparison to the salary. Interviewers we’re friendly for the most part however I found that they are more interested in how you can serve them rather than trying to tell you more about the role or organisation.", "Interview Questions": "Describe a time where you dealt with a difficult client.\r\n\r\nEnsure you are knowledgable on legislation for knowledge based questions."}, {"date": "24 Nov 2021", "title": "Community and Events Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England) in Nov 2021", "Interview Descriptions": "Very draining. We had to do a verbal and numerical test before hand, prepare a presentation, do an interview task 45mins and then an actual interview. Put me off working there", "Interview Questions": "Why would you like to work here?\n\nUsing initiative \n\nHow do your skills match the role?\n\n"}, {"date": "16 Sept 2021", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at St Mungo's (London, England)", "Interview Descriptions": "Very arduous and long. Waited 3 months roughly to start as the process took a very long time. The interview was very vigorous but most of the time they end up hiring incompetent people, so I'm not sure why the interview process has to be so tough if they end up hiring the wrong people.", "Interview Questions": "1. Describe a time when you received negative feedback and how did you deal with it? \n2. Describe a time when you were in a team and displayed teamwork "}], [{"date": "17 Sept 2021", "title": "Policy Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St Mungo's (London, England) in Sept 2021", "Interview Descriptions": "Applied online and was invited to an online interview. You have to complete two online assessments ahead of time which seems odd and was slightly off-putting. Make sure you are prepared before you take these assessments.\n\nThe interview started off with a task of drafting a letter to an MP, then a 15-minute role-play of a persuasive discussion with said MP, followed by a formal interview w/ panel. Each section was relatively challenging as there is very little you can do to prepare ahead of time. \n\nThe interview panel is much less competency-based and consists of questions where you need to demonstrate that you did something within the policy sphere. Be prepared and have a lot of examples where you accomplished results.\n\nThe interview panel was cordial but not 'chatty' as there was no small talk or any time for informal discussion. Full interview lasted about 2 hours.", "Interview Questions": "Describe a time where you were able to bring multiple partners into a policy intervention"}, {"date": "8 Aug 2021", "title": "Assessment and Reconnection Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St Mungo's", "Interview Descriptions": "The interview process is very intense. You complete pre-interview reasoning tests. Then the interview is made up of three parts - a written test, a roleplay, and a series of interview questions. It is a very intensive process but I appreciated the difficulty as it meant a lot more when I got the job offers.", "Interview Questions": "Generally they asked questions like \"name a time when you've shown ___\" or \"give us an example of a time when you've demonstrated __\" and they expect you to answer in STAR format. "}, {"date": "1 Jul 2021", "title": "Charity Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at St Mungo's (London, England) in Jul 2021", "Interview Descriptions": "Group interview with other potential candidates and the recruiter. Informal interview, more like a friendly chat, but require knowledge on the charity and its cause. Asked to do a sample pitch, as roleplay interacting with the recruiter.", "Interview Questions": "What characters are necessary to be successful at the role."}, {"date": "3 Aug 2021", "title": "Night Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St Mungo's (London, England) in Jul 2021", "Interview Descriptions": "Prior to apply I read a review here when someone explained how she felt humiliated during the recruitment process. It just happened to me. Nobody humiliates me especially not a \"support worker\" who spent 16 years in the homeless sector. She managed to destabilize me and I nearly cried during the interview but I kept going and that is my victory. I also asked them to remove me from what they called \"Talent pool\" Here is message from HR \"...There were a number of strong candidates who interviewed for the role and unfortunately you were not selected for this role. However the panel have identified that your interview and assessment were strong and that you are appointable at a Night Worker level at St Mungo’s.\n\nFor this reason we would like to offer you the opportunity to join our talent pool for similar roles.\" Well no thanks but not interested.  I'm 45 years old and I never been humiliated in an interview. I have experienced homelessness and got a job while sleeping at the airport a few years back. I had three interviews to get that job working at the concierge desk in a 5 star hostel.  I remember how my support worker at the time was looking at me with a meaning \"poor boy, you dream\" when I was telling her I will get the job. That interviewer at St Mungo's reminded me so much of that support worker.", "Interview Questions": "Why do you want to work for St Mungo's?"}, {"date": "17 Feb 2021", "title": "Family Support Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at St Mungo's", "Interview Descriptions": "long interview process. completed a test first, then timed multiple-choice assessment, followed by a timed assessment on the day before the interview, the interview consisted of a role play and then some competency-based questions.", "Interview Questions": "tell me a time when you had to balance several tasks"}, {"date": "3 Feb 2021", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at St Mungo's", "Interview Descriptions": "It was fine. I enjoyed it. Staff was nice. They included a service user to interview me and they were nicer alson./  No issues at all.  I would say that you should do your research .", "Interview Questions": "I was not asked anything. I am only answering this for access"}, {"date": "30 Jan 2021", "title": "Assistant Campaigner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at St Mungo's", "Interview Descriptions": "I had to submit a cover letter and a CV and then had two interviews. I also had to do a task which was writing campaign emails. They were friendly.", "Interview Questions": "Who is your favourite campaigner and why"}, {"date": "3 Dec 2020", "title": "Shift Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's in Nov 2020", "Interview Descriptions": "I was required to take an online verbal reasoning test prior to the interview. This consisted of a English based test (reading a script and answering Q's) then a math test which was fairly basic. They say it does not affect your scoring and seemed really pointless.\r\n\r\nThe interview process was 2 hours!! I had to do a written tasks where I wrote an email to a customer and then prepare for a role play. I then joined the call for the interview. We started off with the role play where one of the interviewers acted as the customer and I was a member of staff. This was fairly straightforward but I can imagine doing this in person would be off putting. This was followed by a set of questions on how I found the role play and whether I would change anything. I then had the panel interview which consisted of all competency based questions so again not too challenging. \r\n\r\nThe panel seemed very friendly, slightly unprofessional at times and I can imagine if I was interviewing in person as opposed to over video call I would have felt a bit uncomfortable. They kept making jokes when each other messed up.  I did not get the job and was told I would receive feedback a week after hearing the outcome which I find very strange, alas I wait.", "Interview Questions": "Why do you want to work for us and in this role?"}, {"date": "16 Feb 2021", "title": "Repairs Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St Mungo's (London, England) in Oct 2020", "Interview Descriptions": "The process included a verbal reasoning test, a written test, a role-play and a panel interview. The interview process was intensive and I had to wait almost three weeks for the result, no feedback was given despite my requests.", "Interview Questions": "What was a constructive critique that a colleague gave you and how did you respond?"}, {"date": "18 Sept 2020", "title": "Senior Case Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St Mungo's", "Interview Descriptions": "Verbal reasoning, 45 minute test made up of two stages (first a 30 minute test based on ability to rank 7 situations in terms of importance to being dealt with, second a case study and how you would approach it),  15 minute role play, 45 minute interview", "Interview Questions": "7/8 questions about suitability for the role in the interview. Questions listed by others"}], [{"date": "13 Aug 2020", "title": "Support Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St Mungo's", "Interview Descriptions": "45 minutes to do two written assessments, one which involved writing a formal letter on behalf of a client, the other was ranking a list of tasks in order or priority. 15 minutes to prepare for a role play. 10 minute role play followed by an interview", "Interview Questions": "When was a time where you stood up opposing inequality or discrimination?"}, {"date": "10 Aug 2020", "title": "Project Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St Mungo's (London, England) in Jul 2020", "Interview Descriptions": "I interviewed for the Street Legal Team and I am yet to hear back even though the interview was over a month ago. I can obviously take the hint and guess I haven’t been successful on this occasion but I find it very unprofessional to not let a candidate know, even after 2 follow up emails. \r\n\r\nThe interview was average in terms of difficulty. First you do a verbal reasoning test prior to the interview which was much easier than the ones I had practiced online, simply picking true or false rather than having a ‘cannot say’ option for each text. \r\n\r\nNext there is the written test which again was easier than the ones I had practiced. First was writing a formal letter on behalf of a client requesting that their debt to the NHS for medical care be reduced or wiped as the individual is homeless and non uk National so no recourse to public funds. Next was a prioritisation exercise where you’re given 5 simple tasks and have to say what order you’d complete them and why. Finally was a petty cash sheet which was just simple reading of a table, inserting the numbers in the correct columns and basic adding up. You’re given an hour to complete all of these  and prepare for the role play. \r\n\r\n The role play was about a client who had drug problems and had stopped attending the social prescribing session which he had previously been very passionate about and had missed a few key working sessions with you. The aim was to discover what the problem was and come up with a solution. In this case the client had been hearing other people going to the session talking bad things about him, so we decided to find another group for him to go to. \r\n\r\nStraight after was the panel interview, with two individuals from the team. They took turns in asking questions and asked about 8 questions in total I think. All the questions are situational as with the application. They do not ask questions about your CV, experience or anything mentioned in the application specifically. It’s up to you to bring up these examples. Use the STAR structure as recommended for the application when answering these questions. I’m pretty sure that’s what they want.", "Interview Questions": "Tell me about a time you’ve disagreed with management and how did you handle it? "}, {"date": "13 Jul 2020", "title": "Outreach Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (London, England) in Jul 2020", "Interview Descriptions": "Had to complete verbal reasoning test online.\r\nOn the day, I completed a written exercise and planned for a role play.\r\nInterview was the role play and 7 questions about skills and experience", "Interview Questions": "How have you persuaded someone to take action?"}, {"date": "12 Aug 2020", "title": "Assessment Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (Oxford, England) in Jul 2020", "Interview Descriptions": "I have to do a literacy competency test before the interview date, which was simple. \r\nI then had a assignment task - 3 different questions about how I would approach different parts of the job, and prep time for a role play the hour before the interview.\r\nThe interview itself was fairly simple - the panel were welcoming and kind and they went through a sheet of questions - all competency based. Similar to those asked in the application form", "Interview Questions": "Tell us a situation where you had to work with  a difficult client. "}, {"date": "18 May 2020", "title": "Outreach Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (London, England) in Apr 2020", "Interview Descriptions": "The panel was friendly and kind. They made me feel at ease and they smiled a lot. I didn't feel any pressure during the interview and they also gave me very detailed feedback even if I didn't get the job. I was surprised because it never happened to me that a recruiter (in this case the manager in charge) showed himself so interested in me and my skills as individual and not only as a number and a potential candidate to which attribute importance only during the interview.\r\n\r\nThe process to be selected for the interview is quite long. The first application consists of 9 or 10 questions very detailed to answer. Then, if you are selected, you will have to do a quick attitudinal test (but I personally felt that it was difficult and unhelpful to understand something about the candidate), then they will ask you to fill a written assessment (for example, in my case, I had to analyse a situation where a homeless was involved and identify actions, objectives, who is taking those actions and how much time is required to accomplish them) and to prepare a Role Play. During the proper interview, we did the role-play (10 minutes) and then they asked me questions about my previous experience and what I would have improved about the role play that I did.", "Interview Questions": " Tell us about a situation where you had to deal with a complex situation with a customer"}, {"date": "11 Feb 2020", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at St Mungo's", "Interview Descriptions": "Robotic, purely competence based. Panel showed no real warmth or interest in me as an individual.\r\n\r\nThe procedure was a written test, followed by a role play and a set of competency based questions.\r\n\r\nThe whole process and interaction with the interview panel staff seemed mechanical and lacked warmth.\r\n\r\nWe went straight into a role play situation, and then into  a set of competency based questions where you are required to follow the principle of describing a situation, your actions, and the result.\r\n\r\nI understand the need for these, but it was very non-welcoming, it felt like being processed like a sheep. \r\n\r\nThere was ZERO desire shown by the panel to understand me as a candidate or person. The whole interview was just purely about asking questions and felt very much like a dry, outdated process, which lacked any real desire to get to know me and why I was applying for the role. \r\n\r\nAfter those competency based questions were over I fully expected to be asked a bit more about myself.\r\n\r\nI was NOT ASKED any of the standard questions you would expect at some point so that you can give them a better understanding of you as a person and what you can bring to the organistion. \r\n\r\n\"tell me about yourself\", \"tell me about your work history?\" \"tell me about your current/most recent roles and what you enjoy about them?\" \"why do you want to do this specific role and what makes you a good fit for the role?\" \"what hobbies or interests do you have?\"\r\n\r\nThese are some basic questions that I expected to be asked after the whole situation based questionning but I wasnt asked a single one of them. These sort of questions give you a chance to sell yourself, descibe your skills and talents, and give them an opportunity to get to know YOU as a PERSON, not just a candidate. \r\n\r\nAn interview should be about two-way communication, not just you sitting there answering dry questions in a robotic manner whilst the panel sit there taking notes on everything you say instead of actually showing any real interest in you.\r\n\r\nThe whole interview process was dry, lacked any real human warmth and it was so apparent that St Mungos is a very much hierarchical organisation that follows a dry process to the letter without any real engagment between the candidate and interview panel.\r\n\r\nIts clear that the organisation doesnt really care about hiring real people and finding out about them as an individual as no time or attention was given to this.\r\n\r\nInstead its all about your competencies on paper which they assess with the drab, robotic, outdated situation based questions. \r\n\r\nThere was no mention of the organisations working culture, nor was the information offered, I had to ask about the role and the org to get anything out of the panel who seemed to just want to ask the questions they had written on the sheet and not deviate from the very formalised process.  I came out of the interview thinking why I had even bothered.\r\n\r\nThe whole experience was weird and made me feel undervalued as a person. From start to finish the process and interview panel made me feel like I was just a number going through the motions of the rigid and robotic interview process.\r\n\r\nI definitely got the impression that St Mungos is one of those places that follows strict policy and procedure on paper to the detriment of any real human communication and interaction.\r\n\r\nIn my experience working for an organisation which places more importance on blindly following a dated and unhuman procedure over taking a more human, warm, and interactive process which would lead to more candidates feeling valued and respected is a big red flag.\r\n\r\nNot a great experience. After my experience and after reading about other people's experience, St Mungos don't seem to want open, free-thinking people working there. They want sheep who won't question senior management, and who are made to feel like they are privilleged to be working for St Mungos, rather than the orgnisation being lucky to have you on the team.\r\n\r\nI did not get an offer, and was not given any feedback even though they ask so much of you: from completing pre-interview assessments online, to  the written expercise and roleplay on the day, followed by the competency interview which lasts about 1 hour.\r\n\r\nAfter making people jump through hoops and they should at least offer SOME personal feedback and maybe even a phonecall to say you've been unsuccessful. Again, a clear indication that this is all just a process without any real care about the indivudals behind the application. \r\n\r\nOverall very bad experience which made me fell undervalued as a person, and made me feel like a sheep being herded through this outdated interview procedure where the goal is simply to assess you without really getting to know YOU.", "Interview Questions": "all competency based"}, {"date": "19 Jan 2020", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St Mungo's", "Interview Descriptions": "I have applied for a few different positions at St Mungo's over the years (I have been with them twice, plus applied for secondments and once had to apply for my own during a restructure), and their interviews are usually pretty rigorous but also pretty good, in my experience they are always friendly and want to best out of you. The process has undergone a few changes over the years, but at the moment the process seems to be:\r\n\r\nComprehension and sometimes numeracy test (online, sent to you to do in your own time in the week before the interview, usually takes about 15 mins, it's just basic reading comprehension and it's just a small part of the picture, even if someone failed this (especially if for reasons such as having English as an additional language or a learning disability) this would be unlikely to disqualify you, the rest is much more important.\r\n\r\nInterview - this usually lasts about an hour, and includes a role play (which sounds scary but they give you the scenario before so you have about 5 mins to prep, then after they ask you how you think that went and if you would change anything, so you have an opportunity to say if you didn't feel you responded as you's wished when put on the spot), then questions. They usually start with quite hard questions, and leave the 'why do you want this job?\" until the end! Most questions are scenario based\r\n\r\nThen there is usually a written test lasting about half an hour, usually a prioritisation exercise (i.e. you come in to work and here are all the tasks calling for your attention, which order would you do them in and why) or a description of a hypothetical client and their situation, and asked what needs you would prioritise when working with them.", "Interview Questions": "Describe a time when you had to adapt your approach to the cultural or social needs of a client?"}, {"date": "5 Feb 2020", "title": "Volunteers Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England) in Sept 2019", "Interview Descriptions": "On the interview day you are given 15 minutes for role play preparation, 30 minutes for a written assessment, 10 minute role play and a 45 minute competency based interview with a panel. Before the interview day you are required to complete online verbal and numerical tests.", "Interview Questions": "Tell me a time where you have had a difficult conversation with a volunteer and how you dealt with it."}, {"date": "25 May 2021", "title": "Night Assessment Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at St Mungo's (London, England) in Sept 2019", "Interview Descriptions": "Online application followed by phone interview and inperson interview (4 hours). We had a roleplay section and a question and answer section. I also did some basic competency tests onsite.", "Interview Questions": "Describe a time you made a mistake and would do something differently?"}, {"date": "30 Sept 2019", "title": "Volunteers Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St Mungo's in Sept 2019", "Interview Descriptions": "By far the strangest interview process for what is just a decently paid administrator position. A numerical test, critical reasoning test, role play, admin test, and panel interview. I've done my fair bit of interviews but this many methods of testing only proves that they want someone from a very particular background. What is interesting is that they issue the psychometric test and say that 'it is neither the sole or deciding factor for your application' - so why do it? Now I'm not saying I don't love a good maths test and a critical reasoning exercise, but if it served no overall purpose other than to intimidate or knock the confidence off your applicants then I don't see the relevance in completing it. \r\nThe interview consisted of 6 questions, fairly easy and standard. \r\nI hadn't spent much time in their office but I couldn't see the diversity that they were championing. I'm sure its a nice place to work (can't verify that however!), but if you're up for them harbouring all this information before they have met you, and sizing you up in person for only a 30 minute panel interview, then please do go ahead and apply with St Mungo's.", "Interview Questions": "How do you ensure equality and inclusion when recruiting?"}], [{"date": "15 Jun 2022", "title": "Night Assessment Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at St Mungo's (London, England) in Aug 2019", "Interview Descriptions": "There was an initial in depth written job application, and on the day there was a roleplay, a panel interview and a written task. The process from applying to starting was almost six months.", "Interview Questions": "How would you resolve disputes among clients?"}, {"date": "18 Feb 2021", "title": "Engagement Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St Mungo's (Bristol, England) in Jun 2019", "Interview Descriptions": "Online maths and literacy test, 15 minute role play where you had to convince someone to go to a GP appointment,  1 hour competency based interview with 10 questions, 15 minute written test responding to the service flyer", "Interview Questions": "10 competency based questions"}, {"date": "6 Nov 2018", "title": "Assessment Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England)", "Interview Descriptions": "The application process consisted of around ten questions to answer online relating to experience within homelessness services: previous experience within homelessness services/supporting people.\r\n\r\nThe interview process: there was one written test to perform (an pretend e-mail to the local council debating a decision they had made in relation to a client), I was asked to write this in  a communal area. \r\n\r\nThe interview itself: I was asked various questions relating to my experiences of working within homelessness services and the two interviewers wrote down my responses on a table, they took it in turns to ask different questions each and it was a formalised process. Sometimes, the interviewer replied that they had already read what I had said in my application process which threw me a little bit as the online application requires a lot of information and I used a lot of my best examples for there.", "Interview Questions": "How have you changed your approach to working based on critical feedback from a client?"}, {"date": "15 Nov 2018", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (London, England) in Nov 2018", "Interview Descriptions": "I had to attend an assessment day to begin with which involved a written task and answering three questions in detail which lasted about 55 minutes. Then had to take part in a group activity where we were observed by three members of staff from St Mungos and they made notes on how we would handle a typical situation dealing with a client. \r\n\r\nI was then invited to a one on one interview which involved a 15 minute role play activity where I had to pretend I was on a telephone call and they observed me and what I chose to speak about and how I handled the phone conversation which was in regards to one of my clients trying to find suitable housing in Brighton. \r\nThen had to answer competency questions for about 45 minutes.", "Interview Questions": "Why do you want to work for St Mungos?"}, {"date": "9 Sept 2018", "title": "Project Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St Mungo's", "Interview Descriptions": "I was interviewed by two people. At the beginning of the interview I was given 15 minutes to prepare for a role-play, and then we spent ten minutes acting that out. I was then asked about 7 very broad and vague questions about my previous experience. At the end I completed a few written assessments that required some mental maths and indicating which of a series of responsibilities of the job should be given greatest priority.", "Interview Questions": "Can you tell us about a time you disagreed with someone you worked with and how you resolved it?"}, {"date": "8 Jun 2019", "title": "Volunteers Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (London, England) in Sept 2018", "Interview Descriptions": "This was an application for a secondment into a team where I was already volunteering. I had to submit a written application, then complete a three-part recruitment process: interview panel, written exercise, oral presentation.", "Interview Questions": "Tell us about a time when you have improved a process or method."}, {"date": "27 Aug 2018", "title": "Data Protection Support Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England) in Aug 2018", "Interview Descriptions": "Applied for role via St Mungos website, had to fill out relevant information and answer 9 person specification questions.\r\n\r\nWas then offered interview for week after applications closed. Had to answer verbal and numerical reasoning questions that lasted 8 and 15 mins respectively before midnight of the interview\r\n\r\nInterview consisted of a role play (15 mins preparation time), 6 questions and then 45 minute written test (response to an email and prioritization task)", "Interview Questions": "What would you bring to role and St Mungos"}, {"date": "26 Jan 2020", "title": "Support Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 days. I interviewed at St Mungo's (London, England) in Mar 2018", "Interview Descriptions": "Competency based question interviews and literacy assessments and online, with panel interview and psychometric questionnaire a very long and diligent process to find the right calibre of staff, which ought to filter out unsuitable candidates.", "Interview Questions": "Describe a time when you have demonstrated good team working, what did you do? And did this contribute to clients welfare?"}, {"date": "8 Mar 2018", "title": "Project Manager/Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St Mungo's (London, England) in Feb 2018", "Interview Descriptions": "There was an online test before the interview with English and Maths questions. Have a calculator next to you, the actual questions were harder than the examples beforehand.  On the day there was a short written test related to the job, a short presentation and a regular Q&A interview.", "Interview Questions": "When have you received criticism and how did you respond?"}], [{"date": "15 Mar 2018", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England) in Jan 2018", "Interview Descriptions": "The Interviewers were very nice and welcoming and they were also professional. The Interview was not too daunting. The  interview took around an hour and a half in total: role play, interview questions with panel and written test.", "Interview Questions": "Why would you like to work for St Mungos?"}, {"date": "16 Nov 2017", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St Mungo's (London, England) in Nov 2017", "Interview Descriptions": "Pre interview: online assessment (verbal reasoning test 8 mins to complete) - easy enough. (Read an advertisement and complete 16 true or false questions) \nInterview consisted of 3 parts\nInitially taken to a room and given a scenario (woman with bipolar disorder living at the project with an interest in attending art group. She recently admitted she no longer wants to attend the art group. Also has low self esteem, lacks confidence, and is isolated. \nI was asked to find out why she changed her mind about the art group. And how I can help her/what do I suggest I can help her with? \n( you are given 15 mins to prepare for this and can take your questions into the interview which is good) \n- role play: one of the panel acted as the woman: I asked her about why she no longer wanted to attend, and suggested I could go with her to the group to ease her into the group. Lasted 5 or so mins. After this I was asked whether there was anything else I wanted to ask, my reasoning for asking the questions I did. I said that I would also enquiry about her symptoms/whether she had been complying with her medication. \n- interview: 3 members of panel. All very friendly. Lasted 1h and 7 or 8 questions I believe. \n- assessment: read a short vignette e.g mine was about a 23 year old man with a history of violence who had recently been admitted for a psychotic episode. After reading this I had to complete a risk assessment form and basically say what risk factors I can identify from the vignette (easy) \n\nI've read a lot about how this job interview is very difficult but it genuinely wasn't that bad. Much less intimidating than I expected. So try not to overthink the many processes. The role play you are given plenty of time to prepare and can bring your answers into the interview with you. While the assessment at the end you have plenty of time to compete and is fairly simple. \nIn the interview Show passion for working in mental health and be friendly.", "Interview Questions": "Why do you want to work for st mungos/this post?"}, {"date": "22 Nov 2017", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (London, England) in Nov 2017", "Interview Descriptions": "15 mins interview prep for a role play\r\n10 mins of the role play followed by discussion of how it went\r\n45 mins of standard comp questions\r\n15 mins for a priorities test", "Interview Questions": "Name a time you have had to deal with inappropriate behavior?"}, {"date": "21 Oct 2019", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St Mungo's (London, England) in Nov 2017", "Interview Descriptions": "Standard compentency questions i.e. team work, lone work, previous experienc useful for the role. Role-play scenario with a client who had an issue - had to find out what was wrong. Writing a session plan had to plan an hour long session to engage with potential clients.", "Interview Questions": "How well do you work in a team - give examples"}, {"date": "24 Mar 2017", "title": "Resourcing Adviser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at St Mungo's (London, England) in Mar 2017", "Interview Descriptions": "Pre Assessment- This tested - Logical, Numerical, Verbal Reasoning and Personality.\r\nRole Play with Interview panel - 1 hour 15 Minutes \r\nWorkbased Assessment - 50 Minutes - tested Prioritization, Report Writing skills and Analytical skills", "Interview Questions": "Tell us about a time when you were given a difficult feedback and what you learned from it."}, {"date": "15 Feb 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St Mungo's (London, England)", "Interview Descriptions": "I was given guidance beforehand on what to expect from the interview and how I could prepare. The interviewer was friendly, professional, positive about the organisation and made me feel at ease.", "Interview Questions": "What specifically attracts you to St Mungo's?"}, {"date": "16 Jun 2019", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at St Mungo's (London, England) in Apr 2015", "Interview Descriptions": "It was very difficult and staff did not seem warm. There were psychological tests and math tests. There was a panel of staff.  The office is very corporate in central London.", "Interview Questions": "What would you say is your weaknesses "}, {"date": "25 Nov 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at St Mungo's (London, England) in Aug 2014", "Interview Descriptions": "Pre screening test \r\nAssessment Centre including case study followed by an interview.  The panel included service users which was great. The negatives were that the walls between the rooms were so thin I could hear the other candidate being interviewed while I was completing my written assessment. Analytical skills were also tested but the charts had been printed in black and white so were ineligible.", "Interview Questions": "Why do you want to work for us? "}, {"date": "21 Oct 2016", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St Mungo's (Hackney, England) in Jun 2014", "Interview Descriptions": "Excellent and had a manager,deputy and service user interview me, was shown around the project but had the pleasure of supporting clients there on a regular basis so was already familiar with the process so set about networking without getting under the staffs feet.", "Interview Questions": "If you had a particular client , what could you offer this client..."}], [{"date": "26 Jul 2016", "title": "Housing Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at St Mungo's (London, England) in Jan 2012", "Interview Descriptions": "Was informed by phone to attend interview.Attended head office and was interviewed by three managers from different departments within the organisation.\r\n\r\nThey asked me three questions each.Afterwich I was allowed to ask some questions about the organisation.\r\n\r\nI was informed by telephone within one week that I was successful at the interview.\r\n\r\nAll in all about 1 month from application to final result.", "Interview Questions": "How would you deal with a difficult client.Explain your process from beginning to end."}, {"date": "14 Nov 2016", "title": "Housing Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St Mungo's (London, England) in Jan 2012", "Interview Descriptions": "I applied in writing and was notified within 2 weeks of interview. Interviewed by a panel of three who each asked me 2 questions. Questions were based on experience, legislation knowledge and problem solving.", "Interview Questions": "How would you deal with a disruptive or violent tenant.Explain your procedure / processes in order."}]]