[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Hands down the best place I’ve ever worked!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jul 2023", "job_title": "Anonymous Employee in Reno, NV", "duration": "N/A", "pros": "Amazing co-workers, supportive administration, and the best students and parents you could ever ask for!", "cons": "Honestly, I can’t think of a single one!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very stressful, with summers off", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "9 May 2019", "job_title": "Teacher in Reno, NV", "duration": "N/A", "pros": "Some fantastic students, parents, and fellow teachers.  As a teacher proper, this school is pretty ideal.  The aforementioned are great, supportive people.", "cons": "As an employee proper, working here feels like drowning in middle school politics, and it varies from neutral to extremely hostile over the course of any given week. This is particularly true if you teach in the Humanities, where the turnover rate is exceptionally high.  There is a lot of sandbagging and gaslighting going on at this workplace, with no teachers' union and no human resources department for recourse.  It's a vicious blend of insecurity, spinelessness, and enabling that frame the daily experience of teaching here.  Due to special legislation and ongoing direct access to the state legislature and the state DOE superintendent (who sits on the school board), this school gets to have it's cake and eat it too, reaping all the benefits of the \"public school\" moniker while enjoying all the perks of being a private employer in a tax-light Right to Work state.  This school has a record of both fostering a hostile work environment and terminating any employee who complains about said hostilities.\r\n\r\nThe school advertises for teachers on Craigslist.  These ads ads have said things like \"applicants need not have backgrounds in the courses taught, as curriculum will be given to you.\"  Unofficially, the hiring policy has been to find younger, more malleable personalities.  Despite the questionable hiring practices and teacher turnover rate, prospective parents are told that they recruit the best teachers from around the country.  (It's odd how many of the country's best teachers and geniuses are already living right in Reno.)\r\n\r\nSchool administrators are not licensed by the State to be school administrators.  Some aren't licensed in anything in particular.\r\n\r\nThe Davidson Academy does not do teacher evaluations or direct, constructive observations by a supervisor.  In lieu of proper teacher evaluations, admin uses students to spy and report on teachers (students have even requested to use the restroom during class but then somehow end up visiting an administrator's office).  Admin has a history of using select students to actively build cases against teachers.  Teacher observations and evals typically amount to an administrator peeking into your classroom through a window, and if this happens to you, there's a good chance you've stepped on someone's toes and have been selected by admin and/or a favorite student for replacement.  Things will be made up about you.  Your job performance and job security are on a \"no news is good news\" basis.\r\n\r\nAs a teacher here, you might also be expected or pressured to go along with some questionable practices, tacitly or overtly.  Some students get credit for classes they didn't take, or for taking heavily modified versions of a class, or they get high school credit for taking a middle school course.  A couple have graduated under such dubious circumstances. (Arguably, falsified transcripts.)  Admin will, when convenient, sidestep the school's licensed counselors to get teachers to go along with this kind of stuff.  Children and parents may be mocked during staff meetings; pets are held in the highest regard and teachers can expect to be updated as such periodically.  It's a huge mess, a lot of boundaries get crossed and a lot of teachers here are on eggshells.  \r\n\r\nIt probably goes without saying that there's no real career opportunity at The Davidson Academy outside of just being a teacher.  Also, they don't offer anything in terms of retirement savings plans that won't come out of your own paycheck.  \r\n\r\nSeriously, the turnover rate at this school is ridiculous and in stark contrast with everything the school says about itself.  This is a very brand-conscious institution."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great and Supportive Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jun 2012", "job_title": "Anonymous Employee in Reno, NV", "duration": "N/A", "pros": "Easy to manage schoolwork wih job\r\nLax work environment\r\nGreat management and upper management\r\nWorks easily around any additional schedule one may have", "cons": "Sporadic hours\r\nGenerally not more than 15 hours per week\r\nWork is not challenging"}], []]