[[{"date": "24 Feb 2023", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Amnesty International", "Interview Descriptions": "Bad, was not really inclusive at all! Didn’t feel welcoming or trans inclusive , seems to have financial issues that perhaps are not clear to others from the outside. It wasn’t clear what was expected of me in that moment", "Interview Questions": "What was your experience on this"}, {"date": "1 Oct 2022", "title": "Campaigner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International in Apr 2022", "Interview Descriptions": "One round of interviews - but that might be because it was a 1 year role. Quite straightforward competency questions and then more specific questions about how I would approach the role. Friendly approach and relatively conversational.", "Interview Questions": "What would be your priorities for the work across the next year?"}, {"date": "3 May 2022", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International in Mar 2022", "Interview Descriptions": "I applied for a position - I thought it was a bit unprofessional, and the job spec had internal comments on it. Obviously, just a draft.\r\n\r\nAfter TWO MONTHS they replied, asking me to do an assessment within an hour. \r\n\r\nThe assessment was on a word doc - spelling mistakes (!). It was for a global communications manager role - didn't say global on ANYTHING I had applied for. \r\n\r\nTWO MONTHS later they replied, saying I had been unsuccessful. Saw the job advert live again.\r\n\r\nI'm really shocked by this. It was my dream to work there and this process was the worst I've ever heard of.", "Interview Questions": "write a press release\r\n\r\ncrisis management\r\n\r\nwrite a strategy"}, {"date": "21 Feb 2022", "title": "Team Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Amnesty International", "Interview Descriptions": "Two rounds of interviews, mix of competency and strength based questions. Overall positive experience. Questions not designed to trick you and fairly straightforward. Heard back within the dedicated time period", "Interview Questions": "What is the importance of diversity "}, {"date": "10 Dec 2021", "title": "Senior Legal Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Amnesty International", "Interview Descriptions": "The interview itself was a mixture of knowledge questions and competency based questions. It started off with the usual - why should we hire you.  The entire recruitment process from application to the interview took over 4 months.", "Interview Questions": "They asked questions to tease out my knowledge of international human rights law and latest developments in the sector as well as competency based questions, including on conflict management. "}, {"date": "18 Jul 2022", "title": "RCCA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International in Dec 2021", "Interview Descriptions": "Simple application process- online test- interview + task. The application was relatively simple after that I had to film myself doing answers to three questions and record my answers online.", "Interview Questions": "Explain your interest in protecting human rights "}, {"date": "7 Oct 2021", "title": "HR Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amnesty International in Sept 2021", "Interview Descriptions": "I was provided with all the information needed for the interview. The task for sent to me 30 mins prior to the interview and it was to be completed and emailed back to them within 30 mins timeline. It was quite a stressful experience to read through the tasks, think about the answers, type them out and email it to them and all this followed with the stress on connecting on teams and doing the interview! It was not an easy thing to do being a neurodivergent person. The interview itself was fine but it didnt feel like they were trying to equally impress me with what their organisation can offer to the candidate.", "Interview Questions": "How do you keep yourself interested in doing mundane tasks?"}, {"date": "18 May 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Amnesty International", "Interview Descriptions": "Interview with 3 main parts: public speaking exercise, interview question and public engagement exercises in a group setting . I was in a group of 5 people with 3 interviewers", "Interview Questions": "N/A"}, {"date": "6 Sept 2021", "title": "Digital Content Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International in May 2021", "Interview Descriptions": "There was a test on SEO, accessibility and content planning. \n\nAfter that it was an interview with a panel of 3 - one story editor, one marketing manger and one from the digital team. \n\nI never heard back from them, even after chasing several times.", "Interview Questions": "The  usual, included questions about diversity and inclusion, working with people of different cultures, safety. "}, {"date": "4 Mar 2021", "title": "Regional Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Amnesty International (London, England)", "Interview Descriptions": "Called in for an interview. Various people spoke with me and said what the job would be like. They knew me and I knew most of them from volunteer work and other work.", "Interview Questions": "How to deal with distance communication. Language test."}], [{"date": "16 Nov 2020", "title": "Human Resources Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International (London, England)", "Interview Descriptions": "very friendly team, provided thorough introduction and feedback .  Asked to provide examples to answer the questions.  example: identify an element of work you made a mistake on, then elaborate on the answer of how you realised your mistake and how you went about fixing that.", "Interview Questions": "What attracted you to the role?"}, {"date": "21 Aug 2020", "title": "2nd Line Support Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amnesty International (London, England) in Aug 2020", "Interview Descriptions": "Written questionaire on the Amnesty International website. The next stage is a Zoom interview followed by a technical test.\r\n\r\nNot many questions with regards to your CV apart from your previous role.", "Interview Questions": "Q1. What would you do if a user is unable to connect to the network and when doing a IPconfig you see an 169. IP address?\r\n\r\n"}, {"date": "28 Oct 2019", "title": "Human Resources Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Amnesty International", "Interview Descriptions": "The process was fast and straightforward; the interview date was posted on the job posting so there was no surprise around what day it would be held. The interviewers were polite and thorough and allowed me the chance to ask questions as well.", "Interview Questions": "Give an example of a time in which your workload was too heavy to complete every project on schedule. How did you prioritise?"}, {"date": "26 Apr 2020", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amnesty International (Bristol, England) in Sept 2019", "Interview Descriptions": "I applied for the position via indeed and recieved a phone call inquiring about my interest. It was an informal interview, which lead to a second phone call and small email train. I was then given information about joining the formal group interviews, which I attended. There were three candidates and one person conducting the group interview. It was helpful that this person would be our team lead so we began to get to know each other. Though it was formal it was a relaxed setting and we were made to feel comfortable. I then recieved a final phone call letting me know that I had been accepted and I recieved all the information I needed for starting traingin via email.", "Interview Questions": "What personal skills could we bring to the job?"}, {"date": "8 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amnesty International (London, England)", "Interview Descriptions": "I applied for the post in early June, got a reply from the org. after a week, scheduled interview within a few days and accepted an offer within a week.", "Interview Questions": "Why do you want to work at AI?\r\nHave you had any experience in customer service roles?\r\nA question elated to data analysis and report\r\nAny other information that we should know about you?"}, {"date": "11 Feb 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amnesty International (London, England) in Apr 2019", "Interview Descriptions": "I was asked some questions on my interest in human rights, my academic and co-curricual background, language capabilities. The interview lasted around 30 minutes. Overall, they were  very friendly and supportive.", "Interview Questions": "Why are you interested in human rights?"}, {"date": "17 Oct 2018", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amnesty International (London, England) in Oct 2018", "Interview Descriptions": "The interview was conducted by two panel members from the organisation, and focussed on three main categories - two directly related to the work, and one directly related to the organisation. Quite challenging so interviewee has to know company background beforehand and have a good grasp of the job description", "Interview Questions": "What global issue do you think should AI put focus on today and why?"}, {"date": "7 Apr 2019", "title": "Financial Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amnesty International (London, England) in Sept 2018", "Interview Descriptions": "Took approximately 2 weeks in total from online application, test to interview. Interviewers were extremely friendly, warm and welcoming.  The office was impressive. I was asked the  same questions a couple of times, but no questions really through me - was able to having a fairly flowing conversation with the two interviewers.", "Interview Questions": "Why are you applying for this position/what experience do you have with financial programmes/softwares. "}, {"date": "13 Dec 2021", "title": "Research Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Amnesty International (London, England) in Jun 2018", "Interview Descriptions": "Really enjoyable. As a student, they look for previous experience gained in extracurricular roles, and other areas of life where you have applied yourself.\n\nTransferrable skills like time management & taking initiative are key.", "Interview Questions": "Q: What previous activities have you done which you feel have prepared you for this role at Amnesty?"}, {"date": "29 Dec 2017", "title": "Events and Artist Liaison Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International (London, England)", "Interview Descriptions": "Online application. Skype interview with two members of the team for about one hour. General questions about my skills in relation to the tasks  were asked. Discussed work experience as well as academic expertise in the field.", "Interview Questions": "Work experience, specifics about the job (campaign work)"}], [{"date": "5 Jul 2018", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amnesty International (London, England) in Nov 2017", "Interview Descriptions": "There were three people who were manager at the related branch. Two of them were so friendly, the other one was so silent. I annoyed from the third one. But, It was like a friendly conversation mostly.", "Interview Questions": "Why do you prefer Amnesty to work as a volunteer?"}, {"date": "22 Oct 2017", "title": "Private Site Fundraiser Role Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International (London, England) in Oct 2017", "Interview Descriptions": "It's a group interview with 4 people joining at a time. You'll get some time to know each contestants' background and will need to introduce them to the interviewers. Next, interviewers will go on with some core questions about the role and hear about your thought to issues and thoughts within this organization.", "Interview Questions": "Do a 1-minute talk on something you’re passionate about"}, {"date": "11 Apr 2018", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Amnesty International (London, England) in Aug 2017", "Interview Descriptions": "They made me do a task, which was answering questions such as why do you think Amnesty's work is important and how can your skills be applied, followed by a Skype interview by three people asking me awful questions such as \"give us three reasons why we shouldnt hire you\" and \"what do you look for in the ideal boss\" it put me off a lot, they barely spoke about the role or what life was like there or how the internship would develoo. Finally I was asked to make a 3 minute minute video about the thing I was most passionate about. I spent 13 hours filming and editing it (skills not on job description) and then to be told \"it wasn't creative enough\" even though making videos had nothing to do with the job I would have been doing.", "Interview Questions": "Give us three reasons why we shouldn't hire you"}, {"date": "14 Aug 2017", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International (Manchester, England) in Jul 2017", "Interview Descriptions": "It was a group interview, prior to the interview we were asked to prepare a minutes speech about something we're passionate about. It's sort of just little ice breaker stuff, nothing too intense. We then had to go out on the street and ask strangers for things in exchange for a paperclip. Then that was it - I got the call later that day to tell me I got it. They all seem really lovely and caring at the interview - don't fall for it, they couldn't care less about you and will fire you after two days, it's just what they do. Don't waste your time.", "Interview Questions": "Why should we pick you over everyone else in this room?"}, {"date": "14 Dec 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amnesty International (London, England) in Jan 2017", "Interview Descriptions": "Very positive experience overall. The panel of two was lovely, Professional and down to earth. I was mostly asked about my previous experience working in human rights and monitoring human rights developments.", "Interview Questions": "What are some news sources from where you gather human rights information?"}, {"date": "23 Jun 2017", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Amnesty International (London, England) in Oct 2016", "Interview Descriptions": "The interview process revolved around the individuals personality, thinking on their feet and general presence.\r\nThe interview was conducted in groups of three around a table with the manager. The manager explained the job and the importance of the role we were applying for. \r\nMy impression of the whole interview process is that the manager did not expect to be overly impressed by the knowledge the applicants had of Amnesty International. Instead he was more interested in whether or not we were not introverts and uncomfortable. Basic competence testing was evident, but by no means was the most important factor in determining who would get the job.", "Interview Questions": "To talk about something you feel passionate about for five minutes."}, {"date": "9 Jul 2016", "title": "Artist Liaison Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Amnesty International (London, England)", "Interview Descriptions": "Extraordinarily formal - almost like a caricature of an interview.  Three people sitting opposite me, asking endless (90 minutes) 'interview' questions.  I suppose it's good that it's challenging, but I felt the environment made it extremely tough to show oneself in the best light.", "Interview Questions": "How would your colleagues describe you / What is your greatest weakness / If an artist was resistant to the project, what would you do...on and on - think of a cliched 'interview question', they asked it!"}, {"date": "9 Mar 2018", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amnesty International (London, England) in Mar 2016", "Interview Descriptions": "The process involved an online application and a face to face interview. I was questioned about my previous work experience and studies, and how I would contribute to the project.", "Interview Questions": "I was asked for an example of a conflict at work and how I had solved it. "}, {"date": "25 Feb 2016", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Amnesty International in Jan 2016", "Interview Descriptions": "Telephone Interview. Interviewers clearly using a scoresheet or similar method to judge replies to questions. No discussion at all. Questions are asked, and you live and die by the exact answer you happen to give. Very poor.\r\n\r\nCombine this interview experience with the fact that everything is done via an automated recruitment system (i.e. the first time you speak to somebody about one of their roles will be the interview itself), and the whole recruitment process at Amnesty seems to be geared specifically to make the organisation appear as soulless as possible, which is ironic given the nature of Amnesty's stated aims. A pity, really.\r\n\r\nOh, and if you send an email to their recruitment department don't expect a response.", "Interview Questions": "When have you had to create communications material at short notice?"}, {"date": "22 Dec 2015", "title": "Research & Campaigns Assistant - Gulf Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Amnesty International (London, England) in Nov 2015", "Interview Descriptions": "The application process is seamless, with an integrated online portal. If you are selected to interview, you might be required to do a pre-interview test that takes about an hour. You can book your interview time to suit your availability, and the panel is identified prior to the interview.", "Interview Questions": "Rank the three most important Human Rights in the Gulf"}], [{"date": "12 Nov 2015", "title": "Volunteer -Research On Migrant and Refugee Rights In Labour Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Amnesty International (London, England) in Oct 2015", "Interview Descriptions": "I applied Early Sept, can't remember closing date for the application. Then I was contacted for an interview In 9th Oct by phone, i missed and got voice message and email confirming inviting details", "Interview Questions": "- What made me apply for this job, what interests me in human rights issues? \r\n- How to value administrative work and coordinating project in a team?\r\n- How to manage a budget for researcher travelling abroad?\r\n- Talking about project where administrative tasks were preformed, objectives and dealing with situation came up in tge project?\r\n- how do I see myself fitting for team of migrant and refugee right team"}, {"date": "31 Aug 2015", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Amnesty International", "Interview Descriptions": "Once you make it through their screening process, its quite an easy interview. They do it face to face with some pretty easy/basic questions. Come on time and be prepared to be asked some basic questions about your resume.", "Interview Questions": "tell me about yourself"}, {"date": "30 Sept 2015", "title": "Digital Engagement Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Amnesty International (London, England) in Aug 2015", "Interview Descriptions": "- Standard online application but with two bespoke questions to role.\r\n- Pre-interview written test\r\n- Interview by Skype (poor connection) with a panel of 4x senior executives from across world\r\n\r\nProbably the poorest recruitment experience I've ever had.\r\n\r\nA pre-arranged written test I was booked in for was cancelled twice at very short notice after I had arranged to be available (cancellation email came through 20 mins after the test was supposed to start).\r\n\r\nThe Skype interview was awful, with constant drop outs, re-connections and misunderstandings in communication.\r\n\r\nI did not hear back for weeks and then eventually got a standard rejection email inviting me to ask for feedback. I asked for feedback and never heard from them again.\r\n\r\nIn between applying and getting an interview I developed some apprehensions based on Glassdoor reviews and some Googling, mostly about poor management, internal bureaucracy and wasted resources. The recruitment experience did nothing to persuade me that this isn't an organisation with some significant issues.", "Interview Questions": "How would you reach and engage supporters in other territories (non UK)?"}, {"date": "26 Jan 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amnesty International (London, England) in Mar 2015", "Interview Descriptions": "Very friendly and straight forward interview process. Mostly asking competency based questions, such as 'tell me a time when...'. I was interviewed by a panel of 3 people, all from the department I was applying to.", "Interview Questions": "Tell me a bit about yourself"}, {"date": "12 Oct 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Amnesty International (London, England) in Feb 2015", "Interview Descriptions": "I applied and received an interview request two weeks later. Interview itself was then a week later and was bit over half an hour long. It took place in the International Secretariat in London as I was living there at the time, but would have been possible via skype too. I received the offer a week later and started another two weeks later in their headquarters (great experience!)", "Interview Questions": "I was asked why I apply for the role, how my background fits it, should demonstrate detailed knowledge about the issues I would be working on, demonstrate knowledge about human rights issues in europe and some of the debates around that, explain my language skills which were needed for the role."}, {"date": "12 Oct 2015", "title": "Programmer Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Amnesty International (London, England) in Nov 2014", "Interview Descriptions": "The interview was simple and straightforward. However, the selection panel were disorganised and the interview was interrupted several times by outside calls. Even so, the team were pleasant and polite.", "Interview Questions": "How would you manage a situation where you have asked a colleague in another department for information but they have not responded?  Can you describe an occasion where your communications skills directly contributed to a positive outcome?  Could you please tell us a little bit about yourself?"}, {"date": "18 Oct 2018", "title": "Deputy Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Amnesty International (London, England) in Mar 2014", "Interview Descriptions": "I applied and heard back after 2 months. I was given a written test and went through three rounds of interviews.  I waited for about 4 weeks before I heard back regarding the interview. Overall the interview questions were relatively straight forward.", "Interview Questions": "What are the main human rights challenges facing the world today? "}, {"date": "14 Nov 2016", "title": "Senior Java Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amnesty International (London, England) in Jan 2012", "Interview Descriptions": "2 interviews face to face and 1 Java test. First was a screening interview with Head of department who was the most friendliest person ever. Very enthusiastic. Asked behavioural type questions about personality and how well I worked with other people. Second interview was a technical interview with more details about the job and skills required. Was asked about career progression. Then a computer based technical test on collections and modelling human right case objects in Java.", "Interview Questions": "How would you scale up a website? Have you used Apache Tomcat? Have you used REST? What is the probability of getting 6 on the first dice and not 6 on the second dice? How would you count the number of windows in the city of London?"}]]