[[{"date": "23 Feb 2023", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at SBHS", "Interview Descriptions": "They will hire anyone for this position. They just need bodies, cannon fodder. Don’t work here. This place is beyond unsafe, it is a nightmare. It should be shut down. In fact, if you doubt me, I encourage you to work here. You’ll see.", "Interview Questions": "Strengths, weaknesses, experience working with children or the mentally ill."}, {"date": "22 Oct 2022", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SBHS", "Interview Descriptions": "I submitted app online. A phone interview with someone who seemed really snotty was scheduled a few days later. HR was quick to call with an offer over the phone the very next day.", "Interview Questions": "What did you do in the past?"}, {"date": "8 Jun 2022", "title": "Behavioral Health Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SBHS (Streamwood, IL)", "Interview Descriptions": "Welcoming, informative, reflective. Recruiter was very interested in me and took time to over view my resume and ask questions about previous experience. Answered my questions and gave truthful feedback about their experience at the company.", "Interview Questions": "What mistake have I made in the past that I’ve grown from?"}, {"date": "24 Jun 2021", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at SBHS", "Interview Descriptions": "The interview is a typical interview if you have experience with customer service.  There is a crucial professionalism assessment where you answer questions scenario by scenario. The score will determine how good of a fit you will be.", "Interview Questions": "Why do you want to work in a mental health facility?"}, {"date": "27 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SBHS", "Interview Descriptions": "One of the nurse managers interviewed me and asked what my reason was for choosing this psych field, wanted to see my knowledge on psychotropic medications, and asked typical interview questions like past work history and strengths and weaknesses. Overall process was smooth and very pleasant.", "Interview Questions": "Can you tell me about SSRIs and their possible side effects?"}, {"date": "15 Feb 2021", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SBHS", "Interview Descriptions": "Met with clinical team. They asked a few questions regarding experience and told me about the system. Relatively formal, however pretty brief. Overall it was pretty classic in terms of how interviews for therapist positions go.", "Interview Questions": "How would you work with clients struggling with aggression?"}, {"date": "20 Dec 2022", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SBHS in Dec 2019", "Interview Descriptions": "Contacted quickly after completing online application process. Completed in person interview with director and coordinator of program. Offered position via HR after the in person interview. Negotiated salary with HR went quickly.", "Interview Questions": "Asked about group counseling experience ."}, {"date": "9 Oct 2016", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at SBHS in Oct 2016", "Interview Descriptions": "I originally applied two months before actually getting a call. They said it's because I was looking for full time employment and wasn't offering that at the time I applied. Regardless they kept my application and call to see if I was still interested and if we can set up a face to face interview. \r\n\r\nI came in the next morning for an interview, but started with an assessment test that took half an hour (HR did tell me this ahead of time). The assessment was easy and contained work place scenarios. If you don't pass then you don't get to move on to the actual interview. Fortunately, I passed and was walked to the hospital where I interviewed with a nursing manager. She asked a couple questions about my resume and work place senarios and then asked if I had any questions. \r\n\r\nAbout a day later I received a call from HR offering me the job. It's a nice facility and you would be doing great work. The pay is pretty good and you can get OT if you want it.", "Interview Questions": "Name a time you dealt with a angry customer or patient, what did you ?"}, {"date": "11 Feb 2016", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SBHS (Streamwood, IL) in Jul 2015", "Interview Descriptions": "10+ People in a group interview with three staff asking questions. Very time consuming and awkward. Most of the candidates had significantly more experience than the position requirements were, and many already having master degrees in their respected field. The up and coming CEO was shadowing the interview and subsequently made it even more strange.", "Interview Questions": "What is important to you when deciding on an employer?"}, {"date": "5 Oct 2014", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at SBHS", "Interview Descriptions": "I got a call from HR the day after I applied.  My interview with HR was fairly easy, just typical interview questions.  There was a timed computerized quiz I had to take.  It was not hard - mainly questions about how you would handle workplace situations.  I did well on that, so I got to move on to the next stage.  The HR representative walked me to the main hospital building, and then I met with two nurse managers who were hiring for their respective units (I had no experience at that point, and was not sure what population I wanted to work with.)  After that, the interview was over.  I heard of another person who got to see the unit during her interview; perhaps I could have gotten a tour if I'd asked.  The next day I got a call from HR offering the position, and I started orientation the next week.  Before orientation, there was a required physical including drug screen.  I was nervous about the physical, but it was easy.  The doctor just checks things like range of motion, and if you can lift 40 lbs.", "Interview Questions": "The nurse manager for one of the units asked me if I knew what DBT (Dialectical Behavior Therapy) was, and while I remembered the term from school, I did not know enough to explain it.  I don't know if it's a typical interview question, but I was not expecting it.  "}], [{"date": "28 Aug 2015", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SBHS (Streamwood, IL) in Sept 2014", "Interview Descriptions": "was interviewed by two of the nursing supervisors for two different units. they just asked the same old questions one gets during an interview. i got the feeling that i could have answered anything and they still would have hired me.", "Interview Questions": "tell us about a time you had to handle a stressful situation or customer at work.\r\nhow would you deal with a child that is acting out?"}]]