[[{"date": "21 Feb 2023", "title": "Adjunct Facutly Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "they did a review of resume- had asked me about my previous work history and also asked me about volunteering history and what my desired hours are they asked if I was willing to travel", "Interview Questions": "have you provided supervision before"}, {"date": "4 Jul 2023", "title": "Digital Marketing Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (New York, NY) in Jan 2023", "Interview Descriptions": "h0pa c0k0 siuoper vuen o n o ? pero vuasd aa las cosas las esxcuro to y esper qe e qqasdn o me dlodas la pur cuda ok entocnsa s", "Interview Questions": "mkm dsd fadf sfss fsf asf"}, {"date": "18 Nov 2022", "title": "IT Helpdesk / Desktop Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "Way too hard of an interview for the job offered (and pay). Video call with five different people. A ton of situational questions. You'd think I was interviewing for a 100k CIO job. My goodness. And if you get hired there you have to pay $90/month for parking, which is a load of crap. It all worked out as I ended up getting a better contract.", "Interview Questions": "How do you build trust with your coworkers? Tell me about a time you failed? How have you kept up with technology changes recently?"}, {"date": "28 Aug 2022", "title": "Coordinator of Alumni Relations Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Case Western Reserve University", "Interview Descriptions": "It was a hectic, unorganized process. I was told a salary in the first interview that was within my expectations/comfortability. I eventually receive a verbal offer (mind you this is 2-2.5 months into the process). It takes 4.5 weeks for me to receive my written offer from HR, after the verbal one. After I receive the written offer, I see that it is $12,000 less than what I was told in the first interview...4 months prior (and they couldn't go any higher). This is why they just need to post the salary on the job postings. I missed out on the hiring season for higher ed because I was given incorrect/extremely delayed information. Apply at your own risk.", "Interview Questions": "Basic questions, one that stood out was \"How would your friends describe you?\""}, {"date": "9 Aug 2022", "title": "Systems Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "The process was appropriate and sufficiently in-depth.  I have worked at this institution in the past and there were no surprises.  The interviewer was pleasant and easy to talk to.", "Interview Questions": "Why are you interested in applying for this position?"}, {"date": "22 Jul 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Case Western Reserve University in Jun 2022", "Interview Descriptions": "The process was drawn out, and the in-person interview itself was 4 hours. It was essentially meeting with different people who asked the same general questions over again. You’re expected to create a presentation, which takes at least another hour if not more outside of the interview. There was a first round interview that was about 30 minutes via Zoom as well. I never heard back following the interview despite following up, which I assume is a rejection as the job was reposted recently. It would be considerate to follow up with candidates considering how much time they require for their interviews. The people who work in admissions seemed nice, but the expectation of 5+ hours of a work for an interview and lack of communication is ultimately why the experience is rated negative.", "Interview Questions": "Are you comfortable with traveling? "}, {"date": "24 May 2022", "title": "RLC Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "the interview was clunky and the questions weren't relevant to the position. they clearly weren't focused on the time or the interview and had multiple long questions making it extremely hard to focus on the process", "Interview Questions": "tell us about yourself and goals for the department"}, {"date": "18 Jan 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Case Western Reserve University in May 2022", "Interview Descriptions": "After I initially applied, a recruiter screened me almost immediately. Then, I received an email from the hiring manager about a formal interview (the transparency about salary up front was much appreciated). I had two phone interviews, panel interview, and final interview with the hiring manager. The entire process took about a month and a half and was overall a pleasant experience.", "Interview Questions": "Q: What are some examples of marketing strategies that you have used to improve customer or client experience? Q: Tell me about a time you were in a difficult position and had to make a quick decision"}, {"date": "12 Apr 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "It took a number of interviews to get the job. After being on the other side of the table, the process leaves so many applicants hanging for far longer than they should. It may cause good talent to look elsewhere after too long of a wait.", "Interview Questions": "Give some examples of working with volunteers. "}, {"date": "24 Jan 2022", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Case Western Reserve University (Cleveland, OH) in Jan 2022", "Interview Descriptions": "Applied through LinkedIn and was contacted by PI to schedule a Zoom interview for 30 mins. The interview lasted for 1 hour. I got asked basic questions from the area of technical research of the PI's lab and some programming questions.", "Interview Questions": "Very basic research questions from the area you are applying to. "}], [{"date": "2 Mar 2022", "title": "Department Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Case Western Reserve University (Cleveland, OH) in Nov 2021", "Interview Descriptions": "The interview process was great considering we had to do the initial interview through Zoom. But I felt that it went well and the people conducting the interview did a great job. I was able to meet in person for the second interview and it went better in person and the staff was really welcoming.", "Interview Questions": "They asked if I had any experience with a certain program."}, {"date": "21 Oct 2021", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "The interview process was very basic. Simple questions were asked as this was a front desk job where not many skills or complex tasks needed to be done. The offer was given on the spot after the interview.", "Interview Questions": "What is your greatest strength?"}, {"date": "29 Sept 2021", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "There was one behavior style interview. I was asked pretty standard questions (why I wanted the job, challenges I have faced, etc.). Overall, it was not a very long process.", "Interview Questions": "Describe a time you have had to handle a difficult situation that involved communicating with someone."}, {"date": "13 Sept 2021", "title": "Customer Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "It is very easy and chilled. No need to dress up fancy, simple business casual works. I've seen ppl wearing T-shirts to interviews before. After all, it's just on campus job. Having Work-study is a plus.", "Interview Questions": "What are your strengths and weaknesses?\nHow do you deal with a sensitive situation?\nWhat is your availability?"}, {"date": "6 Sept 2021", "title": "Sales Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "Experience questions. Easy to ace. I don’t think most people would have any problem getting the correct answers. Very simple interview all around no problem. I would highly suggest you go and read about the college so that you have all your info and can get a job", "Interview Questions": "Why do u want to work here?"}, {"date": "4 Sept 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Case Western Reserve University", "Interview Descriptions": "Fairly standard interviews, nothing too out of the ordinary. Due to the pandemic, interviews were held virtually. I would simply recommend having a better understanding of your role, department, and university.", "Interview Questions": "Questions were typical of those asked for administrative positions at a university, there were no major curve-balls, if you will. "}, {"date": "21 Jun 2022", "title": "Writing Center Tutor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Case Western Reserve University (Cleveland, OH) in Aug 2021", "Interview Descriptions": "My interviewer was really nice and the interview went by really fast. As long as you know what you're talking about and have genuine passion you have nothing to be nervous about.", "Interview Questions": "What are your go-to tutoring tactics? "}, {"date": "10 Jun 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Jul 2021", "Interview Descriptions": "Give a 30 minute talk about your current research.  Then talk to various members of the department.  They'll in a few weeks with an offer and tell you that your salary will be quite small.", "Interview Questions": "What is your teaching philosophy."}, {"date": "1 Apr 2021", "title": "Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "There was an in-person and telephone interview with the program director and other faculty at the School of Dental Medicine, Case Western Reserve University, Cleveland, OH for the Dental Resident position.", "Interview Questions": "Tell me about yourself and your research experience "}, {"date": "12 Jan 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH) in Apr 2021", "Interview Descriptions": "Its a short interview which is computer based. A lot of behavioral questions which need to be answered in 2 minutes but you get 30 seconds to think about it", "Interview Questions": "Usual situational questions on behavior\r\n"}], [{"date": "6 Mar 2021", "title": "Assistant Summer CSA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "Got email back with interview after submitting my cover letter and CV.  Ask about why you want to work as CSA , and previous experiences. Then talked about what are the responsibilities are and what the job is. There is only one round of interview", "Interview Questions": "why you want to work as CSA"}, {"date": "29 Jul 2022", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 8 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Mar 2021", "Interview Descriptions": "One interview with current Resident Assistants and potential supervisor. Questions provided before interview to prepare. Time allotted for you to ask questions at the end of the interview. 20 minutes interview with 10 minutes for questions.", "Interview Questions": "What attracted you to the RA role?"}, {"date": "20 Apr 2022", "title": "Sport Coach Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Case Western Reserve University (Cleveland, OH) in Jan 2021", "Interview Descriptions": "My interview process was rather informal because I began as a volunteer while in graduate school at CWRU. It was very conversational in nature, I felt all questions were fair and benefited the conversation. My own questions were answered transparently and honestly upon reflection. This later turned into a paid intern position. ", "Interview Questions": "What position would you feel most comfortable coaching? What is your coaching style? "}, {"date": "21 Jan 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH) in Dec 2020", "Interview Descriptions": "Videoconference interview lasting about 45 minutes with two people on the hiring team, a longer phone screen. Set up via email in advance, about 1 week after submitting resume and cover letter.", "Interview Questions": "What is a challenge you have dealt with in your career, and how did you handle it?"}, {"date": "25 Aug 2020", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "Meeting with the professor I'm  interested to work with. We talked about the research projects that currently going in the lab. After I offered some ideas to show my understanding of the projects, I got accepted next semester for researching with credits.", "Interview Questions": "What's your thoughts on this project?"}, {"date": "14 Mar 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "no interview need, just causal talk to professors and show your previous projects and researches.  no interview need, just causal talk to professors and show your previous projects and researches.", "Interview Questions": "N/A"}, {"date": "15 Aug 2021", "title": "IT Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Case Western Reserve University (Case, Warren, MO) in Feb 2020", "Interview Descriptions": "it was great and everythings on time and they said what they said i hope to find them again because they seemed cool, i am all about great conversation and intrigue because they are the best for my life and i love them", "Interview Questions": "what is it you love"}, {"date": "11 Dec 2019", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Case Western Reserve University (Cleveland, OH)", "Interview Descriptions": "There was a phone interview followed by in-person interviews and a group presentation. Very intense and time consuming. They never communicated afterwards at all. No rejection, no offer, nothing. Feels like a complete waste of time. Shockingly unprofessional.", "Interview Questions": "How would you describe hiring practices to a non-citizen."}, {"date": "9 Dec 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University", "Interview Descriptions": "Went in to office, had one round and was interviewed by a professor. Then they asked me a bunch of technical questions about work I had done, why I was interested in the position, where I had studied, etc.", "Interview Questions": "What are your biggest weaknesses? What's your working style? Tell me about your past work"}, {"date": "25 Aug 2021", "title": "Central Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Case Western Reserve University (Cleveland, OH) in Dec 2019", "Interview Descriptions": "I was brought into the ResLife office and asked a couple of questions by the Central Office Manager. It was a pretty informal interview and was notified about their decision through email.", "Interview Questions": "I was asked about how I have dealt with conflicts in the past and what my strengths and weaknesses were. "}], [{"date": "26 Oct 2019", "title": "Department Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Case Western Reserve University", "Interview Descriptions": "One month after I applied, I was contacted to do a phone interview with 2 members of the department. Two and a half months after the phone interview I was contacted asking if I would come in for an in-person interview. I was told the reason for the delay was that the position had temporarily been put on hold, but now they were ready to fill the position. I met with the original people I did the phone interview with, plus 3 additional people. At the end of the interview I was told they would be making a decision within one week. I never heard anything else. I contacted the hiring manager 3 weeks after my interview to ask about the status of the job and never got a response. I don’t think it was ever filled. It’s pretty disheartening when you spend a lot of time preparing for interviews and taking time off from your job to do them and can’t even get a courtesy response letting you know what’s going on.", "Interview Questions": "Tell us about your job history"}, {"date": "3 Nov 2019", "title": "Communications Role Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Case Western Reserve University in Sept 2019", "Interview Descriptions": "Very disorganized overall. \r\n\r\nFirst started with communications people who were very nice. Took a writing test. Heard nothing back directly from them. Then was called by the school to come in for an interview. Interviewed for 2-3 hours with four different individuals. There had obviously been no communication between the school and the university communications people. Very awkward. Felt confrontational at times when interviewing with the school. Communications people and the school seemed to have different understandings of the job duties. \r\n\r\nImmediately sent all my thank you's to the interviewers. Asked for clarification on reporting and who would be doing the hiring (ie, university communications or the school). No response. Waited some weeks and reached out to communications, who responded that the school was still interviewing. Saw today that the job has been reposted.\r\n\r\nI do believe CWRU could do better in their treatment of candidates. Disappointing for such a world class institution.", "Interview Questions": "Why should we hire you?"}, {"date": "18 Aug 2019", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University", "Interview Descriptions": "I had a video conference interview with the PI and a few other people from the team. They were friendly and had some interesting questions. But they didn't ask anything very technical or challenging.", "Interview Questions": "Give us an example of one time you had a conflict in the workplace and how it was resolved."}, {"date": "4 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University", "Interview Descriptions": "Advisor ask questions.  I provide the answers.  With the given questions, I provide answers quickly.  If I can answer all the questions, I can get the job.  This job is not good. Avoid this school", "Interview Questions": "Why do you apply PhD"}, {"date": "1 Nov 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Case Western Reserve University in Jan 2019", "Interview Descriptions": "One in-person interview with supervisor and three other staff. Friendly atmosphere and also a quiet work environment. Prompt email responses with follow up. Interesting opportunities outside of position within the university.", "Interview Questions": "Explain current job responsibilities."}, {"date": "9 Dec 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "You were told to meet with some professor working in Case Western Reserve University. YOu will be asked some technical questions. You will be asked t sumbit your transcript.  And they will review the course you took.", "Interview Questions": "What is your coding back ground?"}, {"date": "17 Jul 2018", "title": "Senior Buyer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH) in Jul 2018", "Interview Descriptions": "Was just 1st step in interview process.   Phone call with followup interview (good or bad) in 3-4 weeks.   Interview was approx. 20-30 minutes.", "Interview Questions": "How to turn a bad situation into something positive in my position that may or may not have a favorable outcome for both sides.\r\n"}, {"date": "12 Jul 2019", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in May 2018", "Interview Descriptions": "Great and very detailed, asked about your previous jobs, previous experiences, skill set, why are you interested in my line of research, can you write Grants? Can you write papers? Can you perform and design experiments? Can you analyze data?", "Interview Questions": "About my skills"}, {"date": "17 Apr 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Case Western Reserve University", "Interview Descriptions": "I met with the project manager and discussed their work. I explained my work history. We talked about the position and about other opportunities for professional development at Case Western Reserve University. It was relaxed and informal!", "Interview Questions": "Tell me about yourself!"}, {"date": "2 Jan 2018", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "Very good. I am an undergrad and directly applied there. The key is to email the professor and see if they want to get you in or not. That is the point.", "Interview Questions": "Describe what you want to do in the future"}], [{"date": "13 Oct 2017", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Case Western Reserve University (Cleveland, OH)", "Interview Descriptions": "The interview process is pretty straight forward.  You sit down with the training team and they ask you basic questions about why you want to be a tour guide, etc.  Also, they will ask you tough questions that you might get on tour, so be prepared!", "Interview Questions": "What's the party scene like at CWRU?"}, {"date": "24 Jun 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH) in Apr 2017", "Interview Descriptions": "I was contacted by someone at the university and then by the hiring manager who then took over the recruiting process. There were large gaps of time between applying, hearing from someone to set up the phone interview, then for the in person interview, then nothing. The HR and recruiting people were not present, the follow up was poor, and even though I was a finalist for the position, I never heard from them after the last interview, The process they described was going to be at least 5 months from applying to getting an offer, then another couple of months to start. No salary range was ever discussed. Fortunately I got another offer immediately after my last interview with Case, where the process was only 3 weeks from application to offer.", "Interview Questions": "What would you do when you started the position?"}, {"date": "24 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Case Western Reserve University", "Interview Descriptions": "A few questions on where I see my career developing and some technical questions on common lab procedures such as Western Blots and Titrations. Meetings required with PHD students and post docs.", "Interview Questions": "What do you hope to learn here and how do you plan to use it in the future?"}, {"date": "7 Oct 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University in Mar 2017", "Interview Descriptions": "I interviewed with a faculty member to get the position. The interview was focused on a paper, technical issues, and personal matters.\n\nThe supervisor asked plenty of questions regarding the paper that was submitted to me to review.  Other technical questions were related to the graduate courses.", "Interview Questions": "Why did you choose the course of study you did?"}, {"date": "17 Apr 2017", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH) in Feb 2017", "Interview Descriptions": "Initial contact via email to schedule a phone screen. Phone screen went well, felt that there was a good rapport with the interviewer. Email communication to schedule a follow-up in person interview. On site interview with four members of the team.", "Interview Questions": "The interview was more of a conversation / explanation of the department and internal processes and  procedures. I wouldn't say that there were any real difficult questions."}, {"date": "15 Oct 2021", "title": "Safety Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Case Western Reserve University (Cleveland, OH) in Jan 2017", "Interview Descriptions": "It was different six people in a room asking questions about what I have done in the past.\nSome of the people were very arrogant about my experience but they were younger and processes were different iny time", "Interview Questions": "What experience did I have in security"}, {"date": "4 Oct 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Case Western Reserve University", "Interview Descriptions": "We could be chosen directly from the professor based on GPA or find professor by ourselves. Questions are fine and some TA need to be test for some excel solving questions or others.", "Interview Questions": "Describe one of the project you have done and the role."}, {"date": "6 Dec 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Sept 2016", "Interview Descriptions": "First, a sit down in the PI's office to discuss a little of my own background and future aspirations, but mainly to delve into what projects are taking place in the lab. Also, explains some lab politics and basic expectations. \r\nNext, will take you around the lab to show you both equipment and to introduce you to other lab members. Will leave you with other lab members briefly to ask any questions of them without having \"the boss\" present. \r\nFinally, you will return to the PI's office where you will discuss any questions you have with the PI and discuss things such as possible start date, second interview, salary expectations, etc.", "Interview Questions": "How long do you expect to stay at this job?"}, {"date": "3 Aug 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH) in Aug 2016", "Interview Descriptions": "Emailed a cover letter and 1-1 interview in person with the hiring PI. Depending on the PI, they will meet with other staff in the lab. I highly recommend requesting to meet other members of the lab before accepting the position.", "Interview Questions": "Why did you leave your previous lab?"}, {"date": "7 Jun 2016", "title": "Department Assistant III/Chair's Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Case Western Reserve University (Cleveland, OH)", "Interview Descriptions": "Basic Interview with the manager and chair of the department individually.  However, if interviewing for an internal interview the process can be different in which you may interview with a panel or several different people individually for the same position.", "Interview Questions": "Basic interview questions, why was I applying, what did I do at my last job etc..."}], [{"date": "23 Feb 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Case Western Reserve University (Cleveland, OH) in Jun 2016", "Interview Descriptions": "I was initially contacted by the hiring committee and engaged in video conference interviews with some of the members of the search committee. When I was itendified as one of the finalists, I was brought to campus for an all day interview with various members of the committee.", "Interview Questions": "Where do you see the future of technology?"}, {"date": "6 May 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Case Western Reserve University (Cleveland, OH)", "Interview Descriptions": "met with several faculty to discuss scientific opportunities and point of collaboration. To assess their view on the environment. To assess their view on the research and Cancer Center. to demonstrate my plan for my research once at Case", "Interview Questions": "why research\r\nwhy Case\r\nwhat do you expect from Case\r\nwhat is your research plan for the next 5-10 years"}, {"date": "11 Apr 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Case Western Reserve University (Cleveland, OH) in May 2016", "Interview Descriptions": "Overall, the process was very informal and laid back. Made me feel very much at ease. I must confess that the interviewer was well aware of my background and previous research experience.", "Interview Questions": "Career roadmap"}, {"date": "22 Feb 2016", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "interviewers are very nice and asked about my back ground information, my motivation to work here and what can I help them to do. what;s my understanding to this job and how can I meet with difficulty.Also the interviewer told me there would be many things to do and whether I can handle them or not", "Interview Questions": "How do you deal with difficulty"}, {"date": "12 Dec 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Case Western Reserve University", "Interview Descriptions": "Recruitment required a resume and cover letter that specifically outlined experience with a particular subset of research or experience within a contextual area that is rare for students to have much exposure with.  During the interview, we addressed my experience, the depth of knowledge in the subject matter area, how that differed from most of my colleagues and how I could be in a leadership position within my team.  Keep in mind this was a very specific research assignment requiring pertinent experience for a time-sensitive project.  One 30 minute 1:1 interview.", "Interview Questions": "Previous experience with the specific topics at hand.  No interest in other experience - just this research subset."}, {"date": "15 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Case Western Reserve University", "Interview Descriptions": "Basically, walk-in interview talk to the professor and describe your background. How you would use your existing knowledge and contribute to the research team. Asked me about previous experience. Asked some behavioral questions. Asked regarding technical knowledge.", "Interview Questions": "What did you learn from this course?"}, {"date": "9 Sept 2015", "title": "Department Assistant III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Aug 2015", "Interview Descriptions": "After over a month of applying, I got a call to set up a phone interview. I had the phone interview, then the following week went in for an actual face-to-face interview, and had a 2nd face-to-face meeting the week after that. Met with pretty much everyone in the department twice.\r\n\r\nI took a lot of time out of my schedule to meet with the department twice, as well as paying for parking twice, and everything seemed to go really well. However, I was never contacted again with a rejection, even after following up 2 weeks after my 2nd interview which I found to be quite rude, after all the time I gave to them.", "Interview Questions": "Asked basic and simple scenario questions that were rather easy to answer."}, {"date": "9 Jul 2015", "title": "Analyst Programmer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Case Western Reserve University (Cleveland, OH)", "Interview Descriptions": "posted resume online, contacted via phone, interview with supervisor, salary \"negotiation\" with HR, offer letter. the compensation analyst seemed out of touch with what constituted a reasonable range of compensation for the position. definitely focused on keeping the offer as low as possible.", "Interview Questions": "Would I work for less money than the job was worth?"}, {"date": "7 Feb 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in May 2015", "Interview Descriptions": "The first interview occurred virtually with the supervisor. We met via Google Hangouts. The interview took a total of one hour where the supervisor described the project roles and asked how my work experience was relevant to those project roles.  After speaking with other candidates, I was offered the position and was to start 3 months from when I was interviewed.", "Interview Questions": "How is your  experience applicable to this job?"}, {"date": "16 Mar 2015", "title": "Research Assistant III Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Case Western Reserve University (Cleveland, OH) in Mar 2015", "Interview Descriptions": "I arrived at the PI's office on time. He mentioned I had a lot of good experience in a lot of labs but that was a bad sign. I countered with the last 2 jobs I had I had lost due to budgetary concerns. That I have had nothing but positive performance reviews. He countered with the recruiter said you lost your last job because you were pregnant. I of course said no as that is illegal. He then went on to ask other inappropriate questions such as are you sure you have enough time with a young baby at home, what does your husband do for a living, do you have access to childcare for after hours. He offered me the job but low-balled the salary (I do have a young baby so I must be desperate. He then told me I'd need to take the ARC training but he didn't think he should have to pay for that.", "Interview Questions": "Are you sure you have enough time for a full time job with a baby at home?"}], [{"date": "13 Sept 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Feb 2015", "Interview Descriptions": "Very brief 10 minute interview. Common questions such as strength and weaknesses. Why you want this position. Some of the questions were personality questions. The first interview process is usually a phone interview and then if they decide to, you are given an in person interview.", "Interview Questions": "What are your strengths/weaknesses?"}, {"date": "17 Apr 2016", "title": "Graduate Student In Operations Research and Supply Chain Management In Weather Head College of Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Jan 2015", "Interview Descriptions": "It was either on-site or via Skype. It took about 20 min. The interviewer was very gentle and professional. He asked about the leadership experience. The previous courses taken. Why applied to this program.", "Interview Questions": "Have you ever taken any related courses to Operations Research?"}, {"date": "21 Apr 2015", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Case Western Reserve University (Cleveland, OH) in Dec 2014", "Interview Descriptions": "Mostly online, I knew the person in charge of recruiting, and he needed TAs.  Wasn't really an interview, so much as a \"submit your resume and if you're competent you'll get the job.\" no minimum GPA, expectation of roughly 6-10 hours a week. Options include graders and lab assistants. Professor not in charge of hiring as much as TA.", "Interview Questions": "General Knowledge of circuits required, must have taken the class or equivalent, availability"}, {"date": "31 May 2015", "title": "Senior Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Case Western Reserve University (Cleveland, OH) in Nov 2014", "Interview Descriptions": "hiring is by the PI of a research lab. He invited me to go to the lab and gave a talk, followed by appointment with individual members to learn their research. Then, select members of the lab together with the PI would also have dinner with me to further discuss more research and get to know me more on a personal level", "Interview Questions": "what do I want to do in a few years in my career"}, {"date": "11 Oct 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Oct 2014", "Interview Descriptions": "Very professional, answered all of my questions. Asked about several things and gave me the impression that I would be doing work that I'm not now doing (e.g., social media), but overall a good experience. Not all of the people I worked with were present, so it was a surprise to come in the first day and find that there were quite a few more people in the office than I had anticipated", "Interview Questions": "Why are you a good fit for CWRU?"}, {"date": "4 Aug 2015", "title": "IT Tech Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Case Western Reserve University in Sept 2014", "Interview Descriptions": "Fairly simple interview process not bad, straight forward and what was expected. Emailed me before hand for a time for an interview. Did not really know what to expect from everything I met them through the campus job fair. Really no one should be nervous about the interview, all they want to know is more about you that is all.", "Interview Questions": "How do you see this job expanding you?"}, {"date": "16 Jul 2015", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Case Western Reserve University (Cleveland, OH) in Aug 2014", "Interview Descriptions": "Met with a few people in the department. Got a call a few days later. was very easy. they were very friendly, nice and up front about the process and their expectations.", "Interview Questions": "Describe your similar work experiences."}, {"date": "15 Feb 2015", "title": "Researcher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Apr 2014", "Interview Descriptions": "Half hour phone interview then a one on one on-site experience. Be expected to spend a full-day in half-hour interview sessions. The people are very nice and understanding. Was a comfortable and enjoyable experience. Focused on educational background and job related questions.", "Interview Questions": "What was our previous work experiences. Describe your University background and supply all relevant research papers and works."}, {"date": "6 Jun 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Apr 2014", "Interview Descriptions": "Applied online and received an email from PI. We have 4 phone interviews over a month and when I confirmed to set up a formal interview in Cleveland, he never emailed me back for another interview.", "Interview Questions": "The person interviewing me had no organization and asked me to review a different published paper during each interview. "}, {"date": "24 Feb 2014", "title": "Dental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Case Western Reserve University", "Interview Descriptions": "The hiring process can be a bit complicated as they usually go through a temp agency, so you may interview with them first. Very standard interviewing process. Once hired to usually stay on with the temp agency for 3 months. If your department wants to hire you onto Case's payroll, you then interview with your supervisor for the position.", "Interview Questions": "Nothing I can recall."}], [{"date": "8 Oct 2013", "title": "International Student Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH)", "Interview Descriptions": "Three step process: phone, large panel presentation then candidate meets with individual office members", "Interview Questions": "It seemed like a lot of protocol for a mere advisor/counselor position. This is typical for universities though. "}, {"date": "24 Jun 2013", "title": "A Technical Position Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Case Western Reserve University", "Interview Descriptions": "No phone interview.\r\n\r\n1st interview with manager and a technical person. Went fine. Questions were both technical and about relating to people and managing priorities. I wasn't sold on the job at that point. \r\n\r\n2nd interview round included meeting with 2 more groups, and a followup walk-through. These went well. However they sugar coated the job. I had some direct questions about the responsibilities and about the people that I would work with, but I was essentially lied to because they were desperate to fill the position. \r\n\r\nScrutinize this employer, and hope they are truthful. Look for hesitation in their answers, and don't ignore any other red flags.\r\n\r\nAdditional advice: ask about parking? i.e. how much it costs per month and if it is a mile and a half away. Seriously.... nail it down.\r\n\r\nTo be fair, in talking with many people some departments are far better than others, many do in fact like their work, but there are many departments that should be avoided. I have seen some colleagues in tears, literally! Based on talks with people avoid ITS,  HR,  Kelvin Smith Library, Controllers Office and Biology departments. Oh, I'd avoid the main executive office too, I hear they are a bit cranky in there.", "Interview Questions": "There wasn't anything too difficult."}, {"date": "23 May 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Case Western Reserve University", "Interview Descriptions": "Interview with the secretary in the department.", "Interview Questions": "N/A"}, {"date": "20 May 2013", "title": "Department Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Case Western Reserve University (Cleveland, OH)", "Interview Descriptions": "There are several rounds of interviews and HR is extremely slow to get you started.  Easy interviews, depending on the department.", "Interview Questions": "\"With regard to LGBT issues and those surrounding minorities, how is diversity important in your life?\""}, {"date": "21 Apr 2016", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in May 2013", "Interview Descriptions": "First you will receive a phone interview. If they feel as you are a strong potential candidate, they will advance you to a panel interview. Then a final interview with the VP.", "Interview Questions": "Why would you be a good fit for this job?"}, {"date": "27 Mar 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Case Western Reserve University", "Interview Descriptions": "Personal Interview with PI", "Interview Questions": "Where do you see yourself 5 years from now?"}, {"date": "18 Nov 2015", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Case Western Reserve University (Cleveland, OH) in Mar 2013", "Interview Descriptions": "Firstly had an interview over skype, and was then offered to come for a face-to-face interview on a Saturday morning, with the supervisor and another faculty member. Potential supervior was pleasent. Second faculty member asked inappropriate questions such as marital status, told me Cleveland isn't the place to meet people. Was a strange exchange with second faculty member", "Interview Questions": "Please give a 10 minute presentation on a recent project"}, {"date": "3 Feb 2017", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Case Western Reserve University (Cleveland, OH) in Feb 2013", "Interview Descriptions": "No, interview. I just met with the manager and they hired on the spot.  You don't really need to prepare for any kind of interview, as long as you are student attending Case Western Reserve you are pretty much set to get the job.  It does help to know someone working there to get you foot in the door.", "Interview Questions": "N/A"}, {"date": "14 Nov 2013", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Aug 2012", "Interview Descriptions": "Applied online", "Interview Questions": "What is your research experience?"}, {"date": "1 Oct 2012", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Case Western Reserve University (Cleveland, OH) in May 2012", "Interview Descriptions": "online application, recommendations, face to face interview.", "Interview Questions": "None of the questions were difficult."}], [{"date": "6 Apr 2014", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Feb 2012", "Interview Descriptions": "Submitted application online, was contacted by HR, hired afterwards", "Interview Questions": "Not relevant for this situation"}, {"date": "24 Jul 2015", "title": "Assistant Professor, Medicine Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Case Western Reserve University (Cleveland, OH) in Dec 2011", "Interview Descriptions": "Met with physicians at multiple hospitals, very accomodating.  had to give a talk, and had some harsh critics in the audience, but this led to a good discussion.  very academic environment.", "Interview Questions": "why are you moving to Cleveland?"}, {"date": "6 Oct 2015", "title": "Audio Visual Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Mar 2011", "Interview Descriptions": "I was able to meet the entire team. Including my two bosses.\r\nMy primary boss has proved to be nothing like the interview.\r\nCame across as personable and professional. Is neither.\r\nI should have trusted my gut that boss had no clue how to manage a technical team.", "Interview Questions": "Are you willing to stay several years.\r\n"}, {"date": "27 Jan 2014", "title": "BSTP Graduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Case Western Reserve University (Cleveland, OH) in Feb 2011", "Interview Descriptions": "I applied for Case Western's Biomedical Sciences Training Program (BSTP) during my senior year of undergrad. I'm assuming whomever's reading this is a prospective graduate student, either at Case or elsewhere, since a lot of it's just general advice. Hope it helps someone.\r\n\r\nThe application process is pretty similar to those of other grad schools - you need a few essays, some letters of recommendation, your transcript. Next, select applicants visit CWRU & Cleveland for a few days. During this time, you will interview with five professors (one at a time) in the department or field you are interested in and get a chance to talk with a panel of different professors. You also get plenty of time to mingle with your graduate student hosts, tour the lab areas, and check out Cleveland.", "Interview Questions": "The biggest questions you should ask yourself as a prospective grad student is \r\n1) do I want to do research for the next 6-7-8 years here?\r\n2) would I be happy living here for several years?"}, {"date": "18 Apr 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Feb 2011", "Interview Descriptions": "The interviewers are very nice. That's is a phone interview, but I was in China at that moment. The interviewer pick up a good time for me to do the interview. We also discuss questions out of the technical questions, and have a good conversation. Because all things had been reflected in the resume. and the important thing in the interview was to see whether I was a good communicator.", "Interview Questions": "Tell me about your current or last project."}, {"date": "22 Mar 2011", "title": "Weatherhead School of Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 10 months. I interviewed at Case Western Reserve University (Cleveland, OH) in Dec 2010", "Interview Descriptions": "The right hand doesn't know what the left hand is doing!  Strung me along for 11 mos only to send me a canned, \"you didn't get the job,\" email.  Terrible, terrible experience.", "Interview Questions": "How would you \"sell\" our students/school to the community?"}, {"date": "12 Nov 2010", "title": "Commercialization Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Case Western Reserve University (Cleveland, OH) in Oct 2010", "Interview Descriptions": "easy and brief", "Interview Questions": "Where do you see our self going in the furture"}, {"date": "23 Mar 2011", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Oct 2010", "Interview Descriptions": "The interview took one hour.  Most of questions were asked by the PI about what types of techniques I have.  I had a feeling that the interview was not well organized.  All the questions were just come out from the PI.  I didn't impress the PI, so I was not able to get the position.", "Interview Questions": "How do you find out this posted position?"}, {"date": "10 Jul 2014", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Case Western Reserve University (Cleveland, OH) in Oct 2010", "Interview Descriptions": "Only talked to supervisor and 3 future colleagues in the lab. No difficult questions and even no presentation which surprised me. It was friendly overall. The process took several weeks which is faster than I thought since my previous boss did not want me to leave my job too soon.", "Interview Questions": "No difficult questions for me and overall friendly. Actually during the interview the interviewer talked more than me and introduced what they were doing. Rather than interview, it was more like chatting. The same style with the three people in his group."}, {"date": "25 Jun 2012", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Case Western Reserve University (Cleveland, OH) in Aug 2010", "Interview Descriptions": "Really fast, got called in for an on-campus interview the day after getting a phone interview. From there, I presented some of my work to the team I was interviewing to join and was evaluated by them. Later I had a background check and drug test so that I could start immediately.", "Interview Questions": "How would you implement a role based access control in a clinical application that has a portal exposed to the public?"}], [{"date": "25 May 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in Jun 2010", "Interview Descriptions": "Started communication with phone interview. Then scheduled interview with primary manager. Second interview was then scheduled with higher up folks (2). Interviews were short (<1 hour) and consisted mostly of talking about past research, education, and personality questions.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Aug 2010", "title": "Grants and Contracts Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Case Western Reserve University (Cleveland, OH) in May 2010", "Interview Descriptions": "One on one interview by hiring manager, followed by coffee the next week with hiring manager and director.", "Interview Questions": "Asked me if I was familiar with the particular software they used (PeopleSoft and Oracle)"}, {"date": "23 Apr 2014", "title": "CSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Case Western Reserve University (Cleveland, OH) in Jan 2010", "Interview Descriptions": "Short and pleasant.", "Interview Questions": "N/A"}, {"date": "30 Nov 2009", "title": "SAGES Café Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Case Western Reserve University (Cleveland, OH) in Aug 2009", "Interview Descriptions": "After applying online, was contacted by phone to interview 1:1 with the faculty person in charge of the Café. Was asked questions about experience and how I would act in certain work-related situations—all business. About 4 days later, was contacted again to do a second (final) 1:1 interview, this time with the person I'd be working with (the faculty person was there but left to take a call early on and never returned). This was a get-to-know-you interview, mostly consisting of getting a handle on my personality.", "Interview Questions": "A customer pays with a $20 bill that's counterfeit. What do you do?"}, {"date": "30 Jan 2013", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Case Western Reserve University in Apr 2009", "Interview Descriptions": "ask me to introduce my background, my previous work, ask some technical questions, then behavior questions", "Interview Questions": "what is your weakness"}, {"date": "20 Dec 2009", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Case Western Reserve University (Cleveland, OH) in Sept 2007", "Interview Descriptions": "Asked about previous experience and talked about why I would like the work environment. Took about 3 hours in total. Met with department heads and other potential coworkers.", "Interview Questions": "Do you have experience with APA writing style"}]]