[[{"date": "2 May 2023", "title": "Case Management Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services (Albuquerque, NM)", "Interview Descriptions": "Email to Text message to virtual interview with team: the process was structured in a manner as to provide both sides time to share highlights of all skills and clinical experience as well as communication skills", "Interview Questions": "What was your most difficult discharge encounter?"}, {"date": "4 Apr 2023", "title": "Business Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services (Albuquerque, NM)", "Interview Descriptions": "Initial phone screening was informal, friendly and informative. The process lasted thirty to forty-five minutes and cover job duties, company and office culture and immediate work environment. I left the interview excited about the position and company.", "Interview Questions": "Why I was interested in the position"}, {"date": "1 Mar 2023", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Notified about being selected for an interview by email. A Half hour interview set up with HR for a few days later . It was a phone call with the recruiter. They were very pleasant and talked through the position and it’s requirements.", "Interview Questions": "What is the most complicated project you worked on"}, {"date": "2 Feb 2023", "title": "clinical quality consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "I scheduled a phone screen with a recruiter but the first question asked was if I had experience with infants, which I don’t. From there the recruiter was nice enough to send me some more job postings that might be of interest, even though I didn’t meet their needs for this one.", "Interview Questions": "If I had experience with infants"}, {"date": "20 Jan 2023", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Very easy going. The interview had a panel of 5-6 providers. They flew me to NM, paid for hotel, rental car and paid for lunch. Overall seems like a good place to work at.", "Interview Questions": "How would nurses describe you?"}, {"date": "12 May 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Santa Fe, NM) in Jan 2023", "Interview Descriptions": "Panel interview with scenario questions to assess critical thinking skills, experience and resourcefulness. Several questions about prior experience and career goals. Panel is open to questions from interviewer throughout process.", "Interview Questions": "If you are unable to contact a doctor about a prescription refill and it is approaching the weekend how do you respond to the patient?"}, {"date": "4 Dec 2022", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "They didn't interview me. I did my clinicals there and they offered me a job on the stop. Very low offer unfortunately though. Well below any minimum rate I have ever seen.", "Interview Questions": "They didn't really ask me any questions"}, {"date": "12 Oct 2022", "title": "Senior Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Spoke to the recruiter, then to the hiring manager then did a panel interview that had 6 people. Then spoke to 2 more people and after all that, waited for 2 months and then got a rejection email. I would not advise people to apply to this company. They give you a bunch of false hope.", "Interview Questions": "There was a bunch of coding interview questions on the panel list."}, {"date": "17 Jun 2022", "title": "Vice President, Analytics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services (New York, NY)", "Interview Descriptions": "Role was posted as Remote, but the interviewer asked if I was willing to move to New Mexico as they preferred to have someone onsite. The actual interview was well thought out and thorough. However, the interviewer mentioned they were going to send over follow-up materials and next steps, which they never did. Months later and I still haven't heard anything.", "Interview Questions": "What is your leadership style?"}, {"date": "15 Jun 2022", "title": "Customer Support Banker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM)", "Interview Descriptions": "Call to set up interview by phone or video. Conducted phone interview with multiple people. Then a follow up peer interview in person or trial of typical day. Follow STAR method.", "Interview Questions": "How do I handle stress and priorities."}], [{"date": "30 Sept 2022", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Feb 2022", "Interview Descriptions": "The process was explained thoroughly and you knew what to expect for next steps. The interview was situation/behavior style interview. \nThere was a one on one interview with the hiring manager first which took approximately an hour. Then once you pass that level you received a call back to schedule the 2nd interview with 3 other people from the team.", "Interview Questions": "Explain a time when you encountered a difficult coworker and how did you address it."}, {"date": "16 Nov 2021", "title": "RN OR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Nov 2021", "Interview Descriptions": "before interview, recruiter called me and scheduled me to call actually staff in the hospital.\nThe staff called me the other day,  make an appointment to do shadow and interview", "Interview Questions": "Asked me about my career."}, {"date": "3 Nov 2021", "title": "Emergency Medical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Oct 2021", "Interview Descriptions": "Was given an on-site oral interview with 2 personnel, some basic questions about future goals and plans. Was given a scenario and basically had to give a run down on a emergency medical situation. Patient care to radio communications with the receiving facility.", "Interview Questions": "What are your short term goals?"}, {"date": "16 Sept 2022", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Sept 2021", "Interview Descriptions": "I had 5 interviews with PHS. I rearranged my schedule and life to accommodate them and the excessive number of interviews. I did not get the job. \nI met with the following during each interview step:\n1. The hiring PMO manager\n2. All three PMO managers\n3. Other project managers \n4. Service owners\n5. Senior leadership\n\nThey were all nice people. I got the impression that this was a high stress environment to work in. ", "Interview Questions": "Describe a time you were insensitive to someone?"}, {"date": "24 Jun 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jun 2021", "Interview Descriptions": "Applied to the position and undertook a phone interview 3 weeks later. Interviewer was polite and on time, and seemed enthusiastic about my qualifications. Told me he had to check with HR because I was lacking any experience, which is weird because HR forwarded my resume in the first place. Overall a strange process.", "Interview Questions": "Asked about my technical skillset and why I was applying to the position."}, {"date": "22 Mar 2021", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "I was contacted to interview for this job that I was technically over-qualified for.  At the last minute on the day of the initial interview, I was told that it needed to be rescheduled for the next week.  When I did do the interview, it was changed at the last minute from a phone interview to a microsoft teams interview.  During the interview, I was told that I would 'definitely' be getting at least a second interview, and that they were excited to interview me for my skills and education that related to the position.  I was also told that they take their time with interviewees, doing 3 rounds of interviews to find the right fit.  The very next day, I received a rejection email.  I contacted the interviewees to see why this was, since I was told that I would be getting a second interview .  After I notified them, they said that they had sent me the rejection email on accident and sent me an email for a second interview.  When I did interview for the second time, I was told that they were making the decision that day on who to hire, and I never heard back from them again.  It was not only a waste of my time, but the most unprofessional and strange interview process I've ever experienced.", "Interview Questions": "They only asked me a few questions, not near enough to make a decision about the hire, which is concerning."}, {"date": "3 Feb 2022", "title": "Customer Service Representative (CSR) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Presbyterian Healthcare Services in Mar 2021", "Interview Descriptions": "Submitted materials. The first call is similar to a screener to see if they want to pass you along to interview with the hiring manager. I had my interview over the phone with the manager. They tell you about the job and duties, pay etc. The interview consist of the STAR method, pretty easy questions.", "Interview Questions": "Tell me about a time you had to complete multiple task in a short window of time."}, {"date": "22 Mar 2021", "title": "Financial Analyst III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Feb 2021", "Interview Descriptions": "I had a total of 3 interviews by phone and video. The first was with the hiring manager and team. The second was with another manager, and the final was with the director.", "Interview Questions": "I was primarily asked behavioral questions (i.e. \"tell me about a time when...\"). I was also provided a hypothetical situation and asked for an in-depth explanation of how I would approach the analysis. "}, {"date": "20 May 2021", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Presbyterian Healthcare Services (Rio Rancho, NM) in Jan 2021", "Interview Descriptions": "Very easy and smooth simple question and orientation was great and learned a lot before being by yourself.  Very open availability and did a work day before interview for a hour to really find out if you like it or not.", "Interview Questions": "When is a ability and when can you start"}, {"date": "7 Dec 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "two quick in-person interviews. One was with perspective coworkers in the same position I was interviewing for, and the other was with the hiring manager. I do not remember having a phone one.", "Interview Questions": "N/A"}], [{"date": "26 Oct 2020", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM)", "Interview Descriptions": "Applied for position, was told I had to take an assessment test after doing the IT job for over 30 years.\r\nI told them no and so did a friend who had applied for a Project manager position. He has 16 years’ experience as a project manager.\r\nWe both told them this was an insult given our back grounds. My friend just walked away. I talked to one of their IT recruiters who did try to get me in front of the hiring manager. While she was doing that I got an un-signed email saying if I didn’t take the Assessment test I wouldn’t be considered for the position.  I believe this was an attempt to dis-qualify me for that position so they could tell me that I only qualified for a business systems analyst position.\r\nThe IT recruiter did get back to me and told me they had their procedures that they had to follow.  I told her I wouldn’t take the assessment test to prove I could do a job I’d been doing for 30 plus years. I walked away.\r\nShortly after that I got an email asking me to consider an IT business analyst job at about 50% of what the pay should be. I said no.  \r\nThey re-posted both jobs this time without the assessment test requirement but the pay was very low.\r\nI applied and never heard back. They then posted it outside the state with a salary of 130 to 160 thousand with relocation help. Never got an interview.", "Interview Questions": "they tried to get me to take a lesser job for a lot less money, same duties, long hours "}, {"date": "12 Oct 2020", "title": "Senior Secretary/Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Sept 2020", "Interview Descriptions": "Proffesional, Efficient. Very friendly and courteous.  Everything was clear and concise. Every question was very well thought out and allowed the opportunity to express the interviewee to answer honestly.", "Interview Questions": "What motivates you in the work environment?"}, {"date": "24 Jul 2020", "title": "New Grad Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jun 2020", "Interview Descriptions": "Phone call screening with a recruiter was very pleasant. Recruiter answered a lot of my questions. I then had an interview with unit nurse managers which consisted of behavioral type questions. They wanted to see if I was a good fit on the unit.", "Interview Questions": "Why do you want to work for Presbyterian?"}, {"date": "5 Oct 2021", "title": "Exercise Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jun 2020", "Interview Descriptions": "Questionnaire, then phone interview, then physical interview with 3-4 staff and various open ended questions related to clinical experience in cardio pulmonary rehab. Great for seeing if you will be a good fit into team", "Interview Questions": "What would you do if a patient came to you complaining of chest pain"}, {"date": "2 Jul 2020", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jun 2020", "Interview Descriptions": "First a phone call, then a peer interview, then another interview with manager, then HR calls to make you an offer. I asked for more money, so I had to wait, but then they came through on that.", "Interview Questions": "Teamwork questions "}, {"date": "5 Jun 2020", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Presbyterian Healthcare Services (Clovis, NM) in May 2020", "Interview Descriptions": "Well organized with detailed presentation of the hospital system.  In addition I received a tour of the facility.  The staff and hospital directors provided comfort and ease during the interview process.", "Interview Questions": "What are 3 strengths and 3 weaknesses? "}, {"date": "2 Mar 2020", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Feb 2020", "Interview Descriptions": "They are interested in hard working people and you must show up on time. You have to be patient and aware of this job.  They will call you to make a phone interview and then group interview if you were acccepted.", "Interview Questions": "Why you want this job and what are your weaknesses"}, {"date": "10 Oct 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Oct 2019", "Interview Descriptions": "Presbyterian uses an automated keyword process for pulling resumes, a ~100 question behavioral survey, and then finally calls for interviews. First interview is normally with a manager. Second interview is a team format with multiple staff. The STAR behavioral interview questions are what they use most. “The STAR method is a technique of answering behavioral interview questions in a structured manner by describing a specific situation, task, action, and result of the situation you are discussing. The STAR method helps you explain in a simple yet powerful way how you handled specific work situations and challenges.“", "Interview Questions": "Tell us about a conflict with a patient or coworker and how you handled it."}, {"date": "5 Jun 2019", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services in Feb 2019", "Interview Descriptions": "Hour long manager interview with peer sit in, final fit interview with up to 5 people. Communication could’ve been better. I was told someone would contact me with a start date almost 3 weeks went by before they checked to see when I planned on starting.", "Interview Questions": "Why Presbyterian?"}, {"date": "3 Jan 2019", "title": "Actuarial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Presbyterian Healthcare Services in Dec 2018", "Interview Descriptions": "I applied online. After two days, a senior recruiter called to scheduled a 30-min phone interview with me. Mostly behavioral questions. Something like tell me more about your experience at XXX (on your resume). Later stages include a phone interview with a hiring manager", "Interview Questions": "Tell me more about your experience at XXX (on your resume)"}], [{"date": "30 Oct 2018", "title": "Analyst/Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Presbyterian Healthcare Services (New York, NY) in Sept 2018", "Interview Descriptions": "Had a phone interview then a panel interview with the staff and then a 3 hour shadow interview.  Overall not a hard interview, however I was not impressed with the shadow interview.  The staff seemed very lazy and were using poor language and talking about other people working around them.  I understand that this team is close, but being that they have a guest interviewing for a position  they could have been better about the language that they used while I was around.  Shadow interview they want you to ask questions about what they do on a daily basis, after asking a few I got the feeling they knew I wasn't a candidate for the job with one employee saying \"well we have to bring a certain amount of people to do the shadow but we usually have our minds made up\"  it was a huge waste of time and my questions were met with 1 word responses and I was ignored for at least half of it .  As far as the interview goes it was easy just Star based questions .", "Interview Questions": "name a Time you disagreed with a manager and how you responded"}, {"date": "18 Aug 2018", "title": "COTA/L Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Presbyterian Healthcare Services in Aug 2018", "Interview Descriptions": "An impromptu telephone interview was conducted prior to a scheduled in-person panel-format interview. Very friendly inpatient acute rehab team. Questions were asked, interviewee responds, and all panel members record notes on interviewee’s answers. A formal tour and job shadowing commenced immediately after the panel interview.", "Interview Questions": "What do your professional goals look like?"}, {"date": "8 Sept 2018", "title": "Nurse - Transition to Practice Program Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Aug 2018", "Interview Descriptions": "Initial phone screening (about 20 minutes) followed by formal 45 minute in-person interview with additional hours spent shadowing a nurse on the floor.  \r\n\r\nFor the Transition to Practice program, the hospital wanted a 3 YEAR contract - with nothing given to the applicant other than the \"training\" provided (which was similar to that of most other hospitals).", "Interview Questions": "Tell us about a time you when above expectations to satisfy a patient."}, {"date": "27 Jan 2019", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jul 2018", "Interview Descriptions": "I was contacted via phone by a recruiter to set up a time to schedule an in-person interview. I was part of an in-person interview at the facility with three members of upper-management including a commander from the education department.", "Interview Questions": "Why are you the best person for this position?"}, {"date": "16 Apr 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Phone interview and then panel interview with five people. It was a friendly atmosphere. The opportunity to job shadow was offered after the second interview. Questions were straightforward and not difficult to answer. Behavioral based questions made up the majority.", "Interview Questions": "Tell about a time your made a mistake"}, {"date": "26 Apr 2018", "title": "Applications Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Mar 2018", "Interview Descriptions": "Interview includes one HR round and a technical round. HR round will be more focused on behavioral questions based on situations like during the time of Release , on weekend if you get a call to support etc..", "Interview Questions": "1. HR Interview was more behavior oriented. For eg: How would you convince a new idea if your manger doesn't like it.\r\n2. SQL Related, basic to Intermediate level questions."}, {"date": "28 Mar 2018", "title": "Registrar - Admitting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Rio Rancho, NM) in Mar 2018", "Interview Descriptions": "Got a call from the ER supervisor to set up an interview at around 8 pm (night shift) I made it work and went in at 7 pm the next evening for my interview. It went amazing, really got along well and then followed by a peer to peer interview. The girls who did that were very nice. The whole atmosphere seemed to run smooth while the stressful circumstances of the Emergency Room.  She set me up for a follow up interview the next day with the director. After leaving, I received a call from HR with a job offer!!!", "Interview Questions": "Real life scenarios, how did you handle it, etc"}, {"date": "30 Jan 2018", "title": "Manager - Analytics Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "The interview process overall took more than 2 months but I was okay with it as I wasn't  really looking for any opportunities.  I had a phone interview with the hiring manager. Post that I has another telephonic interview with bunch of folks. It was well organized and conversational. Following that I had an in-person interview. There were 3-4 rounds. But most of  it was specific to my experience. They really wanted to know if I could scale up to the role that they have. Overall pretty good experience. unfortunately we couldn't agree on the pay. The staffing agency plays the role of HR and they are the ones that negotiated the salary and not the folks from the organization. That part was a bit strange", "Interview Questions": "Asked about my experience in Analytics, Health plan etc.."}, {"date": "10 Jan 2018", "title": "EPIC Configuration Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Nov 2017", "Interview Descriptions": "I was called for the first interview a few weeks after applying online.  The first interview was a peer interview, and all the questions were behavior based (STAR - situation, task, action, result).  The employees in the group were all very pleasant and welcoming.\r\n\r\nThe second interview was a couple of weeks later, and was a shadowing interview, where I was scheduled to come into the office and sit with the team members for three hours to get a better idea of the work they do.  This was very, very helpful to me in determining if the position would be a good fit.\r\n\r\nThe last interview was a few weeks after the shadowing interview, and was with IT management.  The questions again were all behavior based.  \r\n\r\nOverall, the process was a bit long, but well worthwhile.  Everyone I met at Presbyterian was nice, professional and helpful.", "Interview Questions": "What accomplishment are you most proud of?  Describe a time when you failed and what you did.  When you have to learn something new, what are the steps you take?  "}, {"date": "31 Oct 2017", "title": "Labor and Delivery RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Oct 2017", "Interview Descriptions": "Hiring process was long and drawn out. It took 4 wks to complete the process. The interview was 30 minuets long. Easy going and felt like things were going good for my benefit.", "Interview Questions": "What are your long term goals?"}], [{"date": "27 Aug 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Brief, interviewed by the charge nurse and the manager, it was casual. I have been in the same position for many years with a less complicated interview process. It was a positive experience.", "Interview Questions": "Job experience in areas previously worked."}, {"date": "26 Aug 2017", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Aug 2017", "Interview Descriptions": "Interview process was quick and easy. Very polite and knowledgeable HR staff doing the interviews. There is usually two people in the room with you and both are taking turns asking questions. They make it very calming and not intimidating at all.", "Interview Questions": "Name a time when you went above and beyond for a co worker or a patient"}, {"date": "28 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jul 2017", "Interview Descriptions": "One phone screening and a panel interview with 4 interviewers, including who would be my immediate supervisor and manager. The phone screening was simple and easy. Basically, he just asked me a few questions about my previous positions. I had an opportunity to ask questions as well. I was then scheduled for a panel interview which was kind of intense. A lot of questions requiring specific examples. After the question and answer part of the interview was over, I was then asked to create a sample letter that would be similar to the types of letters I would be sending out to members in the position I was applying for. The entire length was about 1 hour.", "Interview Questions": "Name a time when you made a mistake at work and describe how you handled it."}, {"date": "9 Jul 2021", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services in Jul 2017", "Interview Descriptions": "Group interview ~5 people with behavior based questions. It took place in the rehab office at Presbyterian. We talked about the job duties and previous experience I had that would contribute to the job.", "Interview Questions": "Tell me about a time where you did not agree with your supervisor and how did you handle it?"}, {"date": "14 Apr 2017", "title": "Ultrasound Specialist PRN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Apr 2017", "Interview Descriptions": "Asked a lot of detailed questions about previous job experiences and clinical experiences. The interview was a lot more in depth and detailed than I had expected due to the fact that we never went over practice interview questions. May have been more prepared if I had had a mock interview showing what job interviews might be like.", "Interview Questions": "Questions about specific experiences dealing with previous managers or other departments, etc."}, {"date": "8 Jan 2017", "title": "Paramedic Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jan 2017", "Interview Descriptions": "Standard interview process, with standard interview questions. Nothing pertaining to the duties of a paramedic were asked. The interview committee consisted of ED nurse managers, and assistants. If you are a finalist for the position you will be asked to job shadow for 4 hours and a decision will be made post shadow.", "Interview Questions": "Tell us about a time where you went above and beyond for a patient"}, {"date": "9 Dec 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Presbyterian Healthcare Services (New York, NY)", "Interview Descriptions": "It was very smooth. There were five people asking questions and they were so nice. They were so helpful. They were so inofrmative. I applied in the morning and they called me to go for interview by lunch time.", "Interview Questions": "What is your weakness?\r\n"}, {"date": "2 Feb 2017", "title": "Internal Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Aug 2016", "Interview Descriptions": "3 phone interviews, 1 panel interview, 1 one on one peer interview. Everything was as expected except for the panel interview when one individual kept getting pulled out of the interview for an apparent crisis situation. The process ended with radio silence, even after inquiring about my status.", "Interview Questions": "Tell us about a time you've prepared a principal for an interview or other public presentation."}, {"date": "13 Jul 2016", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Presbyterian Healthcare Services (Rio Rancho, NM) in Jul 2016", "Interview Descriptions": "A Panel of 2 nurses and director of the facility were present.  They all took turns in asking questions and writing down  on their flow sheets their thoughts. I had my turn at asking questions. Then I got a tour of the awesome facility, which included provider areas, nursing areas, phone triage sections, exam rooms, radiology, waiting rooms, front check in desk and discharge desk areas.", "Interview Questions": "Questions pertaining to how would you handle stress, customer outbursts, challenging situations, fellow employees that you have a conflict with, etc."}, {"date": "2 Jan 2018", "title": "Member Navigation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in May 2016", "Interview Descriptions": "The interview was easy and took place about 1.5 years ago.  There was a panel of people who asked questions that pertained to the job I applied for.", "Interview Questions": "I don't remember because the interview as 1.5 years ago."}], [{"date": "12 Apr 2017", "title": "Medical Staff Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Presbyterian Healthcare Services (Spokane, WA) in Apr 2016", "Interview Descriptions": "It was okay. There were a couple of leadership personnel who paid more attention to their cell phones then they did during the interview. Otherwise, the rest of the one-on-one interviews were professional.", "Interview Questions": "Why I wanted to work for Deaconess"}, {"date": "8 Mar 2016", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Mar 2016", "Interview Descriptions": "i really enjoyed the hiring process part were i got to go in and get the flow of everything, i was able to meet the patients and all the workers on that day also where the supplies and etc were. I really hope i get the opportunity to work there", "Interview Questions": "describe a time you had a difficult patient and how did you handle the situation"}, {"date": "13 Sept 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services in Mar 2016", "Interview Descriptions": "The interview process was 3-4 levels (multi-tiered) with many levels of employees and leadership involved.  Interview questions were repeated, and were behavioral/situational in nature, not so much based on resume or previous experience.", "Interview Questions": "Situational and behavioral interview questions"}, {"date": "18 Feb 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM)", "Interview Descriptions": "Initial call-back for the interview took quite a while. Had two sets of interviews, one was a group interview and the other was a one-on-one interview with the department manager. The usual questions were asked, strengths, weaknesses, and how you deal with mistakes and issues as they arise at work. Everyone was polite and concerned with finding the right fit for the department and the position.", "Interview Questions": "Describe an incident where you made a mistake in your previous employment - how did you resolve it?"}, {"date": "9 Feb 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Feb 2016", "Interview Descriptions": "the interview was a luncheon interview and very laid back. behavioral type questions. it took about two weeks to be scheduled for the interview. you receive a call and they ask you a few questions over the phone to see if you are a right fit. After that they bwill schedule an in person interview.", "Interview Questions": "Tell us a time when you went above and beyond your job obligation what did you do and what was the outcome."}, {"date": "6 Dec 2015", "title": "Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Presbyterian handles all job applications online. You submit your resume and cover letter and then wait...and wait...and wait. If you are lucky, you'll be contacted for an interview. More likely, you will never hear anything again. If you are contacted, you are invited in for an interview with direct managers/supervisors. If they like you, then you have to come in for a \"peer interview\" where the people you will work with ask you questions to determine if they want to work with you. Human Resources requires at least three candidates to go to the peer interview process. But here is what they don't tell you. Often, the management has decided who they want to hire before the job is even posted -- but in order to meet the HR requirements, they will post the job, call in people for interviews, and then call some of them back for the peer interview -- knowing all along that none of them will get the job. It is an incredible waste of time for everyone involved. Often times, after an interview you will never hear from anyone again -- you are left wondering if they hired someone or not. Occasionally, you will get an automated email informing you that you were not chosen.", "Interview Questions": "Presbyterian uses \"situational\" questions in interviews. They will ask you to talk about a specific incident and explain the specific steps you took to address the issue and what the outcome was. For example, \"Tell me about a time you had a disagreement with a coworker. What steps did you take to address the issue and what was the final outcome?\""}, {"date": "4 Dec 2015", "title": "Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "I applied online, about a month later I got a call where they asked me to come in and interview in person. I went in to interview and everyone was really nice, they had a cart they were pushing around with refreshments which I thought was very cool. I interviewed with two different managers and they asked me the basic interview questions and we made a good conversation out of the fact that I am in school for nursing and they were very enthusiastic about helping me with my goals. I thought the interview was amazing. Turns out interview was awesome because two days later one of the managers called me and said they wanted to offer me the job.... :) all in all the process was fairly quick and a great experience.", "Interview Questions": "Tell me about a time you made a mistake and how you fixed it?"}, {"date": "19 Oct 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM)", "Interview Descriptions": "Two step interview, one with management, one peer interview after job shadow. Simple situational questions drive from the questionnaires when apply for the job, but not too hard, reasonable questions to ask.", "Interview Questions": "Why should we hire you?"}, {"date": "2 Jun 2015", "title": "Nurse Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services in Jun 2015", "Interview Descriptions": "I put in an application on the website. A few weeks later I got a call telling me they had looked at my resume, and asked if I had 15 minutes to go a head a do a phone interview. Once that was over I was told I did well and was asked when I would be free to do an in person interview. I have that scheduled but have not done it yet.", "Interview Questions": "How would you handle a dispute in the workplace? Name a time when you have shown compassion to someone."}, {"date": "20 Aug 2015", "title": "Registrar II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Presbyterian Healthcare Services in Jun 2015", "Interview Descriptions": "Applied, a month later was contacted for a phone interview. Two weeks later contacted for a face to face and peer interview then a couple days later was contacted about accepting job position.", "Interview Questions": "Describe a time you had difficulty working with a co worker and how you handled the situation"}], [{"date": "26 Mar 2015", "title": "Financial Analyst III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM)", "Interview Descriptions": "Email and then phone call.  If you pass those you come in for interview. The biggest thing is to get noticed by hiring manager after that you are pretty much in.", "Interview Questions": "Nothing odd"}, {"date": "5 Jul 2014", "title": "Radiology Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Peer interviewing........................................Be prepared and know the mission statement and the CARES model. Interview questions are based on this model.\r\nCare Continue Learning\r\nAccountability \r\nRespect and Respond\r\nEnvironment of Health\r\nSuperior Outcomes\r\n\r\nDress professional and never wear jeans. Men I would wear a tie.", "Interview Questions": "Why should we hire you over all the other candidates"}, {"date": "19 Nov 2017", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jul 2014", "Interview Descriptions": "The interview process consist of a STAR.  Situation, task, action you performed and the result.  This is how the responses are expected to be framed to their questions.  The questions are relatively standard questions", "Interview Questions": "What would you do if you were sick and had a project to complete."}, {"date": "18 Feb 2014", "title": "Sever Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Hide tattoos and dress nice and be honest", "Interview Questions": "remember a time where you and your friend hard a bad argument and how did you solve it"}, {"date": "4 Mar 2014", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Jan 2014", "Interview Descriptions": "phone call, poss. shadowing of job, then a group interview, maybe one on one. it depends.", "Interview Questions": "the most difficult question i was asked was, if offered a different position with more pay would i take it??"}, {"date": "14 Jul 2017", "title": "HR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Dec 2013", "Interview Descriptions": "Met with the hiring manager 1:1.  I was then scheduled for interviews with the two senior leaders in the organization.  The last interview was with the team of peers.  Overall it took about 2 weeks and was a positive experience.", "Interview Questions": "Q:  Tell us about a time when you had to deal with a sensitive issue that involved a leader.  What happened, how did you handle it, what made it difficult to deal with, did you deliver a challenging message and what was the outcome. "}, {"date": "22 Nov 2013", "title": "Appeals and Grievances Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Presbyterian Healthcare Services", "Interview Descriptions": "Strong emphasis on personality, they want to see how you will respond in given situations. There was a writing test to evaluate professionalism and compassion. \r\n\r\nThe questions were standard: How would you handle various scenarios, give an example of time when...", "Interview Questions": "How would you handle it if you co-worker was not meeting deadlines?"}, {"date": "22 Aug 2015", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Nov 2013", "Interview Descriptions": "everyone was friendly, group panel type of interview, asked the normal questions, discussed things that have been improved and things to be improved, discussed work scheduling had to job shadow", "Interview Questions": "what were my career goals"}, {"date": "13 May 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Presbyterian Healthcare Services in Feb 2013", "Interview Descriptions": "The administrators/HR were not able to formulate any questions that were challenging or insightful. The questions sounded like they came out of an \"How to Interview Successfully\" book. The area of the interview was disruptive and noisy and the process was inconsistent. Job shadowing provided a good insight into the actual job role and responsibilities. Some of the mentors had less education and were not able to demonstrate any reliable information in response to some critical questions.", "Interview Questions": "Same standard questions which most people can answer with their eyes closed"}, {"date": "8 Mar 2014", "title": "Care Coordination - RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Dec 2011", "Interview Descriptions": "Involves staff and peer review. Good process. Shoots to get the right person to the right job. Sometimes difficult to get to the interview process. You will have to make sure they have received your application at times and follow through to make sure it got to the right person. But the interview process itself is fair and reasonable.", "Interview Questions": "These are all behavioral type questions.  Nothing unexpected if you research those types of questions."}], [{"date": "6 Jun 2014", "title": "Radiology/X-ray Tech Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Presbyterian Healthcare Services (Dallas, TX) in Feb 2011", "Interview Descriptions": "It takes HR a long time to get you in for an interview.  Most of the new hiring comes from word of mouth.  By the time they get to you.  You will be working at another job.  There is no trick question they just ask how much you are looking and give you all the packages for insurance and so forth.", "Interview Questions": "Are you a caring person.  Can you work in the capacity of proving care for sick individuals."}, {"date": "7 Nov 2009", "title": "PFS Billing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Sept 2009", "Interview Descriptions": "After applying online, I received a phone call to come in for an interview.  After I completed the first interview, I was asked to return the next day for a peer interview.  I thought all had gone very well, but I was never contacted again.  After a week of trying, I finally reached the hiring manager by phone and was informed that I was not chosen for the position.  I understand that companies cannot respond to every applicant, but they could at least inform those few interviewed when they are not chosen.  Overall, it was a decent experience.  With this company, getting to the interview stage is the hardest part....", "Interview Questions": "If you were working on a difficult task that requires your full attention, and you are continually interrupted by a coworker, how would you handle that situation?"}, {"date": "17 May 2013", "title": "IT Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Apr 2009", "Interview Descriptions": "They ask a lot of behavioral-oriented questions, like what would you do in such and such a situation or describe a time when you demonstrated ____________ (a certain behavior or skill).", "Interview Questions": "N/A"}, {"date": "28 Jun 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Presbyterian Healthcare Services (Albuquerque, NM) in Feb 2009", "Interview Descriptions": "Seems pretty random who will be conducting the interview. It's whoever is available at the time. The do use Peer interviewing and Rubric questions for legal reasons, but the selection decision seems pretty arbitrary. They still like to hire internally, but that is a recent change", "Interview Questions": "Describe a bad outcome, what did you do, how was it resolved, what was the outcome?\r\nThey like quick answers that are specific to a patient."}]]