[[{"date": "13 May 2023", "title": "Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "I had an interview with a recruiter and then ultimately never heard anything back. Going through the interview reviews, it seems that NRDC has a bad habit of ghosting people it interviews, which is extremely disappointing/hypocritical for an organization that has applicants write about how they would implement DEI in the role.", "Interview Questions": "Why are you interested in this role?"}, {"date": "29 Apr 2023", "title": "Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "The first round interview was by a contractor conducting the search for this position. The questions were pretty standard, and had nothing to do with job skills or fit. They were mostly about salary requirements, willingness to work in a hybrid environment. The second interview is conducted by the actual supervisor for the position.", "Interview Questions": "Are you willing and able to work in a hybrid in-person/remote position?"}, {"date": "18 Feb 2023", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "The interview process was 3 rounds - the first was with the hiring manager, the second with someone on the team, and the third was a four person panel including the original hiring manager. My qualm with this process was that it took around 2 months to complete", "Interview Questions": "-What was your biggest accomplishment -Describe your ideal workplace -How would you describe yourself professionally, give your strengths and weaknesses -What's one of your personal pitfalls -Describe a project you completed, what went well and what didn't"}, {"date": "23 Jan 2023", "title": "Policy Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "Takes a very long time. Made it through 3 rounds. Time between first and second round was much quicker. Time between first and second was well over a month. Whole process was 5 months", "Interview Questions": "Specific policy initiatives even though I hadn't specialized in this field"}, {"date": "21 Jan 2023", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "The interview process included a screening interview with HR, multiple interviews over several months, and a writing test. The organization said they'd give me a decision by a certain date and I never heard from them again.", "Interview Questions": "Standard questions - my experience, why I want to work there, etc."}, {"date": "30 Dec 2022", "title": "Manager Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "A few weeks after submitting my application I had a brief phone screening with a third-party recruiter, then a month later I had a first round interview (via zoom) with the director. Was told I would hear back in 2 weeks about next steps (a panel interview and a writing assignment). Received an email 6 weeks later, after much follow up, saying the position had been put on hold and that they would resume the hiring process next week... I never heard anything again. Overall, the lack of communication was very disappointing. It's strange that such a large and progressive organization, especially one with many job openings, does not have a better hiring process and clear communication.", "Interview Questions": "The recruiter asked questions to clarify my skill set and experience, the call was around 20 minutes. The interview with the director was an hour and the questions were fairly simple and straight forward."}, {"date": "24 Feb 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at NRDC (Washington, DC) in Jan 2023", "Interview Descriptions": "I received a request for an interview with the HR rep 3 months after applying. After speaking with her I had 2 interviews- a panel and a final interview. This all happened within 2 weeks. I was told I would hear back by end of week regardless of the outcome. When I had not heard back I reached out the following week and received no response. \n\nThe interview questions were your average questions for the role and the team and director \nwas engaging and very kind. My experience with them was positive, however, was dampened when I was ghosted by HR. For an organization that prides itself on DEI and raising the bar, they fall short on common courtesy.", "Interview Questions": "How do you balance competing priorities?"}, {"date": "12 Dec 2022", "title": "Human Resources Operations Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NRDC", "Interview Descriptions": "The interview process started off easy and manageable. The scheduling was accommodating, and I felt the flow of each interview was relaxed. However, there was never any follow-up. The Recruiter they use provided incorrect salary information and did not provide feedback if you were not selected to move forward. She just stopped responding.", "Interview Questions": "Q: How would you be able to handle multiple urgent requests/deadlines?"}, {"date": "16 Mar 2023", "title": "Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at NRDC in Dec 2022", "Interview Descriptions": "- 1 month to review application - 1 month for screening interview - 1 month for second interview - Waited 3 months to receive that I was not selected for a third interview", "Interview Questions": "What drew you to apply for this role?"}, {"date": "3 Nov 2022", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "Three interviews - screening interview with HR representative, followed by a one-on-one with potential supervisor, followed by a panel interview with team. All interviews carried out via online platform. Flexible timing and warm reception from all members of the team. Clear communication throughout the process. Final decision was delayed longer than expected.", "Interview Questions": "Why are you interested in this role?"}], [{"date": "20 May 2023", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC in Oct 2022", "Interview Descriptions": "I interviewed for six months. Communication throughout the process was pretty poor. I always had to follow up to get an update and sometimes had to follow up several times.", "Interview Questions": "Why NRDC? Questions about how you work? Mostly standard questions"}, {"date": "12 Oct 2022", "title": "Donor Onboarding Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NRDC in Sept 2022", "Interview Descriptions": "The process was fairly speedy (unless you count the fact that I was ultimately ghosted.) I heard back the day after applying. There were three rounds of interviews: a phone screen with an HR rep, an interview with the manager for the position, and a panel interview. Each of those happened over the course of consecutive weeks. The phone screen was better than usual: the HR rep had a good understanding of the role and the team, so she was able to answer my questions. (That's often not the case.) The interview with the manager for the position went extremely well. It felt very conversational. The panel interview was a bit more formal, but still not particularly stressful. The group of people participating made sense. \r\n\r\nThe interview process was clearly laid out and they followed through except that I was told I'd hear back after the final panel interview and did not. I gave it an extra week after they told me (because things happen), then sent two inquiries (which I was invited to do). I eventually heard back about a month after the final interview was held (after assuming I'd been ghosted). Somewhat disappointing after the extensive interview process, but maybe the offer to the successful candidate was delayed or something. I would urge NRDC to work on providing timelier updates to candidates. One other disappointment: they had a lot of emphasis on DEI throughout the process, but when I asked in the final interview about what steps NRDC had taken organizationally to promote DEI, I got a fluffy non-answer. As a woman of color, it impacts my work life if a company is only \"performing\" equity and inclusion, so the lack of a clear answer to that question was disappointing.", "Interview Questions": "There were quite a few questions in each interview about diversity, equity, and inclusion. One question was to define the terms and explain how you would seek to promote diversity, equity, and inclusion if hired. It was also a written question on the application."}, {"date": "18 Jul 2022", "title": "Associate Attorney Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "Phone screener, Zoom interview with 2 attorneys, and then Zoom panel interview with a bunch of people tangentially connected to the position. Got to the final interview round and completed a writing assignment (that took far longer than they claimed it would take) and didn't even get a form rejection email - just nothing. It looks like that has been other people's experience as well. I thought it was extremely unprofessional to make someone spend hours of their life on this process and then not even give them the courtesy of a quick email saying they didn't get the job.", "Interview Questions": "Something about diversity and inclusion "}, {"date": "23 Jun 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at NRDC", "Interview Descriptions": "The interview questions themselves were very easy, consisting of a couple calls with recruiters followed by a 1:1 with the hiring manager and then a panel interview.\n\nThe odd part was the communication and process. As numerous others here have complained about, NRDC apparently just ghosts on you when they decide you're no longer under consideration. It's a crummy feeling, particularly as I wasn't necessarily looking for a job when they approached me out of the blue and asked me to apply. I experienced the whole \"you're a great and amazing candidate definitely moving forward!\" then, like hitting a wall, communication suddenly stops and they don't even respond to a simple email asking for an update.\n\nSince I wasn't looking for a job anyway, no harm done, but it does seem like a waste of my time. The bare minimum effort would be telling someone they were not selected. We're all adults, but this whole avoidance thing from HR has got to stop.", "Interview Questions": "Have you led a project team?"}, {"date": "6 Jun 2022", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC in Apr 2022", "Interview Descriptions": "The interviewer was very good at asking questions and actively catering the conversation around what was being discussed and factoring in facts about me. They were friendly and kind and cordial.", "Interview Questions": "N/A"}, {"date": "26 May 2022", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at NRDC in Apr 2022", "Interview Descriptions": "It started with a phone screening. Then there were 2 rounds of interviews ( with the hiring manager, then with the selection panel).  They moved fairly quickly, each interview a week apart.", "Interview Questions": "Why do you want to work at NRDC?"}, {"date": "26 Jun 2022", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NRDC (Chicago, IL) in Apr 2022", "Interview Descriptions": "Applied through the portal, was invited to the initial phone screening, then an interview with two people on the team, didn't make it to the third round (which would've been the direct supervisor for the position)... everything was very spaced out and not many interim updates.", "Interview Questions": "Why do you want this position?"}, {"date": "6 May 2022", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NRDC (Washington, DC) in Apr 2022", "Interview Descriptions": "Passed 3 rounds of interview. Felt like all of them including the virtual interview with the hiring manager and the final panel interview went well. Never communicated the hiring decision. Did not respond even to the multiple follow up emails.", "Interview Questions": "How important is DEI to you"}, {"date": "16 Mar 2022", "title": "Legislative  Advocate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NRDC (Washington, DC)", "Interview Descriptions": "Following application, a member of their team reached out to ask that I interview with the Legislative Director. Interview took place with no additional follow up. \r\n\r\nInterview itself was relatively straightforward.", "Interview Questions": "What qualifies you to work at NRDC?\r\n\r\nWhat issues or policies, if any, do you disagree with NRDC on?"}, {"date": "17 Aug 2022", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at NRDC (San Francisco, CA) in Mar 2022", "Interview Descriptions": "The first step of the process started with a phone call with an HR officer where we talked more about the position, some of my skills, and my interest in the position. A second interview was scheduled a few weeks later with two people whom the PA would be working closely with. This 2nd interview was very conversational and had many questions that allowed me discuss my background, experience, and possible ways I might contribute. A 3rd and final panel interview was set up for the following week, which included the majority of the team the PA would be working with as well as another admin, a PA from a different department, and the HR officer from before as a moderator.", "Interview Questions": "How do you build relationships and connect with people?"}], [{"date": "17 Feb 2022", "title": "Sr. Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "I had a phone screen with the recruiter, a 1:1 with the hiring manager, and then a panel interview. Each stage took 1-1.5 weeks before I heard back and most of the time, it was quite disorganized. I got a verbal offer and was asked to give an answer in less than 48 hours but never received the written offer after 72 hours so I declined.", "Interview Questions": "Mostly situational questions like \"Tell me about a time when...\""}, {"date": "11 Apr 2022", "title": "Assistant Corporate Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC in Jan 2022", "Interview Descriptions": "I first had a phone screening with an external recruiter (who was great), and then interviewed with the Corporate Counsel team via Zoom. At the end of that interview I asked what their next steps were, and I was told that they would get back to me within a week at the latest and then there would be a writing test and a final interview. \r\n\r\nHowever, after that I never heard from anyone at NRDC again. I contacted the recruiter a couple weeks later and got no response. I then contacted the assistant who set up the Zoom interview almost a month after I was supposed to hear something and got no response there either. I have always been a huge supporter of the organization and it was just extremely disappointing to be treated so unprofessionally. I really would have preferred a form email over being told someone would get back to me and then having everyone involved ghost me. I think at the very least people deserve to know that you will never get back to them and they should move on and look elsewhere.", "Interview Questions": "The interview questions were pretty standard: we discussed my experience, but there were a few difficult hypotheticals posed to try to understand how I would assess a particular legal issue or problem. "}, {"date": "7 Dec 2021", "title": "Attorney Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "I had a screener with human resources. After that there were two rounds of panel interviews (one small panel, one large panel). All rounds had a list of questions the interviewers went through and did not respond or react  to answers.", "Interview Questions": "Describe how you run an inclusive team"}, {"date": "30 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "The interview process was straightforward and fair. they asked straightforward questions and there were no surprises. Human Resources was great to work with as well. I recommend applying to this organization.", "Interview Questions": "Why do you want to work at NRDC?"}, {"date": "28 Oct 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NRDC in Aug 2021", "Interview Descriptions": "First step is a short phone screening, which is then followed by an hour-ish long call with the hiring manager and current individual in the role. This is then followed by a panel interview.", "Interview Questions": "How do you manage multiple competing priorities?"}, {"date": "15 Jul 2021", "title": "E2 Clean Energy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NRDC", "Interview Descriptions": "Responded directly about an interview,  set it up, occurred with brief questions that were preliminary and then heard back about an offer. Overall really good experience, felt heard and allowed to ask questions afterward.", "Interview Questions": "Q: Why would you be interested in the position and E2?\nQ: What has been a career-related accomplishment you're most proud of?"}, {"date": "7 Jul 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "Phone interview that went well. Employer asked important questions about interests int he field and previous work experience. Allowed time to ask my own questions as well. Casual yet informative.", "Interview Questions": "Why I was interested in the position with the specific department I was applying for. "}, {"date": "25 Jun 2021", "title": "Summer Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "Generic questions asked and the two interviewers were very nice. Only about a 30 minute interview. Asked me about 5-7 questions and had a typical opportunity to ask my questions as well.", "Interview Questions": "Tell us about a time you experienced a conflict in a work environment and how you handled it."}, {"date": "5 Apr 2021", "title": "Fellowship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "quick, easy and well organized. the process was clear and had only one interview round for the position that was led by your potential supervisors. They asked about challenges, successes, style of work.", "Interview Questions": "what is a big challenge you have faced"}, {"date": "22 Feb 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "I was contacted for a brief phone screening with a third-party recruiter who asked basic questions and transcribed my answers for review. Did not receive any follow up after the screener.", "Interview Questions": "Asked about relevant skills and experience, no follow ups. "}], [{"date": "1 Feb 2021", "title": "Policy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "It was a very intense and very thorough virtual interview with me on a screen and five staff in the room, and I met all staff I would work with, which I really appreciated so I also could see if this was a fit.", "Interview Questions": "Many questions were hypotheticals about how I would handle situations."}, {"date": "29 Jan 2021", "title": "Senior Portfolio Manager, Foundations Relations Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC (San Francisco, CA) in Nov 2020", "Interview Descriptions": "I sent an applicaton with a personal referral in mid-July; had a phone screen at the end of the month. The recruiter appeared uninformed about the role and could  not answer basic questions about salary or team.  She didn't get back to me with answers to my questions, though I pinged her a couple of times. \n\nI got no status update between end of July and end of September - 2 months! (OK pandemic, but still!) Then I interviewed with the hiring manager, who seemed thoughtful and nice -- like someone who would be great to work with.  She talked more than she listened, but overall I was left with a favorable impression. \n\nI advanced to the next round, a panel interview with cross-team collaborators on programs and comms. They seemed like amazing colleagues and I began to get really excited to work at NRDC. Interview was well-scripted and well-run. Standard questions / no surprises. The recruiter called to confirm the salary range, which was a bit less than in my current role -- but I said I was flexible and reiterated my interest. \n\nI advanced to the final round, an interview with two leaders of the large national development team. Again, both seemed very smart, collegial, terrific. The first week of November, I learned that I was selected to receive the job offer. I clarified details of their remote work policy / COVID protocols, the superb benefits package, and start date with the recruiter. The hiring manager never communicated with me directly for some reason.\n\nWhen I got the salary offer a few days later, I countererd politely, requesting a very modest increase (literally, $2K). I was gobsmacked when, absent any further communciation, they revoked the offer! There is no chance I lied on my CV or that they got a bad reference (come to think of it, they never even checked references. The recruiter said they didn't think they could meet my needs, that they were surprised that salary was \"an issue\" -- it wasn't -- and that I didn't have an offer in writing so legally it was \"fine\" for them to change their minds. They could have at least done me the courtesy of dialogue -- I would have accepted the original offer if they had just said no to my increase request -- but instead their abrupt reversal left me feeling confused, disappointed, and like we had all wasted so much time for what?\n\nI would like to think that something got lost in translation with the recruiter, who perhaps did not do her best work at communicating between the hiring manager and me -- and not that NRDC doesn't think that women can and should negotiate without retribution. Or that women who ask for what we need for our careers and our families is \"an issue\"! \n\nI have always thought of NRDC as an effective organization and a progressive workplace, so I was genuinely shocked at this outcome. The oddest part about it is that I am a fundraiser -- my job is to be grateful and polite, but to ask! That's what I do. Very disheartening.", "Interview Questions": "What do you love about fundraising? What is the fundraising accomplishment you are most proud of? How do you involve Programs teams in developing proposals?"}, {"date": "20 Mar 2023", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC in Nov 2020", "Interview Descriptions": "Four steps in a total--1 phone screening with the HR; 1st panel interview with 3 interviewers; 1 writing test (two questions, 1 in CN and 1 in EN); 2nd panel interview with 3 interviewers", "Interview Questions": "how do you deal with pressure? what do you do on weekends (to see your EN level)"}, {"date": "10 Sept 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "Only got a phone call interview but it was well organized. They answered all of my questions and made me feel comfortable. Described the next steps to the interview process but it was cancelled due to the pandemic.", "Interview Questions": "Why do you want to leave your current job?"}, {"date": "10 Dec 2020", "title": "Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at NRDC (New York, NY) in Aug 2020", "Interview Descriptions": "HR phone screen then two subsequent interviews via zoom due to COVID.  Took around 2-3 months for total process.   Round robin style for interviews with panel of 4-5 years.   Found the last interview odd as I met with my boss in the last interview.   Clarity of job description didn't match actual job.  Didn't get the job because they supposedly offered it to an internal candidate - but the job is still posted MONTHS later.   Very odd for such a high ranking org.   Also confusion on if they were ok with remote based employee or if they wanted someone in NYC.", "Interview Questions": "Your basic strengths and weaknesses question.  How would you describe you management style?"}, {"date": "28 Feb 2020", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NRDC", "Interview Descriptions": "It took a long time, after I applied I didn't hear back for two months. After that first interview for the phone screening, things started to move quicker but I made sure to ask them the timeline. I didn't like not knowing how much longer the full process should take.", "Interview Questions": "They asked me about my relevant experience and my favorite boss"}, {"date": "31 Mar 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at NRDC (Chicago, IL) in Jan 2020", "Interview Descriptions": "Odd/rude screen with Sr. Recruiter.  one-on-one with hiring manager, in-person with 6 others.  Told they would be in touch very soon.  Followed up a month later and was told they hadn't heard from hiring team.  6 months later, heard through the grapevine somebody else was hired.", "Interview Questions": "nothing out of the ordinary"}, {"date": "11 Dec 2019", "title": "Benefits Consultant/Senior Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at NRDC (New York, NY) in Dec 2019", "Interview Descriptions": "I applied on a job site other than glassdoor & the outside recruiter vetted me over the phone. She set up a phone interview for me with the NRDC Talent Director. Had a great interview and conversation with this person and am hoping to get called for an on site interview next. My initial impression is great.", "Interview Questions": "...to describe how my background in benefits background fits their need for a project lead to build a more robust benefits offering to their employees."}, {"date": "30 Jul 2019", "title": "PAC and Candidate Services Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NRDC", "Interview Descriptions": "I had a phone interview with an HR person that was literally 6 minutes long, 2 of which she spent outlining the interview process. Then she asked me a couple of generic questions and asked me not to speak too much to answer them so she didn't have to write as much down. Then two weeks of radio silence. Then she emailed me saying she realized she had additional questions she needed me to answer, but didn't want to talk on the phone again so I needed to submit answers in writing. Most of these questions could have been answered by a quick skim of my resume. Have I ever planned events? Yep, that's on there. Have I worked with the DCCC and DSCC? Yep that's on there. Have I used the database that is an industry standard in this business? Yep that's on there too. Then another month of radio silence, before I finally got asked in for an interview. I went in to meet with two old white men (great look for an organization in this day and age) who were late, frazzled, and unprepared. I've never heard anything back from them since. I'm assuming I did not get the job. And thank god for that.", "Interview Questions": "Tell me about your experience working with PACs and candidate fundraising. How comfortable do you feel working in that space and how would you rate your knowledge of the FEC and legal rules on a scale of 1-10? How proficient are you with EveryAction/NGP VAN?"}, {"date": "16 May 2019", "title": "Litigation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "The interview process was fairly straightforward. The first stage was a phone screening, followed by a video interview with a manager someone currently in the position. The final round was a panel interview with several members of the team.", "Interview Questions": "Describe one time you made a mistake at work, and how you handled the situation."}], [{"date": "9 Mar 2019", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at NRDC in Mar 2019", "Interview Descriptions": "Was selected for a phone interview, and given several times (all within the week of receiving the email) to pick from. I confirmed availability for 3 possible times, and did not hear back. I sent a follow-up email the day before the times I had selected---still no response. \r\n\r\nThe unprofessionalism is astounding for such a large organization. I had three other phone interviews in that same week, all at smaller orgs, and their HR teams were welcoming, professional, and respected my time and effort. Embarrassing .", "Interview Questions": "N/A"}, {"date": "6 Mar 2019", "title": "Climate Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC (Denver, CO) in Feb 2019", "Interview Descriptions": "I was not offered an interview. Instead, I was reached out to by email about 1 month after I applied letting me know that I was a qualified candidate and they wanted to know my salary range. When I let them know, I never heard from them again. \r\nI'm disappointed that an org like this wouldn't just provide a salary range in the job post to begin with if that's what's most important to them. To my fellow applicants, never lowball yourself to any company for an interview! You're worth more!", "Interview Questions": "What is your salary range?"}, {"date": "2 May 2022", "title": "Climate Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at NRDC (Chicago, IL) in Jan 2019", "Interview Descriptions": "Standard interview questions but with a big group.  More focused on cultural fit than specific experience, in my opinion.  Familiarity with NRDC, its programs, challenges, and goals really helped me be successful.", "Interview Questions": "Q: describe how you manage diverse stakeholder engagement process."}, {"date": "21 Dec 2018", "title": "Legal Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "I spoke with a member of the hiring staff over the phone. The questions were pretty standard and not particular to the job description. The entire process took about 30 minutes.", "Interview Questions": "Describe a difficult situation you encountered and how you overcame it "}, {"date": "26 Nov 2018", "title": "Staff/Policy Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "Very straightforward. I got an email requesting a short phone interview, which took place within one week. I didn't end up getting position, but I think that was because they were looking for someone to start fairly soon, and my start date would have been in a couple of months.", "Interview Questions": "When would you be available to start? "}, {"date": "12 Oct 2018", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NRDC (San Francisco, CA) in Oct 2018", "Interview Descriptions": "The initial phone interview/screen was a bad experience and the HR person called 35 minutes later than the scheduled time. Then they rushed the phone call and after 10 minutes abruptly ended it. They said they already had people in the end stages of interview but were opening it up for more candidates- and the salary range was very low even for an entry level job (which they wanted a couple years of experience!)  in the non profit sector.  After the interview it seemed like it would not be a good fit but I did attend the follow up in person interview. The follow up in person interview was much a much better experience and I enjoyed the interviewers, but they seemed unprepared and were just winging it. No tricky questions, very straight forward. Great organization, but the interview experience was poor.", "Interview Questions": "What's your experience?"}, {"date": "25 Oct 2018", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at NRDC (New York, NY) in Sept 2018", "Interview Descriptions": "I went through 3 different interviews. First was a screening call with an HR rep, who seemed quite uninterested, she asked standard interview questions from a prepared sheet in front of her.\r\nSecond interview was with a policy adviser who I would be reporting, it was a great and relatively informal interview, I left feeling really great about it all. I was told I would hear back the following week, it took 3 weeks and a follow up email from me to get an answer, that I had passed the next round and could I come in the following week for a panel interview. \r\nThird interview, was about a month after my second interview , it was a panel interview (as stated above) I interviewed with an HR rep (not the one for the department I was applying for) a senior member from a different team, someone from the DC office in a senior role and another program assistant in my role from the DC office. Overall it was a great interview, standard and interesting questions were raised. it last about an hour. \r\n\r\nNow for the ridiculously annoying and unprofessional bit (although the 3 weeks between interview 2-3 was also a bit much) I was told I would hear by the end of the week if not early the following week if I got the position or not considering I was one of 2-3 people in the final round. 10 days pass by and I send a follow up email inquiring as to the status of my application. I didn't get a response, another 2 weeks went by and I had received a job offer elsewhere, I emailed NRDC again and inquired yet again, and I received a response 2-3 days later stating I was still in the running and sorry for the delay but that they were still interviewing people for the position, and that they would be in touch with me soon. Since then I have taken the other job offer and have yet to hear from the NRDC, it has now been 6 weeks since my final interview. I'm appalled that such a well known and good-doing organisation is so poorly managed internally. It's a shame as well as this was my top choice for organisations to work at and still would love to work there, but considering I sent in my initial application in June and we are now nearing November... 6 months to hire someone is absolutely ridiculous.", "Interview Questions": "What was a time when things went wrong in your past positions and how did you cope with it? "}, {"date": "22 Aug 2018", "title": "Climate/International Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC", "Interview Descriptions": "First went through a phone interview with an outsourced HR person who was very professional and nice. Basic screening questions, nothing difficult or extraordinary. Then I went through a 1-hr video interview with 3 people simultaneously. They had very different backgrounds so the questions ranged from knowledge on stakeholder engagement to technical engineering questions.", "Interview Questions": "Do you have any experience in stakeholder engagement?"}, {"date": "4 Aug 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC", "Interview Descriptions": "HR screen with fairly boilerplate questions, then a meeting with the associated team that was a mix of standard interview and program-specific questions.\r\n\r\nUltimately I was informed that I was not advancing by way of a survey link asking me about the process, without definitively stating that I was no longer being considered. I found this to be quite unprofessional, and I expected better of an organization like the NRDC.", "Interview Questions": "What specifically interests you about the role?"}, {"date": "1 Oct 2018", "title": "Policy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NRDC in Jul 2018", "Interview Descriptions": "The interview went well, I was offered a phone interview and then scheduled a skype interview shortly after. However they kept rescheduling the skype interview and they eventually told me they offered another candidate the job, which was a little unprofessional in my eyes.", "Interview Questions": "Where do you get your political news from? "}], [{"date": "26 Jul 2018", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at NRDC (Boston, MA) in Jun 2018", "Interview Descriptions": "Interview process was very very long. A full 6 months from applying to Finishing up my last interview.  Despite the longevity of the process, everyone I interviewed with was nice and engaging. The interviews themselves were very standard. No one really was trying to trip me up. Mostly the usual questions. It is frustrating waiting weeks and weeks to hear if you made it to the next round though.", "Interview Questions": "How do you balance conflicting deadlines? Tell us about a time you didn’t have enough time to finish all of the tasks you had to finish. "}, {"date": "3 Jul 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NRDC (New York, NY) in May 2018", "Interview Descriptions": "Resume Sent 4/2/18; HR Recruiter reached out 5/30/18 and after the interview said I'd hear from them soon.  I followed up 6/20/18; got a email kicked back saying said recruiter is no longer with the organization but please do follow up with HR.  I followed up same day and didn't hear from anyone since.  A shame as I was  a perfect fit for the position as told to me by the initial recruiter.", "Interview Questions": "How would I be a fit for this position?"}, {"date": "28 Mar 2018", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NRDC (Washington, DC)", "Interview Descriptions": "I applied first online with a resume and cover letter. Then, I received a call to schedule a phone interview. I completed that, which was followed up by an in-person interview with the communications team.", "Interview Questions": "What communication strategy would you employ for next year's water/land/energy issues?"}, {"date": "16 Feb 2018", "title": "Membership Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 4 weeks. I interviewed at NRDC", "Interview Descriptions": "I had a general phone interview where I was asked many questions. It took about two weeks till I was asked to come in for a second interview. I met with two people that would be my potential supervisors. I thought it went well and we connected and I was a nice fit. It about another two weeks then brought in for a third interview with a panel I also thought it went well at the end of the interview the HR person said we aren’t involved with the decision.  Overall the company seems nice to work for but the hiring process is way too long especially since I didn’t get hired.  I applied to the position early November and wasn’t notified I wasn’t selected until I sent a follow up email in February.", "Interview Questions": "Where do you see your self in five years?"}, {"date": "13 Feb 2018", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at NRDC", "Interview Descriptions": "Had a brief phone screening interview with HR, then an in-person interview with 2-3 other Program Assistants and 2-3 managers. Everyone was very friendly and courteous, questions were not difficult and mostly related to direct skills/tasks relevant to the job posting. Afterwards, I had a brief phone call with another manager who was not able to attend the interview.", "Interview Questions": "Do you know how to use PivotTables in Excel?"}, {"date": "3 May 2019", "title": "Director, Campaign Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at NRDC (Chicago, IL) in Jan 2018", "Interview Descriptions": "Phone interview with standard questions. Claimed there was going to be a speedy hiring process for the position, that instead dragged on for six months. Then they removed the job posting all together and the position remained unfilled for a year. When they relisted the position I applied again, told there was going to be a speedy hiring process...we enter month two and now no communication from their HR department. It's difficult to remain excited for such an incompetent organization.", "Interview Questions": "Team player or leader. Career accomplishment that is relocatable to the position. Travel expectations. Salary expectations."}, {"date": "22 Mar 2018", "title": "Assistant Director of Facilities Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at NRDC (New York, NY) in Dec 2017", "Interview Descriptions": "Applied on-line. Had a phone screen with the recruiter then a fact to face with the hiring manager. While NRDC appears to have a great mission, the position responsibilities appeared very uncertain and poorly organized - a mix of facilities management, purchasing, sustainability and finance. Very few candidates will possess such a wide variety of experience. Hiring Manager, while well educated and bright, was of little assistance in explaining what he was looking for in a candidate. Many of the question posed to me appeared illogical and/or irrelevant and appeared to be more for the sake of his showing off what appeared to be his inflated view of his knowledge rather than for valid job reasons. He finished by stating that it would likely take several months to complete the process! Very disorganized and unprofessional!", "Interview Questions": "What does \"TEM\" stand for?"}, {"date": "12 Feb 2018", "title": "Program Assistant-China Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NRDC (Washington, DC) in Dec 2017", "Interview Descriptions": "Applied online. Got contacted for a phone interview 1 month later. Had the phone interview. Got contacted for a face-to-face interview 1 month later. The morons were so incompetent they changed my interview time 3 times! Interview started speaking Chinese to test my level with a Chinese girl who was cold as ice! It only lasted 5 minutes, which is too short for a full evaluation.\r\n\r\nWas then interviewed by the China Program founder and a senior scientist for the Health Program. They did not take ANY notes, which meant those bums had already made up their minds beforehand. The interview was mostly a stupid checklist: \"Do you have experience in X?,\" \"Have you every done Y?\" They then asked me to send them sample PPT slides I had done for another job. Said they would do final interviews the following week, but I never heard back.\r\n\r\nThe interview finished with doing a translation from English to Chinese about how China is leading the way (I know, just go with it) in combating climate change. They didn't even have it setup for me. Had to get it setup by another girl from China who didn't know what she was doing.", "Interview Questions": "Have you ever done budgeting?\r\nAre you OK with working late for conference calls?\r\nDo you have experience with Twitter?\r\nHow would you handle critiquing our Chinese colleagues?"}, {"date": "6 Feb 2021", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC (Chicago, IL) in Dec 2017", "Interview Descriptions": "Honestly, the interview was simple and straight to the point. Questions mainly focused on past work and internship experience. Was interviewed twice before receiving a an offer, and I accepted.", "Interview Questions": "How does your previous work/internship apply to this role?"}, {"date": "30 Oct 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at NRDC", "Interview Descriptions": "Rather slow moving, but after submitting your application they do a simple phone screening followed by an in person interview. The in person interview includes a proofreading test. the overall process takes about 3 months", "Interview Questions": "Where do you see yourself in 5 years? "}], [{"date": "12 Oct 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NRDC (New York, NY)", "Interview Descriptions": "2 phone interviews by the same person - each over 45 minutes\r\n\r\n I emailed and called  to followup, but was not given the courtesy of a response.  The woman doing the phone interviewing is not an employee of the organization, nor is she a recruiter- she is a friend of one of the Execs.\r\n\r\nVery unprofessional approach.", "Interview Questions": "Standard phone interview questions dragged out.\r\n"}, {"date": "7 Sept 2017", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at NRDC (New York, NY) in Aug 2017", "Interview Descriptions": "Initial phone screening plus two in-person interviews (one with HR, one with the team).  Interviewers were friendly but after three rounds (I applied in May and everything was dragged out until August) I was basically ghosted.  I followed up with everyone I had spoken with and was never even given a \"no, thank you.\"", "Interview Questions": "Questions were routine, nothing out of the ordinary.  \"Why do you want to work for us?\" \"What are your greatest strengths/weaknesses?\""}, {"date": "14 May 2018", "title": "Community Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC (San Francisco, CA) in Apr 2017", "Interview Descriptions": "Was awesome and pleasant, the HR manager was super nice and helpful. It felt like a conversation and it was not intimidating. She called at the agreed time no one minute late or earlier. I applied for the job on the same week they called me for the interview. When the interview finished she sent me an email telling me the director wanted to talk to me through video call. We did it the next day and that same day I received the offer", "Interview Questions": "Tell me about your past experiences"}, {"date": "21 Feb 2017", "title": "Interim Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at NRDC (San Francisco, CA) in Dec 2016", "Interview Descriptions": "It was a fast hire as it was a temp position that needed to be filled asap. I got a call through a staffing agency and then came in the next day for an interview with the office coordinator and one manager over the phone. It was casual and to the point. I felt at ease and comfortable.", "Interview Questions": "How do you handle slow moments? "}, {"date": "13 Nov 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at NRDC (San Francisco, CA) in Oct 2016", "Interview Descriptions": "Pretty straight forward interview process. Only got a phone interview but it lasted about 50 minutes. A coordinator from the San Francisco office called and asked many questions from a list that the team hiring gave her. The person was polite and very informative. She recommended that I follow up the next week to check on the status of my interview process. However, when I followed up the next week I never got a response back. Seemed a bit unprofessional, because she was the one who told me to follow up and promised she would respond. \r\n\r\nWhen I asked about where the position could lead, she responded that it could lead to a variety of jobs. She said some people leave for other companies or go back to school. She said some people apply to become campaign organizers or work in other positions at NRDC. She also said some people stay programs assistants for many years and are happy just doing that. Overall, they are looking for more ways to integrate upward mobility into the position.", "Interview Questions": "Why do you want to work for NRDC?"}, {"date": "6 May 2017", "title": "Policy Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC (Washington, DC) in Sept 2016", "Interview Descriptions": "Interview was at NRDC office.  One person present four more on a conference phone.  The conference line wasn't working the best and some people came on late.  It was very difficult to interview via conference line.", "Interview Questions": "Please describe your experience working with federal agencies?  Who have you worked with in the past?"}, {"date": "22 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC (Washington, DC) in Aug 2016", "Interview Descriptions": "I had one interview with the Operations Manager and Executive Director. I then was asked to come in a week and a half later for a second interview, this time members of HR and the communications team were preset. The first interview was more of them explaining what the job was and what they needed. The second interview was more of a conversation amongst the team and how I would fit in if I was brought on board. While 5 people to an interview was a bit different for me, as I have never had more than 3 people, it was a very relaxed setting and enjoyable conversation.", "Interview Questions": "How do you handle managing up in a position like Administrative assistant?\r\nWhat kind of skills would you like to walk away from the position with?\r\nHow do you handle working in an open environment? What environment are you use to?"}, {"date": "1 Jul 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NRDC", "Interview Descriptions": "I had a phone screen with the HR rep in DC. It's was brief, basic and easy. He asked me simple questions and it was less than half an hour. It's was bit informal because this is just 1 out of 3 interviews. It took about a week to get a call back from the local office that I was applying for.", "Interview Questions": "How did you hear about the job?\r\nWhy do you want to work for NRDC?\r\nHow would you handle multiple deadlines?"}, {"date": "16 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NRDC", "Interview Descriptions": "Pretty general questions like why do you want to intern at NRDC. They asked me to briefly introduce myself and talked a bit about their project. Then two nice staff showed me around the office. The interview took less than 20 mins. It seems like they were in need of a summer intern to fill the position.", "Interview Questions": "Where do you learn about this position?"}], [{"date": "8 Aug 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NRDC (New York, NY) in Jun 2016", "Interview Descriptions": "I went through two rounds of interviews, on was an HR screening and the other was an in person interview with 4 professionals I would work with if I got the job (two scientists and two lawyers). Everyone was extremely nice and friendly, but the HR employee called me 30 minutes before my scheduled call, and at times I felt like one of the in person interviewers asked very pointed questions. After the whole process I never heard back as to whether or not I got the position, despite sending two follow emails. It would have been nice for them to get back to me, even if they were not planning on offering me the posiiton", "Interview Questions": "Where do you see yourself in 5 years? \r\nWhy specifically do you want to work for this program? \r\nHow do you feel about doing administrative work and how do you work with multiple deadlines?"}, {"date": "17 Apr 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at NRDC", "Interview Descriptions": "Throughout the process, everyone involved was extremely pleasant and insightful, though it seemed NRDC unfortunately did not have the proper resources to adequately manage the entire process from start to finish. I was disappointed in how they failed to notify me in the long-run about the decision and update the job website. This was even after following up and continuing to express interest in the role with the program lead. The team was extremely fun to Skype and discuss my career goals with, though and offered great advice into the field of environmental law and into the day-to-day of NRDC. I would note that the Skype software that they utilize is through Microsoft, so you must download another plug-in before signing into it.", "Interview Questions": "In what importance would you rank the three attributes: professionalism, creativity and attention to detail? "}, {"date": "17 Sept 2018", "title": "Environmental Lawyer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NRDC (New York, NY) in Mar 2016", "Interview Descriptions": "Everyone was quite nice and friendly. The cause is what originally attracted me to the organization as well as New York City. There were many candidates so I felt honored to be selected.", "Interview Questions": "How old are you?"}, {"date": "1 Apr 2016", "title": "Human Resources Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at NRDC (New York, NY) in Feb 2016", "Interview Descriptions": "I got a call from recruiter for this position in second last week of Feb 2016, i applied and got an interview call in the next week (last week of Feb). The interview process took about 1 hour, the interviewers were quite humble and polite. The interview went really well and seemed to be interested and said they need to fill this position immediately, asked my availability (if i can join from 2nd week of March) and gave me a date next week (1st week of March ) that i will be updated. After then, i followed up with the recruiter twice, but there was no update until end of March.", "Interview Questions": "Name a few examples on the reports and analysis delivered by you?"}, {"date": "26 Aug 2015", "title": "Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at NRDC (Washington, DC) in Jul 2015", "Interview Descriptions": "I was offered one time slot in which to interview. I responded 25 minutes later to say that time slot would not work, offering many alternatives. The HR contractor responded four days later to say all slots had been filled except one option, which I reluctantly accepted. \r\n\r\nThe interview itself was via Skype for Business, which I was not told until the morning of the interview. I was originally told it was via regular Skype. The difference is not significant, but it was frustrating to figure out what else I needed to download and how to login to Skype for Business on the morning of the interview. \r\n\r\nI had two interviewers in different locations. One was respectful and asked regular interview questions. The other interviewer was extremely unprofessional. She walked into the room late (the camera was already on) and appeared frazzled and frustrated. She had a negative, condescending, and accusatory attitude, approaching the interview as if her role was to determine where my resume was lying. At one point, I mentioned that I worked with a third party organization and had friends that worked there. Her response was, \"Oh yea, who? Who do you know that works there? Give me their names!\" Although seven years had passed since I worked with that organization, I still gave her a name. She then asked for more names and was unsatisfied. \r\n\r\nLastly, the job posting itself specified that the work would involve a particular industry. The interviewers told me they already had people working on that industry, so they didn't have a need there. I'm not sure why they posted the job in the first place.\r\n\r\nI don't typically write reviews like this, but I had to vent somewhere. It was probably the worst interview I've ever had.", "Interview Questions": "Who do you know at X organization?! You said you know people there. Give me their names!"}, {"date": "14 Jul 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NRDC (Chicago, IL) in Jun 2015", "Interview Descriptions": "Only got a phone call and the interviewer asked the most basic questions. Said they would follow-up with me in the next couple of days but never received an answer. It was unprofessional of them to ignore my phone call and email regarding the position status, regardless of the outcome.", "Interview Questions": "How did you find out about this position at the NRDC?"}, {"date": "5 Jun 2015", "title": "Social Media Editor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NRDC (New York, NY) in May 2015", "Interview Descriptions": "Over the phone. Scheduled to be 20 minutes and ended up about 30-35. Just the recruiter and me. The recruiter asked a lot of questions about the type of environment I want to work in and about why I want to work at NRDC and what my future goals are", "Interview Questions": "How important is organization to you?"}, {"date": "5 May 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at NRDC (Santa Monica, CA) in Apr 2015", "Interview Descriptions": "The first round is a phone screening with HR, then a panel interview with the team you'll be supporting, and the final round is with the direct supervisor. The phone screening isn't hard, it's a few generic questions to gauge whether you can do the work. The panel interview was pretty informal, they just skimmed through my resume and asked me questions about things that jumped out at them. They didn't seem very prepared. The final interview was also pretty informal, and I don't know if it's because that's just the supervisor's personality, or because he didn't take me seriously as a candidate. He asked more questions about my ability to do the job, and gauged whether I would be a good fit with the team. He was very candid and said that program assistants usually stay in the position for 2-3 years and then move on because it is rare and difficult to move up within the org. I was told they would make a hiring decision after two weeks, and then never heard anything. Overall I found the process unimpressive at best, if not unprofessional.", "Interview Questions": "What is your current salary, and what are your salary requirements? Why are you looking to leave your current job? What kind of work environment are you seeking? What are you looking for in your next role? Why are you interested in NRDC and this position, specifically? This job will require you to be continually productive on long-term assignments, but also able to respond to urgent requests in a moment’s notice. Do you have any experience in an environment that requires that type of attention span? What do you feel is key to working well with a  team? Do you have any experience copy-editing?  Please explain. What are your 3 greatest strengths and how would those strengths support this role? Do you have any experience managing budgets, invoices, and expenses for a department or project?"}, {"date": "4 May 2015", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at NRDC (New York, NY) in Apr 2015", "Interview Descriptions": "Applied online, had a very structured phone screen with a Human Resources staff, time was given for the staff to transcribe my answers. Called in for a second with 3 people, including their HR lead. Little over half hour interview with opportunity to ask questions. Very conversational, all three both asked and answered questions and made me feel comfortable in the environment.", "Interview Questions": "Why NRDC?"}, {"date": "8 Feb 2015", "title": "Senior Grant Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC (New York, NY) in Jan 2015", "Interview Descriptions": "I was first emailed, then called by a representative from HR, who conducted a screening interview. After the successful screening, I was asked to come in for an interview. I was interviewed by two of the development staff members. They were very friendly and the interview was pleasant, not stressful.\r\nThey then sent me a 3-part writing assignment plus a very simple budgeting exercise to complete and submit for a \"blind evaluation\" process.", "Interview Questions": "Would you be okay with the fact that you will not be meeting foundation representatives or donors/i.e., that this is purely a writing job?\r\nHave you ever written a briefing document?\r\nWhat is your experience working with budgets?"}], [{"date": "1 May 2015", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NRDC (San Francisco, CA) in Jan 2015", "Interview Descriptions": "First contact was from a recruiter contracted by NRDC and had a good phone interview. She emailed me a few days later asking if I'd be available for a video interview in their SF office with a HR director in NY, which also went well. A week went by and the recruiter emailed me to let me know that I made it to the next round and they'd like me to come back to the SF office for a panel interview. This time I sat in a room with 5 interviewers and I felt that it went well, but maybe not as well as the previous interviews, though still good. Was told the recruiter would reach out to me about next steps. I was pretty excited. A week goes by and I hear nothing. I emailed the recruiter to show my continued interest and she replied saying they were still sorting out the next steps with the candidates and she would get back to me. Another week goes by without a word. I emailed her again and this time there was no response. I can handle rejection fine, but at least let me know. Especially after all the different rounds.", "Interview Questions": "Mostly questions about partnering with business leaders and building relationships."}, {"date": "20 Dec 2014", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "I submitted an online application to the HR department. I was called for a phone interview first. Then I was invited in for a series of in person interviews. My references were then checked, and I was called with an offer. I negotiated my salary (higher than initial offer). Overall, the process was a neutral experience.", "Interview Questions": "There weren't any particularly difficult or unexpected questions."}, {"date": "22 Nov 2014", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NRDC", "Interview Descriptions": "Asked basic interview questions, HR was really friendly and down to earth. Asked me for availability and told me I would be contacted the following week but never replied to a follow-up or full on reject me. Slightly unprofessional. Process = phone interview with HR in NY, then someone else in another office before an in person interview", "Interview Questions": "logistical questions more-so; salary was asked off the bat"}, {"date": "3 Dec 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at NRDC in Nov 2014", "Interview Descriptions": "I applied online but also had someone that worked for the company get me in the door. I first had someone contact me for a pre-screening. I was called later that afternoon to set up a Skype interview (I was out of state). I was very prepared for the interview. I met with 5 different people in the company and it lasted over two hours. They seemed really impressed by my resume and gave me a timeline for when they would contact me (they said they would let all candidates know either way if they got the job). That day came with no call, so I contacted the company. They told me they were behind and should have an answer by the end of the week. I called after the weekend with no response. I have not heard back. I was very unimpressed by how this was handled. To go through a lengthy interview process and no one has the courtesy or respect to call you. The job was not going to offer much - they made it clear you could not move up in the company and the pay was likely very little. But given how this process was handled, I wouldn't apply again to the company.", "Interview Questions": "Some Questions\r\n1. Give an example of when you worked individually and what results you got. \r\n2. Give an example of when you worked as a team and what you learned\r\n3. Describe a struggle you experienced and how you death with it\r\n4. The hardest question, for me, was where you see yourself in 5 years. I had a good answer, but after a company tells you that there is no room to move up and most people work only 2-3 years as a program assistant and then move out of the company or go back to school, it's hard to find an answer in line with that type of attitude. "}, {"date": "7 Oct 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at NRDC (San Francisco, CA)", "Interview Descriptions": "I was given a brief phone screen, where the position was described and we went through my experiences on my resume. I was then called in for an in-person interview. It was a comfortable conversational interview, and I really appreciated the chance to meet other employees with the Program Assistant title, to learn more about the day-to-day. After the interview, my references were called, and I waited three weeks to hear back.", "Interview Questions": "How would you deal with multiple competing demands?"}, {"date": "15 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at NRDC (San Francisco, CA) in Feb 2014", "Interview Descriptions": "The internship interview process included a phone and in person interview.  Two people conducted the interview - they were courteous and timely, and the interview questions were tough but fair.  The entire process took around two months, mostly because I was working through a university program.  NRDC was very quick and responsive through the entire process.", "Interview Questions": "They asked very specific questions about my resume and how my skills would apply to the job. "}, {"date": "10 Jul 2013", "title": "Intern Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at NRDC", "Interview Descriptions": "I had a phone interview and spoke with members of the Environmental Law Project team. They asked me general questions about my background and why I was interested in the environment. There were quite a few people on the conference call and much of the interview was spent chatting about the office dynamics and trying to figure out where I might fit on the team.", "Interview Questions": "What can you tell us about Chinese environmental law? "}, {"date": "5 Feb 2013", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NRDC (San Francisco, CA) in Dec 2012", "Interview Descriptions": "Very competitive nonprofit.  Absolutely incredible staff--my interviews were intense, but also inspiring and enjoyable! I loved everyone I met.  I had two phone interviews, and one long in-person interview (with two different panels).  Due to the competetive nature of the position, I had to wait 2+weeks for a decision (but it's worth it!).", "Interview Questions": "What's a tendancy or trait you have that often holds you back? Can you elaborate?"}, {"date": "26 Jan 2013", "title": "Program Assistant II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NRDC (San Francisco, CA) in Oct 2012", "Interview Descriptions": "1) Phone interview with HR- nice HR person, basic background questions. \r\n2) On-site interview with HR- very similar to first interview\r\n3) On-site group interview- interviewers were unprepared and focused primarily on personality questions.", "Interview Questions": "Interviewer attempted a few times to find out about family/relationship information. "}]]