[[{"date": "14 Jun 2023", "title": "Student Nurse Extern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Health", "Interview Descriptions": "It was very fast and they got back to me very quickly. They were friendly and welcoming throughout this entire process. There are so many units to choose from if this is an option for you.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "22 Jun 2023", "title": "Community Health Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at MedStar Health (Baltimore, MD) in Jun 2023", "Interview Descriptions": "Zoom interviews. There were two rounds of interviews. Overall, I enjoyed the interview process and could ask any questions. The hiring manager was really friendly and helpful. Great and easy experience!", "Interview Questions": "What is your greatest strength?"}, {"date": "28 May 2023", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MedStar Health (Baltimore, MD)", "Interview Descriptions": "It was a traditional in-person 30-45 minute interview with the manager of the unit you applied to. Due to covid, your interview may be online or in-person, depending on the hospital’s hiring process.", "Interview Questions": "Why Medstar? What skills do you think you have to possess to fit this position? Strengths and weaknesses?"}, {"date": "13 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MedStar Health (Baltimore, MD)", "Interview Descriptions": "Easy interview. Basic interview questions were asked. Explained the job role thoroughly. I felt comfortable while being interviewed. Left feeling like I got the position. Scenario question were asked. For example, “Tell me about a time you had to deal with a difficult patient”", "Interview Questions": "Tell me about a time you dealt with a difficult patient. How did you handle the situation?"}, {"date": "7 May 2023", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Okay interview, sort of slow process - usually more of an assessment of fit with culture rather than deep dive into quals. Focus on examples of prior work to showcase strengths and typically interview with hiring manager is most important", "Interview Questions": "Tell me about why you want this job"}, {"date": "26 Apr 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at MedStar Health", "Interview Descriptions": "Virtual interview 1 - convo with recruiter to get a better understanding of the JD 2 - hiring manager 3 - immediate team 4 - larger stakeholder team After interview #3, I didn't hear back for awhile. Then the recruiter emailed me that another candidate was selected.", "Interview Questions": "recent achievements handle conflicts describe your project mgmt process/approaches 3 words to describe you why are you looking for"}, {"date": "10 Apr 2023", "title": "Practice Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Total of 4 interviews including with the HR representative/recruiter. Very straightforward and average interview process. I was contacted about an offer then asked to complete 2 additional interviews which was a bit abnormal.", "Interview Questions": "What ideas do you have to increase the amount of no show appointments?"}, {"date": "4 May 2023", "title": "Case Management Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Olney, MD) in Apr 2023", "Interview Descriptions": "10 minute phone screening Asked very basic questions about experience and why I am interested in working for the company. Asked about my availability and gave an overview of what the job title entails.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "29 Mar 2023", "title": "Onboarding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "It was an easy interview process with very nice people! They were informative and gave a good vision of what to expect. Quick turnaround on getting back to me about the job", "Interview Questions": "How do you keep yourself organized?"}, {"date": "6 Mar 2023", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health", "Interview Descriptions": "The HR rep seemed deceitful or unorganized. The job description for these jobs states the qualifications, which I qualified for, but the HR rep stated that those are incorrect, and that I'd need a higher degree than what the job posting listed to get that job title, and that if I wanted the job, they'd only hire me in at a lower title with a much lower pay rate (despite having what the job posting's qualifications called for). She then emailed me and told me the position was filled. A few weeks later, she called me asking for an interview because the manager had \"found my resume and wanted to interview me\" for the position that was supposedly already filled weeks ago. At this point, I did not feel comfortable continuing with the process or with this company because of the many inconsistencies and car-salesman like negotiating for lower salary on the part of the HR rep.", "Interview Questions": "Only interviewed with HR rep. Questions were mostly geared toward whether I would still want the job at a lower pay rate and job title than what the job posting was for."}], [{"date": "18 Mar 2023", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health (Mitchellville, MD) in Mar 2023", "Interview Descriptions": "Very easy, asked where I see myself in 5 years, what I know/like about Medstar, what can I bring that other therapists can't. Largely discussed the role they need fulfilled and the kind of person they want", "Interview Questions": "Where do you see yourself professionally in five years?"}, {"date": "12 Feb 2023", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "It was easy , the interviewer was straight to the point but pleasant . Asked a couple of questions about patient advocacy, conflict , time management , why you want to be a nurse .", "Interview Questions": "Describe a time you have advocated for a patient ."}, {"date": "29 Jan 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "Short interview on team software, relaxed environment, With a single faculty physician, simple questions. Regular residency interview style questions.to test awarness and understanding About the duties and responsibilities and how we would be if it from the program", "Interview Questions": "Tell me about yourself Long term goals Strength and weakness Experience Something we don't know about you"}, {"date": "15 Dec 2022", "title": "Outpatient Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at MedStar Health", "Interview Descriptions": "I got an invitation email for 15 minutes phone screening two days after I applied the job. Two weeks after the screening call, I was scheduled for a interview with a hiring manager. Then I received an assessment test right after the interview from the hiring manager, and it’s been returned. I’m waiting to hear back from them.", "Interview Questions": "Why are you interested in this job?"}, {"date": "24 Oct 2022", "title": "Medical Billing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "The interview was an in person meeting with a supervisor and a manager. The usual questions were asked about experience and strengths and weaknesses. This was not a remote job possibility.", "Interview Questions": "How many years of experience do you have and in what specialty."}, {"date": "11 Oct 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Interview was straightforward, no major curve balls. I would say that the process really is different depending on the department you interview for. The teams and the styles can vary but the structure was easy to follow.", "Interview Questions": "Describe some of the projects you have been working on at your current job."}, {"date": "7 Nov 2022", "title": "Sr. Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Dallas, TX) in Oct 2022", "Interview Descriptions": "Interview process took too long 3 and half hours because they wanted me to take a 72 question assessment in which was not easy while someone stays on Teams to watch you do the assessment!!! What company gives a person a 72 question test! I started to hang up the call…It was very overwhelming and not needed for an interview like that!", "Interview Questions": "Questions were scenario type of questions, true and false and math questions"}, {"date": "29 Sept 2022", "title": "Medical Lab Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "It was a total of 3 step interview (first a phone interview with a HR person, then a virtual interview with more than one person in the department, and lastly in person interview)", "Interview Questions": "Overall,  there were usual interview questions, such as a little bit about yourself, how did you hear about us, what did you do in your last position, what are your strengths and weaknesses and etc."}, {"date": "22 May 2023", "title": "Director Urgent Care Centers Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health (Baltimore, MD) in Sept 2022", "Interview Descriptions": "Had an initial call with the recruiter who said I would hear back, thought it went OK. Never heard back, never got a response from my emails. This was of course after they said \"You will definitely hear back from us.\"", "Interview Questions": "Asked about my experience in ambulatory care."}, {"date": "27 Sept 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health in Sept 2022", "Interview Descriptions": "Heard back with interview date a month after applying for job. Good interview experience meeting the entire department. Questions asked about what made me interested about the field and about myself. Not a typical structured interview. ", "Interview Questions": "Why are you interested in this specialty? "}], [{"date": "24 Aug 2022", "title": "Medical Biller and Coder Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Interview went OK. I got booted off but we managed to link back up with the virtual interview. Never heard anything back still to this day. It's kind of frustrating because they said they were hiring for a position I'd be great for. Then never responded at all. Very disappointing.", "Interview Questions": "Icd 10 and CPT codes"}, {"date": "20 Jun 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "The first step in their recruitment process will take approximately 20 minutes. It is to discuss your experience and qualifications, tell you more about the job opportunity, and answer any questions you may have.", "Interview Questions": "What are three words that others would best describe you as?"}, {"date": "9 May 2022", "title": "Central Scheduler Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Zoom. Really want to know how well you work with customers. Quality customer care is the most important to them. On the job training is what they are preparing you for. You don’t need to know it all", "Interview Questions": "How well do you work with otherS?"}, {"date": "2 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "It was casual and management was friendly! I was super nervous but realized there wasn’t anything to be nervous about. I interviewed over Skype because of Covid precautions and the nurse recruiter assigned to me was awesome and helped me through the process quickly! Definitely impressed me.", "Interview Questions": "Tell me about yourself and what you think you can bring to the team?"}, {"date": "22 Feb 2022", "title": "Communication Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "The recruiter reached out to me one day after I submitted my application. She was a little rude, seemed annoyed that I was asking questions, and had just a general despondent attitude. My initial interview was late December so I asked when the hiring manager would want to make a decision. The recruiter rudely said, “Nothing will happen until after the new year.” And yet, an hour after the interview, the hiring manager wanted to speak the next day. Then another hour later, the hiring manager had to reschedule for the next week. \r\n\r\nThe interview with the hiring manager and their supervisor was an hour long. At the end, they asked if I could submit writing  samples which I did a few hours later. Two weeks went by and I heard nothing until I reached out. I was told that it was a busy time and I should wait another week or two to receive instructions for writing exercises. I submitted the writing exercises and was told I would hear something by the end of the week. I didn’t. I did however, receive a rejection generic email. A seven-week process filled with disregard of a person’s time just to end in rejection.", "Interview Questions": "What is one thing you are most proud of in your career?"}, {"date": "28 Mar 2023", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health in Feb 2022", "Interview Descriptions": "When you get interviewed at Medstar, you do not get any feedback. If they decide to not forward with you, they simply just never let you know. They also take forever to set up any interviews, and this is for internal positions. For externals, the process can take MONTHS. It's ridiculous.", "Interview Questions": "Normal interview questions that you can prepare for."}, {"date": "12 Dec 2021", "title": "Physician Billing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health (Middletown, PA)", "Interview Descriptions": "Three interviews recruiter- testing processing- panel interview. First two rounds flying colors. No issues. The panel interview, nothing could be said to appease the one manager. Argumentative for the sake of being argumentative. Tried rephrasing questions to see if I would change my answers. Wouldn’t let the other two managers speak.", "Interview Questions": "Tell me about a time you had to solve a complex issue"}, {"date": "5 Dec 2021", "title": "Strategic Sourcing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at MedStar Health", "Interview Descriptions": "It was long and  disorganized. I met with several people and some were inappropriate selections to be interviewing for this particular position . The building was like a bunker with few windows and scant natural light. There was plenty of parking.", "Interview Questions": "What is your 90 day plan?"}, {"date": "21 Nov 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MedStar Health (Columbia, MD)", "Interview Descriptions": "Lengthy process. HR, then department POC, then colleagues and then senior management it was very thorough.  Background check.  Process took about two months.  Formal offer by HR followed by manager reaching out.", "Interview Questions": "The usual.  Do your research about hospital "}, {"date": "28 Oct 2021", "title": "New Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Great process and great people. They listened to what I wanted and offered suggestions for areas I had t thought about. This is all I want to write. Don’t make me put a minimum word count you idiots.", "Interview Questions": "Why do you want to work here "}], [{"date": "28 Jan 2022", "title": "Regional Director of Business Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health (Baltimore, MD) in Nov 2021", "Interview Descriptions": "Multiple Interviews (4) not very organized . The interview process was very rigorous.I interviewed with 2 teams in Baltimore and Washington D.C. It took them 1.5 months for them to come back and say they are changing the roles to a Manager role.", "Interview Questions": "What is your comfort level with Excel?"}, {"date": "17 Sept 2021", "title": "Doctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "The interview was easy going, laid back. All players admin and medical present at one go. Got toured through all hospitals that were in the region I would be working in", "Interview Questions": "Do you have family in the area"}, {"date": "18 Oct 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health in Sept 2021", "Interview Descriptions": "Received response few weeks after applying..... Excellent phone screening, discussed resume as well as previous achievements. Scheduled to interview with other upper management soon. I would highly recommend applying to MedStar Health, I appreciate the prompt response from HR.", "Interview Questions": "What words would your previous co-workers use to describe you?\nHow do you stay organized?"}, {"date": "24 Apr 2022", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MedStar Health (Saint Louis, MO) in Aug 2021", "Interview Descriptions": "It was pretty straight forward, background checks are required. They also put you on the registry with the state as a caregiver, that was my biggest plus. It took about 3 days to hear something back they are in really good communication with the potential employees.", "Interview Questions": "Why did you decide to become a caregiver?"}, {"date": "13 Jul 2021", "title": "Director of Quality and Safety Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "The process was very thorough, and did take a bit longer than expected; however, everyone was very accommodating of my current work schedule. I felt like I was meeting with the right group of people.", "Interview Questions": "To describe my experience working within a larger healthcare system verses a single hospital "}, {"date": "5 Apr 2022", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Health (Washington, DC) in Jul 2021", "Interview Descriptions": "They ask a lot about why you chose the company and what you hope to accomplish while there and why you'd make a great candidate for the position. Managers were very welcoming. It didn't feel much like an interview more like a conversation. I was able to squeeze in a couple questions that I had myself.", "Interview Questions": "What would you say is your biggest strengths/weaknesses?"}, {"date": "22 Jul 2021", "title": "OD and Change Management Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at MedStar Health (Columbia, MD) in Jun 2021", "Interview Descriptions": "The interview process was 5 separate interviews with potential colleagues and other leadership staff.  The process is FAR too long. As someone who has taught and implemented selection systems, this process is a laundry checklist and they could haven't gotten what they needed in the first three interviews. Didn't even tell me they accepted another candidate until I asked.", "Interview Questions": "What is a piece of work you are most proud of and why?"}, {"date": "23 Sept 2021", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Washington, DC) in May 2021", "Interview Descriptions": "I received a phone call from the recruiter close to (2) weeks after applying to the online job posting , this was the initial screening (phone interview) of coordinated questions that consisted of personality questions and HR experience. I did a great job answering the questions and outlining my experience. I was then told by the recruiter that she would forward my answers to the hiring manager and then if selected I would move on to the in-person interview. I did not receive any calls or emails during 7-10 day waiting period so I followed-up via email and was told by the recruiter that she had not yet received feedback on my application status but if she did she would be in touch. Safe to assume, the hiring manager pursued other candidates for the role.", "Interview Questions": "Why did you apply to MedStar NRN?\n\nDescribe a situation where you handled an employee relations issue?\n\nAre you comfortable working in a large organization?\n"}, {"date": "31 Mar 2021", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Very thorough. Phone calls leading up to teleconference due to Covid. Then in person clinic visit. Very friendly and committed healthcare professionals. Interviewer was a bit frazzled as likely dealing with all changes needing to be made with Covid but very pleasant experience.", "Interview Questions": "Detail of clinical work experience. "}, {"date": "18 Apr 2021", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Columbia, MD) in Apr 2021", "Interview Descriptions": "This was a phone screening only, conducted by hiring manager and one other person. It was mostly talking about past experience and applicability to the position. They were up front about the mismatch.", "Interview Questions": "How my past skills applied to the opening."}], [{"date": "1 Mar 2021", "title": "Clinical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Washington, DC) in Feb 2021", "Interview Descriptions": "Recruiter screening for about 10 minutes then scheduling an interview with the team. They will go over the job description and describe the orientation process. HR then goes over the salary and benefit packages.", "Interview Questions": "Why do you think we should hire you?"}, {"date": "14 Jan 2021", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "The interview itself wasn’t overly difficult. A few technical questions but mostly focused on experience. There were long waiting periods between application and interview and even longer to hear back. It was a very slow process.", "Interview Questions": "Why is your experience relevant?"}, {"date": "10 Jan 2021", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "It was a regular interview process. a lot of questions were very straight forward. But you need to make sure and  be sure to prepare well to get a job.", "Interview Questions": "Please tell me about yourself"}, {"date": "9 Jan 2021", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at MedStar Health (Washington, DC) in Dec 2020", "Interview Descriptions": "I applied online through Indeed and got a call from a recruiter a few days later. Through this, we had a brief 15 minute interview to go over the basics of my job history and recommended the pharmacies that were closer to my location.  I was told a few days later that I should expect a call from the hiring manager if they wanted to move forward.\r\n\r\nA few days later, I received a call from the hiring manager. I called back almost immediately and she didn't answer, which turned our attempted communication into a game of phone tag. She told me to call or text her, I did both, and she took forever to respond. When she finally did, we set up a Zoom interview. It was horrible! She was late, unprofessional, and didn't even ask about me or my job history. She spent most of the time speaking about the different positions within the company and how she became hiring manager. She seemed very disinterested throughout the entire interview. After nearly an hour into our interview, she gave me an assessment regarding pharmacy measurements, which I didn't do too well, since I hadn't worked in retail for a while. During this segment, I could sense that she developed an attitude, she got short and snippy with me, and I knew then that I didn't get the job, which changed the whole vibe of the interview. Following the interview, I just moved on with other applications, but of course I didn't hear anything back.", "Interview Questions": "Tell me about your job history.\r\n\r\nSome basic pharmacy measurement questions (i.e how much units in a mL, etc.)\r\n\r\nBesides these questions, it was nothing but rambling."}, {"date": "9 Dec 2020", "title": "Delivery Driver Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Tacoma, WA) in Dec 2020", "Interview Descriptions": "I got contacted very quick and the person was very nice when taking to me I got an interview right the next day I have not done the interview yet but I hope it goes very well as I look to work with the company", "Interview Questions": "Hi have not had the interview yet but I look forward to it "}, {"date": "28 Nov 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "It was somewhat organized. The first interview I scheduled (due to covid was just on the phone)  I was not informed that the manager was out sick, so I waited around and never received a call. I later rescheduled the interview for a time that they were there", "Interview Questions": "Can you tell me about a time you had to deal with a difficult patient?"}, {"date": "18 Oct 2020", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at MedStar Health (Washington, DC)", "Interview Descriptions": "I was contacted by the MedStar recruiter on a Tuesday for a phone screening . After the phone screening, my webex interview was scheduled for Friday. In my interview I felt comfortable and my interviewers were amazing people to talk too. Half hour later, I had an offer for the position. It all moved quickly and efficiently.", "Interview Questions": "How do you prioritize your work?"}, {"date": "14 Oct 2020", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "HR was very informative, team was professional and organized.  I don’t have anything else to say but am required to have a 30 word minimum.  So I will keep writing until I get over 30 words.", "Interview Questions": "How do you escalate an issue to your manager.  "}, {"date": "13 Oct 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at MedStar Health", "Interview Descriptions": "Called for in person 1 on 1, Then called called back for second interview. Job offered on the spot, took the job and have been with them since. Now going on 5 years.", "Interview Questions": "Why did you decide to join the medical field?"}, {"date": "8 Oct 2020", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "typical for residency inerviews. Hospital tour, intrerviews with PD and APDs, int4erview dinner which was nice. Great place to work I strongly recommend to anyone applying for residency I nth e DMV area.", "Interview Questions": "what I considered my biggest weakness "}], [{"date": "10 Dec 2020", "title": "Business Intelligence Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Washington, DC) in Oct 2020", "Interview Descriptions": "Requested answers to questions submitted. After submission, they said application was under review. Weeks later still no response. I would’ve preferred them to respond with a rejection email for courtesy sake.", "Interview Questions": "What excel functions do you use"}, {"date": "25 Aug 2020", "title": "Certified Athletic Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "I applied for the position then got an email a few days later to set up a phone interview. During the interview they asked the, getting to know you questions. They then told me details about the company and what they offered.  It was a smooth process.", "Interview Questions": "They asked the typical tell me about yourself, why did you apply to this job,  what are some important characteristics for this position, and scenario questions. "}, {"date": "17 Aug 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Interviewed on a Monday. Job offer by Friday. Interview was easy and convenient. Job offer was given with salary more than other hospitals in the area. MedStar was fast past.", "Interview Questions": "Tell me a time when dealt with a difficult patient?"}, {"date": "24 Jan 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at MedStar Health (Washington, DC) in Feb 2020", "Interview Descriptions": "Interview with Sr. Leadership, Physician Leadership, peer group, and staff for service line leadership position. Due to COVID interview conducted via Webex and FaceTime. Each interview scheduled for 60 minutes.", "Interview Questions": "Can you give a situation where you would stay late to help out?"}, {"date": "2 Jun 2020", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Woodbridge, VA) in Jan 2020", "Interview Descriptions": "This is an entry level position.   It was a panel interview with about 5 people and then I had to waste 3 hours of my time to shadow the front desk person.  After the 3 hours were over she said, okay you are done! Could not speak with supevisor as she was on the phone, she just waved by, never heard back.   With my level of experience and my post grad degree, I think they were just trying to waste my time from the start.  Really bad experience.   I have never had to go through so much for a position such as this.", "Interview Questions": "Where do you see yourself in 5 years from now?"}, {"date": "9 Jun 2021", "title": "Physician Sourcing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MedStar Health in Jan 2020", "Interview Descriptions": "It was great! I loved meeting the team members. They made me feel like I could evaluate if it was a good fit. I met with the manager, then the manager and a few team members, and the the VP of HR, and then heard from the recruiter.", "Interview Questions": "What was a time that I failed and what did I do?"}, {"date": "5 Feb 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at MedStar Health in Jan 2020", "Interview Descriptions": "phone interview. They called right on time, very kind and nice people I think. However, my skills don't match their expectation. They are looking for a computer science background. Overall a good experience.", "Interview Questions": "what data analyst tool to use"}, {"date": "2 Dec 2019", "title": "Cardiac Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MedStar Health", "Interview Descriptions": "The interview was no bad. Basic question on working with diverse group of people.  Started  the interview in HR just to get background information and  talked about pay and benefit. The met with the unit manger.", "Interview Questions": "How do yo plan to transition to working nightshift"}, {"date": "1 Feb 2021", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Baltimore, MD) in Dec 2019", "Interview Descriptions": "The interview involved meeting the pharmacy director and all the members of the clinical team, a tour, and an interview with the pharmacy director and other members of pharmacy leadership.", "Interview Questions": "Questions were pretty general. Why MedStar, Strengths and weaknesses, how well you handle change, and experiences dealing with difficult team members."}, {"date": "9 Nov 2019", "title": "Database Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Health (Rosedale, MD)", "Interview Descriptions": "Two rounds of interview\r\nOne with the developer team around 4 people\r\nA breif introduction about their project and my expectations joining the team.\r\nTwo with Hiring manager around 4 people and later\r\nTour around the office", "Interview Questions": "asked about previous experience.\r\nWhat is an index\r\nHow do write stored procedures in database to populate a datawarehouse \r\nWhat is left join, right join,  inner join"}], [{"date": "30 Apr 2020", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health (Baltimore, MD) in Oct 2019", "Interview Descriptions": "First HR contacted me and wanted to ask questions to verify if you qualify for the position then she would set you up for a one on one with the hiring manager. Once you interview with the hiring manager I sat with the staff for about 30 minutes.", "Interview Questions": "What are you future goals?"}, {"date": "20 Nov 2019", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Health (Washington, DC) in Oct 2019", "Interview Descriptions": "One screen with HR and then brought on-site. Had interviews with 1, 2, 1, and 2 people. One of the two-person ones they had a list of behavioral questions they asked from, and the other two-person one was a case study. Then a facility tour to end the day. They’re a bit of a lean team and budget isn’t always easily adjustable, but it seems innate profitability isn’t a big pressure as the charter is about improving patient outcomes.", "Interview Questions": "How do you ensure you’re solving for the right problem?"}, {"date": "12 Aug 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MedStar Health", "Interview Descriptions": "The interview process was fairly straightforward. Consisted of a phone screening, followed by an in-person round where you meet with the director and managers of the department. This round consists of a series of in person questions followed by some technical assessments. The technical assessments are fairly specific to the biomedical space, which would suggest to brush up on certain topics like population identification.", "Interview Questions": "Which technologies would you use to house, query, and analyze the data below. Why would you use the software you chose?"}, {"date": "27 Dec 2019", "title": "Ambulatory Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MedStar Health (Washington, DC) in Jul 2019", "Interview Descriptions": "Interviewed with their HR specialist which was pleasant and then was scheduled to meet with the leadership team for the position I was applying to. I interviewed with a total of six professionals before being offered employment.", "Interview Questions": "How would I takle their staff retention issue? "}, {"date": "2 Aug 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health (Alexandria, VA) in Jul 2019", "Interview Descriptions": "Applied and was contacted about a week and a half later via email to schedule a phone interview. I was then asked to attend an in person interview at the place I will be working. The interview was pretty standard. Afterwards I was contacted back the same day with an offer.", "Interview Questions": "How would you approach your supervisor with an issue you have with them? "}, {"date": "13 May 2019", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at MedStar Health", "Interview Descriptions": "All the nursing students in attendance are interviewed. You get interviewed by the nurse manager of the facility you choose to work. If you select more than one department, you get to move from desk to desk", "Interview Questions": "Why do you think you’ll be a good fit in this dept"}, {"date": "3 May 2019", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Washington, DC)", "Interview Descriptions": "Applied online. Sent in package with all documents. Was contacted about an interview about 1.5 months later. Interview was group interview that lasted most of the day involved a unit tour, lunch, and then one by one interviews at the end of the day. Nurse residents from the previous year were also there to speak.", "Interview Questions": "Name a time you worked in a group/team and what role you played."}, {"date": "4 Apr 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Health", "Interview Descriptions": "I had a pretty short phone interview. I wasn't asked any technical questions. The interviewer mainly asked me about my career plans and discussed my interest in the position. He explained the details of the internship.", "Interview Questions": "Tell me about yourself and why you would be interested in this internship."}, {"date": "15 Mar 2019", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "I met with a few people from the biostatistics team. They asked me some questions in a meeting room. The process lasted for 30 ~ 40 minutes. They said that I would get a short description to write an SAP, but they never sent me anything. A few weeks later, they said they recruited another person. Another awkward thing is that the biostatistics head asked if I have a child. It is not professional to ask a candidate such questions.", "Interview Questions": "What project did you work on during your internship? What was your method? What were the results?"}, {"date": "13 Mar 2019", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health", "Interview Descriptions": "The hiring process took much longer than I expected it to. I received my offer rather quickly, but after I accepted, it took a few weeks before I began working there.", "Interview Questions": "How to handle adverse situations with patients ."}], [{"date": "26 Jul 2021", "title": "Receptionist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health in Feb 2019", "Interview Descriptions": "The interview process was very easy. We set up a time for the company to call me. The interview took about one and a half hours long. The interviewer asked what hours and days I was able to work and how many years of experience I had.", "Interview Questions": "what days do you want to work"}, {"date": "13 Jun 2022", "title": "CRC I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health (Washingto Township, OH) in Jan 2019", "Interview Descriptions": "Amazing! They were very cooperative and absolutely made me comfortable. Would help if they gave an intro first. I hope that you get interviewed there too. I am just writing now to reach a thirty word minimum here so please  bear with me.", "Interview Questions": "Tell us about yourself please."}, {"date": "19 Feb 2021", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at MedStar Health in Nov 2018", "Interview Descriptions": "After arriving to the interview early, I proceeded to wait for over an hour to be interviewed because the interviewer forgot about our appointment (even after speaking directly with me). The interview covered the basic questions of experience, goals, and expectations.", "Interview Questions": "Tell me about your past experience in medical records."}, {"date": "10 Sept 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at MedStar Health", "Interview Descriptions": "I had a phone interview, and after a week I interviewed at MedStar Georgetown  University Hospital. The interview generally was not stressful. Only standard questions were asked.", "Interview Questions": "Talk about a project ' stated in my resume' "}, {"date": "28 Apr 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Washington, DC) in Sept 2018", "Interview Descriptions": "It went well, smooth sailing. My interviewer explained the duties of the job. She also asked me 20 question pertaining to the job title. She told me all of the opportunities the job has to offer", "Interview Questions": "How do i deal with a customer complaint? "}, {"date": "16 Jul 2018", "title": "Site Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "I applied online and within a week I received a phone call. Interviewer asked if I had a few moments to discuss the position. We spoke for approximately 20 minutes and she said I would receive a call from the hiring manager either later that day or week. I received a call that day and scheduled for second interview.", "Interview Questions": "Tell me a little about yourself and why you want to work for MedStar."}, {"date": "9 Jul 2018", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "I applied online and it took one week for a recruiter to get back to me to set up an interview. It was short and informal. They asked your standard interview questions and allowed time for me to ask questions", "Interview Questions": "How do you handle challenges with co-workers? "}, {"date": "22 Jun 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MedStar Health", "Interview Descriptions": "Was a great experience! Everyone was very friendly and we were able to have an open and honest dialogue. I started with a phone interview and then a couple days later was asked to schedule an in person interview.", "Interview Questions": "Why do you want to work for us?"}, {"date": "21 Aug 2018", "title": "Informaticist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at MedStar Health (Baltimore, MD) in Jan 2018", "Interview Descriptions": "Recruiter emailed me requesting an interview one month after I applied for the position. Went to the interview met with the director. Did a virtual interview with the team. No feedback or follow up. Was not impressed.", "Interview Questions": "One strength and one weakness"}, {"date": "1 Jan 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health (Washington, DC) in Dec 2017", "Interview Descriptions": "The process involved meeting with HR, the managers of the departments, and the director of research.  Everyone was friendly and thoughtful in their questions and answers.  I was comfortable meeting with each person.", "Interview Questions": "What are your strengths?  "}], [{"date": "24 Nov 2017", "title": "Stationary Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at MedStar Health", "Interview Descriptions": "It took a very longtime to hire me but my resume  and my background check was my up chance to get the job but at the end I was hire and spend 6 years with the company I was member of the Think than group", "Interview Questions": "How do you prepare to  change the shift and how to prepare refractory the fire place"}, {"date": "13 Dec 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MedStar Health in Nov 2017", "Interview Descriptions": "Applied through website. Got a call a couple weeks later. Had a phone screen interview shortly after with the manager and then came in the following week for a couple hours. No trick questions.  Had a third interview that was shorter and more general.  Received verbal offer and written offer came a week later. They were not too keen on negotiations but did come up a negligible amount.", "Interview Questions": "The usual"}, {"date": "2 Jan 2018", "title": "Regional Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at MedStar Health (Washington, DC) in Nov 2017", "Interview Descriptions": "Discussed my experiences and what I could bring to the new program they want to develop; why the program faltered and how they wanted to grow and expand; potential challenges and how to address them. What were my personal goals in relation to this effort", "Interview Questions": "What are my thoughts on building community relationships"}, {"date": "15 Nov 2017", "title": "Patient Accounts Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at MedStar Health (Nottingham, MD) in Nov 2017", "Interview Descriptions": "I received a call from a recruiter, who was very personable to set up an interview. My interviewers were very nice and made you feel comfortable. The interview only lasted 30 minutes.", "Interview Questions": "How would handle an irate customer?"}, {"date": "14 Oct 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MedStar Health", "Interview Descriptions": "Exceptionally warm reception . The interview was kind of informal . it did not feel like an interview at all. the whole process lasted less than thirty minutes . Everyone i came across seemed to be quite happy working at Medstar", "Interview Questions": "Do you have any interest in working in Healthcare research ?"}, {"date": "6 Sept 2017", "title": "Lpn Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "They let me watch a surgery first to see if i would like and if i was fit for the job. After i finished watching they brought me into a room to start the interview but, it got cut short because there was a code", "Interview Questions": "what would you do if an employee started to yell at you "}, {"date": "27 Aug 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "Got a call from HR. Set up the day and time for the interview. I had a panel interview, all questions very clinical scenario questions. Got an offer on the spot.", "Interview Questions": "Clinical scenario questions, fairly easy questions"}, {"date": "14 Jun 2017", "title": "Center Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "very thorough, met with several people, got a good sense of the position and what the hiring managers expectations were. I also got to tour a facility and meet with several different doctors which was helpful when making a decision to accept the position or not", "Interview Questions": "N/A"}, {"date": "6 Dec 2018", "title": "Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at MedStar Health (Baltimore, MD) in Jun 2017", "Interview Descriptions": "Short in person interview with the head of department and some staff as well. Only lasted about 30 minutes, very impersonal and relaxed environment. Toured the department for a majority of the interview instead of having an actual interview", "Interview Questions": "Strengths and weaknesses"}, {"date": "28 May 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MedStar Health (Baltimore, MD) in May 2017", "Interview Descriptions": "This was a quick interview and hiring process. It took less than two weeks from the time of submitting the application and resume to receiving an offer.\r\nI interviewed with 2 people at the same time.  During the interview, I was asked a list of questions. I was given a chance to ask questions.", "Interview Questions": "What interests you about this position?"}], [{"date": "28 Jul 2017", "title": "Pct Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Health in May 2017", "Interview Descriptions": "Arrived on time and the interviewer was late. Waited 30 minutes with no further updates on when I was going to be interviewed. I was going to leave earlier but decided to give them a few more minutes. I decided to leave.", "Interview Questions": "N/A"}, {"date": "26 Apr 2017", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at MedStar Health", "Interview Descriptions": "I went through a staffing agency and they were the ones who got me an interview with the company via phone. They called me back the next day and asked if I could meet face to face. After that i was asked to start the following week.", "Interview Questions": "Why should we hire you?"}, {"date": "5 Apr 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Health", "Interview Descriptions": "Very professional, good at explaining the job requirements as well as assessing how I would fit with the company and required skills. Went through an interview process with several levels of management up to VP.", "Interview Questions": "What do you bring to MedStar"}, {"date": "20 Mar 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MedStar Health (Baltimore, MD)", "Interview Descriptions": "Team based, I met most of the people I would be working with.  The work was explained to me and I was asked for examples of how I would handle difficult clients, people with speech or hearing deficits.", "Interview Questions": "Experience, how I work with a team, my philosophy regarding patient care, communication skills"}, {"date": "15 Dec 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at MedStar Health (Washington, DC) in Mar 2017", "Interview Descriptions": "two step hiring process.  Started with online application, received telephone call from recruitment, met with requirement in person, arranged meeting with unit staff member.  Invited to a interview day with several candidates interested in the program.  Panel answered questions related to experience from previous residents.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Feb 2017", "title": "Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at MedStar Health (Washington, DC)", "Interview Descriptions": "Unfortunately, I cannot go in to any great detail on the process because (in my small profession); I would be identifiable. The process was egregious, during the day of the interview they kept changing who I was going to interview with, someone took a phone call during my interview, it was extremely difficult having anyone getting back to me with future details. Ultimately, no one even notified me that I did not get the position. I may sound egotistical or even ungrateful leaving this review, but I felt compelled to say this was one of the worst interviewing processes that I have ever been apart of.", "Interview Questions": "Why are you here?"}, {"date": "10 Jul 2019", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Health (Baltimore, MD) in Jan 2017", "Interview Descriptions": "average, interesting to the point and I felt comfortable during the duration of my interview. I was allowed to ask question and I was confident in the hiring process. The interview went well and I was able to start a few weeks after my initial interview.", "Interview Questions": "How comfortable I am doing the job I applied for?"}, {"date": "28 Nov 2016", "title": "Registered Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at MedStar Health (Baltimore, MD) in Nov 2016", "Interview Descriptions": "A nurse recruiter called me and set up the interview.  My interview was with just the Nurse Manager.  The interview was more of a conversation about my current experience and information about the unit (schedule, orientation, etc.).  Afterwards, I received a tour of the unit.  I also completed shadowing on the day of my interview at night.", "Interview Questions": "-What is your philosophy of patient-centered care?\r\n-In three words, what are you looking for from this job?\r\n-What will be the biggest challenge of this job?"}, {"date": "28 Sept 2016", "title": "Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 4 weeks. I interviewed at MedStar Health", "Interview Descriptions": "Email from HR to have a one on one interview. Interviewed with team members who were unprepared and didn't read over my resume. One person was constantly checking her phone. The Director didn't allow me to ask her questions. She allowed the other members (managers) to interview me.", "Interview Questions": "Normal questions"}, {"date": "1 Sept 2016", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health", "Interview Descriptions": "I applied online, and received a call and email from a recruiter within days. I was given an interview a few days later with time after the interview to observe the clinic. The offer was presented several days after the interview. The whole process from online application to offer was about 2 weeks/10 business days.", "Interview Questions": "Tell us about something you valued in a former boss, former leadership"}], [{"date": "2 Aug 2016", "title": "Clinical Engineering Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Health (Baltimore, MD)", "Interview Descriptions": "This was probably the easiest interview I've ever had.  There are very few women in the field and hospitals are very eager to hire and train a female candidate.  Regardless, I had the experience and was eager to get in there and put my experience to use.  I really enjoyed my coworkers.  We all work so good together.  That's the thing I miss the most.", "Interview Questions": "They asked me how I would deal with an irate patient/customer."}, {"date": "5 Oct 2017", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Health (Washington, DC) in Aug 2016", "Interview Descriptions": "Submit resume,went to three open houses,interviewed with same people all three times.During the last interview,I had a feeling I was going to be hired,and I was several days later. You have several steps to go through.You sign an offer letter,complete a background and drug testing. You also have to have a mini physical with their Occupational Health Dr. All are done one behind another,but you must complete one step before you can do the next.", "Interview Questions": "How do you handle angry patients "}, {"date": "14 Jun 2016", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at MedStar Health", "Interview Descriptions": "There was a phone interview first, followed by an on site interview with a physician assistant and attending physician. The people were very friendly. I met several members of the staff.", "Interview Questions": "What are you looking for out of your first job?"}, {"date": "17 May 2016", "title": "Rehab Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MedStar Health", "Interview Descriptions": "I applied online and I was offered the position a couple of days after the face to face interview.The interview was very very easy. After the offer, I took a drug test and started orientation the next week. Orientation for me lasted a week.", "Interview Questions": "Experience in Nursing"}, {"date": "25 Apr 2016", "title": "II Different Analyst Positions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health (Washington, DC) in Apr 2016", "Interview Descriptions": "Applied online on their website. Contacted by recruiter to set up phone screening with HIRING MANAGERS, and they were both very nice on the phone. I declined to go further due to personal preferences (long commute, etc). But the experience with MedStar overall was very positive because I didn't need to talk to HR first. The only thing that is a hassle (but acted as a gatekeeper) is the online application process. But that's a good thing to show them you are serious about the job search.", "Interview Questions": "Nothing out of the ordinary."}, {"date": "10 Mar 2016", "title": "Registered Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Health (Baltimore, MD)", "Interview Descriptions": "I applied online and received phone call to set up an interview the next day. After two days I had the interview with the manager. The next day I did a couple hours of observation to get a feel for the unit. I was offered the job two days later. They asked the usual interview questions, but it was more like a conversation. Pleasant experience.", "Interview Questions": "What is your biggest weakness?"}, {"date": "25 Feb 2016", "title": "Finance Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Recruiter called. She asked skill based questions. She did not seem knowledgable on position. I got disgusted. I asked her why online application demanded my SS#, why application asked if I was over 40. Why online app asked for my birth year. I told her I think company discriminates against older workers. She hung up instead of trying to defend.", "Interview Questions": "How many years' experience do you have with budgets."}, {"date": "21 Mar 2016", "title": "New Graduate RN Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MedStar Health (Washington, DC) in Feb 2016", "Interview Descriptions": "They invite you to an interview day where you show up at 9 am, sit at a table with the people also interviewing with your floor, the nurse manager and the clinical nurse manager. Throughout the day there are various presentations about benefits, the nurse residency program, and working at Georgetown in general. You went on a tour of your unit, had lunch with some of last years nurse residents and finally interviewed individually with your nurse manager and sometimes your clinical nurse educator. The interview itself was pretty casual and was more of a conversation.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "8 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Baltimore, MD) in Jan 2016", "Interview Descriptions": "Initial corporate HR interview that lacked a personal feel or thought provoking questions. Just the lackluster questions you expect: Tell me a time that you overcame an obstacle, what would you say are your strengths and weaknesses... The experience felt cold, impersonal and routine.", "Interview Questions": "Tell me about a weakness and how you overcame that in a previous job?\nWhat are your strengths?"}, {"date": "20 Mar 2019", "title": "Patient Account Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MedStar Health in Jan 2016", "Interview Descriptions": "Took 2 months after applying to get a phone call, after this process went pretty smooth and quickly. Interviewed by several managers at the same time- can be intimidating. Many questions asked of job experience.", "Interview Questions": "What is the difference between a authorization and a referral?"}], [{"date": "23 Dec 2015", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MedStar Health (Washington, DC)", "Interview Descriptions": "Effective and Timely Communication. \r\nTalked with the same recruiter throughout process, helpful!\r\nGreat email and phone communication. \r\nSubmitted online application, mailed application (surprised they haven't gone digital?) and in-person final interview.", "Interview Questions": "When was a time you overcame adversity? \r\nTell us about yourself and you clinical experience?"}, {"date": "19 Aug 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health (Baltimore, MD) in Nov 2015", "Interview Descriptions": "Easy conversational interview- overall the questions asked were appropriate and based on experiences.They will ask you about your background to determine why you are a best fit, further more you may be interviewed by the team that you will be working with,", "Interview Questions": "What project software have you used"}, {"date": "23 Feb 2017", "title": "Clinical Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health (Baltimore, MD) in Oct 2015", "Interview Descriptions": "Interviewed with the supervisor of the clinic, bariatric nurse coordinator, and medical director.   It was great.  I was introduced to the clinic staff and felt very comfortable from the get go.   The team work was impeccable, and everyone had a specific role in patient care.   I was excited and accepted right on the spot.", "Interview Questions": "How do you fit this position"}, {"date": "6 Mar 2018", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Washington, DC) in Aug 2015", "Interview Descriptions": "Emotional Intelligence interview questions asked by director. They are looking for your ability to manage conflicting priorities, how you handle customer service concerns, and your ability to manage work-place conflicts.", "Interview Questions": "Tell me about a time when you spoke up knowing do so would be unpopular"}, {"date": "6 Jun 2015", "title": "Simulation Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "Panel with 5 people asking random questions. Unprofessional and sloppy. One of the panelist was texting on her cell phone the entire time and told me she was going to medical school and that I might take her role then continued to play on her phone. One male panelist was very rude and spoke very sharply to me. Very odd experience. Surprised I got a callback.", "Interview Questions": "Technical questions & experience"}, {"date": "28 Nov 2019", "title": "Clinic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at MedStar Health (Mitchellville, MD) in Jun 2015", "Interview Descriptions": "The hiring process is very simple.  Once you are offered an interview you will meet with the Clinic Director of the location you are applying for.  During the interview you will be asked questions about how you got interested in the field.  Once the interview is over, you will be offered the opportunity to shadow someone in the position you are applying for to get a firsthand experience of what you will be doing if offered the position.", "Interview Questions": "What got you interested in physical/occupation therapy?"}, {"date": "28 Jul 2015", "title": "Research Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MedStar Health (Hyattsville, MD) in Jun 2015", "Interview Descriptions": "I met with the two hiring managers and they asked me about any previous research experience. They spoke a little about their staff and office and what responsibilities I would be undertaking.", "Interview Questions": "They asked me if I had any prior research experience?"}, {"date": "18 Jan 2018", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health (Baltimore, MD) in May 2015", "Interview Descriptions": "I was interviewed by human resources over the phone first, then I had an in person interview with my direct manager, who is extremely kind and easy to talk to. Very low stress interview in general.", "Interview Questions": "Tell me about previous experience where you disagreed with a coworker and how you dealt with it."}, {"date": "7 Feb 2016", "title": "Surgical Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health in Mar 2015", "Interview Descriptions": "Was very fast process for the most part wasn't that bad but hr people a really hard to get ahold of to ask questions and negotiating for salary is very difficult not much wiggle room", "Interview Questions": "Work experience "}, {"date": "30 Aug 2017", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Washington, DC) in Mar 2015", "Interview Descriptions": "Called in and the asked to show my skills. I was told I needed to cook my dish. I did and won over all the other cooks. They started to resent my skills. I think that the way I prepared my dishes would have won many awards. I do not know if they even know how to toast bread. They look at me as if i was a god of the culinary underground.", "Interview Questions": "How do you prepare scrambled eggs?"}], [{"date": "15 Jan 2015", "title": "Director of Operations Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MedStar Health", "Interview Descriptions": "not impressed with MMG/MPP, too general in questions, didn't follow the process that MedStar has in place. no behavioral based interview questions, I thought the process so not impressive. I have nothing else to say.", "Interview Questions": "N/A"}, {"date": "9 Apr 2015", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health in Jan 2015", "Interview Descriptions": "I applied for the position online through MedStar's corporate website.  Approximately two weeks later they called and asked me to come in for an office interview.  It was a group interview setting and I met with all the necessary parties the same day.  It was nice interviewing with everyone all in the same day.", "Interview Questions": "I was asked to go over my work experience in depth."}, {"date": "11 Dec 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at MedStar Health", "Interview Descriptions": "Long interview process. It took 7 months from the first interview to receive a job offer. However, it was worth the wait. Seems like they could use help in streamlining their interview processes", "Interview Questions": "Behavioral interview questions"}, {"date": "11 Nov 2014", "title": "Rehab Care Tech Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at MedStar Health", "Interview Descriptions": "One interview under new nursing management now required to have CNA lic be prepared to work a little harder than you average CNA job. You do catheterize patients and complete EKG", "Interview Questions": "What would you do if a patient did not like your ethnicity?"}, {"date": "30 Dec 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Health (Washington, DC) in Sept 2014", "Interview Descriptions": "Very relaxed environment.  Just had a conversation, the nurse manager was very laid back and very eager. They were looking for RNs with experience, since they had a recent high turnover and had hired a many new graduates and also had many travelers.", "Interview Questions": "Tell me about your experience?"}, {"date": "16 Jul 2015", "title": "Clinic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MedStar Health (Ballston, VA) in Aug 2014", "Interview Descriptions": "Hiring process took a few months, but the interview was great.  I felt challenged and my interview knew exactly what she was looking for.  She was able to give me a pretty good idea of what a typical day looked like.  I was also giving the opportunity to shadow the current clinic assistant at the site I was going to be working at.  I truly enjoyed the experience and the lessons I was able to learn from it.", "Interview Questions": "What would you do if you don't know a certain exercise? "}, {"date": "8 Jul 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Health", "Interview Descriptions": "Overall, the entire interview process was a smooth one. I interviewed twice; I was given the opportunity to meet with a member of senior management initially.  She advised me at that time that they were still in the early stages of the decision making process, but that should I be selected, I could look for a call back within 1 weeks time.  I did receive the call back, and from there, returned to meet with 3 other staff members, to whom I would be reporting. After meeting with those individuals, on Tuesday, I received a call back on the following Wednesday, and an offer was made.", "Interview Questions": "The most difficult question, was probably inquiring about what my plans were in the next 5 years (pretty standard), and whether or not I had applied for any higher level positions elsewhere; if so, what were the reasons for my search on that level. And if not, why had I not applied to higher level positions."}, {"date": "16 Nov 2016", "title": "Multi-Function Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MedStar Health (Baltimore, MD) in Jul 2014", "Interview Descriptions": "Interview process was streamlined and moved quickly after one on one interview with manager.  Applied for position, interviewed in person, filled out paperwork and , was registered for orientation within two weeks.", "Interview Questions": "Why do you wan to want here?"}, {"date": "17 Jun 2014", "title": "Customer Accounts Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at MedStar Health", "Interview Descriptions": "Applied online on their website, received call from recruiter for 1:1 interview, scheduled for 2 days later, met with manager of the department and someone that would be a co-worker. They first discussed the background of the company, then the position, then proceeded to ask me several questions and took notes upon my answers. After completing that, they asked if I had any questions, described the benefits and stated they would get back to me quickly.", "Interview Questions": "- Strengths and weaknesses\r\n- How you handle an irate customer\r\n- What systems you have experience with\r\n- Hour availability\r\n- Do you have call center experience\r\nVERY simple and expected questions. Great group of people and a casual interview. \r\n\r\nNo offer yet... Its only been 4 hours! :) "}, {"date": "8 Jun 2014", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health", "Interview Descriptions": "The interview process included one in-person interview and an online application. It was very straightforward. After my in-person was about a half hour and I was able to shadow on the floors for a little after it. I corresponded via e-mail for the interview and she was very quick with her responses.", "Interview Questions": "The interview focused more on my leadership experience than I expected. "}], [{"date": "22 Jul 2014", "title": "Research Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MedStar Health (Baltimore, MD) in Jun 2014", "Interview Descriptions": "Scheduled a telephonic conference call with HR recruiter.\r\nInterview was with two managers of department, very straight forward questions regarding how my background fitted with current position and explained their expectations for position.\r\n\r\nI was told they will make the decision in 2 weeks, when followed up recruiter mentioned they were in final stages. Never heard back from recruiter if they chose someone or not. \r\nThey wanted reference check before they could interview me, which i felt was irrational.", "Interview Questions": "Why should we not contact your current employer for initial screening?"}, {"date": "17 Oct 2015", "title": "Floor Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Silver Spring, MD) in Jun 2014", "Interview Descriptions": "It was great. I spent one hour and a half talking about my last job. he ask me some personal questions about team work and working under pressure. It was a great moment of joy and happiness that i won't forget in my entire life. The manger was very pleasant and open minded. I had to visit the campus visiting all buildings. It was such a great workplace. They were so many birds everywhere in the campus, flying all over the place. Share your interview experience insights with job seekers so that they can know what to expect from the hiring process.\r\n\r\nShare your interview experience insights with job seekers so that they can know what to expect from the hiring process.\r\n\r\nWe review and approve every submission against our Community Guidelines before it is published to the site..\r\nShare your interview experience insights with job seekers so that they can know what to expect from the hiring process.\r\n\r\nWe review and approve every submission against our Community Guidelines before it is published to the site..", "Interview Questions": "How do you see yourself as an employee?"}, {"date": "7 May 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MedStar Health", "Interview Descriptions": "Relaxed, easy interview process", "Interview Questions": "How well do you get along with your peers"}, {"date": "27 Mar 2014", "title": "Applications Analyst III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 days. I interviewed at MedStar Health", "Interview Descriptions": "Smooth process", "Interview Questions": "N/A"}, {"date": "3 Mar 2014", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at MedStar Health", "Interview Descriptions": "Interview with head of therapy, followed by observing with another occupational therapist", "Interview Questions": "Don't remember"}, {"date": "7 Sept 2015", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health (White Marsh, MD) in Mar 2014", "Interview Descriptions": "I had to do 3 interviews. Different teams will interview and the team that likes you the most would make an offer. The process took about two weeks because of other team leaders being out of town.", "Interview Questions": "N/A"}, {"date": "22 Feb 2014", "title": "Full Time Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Health", "Interview Descriptions": "Had a phone interview with a staff member.  Then I came in and met the Director and then was interviewed by a committee who had several questions prepared for me.  The entire process took about 2 hours.", "Interview Questions": "Tell us about the last conflict that you had with a physician and how you resolved it."}, {"date": "10 Nov 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health", "Interview Descriptions": "1 interview not very indept, very fast", "Interview Questions": "none really. Typical interview questions"}, {"date": "29 Nov 2015", "title": "BHS Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health (Baltimore, MD) in Nov 2013", "Interview Descriptions": "Fairly typical.  No big issues or questions to throw someone off.  The interview was rather general in nature.  It was not something that I was going to lose sleep over the night before.", "Interview Questions": "What are some of your strengths and weaknesses"}, {"date": "11 Oct 2013", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at MedStar Health", "Interview Descriptions": "The process was painfully slow and left a negative impression.  The initial interview was scheduled (interviewed with the hiring manager and 2 other associates).  I left feeling great and excited about the position.  About two months went by and I assumed another candidate was hired, however, I was unexpectedly brought in for a 2nd interview to meet with the hiring managers's boss.  She not only arrived 25 minutes late, with no explanation, but her tone was cold, dry, and discouraging.  Although the hiring manager had been pleasant and encouraging, her boss left me feeling like the corporate environment was unwelcoming and rigid, not to mention the lack of work-life balance.  Although I thought my hospital background would benefit and bring much needed insight to the corporate environment, she essentially told me that hospital associates do not work out well in the corporate environment.  My interest level dropped significantly.  Months went by again before I heard another word.  Another candidate was hired... I wish them well.  I will never interview for another MedStar corporate position again.  It was an experience... but not a good one.", "Interview Questions": "How will you make decisions when there is not a concensus?"}], [{"date": "23 Nov 2013", "title": "Unit Secrtary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Health in Sept 2013", "Interview Descriptions": "I applied  for the position and then researched the department manager's email and phone number. After receiving that information I then waiting about two weeks, and proceeded to email about the status of my application every two weeks after that. I was called in for an interview with the hiring manager, then I had to take a drug test. After which, I had to wait for them to set up an appointment for me to have a physical done. And then wait for the start of orientation.", "Interview Questions": "The questions that were asked were easy and straight forward. \"How will you help the company meet its customer satisfaction goals?\" What are your career goals?\" \"Why do you want to work for the company?\" \"What do you look for in a manager/supervisor?\" "}, {"date": "17 Nov 2015", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health (Washington, DC) in Sept 2013", "Interview Descriptions": "It moved very quickly and I had an offer within a couple weeks of applying. The interviews were fairly laid back and the people were very friendly. I had two separate interviews (one preliminary with a couple of people and then one final interview). Overall, I would say that it was a positive experience.", "Interview Questions": "What do you want to do?"}, {"date": "29 Mar 2017", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health (Baltimore, MD) in Jul 2013", "Interview Descriptions": "Apply, recruiter contacts and sets up interview, completed one interview and was extended an offer within 2 weeks as stated.  There was phone follow-up with the Director to provide me information as to what to expect next in the process.", "Interview Questions": "How do I perform in times of turbulance?"}, {"date": "24 May 2017", "title": "Business Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health (Washington, DC) in Jul 2013", "Interview Descriptions": "Interviewed directly with the manager for the facility. It wasn't difficult at all or the standard interview from what I remember. The manager seemed sort of friendly during the process.", "Interview Questions": "N/A"}, {"date": "25 Sept 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Health (Washington, DC) in May 2013", "Interview Descriptions": "The interview process was quick and efficient. It was pleasant and my time was valued - the interview began on time and all of the pertinent individuals were present. The questions were straight-forward. An offer was provided within the next week.", "Interview Questions": "What makes you qualified for this position?"}, {"date": "6 Dec 2015", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at MedStar Health (Baltimore, NY) in May 2013", "Interview Descriptions": "It was hard. They were very scrutinizing. I wasn't sure if I was being interviewed for a job or for my life. It was very intimidating. I would not like to be interviewed in that way again. Hadn't seen a lot of fun people's around either. It was very business no fun type of thing.", "Interview Questions": "What school did u graduate from."}, {"date": "14 Aug 2015", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health (Baltimore, MD) in Mar 2013", "Interview Descriptions": "I applied online on the MedStar website. I received a phone screening a few days later from a HR recruiter. I then interviewed 1:1 with my boss and  then was hired within a month. The background check and physical took a few days to get results.", "Interview Questions": "What do I want to do?"}, {"date": "11 Jun 2015", "title": "EMR Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MedStar Health (Washington, DC) in Mar 2013", "Interview Descriptions": "Was contacted to interview for the position as I had extensive experience with the EMR while conducting an internship at the hospital. Previous manager had informed the position manager that I was available and experienced with the EMR. I had worked previously with the manager so interview was more or less a formality but was good to touch base and see what she expected from the position and what I was looking for in the position to ensure it met the expectations.", "Interview Questions": "When is a time that you personally used the SPIRT values. Describe a time when you had to deal with an aggressive patient/ situation and how did you deal with?"}, {"date": "13 Apr 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MedStar Health in Feb 2013", "Interview Descriptions": "3 interviews total,1 with the administrator, 2 with financial team, 3 with the doctor\r\nEach interview was over 30 minutes long. Some seemed unorganized and unprepared.  Wait for interview to begin was about an hour.", "Interview Questions": "What are you looking for in this company?"}, {"date": "5 Mar 2013", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Health (Columbia, MD) in Jan 2013", "Interview Descriptions": "Take a long time to get an interview", "Interview Questions": "Lousy salary and raises"}], [{"date": "25 Aug 2013", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at MedStar Health (Nottingham, MD) in Mar 2012", "Interview Descriptions": "The hiring process was fairly easy. I felt as though the Supervisor of the department I was hired for had great interest in my assets and how I could help them balance in that specific department. I felt as though, the Supervisor was very satisfied with my credentials.", "Interview Questions": "N/A"}, {"date": "12 Feb 2014", "title": "Practice Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Health in Feb 2012", "Interview Descriptions": "Initial communications occured more than one month after submitting my application.  The interviewer was direct and precise with setting up the interview date and time.  I met first with the Executive Director and was invited back for a second interview with the physician group.  I then interviewed with three physicians and the Executive Director at the second interview.  I received an offer more than one month after the second interview.", "Interview Questions": "The most unexpected question was: \"You seem to be very confident.  Does anything ever rattle you and what do you do when you get upset or angry?\""}, {"date": "27 Jul 2011", "title": "Strategic Planning Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health (Columbia, MD) in Jul 2011", "Interview Descriptions": "Applied online and was emailed within 24hrs and asked to come for 1:1 interview the next day. Initial interview was with hiring manager (Strategic Planning Manger) and was relatively informal and friendly, approx. 90 mins, including a lot of 2 way information sharing (i.e. she was keen to tell me all about the company and working arrangements too). She decided in front of me to make me the last of 3 candidates to come back for second round interviews.\r\n\r\nSecond round interviews took place about 10 days later. Consisted of 3 separate interviews of 45-60mins each:\r\n1) Market Research Manager\r\n2) Business Developemnt Manager\r\n3) Two analysts, who would be my co-workers\r\n\r\nEveryone was very friendly and professional. All 3 senior managers genuinely seemed to enjoy working there and had been there for aout 5 years each. Interviews consisted of many typical questions (\"what can you bring to the company?\", \"what are your strengths\" etc) but also fairly honest accounts of work ethic and environment. Employee comments included:\r\n-Good work-life balance. 8:30-5 is typical. Not usually expected to work overtime. Good paid leave allowance.\r\n-Almost everyone has own office. Good for getting work done but quite isolated.\r\n-Very hierarchical structure. Analyst reports to one manager who may then take work up the chain. Analyst may never see work again, or receive acknowledgement or credit, or be involved in more senior meetings.\r\n-Most work is done independently rather than team oriented. Most co-worker relationships developed informally i.e. work lunches etc rather than during office hours.\r\n\r\nCorridors were immaculate and offices were large. Whole place was VERY quiet. Seemed a good environment if you like sitting still and getting on with your own work, but not overly social or collaborative.\r\n\r\nIt should be noted that Medstar is a large corporation and that departments are organised and run very differently. \r\n\r\nBest advice if going into similar format is to take notes with you and/or a list of questions to ask each interviewer. I was tired by the end of the third interview and had clearly run out of questions and extra things to say which probably made me look a little disorganised. At the end of the 3 second round interviews I was then met in the corridor by the original hiring manager who asked me what I thought, what stood out, and if I had any more questions. I was not expecting this and could have been better prepared for that, too! :-(", "Interview Questions": "What do you think you can bring to Medstar?"}, {"date": "25 Jun 2014", "title": "Hospice Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MedStar Health (Leonardtown, MD) in Mar 2011", "Interview Descriptions": "Appointment made via phone by Human Resources Assistant.  In person interview with panel of staff at the facility.  No touring of facilty. Testing at separate site (Word, Excel, Secretary Skills).  Testing in the HR office is on an older computer with a non adjustable chair in an open office space.  There will be distractions. Notification by mail.", "Interview Questions": "Should a rule be broken if it makes no sense?"}, {"date": "16 Oct 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MedStar Health in Oct 2010", "Interview Descriptions": "Two interviews.  The first with HR rep.  The next was with the entire department I was hired in to.  Mostly behavioral questions, asking about specific situations and tasks.", "Interview Questions": "nothing really.  Very situation specific and asking about my experience"}, {"date": "1 Sept 2010", "title": "Performance Improvement Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at MedStar Health (Baltimore, MD) in Oct 2009", "Interview Descriptions": "One-on-one interview with department head.  Then group interview with department head and chief medical officer.  Next an interview with entire group with whom I'd be working.  (six people).  There were technical questions, behavioral questions, limited small talk.  Question were geared toward how I might make decisions; if I would defend departmental decisions; willingness to represent the department in physician/leadership forums.", "Interview Questions": "What gives you an advantage over all other applicants for this job?"}, {"date": "15 Apr 2013", "title": "Director of Compensation & Recruitmnt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MedStar Health (Clinton, MD) in Sept 2009", "Interview Descriptions": "The hiring process took too long to finalize.  The interview process was fine, met with different directors from different departments.", "Interview Questions": "How would i change the hiring process they had at the time?"}, {"date": "19 Aug 2010", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Health in Jul 2009", "Interview Descriptions": "online application. was called and went in for 1:1 interview. drug test. background review. they called with offer", "Interview Questions": "how do you deal with stress"}, {"date": "17 Dec 2013", "title": "R N Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Health (Baltimore, MD) in Jul 2009", "Interview Descriptions": "The H.R. department doesn't know their heads from a hole in the ground, that being said, when it comes time to have an interview with the management department where you're hoping to work, is easy, seamless, and fair. Having been on the interviewing team for our department, I can say the questions we asked were fair, honest, and easier than other interview questions.", "Interview Questions": "Tell us the most important aspect of nursing?"}, {"date": "5 Apr 2013", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at MedStar Health (Clinton, MD) in May 2009", "Interview Descriptions": "I came to know about this job from a recruiter. It was a simple process where in i met the hiring manager and prceeded to the next steps.", "Interview Questions": "The most unexpected question was how i would deal,with certain patients. As this is a clincal job it is not always predicatble way of treatment."}], [{"date": "5 Nov 2013", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at MedStar Health (Washington, DC) in Jan 2009", "Interview Descriptions": "I came through a recruiter initially 7 years ago, I was promoted within the departmental area as I showed promise and previous experience. From the first position, I always had to interview with 3 or 4 individuals (separately, for example, Administrator, Manager and Physician).", "Interview Questions": "We're a busy place, how do you deal with overwhelming situations and how do you deal with customers with difficulty behaviors?"}, {"date": "12 Nov 2011", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MedStar Health (Washington, DC) in Jan 2009", "Interview Descriptions": "Site manager took the interview for 15 mins", "Interview Questions": "none about PT skills"}]]