[
    [
        {
            "date": "23 Jun 2023",
            "title": "English Teacher Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I interviewed at British Council",
            "Interview Descriptions": "Process was straightforward and smooth. I had 2 interviewers. The interview was extremely organised. The questions were also mostly standard ones. The quality of our answers is what matters. Overall found the process to be transparent",
            "Interview Questions": "How would you handle a difficult class?"
        },
        {
            "date": "6 Jun 2023",
            "title": "Regional Manager Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Difficult Interview",
            "Application Type": "I interviewed at British Council",
            "Interview Descriptions": "Lasted about an hour. There are 3 panellists. Started with introductory questions to understand more about your motivation and application. This is followed by some behavioural and technical questions. In total, there are about 6 questions.",
            "Interview Questions": "Bring us through your application and tell us why you're motivated to join BC"
        },
        {
            "date": "28 Apr 2023",
            "title": "Asst Manager Interview",
            "results": "Declined Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at British Council (Singapore) in Mar 2023",
            "Interview Descriptions": "Full 1hour session. multiple questions on both hard and soft skills. A few panel people doing the interview. From personal thoughts to handling of situations. List of questions meant to sieve out individuals",
            "Interview Questions": "N/A"
        },
        {
            "date": "31 Jan 2023",
            "title": "SCME Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Difficult Interview",
            "Application Type": "I interviewed at British Council",
            "Interview Descriptions": "3 rounds, scenario questions. 5 to 6 questions. 3 interviewers. Phone, face to face. Project depending on role. Use pass working exp to answer. Modetately difficult and fast paced. 1 hour interview.",
            "Interview Questions": "describe yourself and work exp"
        },
        {
            "date": "19 May 2021",
            "title": "Teacher Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied online. I interviewed at British Council (Singapore) in May 2021",
            "Interview Descriptions": "Form Submission followed by Online Video Interview once shortlisted. 3 Friendly Interviewers and finished the online interview within 20 mins and proceeded to the next stage of an automated video interview submission.",
            "Interview Questions": "Tell us about Yourself. Share a challenge faced during your teaching experience. Describe your teaching style. "
        },
        {
            "date": "4 Jan 2021",
            "title": "Teacher Interview",
            "results": "Declined Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I interviewed at British Council",
            "Interview Descriptions": "Good - a little lengthy in the written application but very engaging face to face, Met with 2 staff members who were warms and detailed in their responses. Feedback came from the automated system so could have been more detailed",
            "Interview Questions": "Work Life balance of an unpredictable schedule "
        },
        {
            "date": "24 Sept 2020",
            "title": "Finance Manager Interview",
            "results": "No Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 1 day. I interviewed at British Council",
            "Interview Descriptions": "There are three stages to the interview process. Firstly, the selection by the recruiting agent, next a meeting with the hiring manager and lastly a panel interview with HR and hiring manager. I",
            "Interview Questions": "One of the concern was cultural adaptability."
        },
        {
            "date": "25 Apr 2022",
            "title": "Intern Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied through an employee referral. I interviewed at British Council (Singapore) in Jan 2020",
            "Interview Descriptions": "Quite normal. It was firstly going over CV. And then asking questions about yourself and why you would like to apply for the job and what are your experiences. People are very nice.",
            "Interview Questions": "Have you got experience in doing project "
        },
        {
            "date": "30 Oct 2017",
            "title": "English Teacher Interview",
            "results": "Accepted Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council",
            "Interview Descriptions": "I applied online and then called in for 30 minute interview face-to-face with 2 interviewers, the boss and assistant head. Asked questions about experience, skills, BC behaviours etc. I received a response 10 days later by email.",
            "Interview Questions": "Describe a skills lesson."
        },
        {
            "date": "11 Nov 2013",
            "title": "Business Development Manager Interview",
            "results": "No Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Difficult Interview",
            "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (Singapore) in Nov 2013",
            "Interview Descriptions": "Applied online and was tasked to work on a task to write a 500 word business plan to bring a brand new UK product/service into a new East Asian market. Waited 1 week before they came back with confirmation of a phone interview. Was interviewed on the phone by 3 key Directors (who are based in different countries). Questions asked were mainly based on current or past roles/ experiences.",
            "Interview Questions": "- Tell me some innovative sales promotions that you had done previously\r\n- In 3 bullet points, how are you capable of this position? \r\n- What are the challenges that you think you would face in this role? \r\n- Have you faced any challenges in your new territories/ markets and how do you overcome them? \r\n- KPIs- how are you currently measured against? \r\n- BC has a strict child safety policy- what are your views on it? "
        }
    ]
]