[[{"date": "4 Feb 2022", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montana State University", "Interview Descriptions": "The interview process was through a senior level class where company's came in and selected students to work on projects for them. It was much less of and interview than it was a class", "Interview Questions": "There were no interview questions"}, {"date": "24 Oct 2022", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Montana State University in Aug 2021", "Interview Descriptions": "After some emailing back and forth there was one interview which was fairly relaxed. Met with leadership and discussed different projects and how my skillset could apply to them. Then they gave me a tour of the facility and sent their formal offer a few days later.", "Interview Questions": "What coding languages I know"}, {"date": "18 Apr 2020", "title": "Front Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Montana State University (Bozeman, MT) in May 2019", "Interview Descriptions": "Standard interview, asked about customer service experiences, familiarity with phones/email communication. Asked about class schedule and scheduling in general. In person interview and phone call notifcation on deciding to hire.", "Interview Questions": "What is your schedule like?"}, {"date": "19 Mar 2019", "title": "Optical Engineer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Montana State University (Boston, MA) in Feb 2019", "Interview Descriptions": "Not very long but technically intense. A lot of technical details were asked to present. The Second interviewer was very unprofessional. Too many questions unrelated to the job. Feeling like a casual conversation other than a technical interview.", "Interview Questions": "Circuit design and optical system design"}, {"date": "30 Dec 2020", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montana State University (Bozeman, MT) in Nov 2018", "Interview Descriptions": "The interview asked many questions about situations I had been in and how I handled them. They also asked about my past experiences and how I learned from them. Asking what I could bring to a hall.", "Interview Questions": "What would you do if a resident was doing something you disagree with?"}, {"date": "28 Jul 2022", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Montana State University (Bozeman, MT) in May 2018", "Interview Descriptions": "best ever interview process I have ever had. The board was super helpful and enthusiastic and they even helped me to prepare for the interview beforehand. I would highly recommend working for them", "Interview Questions": "Best ever interview process you will ever face"}, {"date": "27 May 2018", "title": "Technical Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Montana State University (Bozeman, MT) in Apr 2018", "Interview Descriptions": "Applied online, received invitation for phone screen about a week later.  The screen consisted of four search committee members, each asking in turn a series of about three questions. It was my impression that the questions were prepared in advance and would be asked of all applicants who made it to the phone screen in order to ensure consistency. The questions were fair and of average difficulty, and attempted to gauge both the candidate's technical knowledge of IT topics and how s/he would handle hypothetical on-the-job situations.  About four days later, I was invited to visit the campus in Bozeman (traveling from Seattle) for an onsite interview.  Due to previous work commitments, the earliest I could visit was in about two weeks time, but they were willing to accommodate this.  The second interview consisted of the same search committee members with a similar round-robin question format. Again, it was cordial and respectful, and the questions were open-ended and fair.  The interview was followed by a less formal Q&A session during a team lunch, and concluded with an informative one-on-one meeting with the Associate Chief Information Officer / Chief Security Officer.  Two weeks later this same Associate CIO called me to express his regrets that I was not selected. While I was disappointed with the outcome, I appreciated this personal touch, and with how well MSU conducted the interview process.", "Interview Questions": "1. Explain the advantages and drawbacks of server virtualization?\r\n2. Describe a time when you were part of a team that did not achieve its goal.\r\n3. A user reports they can ping a Linux server by IP address but not by host name. How would you troubleshoot?"}, {"date": "8 Mar 2018", "title": "Special Collections Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Montana State University (Bozeman, MT) in Feb 2018", "Interview Descriptions": "I sat down with three library staff. I was asked three or four questions, including why I wanted to work there, what work experience I had, and what I hoped to gain from working in the library. Everyone was very friendly and it was a nice balance between informal and formal.", "Interview Questions": "What do you want to get out of working here?"}, {"date": "20 Jul 2017", "title": "Office Assistant - Computer Science Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Montana State University in May 2017", "Interview Descriptions": "I had applied online, on the student hiring website. I exchanged a few emails with the office manager towards the end of the semester. Then ed finally met up at the department, she showed me around the office and told me everything I'd be doing for the Job.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Feb 2017", "title": "Grounds Crew Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Montana State University (Bozeman, MT) in Jun 2016", "Interview Descriptions": "Supplied a resume, received a phone call within the day, approached for an interview and was offered the position immediately after being asked about how many hours I wanted to work.", "Interview Questions": "How many hours are you looking to work per week?"}], [{"date": "19 Sept 2018", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montana State University (Bozeman, MT) in Jan 2016", "Interview Descriptions": "A applied for a software developer inter position.\r\nScheduled in person meeting and discussed my experience.\r\nIn a week i got a response. Since this was a research position i applied for USP and independent credits as well.", "Interview Questions": "What coding projects have you done?"}, {"date": "8 Apr 2017", "title": "R A Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montana State University (Bozeman, MT) in Mar 2015", "Interview Descriptions": "There wasn't really an interview for this position, other than a casual conversation with the head of the department before he made research/teaching assistantship assignments. The conversation was fun, and I could tell immediately that I would enjoy the job.", "Interview Questions": "Why are you interested in MSU?"}, {"date": "15 Apr 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Montana State University (Bozeman, MT) in Mar 2015", "Interview Descriptions": "The process of resume and application package submission to interview to offer was lengthy but thorough.  Interview was and introductions open to faculty, staff and student body. Questions were applicable, friendly atmosphere.", "Interview Questions": "What event planning experience do you have?"}, {"date": "21 Aug 2019", "title": "Laboratory Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Montana State University (Bozeman, MT) in Feb 2015", "Interview Descriptions": "The interview process was great. I was really excited about the whole thing and they were very helpful with the whole process.  They made sure I was fully prepared for the undertaking and helped out whenever I needed.  Altogether, I would highly recommend to a friend.", "Interview Questions": "They asked all about my experience with teaching in the past as well as past research experience. They wanted to make sure that I was smart enough not to injure myself or others in the lab and they just really want to help out their employees."}, {"date": "18 Nov 2015", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Montana State University (Bozeman, MT) in Jan 2015", "Interview Descriptions": "The interview was quick and easy.  It consisted of applying online, showing up for the interview, and then a quick follow up interview.  The application was fairly straight forward wanting previous work history and education.  The first interview lasted about 45 minutes and was actually fairly informal.  The follow up interview was a little more personal and went more into my background.", "Interview Questions": "What type of research projects have you participated in?"}, {"date": "3 Dec 2016", "title": "Extension Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Montana State University (New York, NY) in Nov 2014", "Interview Descriptions": "Given a topic to develop a presentation. Gave my presentation and then went to general interview questions around the table of the interview panel. The panel was quite diverse.", "Interview Questions": "Basic things: How do you handle conflict? State a time where you overcame a conflict. "}, {"date": "8 Jun 2015", "title": "Administrative Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Montana State University (Bozeman, MT) in Jun 2014", "Interview Descriptions": "Sent application, resume, & answers to questions through online form.  Got a call for an interview within 1 week.  Interviewed in front of 3 people for about 20-30 minutes.", "Interview Questions": "Do you believe that your education, training and experience have prepared you for this position?  If so, please give us some specific examples that illustrate this."}, {"date": "9 Jun 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Montana State University (Bozeman, MT) in Jun 2014", "Interview Descriptions": "I submitted a written application, with a teaching statement and a cover letter. Since all of the reviewers already knew me, and the other applicants, the interview process was solely on the written application, and I was notified that I was successful. My letter covered my qualifications for teaching this particular class, my prior teaching experience, and my experience in developing curriculum, and working one-on-one with students.", "Interview Questions": "I was asked questions regarding my teaching philosophy."}, {"date": "17 Jan 2015", "title": "Administrative Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Montana State University (Bozeman, MT) in Jun 2013", "Interview Descriptions": "Cumbersome forms that require extensive answers to simple questions. Many staff positions are already filled and the reviewing process is a formality in order to comply with state hiring regulations.", "Interview Questions": "N/A"}, {"date": "30 Apr 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Montana State University", "Interview Descriptions": "I was contacted because I have used the option to allow ETS to disclose my preferences to potential university. I had to go through the usual application process, in addition to having an existing faculty write recommendations for me.", "Interview Questions": "I was asked to write a technical paper"}], [{"date": "31 Mar 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Montana State University (Bozeman, MT) in Mar 2013", "Interview Descriptions": "I talked to a professor through e-mail, asked him if he has any available position in his lab for an inexperienced undergrad.  A month later he talked to me after the class and said he can hire me for a project", "Interview Questions": "asked me if I have worked in a lab before"}, {"date": "27 May 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Montana State University (Bozeman, MT) in Aug 2012", "Interview Descriptions": "The interview was in person, with the search committee - four people. It lasted about an hour, and was a comfortable conversation. I had worked at MSU in a prior capacity, so I was familiar with the procedures and institutional protocols with which they were concerned. MSU tends to list extensive qualifications for very low paying jobs, which can make the interview and application process stressful.", "Interview Questions": "I was asked how I would handle challenging or aggressive students, and how I would handle multiple overlapping priorities."}, {"date": "25 Apr 2016", "title": "Videographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Montana State University (Bozeman, MT) in Jan 2012", "Interview Descriptions": "They asked thorough questions and made sure you know what you are doing. If you have a camera it's a huge plus and they will ask what you have edited with.", "Interview Questions": "Do you own a camera?"}, {"date": "28 May 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Montana State University (Great Falls, MT) in Aug 2011", "Interview Descriptions": "Submit resume. Was invited in for interview.  Was given a tour of the facility and met with other co-workers. Initial employment paperwork was filled out and keys issued.  Introduced to my office space and classroom that I would use. Provided training on the systems I would use and the materials that I would use. I was up and ready to teach in 2 weeks.", "Interview Questions": "How would I guide a student that was having problems"}, {"date": "24 Oct 2012", "title": "Student Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Montana State University (Bozeman, MT) in May 2011", "Interview Descriptions": "My resume was passed to the office I work for now through another office. I was called for an interview. I met with the highering authority and an employee I would be working with, if hired. It was a formal interview, but they were really nice and made me comfortable.", "Interview Questions": "There were not really any difficult questions. The questions were almost exclusively about my experience with different software, organization, and hiring. "}]]