[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Loved everything about ACTC", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 May 2021", "job_title": "Special Events Coordinator in Vancouver, BC", "duration": "N/A", "pros": "Leadership, teammates, product that you're selling, community", "cons": "NFP so lower budgets and pay"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good position!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jul 2023", "job_title": "Box Office Supervisor in Vancouver, BC", "duration": "N/A", "pros": "free tickets, big company, great experience", "cons": "low pay, low benefits, big responsibility"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Lack of Respect", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "30 Jun 2022", "job_title": "Office Assistant in Vancouver, BC", "duration": "N/A", "pros": "Lovely co-workers, if you have a lot of seniority - flexible schedule. Tickets to all the shows.", "cons": "The front-line staff aren't respected."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Not a very good place to be", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jun 2021", "job_title": "Manager in Vancouver, BC", "duration": "N/A", "pros": "The other employees are mostly kind to each other.", "cons": "My experience has mainly been observing the spin of narratives to support the personal preference of senior leadership rather than understanding the workforce and their underlying emotions, believes and experiences. Rather than preparing for the complexities, opinions, and value that a diverse workforce brings, the leadership defers a narrative based on their personal privileged experience and preference, which ultimately erases any company-wide morale or advocacy.\r\n\r\nThe culture of this organization is “be thankful you are in our presence,” which will be shoved down your throat, whether in a professional setting or even during a water cooler moment.\r\n\r\nMy advice to the co-leadership would be some initial course work on developing emotional intelligence, developing an understanding that power doesn’t equal leadership and perhaps a voluntary step down to then be mentored by a more experienced leader.\r\n\r\nIf you are looking for experience in any filed in this sector, I would do more research to find a company that is supportive rather than suppressive. A company that speaks through their actions rather than their “statement of actions” and doesn’t actively shame employees based on their differences."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The leadership team needs a full overhaul", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 May 2021", "job_title": "Arts Administrator in Vancouver, BC", "duration": "N/A", "pros": "There were some fantastic people who worked at the Arts Club. A lot of them no longer work there. You get free tickets to shows. The office is nice. If the senior leaders like you, your life is much easier and you have a fair amount of freedom.", "cons": "A lot of people in the senior leadership team NEED to move on - but especially the ED. If anyone in the Board of Directors is reading this, you need to do something about it now. This is a company that has exploited younger workers (especially young women and minorities) who are eager to get into the Arts industry and think that they might get pay bumps on a regular basis. Instead, they get paid a pittance for years and then told that they should be grateful for the minimal amount of salary received. The Executive Director has said many times that because he was able to live on $32,000/year in 2001, everyone should be happy with that amount now. I've also heard of managers pleading to be able to pay lower-level staff more and, again, the ED refusing flat out. This has meant that I heard from so many staff members who had to skip getting groceries because an unexpected bill suddenly arrived. And it's not like they're hiring all intern-level workers - these are incredibly skilled, hard-working people, many of whom were able to earn 50%-150% more just by moving to another company.\r\n\r\nNot only that but the benefits and perks of the job are essentially non-existent. There's no ability to work from home in regular times, only the minimum vacation required by law, leaving early is allowed but frowned upon even for legitimate reasons, and any expenses related to your personal growth as an employee are usually denied. The health benefits are fine at best. At least if they're going to pay people such below-market salaries, the benefits and perks should be WAY better.\r\n\r\nWhile I worked there, pretty much the entire lower level staff turned over completely every 1-2 years. No one ever really got promoted because the senior leaders have all been there for close to a decade or more, and the mid-level managers all stick around for 5-8 years. So no opportunities for growth within the company.\r\n\r\nThe culture around the theatre has also shifted completely. Once upon a time, we used to be able to talk about what went wrong with shows and joke about productions that we personally didn't like. Now, everything HAS to be positive, which means that many issues & potential areas to improve are swept under the rug.\r\n\r\nFinally, in the last year, the micromanagement and imposition of senior leadership into every aspect of the company has been unbearable. They need to learn that trust, encouragement and setting company-wide goals & metrics to work towards allow people to do their best work, not demanding last-minute Instagram videos with less than a day's notice."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great & Fun Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Nov 2020", "job_title": "Office Staff in Vancouver, BC", "duration": "N/A", "pros": "Very friendly and helpful staff, very fun environment to work for (especially if you love performing arts / theater)", "cons": "Nothing I can think of."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Mismanaged", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Dec 2017", "job_title": "Front of House Staff in Vancouver, BC", "duration": "N/A", "pros": "- Get to watch free shows", "cons": "- Upper management and other department heads make no effort in introducing themselves to other employees\r\n- There is no communication between departments, especially upper management\r\n- Actions by other departments get consent without consultation of other departments\r\n- Front of House department doesn't have resources that other theatre Front of House departments have, such as radios for communication between ushers\r\n- No room for advancement\r\n- No discount on shows"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great work environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 Dec 2017", "job_title": "Anonymous Employee in Vancouver, BC", "duration": "N/A", "pros": "I spent 6 years there. I moved up three times. It was like a family there. My manager was supportive. No micromanaging, I was able to get my work done on my own time. Have to have patience, good work ethic, and a passion for the arts.", "cons": "Along with a non-profit, comes challenges like lack of support, too much workload, and long hours. I had to leave due to office politics. Not great pay, but you can't really expect that."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Keep looking", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "27 May 2020", "job_title": "Accountant in Vancouver, BC", "duration": "N/A", "pros": "Interesting people and plays and staff", "cons": "weak management, disorganized work environment"}], []]