[[{"date": "30 Jun 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Aalto University", "Interview Descriptions": "The interview process is mostly asking about my past experiences, my understanding about the course I applied to be a teaching assistant and the salary expectation. The overall interview lasts for 20 minutes", "Interview Questions": "Have you been a teaching assistant before?"}, {"date": "8 Nov 2022", "title": "Master Thesis Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Aalto University in Mar 2022", "Interview Descriptions": "You need to take an Online interview and face to face interview. Then they will test how you work in the laboratory, your ability to work independently, and as a team", "Interview Questions": "What make you interested in the project"}, {"date": "13 Apr 2022", "title": "PhD program in Finance  Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Aalto University (Helsinki, Southern Finland) in Feb 2022", "Interview Descriptions": "3 weeks after deadline I had interview. The interview period was about one hour with the director PhD program in Finance and three other professors, they asked me several technical questions about finance", "Interview Questions": "There are routine questions about my interests and goal, additionally they askes me several technical questions about finance"}, {"date": "17 Nov 2021", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aalto University (Espoo)", "Interview Descriptions": "Good interview process and I had two rounds of interviews. The first one was held remotely and the second interview was held in face to face. Good experience ann basic interview for trainee position.", "Interview Questions": "Why did you apply for this position "}, {"date": "28 May 2021", "title": "Summer Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aalto University", "Interview Descriptions": "Easy application, quick and smooth interview process. Friendly discussion with the project leader. Presentation of former experience and questions about your future plans. Some relevant prior experience is a plus, also extra courses taken in the topic helps.", "Interview Questions": "Are you ready to dedicate your summer to work on this project?"}, {"date": "15 Apr 2021", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Aalto University", "Interview Descriptions": "Questions about interests and experince in research, problem identification, statistics and multivariate Optimization. Design thinking frameworks and their application and their evolution with time . Data driven decision making in design. Real time decision making.", "Interview Questions": "Intersection of math and design thinking in usability problem solving"}, {"date": "13 Mar 2021", "title": "Ph.D. Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aalto University", "Interview Descriptions": "You have at least two interviews, and one interview is more about yourself and one interview is more about your research. In general, the whole process is very friendly and professors are usually very nice.", "Interview Questions": "What is your research interest"}, {"date": "20 Jul 2020", "title": "Master Thesis Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Aalto University", "Interview Descriptions": "The position was posted on Aalto website. I applied for it and afterwards, there was only one interview and on the basis of that interview and other academic credentials final selection was done.", "Interview Questions": "What sort of position you are looking for?"}, {"date": "3 Apr 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Aalto University", "Interview Descriptions": "Very smooth and easy due to the high matching of my background and position, gave technical description to show the presentation skills and communication, also describing my studies to emphasis the relevance, it was friendly and my future boss informed me about university , project and recources fot the project", "Interview Questions": "describe your previous project, not so much technical, mostly communicational and then I received information on the future project"}, {"date": "15 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Aalto University (Espoo) in Mar 2019", "Interview Descriptions": "After sending out the CV and motivation letter, I received the email for interview. I think the process is usually flexible and not so formal, since on that day all professors who were hiring RAs were out. I did the interview for twice, one on skype and later meeting in person (not for two round, just separately).", "Interview Questions": "The reason you have interest in the position"}], [{"date": "4 Aug 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Aalto University (Helsinki, Southern Finland) in Apr 2018", "Interview Descriptions": "There was only one round of Interview. It was Easy and comforting. It lasted for 50 minutes. General questions were asked about study background and expectations from the position such as, where did you work before, what kind of industry, what did you learn, what are your future goals , etc.", "Interview Questions": "What do you like most about Finland? "}, {"date": "14 Apr 2017", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aalto University (Espoo)", "Interview Descriptions": "it was based on submitted application, i just had to communicate on emails, no formal interview. I first got the position as visiting researcher and after couple of months i was offered the full time position at the department.", "Interview Questions": "I did not had voice interview."}, {"date": "7 Mar 2017", "title": "Doctoral Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Aalto University", "Interview Descriptions": "Presentation of my master's thesis work infront of broad audience. One-to-one interview with professor with very few technically demanding questions - it was mostly description of my work and questions about their work.", "Interview Questions": "Why am i interested in this field? (i was changing my area of research)"}, {"date": "19 Apr 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Aalto University in Mar 2016", "Interview Descriptions": "Straight Forward...Discussion on my skill set...and project to be carried out. Courses that are taken in the university. My thesis goals.. Thesis topics that I have in mind...Past projects...Availability in Finland.", "Interview Questions": "What are your career goals?"}, {"date": "16 Sept 2015", "title": "Master's Thesis Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Aalto University (Espoo) in Apr 2015", "Interview Descriptions": "There was no real interview - I just went to talk to a professor about any master's thesis position opportunities. This is also an indication of how relaxed the environment is. The professor's project still had some budgeted funding left, funding provided by the National Innovation Funding Agency of Finland (Tekes). The professor apparently checked my grades in the University system, and reviewed my CV. He then decided based on our discussion that I was sharp enough for the research group.", "Interview Questions": "What are your interests related to this specific research setting (Electric Vehicles)"}, {"date": "22 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Aalto University (Espoo) in Apr 2015", "Interview Descriptions": "I contacted the teacher who leaded the research group to ask for any open position. I had an interview with him and a phd syudent who would have been my supervisor. We had a relaxed chat in which we discussed my studies and my interests (they had my cv, that I previously sent them). The also described me the project and the job. A few days after the interview I was contacted by e mail to agree on the starting day.", "Interview Questions": "Which programs can you use? Can you write in english?"}, {"date": "10 Sept 2019", "title": "Doctoral Candidate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Aalto University (Espoo) in Jan 2015", "Interview Descriptions": "Skype conversation or personal meeting, where your potential supervisor asks some questions about general knowledge of the topic. It was quite friendly and even though I did not reply some questions I got a positive feedback. It’s important to show your motivation and interest. Then the bureaucratic  process starts", "Interview Questions": "How small antennas work"}, {"date": "29 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Aalto University in Jan 2015", "Interview Descriptions": "One deatiled interview with the Professor, asking majorly about the technical skills and background knowledge and relevance to the research topic. The Professor told me the details of the research topic and analyzed from the discussion if it fascinates me or not. There was not technical test or so. My grades in Masters degree and relevance to the research area was convincing enough for him.", "Interview Questions": "How good are your programming skills"}, {"date": "7 Nov 2014", "title": "Doctoral Candidate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Aalto University", "Interview Descriptions": "Only a telephonic interview after I sent my CV and certificates. The interview was with the professor who would be my advisor later. He asked me some math puzzles and 1 or 2 technical questions. Also why doing a phd etc. It was overall very friendly.", "Interview Questions": "Regarding motivation to do a PhD"}, {"date": "21 Jul 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Aalto University (Espoo) in Feb 2014", "Interview Descriptions": "I applied for the AScI Internship program that offers the position of Research Assistant. The application included writing a motivation letter along with attaching your resume. Then there was CV based shortlisting followed by an interview on Skype. The results were declared within a month.", "Interview Questions": "The questions in my case were mostly pertaining from my area of interest - i.e. Machine Learning."}]]