[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent company and culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Apr 2023", "job_title": "Data Analyst in London, England", "duration": "N/A", "pros": "Excellent culture, high performing people, customer-centric approach", "cons": "Not many downsides - a very well-run operation"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Please do not waste your time", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 May 2023", "job_title": "Application Experience Advisor  in Bristol, England", "duration": "N/A", "pros": "Money and only money is the positive factor. You have to ask yourself if you’re willing to sacrifice your mental health for few extra £", "cons": "Not enough space to cover it all but basically you’re told you don’t meet targets and you’re not told what you’re doing wrong. You’re expected to self reflect without a single clue what you’re doing wrong. Constant battering with call after call with not a second to complete any possible development work before meetings and you’re being looked down at if you don’t and all the passive aggressive it’s disappointing and it’s worrying is just making you feel worthless and constantly worrying."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "High pressure, dictatorial management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Jun 2023", "job_title": "Manager in Bristol, England", "duration": "N/A", "pros": "Package is good - nice salary and bonus, pension contributions and healthcare good", "cons": "Dictatorship at the top, execs been there so long they simply rule the roost - lots of ‘talk’ about innovation and people focus but not evidenced in the ‘walk’."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Pretty decent", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jun 2023", "job_title": "Application Advisor in Bristol, England", "duration": "N/A", "pros": "Lovely friendly staff, look after employees", "cons": "Call grading, lots of reports makes it feel like school. Quite hard to hit call quality targets"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "An unpleasant experience with some positives", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Oct 2022", "job_title": "Business Analyst in London, England", "duration": "N/A", "pros": "At MO, managers make a show of superficially doing the right things. They will be noisy about diversity and inclusion, supportive during the pandemic etc. \r\nSalaries are fair\r\nOffices provide a pleasant working environment\r\nA lot of nice, talented people work there.\r\nThere is a genuine focus on delivering a good service for customers.", "cons": "The monopoly nature of the business has a lot of perverse effects on the culture. Notably, there is a layer of management who are drawing huge 6 figure salaries far beyond what they could get elsewhere. This means there is a static group of managers where no one leaves, In the time I was there not a single head of function departed the company. There is an unofficial a system of patronage, so those who manage up assiduously, drink the coolaid and replicate the \"strong culture\" tend to be the ones that are rewarded. As a consequence there is a layer of ambitious managers and team leaders with little regard for those lower on the totem pole than them. They will happily take credit for the work of subordinates but make sure blame finds its way to the bottom of the tree.\r\nThe lack of financial pressure in the business means incompetent managers can buy there way out of trouble, by bringing in expensive consultants and contractors to get them out of a jam. \r\nIt is only after moving to a new employer where managers are genuinely supportive and invested in your success, that you appreciate how corrosive this kind of place can be on your well-being."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Random", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 May 2023", "job_title": "CES (Customer Experience Specialist) in Edinburgh, Scotland", "duration": "N/A", "pros": "Salary is very generous. Culture is admirable training is extensive", "cons": "Strict quality monitoring with vague solutions to varied enquiries. No set way to do things but randomly scored out of 100 for each call often with no specific feedback."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "High expectations", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jun 2023", "job_title": "Customer Service Representative in Edinburgh, Scotland", "duration": "N/A", "pros": "Colleagues. Customers. Food. Hybrid. Salary.", "cons": "Mangers. No communication. Probation period is the most stressful 6 months of your life."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Wouldn’t recommend", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2023", "job_title": "Customer Experience Specialist in Bristol, England", "duration": "N/A", "pros": "Salary is good for a call centre role Nice clean bright office with a cafe that serves free barista coffee Recruitment team and Net training team who you deal with initially are super friendly and welcoming however you then don’t interact with them day to day Good office/home balance which is flexible and days can be changed if needed Internal vacancies seem to crop up a lot with opportunity to work elsewhere, however I imagine lots of people apply for these roles", "cons": "Recruitment process and initial training lures you into a false narrative of what the job involves. All seems extremely positive at the beginning however as soon as you’re on your team taking calls it quickly turns into a less pleasant/more stressful experience. My first con is as a customer experience specialist you’re dealing with complaints/customers complaining practically all day, however have very little scope or the tools to help which is frustrating for the customer and the staff member. You’re criticised and marked down on your call gradings for phoning third parties and going the extra mile to help, as this affects your stats, even though you’re told in training to use your own empowerment and do what’s best for the customer. You feel like you can’t win. If the customer wants to escalate their complaint there are then a couple of further teams you can raise them to which is a confusing process in itself, but the customer will have to wait a further day for a call back which frustrates them even more. I’ve never worked in ‘customer service’ where the ‘customer service advisor’ can’t just resolve it all on the first call- surely that’s the whole point of a customer service team? It feels unproductive passing the customer from pillar to post. Secondly the company preaches about how it’s supportive of mental health, however it seems to be that the job is actually the thing having a negative affect on people’s mental health. You’re run into the ground taking calls back to back and they’re even now potentially removing the natural wrap time so you’re immediately put back into a call. The managers don’t realise how mentally draining the calls can be and sometimes you need a minute to breathe and de-stress inbetween customers. The managers and coaches seem to try and morph you into some type of Motability Robot, sounding the same as everyone else. My manager compared me to someone who had worked there for years when I had worked there for one month saying ‘you should aim to be like ****’ which is an unhealthy approach and made me felt like I was being forced to sound differently on the phone, as I wanted to do what was expected of me to pass my probation. I’ve been pulled up on accidentally logging in 1 minute late or accidentally calling a customer by their first name, numerous other petty things but ultimately I’m only human. You’re made to feel like a child not treated as an adult. Not to mention someone I know of who had mental health related absence during probation so she was let go of. To summarise, MO doesn’t practice what it preaches in terms of mental health. There are a few other annoyances of the role, during probation being expected to listen into calls in your own time after work and unpaid. When you finish at 19:00 and on a Saturday not actually being able to log out until everyone is out of the queue and it’s closed off and a manager emails everyone (which can take up to 5 minutes every day and you don’t get the time back, but it all adds up). They’re quick to pull you up about coming back from your lunch 1 minute late but happily expect you to stay 3 minutes every late/Saturday after work until they close the phone lines. Having no time or phone code to read through emails during the working day, so you can miss important information but can’t do anything about that because you’re always expected to be taking calls."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good if your face fits.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "28 Mar 2023", "job_title": "Contact Center Agent in Bristol, England", "duration": "N/A", "pros": "Salary and benefits, some lovely people", "cons": "Targets, favouritism, managers and coaches not held to account for their mistakes"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work, happy environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Mar 2023", "job_title": "Customer Service in Bristol, England", "duration": "N/A", "pros": "Great recruitment process, thorough due to naturally wanting empathetic and caring individuals for this role, clear and informative throughout, really enjoyed the training and academy - although scared to deal with that first call, the support and guidance was second to none !!, the people are unbelievably friendly, I am really happy here !!", "cons": "the building heating can be on and off at times"}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Doesn't practice what it preaches, would not recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Mar 2023", "job_title": "Customer Experience Specialist in Bristol, England", "duration": "N/A", "pros": "*Good Pay for role type (Excellent yearly Bonuses if your face fits) *Good benefits package *Free Coffee Shop *Reduced Priced Canteen *Excellent initial training - with emphasis on Cognitive disability education and awareness * Lots of updates/communications or training regarding changes * Most Staff are friendly and welcoming", "cons": "* Lack of diversity within the contact centre in management/coaching roles. * The job is sold to you as a ‘one stop shop’ customer service role where you have your own empowerment to make decisions and help your customer. However, the role at present is moreso that of a complaints handler or a switchboard operator. You more often than not cannot solve the customers query at source because resources are not there to do so. This means some of the customers, who have been used to a very responsive quick solve to issues, become very quickly frustrated. These issues are prevalent due to changes in the worldwide car market and are out of Motability’s control. However, this means that staff need more support and means to help. Having empowerment can only go so far when you’re telling every customer ‘its out of our hands’ and ‘we can’t do anything here to help you with your query at present’. This is affecting many members of staff mental and physical wellbeing. * Call grading can be very confusing for some members of staff. You’re advised to use your empowerment, don’t be scripted, be yourself, use resources around you and keep a solid call structure and you’ll be fine. However, it’s not quite that simple and more often than not if you do everything asked to get a good grading, you’ve then gone above the call time targets. It’s a very precise recipe and a rhythm you have to find yourself but not an easy skill to grasp. The frustrating thing is…. If you get a sub par quality call… you’re not given direct feedback to work on regarding that, nor are you able to listen back to that call like you can other calls. There is not enough transparency to help those struggling and coaching sessions alone cannot help with this. This is a vast cause of anxiety with new starters. * 'Discretional' nature of management powers /behaviours give for a vast amount of inconsistency between supporting members of staff with welfare concerns. Some managers are incredibly empathetic and go above and beyond. Others, do not. This culture makes it feel difficult at times to approach your own manager if you have an issue. I know I personally did not feel comfortable doing so unless necessary. * Probation is a taboo word. No one will ever truly discuss it with you and its is a vast cause of anxiety for new starters as its such an ‘face fits’ system. It should not be treated in this nature. Sadly there is a large turn around of staff. Site security have openly commented on this. * Unfair probation system. To pass probation you are advised you must meet Key performance indicator targets (%) for call quality, statistics, absence etc and a ‘business decision’ is made. However, this is again discretional and if your face fits/your manager likes you you are passed. They advise that the whole picture is taken into consideration. However, this really does not seem to be the case. I know of many with sub par performance who were passed probation and others who were not. I know of those with excellent quality but slightly higher absence who have been failed and other passed. I equally know of someone with a low performance and a higher absence who was passed. To make matters even more inconsistent, there is sometimes just a call with your manager to advise of a pass or sometimes a meeting with a HR rep. Sometimes your review meeting is brought forward and sometimes it’s not. * Male recruitment manager for the role is lovely and personable during recruitment. However, once you have completed training comes across very unfriendly. He has personally ignored me communicating with him on two occasions. I know of other colleagues who’ve faced the same behaviour which is very out of place as the department is that of friendly personable people who all greet one another. * Lack of support to staff with Cognitive Disabilities. As a company they give their employees access to wellness apps, counselling helpline, an initial wellness passport, mental health allies and medical cover including an online digital GP. This is all amazing and can be really helpful for some. So, at its core there is a want to support staff and keep them well. However, from the perspective of an employee there is a lack of understanding from Contact centre management in how to support those within the workplace with conditions. Occupational Health referrals are often completed too late/not at all and there aren’t enough discussions regarding reasonable adjustment that a disabled employee is entitled to. There are of course some managers that are really supportive and lovely, but others that really don’t care less and view helping those with welfare concerns as ‘hand holding’ or reasons for them to have extra work to do. Sadly, I faced the latter who I felt really did not always listen or communicate well with me. I did not feel comfortable speaking with them or raising any concerns til it was too late and I needed to take some absence. I know of other colleagues who felt the same way and/or had less support than myself both in terms of adjustment or paid sickness. I see this as a huge con as Motability consider themselves a disability inclusive employer, but sadly don’t offer consistent help to their staff. As the job can be very draining at times this is something that sadly I saw affect many members of staff but they didn’t feel able to say at source with their managers out of fear it would come back against them in probation reviews, which sadly, does seems to be the case. * 6 day working week once per month. That week you only get 1 day off which is very draining. There is a half weekday rota’d in to this. However, you still work the weeks full hours to get that half day. This is not enough time to a member of staff to rest."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Steer clear", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 May 2023", "job_title": "Customer Service Representative in Edinburgh, Scotland", "duration": "N/A", "pros": "Good pay and potentially bonus", "cons": "False promises. Awful probation. Sink or swim"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great location and friendly people", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Apr 2023", "job_title": "Front Desk Agent in London, England", "duration": "N/A", "pros": "Good atmosphere, lots of training especially on disability awareness", "cons": "Lack of career progression available"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Apr 2023", "job_title": "Account Manager in Bristol, England", "duration": "N/A", "pros": "Love the team and feel very supported by our managers", "cons": "Quite a bit of change for the whole business which seems to be happening all at once"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Lovely environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Mar 2023", "job_title": "Customer Service Representative in Bristol, England", "duration": "N/A", "pros": "Friendly environment, excellent training and support, recruitment process thorough to get the right people!", "cons": "None so far ! Very happy"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Contact centre", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Feb 2023", "job_title": "Customer Experience Specialist in Edinburgh, Scotland", "duration": "N/A", "pros": "Good salary and benefit’s which are higher than most offer", "cons": "Full on and hard work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Feb 2023", "job_title": "Fincial Service in Bristol, England", "duration": "N/A", "pros": "Salary & Benefit's, Offices and great coffee shop.", "cons": "...... ....... ...... ....... .........."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great working culture & work/life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "30 Oct 2022", "job_title": "Senior IT Developer in London, England", "duration": "N/A", "pros": "- positive impact on society - if you do your job well, at the end of the day, it will make the disabled people's life easier - great opportunity to have a real impact on the company's direction: a lot of space for rootgrass initiatives & suggestions - great appreciation for diversity - supportive work culture - questions are always welcome, and more often than not there's enough time to answer other people's questions - management pays attention for people to not overwork", "cons": "None that I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Highly recommended", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Jan 2023", "job_title": "Finance operations assistant in London, England", "duration": "N/A", "pros": "Friendly and supportive management, with offer of study support and no binding contract attached to this extra support. Yearly bonuses are also offered.", "cons": "Sometimes can be a bit clicky in other teams."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great people", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Nov 2022", "job_title": "Debt Collector in London, England", "duration": "N/A", "pros": "Great culture, nicest people working there with a genuine passion for providing dignified mobility services to disabled people Great benefits Nice office in south bank", "cons": "Highly profitable business model but money is only spent back in customers so big bosses look good with the media, should provide better salary Not a lot of opportunities for growth unless you wait for someone to retire"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Jul 2022", "job_title": "Software Engineer in Bristol, England", "duration": "N/A", "pros": "- Diverse employees which results in working with great and enthusiastic people\r\n- Great benefits and ability to alter anything any time (Pension is amazing)\r\n- Very fast evolving company and is leading tech\r\n- Regular reviews - ability to know where and how you want to progress in your career and is acted upon\r\n- Flexible working, can work from home whenever you want/need to, one day a week is encouraged to be mandatory\r\n- Great atmosphere, everyone is friendly and you do not feel like just a number like bigger companies", "cons": "- Can't think of anything significant, apart from overpromoting inclusivity. It is a pro but there can be too much."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great place but no thank you, management make you cringe.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Jan 2022", "job_title": "Sales Executive in Bristol, England", "duration": "N/A", "pros": "The lunch restaurant isn't bad.\r\n\r\nThe direction is clear, make as much money as physically possible and at the end of the financial year, management will figure out how to offload it, either through donations to charity (such as £100M's to Motability) or investment in buildings that aren't required, anything except salaries for those working at lower level. Admin rolls pay well with is a pro but the rest, particularly Sales is rubbish pay when considering the revenue they generate.", "cons": "No real progression.\r\nMoney is poor unless you're senior, then it's great until Government find out what they pay themselves.\r\nVRM does not value it's customers (Motor dealers)\r\nManagement believe they are something special, it's cringeworthy, especially as some have no real experience outside of motab.\r\nClicky environment, you think people are your colleagues and friends but in reality, there is a toxicity which eventually everyone realises but initially it's not apparent."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good pay for the work you do", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "31 Oct 2022", "job_title": "Customer Relations Account Manager in London, England", "duration": "N/A", "pros": "Good pay, good team and very empowered to make decisions", "cons": "Can be complicated to navigate the processes"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "More cons than pros", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Feb 2022", "job_title": "Customer Service Representative in Bristol, England", "duration": "N/A", "pros": "- salary is average but sometimes it doesn't compensate for the number of calls/amount of stress you're put under \n- Once you pass probation you can set your shifts but it must be under the bridges discression\n- pension scheme\n- private health insurance", "cons": "- the role itself has become increasingly difficult over the last 2 years\n- micromanaged to the Nth degree by managers who have never gained exposure to other jobs \n- coaches are incompetent and don't know how to do the role \n- zero support if you request help\n- probation is a witch hunt to put as much pressure as possible\n- advertised as progression opportunities when actually they have someone for the role already and then your manager penalises you for trying to progress\n- you have to ask consent to apply for an internal role\n\n- over charging customers APs just to line the Executives pockets. \n- staff are made to feel like peasants like they don't deserve a bonus"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Mfldirect", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "20 Oct 2021", "job_title": "Sales in Bristol, England", "duration": "N/A", "pros": "The benefits are actually good such as the pension. The company makes a considerable amount of profit which they then try to offload every year due to pressure from the banks who are also nervous about the amount of money held, probably because it's tax payers money. Paying almost no tax thanks to a loophole helps, not bad for a company turning over more than £1b pa. Check out the daily mail and read about the CEO.", "cons": "The company claims to have strong values but they simply write and talk a good game. Behind the doors, it's a toxic environment, management are snakes and just recently, they've had yet another major cull of so called valued employees who were good and loyal but if you aren't a favorite, one way or another you are out."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Would not recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Sept 2022", "job_title": "Multi Skilled Case Manager in London, England", "duration": "N/A", "pros": "Some really genuine and grateful customers that make the tough days that much better", "cons": "No work life balance\r\nUnrealistic targets\r\nPay is not reflective of role \r\nNo support or training dealing with people of cognitive disorders (I.e. mental health issues) and varying disabilities - absolute disservice to their customers"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Probation is hard but more than worth it if you put the effort in", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Apr 2022", "job_title": "Contact Center Advisor in Bristol, England", "duration": "N/A", "pros": "Having experienced it myself and read all these reviews before and after starting my job PROBATION IS TOUGH but there is a reason for this, Motability pays very well but they want the right type of person. They keep people on who genuinely care about the customer and go beyond just taking a call. If you want to help people and are naturally kind and empathetic you will pass probation. If you fake the empathy to get through the calls you wont make probation as it will show. \r\n\r\n- Amazing training at start, and through out. \r\n- Monthly coaching sessions, EVERY MONTH, to work on what you think you need to improve, this is on YOU to put the effort in and say what you want to improve on. \r\n- If you ask for help you get it\r\n- If you care about helping people you have empowerment to make your own decision and these are not second guessed. \r\n- PAY is great and above any other call center \r\n- LOTS of flexibility to choose your own shift pattern. \r\n- Great BONUS if you work hard you get a better bonus. \r\n- Great benefits, you can flex up annual leave or down\r\n- Great health benefits \r\n- Friendly people and if you are genuine and work hard you are treated as such, if you want to do the bare minimum and get paid high then you wont make it. \r\n- Home & Office working flexibility\r\n\r\nLOTS OF THESE REVIEWS ARE NEGATIVE, these are mainly from the people that cant preform the to standard they have agreed to preform at. I have had a period where my performance dropped and i was not doing well i was given lots of support. From monthly coaching to weekly coaching and lots of feedback on calls. Celebrating good ones and discussing how to improve when I got bad ones. \r\n\r\nIF YOU WILL WORK HARD AND CARE ABOUT THE JOB YOU DO AND WANT TO HELP EVERYONE FROM THE CUTE AND THE NICE TO THE THE CALLERS THAT ARE GRUMPY OR MEAN TO YOU ECT. You will go far in Mo but if you only want to be nice and helpful on days you feel like it you WONT do well here. So be honest in the applications and interviews if you have to lie or twist the truth to get the job then you wont fit in and probably wont pass probation. \r\n\r\nI was told 3 times in probation if i don't improve i wont pass, but i worked harder and i passed. It is a great company to work for as long as you dont expect everything to be handed to you with no real effort on your part.\r\n\r\nThere is progression routes, but you have to work for it, and you may not get it the first time, but you just need to persevere and try again. Ask for feedback on why you didn't get the progression you get good feedback, which gives you something to work on ready for the next internal role that comes up.", "cons": "- Since covid the job has got tougher yes! but i think that's the same everywhere\r\n- Can be stressful but very rewarding. \r\n- calls can be tough but that's same in every job"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Do not work here if you are diverse", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Jun 2022", "job_title": "Human Resources Manager in London, England", "duration": "N/A", "pros": "Good holiday \r\nGood work life balance", "cons": "No diverse individuals\r\nNo career progression opportunities \r\nEveryone has worked there to long so if you don’t “fit” the mold you cannot survive \r\nNot willing to be challenged and improved very old mindset \r\nDespite their customers the most backward and racist place I have ever worked"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very poorly managed and stressful environment", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Mar 2022", "job_title": "Customer Service Agent in Edinburgh, Scotland", "duration": "N/A", "pros": "Pay is good, other advisors are really friendly and good benefits.", "cons": "The management of the Contact Centre are very inconsistant with eachother and this makes for a very uncomfortable environment. Ridiculous turn over in staff members due to stress and lack of support. Very difficult to feel settled or relaxed, even a year down the line in the role."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Well looked after", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Jul 2022", "job_title": "Office Administrator in London, England", "duration": "N/A", "pros": "Wages, benefits, location, offices, wfh", "cons": "Culture, management, money wasting, under qualified employees, lack of training"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 May 2022", "job_title": "Procurement in London, England", "duration": "N/A", "pros": "Fantastic work culture\r\nCompany cares about D&I, its end customers and investing in the right areas", "cons": "More diverse representation in senior roles required"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Aug 2022", "job_title": "Customer Service in Edinburgh, Scotland", "duration": "N/A", "pros": "Good pay grade for customer service", "cons": "Incredibly hard to pass probation"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 May 2022", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "Everyone is accommodative, people-oriented organization with lots of activities to promote community cohesion", "cons": "I can't think of anything so far"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Pay is great - everything else not so much.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Dec 2021", "job_title": "Contact Centre Advisor in Edinburgh, Scotland", "duration": "N/A", "pros": "I’ll start by saying that the pay is excellent for a call centre role - it’s probably the best out there. However, don’t be fooled by this. It’s not an easy job and there’s a number of reasons why.", "cons": "Firstly, I’d like to start on training. Training was excellent, 5 weeks of really in-depth training and our trainer, Lee was awesome. Couldn’t fault him. 5 weeks felt like a good amount of time to learn about the job and the tasks we would need to undertake. \r\n\r\nBut then comes probation. I don’t really know where to start. It really felt like you were thrown in the deep end. The most frustrating part is the ‘coaching’ that was provided. The coaches are designed to support and help you when all it ever made me feel was frustrated, angry and stupid. Be prepared for your coach to ask YOU questions, not the other way around. They will deflect any questions you ask them by asking YOU instead - “what do you think? How do you think it went? What could you have done?” My coach made me feel small, inadequate and there were a couple of times I cried because the type of questions asked were so vague I had to keep asking her to narrow the topic down , feeling like an idiot in doing so. Another girl in my team had this happen to her too. Also, there’s not much point in explaining yourself to your coach because they won’t like you standing up for yourself - so basically you’ve got to suck it up. \r\n\r\nBe prepared to be told that ‘you are responsible for your own training’. I’d take this with a pinch of salt. You could try, but if your face and personality doesn’t fit the Motability mould then you’re gonna have a difficult time getting through. \r\n\r\nThe last few weeks of my probation, I was told I’d be getting a lot of contact time between my coach and manager. That didn’t happen. As days went on, it was obvious they had already made a decision on my probation. Contact became less and less frequent. \r\n\r\nThey will only make you listen to your poor calls, average calls and never your very good or excellent. They won’t even tell you what you did in those calls that made it very good. They will however, happily dissect what you did wrong in a poor call. \r\n\r\nBe prepared to do a lot of work outside of office hours. If you really want to try and pass, your coach and managers will fully expect you to invest your own time to work on your performance. \r\n\r\nIt’s stats based. If you’re 0.2% under your target it’s not good enough and they will make you well aware of this. I got told I didn’t pass probation and was then told that my manager would be escorting me out of the building, in front of my team and fellow colleagues. I cannot tell you how humiliating this was, to pack my things, handover my laptop and lanyard for everyone to see. Because I knew this was coming, I took it fairly well but I cant imagine how I would have taken this had I been upset."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Nice but never again.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Feb 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Nice people to work with, best part of the job.", "cons": "No progression, money is too low for work expected. If your manager is problematic you kind of have to take it until you cnt take it anymore and leave. Management are very sneaky."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great business with strong potential.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Sept 2021", "job_title": "Advisor in Bristol, England", "duration": "N/A", "pros": "It's a secure business as they make a lot of money so you feel as though there is good job security. Benefits are amazing and they really try to ensure employees have a nice experience working for them. Offices are nice quality with nice canteens and parking. People are very friendly and have lots of regular events.", "cons": "Feel the culture is unfair and biased, relying on your face fitting and management liking you. Certain decisions are made to progress their favourites. Due to the majority of people having worked there for 10/15 years they are very set in their ways and not open to change. Feel as though I need to fit in in order to do well here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The best job I've ever had", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Oct 2021", "job_title": "Contact Centre Advisor in Bristol, England", "duration": "N/A", "pros": "Amazing recruitment experience - both in terms of the activities undertaken and the amazing recruitment team that put you at ease and keep you informed throughout the process. Sach and Leon have a relentlessly engaging energy and keep checking in on you once you are 'live' on the phones to make sure you are all settled in. They truly go above and beyond to make you feel welcome. \r\n\r\nTraining and communications team work tirelessly to run a robust and detailed training scheme. This has to be one of the most comprehensive development programmes I have ever seen. Not only do they equip you with all the tools to do the job, they then provide a supportive 'academy style' environment to get you warmed up on the phone. You have the opportunity to listen into experienced advisors and there's always someone to call on should you have a question. \r\n\r\nMO has adapted very well to pandemic challenges by removing PC's and providing everyone with laptops, providing flexible working opportunities and a fully hybrid method of working. Colleagues can work safe in the knowledge that their preferences and COVID concerns are addressed and true thought has gone into making sure everyone can enjoy working safely. Some may have reservations about working and learning over Zoom, but MO's support networks mean this process works seamlessly,\r\n\r\nManagement are approachable and welcome you like you've worked there for years. You are supported with regular coaching, reviews and catch up's to ensure you can achieve your potential. Feedback is direct, honest and without any mixed messages. People are genuinely supportive and want to help you to thrive. The work environment is fun and there are plenty of extra-curricular networking groups to get stuck into.\r\n\r\nOn site catering, facilities and parking are second to none. It makes all the difference knowing that you can come into the office of a morning and just get on with it without having to worry about where lunch is coming from, or where to park. It really is an effortless employment experience - and at the end of it all you can come home and put your feet up without worries of a poor work-life balance.\r\n\r\nYes, some people may say the calls are intense, or it's busy all the time, or expectations are high... and all of the above is true. And so it should be. MO is a market leading company which requires market leading staff. So if you can't stand the heat - you definitely need to get out of the kitchen! So if you're looking for a challenge to sink your teeth into; this is the role for you!", "cons": "The company has adapted their tech well to the needs of hybrid working; but there are some gaps. However, MO are on top of it and I've got every faith that the technology will continue to evolve with faster / more robust laptops and further customer innovations."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good company with opportunity for progression", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Feb 2022", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "People are on the whole friendly and inclusive. There is plenty of scope for progression and the pay and benefits are good too", "cons": "Sometimes a bit slow to respond to changes in the market"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Contact advisor", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Oct 2021", "job_title": "Customer Contact Advisor in Edinburgh, Scotland", "duration": "N/A", "pros": "The company has a good wage for a contact centre advisor, good health benefits as well as scheme memberships. Some management are fantastic such as Chris and Nat, who I cannot fault in terms of compassion and care ethic.", "cons": "Our group were put through a four stage interview. I could not fault Leon or sach who were amazing upbeat and offered lots of support and encouragement. We went into training with Lee who was also great although we felt this was rushed through no fault of his. After training we attended academy where we were put straight onto phones which as a group we felt we were not ready for. Our group was 10 people. Thereafter we were put into our teams. The team culture is very different where it feels one side of the room is friendly encouraging and helpful, the other side not so much. Very unsupportive and somewhat cult like. It very much felt on the other side if the face fits which is a let down to the good side. Management are varied and again if the office was sliced in half it was mean to say there was a good side and a bad side. I have to say team Dacia and Chris who manages the team is incredible. Very friendly down to earth and welcoming. Unfortunately this is not the case for every team. I also touch upon facilities. You are shown round by someone who appears very friendly however once you are out academy she will not even acknowledge you are there which is disappointing given your initial first impression. Out with the office the canteen staff and coffee takeaway staff are brilliant. If only this was the case in the later side of the office. You are made to feel like you have a false pretence to upkeep within your probation, where numerous people have actively said through conversation they feel anxious coming into the office as they are the new people and passing probation is notoriously hard, which again makes people feel uneasy. After having a good observation in the office and spending time there it feels very much in the Edinburgh office if the face fits within different teams which goes against the company values. I feel management should be looked at, although I for one cannot fault again Chris and Nat who are both exceptional people and actually care. I cannot say the same for the others where I have heard somewhat negative input. I really do hope as a company that Leon can address these issues and hopefully put a means to an end to this where it comes to new starts as this could be a fantastic company to work for if management in Edinburgh were managed properly."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Job review", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Jan 2022", "job_title": "Customer Service Representative in Edinburgh, Scotland", "duration": "N/A", "pros": "Good salary and benefits pension etc", "cons": "Very pressurised job with targets for call grading and handling time."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "CCA", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Feb 2022", "job_title": "CCA in Edinburgh, Scotland", "duration": "N/A", "pros": "Great pay, great environment, great benefits", "cons": "Can be challenging and busy"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Dec 2021", "job_title": "MI Analyst in Bristol, England", "duration": "N/A", "pros": "Good pension, nice bonus, nice culture", "cons": "Hard to progress and earn more"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 Dec 2021", "job_title": "Management Accountant in Bristol, England", "duration": "N/A", "pros": "Friendly environment and great team work", "cons": "Career prospects is hard to find"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good company to work for with a supportive ethos.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Aug 2021", "job_title": "Finance operations assistant in London, England", "duration": "N/A", "pros": "Well paid salaries.\r\nFlexible working hours and from home.\r\nStudy support", "cons": "Needs to be more support to admin staff looking to work their way up.\r\nThere is a bit of click culture, where certain groups get away with 'backstabbing' etc.."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Good company but", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Sept 2021", "job_title": "CCC Customer Service Representative in Edinburgh, Scotland", "duration": "N/A", "pros": "Great people\r\nGood staff \r\nAmazing customers.", "cons": "Probation\r\nStats\r\nCritical \r\nOwn development with no advice"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great compnay to work for if you work independently", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Aug 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Friendly\r\n\r\nManagement cares about you\r\n\r\nWork contributes to a good cause\r\n\r\nCompany cares about it's customers\r\n\r\nPay is competitive, if not slightly above", "cons": "If you arne't good at woprking independently, not the best.\r\n\r\nSometimes not a lot to do"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Sept 2021", "job_title": "Customer Service Advisor in Bristol, England", "duration": "N/A", "pros": "Management, customer focus, pay and benefits", "cons": "None great company and love working here"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Avoid - cult like environment lacking diveristy", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jun 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Good benefits package \r\nGenerally nice people \r\nGood working hours", "cons": "Not interested in diveristy despite client group \r\n\r\nLongevity meaning it’s impossible to “fit” in at a senior level as everyone has worked there for years. \r\n\r\nTo many decision managers \r\n\r\nMicromanagement and mixed messages."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Toxic environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Jan 2021", "job_title": "Business Analyst in London, England", "duration": "N/A", "pros": "Good benefits and pension\r\nA few good people around", "cons": "Technology and ways of working are at least 10 years behind compared to other companies\r\nTo pass your probation you have to be liked at a personal level rather than professional skills\r\nStrict smart dress code\r\nNo working from home/flexible working\r\nOutdated laptops\r\nPeople get promoted for number of years worked instead of their professional progression, so if you’ve worked in the company for 5+ years you do stand a chance regardless of your skill set and job title\r\nAs soon as you join you have to pick a “side” and make sure you’re always saying what your managers told you to say when senior management comes to visit\r\nToxic environment to work in"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Keep away", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jun 2021", "job_title": "Customer Advisior in Edinburgh, Scotland", "duration": "N/A", "pros": "Very good salary for call centre", "cons": "Very hard to pass probation! 12 of us in training only 2 passed probation! I was on time never off sick and gave 100% every calls! I also had great feedback from customers however I didn’t fit their mould!!"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Working at MO", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jul 2021", "job_title": "Service Desk Analyst in London, England", "duration": "N/A", "pros": "Good people, atmosphere , salary , location , benefits", "cons": "Hard to scale up and get noticed etc"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Overall a good company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Jul 2021", "job_title": "Pricing Analyst in London, England", "duration": "N/A", "pros": "Good culture and reasonable management", "cons": "No real upward movement opportunities"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jun 2021", "job_title": "Customer Relations Account Manager in London, England", "duration": "N/A", "pros": "Staff are really cared for, appreciated and values are at the core of the business", "cons": "High pressure and difficult customers"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Good place to work but could be improved", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Jun 2021", "job_title": "Analyst in Bristol, England", "duration": "N/A", "pros": "Good benefits available\r\nFriendly culture\r\nGreat office spaces", "cons": "Limited room for promotion \r\nNo training provided\r\nSenior management have favourites"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great company to work for at the start", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Jan 2021", "job_title": "Customer Service Advisor in Bristol, England", "duration": "N/A", "pros": "Good pay (however pay reflects the job load and mental strain) \r\nGenerally Only employee friendly people \r\nGood benefits- pension etc", "cons": "Poor management \r\nLack of support \r\nVery hard to progress in the company- especially in other sectors.\r\nThey say training will be given but this is minimal"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Toxic place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Mar 2021", "job_title": "Infrastructure Engineer in London, England", "duration": "N/A", "pros": "The cafe is the only Pro to work here", "cons": "Toxic Management, other reviewers have positive experiences but I can only contribute a review for the team I was in\r\nRedundancies, this is company with no competition whose customer responsibility never changes and yet they make people redundant"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good and Bad", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Feb 2021", "job_title": "Business Systems in London, England", "duration": "N/A", "pros": "Have supported their employees throughout Covid-19 ensuring wellbeing.", "cons": "If an employee escalates their line managers behaviour, nothing is done. The line manager is protected and they are allowed to continue with their high paid salary and do nothing for it, except bring down the team."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Apr 2021", "job_title": "Business Analyst in Bristol, England", "duration": "N/A", "pros": "Good people, fun work, supportive atmosphere", "cons": "Difficult to get promoted, people have been there for decades so opportunities don't come up very often"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "IT department run by general business managers.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Apr 2021", "job_title": "IT Support in London, England", "duration": "N/A", "pros": "Benefits package can be generous generous.", "cons": "IT department run by general business managers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "A", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Apr 2021", "job_title": "Sales Executive in Bristol, England", "duration": "N/A", "pros": "Amazing benefits, looked after, good hours, very nice colleagues", "cons": "No clear route for progress"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Working for Mo", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jan 2021", "job_title": "Customer Contact Agent in Edinburgh, Scotland", "duration": "N/A", "pros": "Good benefits and salary etc", "cons": "Extremely difficult to pass probation and expected to behave almost like a stepford wife"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Mar 2021", "job_title": "Customer Solutions Manager in London, England", "duration": "N/A", "pros": "Supportive culture and overall great employee to work for", "cons": "None that I can think of"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Probably good if you do not have a personality", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Sept 2016", "job_title": " in London, England", "duration": "N/A", "pros": "Good Salary\r\nGood Bonus (if you pass your probation)\r\nNice Offices\r\nThis company is probably good for young professionals with not a lot of experience and character as a first job. Do not expect much if you are a grown up with a strong background and a solid character.", "cons": "Old school and poor management, people here think that you need to be face to face with people to work and bond, and spend 30 hours per week in meetings to be useful.\r\nNon formal communication creating multiple threads of the same subject, rendering management of things difficult.\r\nMicro managing people seem to be the rule as teams seem unable to plan an work further than a week in advance.\r\nNo place for originality, you have to do as told, not as your experience tells you to do.\r\nAlmost impossible to be yourself if it is not aligned with their worshipped values.\r\nSpied upon 24/7, not creating the best atmosphere. Speak at your own risks.\r\nNo perspective of evolution as middle management is young."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Simply amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Feb 2021", "job_title": "Analyst in Bristol, England", "duration": "N/A", "pros": "Very focused on the customer, they look after the employees, flexible", "cons": "I’ve worked for MO for 4 years, no cons!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful company, sorry to leave", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Mar 2018", "job_title": " in London, England", "duration": "N/A", "pros": "This is a fantastic company to work for. \r\n\r\nThe key thing for me is the size ( approx. 800 employees) combined with significant revenue (£4.2bn), investing in what is effectively a single product to make the proposition truly world class.\r\n\r\nThe size of the business is such that you can get your arms around it and build relationships with all areas of the company; which helps foster a lovely working environment.\r\n\r\nThe revenue and profits are significant, but the company is restricted in its ability to expand into new markets. In practice this means that rather than make do with 'good enough', the company strives for perfection. We we work with the best technologies, we recruit the best people, we provide the best service etc.\r\n\r\nI've seen other comments on here suggesting that you can't get on if your 'face doesn't fit'. In my experience this is simply an unapologetic expectation for high standards.\r\n\r\nThis company isn't a household name, but don't let that put you off, I couldn't recommend it enough.", "cons": "Whilst things seem to be slowly changing in this respect, the company should offer a flexible working policy to ensure they continue to retain and attract the best people.\r\n\r\nNew suppliers (IT) are not performing and are dragging down moral in some areas. This is concerning if we are considering increasing their remit and involvement in other projects."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "A good company that will support you", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jan 2021", "job_title": "Customer Service Advisor in Bristol, England", "duration": "N/A", "pros": "Good Coaching. Salary and bonus structure.", "cons": "Very high expectancy of customer service"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Customer and Employees are the main focus", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Nov 2018", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "Great working atmosphere where everyone genuinely wants to do what is best for the customer and so it doesn't have a \"dog eat dog\" vibe.\r\n\r\nLots of employee empowerment at all levels which means rather than being process driven everyone makes decisions based on the right  behaviours which consider the customer, the company and the employee. \r\n\r\nSome amazing employee benefits which are always being adapted and added to. \r\n\r\nWonderful sense of community with annual company events where all employees get to keep their ear to ground of what's going on. All the directors and also our CEO will hold \"town hall\" meetings which are open and honest and are always willing to answer any employee's question. \r\n\r\nThere are really high standards which means the employment process is rigorous and the expectations are high - but if you have the right mind set and moral grounding you'll do well.\r\n\r\nOne of very few employers who insist on benchmarking salaries each year and taking cost of living into consideration.", "cons": "Location can be difficult at times due to Bristol office being located near UWE and traffic being bad during term times, but there is plenty of parking provided and there are great public transport connections."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Nov 2020", "job_title": "Software Developer in London, England", "duration": "N/A", "pros": "Good culture, well resourced and caring", "cons": "many layers of management but then it quite big."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "27 Apr 2018", "job_title": "Telephone Agent in Bristol, England", "duration": "N/A", "pros": "Location, salary, great employees, empowerment, healthcare, pension, bonus and supportive management. Good hours of work in a great office and canteen. Still love it after 10 years", "cons": "Parking was an issue but now much improved with lots of opportunities to give feedback which in my opinion has always been taken seriously. I am proud to work at Motability and I’m fed up of reading such distorted one sided reviews. I’ve never left reviews before but felt I had to say something."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company, supportive to staff and customers alike", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 Apr 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Excellent salary and benefits, very hard to earn similar sort of money in another organisation.  \r\nThe culture and ethos both for employees and customers is second to none.\r\nCustomers are treated as we would want to be treated -  with respect and consideration for individual needs and struggles.\r\n\r\nI genuinely don't agree with lots of the negative views on this site.  Yes, there are some customers who are challenging to manage but they are treated in the best way possible - by trying to put ourselves in their shoes!\r\n\r\nLike all businesses we do have to have standards and like ALL jobs their are targets to achieve of which (if you are in a customer facing environment) includes call monitoring.", "cons": "As its a relatively flat structure in terms of layers of management, progression can be difficult to achieve at times however, in my experience if you work hard and want to develop, there are opportunities."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "very conservative in every way and not the most exciting place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Feb 2015", "job_title": " in London, England", "duration": "N/A", "pros": "nice work space but too restrictive on the use (not even allowed to put stickies on walls for meetings)\r\neasy to get to location in london bridge\r\nthey supposedly value their people", "cons": "very conservative , most people still coming to work suited and booted\r\nits a close to civil service as you can get without the badge.\r\nthere are a few dinosaurs working here that add no value! basically ludites in IT, they could not survive for 30 seconds  in any other company so they stick around here\r\ntoo restrictive on how you use the office, down to not being allowed to put stickies on wall during sprit retrospectives!\r\nmanagement expect external consultants to to wave magic wand and fix everything! when they don't even have the correct staffing structure in their teams!\r\nThey are grossly under staffed and won't hire any more creating bottle necks.\r\nAs external consultant I was expected to manage 3 teams of 9-12 people and fix everything that was wrong \r\nas business with a complete monopoly (supposedly a charity) clearing a £million profit per day: they worry about money too much  \r\nthe work is very boring, basically if love oracle you will be ok, here don't expect to be pushing the envelope in any way"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "The world of fluff", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Jul 2017", "job_title": "Office Joe in Bristol, England", "duration": "N/A", "pros": "salary, benefits, holiday are good", "cons": "It sucks the life out of you. Working life is dominated by trying to please the coaching team who want an army of happy smiling clones that dont think for themselves.\r\nManagement want more and more from less & less staff\r\nThey only get outstanding customer service by giving a customer whatever they want without question even if it is deliberate abuse/misuse. They are too scared to say no to anyone.\r\nParking is a nightmare at the Bristol site\r\nAC is rubbish, typically cycles between unbearably hot & freezing cold several times a day\r\nNo job security, whole teams disappear because of a \"strategic review\" leading to more pressure on those that are left to deal with their tasks\r\nThe new Alfa IT system just installed is absolutely awful. So illogical & long winded to do even simple tasks\r\nThere is career progression if you are prepared to kiss a lot of ###, otherwise forget it"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fantastic place to work!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Mar 2017", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "- customer focused \n- pay, benefits and reward & recognition \n- environment and offices \n- treat everyone fairly\n- valued staff\n- support\n- performance related bonus \n\nI've worked at Motability Operations for nearly six years within the Customer Contact Centre and I can honestly say I don't think I'll ever leave! I have always been treated fairly and recognised for my hard work. The culture is second to none and they treat their staff very very well. I have worked in a few positions at Motability and I have loved every one. The people are fantastic and the salary reflects the hard work they quite rightly expect you to put in! I have always been supported by my seniors and colleagues a like. I would recommend Motability to anyone.", "cons": "- some off the cuff decisions, but if you speak up they are explained fully or rectified \n- communication could be better at times \n- parking (but they are trying everything they can to resolve) \n- traffic!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Stepford wives", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Aug 2017", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "Good canteen, nice offices, non management staff are nice.", "cons": "Fifty percent of customers abuse the scheme which MO are aware of but do not mind as it props up high salaries and Xmas bonus, frosty 95% female management, coaches want you to be a patronising clone to customers, mistakes in pay which you have to prove yourself, unreasonable standards, clique culture, staff find it difficult to be themselves be it on the phone or even having a laugh in canteen in case you say something that breaks the mould, had overheard managers and coaches making fun of past and existing employees behind their back, high staff turn over, awful parking."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work and develop your career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Nov 2018", "job_title": "Account Manager in London, England", "duration": "N/A", "pros": "In my opinion Motability Operations is a great place to work. The company offer a good benefits package and market leading pension contributions, as well as bench-marking salaries competitively to the wider market.\r\n\r\nAs an organisation it is highly customer focused with a culture of going above and beyond to provide first rate customer service.  I have always felt the company is well managed from the top down.\r\n\r\nThere are development opportunities available but I would stress that it is very much a company where you get out what you put in. You can't expect to be handed progression on a silver platter and you do have to fit with the company culture to move upwards.", "cons": "Relatively flat structure means that progression is sometimes slow. This does however ensure that as a general rule the right people move up within the company.  \r\n\r\nOther issues that come to light through annual staff engagement surveys are taken seriously and dealt with where possible - this year we have seen systems improvements, parking improvements and better management communication."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Lots of opportunities and support", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Nov 2016", "job_title": "DCS Advisor in Bristol, England", "duration": "N/A", "pros": "Best offices I've ever worked in love the soft seating areas for breaks, lots of fun in the department, reward and recognition for a job well done and plenty of opportunities for career development with the support to help you get there. You have to work hard but you get a great pay and benefits package in return and there are also secondments available which I've found a great way to try a job out and learn about other areas of the company before taking the plunge and moving jobs permanently.", "cons": "It's hard to avoid all the sweet treats on offer but fruit is usually available too if you can tap into your will power!\r\n\r\nTraffic is a nightmare in the mornings because of road closures (metro bus) and UWE but leaving a bit early and having a bacon butty in the canteen helps alleviate this!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Join this organisation if you have no desire to learn anything new.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Feb 2015", "job_title": "Software Developer in London, England", "duration": "N/A", "pros": "1. Good pension scheme\r\n2. Guaranteed bonus scheme. Same for performing and non-performing employees.\r\n3. Good business model. Monopoly in market. \r\n4. Stability of job if you keep your mouth shut.", "cons": "1. Quite inefficient in every sense. Management is old style. Company has monopoly in cars for disabled people market because of not having to pay VAT on car purchases and bulk buying. Charity nature (no one is making profit) and monopoly together makes this organisation very lethargic from top to bottom. Company meetings are more focused on how they securing finance for future 10 years and growth of 1%. Directors are worried about negative public opinion about the Motability scheme and try to keep low profile marketing. \r\n2. Technologies used are from 80s and there is no innovation in fast moving Information Technologies. Innovation is not much encouraged. Tens of millions were wasted in poorly planned Oracle projects. \r\n3. You can grow in this organisation based on your relations with higher ups than your skills.  \r\n4. Employees who raise concerns are looked down. \r\n5. Poor project management."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great role for great people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Oct 2019", "job_title": "Customer Service Associate in Bristol, England", "duration": "N/A", "pros": "Amazing benefits\r\nGreat environment\r\nJob satisfaction very rewarding.\r\nConstant opportunity to develop.\r\nThey will get the best out of those willing to put the work in\r\nStaff are fully empowered to make their own decisions and the comments about micro management are completely not true...only people unable to manage themselves would see an issue in how the management team operates.\r\nThe average service length is 4 years which is very high for this kind of work.\r\nThe pay is almost too high for what is such an enjoyable role.", "cons": "The only con would be that not everyone is cut out to do this job and that's okay.\r\nThe probation period is designed the way it is to ensure only best candidates stay. Anyone who forgets that probation is part of a recruitment process needs to take a close look at themselves and realise the issue is with them and not the company."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Head in the clouds", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Jan 2018", "job_title": "Team Manager in London, England", "duration": "N/A", "pros": "Pros are your team members and the support you give each other. It has to come from them as the management provide none", "cons": "Yes they put customers at the heart of what they do however, they forget about the staff, Constant mental abuse from customers with no back up from management, No real idea of how your staff feel or how to provide support. Losing good staff as they cannot see what is happening in front of their eyes. The management are so scared to stick up for whats right that they allow people who abuse the scheme to continue.\r\n\r\nConstant changing of departments, secretive to the point that its actually awful the way redundancies are withheld from staff. \r\n\r\nPay in London is terrible and needs to be addressed."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Avoid unless you want your soul destroyed", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 May 2018", "job_title": "Dealer Support in Bristol, England", "duration": "N/A", "pros": "Good benefits and pay is not too bad", "cons": "I've worked in many call centres before but this place is by far the worst. You have to have an average handling time of 400 seconds which is near impossible to do. Also they grade your calls which they nit pick like crazy. Lets just say no one has ever achieved 100% and if you get 65% that is considered good. For example if you said \"yeah that fine\" you would be marked down as you should have said \"yeah that's great\". Really petty stuff where you have to literally mind the exact words you use. You spend your whole day on a knife edge hoping for quick easy calls. Also coaching is rubbish as they expect you know what areas you want to work on rather than being told where they want you to improve. They also expect you to most of your own development in your own time and is frowned upon if you don't do any. Trust me this place will bleed you dry"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Dealer Contact Advisor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Jan 2018", "job_title": "Dealer Contact Advisor in Bristol, England", "duration": "N/A", "pros": "Good pay, and nice building", "cons": "Some managers have there favourites and are power hungry. I was getting on really we until I moved to a different team leader and knew before I joined her team(Sam) that I wouldn't be there much longer. Made it very difficult to speak your mind and also the coaching is a bit primary school- They like to make the calls fluffy and like you to add lots of sprinkles and speak in a high pitch voice.....rather than being yourself."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Excellent pay and benefits, average everything else", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Feb 2019", "job_title": "Customer Service in Bristol, England", "duration": "N/A", "pros": "- excellent pay and benefits package\r\n- nice offices\r\n- well organised - you have what you need to do the job\r\n- provide a good service to customers \r\n- company is very secure financially\r\n- some excellent managers", "cons": "- awful development system\r\n- few opportunities to learn\r\n- fewer opportunities to progress and not much variety to offer\r\n- repetitive, same every day\r\n- lack of flexibility, have to book time off in summer 18 months in advance.  No chance of long weekends during summer unless booked 18 months in advance \r\n- extreme monitoring - every minute of your day is monitored and every word you say has the potential to be scrutinised to the extreme\r\n- some really poor managers \r\n- traffic in the area around the offices can be horrendous at times, lots of congestion"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Courage needed to separate the wheat from the chaff", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jun 2014", "job_title": "Manager in London, England", "duration": "N/A", "pros": "- Significant investment on refurbishing offices in London and Bristol all top spec and high spec computers\r\n- High wages\r\n- Generous benefits\r\n- Great bonus scheme\r\n- Guaranteed payrise even for bad performers\r\n- Friendly staff and good mix from all backgrounds\r\n- Good Christmas party where you can also bring partners\r\n- Fantastic food on Bristol campus, ok in London\r\n- Graduates get treated like royalty\r\n- Total accessibility and acceptance for those with physical disabilities\r\n- If you hang around long enough and keep your head down you'll be promoted", "cons": "- Tenure (aka inability to find another job) is a key decider for promotions and therefore many bad decisions made by people in roles too senior for their abilities\r\n- Does not appreciate innovation and good staff leave frequently\r\n- Culture is for employees to conform and not challenge - this is part of performance review\r\n- Many shock dismissals which are perceived as very heavy handed\r\n- Culture of idleness by many areas of the business\r\n- No understanding of mental health concerns, complete mishandling of staff who have such issues\r\n- Reactionary and outdated processes such as no working from home (friendly, flexible and facilitating...yeah right), no flexi-time etc.\r\n- No clear strategy or vision, tasks are day by day even with protests from staff who can *see* the implications for this poorly thought out approach\r\n- Multiple tasks performed across different areas of the business with no clear ownership and in-fighting between departments\r\n- Multiple suppliers with no ownership or cost efficiencies\r\n- Disgraceful wastage of money\r\n- Lack of communication between the charity and Motability Operations lead to frequent changes to direction and recreation of work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "It's what you make of it, mostly!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Nov 2016", "job_title": " in London, England", "duration": "N/A", "pros": "Pay and package are beyond competitive (for a comparable role elsewhere) and the buildings are both modern and tasteful. Working hours are reasonable and you get a generous about of lunch/break time each day. There is definitely room for career development, if you're willing to be what the company wants you to be.", "cons": "Office politics, you need to 'fit the mould' to really expect to progress and a lot of unnecessary secrecy amongst management. I like my colleagues, but trusting their motives is another thing altogether. Other critical reviews do raise valid points, although they haven't necessarily affected me in my time in the business."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "London - the management team really needs to wake up", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Sept 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great benefits and pay\r\nGreat location and office", "cons": "Poor, inexperienced, secretive, close-minded management\r\n\r\n- out of date approach to managing people\r\n- you're told you can speak up, but if you do it gets thrown back at you and not taken on board\r\n- very quick to make assessments of those further down the hierarchy\r\n- management are constantly in secret meetings, but have zero discretion. they let their favourite members of the team know what's going on which leads to a never ending cycle of rumours and speculation\r\n- promotions seem to be given to those who brown nose and make friends with the right people over merit (especially true in the London office - candidates with poor customer skills and poor people skills, but close with decision makers get chosen over those with the better qualifications and experience for the role)\r\n\r\n\r\nUnderstaffed\r\n\r\n- teams seem to get smaller and smaller, but workload only ever increases\r\n- team members are always off sick with stress (and management are surprised by this and have no tools or insight on how to manage team members with mental health issues)\r\n- constant revolving door of staff due to poor training, support and management\r\n- a culture survey is taken each year and if the results are negative then a restructure happens and people are made redundant (probably to rid themselves of anyone with an opinion)\r\n\r\n\r\nSevere lack of foresight\r\n\r\n- decisions are always made reactively and poorly carried out\r\n- too reliant on stats over a more human approach\r\n\r\n\r\nCult-like atmosphere\r\n\r\n- your personality gets picked apart in 121s and by coaches\r\n- perception is everything at this place - leads to people walking around in a manic-like state with fake smiles, yet apologising for everything they say or do\r\n\r\n\r\nPoor training\r\n\r\n- you get told that there's tons of support, but it only helps if you fit the mould\r\n- the 'trinity model' used here doesn't work for everyone and if it doesn't work for you the management/coaches/training staff are clueless in how to help you develop\r\n\r\n\r\nLack of opportunity\r\n\r\n- flat, stale structure - everyone is always on some kind of secondment which means no one ever feels secure in their role"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Mar 2017", "job_title": "Call Centre Advisor in Bristol, England", "duration": "N/A", "pros": "Great pay, caring management, amazing benefits, great offices, good training and support and very customer focused. \r\nWe are empowered to go the extra mile and we really make a difference to our customers. I have been with the company just over 18 months and have just had a £3,500 pay increase via a process called CPD. It was amazing, I didn't have to apply, I just did my job and my manager put me forward for it!", "cons": "The traffic can be a pain sometimes and it's always busy but I like that as it makes the time go quick."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Controlling cult like atmosphere", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Aug 2019", "job_title": "Customer Service Representative in Bristol, England", "duration": "N/A", "pros": "Salary and benefits but remember if it looks too good to be true it probably is", "cons": "Employees seem micro managed at every level with the feeling that you're being constantly watched and judged... ( See 'Coaches' below) \nPeople working here were seen behaving like 'Stepford wives'... The whole process was quite deeply unnerving. \nWorst of all, the managers not upfront about the 6 month probation process. This is a brutal pass or fail which they seem to conveniently fudge over.  However, one scenario group exercise, which was judged as part of the recruitment, involved 'sacking' someone who was having some personal issues along with mixed reviews of their performance. There was no option given to extend their probation so the only option was sacking them. If this is how new employees are judged during probation then that's a bullet well and truly dodged!\nEmployees micro managed at every moment of the day amd performance managed  by given a strike during probation for being a few minutes late to work or being a couple of minutes late back off their break.\nThere are people termed 'Coaches' who monitor your every working minute. They wield all the power and seem to be looking to fault rather than coach or mentor.\nI was strongly left with the feeling that this is the kind of place where if your face doesn't fit or you ask too many difficult questions or have any personality at all you're gone! \nOne Coach I witnessed was really unfriendly and had obviously got out of bed on the wrong side that day... \nApplicants are made to jump through many hoops to get up to this stage. MO are still advertising weeks after the assessment day... So obviously despite offering what appears to be a good salary, potential recruits are either being too harshly assessed or MO have set impossibly high expectations.  \nThe average length of time anyone stays at MO is just over 4 years which speaks for itself.\n Motabiltly Ops  are recruiting  for 40 positions however I firmly believe that the true number of posts expected to remain after month 6 will be much less and that a large proportion of those taken on will be got rid of during the probation process or 'managed out' leaving around 20 or fewer in my opinion.\nThis was by far the most unnerving aasessement process I have experienced. \nThe worst thing is that on the surface everyone seems really 'nicey nicey' and the benefits seem amazing. \nSadly, as with many things if it looks too good to be true it probably is!"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Honest review from recent Graduate", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 May 2019", "job_title": "Analyst in London, England", "duration": "N/A", "pros": "- Good pension and benefits\r\n- Average salary \r\n- Close colleagues are an absolute pleasure to work with\r\n- Good bonus scheme (although dependant on companies performance)\r\n- Excellent CEO which despite the bad press and would be a major loss to the company once he leaves", "cons": "- The biggest and most important is that there is a VERY flat structure which makes progression in this company pretty much impossible\r\n- The work is repetitive and tedious and you will platue in terms of learning within a couple of weeks of starting, they basically want robot's that won't question any of the old and pointless processes and just do as they're told.\r\n- Not a place for creativity, you will be allowed to express your ideas but that's about it\r\n- 20 years behind the rest of the world when it comes to technology, culture and just mentality overall. Only recently scrapped formal dresscode and introduced working from home(Although only senior managers take advantage of this as people further down the pyramid are way too reluctant to ask for WFH access as it's seen as something only for the elite).\r\n- Also a very outdated and toxic way of working, laptops are also only for the elite, they like you to always stick to your pod so you can be micromanaged with ease\r\n- Hold their centuries old \"Culture\" and \"Values\" very close to them and if you don't allign to it, expect a \"catch-up\" from out of nowhere in which you'd be told to pack your bags and leave straight away"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A fantastic company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Dec 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Supportive, approachable senior management team -  there are always projects and new initiatives to work on which keeps you interested and challenged.  Flexibility has improved beyond recognition which means I don’t feel guilty about being a working parent, helping me maintain that crucial balance between work and family. The CEO is inspirational, and the true definition of a leader who wins hearts and minds.", "cons": "Limited opportunities at senior levels."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Cookie Cutter Employees required", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Apr 2016", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "Good money & benefits, nice physical office environment", "cons": "Call Centre Management require you to submit to a strict employee 'role model' - no room for any individual personalities or differences to their 'ideal' employee.  Be very aware that approx 40-50% of  new starters fail probation & are 'let go' due to not being able to bend to the will of the management.... only those with a 'fluid' approach to their core personality/integrity will succeed....  At Motability you need to Fake it to Make It !"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Lethargic, profligate and dictatorial", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 May 2015", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- decent pay and benefits\r\n- good pension scheme\r\n- nice buildings\r\n- customer focussed", "cons": "- Arrogant, overpaid and dictatorial management team\r\n- Massively risk averse and hence alow moving\r\n- No understanding or appreciation of technology by the management team\r\n- System architecture in a mess\r\n- Speak up at your peril\r\n- Fill out the annual engagement survey with too scores or get sacked\r\n- Management by fear\r\n- too much profit so lets spend millions and millions on building refits"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "This is a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Dec 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The culture of the organisation, and all those in it, is unique.  I've never worked for a company which has customers at the heart of everything it does.  Employees come a very close second.  I feel valued, respected and supported and I have authority to make decisions.", "cons": "The location!  I'm based in Central London so the commute makes it a long day."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "A great company to work for.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Mar 2020", "job_title": "Change Manager in London, England", "duration": "N/A", "pros": "An average salary but 27 days holiday, 15% non contributory pension and up to 15% bonus.\n\nMost of the people are fantastic and it is a real can do culture.", "cons": "A flat structure leaving it difficult  to get promoted unless you are one of the chosen ones who get fast tracked.\n\nThere was also a cult of the HOFs who never leave because of their enormous salaries."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A satisfying and educational time of my career was spent at Motability Operations", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Aug 2012", "job_title": "Account Manager in London, England", "duration": "N/A", "pros": "Very professional and customer focused business with a passion to deliver exceptional customer service and employ only very dedicated people.", "cons": "A reasonably small company with little room for upwards progression due to the low turnover of staff.  Can also have a culture of 'who you know' rather than what you know."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Caste system implemented with no fairness or consistency of policy for all", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 May 2016", "job_title": "Specialist in London, England", "duration": "N/A", "pros": "1st year is exciting, interesting projects, people are nice, very nice offices and canteen is amazing", "cons": "It all goes downhill when you actually get to know the company. You realise there is no progression plan for you, noone cares about your performance or achievements and noone thinks about your career or potential. There is zero training available and zero clarity what is your career path in the first 5 years or after. There are few chosen ones - directors and hofs that enjoy brilliant pay and perks, the rest just suffer. If you are ambitious person, you like clarity, clear progression plan and challenging and reward career, avoid this place like the plague."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Contact centre hell", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Jan 2017", "job_title": "Customer Service Advisor in Bristol, England", "duration": "N/A", "pros": "Pay and benefits\r\nMajority of staff lovely and great team atmosphere\r\nNice offices", "cons": "Have to fit into the mould\r\nUnrealistic targets and support poor (management don't really care. If you don't meet the grade your quickly out of there, regardless of length of duty)\r\nFake environment and clique\r\nAs pay and benefits are good, staff feel trapped to stay."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Sugar-coated training period, then the reality hits", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Oct 2018", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "Good money. There's a lot of cash to splash around, a lot of office treats, anniversary party paid for by the company.", "cons": "When you come into the call centre after you've wasted 6 weeks in a training room, you're basically left in a sink or swim situation. You have to endure a lot of stress to get through your probation period."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A FANTASTIC place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Nov 2016", "job_title": "DCS Advisor in Bristol, England", "duration": "N/A", "pros": "People, environment, hours, offices, culture - don't believe all that you read on here.  Motability Operations is a fantastic place to work.  Great people, supportive culture, development opportunities with an open and honest management team.  I've worked here just under a year and its the best company I have ever worked for.  You have to work hard but you get rewarded for your efforts.", "cons": "Traffic busy around the business park because of the UWE,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Mar 2017", "job_title": "DCS Advisor in Bristol, England", "duration": "N/A", "pros": "Good pay\r\nGreat bonus\r\nGreat hours\r\nLovely people\r\nGood modern and well looked after offices", "cons": "I cant think of any"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Customer Focus with a strong culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Apr 2017", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "- Amazing Culture\r\n- Good Remunerations\r\n- Supportive\r\n- Lovely environment to work in\r\n-Good Staff restaurant\r\n- Strong on customer, putting them at the heart of what we do", "cons": "- Parking\r\n- Distance from amenities"}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Avoid Avoid Avoid", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Oct 2019", "job_title": "Call Center Representative in Bristol, England", "duration": "N/A", "pros": "Some lovely people met , Good Salary", "cons": "I strongly recommend avoiding this company like the plague !! Probation is not as it seems , your monitored your whole working day and pulled in a little side room like a child for saying one wrong word !! During my time at MO I witnessed 6 people from my training group escorted out of the building for not living up to there ridiculous standards !!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "No personality allowed.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Oct 2016", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "-Good salary\r\n-Nice building\r\n-Nice canteen\r\n-Good benifits", "cons": "Working hard and doing all work eagerly is not appreciated. They want to mould your personality- they are unsure of what it is they want you to be like. Very indecisive management. Concentrating on making you personality-less rather than developing your skill set."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing company to work for!!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Dec 2018", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "The management is second to none and they really care about their employees. It’s such a lovely place to work and that can’t be said and truly meant about many places these days. The CEO, Mike Betts, has done a tremendous job over the years and completely turned the business around.", "cons": "I have no complaints at all"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Cannot praise enough", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Jan 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Excellent environment to work in \r\nFriendly people \r\nManagement are always receptive to change & ideas \r\nSalaries are fair, benefits are excellent \r\nAs long as you perform well, you can be sure you will have a job", "cons": "Sometimes change can be slow"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Good and bad", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Apr 2016", "job_title": "Accountant in London, England", "duration": "N/A", "pros": "Good pension and bonus (rare combination)\r\nRelatively well paid, a monopoly so not impacted by recessions\r\nNice offices\r\nI managed to progress internally to manager level", "cons": "Senior management team hasn't changed in a decade so stale\r\nExecutives are paid crazy fat cat money for what is essentially a monopoly funded by DWP\r\nCheck out Daily Mail articles on pay at Motability Operations"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fabulous culture with top class service to customers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Mar 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Empowering and approachable leadership\r\n\r\nForward thinking and customer focused \r\n\r\nEnjoyable place to work with solid values and opportunities to progress", "cons": "Recent press coverage full of inaccuracies can lower morale"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "28 May 2019", "job_title": "Customer Contact Centre in Bristol, England", "duration": "N/A", "pros": "Pay \r\nJob satisfaction\r\nBenefits \r\nDon’t think about the role outside of your hours \r\nCustomer service is the best from any company I have used\r\nTruly care about customer journey", "cons": "Inflexible with shift / hours\r\nHave to book summer peak holiday 18 months in advance.  \r\nNo one rule for everyone, contact centre seems harsher."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Don’t believe what you read in the press", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Dec 2018", "job_title": "Customer Service in London, England", "duration": "N/A", "pros": "Great company, goes over and above for its customers. Performance driven but recognises employees who strive to do their best and work hard. Culture is tough business with a human heart! Don’t believe the rubbish written in the Daily Mail!", "cons": "Central London office means long commute"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Tedious and robotic", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jan 2018", "job_title": "Customer Service in Bristol, England", "duration": "N/A", "pros": "really good salary\r\nsome great work socials\r\nawesome Christmas party", "cons": "This place makes you think you're able to be your own person but when you walk through the call centre you realise that they really want youth be a robot, with all their staff sounding exactly alike... and the only way to describe that sound is 'fake'"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Not The Most InsP", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 May 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Good salary,  generous bonuses and nice office facilities in  both Bristol & London.", "cons": "Old fashioned/out of touch in their approach and management style. Many senior execs & managers have been there a long time Not a hugely energising place to work and certainly not as good an employer on the CV as it used to be but"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Stale", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Immediate colleagues were a pleasure to work with.\r\nLots of responsibilities given", "cons": "Poor direct management\r\nManagers are terrified of senior management to the point they won't question orders from them, yet will insist on you always directly questioning them."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great customer focused company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "3 Jul 2017", "job_title": "Account Manager in London, England", "duration": "N/A", "pros": "Great benefits (e.g. pension, medical aid, cycle to work, etc), above average salary and holidays,", "cons": "Some positions have few chances of progression, some repetition."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "nothing amazing revealed", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "25 May 2009", "job_title": "Account Manager in City of London, England", "duration": "N/A", "pros": "helping clients is very fulfilling", "cons": "not having enough time to do anything, no work life balance really"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jul 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Fabulous offices, decent salary, great benefits and a really nice bunch of people to work with", "cons": "Very flat structure means career opportunities are limited"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A positive, secure place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Sept 2018", "job_title": "Analyst in Bristol, England", "duration": "N/A", "pros": "A  good team.\r\nHelpful people\r\nStable business model\r\nGenerous packages\r\nA great and compelling vision around service to the clients", "cons": "Can be a bit silo'd with Departments competing"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Corporate machine", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jun 2017", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "Reasonable wage\r\nGood transport links nearby", "cons": "Extreme culture - 'do not break the mould' attitude\r\nPower-hungry management \r\nFaux-friendly brainwashed environment\r\nHoliday never available"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent supportive company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Nov 2019", "job_title": "CCA in Bristol, England", "duration": "N/A", "pros": "* Friendly and welcoming \r\n* Honest and open communication\r\n* Supportive, great working conditions \r\n* Great salary and benefits package", "cons": "* The job is challenging and does not suit everyone"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Lovely company, horrible team members", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Jan 2020", "job_title": "Customer Account Advisor in Southwark, England", "duration": "N/A", "pros": "Great company and benefits\r\nLovely manager \r\nAnnual leave \r\nGreat location\r\nLovely office", "cons": "I had awful people in my team"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Just don't", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Jan 2017", "job_title": "Customer Service Advisor in London, England", "duration": "N/A", "pros": "The office has nice central London location, very near to Borough Market. Besides this I can think of no other positives.", "cons": "Lack of career progression, constant monitoring (your toilet breaks are timed), and a culture of bullying is rife. If it were possible give this review less than a star, I would."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Very good company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2019", "job_title": "Service Centre Analyst in London, England", "duration": "N/A", "pros": "Excellent staff care, great environment and genuinely good people.", "cons": "I will get back to you when I think of one."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An amazing company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Aug 2019", "job_title": "QA Analyst in London, England", "duration": "N/A", "pros": "Exciting projects, career progression  a lot of amazing people to work with", "cons": "In my roughly 3 years there, I had no cons"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "MO Review", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Nov 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great culture\r\nForward thinking business\r\nSupportive employee base", "cons": "I have to commute in."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "A well oiled machine which should change somewhat", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Feb 2020", "job_title": "Consolidated Resorts in London, England", "duration": "N/A", "pros": "Unbelievably good pension - 15% non-contributory", "cons": "Management getting too comfortable with their roles and not being pushed to enact changes."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Positive experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Dec 2019", "job_title": "CSA", "duration": "N/A", "pros": "Good benefits \r\nCan do work ethic \r\nCustomer focused \r\nPositive environment", "cons": "Lack of opportunities is certain areas"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Oct 2020", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Amazing great lovely perfect and beautiful", "cons": "Difficult manager but not the end of the world"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great caring company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Aug 2020", "job_title": "Customer Service Advisor in Bristol, England", "duration": "N/A", "pros": "Lovely staff \r\nWonderful values \r\nGood salary and benefits package", "cons": "No cons at the moment"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Company, Awful Job", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Jun 2020", "job_title": "Contact Center Advisor in Bristol, England", "duration": "N/A", "pros": "People, Salary and the Company Ethics", "cons": "Repetitive, Emotionally draining Little progression."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Company review", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Feb 2020", "job_title": "Career Coach in Bristol, England", "duration": "N/A", "pros": "customer satisfaction at the heart of all operations", "cons": "Flexibility is in need of an update"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Excellent", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jun 2020", "job_title": "Customer Service Advisor in Bristol, England", "duration": "N/A", "pros": "Look after employees, great pay, excellent culture", "cons": "There are currently no cons"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Friendly", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Nov 2019", "job_title": "Customer Service Representative in Bristol, England", "duration": "N/A", "pros": "Friendly, supportive culture\r\nCustomer focussed", "cons": "Contact centre\r\nCan be extremely busy"}]]