[[{"date": "4 Jun 2023", "title": "Customer Service Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Denver, CO)", "Interview Descriptions": "While I didn’t get the job it was the most direct, transparent, and kind interview experience. They were open with the timing, next steps, and feedback often offering this information without being asked.", "Interview Questions": "What are your interests in this position? Can you give examples when you faced a dilemma and how you handled that?"}, {"date": "8 Apr 2023", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Hospital Colorado", "Interview Descriptions": "Two interviews in total. First was a basic screening phone call and instrumentation was discussed. The second had typical interview questions (tell me about yourself, describe a situation when you had a conflict, etc.)", "Interview Questions": "Describe a situation you faced conflict and how you fixed it"}, {"date": "14 May 2023", "title": "Senior CRC Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado in Apr 2023", "Interview Descriptions": "Quick, but red flags during third interview with manager and supervisor snickering about staff conflicts within their department. Incredibly unprofessional and HUGE red flag. Interview with coordinators, physician/researcher , and then four other people.", "Interview Questions": "N/A"}, {"date": "15 Apr 2023", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Colorado (Denver, CO) in Mar 2023", "Interview Descriptions": "This was a very inclusive, friendly, and open minded. I placed my application on a Thursday night, and I got a call back Friday morning, not even 12 hour wait time! I am from TN, and they were very flexible in setting up an interview and seemed very eager. The interview itself was straightforward. They provided a welcoming atmosphere and answered all my questions. I was comfortable the entire time.", "Interview Questions": "Describe your resume (work history) How have you handled a work related obstacle Why Children's"}, {"date": "16 Mar 2023", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado in Feb 2023", "Interview Descriptions": "Interview was standard and I received an offer. Onboarding experience was the worst I have ever encountered. Due to a communication error with the drug screening clinic approved by Children’s, my screening was marked as a refusal and my offer was rescinded. HR acknowledged that this communication error had happened to other prospective employees and they they planned to contact the company directly due to this. My offer to complete a new screening same-day to alleviate “suspicion” was still rejected. I was then informed that this was due to a Children’s Hospital policy that was not outlined in the onboarding information nor expressed verbally to me at any time. The onboarding recruiter continually stated that was “not her job” to give me this information, in spite of this policy clearly being very imperative to the hiring process. Outreach attempts to my prospective manager were also ignored even though I had been told to reach out with questions or concerns. I am still pretty dumbfounded by this entire situation. Hopefully an addendum is made to the onboarding forms to avoid this in the future. Regardless of what the clinics are telling people, policies specific to Children’s that could impact the hiring process should be included in their onboarding material.", "Interview Questions": "How would you compare the way a child interacts with the world to the way you interact in your working environment?"}, {"date": "22 Mar 2023", "title": "REVENUE INTEGRITY (RI) CHARGE CAPTURE AUDITOR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Feb 2023", "Interview Descriptions": "Had a 30 minute video interview, followed by a panel of 6 a month later. I emailed the hiring manager multiple times and no response. Extremity unprofessional and not a reputable company apparently", "Interview Questions": "How would you encounter a different physician?"}, {"date": "9 Dec 2022", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Colorado", "Interview Descriptions": "initial phone/zoom interview; next step was a panel interview with 6 people in the department and one admin from a similar one; fairly long time from submitting application to getting contacted. Nice folks", "Interview Questions": "what does EDI mean to me?"}, {"date": "5 Mar 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Dec 2022", "Interview Descriptions": "Probably the worst interview process I’ve ever been a part of. The lack of communication was ridiculous. The process took about three months.\r\n\r\nThe first step was a one on one virtual interview with the hiring manager. Then a virtual panel interview with multiple members of the team. Finally, the third step was a virtual panel interview with the department leadership.\r\n\r\nAfter that, I was basically ignored and ghosted. I would reach out multiple times via email to check up on the status and only get a half response every now and then. Eventually, the hiring manager just stopped responding altogether. The entire experience felt very unprofessional.", "Interview Questions": "How would your past experience help contribute to this role?"}, {"date": "8 Nov 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "The interview was terrible. My interviewer rolled her eyes at me on video as soon as the interview started and it made the entire interview awkward. It was clear that she did not want to interview me from the start. It seems like a good place but there is a lack of professionalism and respect.", "Interview Questions": "N/A"}, {"date": "26 Oct 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "1st interview went well with the hiring manager. 2nd was a panel interview with 4 employees that they seemed unprepared for. Very basic questions and a lot of fumbling for who was asking a question thatvthey seemedcto think of on the spot. Ghosted after the 2nd interview. Very unprofessional.", "Interview Questions": "What PM software have you used?"}], [{"date": "10 Aug 2022", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Denver, CO) in Aug 2022", "Interview Descriptions": "Interviewer asked really good behavioral questions that applied well to the position and previous experience. He understood and applied unrelated experience to the current position I was interviewing for. He also did a wonderful job of explaining the positions and roles that come with it.", "Interview Questions": "What was a conflict you had with a coworker and how did you resolve it?"}, {"date": "29 Aug 2022", "title": "Child Life Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Colorado in Aug 2022", "Interview Descriptions": "I met with two child life specialists and had a nice conversation with stimulating questions! It was a positive interviewing experience, and I felt that it was conducted very professionally.", "Interview Questions": "To you, what is the importance of play in a medical setting?"}, {"date": "21 Jul 2022", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Denver, CO)", "Interview Descriptions": "The interview was completed over Zoom, but remained very relaxed and decent interview. Lots of people interviewing me, but each person made me feel relaxed and know a bit about themselves too.", "Interview Questions": "Describe a time where you had to work in a team environment and there was conflict? How did you handle this?"}, {"date": "25 May 2022", "title": "Registered Nurse Outpatient Psychiatry Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado in May 2022", "Interview Descriptions": "I applied in early May and I was contacted within a week to set up an interview for the position. \r\nThe whole interview process took about a month and I got an offer in late May. \r\n\r\n\r\n1 informal interview just with the manager through zoom. Another interview with medical director (psychiatrist), manager, and one employee. \r\n\r\nFirst interview, you get to learn more about the position and what the job entails. Had the opportunity to ask questions regarding the job. \r\n\r\nThe second one, was definitely more formal. They got had the chance to know me and get to learn about my experience.", "Interview Questions": "Tell me about yourself \r\n\r\nWhat kind of challenges do you see as coming to an outpatient clinic? \r\n\r\nTell me about a time you disagreed with a coworker and how did you handle the situation? \r\n\r\nWhy do you want to transition from inpatient setting to outpatient setting?"}, {"date": "1 Jul 2022", "title": "Laboratory Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado in Apr 2022", "Interview Descriptions": "I had one phone interview and one in-person interview. The process was well explained by the hiring manager and I had no trouble accessing the phone interview or the in person interview. HR was very helpful and the onboarding process was the most seamless I can remember having at any time in my career. It was a great 1st impression.", "Interview Questions": "Questions about experience, technical questions, and usual questions regarding strengths, weaknesses, how you’ve handled adversity in the workplace. Etc."}, {"date": "2 Jul 2022", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Colorado in Apr 2022", "Interview Descriptions": "I applied online in mid March, shortly after the New Grad Residency application opened. I heard back mid April to schedule an interview for late April. I had what felt like a positive interview with 2 different units, with a panel of 4 people. Shortly after my interview, I heard back from one of the units that I was not selected. I did not hear anything back from the other unit. 2 weeks after my interview, I heard back from the recruiter informing me that while I wasn't selected for either of the units I interviewed for, the unit leadership spoke highly of me and felt I would still be a great fit for the organization. The recruiter told me \"we are working to find placements for our candidates we know will be a great fit\". I was told to expect to hear back by a very specific time and date, but did not. After waiting for nearly another 2 weeks and repeated attempts to contact someone, I received a generic rejection email. The entire process took 2 months. I felt that they were disrespectful of my time and showed poor communication and follow through.", "Interview Questions": "Your patient has been prescribed Benadryl. The medication has been ordered appropriately by the physician, verified through pharmacy and you have gone through the rights of medication administration. The parent then says “that medication is not the medication my child received yesterday” what would you do and why?"}, {"date": "10 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Colorado", "Interview Descriptions": "The interview was online via zoom with 4 other candidates. There were 3 Children's Hospital employees interviewing and each candidate got the chance to answer different questions. Overall a pleasant experience.", "Interview Questions": "What makes a good team?"}, {"date": "27 May 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Aurora, CO) in Mar 2022", "Interview Descriptions": "The interview process was very unprofessional. People did not show up to my interview and I was left in the dark for much of the process. After completing three rounds of interviews, I was ignored for weeks only to get rejected", "Interview Questions": "They asked for relevant experience, statistics skills, what my strengths and weaknesses are, etc."}, {"date": "5 Jan 2022", "title": "Patient Family Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Hospital Colorado (New York, NY) in Nov 2021", "Interview Descriptions": "I applied mid October and was contacted mid November to interview. I was offered the position about a week after my interview. I officially started mid Decber and it's 3 weeks of training/shadowing before I can work on my own.", "Interview Questions": "Have you been a part of a team that was successful? and why was it successful?"}, {"date": "14 Aug 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Colorado", "Interview Descriptions": "Very smooth process and excellent communication between supervisor and HR department. Opportunity to meet people across the department and team members were very willing to answer questions about upcoming challenges.", "Interview Questions": "I was asked for an example of a work challenge I encountered and how I managed it."}], [{"date": "4 May 2021", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Denver, CO) in Apr 2021", "Interview Descriptions": "Very Streamlined interview process. Very friendly and knowledgeable employees conducting interviews via phone/zoom due to COVID. Enjoyed the overall process. They were direct and to the point with the role available and the growth available in the role as well.", "Interview Questions": "Inquired about previous work experience "}, {"date": "27 Jan 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's Hospital Colorado in Mar 2021", "Interview Descriptions": "Went very well. Get to meet many of the current employees and teammates that you will be working with. It is enough time to ask all the questions you need to", "Interview Questions": "How do you work in a team environment?"}, {"date": "7 Apr 2021", "title": "Social Media Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Denver, CO) in Feb 2021", "Interview Descriptions": "I was eager to apply and network for a chance to interview at Children's. My background aligned with the role. I spoke to a marketing rep and head of PR on a video chat and it went very well. They loved my examples and were enthusiastic. I sent them samples of my work, I didn't get feedback. I was ghosted after a followup. I was very disappointed by the unprofessional behavior from who I thought were professional.", "Interview Questions": "How did you handle a difficult online interaction?"}, {"date": "26 Sept 2020", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Aurora, CO) in Sept 2020", "Interview Descriptions": "The interview process took approximately a month. You will interview with three people via Zoom. The overall interview will last approximately 30 minutes. It took a week to hear back from CHCO, after the interview.", "Interview Questions": "Describe great customer service. Tell me about yourself. "}, {"date": "10 Aug 2020", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Colorado Springs, CO) in Aug 2020", "Interview Descriptions": "Applied for a NICU RN position online. Scheduled interview with hiring manager about a week later. The interview was a small panel of 3 people, all behavioral questions. Then I submitted my references, and received an offer about 3 days after that!", "Interview Questions": "Tell us about a time when you cared for a patient of a different culture"}, {"date": "26 Jul 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Colorado Springs, CO) in Jul 2020", "Interview Descriptions": "Interview process was as expected. Due to COVID, was done through a video service on the web. Questions about my experience in the role, specific scenarios that might occur in the hospital, and just general questions.", "Interview Questions": "What is a common misconception people have about you? "}, {"date": "25 Jun 2020", "title": "NICU New Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Children's Hospital Colorado (Colorado Springs, CO) in Jun 2020", "Interview Descriptions": "interviewed on a Tuesday. Was a small panel of 3 people. Asked multiple personality style questions and one scenario based question at the end. Then was given a written exam with multiple scenario based essay questions.", "Interview Questions": "Give us an example of a time a coworker made a mistake that you witnessed"}, {"date": "6 Mar 2020", "title": "Business Intelligence Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 weeks. I interviewed at Children's Hospital Colorado (New York, NY) in Feb 2020", "Interview Descriptions": "30 minute phone call, 50 minute video interview, 1 hour in person interview and a 3 hour proctored assessment and they cant even be bothered to send a \"sorry we went with another candidate\" email.  I sent two follow up emails a week apart with no response to each. Extremely unprofessional.", "Interview Questions": "what's your biggest fear?"}, {"date": "2 Mar 2020", "title": "Interpreter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Feb 2020", "Interview Descriptions": "Very friendly, welcoming. I was brought in to have my work observed in live situations. I did a little of every department, then at the end a debrief with the supervisor.", "Interview Questions": "Most difficult interpretation encounter. "}], [{"date": "16 Dec 2019", "title": "Registered Nurse NICU Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado in Sept 2019", "Interview Descriptions": "I was asked mostly situational/behavioral questions, what I would do in certain situations and describing my past experiences. There were about 10 panel questions, and then there was a written quiz portion afterwards.", "Interview Questions": "Tell me about a time you had to deal with a difficult patient. "}, {"date": "8 Aug 2019", "title": "MT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's Hospital Colorado (Denver, CO)", "Interview Descriptions": "I applied online through their website.  It took two different submissions because their HR department had several people working on my application.  There was a background check and two rounds of interviews with different groups of management. The process took about two weeks and even after acceptance, there is mandatory orientation you must attend before you can officially start.  They only have certain days for orientation, so it may delay when you can start.", "Interview Questions": "How would you solve a dispute between you and another employee?"}, {"date": "2 Jul 2019", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado (Denver, CO) in Jun 2019", "Interview Descriptions": "Found the job opening in October, could not apply till march, I applied, waited 3 months, granted interview, sent references.  Interviewed with panel of 4.  Then had a written short answer test.", "Interview Questions": "explain what you would do if you accidentally gave the wrong medication through an IV."}, {"date": "9 Aug 2019", "title": "New Graduate Nurse Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Children's Hospital Colorado in Jun 2019", "Interview Descriptions": "Applied online in March and was offered an interview late May/early June. I had an in person interview in late June and was informed of their decision a week and a half later.  There was a written case study type test after the interview.", "Interview Questions": "Tell us about a time you made a mistake and how you fixed it. "}, {"date": "9 Jul 2019", "title": "Mental Health Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jun 2019", "Interview Descriptions": "I had applied online for this position, but did not receive a call to set up an interview until about 1 month later. I was out of the country and so I missed the call but called them back a few times in the following 2 weeks, and I did not receive a return call until 2 weeks after that to set up the interview. The interview was set up for the following week. When I went in, I was interviewed by two ladies who had a list of questions that they made notes on. The questions were fairly simple and common interview questions. The interview lasted about 30 minutes and it seemed like that was the only interview that was required for this position. I was told that they would let me know in a week what they decided, but it has been exactly 2 weeks and I have not heard back... Not sure if they haven't decided yet, or if they do not contact people who did not get the job. Overall, the process has been pretty long but not too difficult, and the interview was pleasant.", "Interview Questions": "Why did you choose to apply at Children's Hospital Colorado?"}, {"date": "23 Apr 2019", "title": "Administrative Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "30 minute phone screen with the hiring manager. At the end of the conversation, I was invited to the hospital for an in-person interview a week later.  The in-person interview took about 2 hours and consisted of 3 groups of 2-4 people, including the hiring manager/director, some physicians and the other administrative professionals I'd be working with on the team. The hiring manager called me a week later to tell me I was the top candidate, but they needed to check references first.  HR sent me an email, and I filled the information out.  After those were completed, one of the recruiters called to formally offer me the job.", "Interview Questions": "What is your experience with calendar management?"}, {"date": "29 Jan 2020", "title": "Health Navigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Children's Hospital Colorado in Apr 2019", "Interview Descriptions": "Questions were fairly typical and not too challenging. The interviewer was walking to her next meeting while talking to me and it seemed like she had not read my resume. It felt like she wasn't very interested in me as an applicant, which is fine, but extremely off-putting to notice mid-interview (the first sign was when told me she only had 10 minutes to chat).", "Interview Questions": "Tell us about yourself?  "}, {"date": "9 May 2019", "title": "New Grad Registered Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jan 2019", "Interview Descriptions": "Submitted all parts of the application online and last minute in the Fall (October maybe), in-person  interview the end of January, informed of decision in February via phone and an email followed a few weeks later.  I interviewed for a mental health RN residency position.", "Interview Questions": "Given 4-6 patients and needs, etc - how would you approach/who would you see first ... yet ANYTHING pediatric is on the table, not just related to unit you are being interviewed for"}, {"date": "5 Nov 2018", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Oct 2018", "Interview Descriptions": "I applied in September and I didn't get any response until October from one of the supervisors that emailed me to set up an in-person interview, not an HR person. I was interviewed by the Lab Manager, another supervisor, and two lead techs. The interview was engaging as they were very responsive and gave feedback to my answers to their questions. The whole interview in itself was pleasant. They told me that it would be two weeks when they decided to make their decision since they were still interviewing others. The interview I thought went well and after the interview, one of the techs showed me around the lab. Before I left, the manager handed me her business card. I followed up the next day. Two weeks pass by followed up again and no email or notification letting me know that they went with another candidate. At least have some decency as a business to let that candidate know they didn't get the position. Even a generic email will do. It's not that difficult.", "Interview Questions": "What brought you to Children's Hospital Colorado?"}, {"date": "13 Apr 2022", "title": "Information Security Compliance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jul 2018", "Interview Descriptions": "After passing resume pre-screening there was an initial telephone screening that was followed by an in person interview with the potential new manager and two colleagues in attendance and asking questions.", "Interview Questions": "How do you go about changing risky user behavior?"}], [{"date": "22 Apr 2022", "title": "RN Surgical / Operating Room Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Denver, CO) in Jul 2018", "Interview Descriptions": "Lasted almost three hours. Multiple nurses present for first encounter. Asked questions about what other hospitals offered me jobs, why I did not look for jobs at certain hospitals, Very high school cool lunch table mentality with little work culture substance. ", "Interview Questions": "Asked questions about what other hospitals offered me jobs, why I did not look for jobs at certain hospitals, Very few situational questions. More interested in my family environment."}, {"date": "4 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado (Colorado Springs, CO) in May 2018", "Interview Descriptions": "Overall it was a three step process. Initial phone screen then speaking with the hiring manager and then coming in for “shadowing”. Hiring process took about 1.5 months total. HR was good about letting me know where in the process we were. Typical interview questions including patient scenarios , background experience , safety stories etc.", "Interview Questions": "Tell me about a time you had a conflict with a coworker and how was it resolved? "}, {"date": "29 Jan 2018", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jan 2018", "Interview Descriptions": "It was a panel interview with roughly 10 questions followed by an exam. The entire interview lasted approximately 1.5 hours including the time it took to the answer the scenario based exam questions.", "Interview Questions": "Why peds? Why Children's Hospital Colorado? "}, {"date": "23 Apr 2022", "title": "Inpatient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jan 2018", "Interview Descriptions": "Was very smooth and asked you question to see if you are a good fit culturally. Having the right staff is very important to them so make sure to let your personality show through!", "Interview Questions": "Tell me about a time you Delt with conflict at work."}, {"date": "8 Jun 2018", "title": "Speech-Language Pathologist- CF Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Dec 2017", "Interview Descriptions": "I received a phone call about 3 weeks after submitting an online application. We had a brief conversation and scheduled an interview. \n\nThe interview itself was a positive experience. I attempted to contact one of my interviewers, as I was encouraged to do, to ask about the status of my application, but never received a response. About 6 months after the day of my interview, I received an email from Talent Acquisition telling me that I would not be offered the job.", "Interview Questions": "Many scenario-based questions, such as what AAC options would you consider for someone with CVI and limited use of their hands?"}, {"date": "6 Dec 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Colorado in Oct 2017", "Interview Descriptions": "I completed an online application and was contacted within 1-2 weeks by the recruiter via e-mail. After a week I was then prompted by e-mail that I would be receiving an update by the hiring manager if I had been selected for an interview. A few days later I was e-mailed by the hiring manager I would interview with them. Within a week I had a phone interview lasting around 20 minutes with questions like \"Describe a time you had an issue with a co-worker, how did you solve it..etc\". Most other questions were squarely based around willingness to work varying hours and different shifts, what my schedule was like, and if I needed accommodations to perform my job. A week later I was asked if I would be willing to complete a second phone interview with a technician staff member. The technician asked specifically more about my comfort around in-patient and pediatric settings and technical capabilities like sterile compounding (USP 797) and hazardous material compounding (USP 800). After the second interview I was asked if I could come in for a formal interview with a few Pharmacists and to take a competency test. After a light and fairly informal interview, centered mostly around personality and face-to-face communication, and completion of the test, I was informed that I would be notified if I received the position by the end of the week. 23 hours after the fact I was called by the recruiter and they extended an offer of employment.", "Interview Questions": "What would you describe are your two greatest strengths, and two greatest weaknesses?"}, {"date": "9 Jul 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Aug 2017", "Interview Descriptions": "I applied online and about 3 weeks later got a call asking if I was still interested and when would be a good time to interview. I had an interview a week later. I followed the instructions emailed to me and made my way to the designated waiting room. I waited for about 5 minutes and then met with the nursing manager. I also met with one RN and two other MA's on the floor. Before I left I was given a tour and told they would reach out to me within one week. The next day a recruiter emailed me with next steps (references, drug, screen, document verification, etc).", "Interview Questions": "How do you handle working under pressure?"}, {"date": "29 Mar 2017", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jan 2017", "Interview Descriptions": "2 step interview process, initial 1:1 and then if you are selected a final group/panel interview.  Interviews are  set up through a HR Talent Recruiter. You do not speak directly with the manager or department when scheduling interviews.  I was only given 48hrs notice for scheduling and only 1 time option or they will consider someone else.", "Interview Questions": "If you were asked to complete a task or project and were given no instructions, how would you complete it? "}, {"date": "1 Dec 2016", "title": "Insurance Verification Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado in Nov 2016", "Interview Descriptions": "The initial interview is a phone screening with a follow up face to face if you pass. So far every interview I've had at Children's has been a panel. Nothing intimidating at all walking into a room with six other associates. The most recent interview was not a very good experience. I had the distinct feeling I wasn't being taken very seriously from the start. I am a mature, strict professional who wears a business suit and is courteous and friendly to everyone. So I am really curious as to what the problem was. The interviewer had a smirk on her face the entire time and when it was over, I had to practically step in front of her as she was leaving to shake hands and end the transaction. Perhaps some advice from any others who have interviewed here?", "Interview Questions": "What personality types do you like to work with?"}, {"date": "20 Mar 2017", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Oct 2016", "Interview Descriptions": "I applied online, had a brief phone interview based on my interest and experience followed by an in-person interview with a panel. The hiring manager called back within a week with an offer. I was then contacted by HR to complete the hiring process.", "Interview Questions": "A stressful scenario was given where conflicting deadlines made it difficult to accomplish both tasks. I was then asked how I would handle the situation. "}], [{"date": "16 Dec 2016", "title": "Insurance Verification Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Aug 2016", "Interview Descriptions": "Email personally asking if I was still Interested\r\nPhone \r\nFace to face\r\n\r\nVery easy and flowing process. Once you are picked everything moves pretty fast. The managers are great and so is the  environment. It feels good to be with the Country's Best for Childrens Care", "Interview Questions": "why do you want to work for children's?\r\nWhat is your experience with insurance verification?\r\n"}, {"date": "30 Jul 2016", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "It depends on who is applying and what job you apply for. Not a fair system. It depends on if they know they want to place you in a position already.", "Interview Questions": "Have you ever made a mistake, in the past and how did you handle it?"}, {"date": "23 May 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jul 2016", "Interview Descriptions": "I have applied for multiple positions at Children’s Hospital Colorado since spring of 2016, so I have been applying for three years total. I would say.....at least 10 positions I have applied for all together, all of which I have met the requirements for and have further qualifications for the specific department. I have, in three years, received ONE notification that my application was in review, and gotten ONE phone call from a hiring manager. The phone call was very brief and she seemed unenthusiastic about it. A quick description of the job, a couple of questions about my skills, and a rushed conversation about when a formal interview could be scheduled. Three days before said interview I had a death in the family and knew that I would be unavailable to attend said interview and emailed the hiring manager asking if it would be possible to reschedule the interview given the circumstances. I was assured that it would be fine, given her email, and told to send dates and times that would work for me. I immediately sent over a list of multiple dates and times that would work for an interview. I never heard anything back. Over the next month I continue to try and follow up over phone and email with no responses. That was only on one position out of the many I’ve applied for and have never received a call, email, or any other sort of communication about applications in review or moving forward in the hiring process. Some of the positions I have applied for have been open for greater than 6 months. I don’t know how the hiring process goes there, but it must either be incredibly slow, no one ever gets hired, or neither HR, Talent Acquisition, or Managers are very proactive in acquiring new employees to fill needs.\r\n(A side note, before someone potentially thinks that maybe I’m just not qualified for what I have applied for, I have 6 years of nursing experience almost all of which has been in the specialty I have applied for, my bachelors degree, meet all requirements listed in job posting, and have certifications beyond what is required.)\r\nI don’t know why I continue to chase the dream of working at Children’s Hospital Colorado.....but I am about to give up on it.....", "Interview Questions": "When can you do a formal interview?"}, {"date": "14 Jun 2016", "title": "Process Improvement Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Colorado (Denver, CO) in Jun 2016", "Interview Descriptions": "Being at a distance I had a phone call, Skype interview and then an in person, which they flew me out for. The process was very smooth working with my HR rep. It took a long time (applied in February and final interview in beginning of June). Everyone was great, even though I didn't get the job. The only downfall of the whole process was the automated response of rejection that had one line to go back to apply for more jobs on their website. Unfortunately, there was no phone call or personal email, which I would have expected after they flew me out to Denver from across the country and put me in a hotel for a night for the interview. Overall, everyone was pleasant.", "Interview Questions": "They asked a variety of questions on my experience and tools I have used in the past and what my experience with Lean Management has been."}, {"date": "12 May 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Apr 2016", "Interview Descriptions": "Recruiter contacted me via email to set up interview  very quickly met with them the next week and received a phone call to tell me that I didn't get the job!", "Interview Questions": "What would you do if a patient's family told you that a nurse did take care of their child very well because she was on her phone all night."}, {"date": "4 Jun 2016", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Mar 2016", "Interview Descriptions": "Candidates were pre-screened with Senior and Mid-level Project Managers.  Then there was and interview with the Director and Hiring Manager.  Questions posed were typical Project Management questions.  All colleagues were friendly and professional.  Specific feedback was provided by the hiring manager and several generic emails came from HR.  It was a very positive experience, except the Director has an arrogant, disdainful attitude.  It is no surprise that they had difficulty finding the right candidate.", "Interview Questions": "1.  Describe the artifacts required to manage a project.\r\n2.  Describe a time you had to deal with conflict and what did you do?\r\n3.  Have you had experience with ERP systems?\r\n4.  We don't expect you to have Healthcare background. "}, {"date": "17 Apr 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Hospital Colorado (New York, NY) in Mar 2016", "Interview Descriptions": "I went through 3 interviews. The first was a phone interview as I am out to f state. The second was in person after a job shadow and the third was a Skype interview. Overall the process was pleasant and everyone along the way was welcoming. From application to offer, the process took several weeks.", "Interview Questions": "They mostly used behavioral interview questions as well as some more specific experience based questions."}, {"date": "26 Nov 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "The process took much longer than I expected (4 month), but it worth it. The first interview after the phone screening was a 1-hour interview with 2 people and the second was a 2-hour interview with 8 people.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Dec 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Children's Hospital Colorado in Oct 2015", "Interview Descriptions": "My interview was with my upper management and lasted about 45 minutes. They asked me questions about my past experience and where I see myself as a nurse in the future", "Interview Questions": "Why do you want to work at CHCO?"}, {"date": "21 Jul 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "I applied online through my college website. They called me, asked me a few questions. They then conferred with each other. They called me again and offered me the position a week later.", "Interview Questions": "What have you done in the past?"}], [{"date": "9 Jul 2015", "title": "Clinical Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "Referred to the position by an internal employee. Phone interview within 1 week. In person interview within 3 weeks. Week 6 was called and told an outside candidate was being offered the position. 2 weeks later received another call saying things didn't work out with the first choice candidate, asked if I would still like to be considered. I said yes. Was told I would need to interview again. 2 weeks later, I was brought in for a group interview when I was told the hiring manager and 2 other managers were all leaving the organization and I was brought in to interview with the interim manager. Interview went relatively well. After the interview, was told that the job description needed to change as I wasn't the first choice candidate and the job description would need to be adjusted before they could make an offer. 6 weeks later, I called HR to find out what was going on. At that point I was told that the job description had completely changed and I was no longer a qualified candidate. In total, 17 weeks from the day I applied to the day I found out the position was no longer a possibility. Clearly lots of transition within that particular department.", "Interview Questions": "How do I learn new things?"}, {"date": "12 Jun 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Colorado", "Interview Descriptions": "The interview was straightforward, I was asked behavioral questions.  However, at the end of the interview I was told to expect a response either way in at least 2 weeks. I called and left a message at 3 weeks, and never received a reply. \r\n\r\nOn a separate occasion, for a different position, I was called for an interview. There was a scheduling conflict, and the hiring manager said she would get back to me. I called and left 2 messages that week and never received a reply. \r\n\r\nThe hiring managers here have been extremely unprofessional in this aspect. If you say you'll get back in touch with someone, even if you just send out a generic email, then do so. I'm rethinking whether I really want to work for a company with flaky management.", "Interview Questions": "Tell me about a time you were working on a team that didn't function well. "}, {"date": "21 Jun 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado in Jun 2015", "Interview Descriptions": "Fast and easy, did a one to one with a telephone recruiter because i was coming from out of state. Then i did a phone interview with the manager.  Overall took about a month to get hired.", "Interview Questions": "Strengths and weaknesses"}, {"date": "29 Jun 2015", "title": "Research Informatics Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jun 2015", "Interview Descriptions": "The interview process was very well organized and quick (relative to other employers I was interviewing with). I got a chance to meet a variety of the staff and was encouraged to ask them almost as many questions as they asked me. I got a very positive impression about the Research Institute overall.", "Interview Questions": "I was asked to describe and rate my experience with SAS, SQL, and data extraction along with questions about my ideal work environment and my personal strengths and weaknesses."}, {"date": "2 Sept 2015", "title": "NICU TECH Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado (Denver, CO) in May 2015", "Interview Descriptions": "Came in for an interview, got a call for a second interview where they offered the job. Had to do a test, drug test, health screening and have immunization records", "Interview Questions": "Why would you be good for this team?\r\nWhy did you chose Children's Hospital?\r\nHave you ever had any problems with co-workers?"}, {"date": "8 Aug 2015", "title": "Accounts Payable Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Children's Hospital Colorado (Aurora, CO) in Apr 2015", "Interview Descriptions": "Sad, it wasn't about skills. They were desperate, because the depart was so far behind.  Using the employees to conduct the interview was well beyond their pay grade.  They had never been trained on how to interview, it was about how you looked not on your skills or ambitions.", "Interview Questions": "When can I start?"}, {"date": "24 Nov 2016", "title": "Process Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Colorado (Aurora, CO) in Feb 2015", "Interview Descriptions": "The interview process was different than what I had previously experienced in other organizations in that many of the interviewers did not show up to the scheduled interview. Those that showed up to the interview were polite, knowledgeable and professional. The interview was split 50/50 between interviewers asking questions and then listening to responses. Logistically, the interview was a bit disorganized, and also there was no feedback loop after the interview at all. Neither rejection, nor next steps regardless of the multiple attempts to obtain a conclusion from both HR & the hiring manager.", "Interview Questions": "What type of work do you prefer - strategic, tactical, or a mix?"}, {"date": "11 Feb 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jan 2015", "Interview Descriptions": "4 hours long, met with 4 groups of 3-6 people in each group. Most were late. When meeting with each department, people came and went and I found myself having to repeat information or answer the same questions.", "Interview Questions": "What brought you to Childrens? "}, {"date": "7 Jun 2018", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at Children's Hospital Colorado in Oct 2014", "Interview Descriptions": "The process was very thorough and seemed to represent the collaborative nature of the Children’s Hospital culture.  Met with multiple stakeholders, senior leadership and physicians.  While a bit long of a process, I believe they are very intentional about the process and interested in findings A players.", "Interview Questions": "Behavioral based questions.  Conflict resolution skills, Why Children’s.  What is biggest misperception others have about you and how did you address the misperception."}, {"date": "26 Jul 2014", "title": "PRN-Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Colorado (Aurora, CO)", "Interview Descriptions": "Was sent an email stating I would be interviewed and after 10 days contacted HR. The first phone call went to the recruiter that was handling the position to which I never received a return call from and the second back to the original receptionist that gave me insignificant information and 3 days later I received an email stating the job was filled without even getting to speak with any one.", "Interview Questions": "N/A"}], [{"date": "17 Apr 2014", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Colorado", "Interview Descriptions": "The interview process took a while.  Phone interview followed by a face-to-face interview.  Then, a group interview consisting usually of 5-6 people or the whole department will be the \"final interview\".", "Interview Questions": "How do you handle pressure?  Can you multi-task?"}, {"date": "18 Dec 2017", "title": "Clinical Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Apr 2014", "Interview Descriptions": "called from a recruiter, phone interview, two panel interviews, final  phone interview and offer. Attended orientation then one on one training for systems I would be supporting. Met staff for the areas I would be interacting with then off and running. It was painless.", "Interview Questions": "what systems I had worked on before"}, {"date": "9 Apr 2014", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Children's Hospital Colorado (Valencia, CA) in Feb 2014", "Interview Descriptions": "one interview", "Interview Questions": "what do you do when there is conflict in the office"}, {"date": "14 Aug 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Dec 2013", "Interview Descriptions": "My interview process was very quick. It was one meeting with my current boss and a fellow colleague. The HR portion of the hiring process was more cumbersome to have to fill out and fax forms back and forth.", "Interview Questions": "What is my 5 year plan?"}, {"date": "30 Nov 2015", "title": "Laboratory Instrumentation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in May 2013", "Interview Descriptions": "I knew the managers I would be working for as I was a field service engineer for a product line that was in the laboratory. The interview was somewhat informal but comprehensive.", "Interview Questions": "What do you like most about working on medical equipment and what are you familiar working on?"}, {"date": "7 Feb 2014", "title": "RN Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jan 2013", "Interview Descriptions": "Phone call from recruiter, met manager of the unit and then had peer interview. It took 2 months to get hired.", "Interview Questions": "What would you do if you do not know something?"}, {"date": "12 Nov 2013", "title": "CMT Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Children's Hospital Colorado in Sept 2012", "Interview Descriptions": "I applied for a CMT position in the ED. I arrived and had a one on one interview in triage with the hiring manager. There were a lot of behavioral questions. Then received a tour of the ED. Process took about 45 minutes.", "Interview Questions": "How have you handled a conflict with a coworker?"}, {"date": "9 Jul 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Colorado (Aurora, CO) in Apr 2012", "Interview Descriptions": "Online application, HR email contact, Interview times set up, Group and individual interviews with staff and management. Process takes several weeks.  Offer made, background checks, drug testing.  Typical interview process.", "Interview Questions": "Background and behavioral questions (tell me about a time....etc.)"}, {"date": "1 Dec 2011", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Children's Hospital Colorado (New Orleans, LA) in Nov 2011", "Interview Descriptions": "Meet with hr then with controller. It took forever. They left me waiting for 30 mins each. The controller rolled her eyes several times. She seemed kinda rude. There is also a sample test using excel about accounting. It was easy. They still may call me back, because they said it would be weeks before they do call backs and it is only going on 2 weeks. I will decline even if I get it. It will be long hours at a low salary pay.", "Interview Questions": "N/A"}, {"date": "18 Dec 2011", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Children's Hospital Colorado (Denver, CO) in Apr 2011", "Interview Descriptions": "Interview process was handled by the departmental manager.  Mediocre communication between manager and HR to coordinate the hiring process.  Long, delayed interview process, primarily due to managerial involvement.  Included interview with prospective team members/co-workers.  \r\n\r\nHR handled the paperwork and forms - otherwise process is dictated by manager.  Best way to get an interview / consideration is to gain a contact within the department.  Usually position is filled by someone they already have in mind (not necessarily the public posting).", "Interview Questions": "Related past experience?"}], [{"date": "18 Oct 2011", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Children's Hospital Colorado (Aurora, CO) in Jan 2009", "Interview Descriptions": "Submitted a resume, called and asked to complete an online job application.  Called shortly afterwards for an interview.  Notified next day of job offer, which I took 48 hours to consider; then accepted.  Brought in to complete some new hire information a week later, and set up for a start date.  Everyone from Human Resources to the Manager that hired were very friendly and seemed very happy in this work place, which very much influenced my decision to take this position.", "Interview Questions": "Do not recall any specific questions"}, {"date": "18 Aug 2010", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Children's Hospital Colorado (Denver, CO) in Mar 2008", "Interview Descriptions": "I was greeted by one of the staff members in the lobby,and I followed back to an office and conference room area. I was then greeted by a group of approximately 6 to 8 IT staff members (all men) whom began asking technical questions based on items on my resume. The staff was very friendly, but only scratched the surface when it came to asking about my experience. I would consider it a difficult technical interview, not because I was unfamiliar with the technical subjects, but because I was put on the spot to answer esoteric technical questions in my field. Unfortunately I'm not a walking encyclopedia, perhaps its because I'm too used to having Google always on hand, but I knew the subjects but don't believe I answered the questions to their liking. I did not receive a call back and was not overly disappointed.", "Interview Questions": "Given the name of an object in an LDAP database with a domain name and OU path, give the full X.500 Notation for its location."}, {"date": "22 Feb 2010", "title": "Lean OD Team Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Children's Hospital Colorado (Seattle, WA) in Feb 2008", "Interview Descriptions": "Phone screening first and then a 1:1 interview with the hiring coordinator before meeting with the hiring manager and her entire team.", "Interview Questions": "Don't remember"}]]