[[{"date": "9 Jan 2023", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Dec 2022", "Interview Descriptions": "Interview process was comfortable and easy. The expectations are spelled out and each of the interviewers are incredibly nice. It was a 3 step process with a talk with the recruiter, one with management, and one with the physician team. The final part is a tour of the office too.", "Interview Questions": "Explain what your practice style is like?"}, {"date": "22 Nov 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Methodist Health System - NE and IA", "Interview Descriptions": "There were 2 interviewers, both of whom were very professional and friendly and made me more relaxed during the process. They asked pretty standard interview questions that you would expect for a CNA job.", "Interview Questions": "Tell us how you reacted in a moment of crisis"}, {"date": "9 Nov 2022", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Methodist Health System - NE and IA in Nov 2022", "Interview Descriptions": "Best interview I've ever done. Very easy to talk to and laid back, mostly visited person to person before required interview questions were asked. Answered all my questions and I walked away feeling like they took the time to get to know me and listed to what I had to say.", "Interview Questions": "Q: Name a situation where you did not meet your patient/customers expectations and how did you handle it."}, {"date": "9 Dec 2022", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Aug 2022", "Interview Descriptions": "The interview process went well. I applied online and had my first call the next day. Phone interview followed by an interview in-person with the manager. Job offer was a few days later.", "Interview Questions": "How did you handle a difficult situation at work?"}, {"date": "17 Dec 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Methodist Health System - NE and IA", "Interview Descriptions": "The process had taken weeks and I had two separate interviews. There was one interview with HR and they drill you with questions and then I had an interview with the hiring manager which was fairly easy.", "Interview Questions": "What was a time you went above and beyond your peers?\nWhat can you add to Methodists core values?\nDescribe a disagreement you had with someone and how you resolved it.\nDescribe a stressful situation"}, {"date": "26 Aug 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Aug 2018", "Interview Descriptions": "Applied online - three weeks for a response. HR reviewed resume on the phone.  Had 2 interviews. One with HR. One with manager. Got a call in 2 days with a job offer.", "Interview Questions": "How do you handle criticism?"}, {"date": "26 May 2018", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Methodist Health System - NE and IA (New York, NY)", "Interview Descriptions": "Had 5 different in-person interviews.  Didn't get the job and no explanation.  A great deal of time spent for the eventual result of not receiving an offer or explanation.   Seemed as if they didn't really know what they wanted in the job.", "Interview Questions": "General questions on background."}, {"date": "7 Feb 2017", "title": "Marketing Strategist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Feb 2017", "Interview Descriptions": "Had a 30-minute interview with a recruiter and a 1-hour interview with the entire marketing team at the college. The interviews went very well and I was quickly informed that I was a top candidate. Unfortunately, the salary range was far below what I had stated as my expected range on my application. This was understandable, but quite disappointing as the recruiter had told me the position topped out near my requested range in the initial interview. It seems a lot of time and energy could have been saved on both sides if this had been sorted out during the screening process. Nice people, thoughtful interview questions and great communication throughout the process, but a disappointing outcome.", "Interview Questions": "Tell us about one of your hobbies and how you do it."}, {"date": "13 Jul 2015", "title": "Dietary Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Methodist Health System - NE and IA (Mansfield, TX)", "Interview Descriptions": "Two interviews between HR and the department, it was easy to talk to both of them. If you passed the interview with HR, they send you to the department Director to have the second interview.", "Interview Questions": "What interests you about this position?"}, {"date": "21 Apr 2015", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Methodist Health System - NE and IA (Dallas, TX) in Apr 2015", "Interview Descriptions": "Excellent, timely.  From time of application to email/then phone call was about 1 week.\r\nThorough interview with relative questions and discussion lasted about 45 minutes.  Then met Medical Director of program. Another 30 minutes.  Questions were the usual.  Nothing surprising.  No offer but I am in the \"running\" so to speak.", "Interview Questions": "What makes you a good match for this job?"}], [{"date": "14 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Methodist Health System - NE and IA (San Antonio, TX) in Aug 2014", "Interview Descriptions": "It was unorganized,  but they literally called me an hour after I submitted my online application said I got  interview. They offered me the job at the first interview  but then took forever to call me back like over a week, I had to call them or email them when I would start or take drug screening.  They emailed me back shortly and started setting up process.  They also got my position wrong and thought I wanted to be a weekender I said no then they offered me regular full time day employee. The training wasn't every long at all only 2 weeks, but I got through it and everyone always offers to help.", "Interview Questions": "Why do you want to apply here?"}, {"date": "20 Jul 2017", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Mar 2014", "Interview Descriptions": "Interview was very informal.  IT was a lunch meeting in a small room with all the physicians coming in and out during their lunch. Lunch was provided.  The nurse coordinator and head administrator were present and very friendly.  No one asked tough questions, they really just asked a little about my history and what I wanted to know about the group.", "Interview Questions": "N/A"}, {"date": "10 Jan 2014", "title": "Histocompatibility Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Methodist Health System - NE and IA (Dallas, TX)", "Interview Descriptions": "Hiring process took about a month or more. You will first interview with the hr department and then the manager from department that you will be working for as well as your co-workers.", "Interview Questions": "Questions were not hard; there were just behavorial questions and just \"getting to know you\" questions to make sure you can get along with the team. "}, {"date": "25 Nov 2012", "title": "CPA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Nov 2012", "Interview Descriptions": "Very selective.  Helps if you have a college degree.  If not, experience.  You may have to be persistent.  Ask questions.  Smile and show confidence.  Stress that the patient is your top priority.", "Interview Questions": "Some computer evaluations upon new employee orientation were a little intimidating.  You will be trained at what you don't know, but it can be embarrassing to realize what you don't know..."}, {"date": "14 Dec 2015", "title": "RN Health Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Jan 2012", "Interview Descriptions": "Th interview process was low stress. Behavioral interview questions were asked. The atmosphere was causal. I interviewed with the director of medical home only. I was offered the job a couple of weeks later.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Aug 2013", "title": "Business Office Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Methodist Health System - NE and IA (Omaha, NE) in Dec 2011", "Interview Descriptions": "Submitted online resume, contacted by HR department, answered a few questions over the phone. Came in for a preliminary interview with HR and then a final interview with my now Supervisor.", "Interview Questions": "Why do you want to work for Methodist Health System?"}]]