[[{"date": "5 Feb 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Service Coordination (Bowie, MD) in Jan 2023", "Interview Descriptions": "Two part interview. Pre-screening interview takes place with HR. Basic questions about relevant experience and qualifications will take place. Then a couple scenario questions. Supervisors review that information and if they want you, you then do an interview with them (two) and they will ask you the same things but even more scenario questions.", "Interview Questions": "Describe a time when you showed communication skills that surpassed others around you."}, {"date": "17 Nov 2022", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Service Coordination", "Interview Descriptions": "A phone screen first, then a virtual interview with three supervisors asking you mainly scenario type questions. It lasted for about 30 minutes and there was opportunity to ask questions.", "Interview Questions": "How do you handle stress?"}, {"date": "7 Nov 2022", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Service Coordination in Sept 2022", "Interview Descriptions": "First, a recruiter conducted a 30–45-minute phone interview with me. This interview was very basic and asked questions about past work experience. The second interview was virtual with three managers from the county I would be working in. They asked many detailed questions about past situations that related to the job. Many of the questions were a bit difficult to answer since I am a recent graduate and do not have case worker expeirence. The job description specifically stated new graduates were encouraged to apply. I really enjoyed the managers who interviewed me and felt like the position would be a great fit. Unfortuntely, I was not informed until the last 5 minutes of the interview that position was actually available and they were creating a queue of eligible applicants. They explained they are hoping to expand in 6-9 months and wanted to have candidates who have already been through the interview process ready for when the time came. While this isn't inherently an issue, I found it dishonest they did not tell me until the very end of the second interview. Due to the lack of an immediately/soon available position, I chose to remove myself from consideration for the position. I felt lied to and felt this dishonestly was a glimpse into how the organization is run.", "Interview Questions": "Provide an example of a time where you had to gather various people together and conducted a meeting as an advocate for someone else."}, {"date": "24 Jul 2021", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Service Coordination in Jun 2021", "Interview Descriptions": "There is a phone interview first, it only last for about 30 mins they just going through your experiences. The in-person interview is next (be prepared, there are two people in the room). The in-person took about an hour. All the questions are scenarios based, so I would suggest looking over the job description, the mission statement and try to think your job experience or school experience that will line up.", "Interview Questions": "Name a time where you had to deal with a difficult client and how did you resolve the issue?"}, {"date": "7 May 2021", "title": "Accounts Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Service Coordination", "Interview Descriptions": "The individual interviewing me was very evasive when answering my questions and never gave me a straight answer.  The interviewer continually referenced me making $100 000 annually without ever indicating how that would occur and never answered any of my questions directly.   There is something that feels very out of sorts.", "Interview Questions": "N/A"}, {"date": "27 Apr 2021", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Service Coordination", "Interview Descriptions": "This interview was a tedious, multi-step interview process. They also require you complete (pass?) a logic and personality test. They asked for a writing sample within 24 hours of second interview too. It wasn't quite clear what they were looking for in candidates.", "Interview Questions": "Tell us about a time you had to come up with an innovative solution to a problem. "}, {"date": "16 Apr 2021", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Service Coordination (Baltimore, MD) in Apr 2021", "Interview Descriptions": "It was simple and easy and interviewer was friendly and easy to talk to. Very informed and ready to answer my questions. Interview took about 30 minutes and then you have to complete an assessment. If you pass the assessment you move onto the 2nd interview. Very detailed process.", "Interview Questions": "How did I handle a difficult client from past experience?"}, {"date": "9 Jan 2021", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Service Coordination (Baltimore, MD) in Sept 2020", "Interview Descriptions": "Due to the current pandemic, the interview is being done via a video call from home with three different supervisors.  You are asked a series of situational questions that involve scenarios and how you would handle the situation.", "Interview Questions": "Situational questions"}, {"date": "14 Feb 2020", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Service Coordination in Feb 2020", "Interview Descriptions": "When I gave times that I was available, they offered me a different time entirely. They then called ten minutes late simply to tell me that I was not yet eligible for the job because while I will be graduating college in three months, I have not yet. Other than that, the woman on the other end sounded very sweet!", "Interview Questions": "What questions do you have about the position?"}, {"date": "15 Aug 2019", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Service Coordination (Owings Mills, MD) in Aug 2019", "Interview Descriptions": "I initially was referred by a previous employee. I applied, spent two weeks following up with emails and calls, and then set up a phone interview with a person for H.R. She was very sweet and helpful in answering my questions. I was then sent two tests, one was a scale personality test with questions such as \"do you feel you often think outside the box: Not at all, to very much. Then a second SAT type test, with questions like \"a large body of water: A, R, P, L\". I passed through to the final interview, expecting a one-on-one session. However, there were 3 women, all very lovely. This interview was broken up into 3 parts, the first was questions about me. I was expecting the normal \"what skills do you believe would be a good fit for our company\" however they were not. There were 12-15 questions, all of which were \"can you tell me about a time\". I expected a couple of those, but 12-15 was a lot, as someone who doesnt have the greatest memory, it was very challenging, but I was honest and believed I did well. I was applying for a position using ASL, and was unexpectedly asked to sign with one of the women, which threw me off since I wasn't told I would have to sign, but I believe I did well. In the second part of the interview, I was sat in a room with a computer, instructed to do a mock case report on a fictional client who was having issues with his parent moving into a retirement home. As I do not have previous case management work experience and did not understand the position/requirements well enough, I wasn't quite sure how to go about this. For the third part of the interview, I was able to ask questions I had regarding the job (of which I had many). Overall the process took 1.5 hours, the women were very sweet but I would say the interview was extremely difficult.", "Interview Questions": "-Can you tell me about a time where you struggled with laws or regulations \r\n-Can you tell me about a time you had difficulties meeting the demands of a client/individual\r\n-Can you tell me about a time you had to be organized\r\n-Can you tell me about a time in which you had to advocate for an individual \r\n"}], [{"date": "29 Jun 2016", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Service Coordination", "Interview Descriptions": "Seemed overkill with phone interview that was an hour then had a interview in bmore with 4 women that were not very welcoming. The woman that asked the questions spoke so fast that I had to ask her to slow down. Don't let them intimidate you when they put you in a separate room and tell you that you have 15 min to try put in a progress note on their laptop.", "Interview Questions": "Too many ethical questions with no details to work with to give a fair answer."}, {"date": "30 Jan 2017", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Service Coordination (Frederick, MD) in Apr 2014", "Interview Descriptions": "It was horrible. They really do make the interview process very difficult and already try to make you feel that you are in the position and asking you all these scenario questions which are difficult to answer. I interviewed with this agency twice and was denied for the job TWICE because I did not answer I believe one question the way they wanted.", "Interview Questions": "What are your strengths? and other scenario questions pertaining to working with the individuals. There was one like If you have a client who is at danger of being evicted because his house is not clean and the landlord is frustrated, how do you convince the landlord to allow the client to stay?"}, {"date": "20 Mar 2013", "title": "Help Desk Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Service Coordination (Frederick, MD)", "Interview Descriptions": "After submitting a resume I had 1 interview with the I.T. manager. He asked me about my past experiences and always took into consideration that he was hiring a student with no previous help desk experience. He explained the job very well and was very friendly. After this interview I was called back a few days later and offered the position.", "Interview Questions": "Most difficult question was \"Can you describe a time you helped someone in need?\". Looking back now it was a very simple question since it was my first real interview it did catch me off guard."}]]