[[{"date": "14 Jun 2023", "title": "PGY-1 Pharmacy Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lee Health (Fort Myers, FL)", "Interview Descriptions": "Interview was conducted via Zoom - very well organized (schedule is sent out well in advance). You spend the morning with the previous years residents for a Q&A, then you'll have sessions with the RPD, the director of pharmacy, and various preceptors. The breakout sessions included giving a presentation, a mock patient counseling session, and several small group interviews.", "Interview Questions": "Key questions they asked: How do you define failure? Give an example of a time where you went above and beyond for a patient."}, {"date": "9 Jun 2023", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lee Health (Fort Myers, FL)", "Interview Descriptions": "Fairly easy interview process. Remain calm, be honest and smile. They will ask questions about nursing school and your personality. Be upfront about the experience you’re looking to gain and future career goals and you will be placed with a nursing direction in that specialty to interview.", "Interview Questions": "Please describe a difficult scenario you were in and how did you respond"}, {"date": "5 Jun 2023", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lee Health (Fort Myers, FL)", "Interview Descriptions": "Overall it was good. The interview itself was fine. They threw a lot of information about the company at you in the beginning and then get to the interview portion. The questions were the typical interview questions. Kind of a stuffy environment.", "Interview Questions": "Why do you want to work for Lee Health?"}, {"date": "12 Apr 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lee Health (Fort Myers, FL) in Apr 2023", "Interview Descriptions": "This was a Great interview. The ppl were nice and informative. The staff was welcoming. They all greeted me with a smile. Director seemed cool. I recommended this job at this Time.", "Interview Questions": "Easy questions more about performance and personality"}, {"date": "5 Jan 2023", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Lee Health (Fort Myers, FL)", "Interview Descriptions": "Be prepared can be a long process. They move slowly. You will have to go through health screening. They require vaccinations or waivers. Badges are required and they will not get you onto a floor if you want to visit someone.", "Interview Questions": "How does your background lead you to us?"}, {"date": "8 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "Two part interview. First interview with HR. Second with the hiring manager. Direct questions about self, and past experiences. Pay was not discussed in the interview, this is reviewed with HR.", "Interview Questions": "Where do you see yourself in five years? "}, {"date": "25 May 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "*At Gulf Coast* Made me feel as if they didn't want to give me the job but had to interview me anyways. I get not being offered every position you apply for but I went through 3 rounds of interviewing all while the director and supervisors were speaking to me as if I shouldn't take the job and if I really wanted it. Kept telling me how hard this is going to be and if I really wanted it, when I said yes I wanted the position and I know I will be able to handle it their attitudes shifted as if they had to interview me. Felt like I was wasting my time driving in and sitting for interviews. \r\n\r\nEnded up having a much better interview process with a different hospital in Lee Health, they spoke to me with respect and you could tell they really wanted me to be there.", "Interview Questions": "Q.  What are some strengths and weaknesses "}, {"date": "30 Jun 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health in May 2022", "Interview Descriptions": "Spoke with HR rep. Asked several questions like: “Tell me about a time you went above and beyond for a patient”. “Tell me about a time you acted as a leader” “tell me about a safety concern”", "Interview Questions": "Tell me about a time you went above and beyond for a patient”. “Tell me about a time you acted as a leader” “tell me about a safety concern”"}, {"date": "28 May 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lee Health (Estero, FL) in May 2022", "Interview Descriptions": "Panel interview.  Everyone involved friendly. Felt comfortable. Good questions and assessment. Interviewers were competent and answered my questions satisfactorily.   Look forward  to receiving feedback from this group and hope to work with this staff.", "Interview Questions": "Tell us about your experience "}, {"date": "15 Apr 2022", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "Great, very informative and inspirational, it was a great experience overall. Not too much or a stressful or long interview process, very fair. \n\nI would suggest that this is an easy interview process", "Interview Questions": "N/A"}], [{"date": "3 Jul 2022", "title": "New Grad RN Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lee Health (Fort Myers, FL) in Apr 2022", "Interview Descriptions": "Interview process was fairly straight forward. First I had a phone call interview with a recruiter. The recruiter was late to the interview, thus cutting into my interview time. When I submitted an application it was for the interest area of the ER. The recruiter let me know that they didn't have that available, but set up a second interview with the PCU instead. After I interviewed with the PCU interim director, the recruiter called back to offer the job. At this time, I was still finishing my nursing program so I was not yet licensed. They were unable to tell me anything about salary, benefits, or relocation assistance pre-license, so I was unable to accept the job. I followed back up with an email to the recruiter stating that I decided to decline the job offer. They wouldn't take no for an answer. Since then, I have gotten multiple texts and calls from them asking about my licensure and phone calls from the hospital asking me to come into work (even though I do not work there and have never signed any offers). Lee Health was initially my top choice, but I would not work there based on my experience with the interview/hiring process.", "Interview Questions": "What made you want to become an RN? "}, {"date": "17 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lee Health", "Interview Descriptions": "It was kind of 2 interviews in 1. First Interview with supervisor/manager then with the Director. The interview was more like a conversation. I  was made to feel pretty comfortable and welcomed. Left interview excited to embark on the journey with this company.", "Interview Questions": "Just questions about current work experience, things I had written on my resume, carrier goals. "}, {"date": "31 Mar 2023", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lee Health (San Francisco, CA) in Feb 2022", "Interview Descriptions": "This guide will show you how to negotiate your salary over email with a step-by-step process. First, we’ll discuss why you should bother negotiating your salary at all. Then you’ll learn whether the best way to negotiate your job offer is through email or on the phone. Then you’ll get a detailed example of a counter offer letter along with a simple process to build your case and write your own counter offer email.", "Interview Questions": "easy, fair, fast, even, open"}, {"date": "9 Mar 2022", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Lee Health (Fort Myers, FL) in Feb 2022", "Interview Descriptions": "The interview process was super easy. I first talked with the recruiter who was very nice. She told me that I would be recommended to the manager. I received an email thanking me for the interview. I received an email from the manager asking for a phone interview. Within the week, I had the job.", "Interview Questions": "Name an experience where you had to go above and beyond your job description to help"}, {"date": "1 Feb 2022", "title": "Program manager sourcing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lee Health (Fort Myers, FL) in Jan 2022", "Interview Descriptions": "Interviewed with Lee Health, three virtual interviews with different level of the organization, about an hour long each. All behavioral related, situation, action result. After interviewing with the hiring manager, surprised to be scheduled for a third party assessment, phychological testing(2.5 hrs) and another interview (1.5 hrs).", "Interview Questions": "Tell me about a difficult situation implementing a process."}, {"date": "23 Mar 2023", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lee Health in Jan 2022", "Interview Descriptions": "The interview process was super easy. They are super nice and easy. they answered questions and helped me definitely would recommend them. if you are looking for a job hospitals are the way they go and there benefits are a bonus", "Interview Questions": "how many hours i’d like to work"}, {"date": "28 Dec 2022", "title": "Chief Equity Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Lee Health (Naples, FL) in Dec 2021", "Interview Descriptions": "An executive search firm handled the search and was excellent at representing the opportunity. I had several meetings with the search firm and then proceed to meet with the selection committee.", "Interview Questions": "They were very interested in my work in developing a DEI dashboard and improving the overall culture at my current employer."}, {"date": "6 Nov 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health (Fort Myers, FL)", "Interview Descriptions": "Lengthy process but doable. Have great benefits and loved the people. Environment was welcoming. Very picky on who they choose to hire. Interview over the phone and then interview with the actual unit hiring you.", "Interview Questions": "Tell me about your self?"}, {"date": "9 Dec 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Lee Health (Miami, FL) in Nov 2021", "Interview Descriptions": "The interviewer was very welcoming and made me feel like I was already a part of the team.  The interview did not feel like an interview but rather a conversation with a co-worker.  That made me feel relaxed and I was able to speak to my experiences and different scenario's with ease.", "Interview Questions": "How would you handle a difficult customer?"}], [{"date": "22 Sept 2021", "title": "APRN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "Recruiter review the application and called to get more information and area of interest. Explained the working hours , benefits, salary  and job descriptions. In person interview with MD and director, next step interview with other office staff. Will select from multiple candidate to best fit  in this position.", "Interview Questions": "Why you choose this specialty?"}, {"date": "2 Sept 2021", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "The interview process was very smooth. The follow up from managers , not so good. The turn around time was not convenient for me so I ended up with another great company.", "Interview Questions": "How long had I been a receptionist?"}, {"date": "3 Aug 2021", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lee Health (Fort Myers, FL) in Jul 2021", "Interview Descriptions": "Apply online, through the Lee Health website. Had a phone call with a lee health recruiter. Then follow up with Director of Rehab for the specific unit. Had no follow up phone calls, and then informed by e-mail I was not selected for the position.", "Interview Questions": "Licensure, experience, comfortability, EHR use"}, {"date": "29 Jun 2021", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "Very easy, Applied online through their website \r\nReceived a call to schedule an interview with an RDS\r\nPhone interview with RDS of about 30 minutes \r\nInterview with director and supervisors", "Interview Questions": "Why did you choose nursing "}, {"date": "24 Jun 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "First I had a phone screen with HR department.  Next I was invited to interview and do an in-person interview with the department.   I did mine virtually and it was a group of 4 to 5 people.", "Interview Questions": "Tell me a little about yourself"}, {"date": "17 Jun 2021", "title": "Public Safety Officer I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "WebEx interview, asked basic questions regarding law enforcement experience.  Interviewed with supervisor and shift supervisor.   Clearly explained what the job would consist of and what was expected.  Fairly easy process.", "Interview Questions": "Tell us about your job experience. "}, {"date": "11 Apr 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "Very friendly and ac tive. Interv iewers were very responsive and made me feel com fortable. Defi nitely indivative of the comp any's values and workplace culture. Made me excited about the position", "Interview Questions": "What are you passionate about?"}, {"date": "24 May 2021", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lee Health (Fort Myers, FL) in Jan 2021", "Interview Descriptions": "It was quite long. There was two people interviewing and made sure you had to be exceptional. I had to wait quite a while for them to interview me. It could have been more better. They said I had to be smiling all time but they weren’t smiling themselves.", "Interview Questions": "If I know that lee health employees had to be exceptional"}, {"date": "11 Feb 2021", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Lee Health in Jan 2021", "Interview Descriptions": "A recruiter contacted me on 2 positions I applied for; talked to me about the positions, the salary, the benefits, and how I was a ‘fit’ for the positions. Led me to believe I was moving forward. The recruiter needs to talk benefits after the interviews, not before. \n\nJob #1: I rec’d a decline email stating position was filled the very next day -which it remained posted online a solid week later! Job #2: I interviewed with dept as a group twice. Once on the phone and it went great and the next time virtually. They were unprepared virtually, unsure if it was a bad connection or what, but it wasn’t great. Multiple scenario questions, nothing about what I was capable of doing as a team member! I felt a big disconnect afterwards. I was told I’d get a ‘tour’ of dept which never happened, so I knew then I wasn’t moving forward. Next day, portal showed I was not selected.", "Interview Questions": "Give us an example of a time when you disagreed with a doctor?"}, {"date": "12 Aug 2020", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lee Health", "Interview Descriptions": "Applied online. Got a call about 5 days later. Have not had second interview yet. First went well but haven’t gotten information on second interview. I kind of clammed up at the end and didn’t ask pertinent questions.", "Interview Questions": "Talk about a time you had to handle a difficult patient ."}], [{"date": "31 Aug 2020", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lee Health in Aug 2020", "Interview Descriptions": "Engaging, organized, and swift. The interview enlightened me on the teamwork and goal-oriented mindset the staff possesses. It absolutely excited me about the position and organization overall. I was pleased with the process from start to finish and would recommend Lee Health to any future candidate.", "Interview Questions": "Why do you want to work for Lee Health? "}, {"date": "23 Feb 2023", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Lee Health in Mar 2020", "Interview Descriptions": "Initial interview was done over the phone by a recruiter. Typical education, experience, what are you looking for type of questions. Second interview the Manager called and asked questions. Third interview was a panel interview of peers. All were very pleasant and friendly and tried to make me as comfortable as possible. Use the STAR method to answer the questions they want to understand how you interact with your peers and patients.", "Interview Questions": "They had a list of pre printed questions I cannot recall specific questions. They were all 'name a time when'"}, {"date": "25 Jan 2020", "title": "Supply Chain Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lee Health", "Interview Descriptions": "More of a pleasant conversation rather than scripted interview questions. After one hour, come to find out it only pays under $12.00/HR. Could have brought it to my attention earlier in the process or post the salary online to avoid wasting anyone's time. Needless to say, I declined to go any further in the process. I think it's a tactic that many hiring managers use to get you through the door and assume you will accept the job anyway to avoid embarrassment. In other words, a bait and switch process.", "Interview Questions": "Where do you see yourself in five years? Why should we hire you?"}, {"date": "18 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health in Jan 2020", "Interview Descriptions": "The first interview was generalized basically getting to know you and identifying what type of unit you'd like to work on. Second interview was more formal and was with the unit director that you choose as your top choice", "Interview Questions": "How would you deal with a difficult patient? "}, {"date": "10 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Lee Health", "Interview Descriptions": "The interview process was efficient and thorough. A recruiter made the needed arrangements to interview with the department. I was fairly evaluated on my skills and given clear expectations for the position.", "Interview Questions": "Give an example of a project that required you to manage multiple tasks."}, {"date": "4 Aug 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lee Health (Fort Myers, FL) in Jan 2019", "Interview Descriptions": "Panel interview of supervisor and director, along with other CSR´s from each department. They all asked personality and performance based questions meanwhile discussing their specific job responsibilities. It took about 45 minutes.", "Interview Questions": "Describe your past work history and how it relates to this job position"}, {"date": "23 Dec 2021", "title": "Front Desk Agent Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Lee Health in Jan 2019", "Interview Descriptions": "Easy interview. Followed up on everything . Quickly to respond to job applications. Very friendly outgoing people to talk to. Questions in interview were not to difficult.  Made you feel yourself during the interview would recommend", "Interview Questions": "Normal interview questions were asked "}, {"date": "3 Oct 2018", "title": "Pediatric ER RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health", "Interview Descriptions": "Quick turnaround, HR quick,  met with general RN recruiter for first interview, met with department director for second interview, got offer from HR a day or two later. Comfortable setting, no issues.", "Interview Questions": "Tell us a time you went above and beyond for a patient or their family"}, {"date": "8 Nov 2018", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Lee Health (Fort Myers, FL) in Sept 2018", "Interview Descriptions": "2 part interview. first interview is with the resident specialist. the second is with the hiring manager and/or unit supervisor. Each runs about 30-45 minutes. After the interview I was asked to go to the hospital and do a unit tour. The following day I received an email that they went with someone else.", "Interview Questions": "Name a time you had a conflict with a patient or their family and how did you resolve it?"}, {"date": "2 Sept 2019", "title": "Digital Content Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health (Fort Myers, FL) in Jun 2018", "Interview Descriptions": "Interview process was fairly quick and easy. I got a call from a recruiter 2 days after putting in my application. I met with her for a 30 minute interview where she asked me some standard interview questions. After that I got a call about a day or two later from my department looking to set up an interview with my hiring manager. The interview was very casual and they allowed me to lead the process by just asking about my experience and what I wanted to share.", "Interview Questions": "Is there anything else you would like to tell us that we haven't already discussed?"}], [{"date": "23 May 2018", "title": "Data Specialist II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lee Health (Fort Myers, FL) in May 2018", "Interview Descriptions": "I applied September 2017 and after interview with a recruiter I met with hiring manager.  I was not considered for the position and the recruiter told me I was considered being overqualified for it. I was called for the same position on a different location few months later. Recruiter said she had my review from last time and not much was asked. She told me I will meet with hiring manager next week and discussed about salary and time for me to turn in my 2-week notice to my current employer .  I was told the hiring manager was on vacation but would be back in a couple of days  so I should wait for his call next week. Next week arrived and I never received the call but a generic email informing me the position was filled. I was told by the recruiter during the interview that I could call for any question I had, so I did to confirm if the position was indeed filled. However, I never received a call back from this person. Finally I applied to another PRN position 2 months ago and then suddenly, after believing I would never be called, I received a call for the hiring manager for this new position. I had an interview and was told I would be called.  However, in the interim, the same full time position I initially applied for was opened so I took the chance to apply for it once again.  I just received call from HR asking me if I was still interested in the PRN position so we can continue with the hiring process. I asked him If I would be considered for the full time position since is closer to where I live and is 40 hours with benefits. Recruiter said I will not be consider for the full time position and demanded a response  about the PRN position during the phone call so I had to turn down the PRN offer.", "Interview Questions": "HIPAA questions, experience with EPIC EHR. Experience with dealing with customers.  Common interview questions: tell me about you; your weaknesses and strengths;  where do you see yourself 5 years from now.  "}, {"date": "23 Jul 2018", "title": "Psychometrist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Lee Health in May 2018", "Interview Descriptions": "First received a phone call asking me if I was okay with pay, relocation, and other basics, then scheduled a phone interview. I  had a phone interview, the hiring manager called and said they'd like to do a second interview. The second interview was via video call and was with a panel of four people. I received an email 2.5 weeks later saying the position had been filled.", "Interview Questions": "What is one example of a time where you gave excellent customer service."}, {"date": "12 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Lee Health (Fort Myers, FL) in Apr 2018", "Interview Descriptions": "This is all done via a computer program called the brass ring if you happen to work for this corporation and are looking to change your job. Otherwise I have heard of people having a very hard time obtaining the necessary information from outside the organization", "Interview Questions": "The tired question of where will you see yourself in 5 years. "}, {"date": "29 Apr 2022", "title": "Cultural Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lee Health (Fort Myers, FL) in Jan 2018", "Interview Descriptions": "Very good . Thorough interview process . Reference check . Two person interviewed . High emphasis on work place communication and experience. A lot of experience and psychoanalys assessment .", "Interview Questions": "What is the reason for applying "}, {"date": "29 Oct 2019", "title": "Digital Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health (Fort Myers, FL) in Jan 2018", "Interview Descriptions": "First step was with a recruiter where they asked a lot of behavioral questions. The second step was multiple rounds with the hiring team. Overall it was causal and easy if you were prepared to discuss your experience and how you would be a good fit.", "Interview Questions": "Tell me about your experience "}, {"date": "20 Oct 2017", "title": "Patient Registration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Lee Health (Fort Myers, FL) in Oct 2017", "Interview Descriptions": "Met with recruiter and interviewed. The position I was interviewing for was filled already, recruiter had me meet with another recruiter and interview for patient care liaison position since I had an active application on file. The meeting went great, recruiter asked me to send an updated resume and update my online profile. He said I came at the perfect time ( that week was crucial) . Never heard anything else and no Department interview offered. \r\nVery disappointed", "Interview Questions": "How do you handle a difficult customer? "}, {"date": "9 Nov 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Lee Health (Cape Coral, FL) in Sept 2017", "Interview Descriptions": "May come across as informal , however pay attention to how you respond. It is a 3 part process, the recruiter, the unit director, the start of orientation. Different unit leaders interview as they feel. There was the informal conversation type and the the direct Q&A. As much as you are looking to fill a place they want someone that can grow and be retained.", "Interview Questions": "where do you see yourself in 5 years?"}, {"date": "15 Apr 2017", "title": "RN Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Lee Health", "Interview Descriptions": "I had 4 staff panel during interview.  The usual behavioral questions were asked amd discussed at length.  There were specific clinical questions asked and discussed.  This included high level breakdown of said clinical procedures and applicable policies.  After, we had a discussion about productivity requirements and expectations includong need to fill in as field staff when necessary.", "Interview Questions": "describe one time you discovered someone had not followed md orders.  what did you do?"}, {"date": "23 Mar 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lee Health (Fort Myers, FL) in Apr 2017", "Interview Descriptions": "The interview process had different stages of phone interviews then an in person interview where you spend the day with the physical therapist. I was able to see how they function on an every day basis.", "Interview Questions": "Where do you see yourself in five years? "}], [{"date": "6 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lee Health (Fort Myers, FL) in Nov 2016", "Interview Descriptions": "Met with charge nurse and director of nursing gave situations on how to handle nursing issues. Always remember if u don’t know something ask for help!! They want to know u will practice safe nursing as a new grad ultimately", "Interview Questions": "Strengths and weaknesses"}, {"date": "8 Nov 2016", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lee Health (Fort Myers Villas, FL) in Oct 2016", "Interview Descriptions": "I was asked a series of personality questions, as well as skills and said she would very much like to hire me in less than 10 min. I was asked what type of work ethic I have., I said I am always on time, do not miss days. I also stated that it's very important I work within an honest company that carries a high level of Integrity..", "Interview Questions": "Do I think I am a good fit for the company?"}, {"date": "13 Sept 2016", "title": "Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lee Health (Fort Myers, FL)", "Interview Descriptions": "Typical interview process. Met with board of security managers and answered some questions. Don't really remember much else as this was a few years ago. The more questions I was asked, the better I felt.", "Interview Questions": "The dreaded \"tell me about yourself\".... and others about my history working in a similar field."}, {"date": "29 Oct 2018", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lee Health (Fort Myers, FL) in Sept 2016", "Interview Descriptions": "1st step: application; 2nd step: HR/Recruiter interview; 3rd step: Unit interview; 4th step: a non-competitive offer.  The offer is frequently non-competitive, they know it and continue to try to convince you the sunshine is worth it.  Sunshine does not pay the electric bill.", "Interview Questions": "Do you have AHA BLS, ACLS, PALS?  "}, {"date": "18 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lee Health (Cape Coral, FL)", "Interview Descriptions": "The company's Interview process was very efficient. Notified of interview date within a week of applying. Hire date notification less than a week later. Started working the same month I applied", "Interview Questions": "Describe an experience you have had to use time management during a shift"}, {"date": "13 Sept 2016", "title": "Network Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health (Fort Myers, FL) in Aug 2016", "Interview Descriptions": "The recruiter screen was great.  When I had the phone interview all the questions were about how much I had worked with Cisco.  The job description had nothing to do with Cisco though.  It was a little confusing, but oh well.", "Interview Questions": "Cisco Cisco Cisco"}, {"date": "26 Jul 2016", "title": "Resident RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health (Fort Myers, FL) in Jul 2016", "Interview Descriptions": "Applied online, HR called a few days later, set up face to face interview with intern development specialist. Mostly all behavioral based questions. If you pass the initial interview, they refer you to a department manager based off of your clinical experience, interests, and what positions are needed at the time. HR called again to set up interview with department manager. Met with nurse manager of specific unit, questions were more about experience and personality. If you pass the second face to face interview, HR will call a few days later with offer and pay details. Process was about two weeks.", "Interview Questions": "A  time when you dealt with a difficult patient."}, {"date": "2 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health (Fort Myers, FL) in Jun 2016", "Interview Descriptions": "First there is a human resources interview (face to face), which is then followed by interview with department director (face to face). The last step is a job offer made by another representative (over the phone, not face to face). After the phone conversation, in which the pay rate is specified, they email the offer.", "Interview Questions": "How do you manage various work requests at the same time? "}, {"date": "5 Apr 2016", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health (Fort Myers, FL) in Apr 2016", "Interview Descriptions": "It was wonderful.  A Supervisor called me to provide information about the Resident program.  She was kind, professional and answered all my questions.  She even followed up with an email that answered one of my questions in greater detail.  I was impressed by the quickness of these responses.  She told me what to expect in the interview process with both specialist and Nursing Directors.  It was so nice to have an idea on what to expect.  First class!!", "Interview Questions": "Critical thinking skill development"}], [{"date": "6 Jun 2016", "title": "Specialty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health (Fort Myers, FL) in Feb 2016", "Interview Descriptions": "Same interview scene for all LMHS.  You meet with a specialist for the intern program and then she/he moves you on to one of the departments of interest.  Then it is usually a two person panel with the same format of questions - situational.", "Interview Questions": "When was a time when you went above and beyond your duty?"}, {"date": "30 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health (Fort Myers, FL) in Feb 2016", "Interview Descriptions": "Fast and cenvenient. There is big need of nurses in the area however the pay is low and they need to work better on this. The workload is 5-6 patients un the day 6-7 at night", "Interview Questions": "Why lee health"}, {"date": "13 Apr 2016", "title": "Seasonal RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Lee Health (Asheville, NC) in Jan 2016", "Interview Descriptions": "Initially called by HR was asked several situational questions. \"Tell me about a time you went above and beyond \" yada yada yada. Then 2nd phone interview with unit director and another person on speaker phone. Asked a lot of practice questions that were difficult to answer not being familiar with their hospital policies and protocols and being on the phone. \"Explain how you would titrate nitroglycerin\"", "Interview Questions": "\"Tell me about a time you dealt with a difficult patient\""}, {"date": "8 Feb 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lee Health (Fort Myers, FL) in Nov 2015", "Interview Descriptions": "I received a call from a recruiter, a day was then set up for me to come in for an interview. I interviewed with the recruiter and was called within a few hours after the interview to go into the office that was hiring for a 1:1 interview.", "Interview Questions": "What experience do you have for the position you applied for?"}, {"date": "7 Jun 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lee Health (Fort Myers, FL) in Aug 2015", "Interview Descriptions": "As a new grad there’s a few interviews. One is pretty much a placement interviews with general questions in the form of “tell me of a time when this happened and what you did” the next one is an interview with the director of the unit and then once hired there’s a test that assesses basic nursing knowledge.", "Interview Questions": "Tel me of a time you solved a problem. "}, {"date": "31 Jul 2015", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health (Lee, FL)", "Interview Descriptions": "My interview was delayed by over an hour without any explanation as to why. After the first part of the interview I was told to drive across the town to meet with another top person in charge and when leaving the initial location, I was told to hurry up otherwise I may not make it in time for the next portion of the interview. I found that to be very inappropriate. However, the remainder of the interview was very pleasant and I was offered the position.", "Interview Questions": "General medical questions as well as background questions."}, {"date": "29 Aug 2015", "title": "Education and Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Lee Health (Fort Myers, FL) in Jun 2015", "Interview Descriptions": "Applied for the position on line.  There was a telephone interview to begin with, with 4 of the supervisors.  From there, I had a phone interview with the HR recruiter to discuss salary requirements.  Then a group interview was set up between myself and the supervisors.  Was told that the decision would be made within 10 days.  Decision was not made for 30 days past that..", "Interview Questions": "Name on time that you handled something badly and how you should have handled i"}, {"date": "22 Dec 2014", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Lee Health", "Interview Descriptions": "Wasted 1.5 hours talking to hiring manager who chose not to move forward and not tell me. Was able to find out through HR rep one week later.  They had this job listed for months.  I wasn't holding out hope, etc., but they called, so I decided to go through the process.  According to this hiring manager, HR person wouldn't get back to him, then she quit, then they hired someone else who as more on the ball.", "Interview Questions": "N/A"}, {"date": "15 Jul 2014", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health", "Interview Descriptions": "1. Apply Online\r\n2. Get a call from HR\r\n3. Interview with HR\r\n4. If HR likes you then you interview with the managers your will be working with on a daily basis.", "Interview Questions": "All the questions are behavioral questions. "}, {"date": "12 Jul 2014", "title": "Housekeeping PRN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lee Health (Fort Myers, FL) in Jul 2014", "Interview Descriptions": "Had an interview this past week at Healthpark, Reception greeted me & called to let them know I arrived. Woman I interviewed with came took me to her office. Interview was very comfortable not all stiff. Very nice woman , Felt at Ease. Don't be nervous like I was,,,really nice people !", "Interview Questions": "Really no Difficult questions, Just be yourself and be honest."}], [{"date": "14 Sept 2016", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health (Fort Myers, FL) in Jul 2014", "Interview Descriptions": "it was hard, you interview with a group of people so be prepared. If you a people person you will be fine. I really enjoy working for this lab, I see things that I normally would not ever see in my life. If your interested in science this is the place or you", "Interview Questions": "if you and a co-worker would have a confrontation what would you do?"}, {"date": "27 Jan 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lee Health (Fort Myers, FL) in Jul 2014", "Interview Descriptions": "First I was contacted by HR and went through and interview with HR. My application was then forwarded to potential unit directors for their review. I was contacted by one of them then I came in for an interview with the unit director as well as supervisor and some staff members.", "Interview Questions": "Tell me about a time you went above and beyond at your job!"}, {"date": "16 Apr 2014", "title": "IT Desktop Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Lee Health", "Interview Descriptions": "The interview process was painless and through. I received 1 Phone interview that was more like a conversation and get to know you rather than questions and answers.Then there were two in person interviews. Both Panel style. The overall experience was quite positive, and the experience was worth it as I am currently employed with LMHS", "Interview Questions": "What is your greatest weakness."}, {"date": "15 Oct 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lee Health (Fort Myers, FL) in Mar 2014", "Interview Descriptions": "Long process , to many different departments & buildings to travel to for hiring process. Intial interview was quit simple , then off to another building in Cape Coral for another interview. Waited a few days received offer then back to Cape Coral for 1:1 interview.", "Interview Questions": "Would you be willing to mandatory overtime if needed?"}, {"date": "13 Feb 2014", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lee Health (Fort Myers, FL)", "Interview Descriptions": "He was friendly and open. Interview was held at the entry way inside the hospital.", "Interview Questions": "N/A"}, {"date": "1 Oct 2013", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lee Health", "Interview Descriptions": "Interviewed with HR, then with various offices.", "Interview Questions": "There were no difficult or unexpected questions.  "}, {"date": "10 Jun 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Lee Health (Fort Myers, FL) in Aug 2013", "Interview Descriptions": "Applied online, met with recruiter, interviewed with Director and Unit Manager.  Easy.  Once offered a position, had skills testing and a great orientation to Epic computerized documenting.  Very comprehensive system for hiring.", "Interview Questions": "Why did I become a nurse?"}, {"date": "10 Jan 2018", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Lee Health (Cape Coral, FL) in Mar 2013", "Interview Descriptions": "Initial interview was with HR recruiter. The second interview was two parts. First with the Director of Care Management and then 6 people from the department joined and all asked standard questions from a list.", "Interview Questions": "Describe a situation when a patient was unhappy and your actions to resolve the situation."}, {"date": "26 Apr 2014", "title": "IT Support Analyst I and II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Lee Health (Fort Myers, FL) in Feb 2013", "Interview Descriptions": "Initially received phone call from HR manager for IS.  After asking if I was interested,  she immediately discussed the pay range.  As someone with Healthcare IT experience and internal referrals, I knew where I would grade out on the starting wage range.  In two subsequent phone calls and one meeting later, she consistently kept lowering the starting wage from our previous conversations...every time!  In working for several Fortune 500 companies, I have never seen this type of wage compression initiated by an HR manager.  Her demands for starting pay eventually went into the teens and I had to spar with her over my value.  I believe that was the right thing to do,  since a few days later I was offered a Senior Analyst position with a larger healthcare company at twice the final offer of LMHS.   \r\n\r\nThe interview process with the IT staff was pleasant enough, panel style.  Obligatory panel of IT people, some who took it seriously, others just typing or checking email on their laptops after they asked you a question.", "Interview Questions": "no difficult questions were asked.  Much talk about how hard everyone worked...."}, {"date": "7 Apr 2013", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Lee Health (Fort Myers, FL) in Dec 2012", "Interview Descriptions": "HR assistant contacted me to set appointment and offered helpful information about finding the building. Met with the Senior HR person for initial interview and discovered several minutes into the interview that the position had changed from initial post. Questions were as expected, but the portfolio I had brought in was different than what I would have brought had I known new direction of the position. However, the HR person was very responsive and I was brought back for a second interview. My research and preparation for second interview followed the position as it had been described to me in first interview. In my interview with the hiring manager, I quickly learned that the position had changed again, so my research was not helpful in the interview.", "Interview Questions": "What was the most difficult situation you had with a client and how did you manage it?"}], [{"date": "10 Nov 2015", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lee Health (Fort Myers, FL) in Aug 2012", "Interview Descriptions": "I had 3 interviews total which led to being hired.  My first interview was by phone.  I scheduled a time to go into the employment location to set up my actual interview with the practice that was hiring at that time.  I finally had the 3rd interview which led to being hired.  Because of my work ethic, I ended up working side by side with one of the busiest and best doctors in the practice.", "Interview Questions": "What makes you a good Medical Assistant?"}, {"date": "6 Jan 2016", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Lee Health (Cape Coral, FL) in Jun 2012", "Interview Descriptions": "Interview process was lengthy and unprofessional.  They promise you perks and then when you are hired on they yank them.  They allow upper management to harass and stalk staff but have policies stating that doing that will result in termination.  None of this is given to those that apply, you find out once you start.  Three managers/directors that I worked under had no business managing staff, much less a herd of cattle.  Good ole boy system at it's finest.  I honestly thought that there wouldn't be any of this in a hospital system but found out different.", "Interview Questions": "If I had a social media account.  Only administration is allowed to have them apparently."}, {"date": "10 Oct 2015", "title": "ARNP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lee Health (Fort Myers, FL) in Jun 2012", "Interview Descriptions": "Hard to finally get to interview stage. Like an \"iron wall\" to get into the system. Possibly because when I started applying I was inexperienced. Sometimes  have to know someone to get noticed and have their time. Start w/ phone interview w/ HR. If that is passed then you interview with the hiring department/entity for which you are applying", "Interview Questions": "Tell me about a time when you didn't agree with your physician"}, {"date": "21 May 2015", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Lee Health (North Fort Myers, FL) in Apr 2011", "Interview Descriptions": "Nothing much, all you need is common sense, simple question about your past job, and why you want to work for them. Bring your a game, but please stay away from golf cost hospital, they are mean, choose another hospital there's 3.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "22 Mar 2014", "title": "Operating Room Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Lee Health (Fort Myers, FL) in Apr 2010", "Interview Descriptions": "Applied online and was called next day for interview. Interviewed one day later with 3 people, the director, the supervisor, and the computer program administrator.  Helpful that I had a lot of medical terminology experience and that I was also not intimidated by physicians.", "Interview Questions": "Of course the what is your weakness.  Also, describe a time when you handled an upset customer."}]]