[[{"date": "31 May 2023", "title": "Program Operations Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Open Philanthropy Project", "Interview Descriptions": "There were two rounds of tests and seven interviews. I received compensation for the time spent doing the tests. Some of the interviews were with a panel, and some with individuals. There was some overlap in the interviews and the same questions were asked multiple times.", "Interview Questions": "If you could ask the CEO's of Open Phil 2-3 questions, what would those questions be?"}, {"date": "29 Mar 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Open Philanthropy Project", "Interview Descriptions": "Remarkably well thought out, and communicated. Probably the most outstandingly transparent experience, with questions answered with brevity. The compensation for time invested was such an equitable tactic, wish every potential employer did this. It was the first prospect that gave me tangible feedback when I didn't get the offer, which was appreciated.", "Interview Questions": "The questions force you to think through a problem analytically, akin to a strategic consulting scenario. Multiple videos and content is provided as a guide, and their recruitment team is always happy to answer clarifying questions."}, {"date": "19 May 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Philanthropy Project in Mar 2023", "Interview Descriptions": "2 Work tests, and then some interviews. Work tests are related to the work you should be doing in the job. You should get about a week to do it.", "Interview Questions": "I did not get to the interview stage"}, {"date": "19 May 2023", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Open Philanthropy Project (San Francisco, CA) in Mar 2023", "Interview Descriptions": "Work sample where you evaluate a grant proposal and estimate it's cost-effectiveness, and state whether you'd fund it, and a short behavioral interview. Everyone was extremely nice and pleasant to work with.", "Interview Questions": "Evaluate a given proposal, say whether you'd fund it and why"}, {"date": "15 Feb 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Open Philanthropy Project", "Interview Descriptions": "2 rounds of work tests that follow the loose research process for a prioritization associate, followed by an interview. The interview was casual with a decent focus on cultural fit. The other portion of the interview was related to reviewing your work tests. No \"gotchyas\", just looking to understand your thought process.", "Interview Questions": "What is one area you would deprioritize that we current focus on?"}, {"date": "15 Dec 2022", "title": "Business Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Open Philanthropy Project (Remote)", "Interview Descriptions": "Initial screening call followed by a paid work exercise. The whole process is very transparent and laid out from the start. It is very clear that Open Philanthropy's approach to hiring rounds is thorough and highly principled, and that they prioritize competency and judgement over prior experience.", "Interview Questions": "Can you describe your understanding of how Open Philanthropy functions?"}, {"date": "20 Oct 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Open Philanthropy Project", "Interview Descriptions": "Hiring process is as described on website: submit resume, complete paid sample task(s), and interview with HR. The honorarium was generous for the tasks performed. The HR interviewer did not ask any questions about my past work experience--only questions that assessed mission fit and exposure to the effective altruism community.", "Interview Questions": "What is one critique of effective altruism? What opportunities would you be passing up if you took this role?"}, {"date": "27 Sept 2022", "title": "Grants Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Open Philanthropy Project in Sept 2022", "Interview Descriptions": "I can confirm that the process OpenPhil states on their website is accurate (Screen, 1-3 paid work tests -- in my case two, a remote interview, an \"interview day\" consisting of 3-4 30 to 60-minute panel or solo interviews, reference checks, and decision) and that their description of \"unusually demanding\" is apt. Of note, I had an additional 30 minute interview before the \"interview day\" after the first remote interview, and my references were checked before my \"interview day\" to aid in the speed of their decision. My experience took 4 months, with long periods of silence (up to 3 weeks, including unanswered emails to my recruiter and the shared \"jobs\" inbox) and frequent promises throughout of \"we'll update you tomorrow/next week/etc.\" unfulfilled.  When I informed them of a competing interview sequence I was finishing, they asked me to keep them updated so they could move quickly if necessary. After my final \"interview day\", I received a job offer from the competing organization (Tuesday). I immediately informed my recruiter at OpenPhil that I had received an offer and needed to provide an answer to them by COB on Friday. I received no response until the following Monday, declining to offer me the role and stating that they hoped their delay in responding didn't impact my decision on Friday \"too terribly.\"", "Interview Questions": "What is a belief you have about the world that may be controversial amongst your peer group?"}, {"date": "28 Mar 2023", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Philanthropy Project in Jul 2022", "Interview Descriptions": "3 separate work tests simulating activities from the job and a half day of interviews with various members of the team. Open Philanthropy had very clear communication throughout the interview process and stayed true to the timeline they communicated to me, very respectful throughout the process.", "Interview Questions": "What do you think Open Philanthropy should do differently?"}, {"date": "24 May 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Open Philanthropy Project", "Interview Descriptions": "Very structured process with visibility across the multiple steps. After reviewing your resume, they invite you to work tests, which they compensate you for the time spent. Their instructions are extremely clear.", "Interview Questions": "Provide a BEPOC calculation of the impact of a possible grant"}], [{"date": "29 Mar 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Open Philanthropy Project in Apr 2022", "Interview Descriptions": "There were two work trial as a part of the Program Officer interview process: Work trail #1 was a strong interest write-up of a potential grant and took ~5 hours. Work trial #2 was a strategy proposal for what grants I would make in my first year as a program officer and took ~8 hours.", "Interview Questions": "N/A"}, {"date": "14 Jan 2022", "title": "Grants Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Open Philanthropy Project", "Interview Descriptions": "There were  2 work assignments and once you pass those you go on to meet with HR. From there, they decide if you should go to the next round to meet the hiring manager. I found this process a lot different compared to other companies since HR sets up an on-camera Zoom meeting. It seems like they don't move you forward based on your qualifications but more on their personal opinion of you. They didn't really touch on much of my education or experience and I didn't feel like they really were interested in getting to know me. All of the questions were very basic  HR screening-type questions. \n\nI did well on both of the work assignments and I have a lot of grants experience with other major nonprofits but received no feedback as to why I didn't move forward to interviewing with the hiring manager. Seemed very odd and made me believe there were other reasons I wasn't moved forward. If that's the case, it was probably for the best.", "Interview Questions": "Why did you apply for this role?"}, {"date": "23 Feb 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Open Philanthropy Project in Jan 2019", "Interview Descriptions": "There were several rounds, including work tasks that took up to 8 hours and interviews, all of which was compensated well for time. It took several months altogether. I found it very challenging but also thought it reflected the role quite well.", "Interview Questions": "Describe an area of academic research you know well."}, {"date": "11 Dec 2018", "title": "Operations Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Philanthropy Project", "Interview Descriptions": "I had a really pleasant interview experience with Open Philanthropy. The process can be a little slow as they have two take-home work projects after the phone screen and before the onsite, but they kept me updated throughout and do ensure that the time spent on the assignments isn't a hardship. Honestly, I think it's cool that they want to see an example of a candidate's work before moving to the next step, and think it's a good way for the candidate to evaluate their own interest in the work. \r\n\r\nI don't think it was a particularly difficult interview process, but as for any nonprofit/mission driven company, you'll want to be sure you can speak intelligently about the company mission and your interest in it.", "Interview Questions": "What interests you about working for Open Philanthropy?"}, {"date": "28 Jun 2018", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Open Philanthropy Project in Jun 2018", "Interview Descriptions": "This was a pretty long and complex process, but it's because they had a specific set of skills they were looking for in their research analysts. Rather than traditional interviews, they had applicant do tasks that were more similar to the actual job. The different tasks took several hours each, with longer ones later in the process. The organization provided very generous honorariums to applicants for the time the tasks took (I found them interesting!). I was a semi-finalist, but ultimately not given a full-time offer (but was still given compensation for the tasks). I was impressed by the signs of good faith and level of investment in applicants. If I had received an invite for a 2-3 month trial at their office, and not gotten a full-time offer, I would have received a generous severance package, for example. It was a lengthy process but I did not feel jerked around, and there was a very high level of respect.", "Interview Questions": "N/A. But you would be interested in this kind of work if you love pondering moral philosophy and quantitative data."}, {"date": "27 Feb 2019", "title": "Operations Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Open Philanthropy Project (San Francisco, CA) in Apr 2017", "Interview Descriptions": "The interview process was very lengthy and not clearly communicated across the recruiting team. There is an initial phone interview before a few assessments, some of which are compensated. At one stage, I received a rejection email, but was invited to interview in person about a week after, which I found to be bizarre. At the in-person interview, some of the staff seemed disengaged or a little distant or disingenuous. The workplace was nice but uncomfortably quiet, and each interviewer continued to address this. In the end, I received a basic email stating I was not qualified for the position, which I found strange as I was interviewed up to the final round before being told this. The overall process was awkward.", "Interview Questions": "What are your career goals and how does it align to this position?"}]]