[[{"date": "4 Mar 2022", "title": "Warehouse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Home Depot Foundation", "Interview Descriptions": "The interview is straight forward and they ask basic questions about what youve done. They do drug test if they see you might have to opportunity to get a job.", "Interview Questions": "What did you experience at your last jon?"}, {"date": "14 Oct 2021", "title": "Cashier Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Home Depot Foundation (Pensacola, FL) in Oct 2021", "Interview Descriptions": "They asked basic customer service questions, what my experience was, how long had I had I been working in customer service, etc. I declined the offer after finding other work.", "Interview Questions": "How would you handle an escalated customer."}, {"date": "8 Jul 2019", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Home Depot Foundation (Coconut Grove, FL)", "Interview Descriptions": "Applied online, interviewed in person and had a follow-up interview. The follow-up interview was quicker than the previous interview. Got to go to an orientation with other cashiers before the first day and then training before officially starting at a register.", "Interview Questions": "What was a difficulty you encountered at work and how did you handle it?"}, {"date": "30 May 2021", "title": "Office Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Home Depot Foundation (Las Vegas, NV) in Jan 2018", "Interview Descriptions": "Standard type of interview nothing special or exciting nothing .. no extra preparation is necessary .  Just be calm ands as always just be yourself and you will be fine", "Interview Questions": "What is my biggest strength"}, {"date": "20 Dec 2015", "title": "MET Associate Night Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Home Depot Foundation (Irvine, CA) in Dec 2014", "Interview Descriptions": "First was a phone interview outlining job and matching qualifications. Next was in interv daytimemanager who asked a company generated set of qustions and he wrote down my responses. The answers were scored and the highest scoring applicant got another interview with the direct  and  supervisor. After that there was a drug test and paperwork. Then i was hired", "Interview Questions": "Name a major obstacle or problem at your previous job and how did you successfully handle it?"}, {"date": "22 Nov 2015", "title": "Head Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Home Depot Foundation in Aug 2013", "Interview Descriptions": "I filled out app online and received a call back the next week. It took a week to get everything done. You sit with the manager and the department supervisor you are going to work in", "Interview Questions": "name a time you had to lead a project. How did you make sure it was completed on time?"}], [], []]