[[{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Toxic workplace", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jan 2022", "job_title": "Senior Data Scientist in Singapore", "duration": "N/A", "pros": "- Salary is good\r\n- Colleagues are good (managers not included)", "cons": "The management don't treat you as equal, you are just a tool to make things done. To make things worse, they had the wrong idea about data science, plus they have their Finance ego which they think they are awesome. This combination makes working so hard, you won't get recognized doing the right thing, or you need to spend lots of time persuade them to accept the right way. \r\n\r\nBased on this, your work won't easily get recognized, to the extend, you. The management just don't respect your craft, to the extend, you. \r\n\r\nThey had big plans, but they don't recognize the scale of the project, hence no proper resource planning, time planning. You end up doing things alone in a tight schedule to meet ridiculous deadline, you need to make sacrifice and compromise, and in the end, you won't get recognized. \r\n\r\nIf you see a problem and wants to do something about it, such as build something to facilitate future work, you also won't get recognized and will be treated as useless. The management don't have the vision. \r\n\r\nEven the pay is good, you, as a data scientist, you won't improve your skill very much, you gradually lose touch with what is going on out there. \r\n\r\nIt is a small company, but the hierarchy is not necessarily tall. Everyone, and everything is run by CEO himself, and the management are voice pipes. This makes things very slow. \r\n\r\nCareer wise, there is no 1-on-1 session between your boss, or if there is, it will be useless, as your boss doesn't know anything about your skill. There is also no career progression as well. \r\n\r\nWork life balance, well, during working hours, your time and energy is wasted on dealing with useless matters, they also expect to see the result, so you need to work on your own time to delivery, then explain your work to them later."}], []]