[[{"date": "8 Mar 2023", "title": "Outreach Voulenteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CentraState Healthcare System", "Interview Descriptions": "I went in and they basically asked me the normal questions that would be asked on an an interview except they were healthcare oriented. Nothing elase really meant to add", "Interview Questions": "why do you want to work with us"}, {"date": "22 Apr 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at CentraState Healthcare System (Freehold, NJ) in Apr 2022", "Interview Descriptions": "HR was very helpful when describing the job benefits, certification requirements and commitment years required by contract. The interview felt very comfortable and HR helped me navigate what unit I may be best suited for.", "Interview Questions": "What interests you in working for Centrastate?"}, {"date": "2 Jun 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraState Healthcare System (Freehold, NJ) in May 2021", "Interview Descriptions": "It was a virtual phone interview with Human Resources. Next step was interview with department specific manager which was in-person at the ambulatory care center. The interview lasted approximately 30 minutes", "Interview Questions": "Why do you want to work here? Tell me about yourself. "}, {"date": "7 Apr 2022", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at CentraState Healthcare System (Freehold, NY) in Mar 2021", "Interview Descriptions": "It was fine, it was a one on one but nothing too scary. It was very friendly. Manager was very nice. Hired quickly because of my resume. It was during COVID so you had to be aware that these kinds of work places got hit with it bad.", "Interview Questions": "How did you hear about us?"}, {"date": "13 May 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraState Healthcare System (Freehold, NJ) in Mar 2021", "Interview Descriptions": "Overall, pretty good interview process. Felt very comfortable and at ease. Interview process consisted of 3 separate meetings, consisting in about 30 minutes of time for each times. It was a pleasant experience.", "Interview Questions": "Employment history and reason for leaving current job."}, {"date": "3 Jan 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CentraState Healthcare System in Dec 2020", "Interview Descriptions": "First these was a screening phone call with HR. Afterwards there is a brief HR interview and then an interview with the unit manager. All the questions were very straight forward and I got the call offering me the job 15 minutes after meeting with the manager.", "Interview Questions": "How do you stay organized?"}, {"date": "14 Sept 2020", "title": "Manager Facilities Management – Construction Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraState Healthcare System (Freehold, NJ) in Aug 2020", "Interview Descriptions": "Applied online and resume was uploaded. Requirement to take personality quiz.  After completing was contacted  for a phone screening that went well and then and then was asked to submit references along with signing forms for background check to move on to next step for in person interview. Followed up with email once all requested information was sent but never received any response from CentraState. Sent follow up email at a later date and no response.", "Interview Questions": "Asked If I was comfortable working in a hospital environment with current covid-19 situation."}, {"date": "14 Dec 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at CentraState Healthcare System", "Interview Descriptions": "quick and comfortable. Felt like having a normal conversation. they are very good about placing you in the right place. you apply online, and in a few days to a week you receive a call with someone who schedules the interview. Once the interview has been completed, you do a personality quiz online and complete the background check form among other things.", "Interview Questions": "What do you enjoy about bing a CNA"}, {"date": "25 Jul 2019", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CentraState Healthcare System", "Interview Descriptions": "Very easy process got called within a week of applying did an interview and started right away . Great experience to. Nice place to work at for then. Interview was simple with one person so that made things less nerve wrecking", "Interview Questions": "Name a time when you helped out "}, {"date": "25 Jul 2019", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CentraState Healthcare System (Freehold, NJ) in Jul 2019", "Interview Descriptions": "2 interviews. One with HR then nursing manager. I believe that this opportunity is a good one. It is a small community hospital, however does feel home-y. Would consider this hospital.", "Interview Questions": "What makes nursing compassion successful?"}], [{"date": "1 Aug 2019", "title": "Material Handler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CentraState Healthcare System (West Freehold, NJ) in Jun 2019", "Interview Descriptions": "I had to submit an application in online before anything else. I was then contacted about coming in for a couple interviews. There were two Interviews after that. I was hired right after the second one. They were all pretty straight forward questions.", "Interview Questions": "Whether or not I felt comfortable with the requirements of the job"}, {"date": "22 Apr 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CentraState Healthcare System (Freehold, NJ) in Jan 2019", "Interview Descriptions": "Informal, relaxed, quick, no technical questions more focused on career goals. Minimal opportunities to respond or stand-out by offering input of positive points of my resume', past work and school special accomplishments.", "Interview Questions": "No detectable set structure to the questions to indicate a formal line of questions."}, {"date": "15 Jun 2019", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CentraState Healthcare System (Freehold, NJ) in Apr 2018", "Interview Descriptions": "The interview process was easy through HR and the manager of the unit as well. The process was easy through the online application process as well. I was offered a few jobs pertaining to my resume and skill set. An assessment was done to explore whether I was the right candidate for the job.", "Interview Questions": "How are you equipped for this job?"}, {"date": "28 Apr 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at CentraState Healthcare System (Freehold, NJ) in Apr 2018", "Interview Descriptions": "My interview process was a good experience.  I knew what position  I wanted and stated why when asked.  I currently hold the CNA and CHHA designations.", "Interview Questions": "N/A"}, {"date": "2 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraState Healthcare System (Freehold, NJ) in Aug 2017", "Interview Descriptions": "It is very professional. The hospital is very large, I got lost trying to find the right building to go to. They were very good in explaining the expectations of the postion", "Interview Questions": "Salary Range and where I would like to be. How I handle high volume situations on a daily basis. How I am able to work with patients. "}, {"date": "5 Jun 2017", "title": "Pct Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at CentraState Healthcare System in Jan 2017", "Interview Descriptions": "Really nice, the nurse manager who interviewed me seemed very genuine & like he just wanted to get a feel for who I was. He seemed very relaxed & bought me a water.  The interview was like a big conversation, it was pretty long.", "Interview Questions": "What are your future aspirations?"}, {"date": "21 Sept 2016", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at CentraState Healthcare System (Freehold, NJ) in Jul 2016", "Interview Descriptions": "You will first have a phone interview by someone who has no clue about the skills and experience you have on your resume. The phone screen-er I had previously worked as a server at a local restaurant and now this person in looking at my extensive Financial skill set  and Wall-Street background. Then, an in-person interview was set up at a mutual date and time. So now you go through a lot of money, time and preparation to be professional and at your best. I show up 15 minutes early and am greeted 15 minutes late, I guess they feel my time is worthless. I asked at the end of the interview if they would be getting back to me as I wanted to know either way if I was selected or not. They said yes absolutely within a week they would and let me know. Well, weeks later nothing even after sending thank you emails, nothing at all. Not an email, not a phone call, nothing. I'm glad I didn't get the job there as they treat people poorly. There are a lot better companies to work for so don't bother with this one.", "Interview Questions": "What would your last manager say about you and why."}, {"date": "22 Mar 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CentraState Healthcare System", "Interview Descriptions": "I was supposed to meet with the women who had conducted my phone interview, but she was absent on the day I was scheduled to come in so I met with someone from HR. She was very friendly and welcoming, but unable to answer many of my questions. The interview lasted about 30minuets and consisted of  a few behavioral based questions.", "Interview Questions": "What bothers you about people?"}, {"date": "11 Jun 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CentraState Healthcare System (Freehold, NJ)", "Interview Descriptions": "Arrived at the designated office prior to the appointed time. Was given several more forms to complete including a background check authorization. When the meeting was about to start the interview person I was to meet with was called away and I needed to follow as we talked.\r\n\r\nEnded up having the HR portion in a open atrium.Think that went well despite the unusual place. I even was carrying the background check forms with me it was so rushed and was told that it didn't matter. That's why I didn't check the background check box under other below.\r\n\r\nThen taken to meet the hiring manager, asked standard questions and specific experience that I answered truthfully I did not have and also not on the position description, Seemed distracted and was a very short conversation.Seemed like there was already a person in mind, maybe internal,but they needed to follow the process.anyway,\r\n\r\nThis entire process could have been done by a phone interview instead of taking a day off.", "Interview Questions": "How did you get into this industry?\r\nStandard behavioral questions are online applications.\r\n\r\nDo you have any questions for me?"}], [{"date": "6 Oct 2015", "title": "CPT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at CentraState Healthcare System (Freehold, NJ) in Oct 2013", "Interview Descriptions": "On the spot questions about prior experience and knowledge of the industry. Manager wanted to know how you were as a coach other than just being in shape. Manager allowed for you to demonstrate how personable you can be at meeting new members.", "Interview Questions": "Memorize the orientation for new members."}, {"date": "22 Jan 2013", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at CentraState Healthcare System", "Interview Descriptions": "Generally, new hires come from MLT student rotations. I was an outside hire. Interviews are with the individual who will be your evaluator, but may not be on your shift/work area.", "Interview Questions": "None"}, {"date": "26 Feb 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CentraState Healthcare System in Jan 2013", "Interview Descriptions": "Met with HR, then with department director. My resume was reviewed and questions about my experience were answered. Then I was asked several challenge questions, such as can you tell me about a recent challenge you were faced with, and how did you overcome it.", "Interview Questions": "Can you tell me about a time when you went above and beyond what was expected for a patient?"}]]