[[{"date": "25 Jun 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at La Sierra University", "Interview Descriptions": "Applied online and received an email a week later to schedule a virtual interview. Met with the director of the department and a couple staff. They each took turns to ask questions. Thought the interview went well but received an automated rejection email a week later.", "Interview Questions": "How do you handle stress?"}, {"date": "22 Jun 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at La Sierra University", "Interview Descriptions": "Interviewed me about my qualifications such as being able to perform desk work. Went very well and was a good experience. Worked multiple years and was able to balance school and worklife", "Interview Questions": "How well do you work in a team environment?"}, {"date": "18 Apr 2021", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at La Sierra University", "Interview Descriptions": "The interview was very easy and pleasant. They went over general questions. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "Tell me more about yourself"}, {"date": "16 Sept 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at La Sierra University (Riverside, CA)", "Interview Descriptions": "One interview. Straightforward process, they asked about previous experience. What kind of things I would contribute to the team, and asked about my best traits. \r\n\r\nAlso, asked some scenario questions. Example: What would you do if you had to deal with an angry parent?", "Interview Questions": "What would you contribute to the team? "}, {"date": "23 Jul 2019", "title": "Records Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at La Sierra University", "Interview Descriptions": "I applied online and then was called in to have an interview. I was asked basic interview questions and got a call back a few days later. I was able to start the following week.", "Interview Questions": "What are your strengths?"}, {"date": "16 Jul 2019", "title": "Psychology Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at La Sierra University", "Interview Descriptions": "There was no interview process for my specific position. I believe the employers looked at my grades and overall contribution to the psychology department. However, I was required to submit copies of my transcripts and psychology classes that I’ve taken both at the university and at other off campus locations", "Interview Questions": "What psychology classes have you taken at this school and other schools?"}, {"date": "8 Jan 2019", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at La Sierra University", "Interview Descriptions": "There was no interview. You just need to do good in your classes. They are very understanding people. Just be friendly to ask about the job. They are very open to new people", "Interview Questions": "There was no interview questions. "}, {"date": "11 Jul 2018", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at La Sierra University (Riverside, CA) in Jun 2018", "Interview Descriptions": "Filled out an application and was contacted within a week. Had a group interview, with questions centered around my philosophy approaching the job, what I thought it would entail and what strengths I could bring. Less of traditional interview questions. Never received a call back so I guess the policy is only to inform individuals if they were selected for the job.", "Interview Questions": "What is the advisor's role in the school's retention rate?"}, {"date": "4 Sept 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at La Sierra University (Riverside, CA) in Aug 2017", "Interview Descriptions": "In person, asked regular \"what would you do\" questions. What are your biggest strengths/what's your biggest weakness.  Overall, it was an okay process and got a response fairly quickly. I was interviewed by 4 people and all of them asked me different questions.", "Interview Questions": "What's your biggest strength? "}, {"date": "13 May 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at La Sierra University (Riverside, CA)", "Interview Descriptions": "Initial phone interview, more in depth questions than I usually get. On campus interview, met with 4 people. The person who coordinated the day did it in a very organized manner.", "Interview Questions": "What would I plan to get done in my first 30 days?"}], [{"date": "20 Apr 2015", "title": "Student IT Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at La Sierra University (Riverside, CA) in Jul 2014", "Interview Descriptions": "They have and online application that you fill to be contacted for the position. If you they liked your resume they would then contact you for a meeting. The meeting had a series of questions. These questions were hardware related with both osx and windows operating systems. After you answered the questions, you would be contacted with further instructions.", "Interview Questions": "What is the best way to check if a computer mother board is bad?"}]]