[[{"date": "19 Mar 2023", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SUNY", "Interview Descriptions": "A fluent process in which everything is efficient til the final decision. Kind interviewers make interviewees comfortable to demonstrate their capabilities. The notification didn't take too long for interviewees like waiting forever.", "Interview Questions": "How does your interest match our department? What contributions do you expect to bring?"}, {"date": "10 Jun 2022", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at SUNY", "Interview Descriptions": "Chief of staff and two Directors participated in a zoom interview with me. All three reviewed my resume, asked questions, and provided insight into the position and job responsibility. They told me about their roles and responsibilities, asked about myself and work history and how I would handle the role available.", "Interview Questions": "They asked why I wanted to leave my current company and also where I saw myself in five years."}, {"date": "19 Apr 2023", "title": "Summer Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at SUNY (Albany, NY) in Jun 2022", "Interview Descriptions": "The interview process was virtual. The interviewer was very nice and professional. The encounter only lasted around 20 minutes. An offer was made within a few days after the interview.", "Interview Questions": "What was my favorite subject in law school and why?"}, {"date": "23 Jun 2022", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SUNY (Albany, NY) in Jun 2022", "Interview Descriptions": "There were two interviews- both lasted around 30 mins. They asked technical questions  and basic interview questions. Everyone was very nice. They were prompt to respond after the interview process.", "Interview Questions": "What would you like to get from this position? "}, {"date": "17 Mar 2021", "title": "Executive Admin. Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SUNY (New York, NY) in Feb 2021", "Interview Descriptions": "Simple. Clear. Felt like everyone had different views of the job description. I liked my interview team of 3 women. They seemed very well prepared. It's hard when I've been forced out of a career and trying to plant myself into a new one after being out of work for a year.", "Interview Questions": "How do you deal with constructive criticism?"}, {"date": "8 Jan 2020", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at SUNY", "Interview Descriptions": "usual questions on teaching and research agenda, statement and vision, asked the presentation on research/teaching (it's stated in advance) go through meeting some students and staff. campus tour, meet the faculty, see facilities", "Interview Questions": "how would you handle difficult situation in class"}, {"date": "1 Feb 2022", "title": "Benefits Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at SUNY (Syracuse, NY) in Jan 2020", "Interview Descriptions": "Applied online and called in for in person interview with Manager and assistant.  Phone interview with Manager and VP for HR.  Recruiter assisted and offered position, plus provided on-boarding information.", "Interview Questions": "What qualifications will assist me with position?"}, {"date": "19 Apr 2019", "title": "Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SUNY (New York, NY)", "Interview Descriptions": "It was a panel of 3+ employees and I was in the hot seat. It was nerve-wracking, but got progressively better throughout. I submitted my app online, but didn't receive a call until a month or so later to see if I was still interested. Everything from there moved very quickly and smoothly.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "7 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at SUNY", "Interview Descriptions": "There wasn't a hiring process because the professor chose candidates that they felt were going to benefit their research. They chose various students from different backgrounds with various strengths and weaknesses", "Interview Questions": "Would you like to be a part of the research?"}, {"date": "28 Aug 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at SUNY in Mar 2018", "Interview Descriptions": "It was essentially just sitting in a room with my potential supervisor and one of their employees. They asked basic questions about my experience and that was essentially the whole experience during the process of my interview at SUNY.", "Interview Questions": "If you were a tree, what would you be?"}], [{"date": "23 Nov 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at SUNY (New Paltz, NY) in Aug 2017", "Interview Descriptions": "They will email you once your resume gets shortlisted and then you will be asked to give a time slot for phone interview and in that they will mostly ask you regarding your background and once that is done they will call you for in person interview.", "Interview Questions": "Why did you apply for this position"}, {"date": "21 Jan 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at SUNY (Buffalo, NY) in Jul 2017", "Interview Descriptions": "Fairly easy interview, the questions were straightforward and were mainly about recruiting and finding different strategies to recruit. Additionally, the staff were very courteous although not very organized. I did not receive a detailed agenda of my interview until the day of so I did not know who I was going to meet.", "Interview Questions": "If a student came in at 5:00 pm as you were heading out of the office, what would you do?"}, {"date": "27 Jun 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SUNY (Syracuse, NY) in Apr 2017", "Interview Descriptions": "The first interview was with the committee via Skype.  This included a presentation to the committee which seemed a little backwards.  The second and third interviews were on campus with higher level leadership.", "Interview Questions": "How would you describe the population of students at OCC?"}, {"date": "17 Apr 2016", "title": "Admissions Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SUNY", "Interview Descriptions": "The phone interview was very straight to the point. I felt that the interviewer did not really try to get to know me, but instead just proceeded with a list of questions. There were about five people on the conference call interview", "Interview Questions": "Describe Buffalo State in three words"}, {"date": "17 Apr 2016", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SUNY in Feb 2016", "Interview Descriptions": "The process is great with many recruiters at one place, I feel like at mars waiting for someone to rescue me.Things are doing fine and they don't seem to have a sense of what is like being interviewed.", "Interview Questions": "N/A"}, {"date": "9 Sept 2017", "title": "Interview Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SUNY (Plattsburgh, NY) in Jan 2016", "Interview Descriptions": "Today, many companies have an involved interview process starting with screening interviews, which often take place on the phone, followed by in-person interviews, second interviews, and even third interviews. In addition to a hiring manager, you make meet with managers, employees, and other staff.", "Interview Questions": "What my desired salary was."}, {"date": "4 Jun 2015", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SUNY (Albany, NY)", "Interview Descriptions": "First they will give a phone screening, then set up a time for onsite interview. The onsite is a Group/ Panel interview. You'll have 4-5 people asking you questions. They all were nice, also good to work with too. You will get a call or email in a week about further steps, if selected.", "Interview Questions": "Basic technical questions, course-school related stuff, tried to know my interests so that they can give me a suitable project."}, {"date": "21 Jan 2015", "title": "Student Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at SUNY", "Interview Descriptions": "simple behaviour questions, previous work experience and everything about person.questions were straight forward and to the point and were general in nature. they basically needed someone with good communication skills", "Interview Questions": "N/A"}, {"date": "19 Sept 2018", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at SUNY in Aug 2014", "Interview Descriptions": "The interview was quick they just want to know about you . A short exam is given after the interview and a call is giving out later in the week.", "Interview Questions": "Tell me about yourself "}, {"date": "21 Jul 2015", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at SUNY (New Paltz, NY) in May 2014", "Interview Descriptions": "Two-step hiring process. Great questions were asked and the process went by very smoothly. I found out within about two weeks. It was an group/panel and while slightly intimidating, completely understandable why the process is what it is and I highly recommend leaving it this way.", "Interview Questions": "Describe one of the biggest challenges in this position."}], [{"date": "27 May 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at SUNY in Jan 2014", "Interview Descriptions": "Apply online for the interview process. The process has changed since these other interviews. You have to sit with the other candidates while doing a test of the work you will be doing. Basically to get to know your skills, it revolved around evaluating a company for its legibility to receive credit. Afterwards you go speak with other professionals around the office as they ask you the same questions.", "Interview Questions": "The process is very quick. on selection you are called for interview. an easy one."}, {"date": "31 Mar 2014", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SUNY (Purchase, NY) in Jan 2014", "Interview Descriptions": "Submit resume, cover letter and references into recruiting software system\r\n1. Search Committee phone interview\r\n2. second interview with search committee again, Vice President and Dean, Chief Librarian and reporting supervisor", "Interview Questions": "How would you handle a student with demanding parents?"}, {"date": "20 Sept 2013", "title": "Staff 'Programmer/Analyst' Interview - SUNY-ESF Campus Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SUNY (Syracuse, NY) in Aug 2013", "Interview Descriptions": "I found the position on GlassDoor ('Programmer/Analyst' was a catch-all category for technology-related staff positions), applied, and was contacted for an interview two weeks later!  I was startled by the speed at which the interview process moved, as my experience with academia has been that it is usually a snail's pace.\r\n\r\nThey were polite and clear about what the interview would entail.  It was a committee interview with four people, including staff from the unit and staff that the position would be likely to work with a lot.\r\n\r\nAt the interview, I was told up-front the nature of the position--it was a newly-created position, and they were still feeling out what it would be likely to entail.  They expected to learn more from their interview candidates, and there was a possibility of pulling the position in order to restructure if they found that their expectations were too far off-base.\r\n\r\nThe questions were excellent--fundamentally along the lines of the pat interview questions you're always told to practice, but structured so that they were useful and relevant to the specific position.  Questions such as 'What accomplishment are you proudest of?' and 'How would you begin developing a system and workflow for the core responsibilities of this position?' Rather than speaking directly about my resume, we talked about the likely requirements of the position and how I could match them with my skills and experience, including my experience with metadata schemas and what I could see the position would require based on the information they gave me, content management systems, and my comfort with coding and learning new programming languages and software.\r\n\r\nI was very pleased with the interview, and came away with a sense that I had learned as much about them and what they were looking for as they had about me.", "Interview Questions": "Describe how you would go about organizing the information system that this position will require."}, {"date": "25 Feb 2013", "title": "Software Development Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at SUNY", "Interview Descriptions": "searching for a software development position", "Interview Questions": "N/A"}, {"date": "14 Nov 2012", "title": "Student Assistant (Tutor) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at SUNY (Bronx, NY) in Sept 2012", "Interview Descriptions": "I became aware of the position from classmates who had worked in the same position. The interview/hiring process was pretty simple. I was asked what courses I intended to tutor. I had to bring a transcript as proof of having competency on those subjects.", "Interview Questions": "What is the main difficulty that students, who seek tutoring, have with the courses? "}, {"date": "1 Jul 2016", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at SUNY (New York, NY) in Jun 2012", "Interview Descriptions": "I had a series of interviews with several of the faculty.  Some were warm, but I could tell that there were departmental tensions lurking below the surface.  Faculty seemed strained and definitely hedged in their responses to my questions about the work environment.  The department is in a state of transition, and I'm sure political fault lines have sprung up as a result.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "21 Jan 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at SUNY (Purchase, NY) in Feb 2012", "Interview Descriptions": "I was interviewed by ten people from the search committee. Everyone was very nice and professional.I was interviewed by ten people from the search committee. Everyone was very nice and professional.", "Interview Questions": "N/A"}, {"date": "28 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at SUNY (Stony Brook, NY) in Jan 2012", "Interview Descriptions": "I talked to the grad student and the lead researcher about my schoolwork, major, and professional goals. It was all very straightforward. The lead researcher told me about her research and goals and asked me questions to see if I would be a good candidate for the job. I felt very comfortable throughout the whole interview.", "Interview Questions": "What are your goals after graduation?"}, {"date": "26 Aug 2010", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at SUNY (Delhi, NY) in May 2008", "Interview Descriptions": "I applied online through the SUNY Delhi website, included CV and cover letter. VERY important to make it apparent as to how you will benefit the college as well as what you will take on to lessen the load of current employees. While a resume' may document your experience, those of you taking a new adventure into academia need to do some research and become comfortable with the creation of a Curriculum Vitae. These include papers written, presentations, areas of expertise, assocation memberships; not limitedd to one page at all. \r\n\r\nAfter I applied, the wait was at least 6+weeks; while this job may be #1 in your head, the academic search committee moves much slower than the outside world. Remember that they are still teaching classes, etc while you are waiting for a response. I received an email to schedule a phone interview; their system was antiquated and used a speakerphone for the interview, so back and forth communication was clunky. I has three people in the room interviewing me. Basic questions.\r\n\r\nI then received an email to set up a campus visit and interview. Time scheduled was not near enough and portions were rushed. I was given a FULL campus tour and when in dress clothes in the summer, it made for a worn appearance later during my sample lecture. Lunch was scheduled and the entire department was present; though I was starving, I couldn't eat because I was being asked difficult questions that needed to be treated professionally.\r\n\r\nAfter lunch, I lectured and was cut off time-wise because they had run late on other parts of the interview. I was then 1:1 interviewed by the Division Dean, Human Resources, and the Provost. It was a whirlwind and exhausting because these were true interviews and not just chats. \r\n\r\nThe focus was what could I bring to SUNY Delhi, what was special about me, how would I make my mark on campus and professsionally. You are taking on a workload to ease their burden. You must love committee work and advising students. You are also very excited to take on more hours than the typical professor will somewhere else.", "Interview Questions": "How do you feel coming into an institution that looks to hire dynamic people ready to bring their background, education, and experience into play but the culture is full of colleagues resistant to change?"}, {"date": "2 Jun 2010", "title": "Desktop Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at SUNY (Buffalo, NY) in Apr 2008", "Interview Descriptions": "Panel interview with 1 on 1 with manager at the end.", "Interview Questions": "What are you strengths? "}]]