[[{"date": "27 May 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (New Delhi)", "Interview Descriptions": "Basic math/quantitative reasoning test, followed by a case interview. Conducted online. The math test was fairly standard and easy, although time management is very important. I found the case questions to be more vague than most similar places. Hard to provide specific solutions to non specific problems..", "Interview Questions": "Case interview based on scaling a school education improvement project"}, {"date": "13 Apr 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight (New Delhi)", "Interview Descriptions": "The interview process has 4-5 steps. The first is a fitment discussion, 2nd is a case interview, 3rd an interview with someone from the leadership and 4th an interview with team lead/director", "Interview Questions": "Why IDinsight? Understanding of largescale surveys, data quality"}, {"date": "2 Jun 2023", "title": "Associate Product Manager (APM) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (New Delhi) in Apr 2023", "Interview Descriptions": "Significantly slow process but seemed like good work culture. Application process started around Feb 2023, it took them months till mid march to get back to me for start of interview process. 1) Test: test was customized for basis of role after 1 week 2) First round: consisted of Tech. Case Study about Data on Demand product feature priority, use cases, designing product, and bit of behavior questions 1 week for getting back tp me, a scheduler to schedule next interview (which falls under next week, so 2 weeks now) 3) culture fit: very rigorous culture fit questions, asking about past experience and how I dealt with them on basis of different scenario again 1 week wait, then 1 week to schedule next round 4) case study: very informal round, meeting internal team members to understand about them and speak about myself then 1 week later Reference check: 3 reference, g-form mails are sent to them for taking feedback 2 weeks of suspense stating the decision making is taking time (they might be busy with other candidate, most likely), 1 week later Rejection. NOTE: after all this (which took 4 months from application, I was rejected because they gave the offer to someone else. Meaning that they do multiple reference check till giving any idea. )", "Interview Questions": "Why are you interested in this role? How would you build a product? How would you prioritize following lists of features? How would you resolve an issue during an argument?"}, {"date": "13 May 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (Nairobi)", "Interview Descriptions": "it was rigorous with several tests such as mathematical tests, interview sessions and written interview tests. Such an eye opener to the many interviews to come suppose i do not get to get through the next phase.", "Interview Questions": "To analyze a situation that was presented to me of a company and the impact its fertilizer has on farmers using it."}, {"date": "1 Apr 2022", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "#1) Introductions. One of the most important steps in the interview process just so happens to be the first. ...\r\n#2) Small Talk. After introductions are finished, it is a good idea conduct a bit of small talk with the candidate. ...\r\n#3) Information Gathering. ...\r\n#4) Question/Answer. ...\r\n#5) Wrapping Up.", "Interview Questions": "why do you want this job?"}, {"date": "26 Mar 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "They gave me a maths test before the first interview, which was pretty challenging. Similar to the GMAT or GRE maths questions. I ultimately didn't go through with it since I had received another offer", "Interview Questions": "Maths test with similar questions to GRE or GMAT"}, {"date": "31 May 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at IDinsight in Mar 2022", "Interview Descriptions": "All in all, it took them four months from when I applied to hearing the final outcome of my application, and I didn't even get to the final stage.\r\nQuantitative test is very difficult if you're not experienced with GMA format.\r\nInterview was a case study of an M&E project in Cambodia. The interviewer moved the interview last minute, and then was late, and sounded like they wer taking the interview in a noisy cafe. They were also clearly in a rush to finish and didn't give time for me to ask questions.\r\nWhen my application was unsuccessful, I asked for feedback but my email was ignored.\r\nA company that looks professional but really didn't meet the basic standards of respecting candidates' time or treating them with dignity.", "Interview Questions": "M&E questions about setting up a survey in Cambodia. Also asked some \"on the spot\" questions about reverse interest and ratios. Have a calculator ready."}, {"date": "11 Feb 2022", "title": "Junior Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "for a first-time interview, it was kind of rigid, especially for the coding interview. very tough coding questions for a junior role.  i will try my best next time. hoping the coding interviews arent this tough", "Interview Questions": "python coding Pentanacci number algorithm"}, {"date": "2 Feb 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at IDinsight", "Interview Descriptions": "There are 3 rounds after the screening process. The first  round is a quant test, the second is technical where you are given a case study, and the last one is HR.", "Interview Questions": "Why do you want to work with us?"}, {"date": "23 Mar 2022", "title": "Junior Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IDinsight in Feb 2022", "Interview Descriptions": "Very tough for a junior scientist role. The time allowed to complete the coding exercise is a big challenge. The interview involved a python coding exercise with several timed questions.", "Interview Questions": "A python script for data wrangling"}], [{"date": "11 Feb 2022", "title": "Junior Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (Redlands, CA) in Feb 2022", "Interview Descriptions": "was reached out by a recruiter. still waiting for feedback. But generally  it seems like they take long to get back or maybe that is just my experience.  I hope to get the chance to work with them. It seems to be a very interesting opportunity.", "Interview Questions": "expertise in python and r"}, {"date": "25 Jan 2022", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "Invited for a 1-hour video case interview. Interviewer was 20 minutes late and kept their video off but asked to keep mine on, which was a little awkward. They took the call from a noisy cafe, and so they would mute themselves when i was talking through the case. My experience with case interviews is that they are relatively interactive, and this set up really did not allow for that", "Interview Questions": "Define power in the context of an ag study"}, {"date": "7 Apr 2023", "title": "Interior Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at IDinsight (Bengaluru) in Jan 2022", "Interview Descriptions": "1-3 rounds with technical questions and total experience in the field. complete knowledge in designing and the number of softwares that i can use to design and render for residential and commercial properties", "Interview Questions": "why intrested in interior designing"}, {"date": "21 Dec 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IDinsight (New York, NY) in Nov 2021", "Interview Descriptions": "Extremely technical and quantitative-focused. Definitely have a calculator on hand and know how to do basic algebra. There is a practice case study element which is generally ok if you have had case study interview experience or consulting experience.", "Interview Questions": "Ratios and reverse interest calculation"}, {"date": "7 Oct 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "0. Math Assessment\n1. Technical interview with equestions on Impact evaluation methodologies.\n2. Coding Exercise and essay writing.\n3. Interview with manager in country office with your typical interview questions on motivation etc.", "Interview Questions": "How comfortable would you feel living somewhere rural for an extended period of time?"}, {"date": "16 Dec 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IDinsight in Sept 2021", "Interview Descriptions": "Steps:\n1) Fill in the application with CV\n2) Quantitative exam (29 questions in 1 hour)\n3) First interview - case study based\n4) Time writing test\n5) Second interview - behavioral and experience questions\n6) Reference check", "Interview Questions": "Why do you want to work in the social sector?\nHow does ID insight fit into your long term goals?\nWhat are your greatest strengths and weaknesses?\nQuestion on regression discontinuity.\n"}, {"date": "17 Sept 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (Nairobi) in Sept 2021", "Interview Descriptions": "I have had the first interview  and the written assessment.  I have greatly enjoyed the process and hope I'll be successful in the final interview. \nAfter the aptitude test, which comprises about 29 questions to be done in an hour, you will be invited for  a 1st interview.  During this interview, you will be given a case study, most probably on Monitoring and Evaluation.  Be prepared with reading on RCT's and other quasi experimental methods. The 2nd interview is a fit interview", "Interview Questions": "What is your ten year plan?"}, {"date": "13 Sept 2021", "title": "Account Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "It was an interesting Application process done online.\nYou are required to create an account to apply after which you login and you are asked to attach \nCV,resume.\nThey get back to let you know if you qualified. Or you didn't which helps one to know their stand\nThey as well encourage you to apply for future positions that will match your qualifications", "Interview Questions": "Didn't make it to the interview"}, {"date": "4 Jul 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "Two rounds in total. I applied online and was sent first round interview invite on Skype. First round interviewer asked questions on personal experience and background, which were fairly direct. Technical component tested knowledge of RCTs, math, statistics. Interviewer was friendly. Did not pass to second round.", "Interview Questions": "Tell me about (resume component)\r\nWalkthrough of RCT case study - what elements would you control for?"}, {"date": "18 Jun 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "Only got to the math assessment stage. Thought I did well but never heard back. When I contacted them I got an automated rejection email in a day. The Manager who had initially reached out was pretty rude.", "Interview Questions": "N/A"}], [{"date": "15 May 2021", "title": "Full-Stack Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IDinsight (New Delhi) in May 2021", "Interview Descriptions": "1. One Online Assessment of 2 hours(DSA, and other questions related to the profile)\r\n2. General Round to check some behavioral questions.\r\n3. Technical Round to test the technical knowledge and problem solving to approach a real problem", "Interview Questions": "Questions are technical and have nice depth. "}, {"date": "6 Dec 2021", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at IDinsight (Nairobi) in May 2021", "Interview Descriptions": "The interview process was very timely and precisely done. There were three rounds with different team members. The first round was more of an information session, with consequent ones conducted by staff that the role would closely work with.", "Interview Questions": "Scenarios and how I would approach solving these"}, {"date": "20 Apr 2021", "title": "Associate Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IDinsight", "Interview Descriptions": "The first step is a Mathmatic test which is tough. Followed by and Interview (technical) which was more technical to know skill on RCT, litterature review, research, etc.. Followed by another Interview to know personality, past experience etc\nand result", "Interview Questions": "If you should describe IDinsight's work to your parents how will you go?\nWhat professionalism means for you?\nDo you prefer off office work or in office? and why?"}, {"date": "19 Apr 2021", "title": "MBA Summer Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight in Apr 2021", "Interview Descriptions": "One hour-long interview which involved a 30-35 minute case on a theoretical project that is relevant to what the company does. The case tests your knowledge of basic statistical concepts as well as the stakeholders in the development space. The rest of the interview considered of fit questions centered around interests and long-term goals.", "Interview Questions": "Where do you see yourself in 5 years?\n\nWhy do you want to work for IDinsights? \n\nCan you tell us about a time when you had to manage a team? "}, {"date": "7 Mar 2021", "title": "Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IDinsight", "Interview Descriptions": "I submitted  my CV and cover letter online and was invited to interview 3 weeks later. The 1st interview was a GRE style math test, which I passed and was invited  for 2nd case interview 4 weeks later. 5 weeks later I was invited to 3rd interview.", "Interview Questions": "In 2nd interview, I discussed my cv and  career goals and was presented with several cases "}, {"date": "22 Feb 2021", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "There were 3 rounds, first was an assignment which I had to submit, then the behavioural round and then a technical round to ask for my skills for the job. They let me know that I did not fit their criteria properly over email. Good feedback.", "Interview Questions": "Asked about my skills related to the job"}, {"date": "18 Jan 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IDinsight", "Interview Descriptions": "CV and Resume application, then wrote the Maths assessment test. Still waiting on a response for test results - but assuming this means a declined application. The next step is supposed to be about two or so face-to-face interviews.", "Interview Questions": "Wrote the maths test - was similar to the GMAT"}, {"date": "8 Jan 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IDinsight (New Delhi)", "Interview Descriptions": "I applied online at the IDinsight office in New Delhi. The process took 2 months.\r\n\r\nFirst Round - Timed Math Assessment: Fairly standard questions of the type generally found on the GRE/GMAT.\r\n\r\nSecond Round - Case Interview: Was given an impact evaluation case study on the basis on which questions were asked. Unlike in management consulting cases, cross questioning is not necessarily required less though solid knowledge of impact evaluation methods is recommended.\r\n\r\nThird Round - Personality Interview: Probably the toughest round, very probing questions about background, motivation and fit.", "Interview Questions": "Explain a situation where you were able to change someone's mind."}, {"date": "14 Jan 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IDinsight in Dec 2020", "Interview Descriptions": "The entire process took approximately 3 months - something that was totally preventable and in their control. All-in-all, I think IDinsight staff is extremely insincere, and insensitive about the anxieties that goes through applicants' minds.  \r\n\r\nThe process begins with a detailed form about yourself, followed by a math test that lasts about an hour. After that, they have two interview rounds. The first interview is more technical - wherein you receive a few case studies that should not be difficult if you know about basic econometrics and RCTs (sampling, stratification, spillovers). They also ask you to solve two basic algebra questions towards the end as well. The second interview is behavioural and so far the weirdest one where they ask you a bunch of questions that I feel should have no bearing on your candidature. It is also clear that they have not changed their interview process in the five-six years of their existence. The questions are quite honestly, annoying, and unsettling. \r\n\r\nThe interviewers were quite honestly, disrespectful and rude. There is hardly any need for these kinds of interviews to be stress interviews  (they are on Skype and also, this is not a management position which requires you to test how we respond to stressful situations). The stress interview format does one thing and one thing only: it unsettles and unnerves you, reduces your confidence, makes you nervous. One of the interviewers argued with me over a statistical technique I use at my work nearly everyday - I am not sure whether it was an interview technique to pry into my behaviour, but it reflected badly on them because she was incorrect but almost petulantly insisted that she was correct.  At one point, an interviewer asked me about Stata commands I use (totally a wrong format.. the interview is verbal. If you want to test my coding skills, take a Stata test?) \r\n\r\nThe interviewers, I noticed, were also not at all aware about their own recruitment process but wanted to know what questions I have had (both their answers: \"good question, but I am not sure\"). At one point, one interviewer told me that she was not sure what the entire recruitment process is but she did know how it was three years ago. What should I do with this information and how is it relevant? Shouldn't somebody who is making huge decisions about candidates know what processes they are going through?\r\n\r\nIDinsight might think that their processes are standardised but they are not. A colleague of mine who similarly interviewed and ultimately got the offer had a kinder, more professional interviewer. If you aren't asking the same questions from all candidates, how are you hoping to judge how fit they are to the organisation? My conjecture is also that your previous experience and education has a sheepskin effect for IDinsight. You'll be at a significant advantage if you 1) went to a top school 2) worked for organisations that are universally known.\r\n\r\nThey also ask for references as a part of the recruitment process. References are a form that your referees fill which are again, very weird arbitrary questions that a referee should not reduce their reference to. I also understand that references are a part of an overall 'score' that they ultimately judge you on. References to me, although a significant part of the recruitment, should not be competitive. I have different referees, other candidates have different referees. You cannot compare mine against theirs. It is pointless and unfair. It is also a waste of time if you are not going to recruit most of the people you are asking references from. \r\n\r\nI really regret the time and effort that went into a fruitless recruitment process. Honestly, I would be upset at the lengthy, circuitous process it took had I received the offer. It also is terribly upsetting to know from an insider that there isn't much deliberation in the recruitment process either - just some matching of scores from each round. It should not take three months.", "Interview Questions": "First interview is almost entirely technical which I have detailed above.\r\n\r\nSecond interview is behavioural: here are some of the questions\r\n\r\n1. When was the last time you received negative feedback\r\n2. When was the last time you gave feedback to somebody \r\n3. What was your most adventurous experience"}, {"date": "16 Dec 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "Online submission of the form then they send the online aptitude test link, which is pretty easy. After that they don't tell you about your results. There is no transparency followed in the selection process.", "Interview Questions": "Normal aptitude questions"}], [{"date": "3 Feb 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (New Delhi) in Dec 2020", "Interview Descriptions": "1st round had basic aptitude based questions\r\n2nd round consisted of  question on  statistics and  case study regarding impact evaluation\r\n3rd round has  behavior based questions\r\n4th is the written test which has to be submited within 2 hr", "Interview Questions": "Questions on RCTs and impact evaluation and monitoring "}, {"date": "23 Aug 2021", "title": "Financial Planning & Analysis Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at IDinsight (New Delhi) in Dec 2020", "Interview Descriptions": "It was a quick interview process, although the communication of either acceptance or rejection was quite delayed and was informed only after a nudge.\nIt consisted to two rounds, a written of 45 mins and an interview.", "Interview Questions": "This was a basic round of interview, with questions on previous experiences, couple of technical questions but basic related to the profile."}, {"date": "3 Feb 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at IDinsight in Nov 2020", "Interview Descriptions": "Two to three rounds. If you're applying as an Associate, first round will be with a Manager, and second round likely with someone from senior leadership (like a Director). First round is more on econometrics, and second round was more on fit.", "Interview Questions": "First round will include questions on econometrics. Look at their website for an idea on type of case study covered. "}, {"date": "31 Jan 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IDinsight (New Delhi) in Nov 2020", "Interview Descriptions": "It was a rigorous process with - application (CV, Cover letter and some written responses), followed by a quant test, 2 interviews, and a writing test. The recruiting team was very helpful throughout and responded to queries.", "Interview Questions": "How does ID insight fit in my long term goals"}, {"date": "31 Oct 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (Lusaka, Lusaka) in Nov 2020", "Interview Descriptions": "Fun....if you love math. The math is not complex. Few tricky questions but nothing a few days of preparation wouldn't remedy. The psycho analysis portion of it sucked. Not for naturally introverted people", "Interview Questions": "Basic math questions. Questions about how you handled a disagreement with a work colleague"}, {"date": "18 Jan 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (Manila, Manila) in Nov 2020", "Interview Descriptions": "Interviewer was nice and easy-going; it was a structured interview with math questions to gauge your quantitative skills. They said they would get back to me within two weeks but they never gave word whether even to decline me the job.", "Interview Questions": "What is the ratio if there are 36 boys and the total number of children in the class is 75?"}, {"date": "18 Jan 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight in Nov 2020", "Interview Descriptions": "After application screening followed a timed math test to assess quantitative abilities. First round interview was mixed behavioral and case, but heavier on the case side, essentially walking through practical examples of work that IDinsight does and testing your knowledge of evaluation methods. Final round interview was also mixed, but heavier on the behavioral side and looking for cultural and organizational fit and leadership abilities.", "Interview Questions": "You're meeting a head of a state government who is interested in evaluating an education program. How do you structure that first meeting and what types of solutions would you propose?"}, {"date": "13 Oct 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IDinsight", "Interview Descriptions": "Took the math test and didn't progress to an interview. Took less than a month to hear back from them. The math test was very similar to GMAT or GRE quantitive questions. You are punished for wrong answers as well as not finishing on time. You can take as long as you want but over 1 hr will be heavily punished.", "Interview Questions": "Standard quant question similar to those of GRE or GMAt"}, {"date": "7 Dec 2021", "title": "Seniors Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at IDinsight (Nairobi) in Oct 2020", "Interview Descriptions": "Did 3 rounds of interview (First was a technical interview with an associate, second was all round interview with a director..and last interview was more of a virtual coffee chat with the country director. Also did a mathematical test and writing test", "Interview Questions": "Why are you interested working in social impact space"}, {"date": "7 Sept 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight", "Interview Descriptions": "I just got invited for a math test to assess my quantitative skills, have not yet taken the test and am looking to get more information on the format of the test.", "Interview Questions": "Have not yet been interviewed"}], [{"date": "12 Nov 2021", "title": "Associate Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IDinsight in Jun 2020", "Interview Descriptions": "A technical test, followed by 3 interviews and an essay.\nOverall the process was pretty difficult with a lot of technical assessment.\nHowever the process was interesting overall. \nMost hiring teams will conduct two to three interviews for an open role. Many roles will include a technical and quantitative interview, an interview to discuss the candidate’s motivation and experience, and a final interview with the applicable regional or functional team lead for a role. Interviews are nearly always conducted virtually due to the international nature of our team. When possible logistically, we may invite candidates to have their final interview in person. If you are invited to a first-round interview for a client-facing role, these resources will help you prepare for the technical case study interview. Interviews usually last between 30 and 60 minutes, and may end early — often some buffer time is scheduled for connectivity and logistical purposes.", "Interview Questions": "Describe a difficult situation with your manager ? \n\n"}, {"date": "9 Sept 2020", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at IDinsight (Nairobi) in Mar 2020", "Interview Descriptions": "Very professional and friendly team.  Very patient and took time to explain and repeat the questions. Never appeared judgmental and was supportive of my thought process. Very responsive on email too.", "Interview Questions": "Data for evidence based decisions "}, {"date": "18 Jan 2020", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at IDinsight", "Interview Descriptions": "There are several rounds of interviews, including a math test, a case interview, a personality interview, and a writing assessment. It was fairly intensive, but still overall a positive experience. Very passionate and knowledgeable team.", "Interview Questions": "How do you stay organized?"}, {"date": "7 Feb 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IDinsight in Jan 2020", "Interview Descriptions": "Initial submission with a math test, followed by a first-round case interview. Then there was a final round consisting of mostly behavioral questions and a timed essay assignment. The case questions were similar to the practice questions they give and were mostly a mix of casing skills and econometric knowledge.", "Interview Questions": "If you had to describe IDinsight to your family, how would you go about it?"}, {"date": "23 Dec 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "One short math test which is done online before any interviews, one technical interview about some forms of evaluations, one writing exercise and one interview with management about your personality. The whole process lasted about 2 months.", "Interview Questions": "Why do you want to work in the social sector?"}, {"date": "11 Dec 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IDinsight (New Delhi) in Nov 2019", "Interview Descriptions": "First there is a basic application on the website, followed by a math test, and then several interviews.\r\n\r\nI gave the first interview about a month after submitting the application. It was mostly a case study interview which went smoothly. In the end there were a few quantitative questions that I couldn't do in a very impressive time span.\r\n\r\nI respect IDinsight's rigorous process to hire but wish they granted some respect to people who are applying to the organisation. I had to wait nearly two months to be told that I got rejected. The mail was insincere, and had no reasons given as to why they made me wait that long.", "Interview Questions": "Case study based. Would help to go through the projects IDinsight is already involved in"}, {"date": "23 Dec 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IDinsight (London, England) in Oct 2019", "Interview Descriptions": "Submitted my CV & Cover letter. \r\n\r\n1st Round - 25 math questions. Simple questions like speed & velocity, percentages, area, ratios, that kind of thing. 1 hour.\r\n\r\n2nd Round - Case based interview: Basically how you’d set up and intervention and how you’d carry our impact evaluation. 2 questions at the end like the first quant interview. My interviewer was very lovely and very kind. \r\n\r\nWaited for about 2 weeks to hear back after which you have a timed writing test and another interview.\r\n\r\nWriting test - Form an opinion based on an article & argue out your stance. This year’s question was based off an article on the paternalism underlying the SDG slogan “leave no one behind”. 2 hours. \r\n\r\n3rd Round - Interview with Senior managers. They’re basically trying to gauge if you’re a good fit and questions have to do with your experience with development work, why your location preference is what it is, etc. There’s also a bit that goes into your round 2 case with maybe 2 or 3 questions about how you’d evaluate impact if those in the control group moved to treatment group. My interviewer was meh. Like he had better things to do with his time.", "Interview Questions": "(All these are round 3 questions) \r\n\r\nIf you had a meeting with Bill Gates what would you ask him? "}, {"date": "31 Oct 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IDinsight", "Interview Descriptions": "I submitted my CV and cover letter with the application. Then I got invited for an online math assessment to test my quantitative abilities with 25 questions to be answered within 1 hour.", "Interview Questions": "quantitative tests"}, {"date": "12 May 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IDinsight in Aug 2019", "Interview Descriptions": "It was three rounds. First was some skill testing questions you did online. The second was a get to know you, why you care about the work they do, you career goals, and some knowledge testing questions. There was also a writing assignment where they give you an article about a development topic and ask you to comment or critique it. The last round was with a manager where they asked you refined questions about your work experience and some more situation handling questions that you would encounter on the ground.", "Interview Questions": "1) Tell me about yourself? \r\n2) Why do you want to work for IDinsight\r\n3) When was a time you had a tight deadline. How did you handle it? "}, {"date": "15 Feb 2021", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (Dakar) in Jan 2019", "Interview Descriptions": "the process was in three parts. First, a preliminary online.  then a written test with technical questions about statistics and econometrics,  and later on a face-to-face meeting with the senior manager.", "Interview Questions": "What are your vision plans? What is development, from your point of view?  some questions about impact evaluation and RCTs."}], [{"date": "30 Nov 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at IDinsight (San Francisco, CA)", "Interview Descriptions": "Rigorous.  Two rounds of interviews along with an essay question. But also kind of fun in how challenging it was- and the people I was interviewed by were absolutely lovely.", "Interview Questions": "Why is your location preference what it is?"}, {"date": "7 Nov 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IDinsight (New York, NY) in Oct 2018", "Interview Descriptions": "The interview was difficult for me. It was conducted via phone call. I was interviewed by a senior associate in IDinsight. They were very supporting and gave me additional information about the company", "Interview Questions": "Why are you interested in working for IDinsight "}, {"date": "10 Sept 2018", "title": "Manager/Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IDinsight", "Interview Descriptions": "The interviewer repeatedly cut me off, spoke poorly about my previous work experience, corrected me despite quoting information directly from the website, and was seemingly agitated that I asked clarifying questions.", "Interview Questions": "How would you measure success for an unconditional cash transfer pilot to end extreme poverty in SE Asia?"}, {"date": "23 Aug 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IDinsight (Nairobi) in Jul 2018", "Interview Descriptions": "The interview was a 2 part process where the first interview was a technical interview testing quantitative and evaluative skills. It was an hour long and had a couple of Math questions at the very end. The interviewer was very friendly but thorough in terms of his inquisition about skills and experience. I was called for the second interview about a month later where I had a sit down with one of the directors. The questions were more behavioural but two technical questions were asked towards the end.", "Interview Questions": "The questions were pretty much similar to what their website had as examples and what is on here (glassdoor)"}, {"date": "18 Apr 2018", "title": "Global Operations Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "Working for IDinsight seems to require consistent follow through and good timing. The first time I applied it was two months before I heard anything from HR, but by then it was too late and I had taken another opportunity. The second time I applied, the start date of the position had been pushed back by 6 months so I withdrew my application. If you want to work at IDinsight, I think it's necessary to keep on applying and following up with HR because the recruitment process appears very slow-going.", "Interview Questions": "Was no selected for an interview."}, {"date": "9 Mar 2018", "title": "Associate Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight", "Interview Descriptions": "There were two interviews, both by phone. Both were interesting and enjoyable and provided detailed information on IDinsight's work and what one could expect in the Associate Program.  IDinsight provided guidance and materials to prep for the interviews; these were helpful and accurate. The first interview included brief case studies and a couple of quantitative questions. Both interviewers were thoughtful, friendly, interested. The career team was prompt and helpful in responding to emails. The only downside was that they took a while to reach a final decision, delaying the planned announcement by several weeks.", "Interview Questions": "Tell us about a professional challenge you have faced and how you handled it. "}, {"date": "26 Feb 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IDinsight (Nairobi) in Feb 2018", "Interview Descriptions": "First I applied online and then I was called for a competency based interview. I am still in the process of applying and have only gotten to the second level so far.", "Interview Questions": "The interview is written. They test skills in quantitative problem solving, statistics and impact evaluation."}, {"date": "5 Jan 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IDinsight in Nov 2017", "Interview Descriptions": "Campus info session - Online Application (mid October) - Phone Screen w/ Partner (early Nov) - 2nd round Skype w/ Senior Manager (mid Nov)  - Online Timed Writing Assignment (mid Nov)  - Rejection (early Jan) . That hiring process has changed a bit - relative to those detailed earlier. The first interview was originally scheduled to be with a senior manager - but was changed to one of the founding managers several days later. The interview times are still indeed a bit odd (early morning) but it comes with the nature of the work. The interview itself was quite straight forward. Most of the cases described earlier on Glassdoor still applied (textbooks). The interview ended with two quantitative problems: a compound interest and a distance formula problem.  I was free to use whatever resources available (Excel, etc). I didn't leave this interview extremely confident but received the invite back for round 2 within a week and a half. This time, I interviewed with one of the leaders from another division on Skype. This interviewer was a bit more stoic and I could often tell the mood was not as optimistic. The Stata questions and intense skill focus detailed in past reviews is no more. Questions were mostly behavior - one: \"Why International Development\", was a repeat from before. Still, there were 3 more brain-teaser like algebra problems toward the end of this one as well (salt solution using different sized containers) and a seemingly simple case study on whether a group of farmers should a adopt a new crop recommended by researchers, but that they believe to be unsuited for the climate. The interview wrapped up. I was told I would hear back within 2 weeks. I completed the timed writing assigment (question below) in the alloted hour and a half.  At a strict 400 word limit, much of the last half hour is spent editing. From there, the wait was 47 days, punctuated by several emails that they were carefully making their decisions.", "Interview Questions": "Please read the article: \"The Case for Getting Rid of Borders -- Completely\". Agree or disagree and explain why. "}, {"date": "6 Dec 2017", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at IDinsight (Nairobi) in Nov 2017", "Interview Descriptions": "There were two rounds of interviews: one case-study and one 'normal' interview. The case-study was questions of how to run a specific impact evaluation project and the normal interview was typical questions about my previous experiences and how they made me suitable for the role.", "Interview Questions": "Give an example of a time where you have given negative feedback"}, {"date": "15 Jun 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at IDinsight in Nov 2017", "Interview Descriptions": "First round interview consisted of two parts: behavioral and applied. The behavioral was relatively straight-forward, mostly about who you are and why you're interested in the position. The applied portion was essentially a case on how you would set up a RCT (between options given, discuss what is better and why).  I applied for an international position and therefore had a Skype call with the regional office.", "Interview Questions": "If you are evaluating impact on this project, which of the following methods would you use to measure impact and why?"}], [{"date": "5 Oct 2018", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IDinsight (San Francisco, CA) in Nov 2017", "Interview Descriptions": "Extensive online application, 2 rounds of interviews (combination of case, behavioural and simple math problems), timed writing assignment. Very friendly and knowledgeable interviewers with high positions in the organization. Open to Skype interviews if you are not near one of their offices.", "Interview Questions": "Research scenarios: they might ask you how you would go about answering a particular ID-related research question."}, {"date": "6 May 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at IDinsight in Oct 2017", "Interview Descriptions": "The process was great. The interviewer was extremely nice and cooperative. Even though I didnt get in, she was more than happy to give me advice. The process didnt even last too long", "Interview Questions": "Why do you want to join IDInsight and what will you get out of it"}, {"date": "22 Jan 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IDinsight (Mumbai) in Oct 2017", "Interview Descriptions": "To begin with, IDinsight is the most unprofessional and opaque organisation I've come across in years of my professional career. There is no hint of transparency in their selection process and show absolutely no regard for a candidate's engagement and career plans. I applied online for the job. After the CV-shortlisting, two rounds of interviews were conducted. First was the technical round which dealt with intricacies of RCT through a case-study. It's necessary that you posses knowledge of econometrics and basic math. The second round was with their India Director. It was a fit interview where they discussed aspects of career interests, goals, personality and team management. Both interviews lasted about an hour.\r\nI cleared both the interview rounds after which they didn't respond for 2 months which was absolutely unexpected from the organization. They retrieved 2 months later to contact my references. A week later, they inform me that they can't make an offer right now. I asked for a feedback to which they blatantly refused. I pushed an employee in the organization to push for the same but they were rude to his requests as well (they'd respond only if they have a reason to reject me). It is not difficult to see what happened behind the doors during these two months of delay . Not discrediting the organisation, but the utter lack of transparency in the selection process coupled with a bias for a certain kind of brand/background completely defeats all arguments for meritocracy. For their lack of professionalism and bias, I'd not recommend anyone apply for this role.", "Interview Questions": "Imagine you get a chance to interact with Bill Gates. What will you talk to him about?"}, {"date": "23 May 2017", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at IDinsight (New York, NY) in Apr 2017", "Interview Descriptions": "Attended information sessions, online application, phone screenings, interviews. This was a terribly long and rigorous process with little reason or explanation. The team was not responsive or considerate of the time-sensitive nature of the post-graduate job-seeking process. It was drawn out and unnecessarily intense. Would've been a cool experience, but the level of feedback and consideration seemed to reflect a lack of coordination, organization, or care for applicant's time and effort. Very disappointed.", "Interview Questions": "Case interview"}, {"date": "3 Mar 2017", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IDinsight in Nov 2016", "Interview Descriptions": "I applied online and within 2 weeks received an interview offer. About two weeks after the interview, I found out that I didn't make it past the first round.", "Interview Questions": "Do you have experience leading a team? and a case interview where you had to go over different types of evaluations"}, {"date": "19 Oct 2016", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IDinsight (New Delhi) in Sept 2016", "Interview Descriptions": "3 stage interview, after which they contact your references before making an offer. In the first interview they asked a few basic quantitative questions, and roleplay questions. Though they needed no preparation, they did catch me off guard. The second interview was an hour long technical interview where I was asked about my experience with Stata, and walked through many levels of a scenario that involved both roleplay and quantitative reasoning. I was even asked what Stata commands I would use to test the validity of a relationship given the experimental context and how I would interpret the coefficient, T stat etc. They sent an evaluation methodology table to look over before this interview, though simply studying this would not have been enough for a successful interview. I was flown out to Delhi for my final interview, where I spoke to a partner for about 2 hours. These questions were all to gauge my fit in the organisation, asking questions like what my career plans were in the next 5 yrs and 20 yrs, why I am interested in this type of quantitative analysis, what makes me think I am well prepared for it, how my previous boss would describe me etc.", "Interview Questions": "Choose one issue that you care deeply about, explain why, take on a personality involved in addressing this issue, tell me 2-3 things you would do fix the problem"}, {"date": "3 Aug 2016", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IDinsight", "Interview Descriptions": "3 interviews - 1 strictly technical (evaluation design, mental math, etc.) and 2 more behavioral / fit - related. Interviews are always with at least a couple members of upper management - fit with the organization is very important.", "Interview Questions": "Typical behavioral questions, asking about previous experiences applied to IDinsight. Some hypothetical scenarios on situations you might face. Lots of self-reflection required."}, {"date": "18 Jul 2016", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IDinsight (Oxford, England) in Jun 2016", "Interview Descriptions": "There were three stages of interviews. I got through two and did not make it to the third. The first was described as being a get-to-know-each-other type interview but included quantitative reasoning questions which I was not expecting at all. The interviewer was professional and competent. The second interview walked me through evaluation situations, testing the candidate's knowledge of different evaluation designs and ability to react to different situations. Even though it is an entry-level position, they expect significant field experience which seemed a little unfair to me.", "Interview Questions": "Quantitative reasoning questions, such as if average income or median income was higher in a country and why?; work done by individuals in a time period if certain amount of work was done by a certain number of individuals etc. Go through quant reasoning questions well!"}, {"date": "24 Aug 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IDinsight (London, England) in Jun 2016", "Interview Descriptions": "Interview process was very fast. These are people who know what they want from candidates and they go for it. Very rigorous and highly technical questions, even when they inform you that they only want to ask a few questions and you need not prepare for anything. With IDinsight, always be prepared.", "Interview Questions": "A government intends to increase crop yields of farmers by 20% giving them crop seedlings. To do this, the officials selected 1000 farmers and give the seedlings to 20% of them (n=200). So the government target of increasing yield by 20% has been achieved once crop yields increased amongst the 20% or 200 farmers given the crop seedlings your comment on this?"}, {"date": "7 Jan 2016", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IDinsight", "Interview Descriptions": "Very rigorous. There are three interviews and each is different than the last. The first interview consists of asking about your relevant work experience. The second interview is a technical interview that tests your knowledge of math and stats. The third interview is with management and asks clarification questions. The second interview is probably the hardest.", "Interview Questions": "What makes you interested in development?"}], [{"date": "3 Aug 2016", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at IDinsight (San Francisco, CA) in Mar 2015", "Interview Descriptions": "3 rounds of interviews. First round is usually with a manager/senior manager and is a general fit interview assessing your background etc. Second interview is technical and focuses on math as well as evaluation concepts. Third round is conducted with a partner and is again about your fit and why you want to work in the sector", "Interview Questions": "SAT type math questions in the tech interview"}, {"date": "23 Feb 2015", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IDinsight (Boston, MA) in Dec 2014", "Interview Descriptions": "There were three rounds of interviews. The first round interview was initiated within a week of applying to the job. They are very fast at reaching out to you and the interview process is pretty fast. I only made it to the 2nd round but it all happened within a spank of 2 and a half weeks. The first round was around 30 minutes long. It was definitely not easy but not as difficult as the second round. \r\n\r\nThe second round was 80 minutes long and very in-depth! You need to be familiar with quasi-experimental methodologies. They ask you about your background with impact evaluations and research background. Afterwards, they provide you with hypothetical scenarios and you have to answer based on your knowledge about impact evaluation and quasi-experimental methodologies. They keep going deeper into the questions and providing additional questions to the first question. They then ask you math/logic questions. They ask you about your experience with STATA and a couple STATA related questions. \r\n\r\nThe second round interview was very intimidating and hard. Definitely prepare and study in advance! Good Luck!", "Interview Questions": "First Round - (Answer if true or false) The median income in the US is greater than the mean income. \r\n\r\nSecond Round - The Ministry of Education is providing underperforming schools with textbooks. The Minister says there is a 15% increase in the test scores of these schools after the textbooks were provided. The Minister wants to know if this is a significant value and if he should scale up?"}, {"date": "30 Nov 2014", "title": "Full Time Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at IDinsight in Nov 2014", "Interview Descriptions": "3 round interview process. First and second via skype (no video). First round pretty basic, with behavioral questions, for the second round, they give you a prep sheet based on which they ask more case style questions (you're supposed to use the concepts on the prep sheet to answer). The interviewers are all graduates from top schools, generally interviewing from one of the field locations, so the interview takes place at weird times.", "Interview Questions": "The first round had a couple of mental math questions that I wasn't expecting. Basic statistics (distribution) and math-- keep a pencil around. "}]]