[[{"date": "10 Apr 2023", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "First an email from HR Representative to schedule a phone interview then one phone interview with an HR Representative and one webex interview with hiring unit managers. Later will receive a phone call from HR with unit manager’s decision", "Interview Questions": "Describe a time you were a patient advocate."}, {"date": "30 Apr 2023", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's in Apr 2023", "Interview Descriptions": "They asked many questions, such as technical and situational questions. Really try to get you to talk about yourself and your experiences in nursing, especially for that unit speciality. Typical interview style, but prepare well. Formal, but easy to converse with the interviewer.", "Interview Questions": "Tell me about yourself. Situational questions"}, {"date": "30 Mar 2023", "title": "Genetic Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "HR phone call, interview with two GCs, interview with supervising GC Very conversational and friendly group of people! Although was not offered a position, they personally emailed me to say no which is nicer than seeing it via a portal or being ghosted.", "Interview Questions": "Clinical cases that were challenging, how I practice self-care, why GC as a profession, why Seattle Children's, salary expectations, what do you look for in a job"}, {"date": "29 Apr 2023", "title": "Registration Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Seattle Children's (Seattle, WA) in Mar 2023", "Interview Descriptions": "I had a Phone screening with a supervisor while he was driving to his hair cut appointment. He wasn't paying attention to what I said and he kept calling me with wrong name.", "Interview Questions": "Why are you interested in this position?"}, {"date": "17 Feb 2023", "title": "Cls Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "i got an email and set up a phone call with the HR rep. It was simple and the person told me the salary and benefits. Later on, with all the confrimation my information ws sent to specific deparmtnets", "Interview Questions": "why choose this place to work in"}, {"date": "8 Feb 2023", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "First round with management, second with team. Overall pretty relaxed, just making sure you have relevant experience and actually want the role. They explain everything pretty well, although a lot of it you learn on the job I'm guessing", "Interview Questions": "How do you deal with stressful situations"}, {"date": "7 Feb 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "It was a good experience. Phone interview. All behavioral questions. The interviewers are nice and the whole interview process took around 30 minutes. but keep in mind this is jut my experience, the length, and complexity of the interview process can vary greatly depending on the size of the company, the type of position, and the number of applicants.", "Interview Questions": "Introduce yourself. Why choose this organization?"}, {"date": "27 Feb 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's in Feb 2023", "Interview Descriptions": "I was reached out via email by the Hiring Manager/Director for the job to answer questions that were addressed in my cover letter and were not a part of the ICiMS applicant portal when submitting my application. \r\n\r\nAfterward, I was allowed to schedule a 45-minute video interview. During the interview, a breakdown of the role and responsibilities was given. I was given a chance to speak about my qualifications and why I would be an ideal candidate for this role; the HM liked my response and gave the impression that I would be given an offer. The HM told me that they would not prefer to interview candidates again for this position and would desire someone to stay long-term in this role. I was asked, \"How do I know you won't apply to another role within SCH as it is easier to move around to other departments once you are in the organization?\" this gave me the impression that my growth opportunities would be limited here. \r\n\r\nI was passed on to a 2nd round of video interviews to meet the team. I was told I would be an ideal candidate for this position as this position worked with very diverse communities, and I would be able to bring my experience into this program. \r\n\r\nI followed up with the HM the following week to see where my application stood, and I was told that \r\nI would not be offered a job because HM thought this position would not be challenging, and I am overly qualified for a Program Coordinator 2 position. However, each individual finds challenges within their role, but it was predetermined that I would be \"bored in a few months...\". The organization struggles with Diversity, Equity, and Inclusion, so I  felt I was interviewed to meet a diversity quota.", "Interview Questions": "Tell me a bit about yourself?"}, {"date": "7 Jun 2023", "title": "Epidemiolgist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Seattle Children's (Seattle, WA) in Feb 2023", "Interview Descriptions": "Had one screening interview with HR rep, and one phone call interview. Two to three more interviews in series, but didn't make it that far. Lots of questions about experience with DEI, defining anti-racism, health equity, etc.", "Interview Questions": "How would you define anti-racism?"}, {"date": "18 Jan 2023", "title": "Program Coordinator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's", "Interview Descriptions": "First round with management/supervisors followed by a round with the direct team. Basic questions about how previous experience will translate into the role. Nothing too difficult. Looking for solid evidence you have knowledgeable skills for daily expectations.", "Interview Questions": "Explain how you’ve been able to grow your self-efficiency and independent work over the years and how it’s strengthened your ability to multitask without direct guidance."}], [{"date": "26 Nov 2022", "title": "Clinical Intern Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Emailed with supervisor and then scheduled a phone call to go over the position. The phone call was very brief and unstructured. I had to reach back out to hear back from them.", "Interview Questions": "How do you work in fast paced environments? Do you have experience with health systems?"}, {"date": "5 Nov 2022", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Seattle Children's (Seattle, WA) in Nov 2022", "Interview Descriptions": "Called for a phone screening, interviewed by a manager and director who first asked me what my questions were (before telling me anything about the position) and then read questions off of a paper and said “thanks” after every answer I gave.", "Interview Questions": "What do you do for fun?"}, {"date": "27 Oct 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Oct 2022", "Interview Descriptions": "Had two interviews before getting an offer letter. After the first interview, I was told that I would get a call within 48 hours, but I did not. So I emailed the first interviewer and was able to get a 2nd interview. Communication after that was very quick and efficient.", "Interview Questions": "What is one skill/quality, a coworker or employer in the past would say you have improved on?"}, {"date": "6 Dec 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in Sept 2022", "Interview Descriptions": "I first spoke with a recruiter for the phone screening. I was selected to move on to the first round of interviews, which was a virtual interview with a 4-person panel. The interview went well, although I prefer in-person opportunities. From there, I had to wait 3 or 4 weeks to hear if I was chosen for the final round. I received an email that informed me they went with another candidate. I responded to that email, requesting any feedback regarding their decision to go with the other person, but I never got a response.", "Interview Questions": "They asked about my management style"}, {"date": "14 Jul 2022", "title": "Behavioral Health Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's", "Interview Descriptions": "I applied online through the portal. First there was an online pre-screening that I got through email from a recruiter and then a remote interview for about 30 minutes. Whole process took two weeks.", "Interview Questions": "Give me a time where you made a mistake "}, {"date": "20 Jun 2022", "title": "Nurse Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's in Jun 2022", "Interview Descriptions": "The care coordinator who interviewed me was driving and clearly was not listening to me. I feel disrespected during the interview and I was very excited to interview with them. I will not be applying to this hospital when I graduate from nursing school.  There are so many better hospital in the Seattle that specialize in pediatrics.", "Interview Questions": "Do you have any experience working with kids?"}, {"date": "31 Oct 2022", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Children's in May 2022", "Interview Descriptions": "It was a phone screen and it was informative as I learned all I needed to know about the job. Unfortunately, the job was not a good fit for my skillset.", "Interview Questions": "Do you have experience working/supporting in MS Teams?"}, {"date": "19 Apr 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Two stages, there was an initial interview with one person who then scheduled a group interview with multiple leads and etc, this was all done via phone during COVID so the process may be different now", "Interview Questions": "What is your greatest weakness "}, {"date": "13 Apr 2022", "title": "Housekeeping Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Apr 2022", "Interview Descriptions": "I am extremely impressed with the interview process at Seattle children's hospital thus far! They are collaborative and inclusive with their hiring process. First, I submitted an application through their website. Then I was contacted by one of the Sr. hiring managers via email and invited to schedule an in-person interview. Following the interview I was contacted within three days and invited to a second interview. The second interview will be online and include multiple leaders from the department I'm applying to work in. That's as far as I've gotten in the interview process but so far I am impressed!", "Interview Questions": "Why do you want to change jobs?"}, {"date": "2 Apr 2022", "title": "Family Advocate/Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's in Mar 2022", "Interview Descriptions": "I had a phone screening with a recruiter and then a Zoom interview with the hiring manager. The next step would be an interview with the entire team, according to the manager. Whole process took 2 weeks.\r\n\r\nThe hiring manager was quite nice and approachable. However, midway through the interview she stated they were looking for a social worker. No where in the job description does it say you need a BSW or MSW. That was quite disappointing to hear after putting in so much effort. It became evident that while the job posting says they only require a bachelors in \"social sciences\" they were looking for a master's level applicant.", "Interview Questions": "What experience do you have counseling youth with depression and anxiety?"}], [{"date": "22 Jan 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "I interviewed for SPARKS study at the Seattle Children and the interview went nicely. I was not accepted and emailed them asking for the reason and they emailed me back with reasonable responses.", "Interview Questions": "Describe your experience with a child that you encounter at your previous work"}, {"date": "13 Jan 2022", "title": "Playroom Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in Jan 2022", "Interview Descriptions": "The first interview was a phone interview with talent acquisition. I was asked basic questions relating to my interest in the position and working at Seattle Children's Hospital. They also provided me information about the job itself and basic yes and no questions. The second interview was a phone screening with the playroom manager. They mainly asked about my background as it was only a 15 minute interview. The third interview was a video chat with the playroom manager and other staff from other locations I would work at. They asked questions that had me apply my experience to the questions they asked such as how I worked with different coworkers, how I supervised others, stress, etc. Basically questions to get a more well rounded idea of who I am as a professional.", "Interview Questions": "What is your background?\r\nHow do you handle situations where someone does not agree with you?\r\nHow do you handle stress?\r\nWhat is your experience with supervising others?"}, {"date": "13 Dec 2021", "title": "Administration Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Very detail oriented. When asked about scenarios they wanted detailed description's on handle certain situations.  Based questions off of core values and principles. firs round is 1:1 basis, second round is with a panel depending on the position.", "Interview Questions": "What are your core v alues"}, {"date": "26 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "For the new grad program, it was a panel of managers for the areas you applied for. The questions were typical and the managers are not intimidating at all. Overall, liked the experience.", "Interview Questions": "Tell me a time you went above and beyond"}, {"date": "20 Nov 2021", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Seattle Children's (Seattle, WA) in Nov 2021", "Interview Descriptions": "General situational questions and past work history. Why I wanted to work there, what kind of training they have to prepare you for the positions etc. told me the different growth opportunities", "Interview Questions": "Name a time you thought you would be doing one thing and it changed, and how and why you adapted to it."}, {"date": "16 Feb 2022", "title": "Dietetic Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in Oct 2021", "Interview Descriptions": "Did a phone interview and followed up with a Teams video interview with 3 people. It seemed like a huge deal that I had been out of school for 2-3 years which was surprising to me. I went straight to work after receiving my undergrad and didn't have any gaps in my resume. Had stayed at my previous job for 3 years. Their qualification is a bachelor's but from talking around it seems as if they only hire people with their masters. \r\n\r\nThe interviewing environment didn't feel welcoming.", "Interview Questions": "Was asked lots of \"give me a time when..\" questions that were pretty difficult. "}, {"date": "21 Feb 2022", "title": "Medical Interpreter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Seattle Children's in Oct 2021", "Interview Descriptions": "Pleasant, The young manager was serious.  They ask me why I applied. I told them I always apply hoping for someone that can give me the opportunity.   I responded the questions they asked me.  About salary I was the one telling them I needed at least $30 to start with,  after all part of  the liability of doctors rest on my interpretation.  My mind was set on impressing them with my knowledge but I think they probably saw me as over qualified.  After many people leaving the department I saw they will pick me but it took 2 days for one person to sent me an email saying  YOU DON’T FIT .   I think they have to work on that way they do business here. I will never apply again.", "Interview Questions": "They used  a questionary  about how you deal with people and scenarios at the hospital and then they see how you resolve it. You experience and integrity and education is less important than the questionary. \r\n\r\nA lot of Video machines for interpretation is what they use on this days . I understand the video and VRI cost $ 0.20 to $0.40  cents per minute.  I applied again because is hard to see those that do not speak English  well struggle.  Medicine / interpretation can’t be done trough a machine and expect 100% quality.  Don’t take me wrong Medicine is the best and I love the mission of the Medical Center.  I applied again to see if it click to someone in the department that my education and experience is valuable ( I was highly recommended but maybe me having kids was an issue, I was asked some personal questions) .  All very friendly.  I hope things change one day in the Interpreters department.  I hope  they get someone that knows the Interpretation and Translation business in WA. "}, {"date": "28 Mar 2022", "title": "Research Scientist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's in Sept 2021", "Interview Descriptions": "Phone interview first, then in-person interview. The phone interview was about 30 minutes. They mainly ask about your background and experiences. In-person interview was longer, and the questions will depend on the job title and the lab", "Interview Questions": "Tell us about your experience in the lab"}, {"date": "23 Sept 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Seattle Children's (Seattle, WA) in Sept 2021", "Interview Descriptions": "Phone call - It was a thirty minute interview with many of the staff. They were very nice and kind. They told me I could ask any questions as I wanted throughout the interview.", "Interview Questions": "What are you’re strengths and weaknesses? "}, {"date": "4 Aug 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Insightful questions on experience, enthusiasm about the field. I had a very positive experience, and the interviewers were very kind. I was employed within the company already, so I spoke about that experience too.", "Interview Questions": "What interests you about the project"}], [{"date": "28 Sept 2021", "title": "Community Engagement Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's in Aug 2021", "Interview Descriptions": "The process was lengthy and projected to take longer according to interviewers. I was told they were interested in keeping me in the running but I felt weary as I had another offer that paid better. I will say they were also very thorough with pre-screening questions as part of the interview.", "Interview Questions": "They asked a lot of specifics regarding DEI as well as specifics about the job description with regard to the management of volunteer staff."}, {"date": "29 Jul 2021", "title": "Student Lab Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "Found the posting on a job/internship board at my university. Emailed with resume and heard back extremely quickly. Went in for one low key interview and that was it. Super easy interview process for a lab intern.", "Interview Questions": "Tell me about yourself... and do you have any questions for us?"}, {"date": "17 Jun 2021", "title": "Certified Nursing Assistant (CNA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "The person I talked with was very engaging and happy to answer any questions. There were a lot more questions than I had experienced at other interviews, but none of them were necessarily difficult. It lasted for about 20 minutes and it was overall a lovely experience.", "Interview Questions": "If I called (place of pervious employment) and asked them for one area you did well and one area you need to improve in, what would they say?"}, {"date": "1 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Jun 2021", "Interview Descriptions": "Initial  15 minute phone screen with recruiter asking me regarding my experience.  Recruiter said she would forward my resume to the nurse manager.  Received email from nurse manager requesting phone interview.  Discussed why I wanted to work at SCH and nurse manager reviewed job details.  Invited to in person panel interview with staff in person and remote.  Typical various questions asked - patient/customer service scenarios.  Still waiting for an offer/response three weeks after interview...", "Interview Questions": "Describe your proudest  and worst nursing day as a nurse."}, {"date": "22 May 2021", "title": "Scheduling Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Children's", "Interview Descriptions": "The panel interview consisted of two supervisors from different departments following the initial phone screen with a recruiter. The questions were presented in the STAR method and required applicants to reflect on past situations.", "Interview Questions": "Give an example of when you have been innovative in past experiences."}, {"date": "13 May 2021", "title": "Clinical Research Coordinator I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "I had a webx interview and it was very pleasant. My initial interview was followed by a second.  In the second interview I was able to meet and get to know more members of the team.", "Interview Questions": "Asked about experiences, education, etc. "}, {"date": "12 Aug 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's in May 2021", "Interview Descriptions": "Went through 3 interviews that were laid back and conversational - a lot was shared about the job itself which was extremely informative and helped 'sell' the job to me.", "Interview Questions": "EDI questions were incorporated which was great"}, {"date": "17 Apr 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Applied to the job and HR contacted me within a week. I was in touch with the department within the next few days or so after that. Staff was very friendly", "Interview Questions": "What experience do you have? How do you handle difficult situations"}, {"date": "17 Apr 2021", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Seattle Children's (Seattle, WA) in Apr 2021", "Interview Descriptions": "Interviewed with multiple team members the teams was super nice and allowed me to ask all the questions I had. Overall made me want to work for. I am waiting on a an offer.", "Interview Questions": "Behavioral and value based questions"}, {"date": "9 Mar 2021", "title": "Grants and Contracts Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Approximately three week from application to receiving offer letter. Three rounds of interviews. Reference checks through online portal. Drug test, federal background check and immunization were all required to finalize offer.", "Interview Questions": "More conversational in the screening and second interview. Third round with team centered on budget analysis, time management and general personality/ fit questions."}], [{"date": "27 Apr 2021", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Mar 2021", "Interview Descriptions": "Very organized, professional and friendly.\r\nAsked detailed questions about how I handle a difficult coworker. How I respond to stress. \r\nWhy I applied for a job at their organization.\r\nHow punctual I am.", "Interview Questions": "Technical questions and personality trait"}, {"date": "26 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "I thought it was great. I felt nervous but everyone was very nice.  They were able to answer all of my questions and were super helpful. I was excited to accept the job.", "Interview Questions": "Tell me something about yourself"}, {"date": "27 Feb 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Feb 2021", "Interview Descriptions": "The interview process was very detailed and thorough the people are very friendlyThey were very formal they were very professional they did an excellent job and taking turns asking me questions when they were working on a panel of five people.  ,", "Interview Questions": "I was asked what skills I could bring to the position"}, {"date": "6 Mar 2021", "title": "Psychiatric Social Worker/Mental Health Evaluator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Feb 2021", "Interview Descriptions": "There are three rounds of interviews (recruiter, individual interview, and panel interview). I was invited to all three rounds of interviews and never actually interviewed. They then told me they'd follow-up in a few days and I never heard back again,", "Interview Questions": "They didn't ask me anything. They just talked about the position and asked me if I had questions. "}, {"date": "28 Jan 2021", "title": "Annual Giving Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "The employer was responsive to my inquiries and decently prompt with follow-ups to my emails and interviews. I interviewed once on the phone, then had an in-person interview at the offices.", "Interview Questions": "What makes you the right fit for this job?"}, {"date": "14 Jan 2021", "title": "Research Scientist I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "Had a phone interview which lasted about 10 mins. During the interview, the interviewer had talked more about the position in detail and about very specific and technical knowledge about what was being done rather than asking questions to me as the interviewee which quite threw me off balance. After asking a few basic questions, I then asked them if they had concerns about my experience. They then proceeded to express their concern about a certain skill  that I have on my resume at least 3 times and had just talked about a few minutes before. This was very discouraging and reflected badly on not just me but on the Lab as well.", "Interview Questions": "Do you have experience with sterile technique? "}, {"date": "12 Jan 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "I scheduled to meet with someone in HR for the position, at noon. I waited an hour to hear back and never did. I called the number in the email, and it went to voicemail. No one ever got back to me or followed up to my email inquiry or voicemail. It was incredibly unprofessional and a waste of  my time.", "Interview Questions": "I was never able to connect with anyone for an interview, so I gave up."}, {"date": "22 Dec 2020", "title": "Learning and Organizational Development Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "It started with a phone screening.  From there it went to a  meeting with manager.  And the next phase was a couple of panel interviews with team members and other stakeholders/leaders.  Things were organized and professional, but the general process it felt a little rushed.", "Interview Questions": "The questions were about past experience -- tell us about a time types of questions.  There were also situational questions.  And they asked questions about their organizational values and how I connected to them and what that looks like in action to me. "}, {"date": "21 Dec 2020", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "The interview was in the morning and there were two groups. The first group toured the shootist and the second group went to another location for interviews. Two interviews, one with leadership and one with peers.", "Interview Questions": "Name a time someone gave you feedback, how did you take it?"}, {"date": "11 Jun 2021", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Sept 2020", "Interview Descriptions": "The interview process was really quick. On my final interview, the panel was not very diverse. When answering questions regarding Diversity and Inclusion work, their answer was very generic and did not give any real pieces of information. The same thing can be said for everything else too - generic answers and not reflecting strong company culture.", "Interview Questions": "How do you solve a conflict? How do priority tasks? "}], [{"date": "2 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Seattle Children's (Seattle, WA) in Jul 2020", "Interview Descriptions": "It was very relaxed! Done over zoom because of COVID-19. It was more of a conversation than an interview, which meant that I never felt on edge. Overall, great experience and made me more excited about the job.", "Interview Questions": "Tell me about yourself and past experiences. "}, {"date": "4 Dec 2021", "title": "Registration Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in Jul 2020", "Interview Descriptions": "It was online.  There are 2  panels who are at Seattle main  campus. They just ask  behavior questions. They use WebEx for the interview.  It wasn't that hard but they are looking for particular words .", "Interview Questions": "What is your ideal team ?"}, {"date": "22 May 2020", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "The PI emailed me an interview time via a Google calendar invite. During the interview, the PI asked  straight forward questions about previous job experience, strengths, weaknesses, why I wanted to work at Seattle Children’s", "Interview Questions": "What is one area that you want to develop in? "}, {"date": "18 Feb 2022", "title": "Psychiatric Social Worker/Mental Health Evaluator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Seattle Children's (Seattle, WA) in Mar 2020", "Interview Descriptions": "The interview took about an hour it was virtual. I was asked to talk about my previous experience in evaluation and assessment and required me to submit a piece of writing. Important to mention your work and experience with family dynamics and being able to do a Mental State Exam.", "Interview Questions": "How do you handle conflict at the work place?"}, {"date": "25 Feb 2020", "title": "Aquatic Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Children's", "Interview Descriptions": "One in-person interview, took around 45 minutes. Met with the pool manager and we just had a conversation about my prior work experience in and around pools. Very low pressure, they just want to make sure you know your stuff about aquatic environments.", "Interview Questions": "Do you have any experience working with kids who have disabilities?"}, {"date": "5 Apr 2022", "title": "Patient Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Jan 2020", "Interview Descriptions": "Good communication. Followed up with me within the next week to schedule the onsite interview. There is the phone screen, then an onsite interview that includes a panel of people who have the same role.", "Interview Questions": "Tell me about your work experience? \r\nWhat would you say are your strengths and weaknesses"}, {"date": "4 Dec 2019", "title": "Student Helper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "A brief phone interview about scheduling, what the position entails, and my previous experience in research. I was then contacted for an in-person interview via email. After the in-person interview, I was contacted one week later and was given an offer letter", "Interview Questions": "Where do you see yourself in the future? career goals?"}, {"date": "6 Dec 2019", "title": "Research Scientist III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Nov 2019", "Interview Descriptions": "It was very informal. There was an hour conversation with the interviewer about my past work experiences and what the company has to offer for research resources. I talked with the people who work in the lab for about a half an hour. Overall, it was a very good experience and everyone seemed very friendly.", "Interview Questions": "Describe your past research experiences."}, {"date": "23 Sept 2019", "title": "Digital Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's", "Interview Descriptions": "After what I thought was a pleasant/friendly yet professional phone interview, I never heard back. At all.  The unprofessionalism is disheartening, especially since the interviewers were direct employees of the hospital, not outsourced headhunters. I interviewed with two people, one who would be the supervisor of this role.  I'm confused as to why no one would even do me the courtesy of letting me know that I'm no longer being considered. I am taking this as a sign that it's probably best I didn't put myself under their \"leadership.\"   Also, mold was found in their operating rooms. Gross.", "Interview Questions": "Why do you want to work for Seattle Children's. "}, {"date": "3 Sept 2019", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in Aug 2019", "Interview Descriptions": "Applied online and got an email to set up a 15 min phone interview, they asked basic questions (maybe 3-5 at most) about experience and why I wanted to work for SCH. From there, about a week later I received a call from the lead tech and did an additional quick phone interview and scheduled an in person interview about another week later.  Interviews are long and thorough so be prepared to be at the hospital for a few hours ( mine ran about 2 1/2 hours).\r\n\r\nWhen I arrived at SCH I was welcomed by the lead tech and did a 1:1 interview with basic interview questions as well going through my resume and discussing experience (definitely glance over your resume and be familiar with what is on it, they may ask for examples from experiences listed on it). After a 1:1, I sat down with a panel, answered some situational questions and got to know them and what they love about working at SCH. Everyone was very friendly and the interview was laid back and comfortable. Following the panel interview, I was given a tour of the ORs, PACU, etc and then I concluded my interview back with the lead tech who described benefits, hospital polices, transportation benefits/bonuses, etc.\r\nI received an email the following week to proceed with references and was offered the position as soon as 4 references were completed.\r\n\r\nEveryone was wonderful and very helpful! I do recommend giving yourself extra time to get there, parking can be difficult if it's a busy day, but other than that, I enjoyed my interview and process.", "Interview Questions": "What would you do if you saw a Dr or nurse contaminate the sterile field? "}], [{"date": "28 May 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "I was contracted from another agency and filled out paper work there. Then went through HIPAA compliance training.  After, I was contacted by Seattle Children's HR department via email to schedule time  fill out other paperwork. I also received my id badge there. Overall, the process was very easy and straight forward.", "Interview Questions": "What is customer service to you?"}, {"date": "17 May 2019", "title": "Research Scientist Level I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's", "Interview Descriptions": "I spoke with the portfolio manager about previous research that I’ve done, and then a more in depth interview with the hiring manager. For the last step I had to give a 15 minute presentation over my research in front of a panel", "Interview Questions": "What was your role in your previous research position?"}, {"date": "15 Apr 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in Apr 2019", "Interview Descriptions": "Phone screen and interview with recruiter with in person interviews with hiring manager and panelists including cross functional staff members and member of leadership contributed to interviews for this role over multiple days.", "Interview Questions": "How are you the ideal candidate"}, {"date": "27 Oct 2020", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Apr 2019", "Interview Descriptions": "1. Phone Screen.-  This was with HR to make sure that I had the right qualifications. Then they either recommended your resume to the hiring manager for in-person interview.  \n2. Team Interview- Interviewing with 3 other PM and their hiring boss. \n3. Assignment.", "Interview Questions": "What type of animal would you consider yourself and why? "}, {"date": "28 Mar 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Feb 2019", "Interview Descriptions": "There was a tour followed by an interview. The interview was two panel interviews back to back with the first being a panel of managers and the second a panel of peers.", "Interview Questions": "Lots of \"tell me about a time when\" questions, including the question \"Tell me about a special memory you have with a patient\""}, {"date": "7 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Feb 2019", "Interview Descriptions": "The interview for the new grad RN program was two back to back panel interviews. I spoke with 5 nurse managers in the first panel, and 5 nurses (one from each of the manager's units) in the next panel.", "Interview Questions": "Most of the interview questions were \"tell me about a time when\" questions. For example; tell me about a special experience with a patient, tell me about a time where you helped improve safety, etc"}, {"date": "20 Feb 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Jan 2019", "Interview Descriptions": "Schedule a 30mins phone interview. 2 managers on the phone. It took half of the time for them to explain the job opening and 10mins for candidate to talk about their experiences. Then they run of off time and let 5mins for questions.", "Interview Questions": "Tell us about your experience"}, {"date": "19 Jan 2022", "title": "Quality Assurance Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Atlanta, GA) in Jan 2019", "Interview Descriptions": "Recruiter reached out to me about the position and spoke with me twice, then a scheduled an interview with the hiring manager,  another interview with the department head, and then an interview with the recruiting team member again.", "Interview Questions": "Experience with blood product, experience with quality improvement, experience working in a lab"}, {"date": "15 Nov 2018", "title": "Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Nov 2018", "Interview Descriptions": "1 round telephonic and total 4 rounds at onsite. each onsite interview will have 2 or 3 ppl. total 4 hr it will take. During this time, you will be only offered free water.. no lunch. you need to bring from home or buy there. :) \r\ntelephonic interview was easy and more of sql , data modeling, role based, why this company etc...\r\nonsite interview.. be ready and refresh your 10 years old projects and work. 1 round with director , 1 with product owners and it will be allmost role based question.\r\n1 round for sql  and 1 round for data modeling and MPP architecture and performance, partition etc..\r\nHonestly, all these questions were 10 years old interview fashion.  On top of it, lady was not at all interested to listen my answers. i feel they are just wasting time.", "Interview Questions": "about project, method of project execution, data modeling, MPP, sql etc... questions were not difficult at all but all are old technologies questions and old fashion style of interview."}, {"date": "8 Feb 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Bellevue, WA) in Nov 2018", "Interview Descriptions": "The interview process was fairly straight forward.  First I had a phone interview, then had two different in-person interviews; one in Bellevue, and the next at the main campus in Seattle.  I was interviewed by  various staff members of the department.", "Interview Questions": "What is your best technical asset? "}], [{"date": "13 Nov 2018", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle Children's (Seattle, WA) in Oct 2018", "Interview Descriptions": "I got an email saying they were only doing in-person interviews, so I  had to fly out to Seattle for a 30 minute interview. They took a week longer than promised to give me an answer", "Interview Questions": "What was one hardship you had to overcome? "}, {"date": "9 Nov 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seattle Children's (Seattle, WA) in Oct 2018", "Interview Descriptions": "Everyone was really welcoming and helpful. It was a long interview process. It took 5 weeks, 5 interviews, and a reference check before I unfortuantely got  passed on the position, but I think it seems like a great company to work for and I'll be applying to other positions.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "8 May 2019", "title": "Grants and Contracts Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Seattle Children's (Seattle, WA) in Sept 2018", "Interview Descriptions": "Initial phone screen, then two rounds of on-site interviews with peers, managers, and the head of the department. \r\nIn August, I applied. In early September, I had a phone screen and was asked if I'd like to come in for an interview for a lesser role than I applied for. I declined, and a few weeks later a different department reached out for an in-person interview. I then had two in-person interview sessions over 2 weeks. The first was with my would-be supervisor, a manager, and my colleagues. The second was with those folks again and then with the heads of the department. I received an offer shortly after, negotiated briefly, and started a month or so later.", "Interview Questions": "All questions focused on my experience with the work at hand. A few behavioral questions were thrown into the mix as well."}, {"date": "30 Jul 2018", "title": "Family Service Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seattle Children's", "Interview Descriptions": "The interview process started with a phone interview with hiring manager. This lead to an in-person interview onsite. the facility was downtown Seattle, not at the main Seattle Children's Campus. interviewer was friendly, but job expectations were unclear. t", "Interview Questions": "describe your working style"}, {"date": "21 Aug 2018", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's in Jul 2018", "Interview Descriptions": "received emails, had a 25 minute phone interview a week later. had a 20 min skype interview two weeks later. interviewed by two people.  was contacted/ turned down a week or two later.", "Interview Questions": "why are you leaving your current job? what kind of experience do you have? do you have experience working with kids?\r\n"}, {"date": "28 Sept 2018", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Seattle Children's (Seattle, WA) in Jul 2018", "Interview Descriptions": "First phone interview was canceled minutes before it was to begin. Second phone screen was canceled at the last minute. After (finally) having a phone interview, I was told almost three weeks later the recruiter forgot to forward my info to the hiring manager. At that point, I could have cared less.  Seattle Children's could have cared less, too...never contacted me again.", "Interview Questions": "Standard-issue questions with a mention here and there about \"provider fatigue\" due to the nature of the staff at Seattle Children's.  "}, {"date": "13 Jun 2018", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's in Jun 2018", "Interview Descriptions": "I received an email to set up a phone interview with the hiring manager. After about a 30 minute phone interview, I was invited to come for an in person panel interview.  It was the hiring manager and another supervisor. The questions were basic behavioral questions. The only turn off is that they are writing your responses down on a worksheet so it’s awkward to engage with the interviewer as they furiously write. They told me right at the interview they wanted to move forward. HR contacted me to provide references via a link. Less than a week later, the hiring manager called to offer me the job. Overall, very smooth and seamless.", "Interview Questions": "How do you handle dealing with an upset parent/customer/patient?"}, {"date": "30 Jun 2018", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seattle Children's (Seattle, WA) in Jun 2018", "Interview Descriptions": "I applied for this position online about 10 days before I got the email for scheduling for a phone interview. The process is fast. And during my phone interview, my interviewer is very nice, and always elaborate on the questions that I need more info about. The phone interview is very straightforward, about base and situation questions. it lasts about 45 minutes. She told me to come in for an in-person interview next week, there will be 2-3 supervisors.", "Interview Questions": "why are you interested in Seattle Children's? "}, {"date": "4 Jun 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in May 2018", "Interview Descriptions": "I applied through Seattle Children's online career site. After 2 weeks, I received an email to do a 30 minutes phone interview. The last step was an in-person interview with three people in the lab.", "Interview Questions": "Do you have experience in clinical research?"}, {"date": "16 Apr 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seattle Children's", "Interview Descriptions": "They posted it online and applied on their website. Hiring process was tough because I have to wait until the end of the day.  Accepted the job offer.", "Interview Questions": "How did you learn about Seattle Children's?"}], [{"date": "22 Sept 2021", "title": "Operario De Limpieza Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle Children's (Seattle, WA) in Mar 2018", "Interview Descriptions": "Una Entrevista muy ligera para lo que pedían se salió adelante y la gente siempre tuvo una actitud servícial y de bondad muy rápida y eso si hay que trabajar bien", "Interview Questions": "Ya habías trabajado en algún otro lado?"}, {"date": "7 Aug 2018", "title": "Audiology Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Seattle Children's (Seattle, WA) in Mar 2018", "Interview Descriptions": "I was given the opportunity to observe the assistants at work doing their daily duties. I was then taken to a conference room and interviewed by a panel of approximately 9 people.", "Interview Questions": "Tell me about your strengths and weaknesses. "}, {"date": "23 Nov 2021", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Mar 2018", "Interview Descriptions": "Phone interview to review skillset and cultural fit. Reviewed resume and cover letter points. Follow up interview with in person panel interview to further discuss experience and mutual compatibility. Additional interview with leadership level with similar questions.", "Interview Questions": "How would you approach the development of a business requirement?\n\nHow would you deal with a dissatisfied customer? "}, {"date": "12 Feb 2018", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Seattle Children's", "Interview Descriptions": "The process went over a four week span. First, I was contacted to have a phone interview with the manager of the department. This lasted 15 minutes. A few days later, I was contacted for an in-person interview with the manager. A day later, I was told I made it to the final stages, and was asked to come in for an in-person panel interview a week later. I interviewed with 15 people, over a 5 hour period. I was contacted two weeks later that I didn't get the job.", "Interview Questions": "Describe a time where you failed in reaching your goal."}, {"date": "24 Feb 2018", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seattle Children's (Seattle, WA) in Feb 2018", "Interview Descriptions": "Easy going interview. Be prepared and confident to answer lab and phlebotomy related questions. Use experience from previous jobs for experience based and scenerio based questions. Use personal and professional references and be quick with email replies and communication between hiring staff.", "Interview Questions": "Why do you want to work here ?"}, {"date": "26 Mar 2018", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seattle Children's (Seattle, WA) in Jan 2018", "Interview Descriptions": "40 minute phone interview, then an in person 40 minute. Only thing I didn't like was after the in person I never heard anything. Didn't even get a automated \"you didn't get the job\" email.", "Interview Questions": "Mostly asking about previous work experience"}, {"date": "27 Feb 2018", "title": "Research Scientist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Seattle Children's in Jan 2018", "Interview Descriptions": "First round was a brief phone interview and then they checked out my references and asked me to give a 15min presentation on my previous research. The final interview was incredibly well structured- all members of the lab were invited to attend and ask questions, I was given time to ask questions and then all upper level supervisors and the PI left me to ask questions of the fellow research scientist I's and II's.", "Interview Questions": "What are you interests, future career goals etc"}, {"date": "28 Apr 2018", "title": "Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Jan 2018", "Interview Descriptions": "Very friendly. Easy process. Not many questions asked. I was not a good fit but the people seemed really nice.  They were really invested in their mission and wanted to grow but the core job was under my skill set.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Jan 2018", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Jan 2018", "Interview Descriptions": "Very organized. Shadowed the day before, then was the first group to be sent off to interviews. One 30 min interview with manager, then one 30 min interview with peers.", "Interview Questions": "How do you commit to diversity?"}, {"date": "9 Nov 2017", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Online process takes a while. Submit application, resume, answer basic interview questions, 5 references. In person interview finally scheduled. Very friendly staff and hr. Excited for interview. I will give update.", "Interview Questions": "Experience in customer service"}], [{"date": "22 May 2020", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in Nov 2017", "Interview Descriptions": "All day process, meeting with each lab member individually and going out to lunch. Individual interview and less formal information meetings. Also joined and observed lab meeting. Lunch was more informal. Frequently asked about research background and goals.", "Interview Questions": "Grant writing goals, in specific detail"}, {"date": "2 Nov 2017", "title": "CI Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seattle Children's (Seattle, WA) in Oct 2017", "Interview Descriptions": "I applied via LinkedIn and was contact about two weeks later for a phone interview. Phone interview was standard questions for first interview to gauge fit for position requirements and ended with request for an in person., scheduled for one week later. In person interview was a panel of three employees and myself. Pretty straight forward, low key, very personable. Request for second interview the following week. This interview was a scenario you prepare for to show your skills for the position. I received recommendation request a few days later and an offer a few days after that.", "Interview Questions": "Think of one person in your current organization that you WOULDN'T use as a reference. What is one word they would use to describe you, why do you think they'd describe you that way?"}, {"date": "11 Nov 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in Oct 2017", "Interview Descriptions": "Upon arrival you meet with security; hospital takes security very seriously. You then meet with your recruiter and they escort you to the unit. Composed of charge nurse, nurse manager, and clinical education. Recall previous work experience, work/education goals, future plans etc.  Panel explains to you duties, unit expectations, schedule and orientation process. Some will even go into benefits and advantages of working there.", "Interview Questions": "Where do you see yourself in the next year? Next three years? "}, {"date": "30 Sept 2017", "title": "RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle Children's (West Seattle, WA) in Aug 2017", "Interview Descriptions": "The application for the residency opened in July, and had an interview date of August 16. I received the offer to interview in mid-July. After being asked to interview, 5 references had to be submitted via the online portal. I was assigned to group 1 for interview day. We arrived at Children's, and were all shuttled downtown where the interviews took place. One interview was with unit managers, and one was with peers. Was informed about offers by 4 pm the same day. Overall process was highly organized and took ~2 months.", "Interview Questions": "Tell us about a time you encountered a change you were not expecting. How did you handle the change?"}, {"date": "31 Jul 2017", "title": "Service Desk Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Jul 2017", "Interview Descriptions": "Simple process starting with contact from the HR person. Followed up with 30 minute phone interview and then about a 45 minute onsite interview. Both interview sessions ended up with the same Director and Hiring Manager. They are both very nice people and easy to talk with.", "Interview Questions": "Standard questions about skill sets and some HR type questions"}, {"date": "13 Aug 2017", "title": "Dietetic Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Jul 2017", "Interview Descriptions": "First part of the interview was an explanation of the job and benefits. Second part was me introducing myself and my background, answering questions from the interviewer and wrapping up with my questions for the interviewer.", "Interview Questions": "Why do you want to work here?"}, {"date": "23 Jun 2017", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle Children's (Seattle, WA) in Jun 2017", "Interview Descriptions": "The interview was a waste of time. It was with 2 people. 1 of them was disinterested the entire time. They asked me brief and easy questions (Was I finished with my degree and licensed?) it was obvious they didn't actually look through my resume. I was only there for 10 minutes. 5 days later I got an email saying I didn't get the job.", "Interview Questions": "Why do you want to work at Seattle Children's?"}, {"date": "22 May 2017", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seattle Children's", "Interview Descriptions": "I applied for the Clinical Research Associate I position through the SCH career website. I was called to schedule an in-person interview. I met with several research fellows and the other research associates on the same day. The next week, I met with the PIs to do another interview.", "Interview Questions": "Typical interview questions like \"why do you want to work here\", \"how well do you work in teams\", \"ever had a conflict working with a team\", \"how do you deal with stress/failure\"\r\n\r\nThere were other random questions like \"what makes me unique\", \"what's my learning style\", \" best advice I've ever received\""}, {"date": "12 Oct 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle Children's (Seattle, WA) in May 2017", "Interview Descriptions": "Panel of supervisors and pharmacy manager interview you in conference room. They all have a copy of your resume and will ask you questions about experience and yourself as a worker.", "Interview Questions": "Why do you want to work here? "}, {"date": "2 Jun 2017", "title": "Manager, Constrution Oversight Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Apr 2017", "Interview Descriptions": "I found the job on another jobs-site and then applied online through SCH's application process.  The interview process consisted of 3 Steps: 1) 30 minutes phone screen w/hiring manager (prospective supervisor), 2) 60 minute in person interview with hiring manager, 3) 60 minute panel interview with organizational peers", "Interview Questions": "What is your biggest concern about taking on this job?"}], [{"date": "5 May 2017", "title": "Manager/Plant Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Mar 2017", "Interview Descriptions": "Interviewed with the Regional Director of Facilities and 3 of his direct reports. It was a very comfortable experience, great conversations and learned a lot about each. I was nervous as it was my first interview in over 12 years but they made me feel as ease after the first few minutes. After the interview which lasted about 45 minutes I spent another 40-45 minutes touring the hospital campus with the RD and had excellent conversation. Thought everything went well and he was speaking as if I was an excellent fit for their department but, after 4 weeks and not returned follow up voicemails to the RD I can only assume they went in another direction.", "Interview Questions": "You having a Director's level experience, why would you apply for a manager position? We have a director..."}, {"date": "9 Aug 2017", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Feb 2017", "Interview Descriptions": "It was a behavioral interview. they gave you situations and asked how you would handle them. It is very similar to most job interviews. You can google behavioral base interview questions to help you prepare", "Interview Questions": "How have you handled a disgruntled customer in the past"}, {"date": "24 Apr 2017", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Seattle Children's (Seattle, WA) in Feb 2017", "Interview Descriptions": "Hiring manager arranged for a phone interview by email. Mngr phoned me late due to a meeting. Cell reception was not great where mngr was. Mngr was polite but seemed  bored like decision had already been made, especially when she asked me for questions. Did not inform me of decision until 3 weeks later.", "Interview Questions": "Why Seattle Children's?"}, {"date": "17 Feb 2017", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Feb 2017", "Interview Descriptions": "Phone interview was scheduled about a week after I applied online. Interview took about 20 minutes, all fairly simple questions. I was asked why I wanted to change careers, and why I wanted to work for Seattle Children's. I was also asked to give an example of what I know about the organization's activities/research work.", "Interview Questions": "Can you give us an example of difficulties you faced at your previous workplace?"}, {"date": "23 Dec 2016", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in Dec 2016", "Interview Descriptions": "Applied online, received a call back ~2 weeks later to schedule a 30-minute phone screen. At the end of the phone screen, was asked to schedule a 30-minute panel interview, but ended up being a 1-on-1 interview. Normal, easy questions as long as you prepared accordingly. Lots of customer service/problem solving/company value-specific questions.", "Interview Questions": "How do you demonstrate our ART ( Accountability, Respect, Teamwork) standards? Give a specific example."}, {"date": "8 Nov 2016", "title": "Family Service Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "I was contacted by email to schedule a brief phone interview about a month after applying. Phone interview took place the following week and lasted 35-40 minutes. The follow-up from that was about a week after.", "Interview Questions": "Why are you interested in Seattle Children's?"}, {"date": "9 Sept 2016", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seattle Children's (New York, NY)", "Interview Descriptions": "Started off with a phone interview that lasted about 25 min and scheduled an in person interview for the following week. Both interviews had a lot of situational questions and asked for examples of leadership, adaptability, and customer service. In person interview was a group interview (3 ppl) about 35 min. Very nice people and environment.", "Interview Questions": "Name a time when you were challenged in the workplace and how you worked through that"}, {"date": "21 Oct 2016", "title": "Registered Nurse Medical Unit Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle Children's (Seattle, WA) in Sept 2016", "Interview Descriptions": "I submitted an application online and heard back from them weeks later requesting references. After this, I received a phone call setting up an in person interview one week later. The interview was one on one with an assistant manager and lasted about an hour and consisted of 10 questions. After this I was offered a tour of the unit.", "Interview Questions": "Describe yourself in three words. \r\n\r\nWhy do you want to work at Seattle Children's? \r\n\r\nDescribe a time you had to deal with change. "}, {"date": "12 Aug 2017", "title": "FSC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Sept 2016", "Interview Descriptions": "First their was a phone interview that took about 15 minutes, then an in person interview with 2 supervisors that took 30-40 minutes. It was pretty straight forward and easy to navigate", "Interview Questions": "What does diversity mean to you?"}, {"date": "16 Oct 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Children's (Seattle, WA) in Aug 2016", "Interview Descriptions": "I interviewed before the RN residency started in 2016  so it was just the hiring manager. I believe now it is a longer process with a panel of nurse managers.", "Interview Questions": "Tell me about a difficult situation with a co-worker, and how you handled it. \nDescribe for me a time when you had to adapt to a difficult situation. What did you do?\n\nDescribe for me what you do to handle stressful situations.\n\nDescribe for me a time when you had to delegate to a person.\n"}], [{"date": "9 Jun 2016", "title": "Clinical Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "It began with a phone interview with the hiring manager then an in person interview with the manager and the team. The phone interview was really nice, lots of questions. It wasn't intimidating at all. I would say the most difficult part is the panel interview but that always depends on how well you do when talking in front of people. There was about 7+ people in the panel interview. With all the eyes staring at you and the awkward silence,  you really have to keep the conversation going with questions.", "Interview Questions": "Why do you want to leave your current position and why? What makes you want to work at children? What regulatory experiences do you have? Have you worked with grading toxicities? How do you handle stress?"}, {"date": "6 Jul 2016", "title": "Data Analyst - Emergency Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in Jun 2016", "Interview Descriptions": "1.  Applied online\r\n2.  Was requested by HR to write a cover letter to send in\r\n3.  Phone interview with hiring manager\r\n4.  Phone interview with another data analyst (the one that was leaving)\r\n5.  Phone interview with a department leader the following week\r\n6.  On-site interview with other directors, department leaders, and admin team (total 9-10 people, panel and 1-on-1 interviews) on a Tuesday\r\n7.  Was verbally offered the position by hiring manager on Friday and given a week to accept\r\n8.  Monday was a holiday, so on Tuesday I asked a few questions regarding the package and negotiated, was told there will be zero concessions\r\n9.  On Wednesday at 9am, HR decided to rescind the offer\r\n\r\nMy references and background are stellar, by the way.  Perhaps they don't like people who negotiate.\r\n\r\nA shame since Seattle Children's is a fantastic hospital.  It would have been very rewarding to work there, but a company that goes back on their word is a huge red flag.", "Interview Questions": "Behavioral and situational questions, questions about experience"}, {"date": "2 Jun 2016", "title": "Family Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seattle Children's (Seattle, WA) in May 2016", "Interview Descriptions": "Straightforward process. Over-the-phone interview first with some pretty expected screening questions followed by an in-person interview a week later. In person interview was with two hiring managers who showed up late to the interview. Interview questions were straightforward generic interviewing questions. Office where interview was held felt a bit cramped but was otherwise comfortable enough.", "Interview Questions": "What do you think your duties will be on this job?"}, {"date": "16 May 2016", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in May 2016", "Interview Descriptions": "I applied online. The lab head reached out to me directly and we did a short phone interview. Based on the phone interview and talking to the director, it was followed by a more extensive videoconferencing interview with current members of the lab, two directors, and a short research presentation.", "Interview Questions": "What are your career goals and how would this job fit into that plan?"}, {"date": "29 Apr 2016", "title": "Registered Nurse, Psych Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "Very short interview, only about 10 minutes. Casual and friendly interviewers, make you feel comfortable and relaxed while still asking some real thinker-type questions. Had three people sitting in on the interview, asked about 6 questions total then contacted me in about a week to offer the position.", "Interview Questions": "Questions were out of the box and regarded the interviewee's ability to reflect on and discuss their own life. Weren't the type of questions you come prepared to answer."}, {"date": "26 Aug 2017", "title": "Surgery Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Children's (Seattle, WA) in Apr 2016", "Interview Descriptions": "The phone interview was brief, and I was called in to the actual interview where some generic questions were asked. They are usually hiring several coordinators at once so expect there to be a couple hiring managers interviewing you for different departments.", "Interview Questions": "What would you do if you saw a coworker telling a family information you knew was wrong?"}, {"date": "16 May 2016", "title": "Health Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Apr 2016", "Interview Descriptions": "Interview went very well. questions that were asked were very easy to answer. I felt very comfortable there compare to other interviews I have done.I was interviewed by the supervisor and two other health information specialist.", "Interview Questions": "Can you tell me a time you had to be responsible for your own actions?"}, {"date": "7 Jun 2016", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle Children's (Seattle, WA) in Apr 2016", "Interview Descriptions": "Simple phone class then met one on one with coordinator. It lasted for only 10 minutes and was really casual. It tooks about a week where I got an email with no job offer", "Interview Questions": "Asked general get to know you questions and identifying experience and strengths"}, {"date": "26 Mar 2016", "title": "Director of Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Seattle Children's", "Interview Descriptions": "It was a pretty typical interview process - preliminary screen and then interviews with multiple team members. The questions weren't difficult. It was mostly a get to know you type of interview.", "Interview Questions": "Fundraising experience."}, {"date": "17 Apr 2016", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in Mar 2016", "Interview Descriptions": "Had a phone interview first. It was simple and easy and the call lasted about 15 minutes. The interview then wanted to meet for a in-person interview the following week. The interview lasted about 25 minutes and was with 2 people. Simple and easy.", "Interview Questions": "What was a stressful situation you had to deal with and how did you go about it?"}], [{"date": "18 Jul 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Seattle Children's (Seattle, WA) in Mar 2016", "Interview Descriptions": "Fairly easy interview process with basic nursing interview questions. Behavioral, scenario, and situational questions.  One round with manager and one round of peer interviews. Manager called me the same day to let me know I got the job.", "Interview Questions": "Name a time you you positively influenced a patient"}, {"date": "16 May 2016", "title": "Clinical Practice Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Seattle Children's (Seattle, WA) in Mar 2016", "Interview Descriptions": "Long interview, phone, panel. drug test, background check. Lots of emails back and forth. Required 5 professional references. You have to pay for parking, which is not disclosed. On boarding is interesting, you have to make an appointment, which is first come first serve.", "Interview Questions": "Why I choose to work there."}, {"date": "17 May 2016", "title": "Family Service Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in Mar 2016", "Interview Descriptions": "I applied online and got a call a few days later for a phone interview/screening. It lasted about 30 minutes, and the questions asked were mostly behavioral. I was offered an in-person interview at the end of the phone screening, and in-person interview is this week.", "Interview Questions": "What challenges do you think you will face in this position?"}, {"date": "15 Aug 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in Jan 2016", "Interview Descriptions": "Applied online, followed advice I read on glassdoor to include key words from job description on resume because resumes are filtered by computer.  Definitely recommend this.  Got a call asking to come in for interview.  Similar interview to other reviews-met with directors and staff, some one on one and also a group setting.  Interview are long.", "Interview Questions": "Mostly standard interview questions.  My advice is to look through the questions listed on glassdoor reviews.  Have examples ready of your strengths and weaknesses, a time you performed well, did not perform well etc so you aren't caught off guard."}, {"date": "14 Apr 2016", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Seattle Children's in Jan 2016", "Interview Descriptions": "I already work for this employer and applied internally. Interview process was frustrating, especially a meeting with upper level directors who were condescending and rude.  Hiring manager never bothered to notify me about the outcome of the interview, which is a violation of the institution's own policy.", "Interview Questions": "Several questions were asked repeatedly.  I felt that the interviewers didn't really want to be there."}, {"date": "23 Nov 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Seattle Children's", "Interview Descriptions": "Program Coordinator wasn't the exact title but the job description made it sound like a scheduling/program coordinator. I interviewed approximately 2 years ago. I was actually turned off by the interview process. It started with a phone screen, which wasn't coordinated in advance. Then I met with two interviewers who couldn't elaborate on their questions when I asked them to. By this point, I was turned off, but I decided to go for the short orientation or tour they had me do. This wasn't bad at all, except I was pretty much left by myself for half an hour. I was invited for a second interview but I declined.", "Interview Questions": "Questions about their mission and how it matches my work experience."}, {"date": "19 Nov 2015", "title": "Training Curriculum Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "2 phone interview and 1 face to face. The phone interviews were pretty relaxed. The face to face was a little more intense and was followed by a presentation which I prepared to showcase my technical training skills.", "Interview Questions": "Why do i want to work for Seattle Children's Hospital?"}, {"date": "11 Nov 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "It was friendly, the interviewee met with several different people over the course of a day, both separately and in small groups. Meeting were both with potential coworkers as well as supervisors. There were no gotcha questions or weirdness. The interview was in the office where the job was located in downtown Seattle, and included a bit of a tour.", "Interview Questions": "Describe a situation in which you had competing priorities from different people above you - how did you handle that? "}, {"date": "31 Jul 2016", "title": "Animal Care Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Seattle Children's (Seattle, WA) in Sept 2015", "Interview Descriptions": "Brief, they seemed desperate for employees (I can see why now, can't keep long term employees due to almost immediately seeking work elsewhere).  It was very informal an relaxed, more conversational than an interview.  Pleasurable experience, non stressful.", "Interview Questions": "Technical questions, inquiring as to procedures I have performed."}, {"date": "5 Aug 2015", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "The interview process was informal and relaxed. I met with the principal investigator and we had a one-on-one interview that lasted about 30 minutes. He then showed me around the lab area.", "Interview Questions": "I was asked about my previous experience working in the biotechnology industry. "}], [{"date": "29 Jul 2015", "title": "Family Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's in Jul 2015", "Interview Descriptions": "I received a call from a recruiter and scheduled a phone screening the following day.  The call lasted nearly 45\" and the recruiter was well-spoken and had good telephone demeanor.  The hours and schedule for the position are not prime for finding candidates:  Fr, Sat, and Sunday (days different from what is stated on their corporate careers job center) into the evening, and though the screening call went well, it seemed the compensation range wasn't reflective of the difficulty of committing to this schedule/hrs for little pay.  That was a couple weeks ago and haven't heard back; job is still  listed on their website.\r\n\r\nAs a side note, this position still lists the wrong days as part of its shift - Th, Fr, Sat instead of Fr, Sat, Sunday - unless hr changed it without updating the job posting.", "Interview Questions": "They were all behavioral questions; routine hypothetical situations screening for initiative, adaptability, and teamwork."}, {"date": "14 Jun 2015", "title": "Family Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seattle Children's (Seattle, WA) in Jun 2015", "Interview Descriptions": "Had two interviewers, both were about 15 minutes late. They asked plenty of situational questions but not much about me, did not say much about the position itself until i asked.", "Interview Questions": "Name a time when you and  coworker did not see eye to eye. How did you resolve the situation?"}, {"date": "10 Jul 2015", "title": "Graphics Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Seattle Children's (Seattle, WA) in Jun 2015", "Interview Descriptions": "I received an email requesting an phone interview from a recruiter. She coordinated it and the hiring manager called me for a 30-minute conversation. I followed up two weeks later. I heard directly from the hiring manager that they had chosen another candidate. I appreciated the personal phone call.", "Interview Questions": "What would a former boss say is your biggest strength?"}, {"date": "13 May 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "3 layers of interviews.  The first was with a would-be co-worker (sorted out who should be considered).  The next was with the rest of my other would-be coworkers and the hiring manager.  The last interview was with the hiring manager and the VP.  After being here for some time now, I can say the process differs for each hiring manager.  Each hiring manager has their own preference on gettting HR, peers, leadership in the hiring process.", "Interview Questions": "Typical questions on my background and experience."}, {"date": "29 May 2015", "title": "Research Associate II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA) in May 2015", "Interview Descriptions": "I was emailed about coming in for an interview.  When I turned up for the interview I talked with the PI for about 30 minutes.  Some of the locations are tricky, so make sure to ask for detailed instructions as their website is not specific enough.", "Interview Questions": "Why are you interested in this position?"}, {"date": "20 Apr 2015", "title": "Family Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's in Apr 2015", "Interview Descriptions": "Did a phone interview.  The hiring manager did not know the hours for the position and did not know the pay scale.  I applied for a part-time position that was supposed to be Monday - Thursday.  During the interview she said the position was Monday - Friday.  I told her that I applied for a part-time position.  She replied that she had decided to change the position to full-time.  She should had let me know about this to see if I would still be interested in the position.\r\n\r\nShe scheduled an interview with me.  I had to have unplanned minor surgery the day before my interview.  I had to cancel the interview due to doctors orders.  I asked if we could reschedule for the day after the day of the originally scheduled interview.  The hiring manager was unwilling to reschedule.", "Interview Questions": "Give an example of self starting."}, {"date": "3 May 2015", "title": "Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Seattle Children's (Seattle, WA) in Mar 2015", "Interview Descriptions": "3 people in panel interview. Very informal. Asked me what I had done in my previous lab. Looked over resume, and asked me some questions from it. Interview lasted like 20 minutes. I was hired 3 days later.", "Interview Questions": "What type of flow cytometry did you perform?"}, {"date": "24 Jan 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "They contacted me quickly after applying to set up an interview. I met with a few different groups of people including potential coworkers with same job title, administrative managers, etc in a group setting. People were friendly and interesting to talk with. They wanted to know my technical skills in Microsoft Office and writing skills. They asked a long list of standard interview questions. There were two in-person interviews and follow-up questions by phone. Not much orientation to the larger hospital - was kind of left on my own to figure out where everything was.", "Interview Questions": "What is your definition of customer service?"}, {"date": "18 Feb 2016", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle Children's (Seattle, WA) in Dec 2014", "Interview Descriptions": "Submitted my application and got a response abput a month later. They brought me in for an interview which took about 15-20 minutes. Then called me a week later to offer the job! Great experience and very straight forward. The questions tend to be based off the ART standards. This is accountability, Respect, and teamwork. So be sure to have some examples ready!", "Interview Questions": "How do you feel you relate to our ART standards? (Accountability, Respect, Teamwork)"}, {"date": "20 Jan 2018", "title": "Family Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Seattle Children's (Seattle, WA) in Dec 2014", "Interview Descriptions": "Phone screening and in-person panel interview. A series of basic situational questions, mainly around team work and customer service. Then I had a few minutes to observe with someone already doing the job.", "Interview Questions": "What would you do if you saw a coworker making an error?"}], [{"date": "10 Nov 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle Children's", "Interview Descriptions": "Brief phone interview with only general questions. Upon learning about my experience as an undergraduate in a plant biology lab they asked if I knew anything about human biology. despite my repeated assurances that i was well versed in human biology, from that point on they seemed unhappy with my answers. It also seemed like the phone interview was the first time they were actually looking at my resume.", "Interview Questions": "give an example of time management"}, {"date": "4 Aug 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Phone Interview then In Person Interview. They gave a tour of the research facility during the in-person interview. Said they would call within a week but did not get a notice until over a month later.", "Interview Questions": "Asked about past experience and education."}, {"date": "11 Jun 2014", "title": "Health Promotion Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Seattle Children's", "Interview Descriptions": "Was in the system at SCRI as an intern and applied internally. Process was done in less than a week; drug test was required within 10-14 days or so of accepting job offer. Helps if you have someone you know already in the system to refer you - networking is highly recommended.", "Interview Questions": "No difficult or unexpected questions. "}, {"date": "5 Jun 2014", "title": "Credentialing Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Seattle Children's", "Interview Descriptions": "Very typical - phone interview. one inperson interview and an offer the next day. Questions were standard. lots of 'please give us an example when you...' types of questions.\r\nNothing out of the ordinary.", "Interview Questions": "Second interview was with a small panel. this was not difficult but was not expected.\r\nin the time that i have been here i have seen many people hired. its seems like on average the process taken much longer then what i experianced. "}, {"date": "20 May 2016", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Feb 2014", "Interview Descriptions": "Contacted by phone by department manager for initial discussion on job and if it was an interest.  Scheduled for an informal phone interview with manager thereafter.  Then met for two separate panel style interviews within the department and team. Received a call back about a week later with the job offer.", "Interview Questions": "What does diversity mean to you; applied to your work?"}, {"date": "24 Jan 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seattle Children's", "Interview Descriptions": "Phone interview, in-person interview", "Interview Questions": "Nothing unexpected"}, {"date": "9 Nov 2013", "title": "Principal Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "My interview began when a division chief asked: \"how hold are you and how large is your family\".  A week before I was to start, $150K had mysteriously disappeared. Peers around my hiring manager didn't know a new faculty member was being onboarded.", "Interview Questions": "Describe where your successful NIH-funded research program will be in 5 years."}, {"date": "23 Aug 2013", "title": "Clinical Research Associate I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Children's", "Interview Descriptions": "Did not have a phone interview. I was called for an in-person interview. It was very laid back and casual. They said they will inform me if I am selected for the next round. Haven't heard from since then.", "Interview Questions": "Questions were very casual and related to my past work experience"}, {"date": "8 Jun 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Seattle Children's", "Interview Descriptions": "After applying, I received a phone call from HR to schedule an interview. The first part was a peer-interview, where I met 5 current RNs and the unit educator and they asked me fairly standard interview questions. This was intimidating, but overall beneficial because I could get a sense right away if I would enjoy working on the unit. After the 45 minute peer interview, I had a one-on-one interview with the unit manager, who explained more of what the position entails and asked me more standard interview questions. I then waited for about a week before receiving a phone call with a job offer.", "Interview Questions": "Most of the questions were very basic interview questions. During the peer interview I was asked, \"what would you do if a family complained to you about another nurse?\", and also \"tell me about a time you were involved in a conflict with a peer and how did you handle it?\". Those types of questions were expected, but can be difficult to answer if you don't have a specific experience in mind to talk about."}, {"date": "29 Dec 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Seattle Children's (Seattle, WA) in May 2013", "Interview Descriptions": "The interview process was pretty standard.  I applied via company's website and got a call from the hiring manager for an in-person interview. I did not have a HR interview.", "Interview Questions": "Questions were targeted at past experience and behavioral questions. Nothing different from other standard interviews."}], [{"date": "21 Nov 2013", "title": "Surgery Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seattle Children's (Seattle, WA) in Oct 2012", "Interview Descriptions": "Phone interview followed by in-person interview with department supervisor and manager", "Interview Questions": "How do you handle conflict "}, {"date": "5 Oct 2012", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seattle Children's (Seattle, WA) in Sept 2012", "Interview Descriptions": "I first had a phone interview with one of the recruiters then I was invited to a group/panel style interview that lasted about an hour. After this process I was called in to do a 1:1 with each person I would be supporting. Nice people, committed to the hospital's mission. The environment is really positive and the people are genuine.", "Interview Questions": "NONE, standard questions"}, {"date": "12 Jun 2015", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Sept 2012", "Interview Descriptions": "The interview went well with lots of questions about past work experience. I could tell the hiring manager was strict and unfriendly but very brilliant. I received a short tour of the floor I would be working on but did not meet anyone else. \r\n\r\nThe onboarding process was awful. I sat with an individual from HR for about 10 minutes who explained the benefits and that was it. My boss did nothing either. I felt very lost for the first 6 or so months trying to learn everything on my own.", "Interview Questions": "Are you planning on leaving for Medical School? If so please don't accept this position."}, {"date": "30 Jul 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Seattle Children's (Seattle, WA)", "Interview Descriptions": "Phone interview; interview loop with 5 individuals", "Interview Questions": "What's the last business book you've read?"}, {"date": "3 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Seattle Children's (Seattle, WA) in Nov 2011", "Interview Descriptions": "Met with hiring manager. One on one interview. Q & A. Very pleasant. Answered all my questions.", "Interview Questions": "Describe an experience that did not go as planned and how did you react?"}, {"date": "11 Jul 2011", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Seattle Children's (Seattle, WA) in Jun 2011", "Interview Descriptions": "Manager wasn't even present for the interview. The two girls who interviewed me were younger and seemed nice enough. They said they would make a decision in a week but then NEVER called me again. I left a VM to follow up and still never got a call back. I was a intern at another unit at Children's and to not even get a stock rejection email or letter is completely unprofessional (and hurtful) in my opinion. The interview itself was pretty easy (name a time you made a mistake and what did you do to fix it, etc.). I just don't appreciate at all that they never bothered to let me know that I didn't get the job, especially since I actually turned down another job offer just so I could interview there. Overall I was disappointed in the way this was handled.", "Interview Questions": "Name a situation where you made a mistake at work. How did you fix it."}, {"date": "19 Oct 2015", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in May 2011", "Interview Descriptions": "Calm, not intimidating, fair, relaxed. I was in a conference room with my future supervisor, she was warm and welcoming. She asked fair questions about my experience, my goals in life, etc. It was pretty average as far as interviews go.", "Interview Questions": "N/A"}, {"date": "19 Dec 2011", "title": "Learning & Development Administrative Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Seattle Children's (Seattle, WA) in Mar 2011", "Interview Descriptions": "I interviewed first with the hiring manager.  It was a very informative interview for me, while the discussion offered excellent opportunities for me to discuss my qualifications and how I could benefit the organization.  A week later I was invited back for a group interview with the team.  This was a STAR style behavioral interview.  The team did a great job of questioning me on how I might work with them and what experiences I have that would benefit their department.", "Interview Questions": "What was the most difficult coaching experience you had involving a negative behavior?"}, {"date": "14 Jun 2014", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Children's in Oct 2010", "Interview Descriptions": "When I originally started: Apply online, MUST include a cover letter or they won't even look at it. Match key words, first round of resume filters is done by computer.", "Interview Questions": "N/A"}, {"date": "4 Nov 2014", "title": "Psychometrist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Seattle Children's (Seattle, WA) in Sept 2010", "Interview Descriptions": "I circumvented HR and got the job.  I applied online twice for the same position and never heard from HR.  So I researched who the senior clinicians in the department were and sent them individual cover letters and my resume for review. That got their attention and they contacted HR to contact me.  It took Seattle Children's 1 year to fill the permanent part-time position.  You will interview with Director of department, Business manager of department, senior psychometrists, and psychologists. They are looking for how well you can manage challenging pediatric population, previous experience with standardized measures.  You'll be required to commit to continual performance improvement, they'll list many things they want, but they don't pay for, such as Certified Psychometric Specialist certification which i got while at Children's but it made NO difference to my pay.  Similarly they want you to show engagement in continual education through affiliation with professional organizations.  Again, while this is desirable it is not rewarded in any way.  Negotiate your starting salary, DO NOT accept the lowest end of your pay scale because it won't increase significantly over time no matter what you do.  Don't accept that this is just how 'non-for-profit' organizations work, because that's only how they work at levels that are unimportant to them.", "Interview Questions": "Make sure you are familiar with measures such as WISC-IV, WAIS-IV, WIAT-III, NEPSY, DKEFS, Teach, RCFT, WMS-IV,"}], [{"date": "1 Jul 2010", "title": "Administrative Assistant III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Seattle Children's (Seattle, WA) in May 2010", "Interview Descriptions": "The first round interview was with the direct supervisor.  I was able to get a broad description of the job and a understanding of the department's values and work environment.  The second round of interviews were with the Director, other Admin (sharing the office) and the 2 managers I would be supporting.  I got a greater understanding of the day to day activity, the group dynamic and the culture.", "Interview Questions": "How do you deal with difficult coworkers?"}]]