[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Elica is family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Jul 2023", "job_title": "Support Programs Manager in Sacramento, CA", "duration": "N/A", "pros": "Despite having multiple locations, Elica operates as one big team with shared goals, values and mission.", "cons": "Nothing to share at this time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic place to work at / Poor Management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Apr 2023", "job_title": "Referral Coordinator in Sacramento, CA", "duration": "N/A", "pros": "The is nothing good about this place", "cons": "Overwhelmed, stressful, unorganized, unprofessional, poor/ fake management,"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Don't go there. (DENTAL, ELICA NORTH HIGHLANDS OFFICE)", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 May 2023", "job_title": "RDAEF2 in North Highlands, CA", "duration": "N/A", "pros": "Awesome benefit package cannot stress this enough, awesome coworkers (not all of them) but have to admit at this place I met the best coworkers and organic people I never did at other dental offices.", "cons": "FAVORITISM LOTS of it. Management lacks a lot of talent. They rely on they're favorites to carry gossip to them about what is going on on the floor. No matter if this person is strong/knowledgeable/oblivious. You can see how they use the people to their benefit and it's so sad to see how they think they're so special and liked by the \"manager\". No true leader to follow sadly you found the true leaders being suppressed and shutted. They must stay quiet don't communicate anything with others if you want to keep your job. They will pick on you if you start to see things and speak out about it. Gossiping is a big thing even when you are talking good about someone which is crazy to me!!! I think they have this big rule just to control the information sharing so you don't truly know where you are standing as a new employee. My first 3 weeks at the job I loved it everyone tells you how good it is and how much you will love it (FROM MANAGEMENT). Once you start talking to your peers you start discovering things they're scared to share with you bcs you can tell on them and they get in trouble even by telling you just the truth. It's so corruptive people end up bending their knees to management to keep their jobs. Cuz the only way to gain recognition and respect is by bringing info to management. Then you become their best friend. In reality they're just using you which is so sad. The regional manager is even worst, she supports the behavior and will backed up the manager on anything. They seem to have a invisible contract to cover for each other they might be together or be super good friends; they know each other way before working together so speaking up to either one of them is dangerous don't trust anyone in management. Sadly you can tell the people above the regional don't really know whats going on she keeps the info very hidden and lies a lot. She even told me Human resources said that it was better for me to not finish after I gave my noticed. When I went to HR to pick up my check I asked her if it was HR decision and she told me no it was operations. Which I knew already just needed confirmation. I gave my resignation and they didn't let me finish lol bcs again you can bring info to the others and tell them your reasons for leaving and poison their minds with the truth. If you want good benefits but toxic work environment this is the place. Sadly the office has so much potential if it was run by good management with actual people skills. The one right now can't even make eye contact or have any type of true conversation with her employees you can tell every word she said it's forced or fake. If you don't see it right away you will eventually. Really have no idea how she still has her job. But thinking is the invisible contract I talked about before."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 May 2023", "job_title": "Community OUtreach Specialist in Sacramento, CA", "duration": "N/A", "pros": "Good benefits and PTO good stepping stone", "cons": "lots of favoritism good stepping stone"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Supportive Environment, But Caseload Burnout", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Apr 2022", "job_title": "Licensed Clinical Social Worker LCSW in Sacramento, CA", "duration": "N/A", "pros": "Great co-workers, good pay, good benefits", "cons": "Caseload is too high and management pressures you to meet with as many patients as possible. Management doesn't care about burnout."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Community Health", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 May 2022", "job_title": "Family Nurse Practitioner, Board Certified in Sacramento, CA", "duration": "N/A", "pros": "Serve vulnerable communities. Meaningful work. Great benefits.", "cons": "Some staff need additional training. Patients routinely no-show. Provider pay increases not guaranteed."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "My time", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Sept 2021", "job_title": "Medical Assistant in Sacramento, CA", "duration": "N/A", "pros": "good place to start working, great co workers", "cons": "Bad administration lackluster at best"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Growing company with growing pains, but aiming to do better!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Mar 2020", "job_title": "Anonymous Employee in Sacramento, CA", "duration": "N/A", "pros": "+ The Diversity in Ethnicities and Languages: I love seeing and hearing the different cultures and languages at Elica. I like that we strive to translate our materials so that we can connect with more patients.\r\n+ Free Chiropractor and Acupuncture Visits (30/year)\r\n+ NonStop Wellness\r\n+ Mileage Reimbursement\r\n+ Growing Organization\r\n+ Great Place to Start Your Career: there's lots to do here and I'm always finding something to do.\r\n+ Lots of Resume Building Experiences and Projects\r\n+ Serving The Underserved: the patients you meet here have beautiful yet painful stories. It's touching to see the providers aiming to provide the best service for Elica patients. Hearing patients talk about the impact that the providers have had on them and how much they love and appreciate the doctors and nurses here is a rewarding feeling even though I'm not a provider/MA myself.", "cons": "- Clinics are growing fast and the employee ratio is off. But they are working on it.\r\n- Sometimes you wear multiple hats and perform many tasks beyond your expected job duties. Can be easy to get stressed out and overwhelmed here. Depending on the person you are, burn out could come faster than you expect. While Elica is growing, there's not enough staff to distribute the workload.\r\n- We need more staff in every department, but that's easier said than done. \r\n- No matching in 403(b) plan.\r\n- Not enough paid holidays. \r\n- Providers come and go, so patients can have a hard time building that trust. I see it as there's not a lot of long term benefits to stay with Elica. It's a stepping stone for many."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "OK", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "18 May 2021", "job_title": "Nurse Practitioner in Sacramento, CA", "duration": "N/A", "pros": "Salary, location, benefits, autonomy, commute", "cons": "Upper Management, lack of security,"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "More like \"Helica\"", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Aug 2017", "job_title": "Medical Assistant in Sacramento, CA", "duration": "N/A", "pros": "Decent Health insurance unless you have dependents. Dependents triple the cost.", "cons": "Negative work environment, poor treatment from management, no annual raises or raises with promotions. Elica has never been a great place to work for most employees. It is a good place to start out and learn from mistakes. Elica does not pay employees well. Getting a raise is like pulling teeth, and Elica does not provide raises for people after being promoted unless you are a  friend or family of management. There has been a recent change in COO and CEO which has changed Elica for the worse which I didn't think was possible. The new COO has harassed many supervisors and other employees and bullied them to quit so that she could bring in  employees from her previous company and paid them all double what previous supervisors were being paid(all in the six figures) which in my opinion is alot for a \"non profit\" organization. Meanwhile, employees who have been there for several years and are barely making it by and can't get a raise even if they have been promoted. I would not recommend this company for anyone who would like to be treated with respect, anyone who would like annual raises, or anyone who expects a raise with a promotion. I would not recommend this company to my worst enemy. If I could have given a 0 star review I would have."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Elica Health Centers provides quality, patient-centered primary healthcare to tens of thousands of low-income patients", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Mar 2020", "job_title": "Community Development Director in Sacramento, CA", "duration": "N/A", "pros": "Elica serves low-income and immigrant populations who are medically-underserved. Elica provides integrated primary medical care, behavioral/mental healthcare and comprehensive dental care--several health centers offer all services at the same location. Elica's revenue has increased by over 400% during the past five years, meaning that Elica has the capacity to serve Medi-Cal and Denti-Cal patients at a time when fewer independent physicans and dentists are accepting new Medi-Cal and Denti-Cal patients. Elica serves tens of thousands of low-income patients (including homeless patients) annually. Unlike any other regional community health clinic organization, Elica offers primary veterinary care (in partnership with the Front Street Animal Shelter in Sacramento) exclusively for the pets of its homeless patients. Elica has a mobile health program that features three (soon-to-be four) mobile clinic vans which offer both primary medical, behavioral health and dental care to low-income schoolchildren, homeless populations and the general public at local community health events. Elica's mobile health program also includes a \"street medicine\" team of on-foot providers who deliver primary care directly to homeless populations at encampments and other sites.", "cons": "Because of Elica's rapid recent growth, it's still developing and fine-tuning administrative and clinical policies and procedures to manage such organizational growth."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Salary very below market", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Nov 2020", "job_title": "Physician in Sacramento, CA", "duration": "N/A", "pros": "The CEO has the good of the company at heart.", "cons": "Administrative micromanagement is very common in the various clinic sites."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Zero star review is more appropriate", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 May 2017", "job_title": "Medical Assistant in Sacramento, CA", "duration": "N/A", "pros": "It's a job. Not a good one but it might pay a phone bill and maybe Netflix.", "cons": "Where do I start. The C.O.O is fake and the most horrible person I have ever met. Think of the movie horrible bosses and multiply that by 100. I would not recommend this company to my worst enemy. Employees are discriminated against is they don't meet a certain demographic requirement. Employees do not get raises if they are promoted unless they meet a certain demographic. There is discrimination, favoritism, garbage pay, poor treatment, and dishonesty. This company does not care about their employees. All they care about is getting patients in and out and don't care if the patient gets proper care. See other reviews on this clinic online. Patients don't even like Elica."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a great place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Aug 2017", "job_title": "Certified Medical Assistant in Sacramento, CA", "duration": "N/A", "pros": "Alot of nice employees. It's senior management that is the problem.", "cons": "The COO mistreats alot of people unless they are her friends that she brought in from previous company.  Compensation is not very good, I pay alot of money for benefits for my family. Alot of favoritism, nepotism, and negativity. Raises never to rarely. Alot of management complain that they don't get raises when promoted. Highest turnover rate I have ever seen in my life from a company I've worked with. If I could give senior management 0 stars I would."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "It was alright. Only bad thing was that while I worked there management in my department changed every week.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Oct 2020", "job_title": "Call Center Agent in Sacramento, CA", "duration": "N/A", "pros": "Supervisor was great. Always worked with you to make sure you felt comfortable with your work environment.", "cons": "1. Management changed every week. Never know who to go to if anything happened. \n2. Never get any bonuses or raises."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "pernicious", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jun 2020", "job_title": "Manager in Sacramento, CA", "duration": "N/A", "pros": "Multicultural team members uniting to serve the underserved.", "cons": "Negative leaders act domineering and superior to employees"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Not proactive for providers at present", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 May 2019", "job_title": "Anonymous Employee in Sacramento, CA", "duration": "N/A", "pros": "Caring for the under served population in Sacramento are", "cons": "There is below average support for providers."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Like the people here", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jan 2018", "job_title": "Medical Assistant in Sacramento, CA", "duration": "N/A", "pros": "Team is very help ful", "cons": "Pay rate is too low"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible place to work - slave labor comes to mind.....", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Jun 2016", "job_title": " in Sacramento, CA", "duration": "N/A", "pros": "many hard working staff members", "cons": "Corrupt executive leadership with nonexistent board oversight.  The C-Suite is at the mercy of their leader."}]]