[[{"date": "15 Feb 2023", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Westcliff University", "Interview Descriptions": "I applied online and received a phone interview. They called me to schedule an interview after I applied. Interview process was very simple. Point to point conversation with seniors and staff members.", "Interview Questions": "Job and skill related cross questions"}, {"date": "2 Sept 2022", "title": "International Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Westcliff University", "Interview Descriptions": "Phone interview, followed by a video interview and lastly an in person interview. The phone interview was a screening by HR, then a video interview with the department Dean and then an in person interview with department dean and direct supervisor.", "Interview Questions": "How would you respond to International Students in crisis? "}, {"date": "11 Apr 2022", "title": "Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westcliff University", "Interview Descriptions": "fast, but questionable lack of communication. Never know when they will contact and it has never been clear about it that when how what they will contact you was told that just wait wait and wait", "Interview Questions": "3 to 5 years and what can u bring for us\r\n"}, {"date": "5 Apr 2022", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Westcliff University", "Interview Descriptions": "Very straight forward, show that you are comfortable with the requirements. They care a lot about  people that have a good vibe and positive, culture fit is something they focus a lot.", "Interview Questions": "tell me what did you do in your previous job?\r\nAre you excellent in excel?"}, {"date": "4 Oct 2021", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Westcliff University in Sept 2021", "Interview Descriptions": "Very unprofessional process. No one showed up to the Zoom on the scheduled meeting time and was not given a apology after waiting 40 minutes. Then had to reschedule for a later date and then the interviewer was 20 mins late to that interview. Great miscommunication between the recruiter and the interviewer about time and salary and I did not feel like my time was respected.", "Interview Questions": "Behavioral response questions and about my experience. "}, {"date": "22 Sept 2020", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at Westcliff University (Long Beach, CA)", "Interview Descriptions": "Scheduled an interview on before the weekend, then on the day of the interview an hour before we were supposed to speak, the recruiter emailed me and said they are canceling my interview because they filled the position. Didn’t even get a chance to have an interview. Very Unprofessional.", "Interview Questions": "Canceled my interview"}, {"date": "17 Jan 2023", "title": "International Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westcliff University (Irvine, CA) in Mar 2020", "Interview Descriptions": "Phone screening with the dean of the academic department. Also with the international affairs lead. Then in person whether it is through zoom or in the office. The skills test was fairly to the point as well.", "Interview Questions": "How do you get through conflict with co workers?"}, {"date": "11 Dec 2019", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Westcliff University (Irvine, CA) in Dec 2019", "Interview Descriptions": "I have been called from HR  for an interview she supposes to send me E-mail to confirm it but she didn't I called many times but no response but I went for an interview for a time that we agreed on the phone with no confirmation email I just give the benefit of the doubt after waiting in conference room for a long time she came and said position has been field.\r\nI believe it was very disrespectful and unprofessional my suggestion is if you are close to 40 years old or having expectations more then $ 35k doesn't even bother to go there for an interview.\r\nGood luck everyone", "Interview Questions": "N/A"}, {"date": "7 Sept 2019", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Westcliff University (Irvine, CA)", "Interview Descriptions": "The overarching feeling when I left my interview was that my time wasn’t valuable m. I definitely understand that things come up but in those situations, communication is key. I waited over 15 minutes past the scheduled time for the interviewers to arrive. At the end of the interview they wanted me to meet with the CEO but didn’t know when he would be available. I was asked to wait in the area for an hour so they could call me to schedule that appointment. I waited for over an hour and then reached out. Reception was unable to get ahold of anyone from the panel I had met to ask what was going on. I didn’t get a call until over two hours after my interview ended. When I didn’t answer, the person did not leave VM but proceeded to call a few more times and then leave a VM. This was all a huge red flag for me. If I’m not even on payroll and I’m being treated this way, how bad would it be if I were to actually work there? I emailed the recruiter and withdrew my application.", "Interview Questions": "Are you flexible in your communication?"}, {"date": "28 Dec 2018", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Westcliff University", "Interview Descriptions": "The interview process was short and simple. I got contacted by a recruiter after submitting my resume. I had a phone screening then a week later, I got called in for an interview. On interview day, the person that was supposed to interview me was 20 minutes late. She was very unprofessional and  seemed like she wanted to get the interview over with. When I was answering the questions, she kept cutting me off and kept asking other questions. I did not feel welcomed by her at all and she did not seem personable. Gee and she did not even write my answers down, she was just asking questions from the top off her head.  One thing that also annoyed me was she kept saying that the position I applied for is the same as my current position now when it totally isn't. Out of all the interviews I have been through, this one was the WORST! Be professional and show that you care for crying out loud. It goes both ways, the interviewer and the interviewee should both be professional,  welcoming and personable, and knowledgeable. If the interviewer isn't, it is going to go down hill.", "Interview Questions": "Why do you want to work here?"}], [{"date": "2 Dec 2018", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westcliff University (Irvine, CA) in Jul 2018", "Interview Descriptions": "There were two steps in the interview process. \r\nVideo Interview\r\nDemo Lesson\r\nThe panel was mostly quiet during the interview and listened to my presentation. They were also very nice people that I could see myself working with", "Interview Questions": "How will you plan for a various group of students?"}, {"date": "16 Apr 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Westcliff University (Irvine, CA) in Feb 2017", "Interview Descriptions": "The first step was a phone conversation with the recruiter. Once you pass that, you are scheduled for an in-person interview with operations. If they are interested, you'll interview with the CEO.", "Interview Questions": "What makes you qualified and why did you want to apply here?"}, {"date": "3 Nov 2016", "title": "Institutional Research Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westcliff University in Jun 2016", "Interview Descriptions": "Schedule the face to face interview through the Zoom, and speak with two staffs, they ask some professional and behavior questions, and they also introduce the university and explain the duty of this position.", "Interview Questions": "Just the regular professional and behavior questions based on the experience and academic background"}, {"date": "7 Feb 2020", "title": "Programmer Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westcliff University (Los Angeles, CA) in Jan 2016", "Interview Descriptions": "3 - Tier interview Structure, Last interview with CEO, Second interview is a presentation that is based off questions they ask in the first interview. Overall seemed like a fair interview process. However Directors seemed to always be very busy during interview.", "Interview Questions": "How do you prioritize your work."}]]