[[{"date": "22 Jun 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "Fairly simply. Asked about previous experience and work within the lab setting. The process for hiring was streamlined and explained well. Everyone was communicative and kind throughout the entire process", "Interview Questions": "What sort of previous experience I had"}, {"date": "26 May 2022", "title": "Orientation Staff Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "Interview was welcoming but the interviewer seemed to be going through the motions and not well engaged. The interview also asked more abstract questions but did not leave enough room or leeway to elaborate and correlate the question to how the person could serve on the job.", "Interview Questions": "If you were a kitchen appliance, what would you be and why?"}, {"date": "29 Oct 2021", "title": "Research Assitant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "There was role playing with a script. I was so stressed about memorizing the script that I felt it hindered the employer from seeing my true potential. Kind of odd for a research assistant position- since I wasn't auditioning for a tv show?", "Interview Questions": "They asked a lot of questions. "}, {"date": "9 Oct 2021", "title": "University Writing and Speaking Center Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UNC Greensboro", "Interview Descriptions": "The interview was efficient but thorough. It only took about fifteen minutes, during which I was asked about why I wanted to work at the center and what I thought I could contribute. At the end, there was ample time to ask any questions I had about the position, and my interviewer was very knowledgeable.", "Interview Questions": "Why do you think you would make a valuable addition to our team?"}, {"date": "6 Oct 2021", "title": "Community Outreach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "Easy process to schedule and coordinate; hiring manager responded quickly to my emails after the interview. Parking was simple in the deck near the building. Team was friendly and provided good info about the work environment and duties.", "Interview Questions": "How have you increased enrollment in the studies you are currently working on?"}, {"date": "25 May 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "UNCG has a rigorous but fair and ethical interview process for graduate students and graduate research assistants every department is different but they all hold high standards and follow the rules set by the graduate school.", "Interview Questions": "What are your research interests"}, {"date": "16 Oct 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at UNC Greensboro (Greensboro, NC) in May 2021", "Interview Descriptions": "Very thorough and informative, I felt prepared and supported in this position by all staff in the department. I was interviewed by the department director and spent time with key IT staff before starting my position.", "Interview Questions": "Why I wanted to work in that department? What my goals were? How they could be supportive."}, {"date": "27 Apr 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "It was good, mostly about my knowledge and what I can do for them. The atmosphere of the interview was good. I dressed formal. It was an online meeting. My advisor hold the meeting.", "Interview Questions": "What are your skills and experience?"}, {"date": "22 Dec 2020", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "there was not an interview process and therefore i was able to participate in the program without any prior contact, simply submit the required application materials and you will be fairly considered for access to the program", "Interview Questions": "they didn't ask anything at all"}, {"date": "5 Aug 2020", "title": "Social Media Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Greensboro in Aug 2020", "Interview Descriptions": "3 interview process - first interview was with the manager, 2nd was with the whole staff team and third was with the manager, overall easy process. Completed over Zoom for \"in person\" interviews.", "Interview Questions": "To explain my previous event management experience "}], [{"date": "15 Sept 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Greensboro (Greensboro, NC) in Aug 2019", "Interview Descriptions": "Had to role play, which was an odd and stressful experience to prepare for. Overall, the interview felt like a routine and made me feel like they weren't getting a genuine representation of myself. Lots of questions, and each time I answered each person interviewing me stopped to write down my answers.", "Interview Questions": "Think of a time you dealt with people from different cultures, and how did that go."}, {"date": "6 Mar 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4+ months. I interviewed at UNC Greensboro (Greens Fork, IN) in Feb 2019", "Interview Descriptions": "Prior experience with Git, or other version control systems\r\nMust be able to adapt to a fast-paced collaborative environment\r\nStrong written and verbal communication abilities, flexibility, and commitment to meeting deadlines are a must\r\n\r\nLocation: Raleigh, North Carolina", "Interview Questions": "Prior experience with Git, or other version control systems\r\nMust be able to adapt to a fast-paced collaborative environment\r\nStrong written and verbal communication abilities, flexibility, and commitment to meeting deadlines are a must\r\n\r\nLocation: Raleigh, North Carolina \r\n"}, {"date": "10 Aug 2018", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Greensboro", "Interview Descriptions": "Interview takes place in overhead boss' office with either one or two CRL's present. They alternate asking you questions off of a list; standard interview questions. At the end, they throw in some fun questions to keep you on your toes. Pay attention to job description, that's what they want to hear.", "Interview Questions": "Tell us about a time that you exemplified good customer service"}, {"date": "21 Mar 2021", "title": "IT Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Greensboro (Greensboro, NC) in Mar 2018", "Interview Descriptions": "One phone interview, one In-person interview. Casual board-style with all coworkers and managers.  Some questions, but mostly open-discussion. Very welcoming, very positive. Offer made about five days after the interview.", "Interview Questions": "What attracted you to our organization?\nTell Me About a Work Problem That Required a Complicated Solution and How You Worked With Your Team to Resolve It.\n\nTell Me About a Time When You Explained a Technical Process or Concept to Someone Who Didn’t Have a Technical Background.\n\nWhat Tools and Strategies Do You Use to Organize and Prioritize Your Work to Best Meet Team Goals, Expectations, and Deliverables?"}, {"date": "25 Aug 2020", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UNC Greensboro (Greensboro, NC) in Feb 2018", "Interview Descriptions": "Group interview, fairly simple questions asked. Staff was extremely kind and understanding. I had never had a job on campus prior to this, but I was recommended to apply due to the nature of the job.", "Interview Questions": "What shoes are you wearing?"}, {"date": "9 Sept 2020", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UNC Greensboro (Greensboro, NC) in Feb 2018", "Interview Descriptions": "The interview process was face to face but I know my last year they went to mainly online. A lot of situational questions, like “Tell me a time when you....” or questions that display your character and what you value.", "Interview Questions": "What a three things you would like see in a supervisor (CRL)?"}, {"date": "20 Mar 2018", "title": "Administrative Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Greensboro (Greensboro, NC) in Jan 2018", "Interview Descriptions": "I was contacted to be brought in for an interview, and was brought in at a time that was convenient for everyone. We met in a conference room, where I met with the woman who would be my supervisor, the department chair, and a senior member of the faculty. It was like being in front of a panel, and a little nerve wracking, but everyone seemed quite nice and genuinely interested in getting to know me and how my previous work experience could be applied to this position.", "Interview Questions": "Q: Tell us about yourself."}, {"date": "10 Oct 2017", "title": "Administrative Support Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Greensboro (Greensboro, NC) in Sept 2017", "Interview Descriptions": "The staff made me feel very comfortable during the entire face to face interview. Communication was excellent from the time I was contacted for an interview through the end of the process.", "Interview Questions": "How do you handle diversity?"}, {"date": "26 Oct 2016", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Greensboro in Aug 2016", "Interview Descriptions": "Participated in a phone interview a couple of weeks after applying and was invited to the campus for an in-person interview. The interview schedule consisted of several 30-45 minute interviews with different employees in the department, with a total time of around 3 hours. The interview went well, I followed up with a thank you, and never heard another word from the university. Considering that I was one of three people to be invited to the in-person interview, I thought it a bit rude that there was never any follow up.", "Interview Questions": "Describe a time that you and another colleague disagreed on how to handle an issue. How did you respond?"}, {"date": "2 Jun 2016", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UNC Greensboro", "Interview Descriptions": "Applied through UNCG website the beginning of January 2016 but didn't get a response regarding an interview until April.  I was told they had already gone through one round of interviews but didn't find what they were looking. I received a call to set up a phone interview with the Arts & Science Department Development Team. After making it through that round I was then asked back for a face to face interview. This was a four hour on campus interview which included a sit down with the A&S dean, Formal interview with the development team once more, lunch and formal interview with several development staff members from UNCG programs. Plus a campus tour. \n\nI waited two weeks and didn't hear anything from the committee so I sent an email thanking the Director and asking for a timeline. I never received a response from the director (very unprofessional) so after a week I called the Department of Art and Sciences. They told me they were still deliberating. \n\nFinally a week later (a month after my face to face) I received an Email (a re: back from my original email btw, not a stand alone email) from the Director stating they offered the position to someone else, they accepted and thank you for my interest. I was promised a phone call. It is important to note that I live 4.5 hours away so I believe I deserve a phone call. \n\nWhen I replied to say thank you for the opportunity and asked for feedback on my interviewing skills I never received a response. I always say you can tell what kind of department/agency a place really is when they are rejecting you.", "Interview Questions": "Tell us about a time when you were with a donor/trying to cultivate donations and made a mistake. How did you come back from it?"}], [{"date": "1 Apr 2016", "title": "Environmental Service Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at UNC Greensboro (Greensboro, NC)", "Interview Descriptions": "Fill out an online application. Took about two weeks to get a call. Came in for interview with 6 people around the table. The group was composed of Directors, Supervisors, and housekeepers. Asked typical questions. Very laid back and enjoyable experience. Took a month for me to get a call from HR after the interview.", "Interview Questions": "What is your experience with people from other cultures?"}, {"date": "29 Sept 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Greensboro in Mar 2016", "Interview Descriptions": "It was solely based on Resume, so no interview was held. Rather job was given based on the academic qualification as well. The education background and the skills were taken into consideration for the job.", "Interview Questions": "Resume based"}, {"date": "14 Jun 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Greensboro (Greensboro, NC) in Mar 2016", "Interview Descriptions": "The interview process was fairly moderate. It was a 3 tier process. I sent the application online with a portfolio after I was emailed that they liked my resume & portfolio and that they wanted to schedule an interview with me. Once I interviewed they told me that they would like to continue the interview process and gave me a design project to complete with a deadline. After I submitted that they compared my work with the other designers that had made it through that far. So your previous work, application, interview, and design project all have to be excellent if you want to be able to get a job here.", "Interview Questions": "How do you see yourself impacting our department?"}, {"date": "24 Nov 2015", "title": "Administrative Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UNC Greensboro in Oct 2015", "Interview Descriptions": "They had contacted me by phone for an in person interview within 2 weeks of applying.   I had an interview with a group of 5 people.   Following the interview I was told that I'd be notified the following week about whether I'd get an offer or not.  It took 3 weeks following the interview.", "Interview Questions": "Describe your best working relationship"}, {"date": "18 Nov 2015", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UNC Greensboro (Greensboro, NC) in Aug 2015", "Interview Descriptions": "I was given an online assessment to complete. Then I was scheduled for a face to face intrerview where I was asked behavioral type interview questions. I was called back in a couple of weeks and given a job offer but declined declined the offer. The pay wad too low for all the work the job entailed.", "Interview Questions": "What was a typical day in your previous office setting job?"}, {"date": "10 Apr 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Greensboro", "Interview Descriptions": "It was meant to be an easy one as it is to recruit students for the graduate programs. It was a smooth sailing. I was given enough time to discuss all I need to do be successful in the program.", "Interview Questions": "I was asked about my interest in the program of study?"}, {"date": "11 Dec 2014", "title": "Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNC Greensboro (Greensboro, NC)", "Interview Descriptions": "Submitted application via online employment website.  Was contacted 2 weeks later for interview and attended group interview with staff of unit I would be working with.  Interview was straightforward and people were very friendly.  Asked questions pertaining mainly to level of experience, how to handle difficult situations, and what added value I'd bring to their unit.  After interview, had to wait about three weeks before I was told my references were being checked.  Received telephone offer three days after reference check.", "Interview Questions": "How would you deal with a student, parent, or combination of student and parent in distress or who demanded a considerable amount of attention?"}, {"date": "16 Sept 2014", "title": "Camp Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at UNC Greensboro", "Interview Descriptions": "1 week process, I only,did a phone interview. It lasted about 20 minutes and the director hired me on the spot! We spoke about my experience and she was very impressed that I had worked in other summer camps. She also questioned my ability to handle stress since the camp travels around each week and has over 500 campers each week.", "Interview Questions": "What age group do you find most fascinating?"}, {"date": "16 Nov 2017", "title": "Sports Marketing Summer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at UNC Greensboro (Greensboro, NC) in May 2014", "Interview Descriptions": "Started on time, was interviewed by the head of the department and two other department heads related to job, asked me basic questions, made me feel at ease during the interview process allowing me to feel laid back in my answering", "Interview Questions": "What do you expect to get out of this job to help you achieve your future goals in life"}, {"date": "27 Apr 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Greensboro (Greensboro, NC) in Jan 2014", "Interview Descriptions": "The interview  process was fairly easy, walked into the office of the head of the department and  after quick introduction, i had technical questions of how i would handle conflict or students who arent  up to date with new sport rules.", "Interview Questions": "how do you handle conflict"}], [{"date": "28 Apr 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Greensboro (Greensboro, NC) in Jan 2014", "Interview Descriptions": "I had an Skype interview and there were four faculty members in the meeting. Each asked few questions. The focus was on my plan for future. I believe they were looking for graduate students who were looking to continue their career in an academic setting.", "Interview Questions": "Tell me more about yourself."}, {"date": "10 Sept 2014", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UNC Greensboro in Mar 2013", "Interview Descriptions": "There are two processes. One includes an individual assessment in front of a small panel. Panel varies from two to five professional individuals in UNCG Housing and Residence Life (HRL). You will be asked about 20 questions (expect to be there for 30 mins to an hour). Questions will include anything from \"give us an example of when you dealt with a hardship,\" to \"who's your inspiration?\" \r\n\r\nThe key during the individual process is to truly be yourself!!  Please be yourself during this process. If not, you may find the job difficult and not something you have interest in.  The reason this could be bad is because you are dealing with other students. Look at yourself as being in customer service.  For instance, if you don't like helping people and being patient to others needs or working as a community you will find yourself miserable and this might carry out into your work and how you deal with others and the students.  So, be yourself, be truthful and if you are a good fit it will show!\r\n\r\nAlso during the individual process don't be scared to mention how you've made mistakes. As long as you explain how you truly have grown from it and what you learned. We all mistakes, so if a question is brought up regarding this don't say you are perfect or never made mistakes.  We all have. The true test is seeing what it has taught you. \r\n\r\nIf you can't accept others differences such as sexual orientation, race/ethnicity, etc. then this is probably not the job for you. Be prepared to encounter different people and be prepared to open your mind and extend your hands to everyone!  We all struggle, especially students who are transitioning into their new adult lives. Be prepared to assist others. \r\n\r\nSo...\r\n\r\nthe second process with be a group interview which consist of specific activities to look at different areas.  For instance some look at how you work in groups, if you are a leader, how you solve problems, etc.  \r\n\r\nThe key to the group interview is....yep, you guessed it, be yourself! If you are naturally quite or like to take charge thats okay! Be who you are.  Students who get this job are not a specific type.  They are not all \"cheerleaders\" (as i was once told). Some of the best RA's (resident advisors) i've known ranged from calmer at heart to on the go. So be you. \r\n\r\nThe key is to be spirted which means just truly enjoy what the job entails as well as engaging.  If you like to engage others you will be fine.  Being an RA gives you the freedom to do it \"your way!\" Some RA's engage students by knocking door to door with candy and a survey and other RA's do it by leaving a survey at the door and those who answer get candy (see what i mean). So be yourself.  It will make it easier to see who are and how you will fit in. Because they are looking to hire diverse groups not a group filled with only \"cheerleading RA's.\"", "Interview Questions": "\"Give us an example when you have dealt with diversity?\"   "}, {"date": "2 Jun 2015", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at UNC Greensboro (Greensboro, NC) in Feb 2013", "Interview Descriptions": "Interview process begins with a group interview conducted by current RAs that observe how you interact with your peers.  Following a successful group interview, a individual interview is held with a CRL and a current RA.", "Interview Questions": "Tell a story about the shoes you are wearing."}, {"date": "30 Jan 2016", "title": "CRL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UNC Greensboro (Greensboro, NC) in Apr 2012", "Interview Descriptions": "met at placement exchange (conference), interviewed with two staff members there; was invited for an on campus interview on campus and spent the day meeting various people, staff, students, etc. gave presentation.", "Interview Questions": "Where I got my shoes"}, {"date": "7 Jun 2016", "title": "Applications Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UNC Greensboro (Greensboro, NC) in Feb 2012", "Interview Descriptions": "You will likely be asked questions about your teamwork skills, your interpersonal relations, your management style or your ability to work in a diverse environment. Review the job posting again and try to anticipate other likely areas of questioning, and prepare honest and concise answers that highlight relevant aspects of your work history and life experience. Remember that there may be questions you did not anticipate: when this happens, breathe and take a moment to think through your experiences to find the best answers.\r\n\r\nOn the day of the interview, dress appropriately and arrive early, calm and mentally prepared. Bring a list of references if you did not already include them in the resume you submitted. And, most importantly, don’t forget to relax and be yourself.", "Interview Questions": "What do you consider to be customer service?"}, {"date": "8 Jul 2015", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNC Greensboro (Greensboro, NC) in Nov 2011", "Interview Descriptions": "Intense, a full day of interviews back to back with on and off-campus stakeholders as well as professional peers. It was tiring and draining, but there were a lot of wonderful people who made it enjoyable.", "Interview Questions": "Why do you think you would do well at this job?"}, {"date": "17 Dec 2012", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Greensboro (Greensboro, NC) in Oct 2008", "Interview Descriptions": "All hiring is done through an online application process.  Interviews are with the hiring manager.", "Interview Questions": "Where do you want to be in 5 years."}]]