[[{"date": "3 Jul 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Indiana Wesleyan", "Interview Descriptions": "Was given a phone interview. Was asked minimal questions without deeper probing for understanding and then received a form letter from HR that they had filled the position. Many assumptions had to be made for them to make a decision based on this minimal level of interview questions.", "Interview Questions": "Did your vision ever come to fruition in a previous role?"}, {"date": "21 Jun 2023", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Indiana Wesleyan", "Interview Descriptions": "Met with the search committee first. It was comprised of 5 faculty members. Met with the chaplain for round two. Went to campus for an onsite interview with many different individuals.", "Interview Questions": "Why was I a good fit for the position?"}, {"date": "18 Aug 2022", "title": "Online Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Indiana Wesleyan", "Interview Descriptions": "The interviewer was very condescending and rude. Acted like he was wasting his time and had better things to be doing.  Male chauvinist attitude and very unprofessional and messy looking.", "Interview Questions": "What was your most memorable experience in education. "}, {"date": "17 May 2022", "title": "Sign - Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Indiana Wesleyan", "Interview Descriptions": "I was texted and asked a good time and day to come in for the interview. We sat in her office area she asked me a few interview questions and explained the position. Then said the job could be mine if I wanted it.", "Interview Questions": "Tell me something about yourself.\r\nHow did you hear about this position?\r\nWhy do you want to work here?\r\nWhy did you decide to apply for this position?\r\nWhat is your greatest strength?\r\nWhat are your strengths and weaknesses?\r\nWhat do you know about this company/organization?"}, {"date": "3 Feb 2022", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Indiana Wesleyan", "Interview Descriptions": "Very long, drawn out, and repetitive. You essentially meet with 10 different people that ask the same questions and talk at you for 30 minutes per meeting. I was asked to do a teaching demonstration and only had two professors attend my lecture to assess teaching skills and student engagement.", "Interview Questions": "What is your faith journey like?"}, {"date": "30 Nov 2021", "title": "Admission Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Indiana Wesleyan", "Interview Descriptions": "First round of interviews was personable and then during second round they Placed you in front of large group to interview of about 15 people.  Took turns asking questions. Don’t have any other things to add to meet word minimum.", "Interview Questions": "I do not recall questions "}, {"date": "30 Sept 2021", "title": "Operations Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Indiana Wesleyan (Marion, IN) in Sept 2021", "Interview Descriptions": "3 total interviews- one with direct supervisor, then another with multiple team members and then what appears to be final decision with the department VP.\r\nMade to feel comfortable.  Prayer before meeting.", "Interview Questions": "I was asked about my walk with Christ."}, {"date": "26 May 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Indiana Wesleyan (Marion, IN) in Oct 2019", "Interview Descriptions": "There is a multi-step interview process. The first was conducted via Zoom for 30 minutes. Then, there were two phases of on-campus interviews that lasted the entire day. You will interview with the majority of leadership, including the President.", "Interview Questions": "Why do you want to work here."}, {"date": "10 Nov 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Indiana Wesleyan (Marion, IN)", "Interview Descriptions": "I had a phone interview, and then was called in for a day interview.  This included many different people, in groups and one on one.\r\n\r\nMany of the people were so kind and genuine.  I only had 1 person that I felt would be pretty hard to work around.  This person was almost showing off and bragging, as he/she asked me questions.  I was turned off by this.\r\n\r\nI was asked SO MANY questions.  However, some questions that I would ask about they would not answer, or say they didn't know???  They should be upfront about salary, and no one seemed to know the salary.  Really?????\r\n\r\nI feel IWU already knows who they are going to hire, and they continually use people to meet their quota for the interview process,  It is difficult to be hired, even when very qualified.", "Interview Questions": "What kind of learner are you?  Watching, listening ...."}, {"date": "19 Mar 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Indiana Wesleyan in Apr 2018", "Interview Descriptions": "Interview process was very detailed and required you to think holistically about your faith and work together. I appreciated the opportunity to share my beliefs and experiences. I interviewed over the phone and then was asked to complete an online training/test.", "Interview Questions": "What ways has God's grace impacted your life this year? "}], [{"date": "9 May 2022", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Indiana Wesleyan in Mar 2018", "Interview Descriptions": "Very attentive \r\nAsked questions \r\nThe interview has great depth.\r\nMeet with everyone on the team.\r\nStart off with the supervisor \r\nThen have lunch with the staff (can ask questions) \r\nPerformance task", "Interview Questions": "What are your strengths?\r\nhow do you work on a team? \r\nWhat does  time management "}, {"date": "25 Feb 2018", "title": "Online Adjunct Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Indiana Wesleyan", "Interview Descriptions": "Thorough Interview Process but very rude when told I did not get the job. Said references were bad and that I need to pay better attention to my resume. Not a Christian attitude, have never been talked to so rudely on any interview.", "Interview Questions": "How would you use your Christianity in the classroom. "}, {"date": "25 Aug 2017", "title": "Graduate Nursing Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Indiana Wesleyan in Jun 2017", "Interview Descriptions": "I was called and really no questions were asked to me other than would I consider being adjunct faculty in the future. I haven't heard anything since. This was back in June.", "Interview Questions": "No questions"}, {"date": "17 Nov 2021", "title": "Director of Financial Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Indiana Wesleyan in Apr 2017", "Interview Descriptions": "The interview was thorough and collaborative in nature. \n The people asked genuine interview questions, and they allowed time for me to ask questions.  The day was long but I felt confident enough to accept an offer.", "Interview Questions": "Walk us through your strengths and how you live them out at work?"}, {"date": "10 Feb 2017", "title": "Conference Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Indiana Wesleyan (Marion, IN) in Nov 2016", "Interview Descriptions": "A brief interview with a panel of 3 people.  They each had questions in their area of expertise and how this position would support them.  It was a great interview with great people!", "Interview Questions": "Have you ever had to develop a process for something?"}, {"date": "21 Oct 2016", "title": "Career Development Department Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Indiana Wesleyan in Sept 2016", "Interview Descriptions": "Had a 25 minute phone interview.  They did not get back with me with their decision on the date that they said they would.  I reached out to them with an email a few days later,.... and then in a few days sent another email.  Over 1 week after the time that they said I would expect to hear back from them, they responded.  It seemed like a very interesting job, and I would have enjoyed helping the students.", "Interview Questions": "Describe a time that you used collaboration in the work place."}, {"date": "2 Sept 2015", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Indiana Wesleyan (Marion, IN)", "Interview Descriptions": "Submitted application, was called for interview, took over a month to finally start. When I was told that I was hired I put in my 2 week notice at my other job, only to be jobless for another 3-4 weeks because of the slow process of the management team. I was lucky that I owned my own business and was still able to have a small income coming in while I was transferring positions.", "Interview Questions": "What was your relationship with God, how many years experience and just really general questions that had zero to do with the job being applied for. "}, {"date": "20 Jul 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Indiana Wesleyan", "Interview Descriptions": "Phone interview, then in person. I was called for an initial phone screening and then moved on to an interview on campus. This included an interview with higher administration, and then an interview in front of a panel of the admissions team.", "Interview Questions": "What values of Indiana Wesleyan did I live out in my life?"}, {"date": "23 Jun 2014", "title": "Resident Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Indiana Wesleyan (Marion, IN)", "Interview Descriptions": "Phone interview, in-person interview. The in-person interview was a day-long process. The interviewers and hiring staff were very helpful and wanted to get to know you as a whole person, not just an employee.", "Interview Questions": "There were questions involving what I believed with regards to Wesleyan theology. "}, {"date": "27 Oct 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Indiana Wesleyan (Marion, IN) in Jan 2014", "Interview Descriptions": "I was given a call about one week after applying for a position online.  I was asked come to the office for an interview with the Executive Assistant/ Office Manager.  Upon arrival, I was greeted warmly, then ushered to the conference room, where the interview was conducted.  I handed the interviewer a copy of my resume, which we went over immediately.  Overall, the process was very efficient!", "Interview Questions": "Do you have experience managing multiple tasks?"}], [{"date": "8 Aug 2015", "title": "Associate Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Indiana Wesleyan (Marion, IN) in Apr 2011", "Interview Descriptions": "It was very thorough.  People were friendly and made you feel comfortable.  There was very little rest time between interviews.  In the course of 2 days, I had 5 separate interview meetings-- President, Provost, Dean, Pastor, Chair", "Interview Questions": "Walk us through the plan of Salvation..."}, {"date": "21 Oct 2015", "title": "Regulatory Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Indiana Wesleyan in Mar 2011", "Interview Descriptions": "one on one interview, with discussion of past experience and concerned with mission and values fit. Also included a two part skills test that took approximately 2 hours to complete and included a written portion and a research portion.", "Interview Questions": "What would you say your greatest strength is."}]]