[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good work but poor treatment of staff and run too much like a business, rather than a charity", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Oct 2017", "job_title": "School Feeding Officer in Monrovia", "duration": "N/A", "pros": "Helping children in vulnerable communities to go to school", "cons": "This is a great charity but it lets itself down in a number of very important ways. There is scope to improve. Some of the board seem to believe that, for national staffs, that it is such a privilege to work in Mary's Meals that they should do so for extremely low wages. Human Resources is top down , with some bad mistakes made in firing dedicated staff without proof of wrong-doing, and then being forced to take the same staff back. It embarrased a lot of people. As well as theose sacked, people have left because of anyone who asks awkward questions is treated badly. Senior Management have a strong sense of entitlement and make decisions without consulting experts. Those who are promoted are the ones that only do what the boss says. The business model is the most important thing, rather than responding to the needs of children. Even in times of food emergencies in Malawi, the same cup of porridge is all that is given. This is not enough to feed a child. The board are all businessmen with little, or no understanding of the places where May's Meals works.  I don't think the board members ever visit the projects. There are no experts on child development, education, nutrition or the developing world -  they are all business people who are most concerned about the funds being raised more than whether the program is responding to children's neeeds. Many of the beneficiaries who receive the cup of porridge are still sick with hunger. They should make the portion bigger in times of famine. Why are the standards for school meals in Malawi so much lower than in other countries? All Children need the same amount of food."}]]