[[{"date": "N/A", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Easy. Applied on the company website. After submitting my application it took about 5 days to hear back. Via email. Then we set up a date and time for the interview. It was with the manager and a lead.", "Interview Questions": "Standard to the position. Friendly."}, {"date": "22 May 2023", "title": "Public Relations Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital (Tampa, FL)", "Interview Descriptions": "Easy interview process, they let you meet the team. It was kind of intimidating but at the end of the day they are just trying to get to know you!", "Interview Questions": "How does your experience relate to this job>"}, {"date": "29 Apr 2023", "title": "Talent Aquistion Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tampa General Hospital in Apr 2023", "Interview Descriptions": "Phone interview lasted 10 minutes. Recruiter was pretty hard to understand. I felt like they asked a question, you answered and they stayed silent. I would keep talking wondering if I answered the question or if they expected more. It was off putting and odd style. When asked how many reqs I worked on I answered honestly and said between 18 to 32 max. They responded we work 100 reqs on average. I'm calling BS unless you work a req for 20 mins a week or work 150 hours. There is no way a person works 100 reqs and if they do they need to hire more recruiters or prioitize what needs ro be worked on. Real vs evergreen. Pay is also very low I feel like its entry level around 48 - 52k they said it can go higher based on experience. I wouldn't have applied for such a low range posting said 80k. Summary: Pay at 48k and 100 reqs no thanks! Recruiter kept asking about gap on resume and why. Like they have no idea companies are laying off recruiters by the thousands! Totally out of touch, bad experience.", "Interview Questions": "Tell me how many jobs you work on at a time. How what type of reqs did you work on."}, {"date": "21 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "interview with manager first, then peer interview with other nurses on the unit. the manager asks about schooling, previous jobs, and why you feel you would be an asset. the peer interview is to see how you would be fit on the unit.", "Interview Questions": "asked about my favorite type of patient and my least favorite type of patient"}, {"date": "9 Mar 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Concentrated too hard on my disability and not me as a worker. They question me very hard for 45 min on the phone asking everything possible about my disability and doubted my answers at times.", "Interview Questions": "How much I can lift"}, {"date": "21 Mar 2023", "title": "Business Intelligence Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Tampa General Hospital in Feb 2023", "Interview Descriptions": "It was for the role of intern. The process was smooth. I had 2 round of interviews. First being basic and the later being more technical and behavioral. Although, the whole process took almost a month but the interviewer was good and supporting.", "Interview Questions": "Where you can see yourself 2 yrs down the line?"}, {"date": "31 Jan 2023", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tampa General Hospital (Tampa, FL)", "Interview Descriptions": "The interview process was very easy and straight to the point. It was a virtual interview with a few questions and what to expect on the job if hired. They got back to me the next week.", "Interview Questions": "Tell me about yourself why do you want to work here"}, {"date": "12 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Tampa General Hospital (Tampa, FL)", "Interview Descriptions": "very good interview. good hospital and very ok to work. Lots of experience to be had. Be ready to work hard. Pay is ok with ok benefits. Y o u also get to participate in the RN res program for new grads.", "Interview Questions": "Just be yourself during the interview"}, {"date": "7 Jan 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital in Dec 2022", "Interview Descriptions": "Quite fast, asked general questions and why I wanted to move to their hospital. They said they would reach out after a week but never did. Still going to apply to others hospitals . The interviewers were very friendly and they made me feel at ease", "Interview Questions": "How I can to hear about them"}, {"date": "1 May 2023", "title": "Business Intelligence Analyst II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Dec 2022", "Interview Descriptions": "Had two interviews, one with two managers in the department, and one peer interview. Timing between steps was sort of spread out. Especially in initial contact from when I applied (over a month). Very friendly staff that I got along with well.", "Interview Questions": "How I troubleshot a problem at work"}], [{"date": "19 Oct 2022", "title": "Production Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Tampa General Hospital", "Interview Descriptions": "Virtual interviews with peers and hiring manager. It was very laid back. Most of the questions were about past experience with server administration. Talked about team processes and expected responsibilities.", "Interview Questions": "How muc past experience with server administration?"}, {"date": "26 Jan 2023", "title": "Medical Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2022", "Interview Descriptions": "It was easy took about a month, had to get vaccines, drug test etc it wasn’t to bad of a process! Took a total of a couple days to get everything done! Had a nice orientation with food", "Interview Questions": "Why do you want to work here"}, {"date": "28 May 2023", "title": "PCT Patient Care Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2022", "Interview Descriptions": "Applied and stopped at a careers fair trying to meet unit managers( there’s were only recruiters at those things). But got an on-site interview which was actually shadowing someone in the role I was applying for.. which was clarifying for me. It wasn’t the step forward into new skills I was looking for and no one else working in that role had my level of experience, not to mention their CNA license or interest in nursing. Kinda a bunch of kids goofing around. I was over hungry and hadn’t had anything to drink by the time I sat down with any leadership from the department after those four hours without a sit or break. So I don’t really ask enough questions. HR called with an offer a couple days later; it was WAY low… only twenty cents more than I was already making in a more critical unit. I think the organization is good, but I think I’d wait to jump in or shoot for a nurse residency because they have a REAL program there.", "Interview Questions": "I’m sadden by how many folks ask , “Tell me about a good customer service experience you’ve offered.” It’s an out of date question, considering we’ve worked through COVID."}, {"date": "14 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Jun 2022", "Interview Descriptions": "I interviewed at the career fair and it felt more like a friendly chat over a cup of coffee. The manager of the unit was very friendly and was more interested in who I was rather than asking the standard questions.", "Interview Questions": "Tell me about yourself? Why would you be a good addition to the unit"}, {"date": "13 Nov 2022", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in May 2022", "Interview Descriptions": "My interview process was quick and easy they asked a few questions asked me how I felt about the job describe the job responsibilities and how I feel comfortable doing them there was only two people in the interview lasted about 20 minutes", "Interview Questions": "How I felt working in a busy environment. How I felt about lifting 5 pounds. How did I feel talking to the families in answering the phones how comfortable was I answering the phones."}, {"date": "12 Aug 2022", "title": "Epic Beaker Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tampa General Hospital (Tampa, FL) in May 2022", "Interview Descriptions": "Virtual interview with the manager, senior analyst, and junior analyst. They asked questions about qualifications, skills, work history, and relevant experience.  Also, I was asked about my etiquette, interpersonal skills, and communication skills", "Interview Questions": "Tell me something about yourself."}, {"date": "29 May 2022", "title": "Cardiac Cath Lab Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Tampa General Hospital in Mar 2022", "Interview Descriptions": "Once they started to open for in person interviews I T was rather smooth. Before that it was difficult to get in touch with the manager directly. Once that happened it was fast. Very open personal interview, it was done in person and friendly. Management was direct in their questions and  were willing to work with you on employment. HR were very responsive in turn around time to offer the position.", "Interview Questions": "Procedure experience and numbers, equipment used, and qualifications. What X-ray and hemodynamic monitoring equipment I have used. What HIS  and EMR I am familiar with. Future endeavors as well as personal goals. What challenges I have had with my previous employer and environment? How do I handle conflicts and to give an example of an occurrence that had happened to me. "}, {"date": "22 Jan 2022", "title": "Talent Acquisition Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Tampa General Hospital (Tampa, FL) in Jan 2022", "Interview Descriptions": "Overall I had a great first and second round interview with HR leadership. The last step of the interview was meeting with the team virtually. There were 8 people on the interview and 4 of them didn’t have they camera on and 2 didn’t introduce themselves or speak throughout the entire meeting. All participants in the meeting seemed agitated about the interview and seemed apprehensive about answering my questions when it was my turn. Several times I got asked the same questions over again. They say they value team work but it did not show in this interview and was my ultimate decision why I did not want to move forward in the process.", "Interview Questions": "Went line through line of my resume"}, {"date": "22 Nov 2021", "title": "Human Resources Business Partner HRBP Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital", "Interview Descriptions": "One phone interview with recruiter where they mentioned that the position required 50-70% travel every week. It was not mentioned on the job description which was a complete waste of time. When I mentioned this to the recruiter they seemed upset with me.", "Interview Questions": "Can you travel 50-70% each week with a territory of up to 250 miles? "}, {"date": "21 Sept 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Tampa General Hospital", "Interview Descriptions": "Very welcoming to all the new employees and students. The staff is extremely warm and everyone is willing to help answer any questions as well as teach you everything you need to know.", "Interview Questions": "Why do you want to be a lab assistant?"}], [{"date": "21 Sept 2021", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Very long, took about 2 weeks and  on boarding was another 2 to 3 weeks. After that was not any problem what so ever. Then orientation was 2 weeks long", "Interview Questions": "Why do you want to work here?\r\n\r\nScenario questions."}, {"date": "28 Aug 2021", "title": "Human Resources/Talent Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Went through four rounds of initial interviews and final. I never received an email or phone call to advise me of my candidacy status. Clearly I was not selected for the role.  However, if a candidate is put through a long recruitment process the least you can do is send an email. Not doing so is pretty unprofessional and leaves a candidate with a poor taste in their mouth.", "Interview Questions": "The interviews were so long ago, that I don’t remember."}, {"date": "12 Feb 2021", "title": "Data Analyst Inern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Great! Applied and then was interviewed by the project manager. It does go on for 30-45 min. Questions are based on your resume and past experiences, technical questions are basic level", "Interview Questions": "From the Resume and your past experiences."}, {"date": "12 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Great interview process! I really thought they asked valid questions. They wanted to make sure to hire the right employees and nurses that were a good fit for the job", "Interview Questions": "Tell us a time that you had to work through a difficult patient interaction "}, {"date": "12 Jan 2021", "title": "Unpaid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Tampa General Hospital", "Interview Descriptions": "Contacted physician I wanted to complete internship with. They talked to me about my interests and matched me with a project based upon my interests and education. Overall very straightforward.", "Interview Questions": "What type of internship are you looking for?"}, {"date": "26 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Jan 2021", "Interview Descriptions": "The nurse manager was very kind. Different staff from the unit was there on Zoom asking me questions. I loved that I was able to get an idea or the vibe of the unit and how the staff work together.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 May 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Tampa General Hospital (Tampa, FL) in Dec 2020", "Interview Descriptions": "It was very efficient, informative, and enjoyable. I had one interview over Zoom during which I was able to get to know the SLPs. They asked good questions and allowed me to ask questions, as well.", "Interview Questions": "What population do I want to work with"}, {"date": "5 Sept 2020", "title": "Cardiac Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital", "Interview Descriptions": "The recruiter did a 20 minute phone interview with me to go over my resume, skills, and questions about the job. Then, I went for a virtual interview that was about 30 minutes to talk with the managers of the unit they are hiring for.", "Interview Questions": "Describe one time that you helped a patient or coworker out."}, {"date": "31 Mar 2021", "title": "Marketing Communications Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Sept 2020", "Interview Descriptions": "It was a very well done interview process. The interviewer was very thorough and professional and covered all the bases. I was able to get all my questions answered as well.", "Interview Questions": "How would you improve marketing here?"}, {"date": "2 Nov 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Feb 2020", "Interview Descriptions": "Quick and Easy asked a lot of questions about schooling and personal life. Environment seemed fitting and exciting. Asked a few test questions as well and expected quick responses. Very friendly and easy going process", "Interview Questions": "Where are you from originally?"}], [{"date": "7 Dec 2019", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital", "Interview Descriptions": "Awesome manager easy to talk to comfortable environment the people are nice and friendly the receptionist was nice to talk with nice hospital got lost but made it to my interview", "Interview Questions": "My experience"}, {"date": "8 Nov 2019", "title": "SPD Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Nov 2019", "Interview Descriptions": "Given clear instructions to get to interview spot then was asked several behavioral questions, two weeks later I was given an awesome offer. I accepted. It's an hour from my home but totally worth it. Everyone was friendly, got a tour of the dept and where I would be working. The hospital is huge, easy to get lost.", "Interview Questions": "How do you handle difficult people"}, {"date": "16 Dec 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Nov 2019", "Interview Descriptions": "I first had a phone interview with one of the Clinicians on my unit, who mostly talked with me about the position, hours, training, and going over any questions I had. I then got called later that week to set up an in person interview. I met with 3 nurse managers. They were all super friendly, and it felt more like a conversation rather than an interview.  They asked a lot of the typical nurse interview questions, which I had prepared for, so I felt very comfortable answering them. They called me same day to offer me the position! Overall a very good experience!", "Interview Questions": "Why do you want to work for us?"}, {"date": "16 Sept 2019", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Aug 2019", "Interview Descriptions": "Met with a panel: Nurse Manager, Charge Nurse, and Senior employee for the position. Started with a personal introduction and my future professional goals. Talked at length about past work experiences, typical interview questions. Opened for questions to them at the end. I was nervous but they were very welcoming and it was a comfortable experience. Was given brief tour of the unit at the end and introduced to the staff as we walked by.", "Interview Questions": "Why did you choose TGH? / Why did you choose to apply for this position?"}, {"date": "22 May 2019", "title": "Biomedical Engineering Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in May 2019", "Interview Descriptions": "Applied online, Was called for interview same day. Met the manager and the biomed leadership, was shown around to the different biomed rooms, met the people who work there.", "Interview Questions": "Why did you become involved in the Biomed field?"}, {"date": "21 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital in Aug 2018", "Interview Descriptions": "I applied online. Was contacted by HR about 2 weeks later to schedule an interview. The nurse manager and 1 other person interviewed me. Then I was shown around the unit and was asked if I could stay for a second interview. Asked A LOT of questions!", "Interview Questions": "Why do you want to work at TGH?"}, {"date": "28 Sept 2018", "title": "Physician Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Egypt Lake-Leto, FL) in Aug 2018", "Interview Descriptions": "I interviewed with 4 persons. It was intimidating at first I blanked out and was sweating bullets the whole time, but they were nice not too many questions and nothing too crazy.", "Interview Questions": "Tell us about your self?"}, {"date": "8 Oct 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Aug 2018", "Interview Descriptions": "good interview the take you in a private confrence room and discuss expierence and company's expectation. they talk about pay and benefits and then they show you around the building", "Interview Questions": "N/A"}, {"date": "18 Aug 2019", "title": "Chaplain Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2018", "Interview Descriptions": "Apply through the ACPE application on line which will require you to answer essay questions. When you are accepted for an interview a panel will ask more in-depth questions of how who you are and why you are interested in completing a year of Chaplain residency.", "Interview Questions": "How does your life story and experience directly affect how you minister others?"}, {"date": "29 Nov 2019", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital in Jan 2018", "Interview Descriptions": "There was a Quick response time from the online application and from the HR representative.  User friendly online application and great experience with the HR representative. They were Transparent  with pay grades and in the negotiation process.", "Interview Questions": "Provide Examples of work product "}], [{"date": "29 Nov 2017", "title": "Environmental Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Nov 2017", "Interview Descriptions": "I completed a online application week 1 was called and scheduled a interview for week 2. No on the spot offer given for the position. I was advised that my info would be forwarded back to HR for review.", "Interview Questions": "What would your past employer say about you."}, {"date": "26 Sept 2018", "title": "Transfer Center Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tampa General Hospital (Tampa, FL) in Aug 2017", "Interview Descriptions": "The interview process was very laid back. I met with the manager who invited me into his office to discuss my qualifications. It was a one on one interview. The manager was very formal however made me feel at ease as if we were just conversing while we ran through the questions. Some questions were technical while others was to see if I would be a great fit for the team.", "Interview Questions": "Scenario based. If someone walks in with chest pain vs someone who walks in with high blood pressure who do you place on unit first?"}, {"date": "2 Sept 2020", "title": "Ekg Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2017", "Interview Descriptions": "Met and just had a conversation with two of the lead people there. Discussed school schedule and was told to call back if serious, but my plans happened to change. Really nice people and easy going", "Interview Questions": "How experienced are you with taking and reading EKGs?"}, {"date": "25 Apr 2017", "title": "Pre-admin RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Apr 2017", "Interview Descriptions": "I met with the hiring manager and two other nurses.  It was more of a conversation about the area and a little about my background.  I was asked to provide references as I was leaving and I emailed those that night.", "Interview Questions": "Why did you apply for this job?"}, {"date": "27 Mar 2017", "title": "Sterile Processing Tech Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Jan 2017", "Interview Descriptions": "Very surface level, impersonal conversation with Dept. Manager. And this was weeks after completing a very lengthy test on (I can only assume) my personality. Many customer service oriented questions, asked multiple times over using slightly varied wording in order to try and trip ou up. Only then did I arrive at the actual \"application\", which was in and of itself lengthy. This seems to be how they weed the wheat from the chaffe. Weeks later, I was contacted via phone and invited in for an interview. Upon finally finding the Dept., I was made to feel almost foolish because my instructions for arrival were not very clear.  When we met, it was clear she (the manager) was very obviously not much of a people person, asked generic questions about previous experience, education, where do I see myself in 5 years, etc. She then asked what size gloves I wore, stepped away, and came back with a tray for me to assemble in order to \"test\" me. One of the most humiliating and unprofessional interviews I've ever experienced.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "6 May 2021", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Jan 2017", "Interview Descriptions": "Phone screening by HR. Really long phone interview with director. Multiple in-person group interviews until I met with every single person in the department. The director said this was necessary because they were a family and each person should be a good fit with everyone. Everyone (three group interviews with 3-4 people each) took turns asking question from a list of generic behavioral questions. Nothing really related to the job.", "Interview Questions": "Do you play any sports?"}, {"date": "14 Nov 2016", "title": "Human Resources Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Nov 2016", "Interview Descriptions": "I applied online. I got a call about 3 days later to do a phone interview. After getting past the phone interview I was scheduled for a panel interview with their HR recruiting team about a week later. The panel included 6 people from he HR team. I was offered the job the same day as the interview.", "Interview Questions": "How do you think experience in your last job will benefit you in this job?"}, {"date": "14 Oct 2016", "title": "Administrative Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital", "Interview Descriptions": "Once application was accepted I received an email for a phone interview. took about 20 minutes. then was contacted for a personality assessment via online. once received I was asked for an interview. extremely pleasant and professional throughout the entire process.", "Interview Questions": "What I knew of the company and my skills"}, {"date": "13 Sept 2016", "title": "Purchasing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Tampa General Hospital (Tampa, FL) in Sept 2016", "Interview Descriptions": "simple, walk in,meet and greet, they ask questions like what do you know about the company,tell us a little about your experience,and basically discuss hours that are required with the job.", "Interview Questions": "tell us your experience?\r\nwhat hours do you prefer?\r\nhow many years of experience do you have?\r\nwhat do you know about tampa general hospital?\r\ndo you have any questions for us?\r\n\r\nvery short brief,and simple, nothing over whelming"}, {"date": "11 Aug 2016", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tampa General Hospital (Tampa, FL)", "Interview Descriptions": "simple. comfortable. wasn't asking trick questions. was very interested from the start of the interview. it wasn't nerve racking like all the other interviews I have had. it didn't even feel like I was at an interview", "Interview Questions": "how are you with rude people? how do you handle a satiation with a rude person? so all is clear he was talking about nurses!!"}], [{"date": "4 Oct 2016", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Tampa General Hospital (Tampa, FL) in Aug 2016", "Interview Descriptions": "Interview process was quick, smooth, and the questions were very basic. Easiest interview by far. \r\nI'm giving a bad review, because the department manager said she would call me back to confirm a date for the next stage of the interview process. I interviewed on a friday. She said she would call me on the following Tuesday. She never called. I left 2 voice messages. Still received nothing. I like people who are honest. If the lab manager didn't think I was right for the position, then she should have told me that upfront.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "22 Jul 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2016", "Interview Descriptions": "Interview was a positive experience. I had a panel of 3 people. Interview lasted approximately 30 minutes. Most of the time was spent telling me about the unit and answering any questions that I had.", "Interview Questions": "Why do you want to work at TGH?"}, {"date": "26 Feb 2016", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital", "Interview Descriptions": "I met up with the manager first for a few minutes and then had a group interview with nurses on the floor and direct supervisors. The interview was professional but everyone was at ease and open, more like a conversation.", "Interview Questions": "Why did I want to work at TGH"}, {"date": "21 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital", "Interview Descriptions": "Many getting to know you questions and a few clinical scenarios. No wrong answers. but be prepared to justify your critical thinking that brought you to the answer. The best thing to do is take your time to answer and explain if you are not sure why.", "Interview Questions": "What your goals are."}, {"date": "5 Nov 2015", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Tampa General Hospital (Tampa, FL) in Nov 2015", "Interview Descriptions": "The process was simple and convenient. The people who did the interview were very friendly and conducted the interivew in a professional manner. The HR dept provided all the information needed and also provided any answers to your questions. Overall the interview and the process was very positive and the people made you feel comfortable.", "Interview Questions": "What brought you to apply for TGH"}, {"date": "31 Dec 2015", "title": "NICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital in Nov 2015", "Interview Descriptions": "Very personable and easy to interview with spent time answering all questions and gave a tour of the unit. Also allowed me to speak with staff to answer any questions I had they could answer better than the manager.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "14 May 2018", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1+ week. I interviewed at Tampa General Hospital (Tampa, FL) in Nov 2015", "Interview Descriptions": "The interview process three types: One interview was with 10 interviewers in the conference room. The next interview was one on one with a seasoned unit manager she was very thorough. The last interview was with two unit managers also very thorough.", "Interview Questions": "Tell us five words to describe your character."}, {"date": "30 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Sept 2015", "Interview Descriptions": "Process all together took  a little over a month. Applied online. Got a call from HR said she was forwarding my resume to the applied departments. Got a call from 2 of them with in 3 days. Interview was easy and only a few questions were asked. Received a call the day after with an offer.", "Interview Questions": "Why do you want to work at TGH?"}, {"date": "10 Aug 2019", "title": "Surgical Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Tampa General Hospital in Sept 2015", "Interview Descriptions": "Very nice manager and 3 charge nurses.everyone is easygoing. 30 minutes just to really try and get to know you.not to try and make you feel uncomfortable. They really are great people", "Interview Questions": "My values"}, {"date": "11 Aug 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Very easy going and stress free.  I met one on one with the hiring manager first.  I then met with human resources.  Overall, a very pleasant experience.  I would recommend this facility.", "Interview Questions": "Tell me why you should get the job"}], [{"date": "20 Aug 2015", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Tampa General Hospital (Tampa, FL) in Aug 2015", "Interview Descriptions": "TGH is a very complex and strict system however the employees are very hospitable. I am just starting externship there but would be delighted to become an employee. They have some of the best benefits around the area and the have state of the art equipment.", "Interview Questions": "Long term goals."}, {"date": "21 Jul 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "Interview scheduled by HR who talked to me over the phone and by email. Supervisor and her manager interviewed me. I was interviewed early in the morning. They asked about my clinical background, experience, how I get along in an office environment and team work type questions.", "Interview Questions": "Internship"}, {"date": "6 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2015", "Interview Descriptions": "Phone interview first with recruiter, then face-to-face interview with Clinician and Unit Manager. Interview with recruiter was super easy...just a general tell me about yourself question, then reviewed types of units that were hiring and what would be best fit for me. Interview with Clinician and Unit Manager was 75% them telling me what floor was like, and then just a couple of questions about myself and my work experience, and why I wanted to work at there. Received an offer next business day.", "Interview Questions": "1. Tell us about yourself\r\n2. Experience\r\n3. \"Time when....\" type questions"}, {"date": "4 Aug 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2015", "Interview Descriptions": "After the application was submitted, I got a call about 2 weeks later for an interview. It was a panel of 6 people. They said I would hear back between 1 and 2 weeks.", "Interview Questions": "If I had a lazy co worker who kept asking me to do do things while they were just sleeping. What would I do?"}, {"date": "17 Nov 2015", "title": "Transport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tampa General Hospital (Tampa, FL) in Jul 2015", "Interview Descriptions": "Got a phone call, came in to meet with the supervisor. He reviewed my resume, talked for a minute regarding my qualifications. He told me about the position and what I would be doing (did not end up doing exactly what was described) and then he hired me on the spot.", "Interview Questions": "Why do you want to work here though? You won't get bored?"}, {"date": "12 Jan 2016", "title": "Rehab Therapy Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Tampa General Hospital (Tampa, FL) in Jun 2015", "Interview Descriptions": "Required to take a computer test before even having the chance to receive an interview. Once you take the test and get a good score, you are then offered an interview. Interview was in front of 4 people, all coordinators of the rehab hospital. The interview questions weren't too challenging, and the people giving the interview were personable and easy to talk to", "Interview Questions": "how would I respond to a fellow employee getting in my face demanding I hurry up and finish the schedule "}, {"date": "14 Mar 2016", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Mar 2015", "Interview Descriptions": "Very easy, staff was incredibly friendly and thorough. The questions pertained to the job and were very clear about the expectations upon hiring. The HR staff was not intimidating at all and seemed very down to earth. The interview felt more like a conversation rather than an interview.", "Interview Questions": "What are your goals in the next 3 years?"}, {"date": "21 May 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Tampa General Hospital (Tampa, FL) in Feb 2015", "Interview Descriptions": "What a disaster. Job requirements changed 3 times during the process, 2 full work days of interviews -one half day, one phone. Some interviewers were unprepared, had no idea why I was there. Paper system didn't sync with online, test intended for clinical providers but position administrative.\r\n\r\nOver four months, I waited weeks waiting for basic updates from absentee/unprofessional recruiters, staff were unable to answer questions about career options and/or EOE. Two implied offers for two different positions, lowballed on the second, then offer rescinded following request for clarity. I've never been so confused during a hiring process. Nor disappointed.\r\n\r\nA shame, as this is a beautiful facility...and I did meet some really nice people along the way. Still, they have a cultural issue that needs to be addressed.", "Interview Questions": "What do you think about Employee X, Y or Z?\r\nWhat do you think about current area strategies?"}, {"date": "10 Jan 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tampa General Hospital", "Interview Descriptions": "Two month process total including phone and in person interviews, lond distance so I flew in twice for in person and panel interviews as well as drug and background screen.", "Interview Questions": "Nothing too difficult"}, {"date": "19 Jul 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in Jan 2015", "Interview Descriptions": "Phone interview and talking about the position.  Went over the benefits as well as describing what entails going into this position.   Very easy process and interview for me.", "Interview Questions": "Why did you choose TGH?"}], [{"date": "4 Nov 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Tampa General Hospital in Oct 2014", "Interview Descriptions": "I was just an intern and shadowing a doctor that I knew as a family friend. Very helpful person and was able to communicate with medical students as well as medical interns.", "Interview Questions": "what would you like to get from this experience?"}, {"date": "8 Sept 2014", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "The interview was conducted with 4 other therapists in the department who took turns asking questions about my past work experience and how I would react in real world PT situations.", "Interview Questions": "Explain what you would do if you walked into a room with a patient?"}, {"date": "24 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Tampa General Hospital (Tampa, FL) in Sept 2014", "Interview Descriptions": "Easy.  Interviewed and was hired within a couple of days. Almost everyone in my graduating class from nursing school received jobs.  The only people who didn't failed the very arbitrary personality assessment.  In fact some who failed were top students in nursing school and performed extremely well in their clinicals and have gone on to have successful careers.  My advice would be to dump the personality assessment.", "Interview Questions": "Rate patient priority."}, {"date": "6 Feb 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Tampa General Hospital", "Interview Descriptions": "One interview with manager, then tour of unit.", "Interview Questions": "Very straight forward questioning. "}, {"date": "13 May 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Feb 2014", "Interview Descriptions": "Prompt response to application for position, interview with staff and assistant manager where roles were discussed along with work relationships and expectations in job role.  Positive feedback during interview process.", "Interview Questions": "Tell us about conflict in previous positions."}, {"date": "18 Apr 2014", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tampa General Hospital (Tampa, FL) in Jan 2014", "Interview Descriptions": "Meeting with managers to assess what skills I can bring to the department", "Interview Questions": "How long to you plan on staying at the Hospital  "}, {"date": "25 Nov 2013", "title": "OT Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Tampa General Hospital", "Interview Descriptions": "A lot of people in interview", "Interview Questions": "What would you say to an employee who wasn't pulling there wight"}, {"date": "7 Oct 2013", "title": "Phlebotomist/Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Tampa General Hospital (Tampa, FL)", "Interview Descriptions": "1988 APPLICATION FOR PHLEBOTOMIST.Interview went very well.the manager at the time was very impressed with my experience and job history.She was very pleasant and hire me immediatly.", "Interview Questions": "Not too many questions eccept for my employment history.I had to performed phlebotomy to show my skills under observation.The supervisor told she was very impressed."}, {"date": "17 Nov 2014", "title": "Registered Nurse Medical Surgical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tampa General Hospital in Oct 2013", "Interview Descriptions": "Applied online You have to complete a survey, first. Received call from HR about a week later. They asked preliminary interview questions over the phone, then scheduled an interview. I was offered a job at the interview. \r\n\r\n1. Why do you want to work here? \r\n2. Where do you see yourself in five years?", "Interview Questions": "They asked all the usual questions "}, {"date": "30 Nov 2016", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Tampa General Hospital (Tampa, FL) in Jun 2013", "Interview Descriptions": "Comprehensive. First level is interviewing with your peers. Then you interview with leadership. Peer review are scored and overall average calculated. Questions were very detailed. They included clinical scenarios and how you will manage such situations. They analyze your critical thinking.", "Interview Questions": "Why you think you would make a better clinician than others before you"}], [{"date": "13 Oct 2016", "title": "Office Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Tampa General Hospital (Tampa, FL) in Feb 2012", "Interview Descriptions": "I had three interviews before receiving a job offer. The first with an HR Recruiter, second with HR and hiring Director and lastly with hiring a Director and department VP. \r\nPrior to the interview being held at TGH, I was working with a Staffing Agency so I also had two interviews with them. The first involved computer testing and the second was a face-to-face interview. \r\nTGHno longer works with staffing/temporary agencies. They hire direct.", "Interview Questions": "Questions focused on past experience with supervising staff. If I've previously completed hiring, disciplinary action and terminating employees."}, {"date": "30 Sept 2012", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tampa General Hospital (Tampa, FL) in May 2011", "Interview Descriptions": "Very profetional, top of the line in everything i saw. One interview and i was hired straight off the bat. Good place to meet real good people", "Interview Questions": "They give u a patient scenerio and ask u \"what would u do for this pt?, or \"what med would u give em?\""}, {"date": "9 Jan 2014", "title": "Data Abstarctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Tampa General Hospital (Tampa, FL) in Aug 2010", "Interview Descriptions": "The hiring process was great and to the point", "Interview Questions": "There was no question I could not answer"}, {"date": "19 Sept 2014", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Tampa General Hospital in Jun 2010", "Interview Descriptions": "Hiring you have to keep following up with them. Interview - panel of people asking a variety of questions, that can be a little intimidating since you don't know what to expect.", "Interview Questions": "Describe something that is your weakness."}]]