[[{"date": "1 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elizabeth Glaser Pediatric AIDS Foundation", "Interview Descriptions": "Very fair. Just market yourself. Be confident. Don't be afraid to ask the panel to repeat or rephrase a question. Relax and talk until they tell you to stop talking.", "Interview Questions": "Why do you think that you are the best candidate for this job?"}, {"date": "22 Dec 2022", "title": "Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC) in Dec 2022", "Interview Descriptions": "The interview process started with a recruiter reaching out to me about 1 week after I applied, then the hiring manager expressed interest in speaking with me, then a week later I had a panel interview. So I would say 3 weeks in all", "Interview Questions": "They ask specific questions about your HIV/Aids work experience and TB."}, {"date": "14 Oct 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation", "Interview Descriptions": "Lengthy technical interview, the staff were quite inviting, and it felt more like a real on-ground technical program implementation. Know your field thoroughly well. The interview was via zoom meeting, which took roughly 1 hr 30 mins.", "Interview Questions": "Tell us why your experience matches the requirement."}, {"date": "13 Sept 2022", "title": "Cajera Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Guadalajara, Jalisco) in Aug 2022", "Interview Descriptions": "Conocer al gerente de área, se presenta, plática y te da confianza, te pregunta sobre ti y tu familia, me encantó como hace q te desarrolles y tengas confianza. Pasas antes por un proceso de preguntas y exámenes psicométricos, exámenes de tiempo y entrevista con RH.", "Interview Questions": "Tienes hijos, porque trabajar en coppel, que estudios tienes, te gustaría seguir estudiando, cómo manejas el estrés "}, {"date": "4 Feb 2022", "title": "Senior Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC)", "Interview Descriptions": "The hiring manager seemed genuinely interested in hearing about my background.  Afterwards, I received very positive feedback from the recruiter highlighting my strengths. I was left with a very favorable impression of the organization.", "Interview Questions": "There were a series of questions related to management approaches. "}, {"date": "1 Feb 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation in Jun 2021", "Interview Descriptions": "One phone call to describe the position and ask a few questions such as career goals, experience, etc. The questions were very basic and generally just sought to understand whether you have the necessary skills to contribute to the project.", "Interview Questions": "Do you have experience with qualitative analysis?"}, {"date": "6 Apr 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elizabeth Glaser Pediatric AIDS Foundation", "Interview Descriptions": "Multiple interviews with straightfoward questions regarding experience and the role. Met with Sr. and Jr. staff as part of the interview process and was able to meet other team members", "Interview Questions": "Why do you want to work at EGPAF?"}, {"date": "23 Jul 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Lilongwe) in Feb 2020", "Interview Descriptions": "Very rigorous it took a lot of practice preparing for  such a high level position.it was not easy. A very impressive panel with the country director and hr. Questions were easy to ans but required experience in the health sector", "Interview Questions": "Why do you want to join us"}, {"date": "7 Feb 2023", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Kasungu) in Sept 2019", "Interview Descriptions": "structured , no pre written quiz. An oral interview with technical questions in line with the thematic area. Panel of 5-6 technical and admin staff sometimes from consortium partners . After references and job is granted", "Interview Questions": "Technical areas surrounding HIV/AIDs and leadership"}, {"date": "5 Dec 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (San-Pédro) in Aug 2019", "Interview Descriptions": "rencontre avec le responsable administratif et financier qui après s'être assuré de l'identité de son interlocuteur commence l'entretien. celle-ci à eu lieu dans la salle de réunion du sous bureau après rédaction de lettre de motivation et autres.", "Interview Questions": "quelle procédure utiliserez vous pour accomplir les tâches qui vous seront confiées ? "}], [{"date": "20 Jun 2019", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elizabeth Glaser Pediatric AIDS Foundation", "Interview Descriptions": "hiring process was quick.  I did a phone screening interview then I was invited for an inperson interview in Washington DC. A week after the interview, I received the offer.", "Interview Questions": "I was given a short IT assessment."}, {"date": "29 Mar 2019", "title": "HIV Senior Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Yaoundé) in Mar 2019", "Interview Descriptions": "I had a Skype interview, carried out by a team of 3 senior staff as well as the HR. Questions were asked in both French and English. Panelist took tend to ask questions and follow-up questions. You were expected to provide short and concise answers. Unfortunately due to time constraints,  each interview was rushed, and lasted just 30mins. Questions didn't focus on my achievements so far. However most questions were at my reach.", "Interview Questions": "Describe the different health programs in your country."}, {"date": "25 Mar 2019", "title": "Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Kampala, Orientale) in Mar 2019", "Interview Descriptions": "Its the  best and easiest which simply save time,so i prefer this type because it saves money and time,it could be very difficult for some one not to like such interview.", "Interview Questions": "the overall experience"}, {"date": "20 Feb 2019", "title": "Compliance Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC) in Dec 2018", "Interview Descriptions": "Three one-on-one interviews, by phone. I was out of the area. Employee referral. HR and interviewing staff was very friendly. Ultimately, the pay for the position was too low, as I would have been re-locating from a lower-cost part of the country and used to a different cost of living ratio to my pay scale.", "Interview Questions": "No specific questions stuck out - fairly generic"}, {"date": "5 Apr 2018", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation", "Interview Descriptions": "I applied via email, was called for an interview about 2 weeks later. In the interview, I was asked questions that demonstrated my technical skills, as well as critical thinking. I received an offer a few weeks after the interview.", "Interview Questions": "General questions about choice of data structures, and specific tasks such as  reversing words in a string"}, {"date": "20 Dec 2018", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Paris) in May 2017", "Interview Descriptions": "Entretien participatif axer sur les compétences du candidat.  Système de sélection hautement spécifique avec une transparence dans le processus de sélection.  Bonne démarche dans la publication des offres, conduite des entretiens et publications des candidatures retenues", "Interview Questions": "Votre expérience professionelle"}, {"date": "5 Oct 2016", "title": "Procurement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Nairobi) in Mar 2016", "Interview Descriptions": "The interviewer really concentrates in in skills that one has in the same field in terms of experience and expertise in the same job. Emotion and how to control it is also key in such forum. The other important thing is what you have been doing to gauge the relevance of the skills you have this helps them to know how aggressive you are in terms of self development to further enhance your skills.The other critical factor is your mode of delivering of your wording in the consistent way which gives them a hint on your communication skills that is key in organisations today", "Interview Questions": "Tell us about yourself"}, {"date": "3 Aug 2015", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC)", "Interview Descriptions": "I applied online and was contacted the next day. In one week, I went through an initial phone screening, an hour-long phone interview with the supervisor, and then a two-hour in-person interview with the department. I felt like the interviews went well overall and I clicked well with the staff. I left my final interview with a strong impression that I would be followed up with very soon. A week went by and no contact, so I sent an email to the manager. The only response I received was a generic response from the recruiter telling me I was not selected. Which is fine, but they definitely knew much sooner they would not be selecting me and I felt that at the very least I should have been contacted instead of me having to reach out after one week.", "Interview Questions": "Why are you interested in this position?"}, {"date": "20 May 2015", "title": "Corporate Services Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC)", "Interview Descriptions": "The interview process was easy and comfortable at the Foundation; I had a panel interview with the two staff that would be my bosses, and they kept it very informal and conversational. The feedback from the interview was quick, and the offer process went smoothly as well.", "Interview Questions": "The questions were pretty normal - previous experience, discussing different examples of my project work, etc."}, {"date": "7 Apr 2014", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC)", "Interview Descriptions": "Two weeks after applying for the position, I was contacted for an initial phone interview with someone from HR, and the day after the phone interview, I was invited to the office for an in-person interview. A few days later, I was asked to complete a skills assessment, and upon completion, I was asked to come in for a third and final interview with several staff. After the third interview, I never heard back from anyone; I did send a follow-up e-mail but never received a response.", "Interview Questions": "What do your current colleagues come to you for that is not work-related? "}], [{"date": "22 Mar 2014", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Elizabeth Glaser Pediatric AIDS Foundation", "Interview Descriptions": "I found the interview to be quite rigorous. I had several in-person interviews, as well as telephone interviews with peers and leadership one level up. The entire interview and hiring process was exceptionally efficient - the length of time from my first screening to the final offer  was just shy of 3 weeks (and no, I had absolutely no contacts or networks prior to applying).", "Interview Questions": "Since I was applying for a technical role, the questions were more experience and skills-based than conceptual. it was either you had done the work before and could confidently answer the questions, or you had not."}, {"date": "13 Mar 2014", "title": "Country Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC)", "Interview Descriptions": "The HR team at EGPAF seems to be much improved in the past few years.  I received a lot of correspondence from the recruiter in charge of my case.  I had an in-person interview in the Washington, DC office.  There was no financial reimbursement to cover costs for traveling for the in-person interview.  After the in-person interview, I had to wait several weeks before hearing that I will interview with other staff on the phone.", "Interview Questions": "For the Country Officer position, I was asked several times about my program and agreement management experience.  I got the impression that they were not looking for candidates with strong technical skills, but with stronger management experience. "}, {"date": "20 Jul 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Elizabeth Glaser Pediatric AIDS Foundation", "Interview Descriptions": "Worked there for five years.", "Interview Questions": "The interview was based on specific job qualifications"}, {"date": "14 May 2015", "title": "Associate Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC) in Jan 2013", "Interview Descriptions": "Too many interviews with too many people. It dragged on for months. HR is clueless. There was no consideration for the fact that I was currently employed and could not continue to come for interview after interview, 5 in total.", "Interview Questions": "Tell me about yourself"}, {"date": "26 Jul 2012", "title": "Grants Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Elizabeth Glaser Pediatric AIDS Foundation (Washington, DC) in Feb 2008", "Interview Descriptions": "HR person was very friendly and portrayed an excellent view of the Foundation and the work that it does.  She made it fun to want to be a part of the company.", "Interview Questions": "You are overqualified for the position so why do you want to apply?"}]]