[[{"date": "10 May 2023", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sullivan University (Lexington-Fayette, KY)", "Interview Descriptions": "Virtual interview conducted by 2-3 people. This was basic interview questions and more information on the actual position/hours/wages. After initial interview, asked to come in to shadow and meet with supervisor and team.", "Interview Questions": "How do you feel about student loans?"}, {"date": "13 Jan 2022", "title": "Enrollment Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sullivan University (Louisville, KY) in Jan 2022", "Interview Descriptions": "Very strange and unprofessional. Initial phone interview was okay. I was then scheduled to meet with three people via Teams. They asked very few questions, spent a lot of time laughing with each other, and one person's phone was continuously going off. It seemed like they weren't interested at all in filling this position.", "Interview Questions": "If you were an animal, what would you be? If you were a tree, what would you be?"}, {"date": "20 Sept 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sullivan University", "Interview Descriptions": "Application online to be completed.  Then a phone interview.  Next, a face to face interview with the department head or higher.   Next, I met with several people in the department before accepting a position.", "Interview Questions": "Why do you want to work for this Univesity?"}, {"date": "22 May 2018", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Sullivan University (Chicago, IL)", "Interview Descriptions": "In person interview with director level/dean for an adjunct teaching position. Completely unprofessional and rude.  Very demeaning experience and a waste of time and personal resources. Completely uninterested in talking to me and then lectured me on a variety of unsolicited topics based on a personal philosophy.  The most unprofessional interviewing experience that I have ever had.", "Interview Questions": "N/A"}, {"date": "11 Nov 2017", "title": "Admissions Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sullivan University (Louisville, KY)", "Interview Descriptions": "Apply online and then have phone interview. Interviewer was a total moron who asked really stupid questions and then she tells me she will call me back the following week and I never heard from her since. After reading the other horrible reviews on here I would have told her NO if she had offered me the job", "Interview Questions": "How do you go about motivating people?"}, {"date": "31 Jul 2017", "title": "International Compliance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sullivan University (Louisville, KY) in Jul 2017", "Interview Descriptions": "So far I have had a phone interview and am waiting on the next steps! So far it has been an easy process. I have been coordinating and communicating with the hiring manager through email.", "Interview Questions": "What management style has lead you to be successful? "}, {"date": "7 Jan 2016", "title": "Financial Planning Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sullivan University", "Interview Descriptions": "There were a total of three interviews- a phone screening, an in-person with the direct hiring manager(s), and an in-person interview with the CEO or another executive. At times, they may require a panel interview with at least 3 managers.\r\nBe prepared for a behavioral style interview!", "Interview Questions": "What kind of experience do you have using CampusVue And provide an example of a time when you queried said system- how did you know that the data was correct? "}, {"date": "2 Dec 2015", "title": "Professor of General Studies Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Sullivan University", "Interview Descriptions": "I met the dept. head, and was hired the next day.  I was well qualified for the job, and this was fully recognized.  There rally was no \"interview process\" as there are for most other places.", "Interview Questions": "What is your prior teaching experience?"}, {"date": "5 Feb 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sullivan University (Louisville, KY) in Nov 2015", "Interview Descriptions": "It was held by The department chair and Dean of Academic affairs, they asked questions about my background and my experiences, they were taking note on my questions, later on Dean of evening classes joined the meeting. \r\nThey were asking me if I can teach subjects that I wasn't expert in and my answers was I do prefer not to do that and if I have to I need at least a month to get ready for them.", "Interview Questions": "What do you do if a student is not coming to class?"}, {"date": "22 Jul 2015", "title": "Financial Planning Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Sullivan University", "Interview Descriptions": "Applied and was called about three weeks later. There was a brief phone screen followed by a face-to-face with the director and an HR rep. Less than a week later I got a call back about meeting with the director, executive director, a different HR rep, and a would-be peer from within that department.   Within a week from that meeting I received a call offering the position. The interview was straightforward and the questions were pretty standard altogether. The process from initial phone screen to offer was about a month.", "Interview Questions": "What do you like least about your current manager?"}], [{"date": "9 Jun 2015", "title": "Sales Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sullivan University (Louisville, KY)", "Interview Descriptions": "very detailed, you will be put through the mill depending on the department.  They'll give you assessment tests but mostly determine if you are a good fit for them by how you look.  You can snow them by being extremely positive.", "Interview Questions": "study your behavioral questions"}, {"date": "20 Aug 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sullivan University in Feb 2015", "Interview Descriptions": "There was an initial phone interview. Then, they called me back for the first face to face interview with the hiring manager. Afterwards, I had another interview with three individuals in management. Received job offer shortly afterwards.", "Interview Questions": "Why are you looking for a new position? "}, {"date": "27 Oct 2015", "title": "Front Desk Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sullivan University (Louisville, KY) in Jan 2015", "Interview Descriptions": "The interview will go easy but will likely follow this example.Tell the candidate a little about the job: While you don't want to dominate the interview time, you should start with a brief summary of the position, including the prime responsibilities, reporting structure, key challenges, and performance criteria. This will help the candidate provide relevant examples and responses.", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Sept 2017", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Sullivan University (Louisville, KY) in Dec 2014", "Interview Descriptions": "Found job listing in the company portal and applied online. Received a phone call for interview questions about the position, why I think I would be qualified and what was my previous experience.", "Interview Questions": "Job experience. "}, {"date": "5 Sept 2014", "title": "Cook Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Sullivan University", "Interview Descriptions": "not much of a interview process they sit down and ask about past work and tells you about what they expect from you. they will talk about the hours and ask you if you have any questions for him if not then that is the end of the interview", "Interview Questions": "none pretty standards"}, {"date": "1 Aug 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Sullivan University (Louisville, KY)", "Interview Descriptions": "There was really no interview process as the position was created and designed specifically for me to accept this leadership role in a newly designed position. The interview was really based on years of service to the University and proven track record for success in the position.", "Interview Questions": "N/A"}, {"date": "3 Jul 2014", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sullivan University (Louisville, KY)", "Interview Descriptions": "Initial phone interview asked typical questions about history, why you would be a good fit, and sales experience. There were no real questions asked, most of the time was spent with the two managers discussing things they do not like about other departments. Very easy interview.", "Interview Questions": "None. This was the easiest interview of my career."}, {"date": "13 Feb 2014", "title": "Admissions Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sullivan University (Louisville, KY)", "Interview Descriptions": "I was asked to return for a second interview after what seemed like a very promising first interview, both times with a panel of interviewers, and both times 4 different people. At the beginning of the second interview I was shown around and introduced to pretty much the entire department. I hung out with them for a while and just chatted casually about the work culture and the job. Looked promising. At the interview I was asked all the same questions as in the first interview. At the end I was told that I was 1 of 6 interviewees, and there were 6 open positions. To me this is an unofficial way of saying I got the job. They said they would call me by the end of the next week, and even after I called back the following week to see if the position was filled, I never heard back from them, not even to tell me I didn't get the job. Pretty unprofessional.", "Interview Questions": "\"If a low-income, at-risk student asked you for advice on a college to attend, would you tell them to go to community college, or a for-profit college?\""}, {"date": "27 Aug 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Sullivan University (Louisville, KY) in Nov 2013", "Interview Descriptions": "telephone interview then in-person... once they reviewed my credentials and transcripts it was a much smoother process.  Very professional, prompt and responsive.  Hiring manager was very professional, courteous and answered all my questions.  I was very impressed.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "16 Oct 2015", "title": "Financial Planning Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sullivan University (Louisville, KY) in Apr 2013", "Interview Descriptions": "They asked typical interview question. They lied about the work schedule and turn over rate during the interview. The first interview was with The assistant director and a coordinator interview. The 2nd interview was with the acting director and assistant director. They liked that I had experience working in a college.", "Interview Questions": "Did I have Financial Aid experience?"}], [{"date": "16 Apr 2013", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sullivan University in Jul 2012", "Interview Descriptions": "I had a preliminary phone interview, then an in-person interview on campus with the Director of Admissions, Academic Dean, and Campus Director. It was all pretty basic stuff - although after I completed the interview and accepted the job offer, I discovered that they had used much of the interview time to be misleading about what the actual job entailed.", "Interview Questions": "Mostly just a lot of \"have you ever experienced...\" and \"how would you handle...\" questions."}, {"date": "30 Jun 2013", "title": "Senior Associate Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Sullivan University (Louisville, KY) in Jul 2011", "Interview Descriptions": "Long process but worth the time and work required.", "Interview Questions": "Many 'what if' scenarios.  Advise to answer honestly and not to over think responses."}, {"date": "24 Jul 2011", "title": "Career Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sullivan University (Louisville, KY) in Mar 2011", "Interview Descriptions": "The interview process was brief. I had what I thought was a great interview. I was told the interviewer would be in touch within a week or two. Two weeks later I followed up and was told that he would get back with me in a week and a half. After multiple follow ups and no contact from them, I can only assume I did not get the job. Very unprofessional for a \"career services\" department.", "Interview Questions": "Why you?"}, {"date": "20 May 2013", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sullivan University (Louisville, KY) in Oct 2010", "Interview Descriptions": "The interview was informal, no real discussion of expectations. There was gossip about other departments and how negative they were. I could hear employees complaining while waiting for the interview about students and other employees.", "Interview Questions": "I was not really asked any questions. It was as if I was a counselor and the interviewer was venting to me about all the issues. There were people dressed professionally and some that looked like they could care less how they looked. "}, {"date": "10 Dec 2014", "title": "Professor of General Studies Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Sullivan University (Louisville, KY) in Aug 2010", "Interview Descriptions": "Very Easy.  Answered ad in paper.  Chatted with dep't. head.  Seemed informal.   Got hired by phone the next day.  I was more qualified than tey expected to get at that time.  They were happy to get me, at that time.", "Interview Questions": "N/A"}]]