[[{"date": "29 Apr 2023", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Morgan State University", "Interview Descriptions": "Very thorough interview process. You are definitely tested and put through scenarios to make sure you are properly prepared. There is a hiring carousel, where you are guided through workshops and tested in real scenarios that RAs will see during their work tenure.", "Interview Questions": "How are you with conflict management?"}, {"date": "23 Nov 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Morgan State University (Baltimore, MD)", "Interview Descriptions": "I received an email requesting an interview approx. 6 weeks after applying. The 3-person panel interview was round-robin style and very short (30 minutes). It was not described to me as a preliminary interview but the shortness made it feel that way, although the questions were not preliminary questions. There was no \"tell me about yourself/experience\" opportunity and it felt quite rushed.", "Interview Questions": "What makes you qualified for this position? Tell me about how you handled a difficult colleague. Tell me about a time in which you were frustrated and what you did."}, {"date": "8 Jul 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Morgan State University (Orlando, FL) in May 2020", "Interview Descriptions": "Had a first round recording then a second round presentation which kept getting interrupted by the committee and then I was rushed towards the end for being too long (when they kept interrupting my timed presentation) and then wasn’t allotted time to ask my questions. It’s been 6 weeks since the interview and I’ve followed up twice and they say the position is open and still being hired but I’m still applying else where. Communication needs to improve with this process even if you don’t want the candidates.", "Interview Questions": "None. Just a video of my qualifications and then a presentation"}, {"date": "26 Mar 2020", "title": "IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Morgan State University", "Interview Descriptions": "pretty standard questions, was asked about a couple scenarios but you just need basic technical knowledge for this position and those are the type of scenarios asked. pretty sure I got hired on the spot because the process started the next couple days.", "Interview Questions": "how would you go about fixing a computer connection"}, {"date": "17 Mar 2021", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Morgan State University in Jan 2020", "Interview Descriptions": "Great interview on campus. Just be sure to Plan ahead for parking and walking.  Pull\r\nup university map in advance so you won’t get lost. Interview was a very comfortable setting and the people on campus were inviting.", "Interview Questions": "How do you deal with difficult situations? "}, {"date": "18 Jul 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Morgan State University (Baltimore, MD)", "Interview Descriptions": "I did a job talk that included questions and answer portion. I got a chance to meet current faculty and I got a tour of campus and off campus locations. Colleagues took me to lunch and I got a chance to talk more with them. Overall it was a great process.", "Interview Questions": "What are my research interests?"}, {"date": "15 Jul 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Morgan State University (Baltimore, MD) in Jul 2019", "Interview Descriptions": "I had one interview, and a faculty member recommended me for the position. This was a few years ago, so I do not remember many details about the interview. Nor do I remember any specific questions.", "Interview Questions": "N/A"}, {"date": "31 Jul 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Morgan State University (Baltimore, MD) in Feb 2017", "Interview Descriptions": "First a phone interview, then invited in for an in-person interview. Typing and spelling tests were required, as well as secretarial skills (which is an absurd and outdated process). Who requires business letter writing and formatting anymore?", "Interview Questions": "Why are you leaving your current position?"}, {"date": "7 Sept 2016", "title": "Administrative Assistant to the Associate Vice President for Academic Affairs/Provost Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Morgan State University (Baltimore, MD)", "Interview Descriptions": "She heard about my skills and called me while I was working at Johns Hopkins School of Epidemiology.  A co-worker said that she would pass my resume along although I was satisfied with my job with The Bloomberg School of Epidemiology.", "Interview Questions": "What was my current salary.  What makes me stand out...I responded my had a varied Federal Government (Department of the Army) protocol, I had a current secret clearance, I had executive experience while working with high ranking military officers (Gen. Colon Powell...) I worked on Capital Hill as a lobbyist.  Once my government position changed they kept me on as a contractor for over 8 years.  Did I have any executive authority? I replied yes."}, {"date": "27 Feb 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Morgan State University (Baltimore, MD) in Apr 2016", "Interview Descriptions": "It was a pretty quick and simple process. Before you can interview for your position you must contact HR to take the clerical test. I did not like the test as it seems to be pretty dated. Once you pass the test your name goes on a list of eligible candidates. Then, you can interview for the position you applied for via the online site.", "Interview Questions": "Describe your experience as an administrative assistant. "}], [{"date": "31 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Morgan State University in Apr 2016", "Interview Descriptions": "Once you apply for a position through the Morgan website, you will be contacted by the HR department to schedule a time to take the clerical test. Once you've passed the test, your application is sent out to the departments that are hiring. That department will then follow up with you to schedule an in-person interview.", "Interview Questions": "How is your time management?"}, {"date": "9 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Morgan State University (Baltimore, MD) in Jan 2016", "Interview Descriptions": "2 formal interviews that asked about work experience and research mostly. After that I was asked about my writing sample that I submitted and talked about how I gathered data for it.", "Interview Questions": "What motivates you to be a successful employee?"}, {"date": "14 Sept 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Morgan State University (Baltimore, MD) in May 2015", "Interview Descriptions": "It was very basic questions. The interviewer was very nice and friendly. She asked me few behavioral questions and that was it. it was a very easy question, nothing too applied and technical. Describe your previous work experience?", "Interview Questions": "When i would like to begin?"}, {"date": "13 May 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Morgan State University (Baltimore, MD) in Mar 2015", "Interview Descriptions": "The process was informal and haphazard with substantial lag time between conversations. The process involved a series of phone calls spread out over months.  It did not recieve priority attention.", "Interview Questions": "Do you think you would be able to help us improve our current situation."}, {"date": "19 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Morgan State University (Baltimore, MD) in Oct 2014", "Interview Descriptions": "I was actually hired before going through HR.  When I did go through HR it was the usual clerical test.  Then completing the standard hiring package.  Did require background check and fingerprinting.  Took about three months to get put into the system and first pay.  Very inadequate processing of new hire paperwork. .", "Interview Questions": "Do you have experience working with graduate students? Working on teams? Budgets?"}, {"date": "29 Dec 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Morgan State University in Jun 2013", "Interview Descriptions": "There is a long process because it's a state institution. Submit application through the HR website and then you wait... Then all of the applications get sent to the actual department and they interview you. I had a phone interview because of my distance, but I had to ask for it. It was a panel of 3 people with standard Residence Life type questions.", "Interview Questions": "What do you want to have accomplished at the end of your first year?"}, {"date": "20 May 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Morgan State University (Baltimore, MD) in May 2013", "Interview Descriptions": "The interview process was successful. However, the response to the new hire was very slow. Regardless, I felt comfortable and was able to fit right in with the current employees and felt welcomed during the interview process. The intimidation factor was low for the Director, which is generally stern. I felt comfortable talking to him.", "Interview Questions": "How would you adhere to the needs of the typical male student at Morgan State University?"}, {"date": "19 Mar 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Morgan State University (Baltimore, MD)", "Interview Descriptions": "The interview process included a typing test, an examination of my MS Word skills, and a proofreading test before I was allowed to interview with a department.  Unless it has been updated the equipment used to test was incredibly outdated and in need of repair.  I was hired by the university and given a start date that differed from the department I was hired to work for.  I began working in the office three weeks after my initial interview.", "Interview Questions": "There were no questions that were particularly difficult or unexpected."}, {"date": "7 Jun 2015", "title": "Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Morgan State University (Baltimore, MD) in Jun 2012", "Interview Descriptions": "It was fairly easy and relaxed. It really is nothing at all to sweat. The interviewees were not at all combative or fierce. They were rather surprisingly accommodating. I was treated not as a potential employee but as a human being. It was a very peaceful atmosphere.", "Interview Questions": "Will you be willing to report fellow co-workers if they plot wrongdoing?"}, {"date": "13 Dec 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Morgan State University (Baltimore, MD) in Jun 2012", "Interview Descriptions": "The hiring process for Morgan is extremely long and drawn out and once hired you don't get paid for a whole month. Many times they expect you to start working before you even sign your contract and your starting date keeps getting pushed back. This is especially true for student worker positions", "Interview Questions": "What are some things you have a low tolerance for"}], [{"date": "14 Dec 2015", "title": "English Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Morgan State University (Baltimore, MD) in Aug 2011", "Interview Descriptions": "Casual and professional interview process with the Chair of the English Department. I was hired on the spot. The Chair was warm, friendly, and professional when he inquired about my background teaching English writing and literature in a higher education setting. The receptionists and administrative assistants were very friendly and made me feel comfortable. I was not nervous during the interview.", "Interview Questions": "What is my experience teaching English?"}, {"date": "12 Feb 2013", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Morgan State University (Baltimore, MD) in Jul 2009", "Interview Descriptions": "Met with the chair of the department and we talked about my background in the subject.", "Interview Questions": "There was none, the interview was very laid back. "}, {"date": "4 Jul 2011", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Morgan State University (Baltimore, MD) in Jun 2009", "Interview Descriptions": "Pretty simple, lasted about 5-10 minutes. I didn't even know they were going to interview me that day I was just putting in an application. I just had a quick conversation with the secretary I would be assisting. She basically gave me an overview of the workload I would be expected to perform and asked was I fine with everything before hiring me.", "Interview Questions": "Are you available to work throughout the entire summer?"}]]