[[{"date": "12 May 2023", "title": "Senior Technical Trainer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "I applied and was contacted by a recruiter with whom I had two interviews. I then had an interview with the CIO and another person. Interviews went well. I was offered the job and was told I needed to verbally accept it before getting a written offer. I thought that was strange considering I hadn’t seen anything in writing, but figured maybe that’s how they do their hiring. Upon waiting for the written offer, the recruiter called me and told me they gave the job to someone else. Yes, you read that right. The job I already accepted. They made me go through the application process, entire interview process, reference check etc, then made me orally agree to take the job just to give it to someone else.  They did not even let the recruiter know they had another candidate in mind. Thank goodness I did not give notice at my current job. Steer clear of this place. They clearly run an unethical business.", "Interview Questions": "How would you train a non technical audience on software?"}, {"date": "20 Mar 2023", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "Interview with a Director of Admissions. Take a personality assessment test. 2nd interview is with the Campus President. Possibly an interview with a Asst Vice Chancellor of Admissions. Sometimes the Director of Admissions will conduct group interviews to determine which candidates will be invited back for individual interviews", "Interview Questions": "Behavior based questions. Tell me about a time when you…. Had to achieve a challenging goal. Made a mistake at work. Received constructive feedback from a supervisor."}, {"date": "3 Apr 2023", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Keiser University (Orlando, FL) in Mar 2023", "Interview Descriptions": "You meet with the director and president afterwards. The director acts you a series of questions about yourself and what you can offer to the company. They tell you about the position is demanding with being open from 7am to 9pm but you have your schedule a month in advance. Not only are you speaking to parents and students but your doing about 100 outbound calls to bring students to the school.", "Interview Questions": "Why do you want to work here? What were your difficulties as a student? Are you open for am and pm schedule?"}, {"date": "22 Feb 2023", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "interview was great. Asked basic interview questions. why do you want to work here etc. people were very nice. interviewer was nice and awnsered my questions in a respectful manner as well", "Interview Questions": "why do you want to work here"}, {"date": "16 Feb 2023", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Keiser University in Feb 2023", "Interview Descriptions": "Basic interview questions with the program director on campus . Then I was asked to come in for 15-20 minute teaching presentation during the day which was difficult for me to get off of work during these scheduled times", "Interview Questions": "Why Keiser? Why do you want to leave your current job?"}, {"date": "19 Dec 2022", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "Face to face interview. Mostly title IV questions. How to walk students through the financial aid application and reviewing their financial aid package with the student and submitting documents in a timely manner:", "Interview Questions": "Are you familiar with applying for FASFA?"}, {"date": "16 Feb 2023", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Keiser University in Dec 2022", "Interview Descriptions": "Idk I guess my big personality was too much . We had a good interview I believed , and then someone else way past when they said they would reach out told me I was accepted , however it would have been nice to receive that from the recruiter who interviewed me . It was done very direct and uncaring and no feedback. Felt like a waste of my time .", "Interview Questions": "N/A"}, {"date": "15 Oct 2022", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "They were very friendly and asked relevant questions. You come in and they have you interview with a senior admissions counselor.. in my case.. she was the nicest person and very insightful.", "Interview Questions": "What would you do if a student said she didn’t want to take on student loans?"}, {"date": "12 Sept 2022", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University (Fort Lauderdale, FL) in Aug 2022", "Interview Descriptions": "three total interviews, one  was in person two on zoom. the first zoom call includes various levels of administrators asking typical interview questions. overall a long and tidious process but the interviewers are friendly and inviting", "Interview Questions": "why you over someone else?"}, {"date": "30 May 2022", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "It was handled very professionally.   I felt at ease when giving my instructor topic to the staff.  They interacted well with my didactic and the interaction between myself and the staff was smooth and I felt I had the ability to be myself.", "Interview Questions": "How I felt about being an instructor"}], [{"date": "8 Mar 2022", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Keiser University", "Interview Descriptions": "Had a virtual interview and then had to come in for a teaching demonstration with a room of faculty and then they evaluate you after that and compare with other candidates to decide the chosen person for the position.", "Interview Questions": "What are your future goals to improve yourself?"}, {"date": "21 Mar 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University (Fort Lauderdale, FL) in Mar 2022", "Interview Descriptions": "It felt like it was good. Applied, took a PI test, scored an interview, did the background check. Everything came back fine. Only thing that’s odd is that there is an approval process after the background check. Head of Human Resources has to review everything and “approve” the application process. I’ve been waiting over a week for this “approval.” So now I feel like I just didn’t get the job. I don’t think they should advertise “urgently hiring” if that’s truly not the case.", "Interview Questions": "Tell me about yourself?\r\nTell me about a time that was difficult at your job but you solved the customers problem?"}, {"date": "14 Oct 2021", "title": "Assistant Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Keiser University (Fort Lauderdale, FL) in Oct 2021", "Interview Descriptions": "Library Director called to offer initial interview.  The interview was a casual meeting style in an office with the Library Director, Director of IT, with a Librarian, and a Library Clerk coming in to say hello.  After some questions and conversation, I was walked down to the office of the Dean of Academic Affairs to meet and talk with him.  The Dean had several additional questions about skills and fit in an academic library.  Total time in interview was an hour.  Was asked to provide missing application data by email in follow up.\nOffered a second interview.  Have not had second interview yet, will update review when that is completed.", "Interview Questions": "Describe your previous library experience."}, {"date": "24 Sept 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "Pretty tedious but easy. Asked a lot about past experience with other jobs. Very informative and descriptive questions. Assessment was a bit long but nothing strenuous. Over all quick and well", "Interview Questions": "Can you tell us your experience with young adults"}, {"date": "10 Dec 2020", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "They nailed you on past experience and what you know about projects as well as how to coordinate with others and their ideas. I would say definitely read description of job", "Interview Questions": "What can you  bring to the table"}, {"date": "10 Dec 2020", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keiser University (Orlando, FL) in Dec 2020", "Interview Descriptions": "called the same day as my application though Indeed and set up an interview the coming week.  Very quick response and very accommodating to work with my schedule for the group interview.", "Interview Questions": "interview is still pending for the following week"}, {"date": "25 Sept 2019", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Keiser University", "Interview Descriptions": "I don't remember the interview it was so long ago. all I remember is being walking in this lady who wore a dress that was way too tight kept looking at her phone barely looked at my resume told me that I will be changing lies and helping people but in reality I was just making a thousand phone calls a day to people who do not want to be bothered.", "Interview Questions": "Why Keiser? "}, {"date": "6 May 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "Called to come in the following week for a interview in person.  Got an offer immediately. \r\nVery good communication and location. Great Management. No problem with salary request. Definitely Worth it.", "Interview Questions": "Background, Why this Company, Greatest Strength "}, {"date": "6 May 2019", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Keiser University (Orlando, FL)", "Interview Descriptions": "They started with a \"group interview\" which was really an information session where hty laid out the requirements of the position. There was time for a few questions and brief introductions, but nothing in-depth. It was based on these brief impressions that the hiring staff determined whether to call for a second interview. I received the call for the follow-up, but when I informed them that their specified meeting time wouldn't coincide with my current work schedule ('m an adjunct professor), they refused to reschedule for a later time (same day) and simply said they'd put my resume to the side. Even after informing them that my class was in the midst of final preparation they did not make any effort to accomodate.", "Interview Questions": "Tell us a little about yourself. Why do you feel you're right for this position?"}, {"date": "13 Feb 2019", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Keiser University (Miami, FL)", "Interview Descriptions": "The interview was quick easy. it was an average 20 minutes. The questions were straight forward. The group interview was easy everyone introducing themselves and each person answering any question given to the whole group.", "Interview Questions": "What do you think the job entails? "}], [{"date": "2 Jun 2019", "title": "Librarian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Keiser University (Lakeland, FL) in Dec 2018", "Interview Descriptions": "Submitted resume.  Was told had not and would need to submit both resume and completed application with same information as is on resume.  Wondered how I could be contacted if as was insisted to me that I didn't submit a resume; found this confusing.  Still complied with request to submit all, then weeks to months later got contacted for in person interview.  Interview turns into group interview; surprise!  Asked to prepare presentation.  Perform presentation among fellow candidates who score you per a rubric.  Told how grateful interviewer was we all showed, for us to appreciate we made it to this step and we would definitely hear one way or other if we would then come to another interview with other college faculty  and staff.  Never got closure call, email nor text; no communication.   Sadly astonishing to hear applicants currently working in the field wanting this position with no idea what the pay would be (better or worse than current position) and they 'flew in' yes took flights for this 'chance' to be called back for next round and our group was not the only group to be interviewed.  At the conclusion of this in person fellow applicant screened interview  the interviewer announced  Skype interview might be possible for next stage if chosen to participate.", "Interview Questions": "What is your background and why do you want this position, feel you're a good fit?"}, {"date": "1 Dec 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University (West Palm Beach, FL) in Nov 2018", "Interview Descriptions": "Flagship Campus in West Palm Beach - Scheduled interview, then sent a personality assessment. The first in-person interview included three interviewees and two interviewers..\r\n\r\nThree interviewees including me were brought into a conference room and were asked to complete a reference check form that was collected at the end of the meeting by one of the interviewers.\r\n\r\nIn my professional opinion, that form should be given to an interviewee to complete after an offer is generated, with a stipulation that the offer is contingent upon a background check. Let it be known, that this form could create a hiring bias against age and other factors.\r\n\r\nAll three candidates were interviewed together. We all had the opportunity to ask questions first.  The interviewers asked some of the standard interview questions such as:\r\n\r\nTell us about you.\r\nWhat is your greatest accomplishment?\r\nWhat do you think will be the most challenging part of the position for you?\r\nWhy do you want to be an Admissions Counselor?\r\n\r\nAnd .... If  you could be any animal what would it be and why? \r\n\r\nIt felt like we were contestants on a game show since all of us answered and heard the answers of each other.\r\n\r\nThe interviewers explained at the end that we would hear in a few days who would be asked back for one to one interviews.\r\n\r\nUnfortunately, or maybe, fortunately, I called one of the interviewers at the end of the week, and within 1 hour of my received call, I received my email that they hired someone else.\r\n\r\nNow I ask, was it my age, background, answers to the questions, my personality assessment?  The hardest part is not learning the legal reason why.", "Interview Questions": "See above"}, {"date": "9 Nov 2018", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keiser University (West Palm Beach, FL) in Nov 2018", "Interview Descriptions": "Phone interview first to see if you are a good fit, The in person interview where you will make a presentation to other faculty and answer questions. They will choose topic.", "Interview Questions": "How do you handle difficult students?"}, {"date": "21 Feb 2019", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Keiser University in Nov 2018", "Interview Descriptions": "I received an email for a preliminary phone interview in November 2018 for a job I applied for several months earlier. While the title of the job I applied for was Social Media Specialist, she told me it'd be a mix of communications, public relations, media relations and crisis communications.  Phone interview lasted less than 30 minutes; she spent a good part of the beginning explaining the position.  She asked me about my background and current work. Afterward, she said we'd be in touch. Now in Jan/Feb 2019, I see similar job positions (like the one I applied for) posted on job sites so suffice it to say, I didn't get it.  Never heard back from her.  It would be nice to get an email instead of waiting for a reply back.", "Interview Questions": "What are your thoughts about our (Keiser) social media/ what can we do to improve?"}, {"date": "21 Sept 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Keiser University (Pembroke Pines, FL) in Sept 2018", "Interview Descriptions": "This interview took place at the Pembroke Pines location. When they call to set an appointment for an interview they do not even send you a confirmation email which is a red flag. When you arrive, you are interviewed in a group which is disrespectful to college degree holders. If a company does not respect you enough to interview you individually don't even waste your time. After the group interview, I was sent an email requesting to do a bogus personality assessment, I took it and that was the end of that. I never heard from Keiser again which is unprofessional and rude. The job itself is definitely telemarketing. I would say that I dodged a bullet.", "Interview Questions": "Tell me about yourself "}, {"date": "27 Sept 2018", "title": "Community Relations Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Keiser University (Fort Myers, FL) in Sept 2018", "Interview Descriptions": "I applied online and was called the next week for an interview the following week. I was not told that this would be a group interview. They had about 12 candidates talk in front of the group and introduce themselves, their background, and why they want the position.", "Interview Questions": "Where did you go to college?"}, {"date": "13 Jun 2018", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Keiser University (Orlando, FL) in May 2018", "Interview Descriptions": "Good interview process. If you have experience and do not need a lot of training, act like you do. They seem extremely nice but run like the wind. Seriously: run.", "Interview Questions": "Is the salary acceptable?"}, {"date": "25 Mar 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Keiser University (Sarasota, FL) in Mar 2018", "Interview Descriptions": "After submitting my application, I was contacted within a few days and asked to come for an on-campus interview. I live 8 hours from the location, but was asked to come in personally the next week. I traveled for the interview, which itself consisted of a panel interview with 3 people, 2 admissions counselors and a department head, and a 1 on 1 with the campus president. The interview itself went well, but I was emailed their rejection less than 2 hours after I had left the building. It was extremely unprofessional to ask me to drive 500 miles and not give me even an entire day's consideration.", "Interview Questions": "How could you relate to the demographic of learners at Kesier as most are in their late 30's and early 40's?"}, {"date": "19 Mar 2018", "title": "Psychology Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Keiser University (Tampa, FL) in Mar 2018", "Interview Descriptions": "Test teach for faculty and staff. 15 minute maximum. Then answer random questions about teaching and student behavior from administrators, faculty, and staff. Prior to interview candidates are sent a form that describes what is expected in the test teach.", "Interview Questions": "Teaching Philosophy"}, {"date": "22 Jan 2018", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Keiser University (Lakeland, FL)", "Interview Descriptions": "Group Interview :  with one 1 interviewer and 7  interviewees in the room.   \r\nStarted promptly on time.  Be prepared with loads of information about the University upon arrival.  Questions were given to everyone and you were just asked to raise your hand to answer.", "Interview Questions": "Q.  What do you know about Keiser"}], [{"date": "6 Mar 2019", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Keiser University in Nov 2017", "Interview Descriptions": "Have an interview with the Director of Admissions. If they like you, you will interview with the President of the campus. She does not like anyone. Also you have to take an IQ test. If your not close, they will dismiss you.", "Interview Questions": "What were my goals in life. "}, {"date": "16 Nov 2017", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Keiser University (Lakeland, FL) in Nov 2017", "Interview Descriptions": "First interview was a group one that last about 45 minutes with a 5 minute break 30 minutes in after the brief of the position and info about the University. After the 5 minutes, if anyone thought the position was not what they expected, they could leave. \r\n\r\nSecond interview was a one on one with the DOA. Honestly, it was too quick of an interview and it seemed like the DOA didn't take the time to even look at my resume as the person was late to begin with.", "Interview Questions": "If you were offered the position, what could you bring to the position?"}, {"date": "8 Oct 2017", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University", "Interview Descriptions": "The interview process was long and drawn out with  4 interviews over a month and a half.  There was 1 telephone interview, and 3 in person interviews.  There were no background checks for this position, and the on boarding process was unremarkable.", "Interview Questions": "N/A"}, {"date": "3 Oct 2017", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Keiser University", "Interview Descriptions": "In a group interview, she discussed the entire job in detail.  Then told us we could leave if we didnt think that we were right for the job, then she asked us a few questions and we could respond if we wanted to.", "Interview Questions": "What would be the most frustrating part of this job for you?"}, {"date": "16 Jul 2017", "title": "Community Relations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (Miami, FL)", "Interview Descriptions": "-Panel style interview, with Keiser University staff taking turns asking questions.  \r\n-Candidates are interviewed in a small group, with other potential candidates = you can see exactly who / what you are up against.\r\n-Interview for the CRC position requires a 10 minute presentation.\r\n-The interview process takes time so be patient.  I went through  a total of 6 interviews.\r\n-Everyone from Keiser  was open, honest, and seemed to truly enjoy their jobs.  Everyone was more than willing to answer my questions as well.", "Interview Questions": "-All questions were very straight forward. \r\n-A lot of situational style questions.  \r\n-A lot of questions that warranted a personal response as compared to questions where  they were looking that \"one right response\" only.\r\n-Comfortable and inviting atmosphere.  "}, {"date": "6 Jul 2017", "title": "Dean Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Keiser University", "Interview Descriptions": "Process was scripted. Interview lasted at most 15 minutes. Questions not related to actual knowledge, skills and abilities of position.  Almost like, we are simply going through the motions. No real sharing of information regarding position requirements other than it required on average of 50 hours per week.", "Interview Questions": "What is your relationship with other staff and faculty?"}, {"date": "10 Aug 2017", "title": "Community Relations Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Keiser University (Jacksonville, FL) in Jul 2017", "Interview Descriptions": "The initial interview is a group interview, and then they call back from that for a second interview  where they ask the same questions over again. My group had five interviewers and five interviewees. what made it difficult was that there was a high amounts  what made it difficult was that there was a high amounts of interviewees of interviewees, and interviewers seem to come in and out during the interview. I spent about two hours in this interview.", "Interview Questions": "What is your background?"}, {"date": "23 May 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Keiser University", "Interview Descriptions": "Typical group interview process; very informative about the college history and the career itself; the manager's true personality shone through at the interview process - and it was a good, relaxing personality", "Interview Questions": "What is one of your flaws?"}, {"date": "5 Apr 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Keiser University", "Interview Descriptions": "HR sent an email to complete a personality test.  Director of Admissions called me in for an In person interview.  Met with DOA, and the associate director.   Job was offered after.", "Interview Questions": "N/A"}, {"date": "8 Feb 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Keiser University", "Interview Descriptions": "I actually interviewed for a different position and was recommended for this one instead based off of a personality assessment: it wound up being a good call, a much better fit, & better pay.\n\nPersonality assessment filled out online first: answer based on the job you want, not the job you have, but still true to what you would actually do.\n\nThen 3 interviews: 1 with Director first (you also meet the assistant directors same day), 1 with Campus President, and 1 phone interview with Vice Chancellor\n\nDirector and assistant directors very up front about  challenges, benefits/salary, and answering any questions I had. I felt like there could have been more mention about how it can feel like a call center some days, but I knew that going in because of the reviews on Glassdoor. The interviews with upper management set tone for company culture, expectations, and plan for growth to make sure I'd be a right fit. The management believes in what they do and how they can change lives: I left every interview feeling like I really wanted to work for this company because of that.", "Interview Questions": "Tell me about a time you had to influence someone in making a decision."}], [{"date": "22 Feb 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Keiser University (Saint Petersburg, FL) in Feb 2017", "Interview Descriptions": "I was e-mailed an online personality assessment before being asked to interview. The process started with a group interview including three other people, and it lasted about one and a half hours. This was followed by one-on-one interview with the admissions director also lasting one and a half hours. Next came a meeting with Campus President and the quality of questions improved significantly. Finally, a phone conference with the regional admissions coordinator.", "Interview Questions": "Describe how you have impacted someone's life\r\nWhere do you see yourself in ten years?\r\nWhy would you be good at this job?\r\nWhat previous sales experience do you have?"}, {"date": "1 Aug 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (West Palm Beach, FL) in Jan 2017", "Interview Descriptions": "First round was by phone. \r\nSecond round was on campus. On campus, you met with the president and vice president then gave a presentation to a panel. Straight forward process.", "Interview Questions": "Tell us about your background and why you want to work for Keiser. "}, {"date": "12 Nov 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keiser University", "Interview Descriptions": "I applied for an adjunct position and ended up being hired full-time, which is great. For most of us in academia, it is hard to get a stable salary and recognition. The interview went very well and so did the mock teach. It took over a month, however, to hear back about my credentials to teach in my discipline. The salary was the hardest part because I couldn't get any answers about range or anything, so I incidentally valued myself too low based on my history and the salary averages that I found online.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "30 Dec 2016", "title": "Admission Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University (Fort Lauderdale, FL) in Nov 2016", "Interview Descriptions": "Called you tell you to come in  you interview with one Asst \r\nDir very concerned about the idea of making 100 plus phone calls a day they ask you about work schedule weekends and evenings never spoke about salary the whole interview was about 20!min  then asked me to take a personality test weeks past they \r\nNever call back \r\nVery bad communication", "Interview Questions": "Do you have a problem making up to 100 phone calls a day"}, {"date": "22 Sept 2016", "title": "Nursing Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Keiser University", "Interview Descriptions": "Teaching presentation where you gave lecture for 15 minutes and panel interview that included deans, registrar and faculty.  Each person rated you as you presented.  Questions were focused on class structure and nontraditional setup at the University.", "Interview Questions": "What is your most important accomplishment?"}, {"date": "8 Sept 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Keiser University (Jacksonville, FL) in Aug 2016", "Interview Descriptions": "first interview was a group interview. About 10 applicants, 3 or 4 interviewers. Each interviewer asked a question, and one by one the applicants gave their answers. An interesting thing was after a short description of some of the features of the job (the unattractive stuff, like making lots of phone calls, working 2 evenings/week, using technology to do the job, and there being \"expectations\" that counselors are expected to meet, the interviewers left the room for a few minutes so that anyone who didn't like the sound of these aspects could leave if they wanted to.).", "Interview Questions": "Describe a time when you had a conflict with a supervisor, and how you handled it. \r\nCan you sum up your philosophy of education?\r\ndescribe a significant personal challenge and how you overcame it."}, {"date": "10 Jul 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University (Daytona Beach, FL)", "Interview Descriptions": "Took a long time. Had one group interview and then three more interviews: one with director, one with campus president, and one with vice chancellor, or whatever his title is. The guy is a real character. Tries to psychoanalyze everyone.", "Interview Questions": "Why are you here? Why admissions? How do you feel about making 100 phone calls per day? How do you feel about meeting enrollment numbers? I also had to take an aptitude test."}, {"date": "27 Mar 2019", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Keiser University (Orlando, FL) in Jul 2016", "Interview Descriptions": "Began with a brief phone interview. Was then invited to complete a group interview with the assistant directors of admissions. After this, I was invited to have a one on 1 interview with the director of admissions followed by a one on one interview with the campus president", "Interview Questions": "Why do you think that you would be the best candidate for this position"}, {"date": "25 Jun 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keiser University", "Interview Descriptions": "Easy, they are desperate for new hires. All you need is a degree and pass personality test. Phone screening first, in face with two other people. Call the next day, background check and verified graduation date completed. Call and gave you a start date. Interview questions are call center related, easy.", "Interview Questions": "Easy, they don't care, desperate for new hires"}, {"date": "20 Apr 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (Sarasota, FL) in Apr 2016", "Interview Descriptions": "It has been very long and tedious. It's three separate interviews:  group, one-on-one, then one-on-one with President and director. You would think you were getting ready to protect the president!", "Interview Questions": "why would you be good for this job?"}], [{"date": "10 Jun 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Keiser University (Sarasota, FL) in Apr 2016", "Interview Descriptions": "Applied online. Interview with DOA was excellent impressed with my 15 years of experience and wanted me to meet the president.  I was misled and received email \"we have decided to move on with another candidate that we feel is more qualified.\" Unbelievable. I was a top-producer. It's truly their loss.", "Interview Questions": "Why did I leave my previous position?"}, {"date": "25 Mar 2016", "title": "Business Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keiser University (Miami, FL) in Mar 2016", "Interview Descriptions": "The interviewer was very direct with the questions but polite and pleasant. The interview lasted about 30 minutos prior to a presentation that I did in front of a group of professors. After the presentation, the interview continued for about 15 minutes, always with good and respectful manners.", "Interview Questions": "Tell me your strengh and your weakness"}, {"date": "3 Jan 2016", "title": "Faculty/Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Keiser University", "Interview Descriptions": "I applied online. Got a call 1-2 days later. Had a phone interview with Dean. About a week later had a Skype interview, in which I had to do a teaching demonstration.", "Interview Questions": "Basic interview questions were asked."}, {"date": "14 Mar 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Keiser University (Orlando, FL) in Jan 2016", "Interview Descriptions": "Day 1 (Wed): Telephone contact; day 2 (Th): interview and demonstration; day 3 (Fr) hired; day 6 (Mon) Start teaching. The whole process was a last minute, rushed affair. Did not receive a copy of the textbook for the first quarter of the class and instruction on the computer system was wholly inadequate and, in fact, wrong in several key areas.", "Interview Questions": "What experience do you have?"}, {"date": "21 Jul 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keiser University (Fort Lauderdale, FL) in Jan 2016", "Interview Descriptions": "First there was a phone interview. Then I scheduled a day to come in. I was interviewed by three people in one day and was hired on the spot. I was inteviewed by the person who is in carge of the hiring and training, an assoicate director, and the director of admissions.", "Interview Questions": "Tell me a little bit about yourself?"}, {"date": "10 Aug 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University in Nov 2015", "Interview Descriptions": "The turnover rate is so high that they are desperate for new hires.  The deception about the job is incredible.   This is not an Admissions counselor position - it is a telemarketing scam.", "Interview Questions": "How do you handle rejection."}, {"date": "4 Apr 2016", "title": "Student Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Keiser University (Fort Myers, FL) in Aug 2015", "Interview Descriptions": "it was a well organized setting  with lots of questions and more than one person in each set of interviews. the team was professional and made a great atmosphere for what could have been a job opportunity. the first interview was by phone, and the second interview was on the campus with president and human resources personal with other members to of the campus.", "Interview Questions": "How did you prepare for the interview?"}, {"date": "24 May 2019", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Keiser University (Tallahassee, FL) in Jun 2015", "Interview Descriptions": "I was asked to come for an interview. When I arrived, there were around 20 other people in the room, none of whom, including myself, had been informed that it was a group interview. Rather than going with my first instinct to walk out, I decided to stay and see what it would be like. It started out with the interviewer arriving around 20 minutes late. She then asked a few awkward questions of the group (who's happy with their current salary) and everyone raised their hands...which I did reluctantly but honestly I was making over 60k currently but my position was ending which was why I was applying for this 30k job.  She also made a comment about how she was impressed that this group was dressed professionally and I lot of the groups she saw were not (I did feel bad for one guy wearing flip flops there). Anyways, she then explained that summers were blackout days that you absolutely couldn't take off and had to work long hours, but the job was awesome, yada yada. Then each of us had to come to the front of the room to talk about ourselves so we could be evaluated by the rest of the group on whether we would be a good fit for the job. After everyone was done, we had to raise our hands on who should be hired and the person with the most hands raised won (note that this didn't actually get them the job). The interviewer said it was very important to be liked by your peers and that the next stage of the process was to meet the people you would be working with and they would evaluate. Anyways, the \"interview\" ended by saying that we would all get a follow-up phone call for the next stage to interview with the other employees.  Obviously, I turned down the next round when I got the follow-up call.", "Interview Questions": "Tell us about yourself and why you would be a good fit for this job (in a presentation/stand in front of the room format without powerpoint slides)."}, {"date": "18 Oct 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Keiser University (Pembroke Pines, FL) in Apr 2015", "Interview Descriptions": "You need to do 5 interviews before starting. The make you tons of questions, Need to interviewwith the campus president, managmente, chancellors, supervisors. They make you a lot of questions reslate to the position and you even role play a lot during the process to see if you can handdle the pressure", "Interview Questions": "How do you see yourself in 10 years?"}, {"date": "20 May 2016", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Keiser University (Fort Lauderdale, FL) in Mar 2015", "Interview Descriptions": "The admissions department associate director called to inform me that I might be better suited for a different position.  She described both and ask me a few questions about me.  After I accepted the option to interview for the new position she emailed me a link for a personality test.  I was able to complete this the same day.  The same woman called back the same day to schedule an interview for the next day.  We sat alone in a conference room.  The interviewer and I really hit it off and many of her questions were answered without having to ask them.  The interviewer gave me an employee background form and went to get the second interviewer.  The second interviewer was also an Associate Director however he had been with the company much longer.  He ask very standard questions.  At the end of this 2 hour interview I was told that I would hear from them soon.  Two days later I received a call for an interview with the Director the next week.  When I showed for this interview the director talked with me a little about my resume and my experience and offered me a position.  The position called for me to work every weekend either Saturday or Sunday and I felt this compromised my family time so I declined the offer.", "Interview Questions": "What do I do to release stress?"}], [{"date": "27 Jan 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Keiser University", "Interview Descriptions": "Have a prepared lecture presentation and be relatable in the classroom. Be interactive and demonstrate classroom skills by asking questions and posing scenarios that are focused on the job environment. Students require consistent motivation and energy. Make certain you can handle students and keep their attention. Guiding students is key.", "Interview Questions": "Be prepared to handle student conflicts and have reasoned answers from tangible expreiences."}, {"date": "4 Jan 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Keiser University (Fort Lauderdale, FL) in Dec 2014", "Interview Descriptions": "The interviewer was really friendly. I came in she told me a bit about herself and her role there then asked me about my self then from there asked where I see my self in a few years, my experience in working in education, as well as the typical situational questions that is asked at every interview", "Interview Questions": "Tell me a time when you had to difficult customer/client, and how did you deal with the situation"}, {"date": "14 Nov 2015", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (Melbourne, FL) in Oct 2014", "Interview Descriptions": "Interviewed by Admissions Director, who downplayed sales aspect of position. Indication was that I'd be working with students in a face-to-face environment rather than a cubicle within a phone bank.", "Interview Questions": "Have you ever worked from a script?"}, {"date": "31 Jul 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Keiser University", "Interview Descriptions": "I was initially contacted by a receptionist for an information session which I was unable to attend. They were not flexible in scheduling me any other time. I was then contacted by the DOA for a personalized interview weeks later. The interview took over two hours as they were in the middle of starting a term and she had to deal with issues happening on campus as they come. She only asked me about my career aspirations and then described the job to me. A week later I was contacted for a phone interview. Another week later I was contacted for another on campus interview. A week later I was told I got the job, and I was scheduled to start 3 weeks from that day.", "Interview Questions": "Tell me about a time you were stubborn and what it was you were stubborn about."}, {"date": "7 Jun 2015", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Keiser University (Tampa, FL) in Jul 2014", "Interview Descriptions": "I applied online and then received a call for an information session which was basically a group interview. When I got there I waited at the lobby with 4 other candidates. Then the Admissions Director came out and escorted us to an empty classroom for the 1-hour interview. She started by introducing herself and telling us about the company, and detailed all of the job openings. This was great because it gives you a chance to learn about your prospect without having to research it and helps you decide if it's right for you. She then asked all the candidates 2 questions: \"Why do you think you are the best candidate for the job?\" and \"What are your strengths and weaknesses?\" All the candidates were there for different positions but had to answer the same questions. Then after we answered the questions she wanted us to choose someone else in the room who should get hired based on their answers. That was very awkward. Before leaving we were asked to leave our resumes on the desk if we were still interested in the job so they can screen us and call us back for a second interview. \r\n\r\nA couple of days later I received a call for a one-on-one interview with the same interviewer. At this interview they try to really get to know you as a person and how you would handle the position. They're looking for people with experience and who can handle rude calls by phone. You go in thinking they'll want a receptionist who is understanding and graceful but you'll later learn what they really want is someone who is aggressive and who can tell people off when they're busy, which I find very odd. This interview was about 15 minutes long, and you don't have to leave wondering how you did or if you got the job because they'll tell you that after.", "Interview Questions": "Tell me about your favorite and least favorite manager and why."}, {"date": "1 Jul 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (Miami, FL)", "Interview Descriptions": "management is very detached from the reality of today's challenges.  campus president makes all the calls and listens to no one.  has an arrogant personality and demeaning approach towards others.", "Interview Questions": "the questions all focused on my ability to deal with their system and stay......that was my clue on what to expect."}, {"date": "31 Mar 2014", "title": "Instructor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "(1) Resume, cover letter, transcripts, and teaching philosophy (optional); (2) telephone interview; (3) in-person interview; and (4) test teach.", "Interview Questions": "What is your teaching style?"}, {"date": "14 May 2015", "title": "Community Relations Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keiser University (Miami, FL) in Feb 2014", "Interview Descriptions": "There were 4 separate interviews after an open group information session for the position. You had to be selected back after the open interview. The whole process was  lengthy and time consuming. First interview with admissions director. Second interview with chancellor of high school program.  Third interview with campus president.  Last interview was a presentation I was required to create and present discussing the similarities and differences of private,  public,  for profit and not for profit educational systems.", "Interview Questions": "Professional background? "}, {"date": "11 Jan 2014", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Keiser University", "Interview Descriptions": "Hiring process begins with online application.  If chosen, an interview will be scheduled with the Dean of Academics.  Following, you may or may not be asked to give a demonstration of your teaching abilities - often scheduled for another day.  This is evaluated on basic teaching principles and structure - beginning, middle, and end.  Though content is important, your delivery method is what is being evaluated.", "Interview Questions": "Not really unexpected but scenario-based questions.  I.e., explain at time when your had a difficult student.  How did you respond.  etc."}, {"date": "6 May 2015", "title": "High School Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Keiser University (Jacksonville, FL) in Dec 2013", "Interview Descriptions": "Panel interview. I was brought into a room. Asked questions. Nothing was hard or surprising. It was a long time ago, so I don't remember specific questions. We laughed and joked a lot. They told me about the atmosphere and how I felt about call centers and that type of atmosphere.", "Interview Questions": "Is the cup half full or half empty?"}], [{"date": "10 Dec 2013", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Keiser University (Sarasota, FL) in Aug 2013", "Interview Descriptions": "They ran an ad in the local newspaper for an Admissions Counselor.  They requested a resume and cover letter to be sent via email.  I emailed my resume and cover letter and was contacted by the office (not the person listed in the ad) to come in for what sounded like a group interview.  A group interview is really tacky and it was a complete turn off.  Why do they bother to ask applicants to take the time to write a cover letter when their intent is to just have a cattle call interview?", "Interview Questions": "I didn't go to the cattle call interview.  "}, {"date": "11 May 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University in Aug 2013", "Interview Descriptions": "Did a brief phone interview and got invited to a group interview. Got call to come in for a face to face interview, which lasted 30 -40 minutes. After the interview, I was told I would hear back from management on the next step in the process. I got the initial call for a background check and afterward, I got the job offer along with start date.", "Interview Questions": "Tell me about yourself "}, {"date": "21 Nov 2016", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (Miami, FL) in Aug 2013", "Interview Descriptions": "Had 3 interviews in 2 days\r\nI had a group information Session and immediately after I was interviewed by the ADOA when i finished the interview she invited me to come back the next day to interview with the DOA . I interviewed with the DOA on the following day and at the end of that interview he asked me to return and interview with the Campus President the same day. I returned interviewed with the Campus President and I got a job offer the minute my background came in which took about 2 days.", "Interview Questions": "Why Keiser University"}, {"date": "31 May 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Keiser University", "Interview Descriptions": "very professional", "Interview Questions": "reason you want this job"}, {"date": "21 Jul 2016", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Keiser University (Miami, FL) in Feb 2013", "Interview Descriptions": "I was interviewed by the campus president  and program director. I was required to present a class to a group. It was simple since I presented on topics where I had expertise  then again interviewed by the dean of academics", "Interview Questions": "teaching experience"}, {"date": "5 Nov 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Keiser University (Fort Lauderdale, FL) in Feb 2013", "Interview Descriptions": "The interview process was a bit longer for me because they hired a group of us and they took a while to verify everyone's background. However the hiring manager get me updated via email and phone.", "Interview Questions": "Why do  you want to work as an admission counselor"}, {"date": "10 Feb 2014", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Keiser University (Tallahassee, FL) in Jan 2013", "Interview Descriptions": "Blundering at best.  Three months to complete the process. They weren't sure what job they were going to offer me.  No training at all from management.  Their management is totally untrained as well.", "Interview Questions": "There wasn't a difficult question. "}, {"date": "11 Jul 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (Lakeland, FL) in Jan 2013", "Interview Descriptions": "Group Information session followed by 3 other one on one interviews with the DOA, Associate Vice Chancellor and Campus President. They were all pretty lengthy interviews with the same questions. Nothing was hard to answer. It was more like an awkward conversation. Only one interviewer looked me in the eyes and spoke to me. The other's wrote down everything I said.", "Interview Questions": "Why do you think education is so important"}, {"date": "17 Aug 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Keiser University (Fort Lauderdale, FL)", "Interview Descriptions": "1st interview director of admissions second interview with the campus president, then received a call later that afternoon with an offer.", "Interview Questions": "None."}, {"date": "7 Aug 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Keiser University (Miami, FL) in Jul 2012", "Interview Descriptions": "Applied online through their website and was contacted a couple of days later for a \"group information session\".  We were about 10 applicants and spent an hour listening to the Associate Director of Admissions tell us about Keiser and about the position.  I thought this was a great way to find out details about their expectation.  After we introduced ourselves, he asked us to leave our resume on the desk before leaving if we were interested in continuing with the application process.  He would then screen out who was qualified and call us for a 2nd interview.", "Interview Questions": "\" who can tell me about Keiser University\"\r\n"}], [{"date": "31 Oct 2011", "title": "Community Relations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Keiser University (Lakeland, FL) in Oct 2011", "Interview Descriptions": "After completing the application process online, I received a phone call approximately two days later scheduling an interview.  The interview consisted of an informational session which lasted about forty minutes and a short break was taken.  After the break, everyone that desired to remain in the selection process returned from the break and all others departed.  The next step in the process required each candidate to describe in detail why you are the best candidate for the position and if you are not hired what are your plans.  Each candidate was asked to answer the questions in the presence of all the other candidates.  This was very uncomfortable.   The interviewers stated that some candidates will be invited back to complete a presentation. \r\n\r\nThe interviewers were very nice and informative.  The school personnel appeared to be very professional and courteous.", "Interview Questions": "Why do you think you are the best candidate for the job?"}, {"date": "16 Oct 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Keiser University in Oct 2011", "Interview Descriptions": "interview process was laid back and hiring and training took about a week.  Training was more fun than the actual job, so it was somewhat of a disappointment.", "Interview Questions": "Have you ever worked in a call center environment? "}, {"date": "11 Oct 2014", "title": "Student Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Keiser University (Fort Lauderdale, FL) in Sept 2011", "Interview Descriptions": "Just be very upbeat during the interview and score well on the behavior assessment. The lady asked me a couple of questions but also did a lot of talking. She was selling the company so much until I started to tune her out.", "Interview Questions": "N/A"}, {"date": "29 Jun 2015", "title": "College Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Keiser University (Fort Lauderdale, FL) in Jun 2011", "Interview Descriptions": "Phone call and BRIEF interview with Associate Dean.      I submitted / handed over a resume, shook hands with the Associate Dean in the Lobby and that was it.", "Interview Questions": "Literally....when can you start?"}, {"date": "18 Sept 2015", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keiser University (Fort Lauderdale, FL) in Apr 2011", "Interview Descriptions": "Met with Program Director, followed by dean and Campus president. Meet with the faculty as well. Got to observe a classroom and see how the classes are organized. The initial interview was a phone conversation, then I was invited to the campus where I met with the PD, faculty, dean and campus president. I also had to do a teaching demo to show proficiency in subject matter and how I handle the class. Hands on activity is a must and must show ability to manage a class without any distractions.", "Interview Questions": "How do you handle conflicts?"}, {"date": "14 Jun 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Keiser University (Fort Lauderdale, FL) in Jan 2011", "Interview Descriptions": "Received a call for a group interview. I was asked three questions, one \"Why do I want the job?\" in the group interview. They are looking for people who listen well and are able to communicate. \r\n\r\nReceived a call the next day for a one on one interview. \r\n\r\nTwo days later received an offer for a two week training class.", "Interview Questions": "Why are you interested in this position?"}, {"date": "6 Feb 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Keiser University (Pembroke Pines, FL) in Mar 2010", "Interview Descriptions": "The interviewing process is composed of 4 interviews, 3 of them being face to face. They have perfected the interviewing process and made it very comfortable to answer questions without feeling like one is \"under the gun\".", "Interview Questions": "The campus president wanted to know which area in the previous city I lived in. And wanted to talk about that as it was a foreign country."}]]