[[{"date": "27 Jun 2023", "title": "International Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Series of 3 interviews with all levels of the team from Operational Support to Directors. Repetitive series of common interview questions at every interval assessing soft skills, conflict management, and cultural fit. After 3 interviews I was ghosted and never provided with an update, feedback, or proper rejection of my candidacy. Ghosting a candidate after a month of interviews is particularly unprofessional and my guess, is indicative of a less than agreeable team to work with.", "Interview Questions": "Why Mass General? Tell us about a time you had a conflict with a coworker. How comfortable are you with Outlook?"}, {"date": "29 Jun 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Salem, MA) in Jun 2023", "Interview Descriptions": "Worked as travel RN for a year previously. Applied for ICU position. Quick and easy. Talked with HR at first. Offered job on the spot. HR stated if job acceptance, the floor manager will calk to give information about the floor.", "Interview Questions": "Why do you want to work in ICU?"}, {"date": "15 May 2023", "title": "Admin Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Easy interview. I was asked typical interview questions, why do you want to work here, difficult client you handled, conflict resolution examples, describe someone you admire, and why, what your salaey requirements are.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Apr 2023", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Interviewer introduced herself. Interviewer gave brief history of MGH. Interviewer began to ask professional and direct questions. The first question was, Tell us about yourself. This, of course, being the very meat of the matter, so, I spent the next 10 minutes enumerating my past work history.", "Interview Questions": "Tell us about you Why do you want to leave your current job? What can you do for us that others cannot? Do you have any questions for us?"}, {"date": "7 Apr 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Applied online, received a phone screen request a few days later. After the screen, was asked to do a Zoom interview with managers. Requested references a few hours after the interview, and within two weeks had an offer. The recruiters were in contact with me the entire time and were very responsive. Overall a really quick and easy process!", "Interview Questions": "Why are you leaving current job?"}, {"date": "20 Apr 2023", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2023", "Interview Descriptions": "First they emailed and sent out options to schedule a phone call. They accommodated as I had no phone access and we did a Zoom call. From there, simple, they provided information on positions available and where might be a good fit and passed my resume off to those departments.", "Interview Questions": "Name three strengths that may help you in this position."}, {"date": "21 Mar 2023", "title": "Pharmacy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Super easy, just behavioral questions. It was a co-op so through my university. The interviewer was very nice and I got my acceptance the day after. I wouldnt stress too much!", "Interview Questions": "Skills and Weaknesses Tell me about yourself Why MGH"}, {"date": "10 Mar 2023", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was straightforward and informative. Was able to meet the team and discuss the responsibilities and expectations within the role. Communicated effectively and gave clear and concise answers to my questions. (multiple rounds)", "Interview Questions": "Under what circumstances have I worked with people who come from a different origin or background than mine."}, {"date": "7 Apr 2023", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2023", "Interview Descriptions": "It started off with a 15-minute HR interview with very straightforward standard questions (why do you want this job? what skills and experiences do you bring to it?). Next, I had an interview with the program director (a doctor in this case) and she was so kind and really took the time to talk with me, it felt more like a conversation than an interview. Next, they asked me for references (4 total), and they each had to fill out a survey, and they all filled it out they also called of them. I haven't heard back yet, but fingered crossed that I get this one!", "Interview Questions": "Why do you want this job?"}, {"date": "21 Apr 2023", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Salem, NH) in Mar 2023", "Interview Descriptions": "The initial interview was brief. The interview was friendly and informative. I was told that I would hear back from the HR department by end of the week. Did not hear back and I had to call back and find out the status. I was not selected for the second interview. The overall process was positive and fair.", "Interview Questions": "What were my qualifications Why I wanted to work for the organization Why I applied for this position"}], [{"date": "1 Mar 2023", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital in Feb 2023", "Interview Descriptions": "Pretty laid back just questions about why i want the job as this role and in this particular department (cardio thoracic surgery). Moving onto second stage soon. First stage was two CRCs and second is the full team", "Interview Questions": "Why do you want this job? Why this department?"}, {"date": "14 Mar 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2023", "Interview Descriptions": "Virtual Call with the hiring manager that went on for 30 min. I was asked about my experience and some behavioral questions and how would i be suitable for this position,", "Interview Questions": "How will your extracurricular activities help in your job"}, {"date": "4 Dec 2022", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Had an initial interview with a current CRC and the program director. That was mostly behavioral questions and them giving more information about the position. The vibes were very lax, they seemed chill.", "Interview Questions": "Do you like working better individually or in teams and how do you approach each situation?"}, {"date": "28 Nov 2022", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "The interview process really depends on the lab/team you are applying to work for. I have interviewed for several positions and they were done differently. Number of interviews and how spaced out they are varies.", "Interview Questions": "(Basically) Tell me about yourself."}, {"date": "9 Aug 2022", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Typical interview for clinical role, RDs first round of interview then upper members of team for second round of interview. Place high value in how well you’d fit within a team in outpatient setting.", "Interview Questions": "Less clinical questions and more patient interaction/experience questions "}, {"date": "5 Aug 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Lots of interviews but generally easy, typical questions. Mostly wanted to get to know me as an employee as well as a person! Interviewed with HR, department manager, team nurses, and team CRCs", "Interview Questions": "How do your past experiences make you a good candidate for this role?"}, {"date": "5 Sept 2022", "title": "Registered Nurse - Operating Room BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2022", "Interview Descriptions": "Applied and received a call to interview about 2 weeks later. The interview was with 6 of the nurse managers in the OR and the nurse educator. Walking in was a bit intimidating, but everyone was engaged and kind. I received an email a little over three weeks later saying that HR would be contacting  the following week with next steps.  The HR represesentative was incredibly condescending and frankly rude.", "Interview Questions": "If we asked a coworker one of your biggest strengths what would they say?"}, {"date": "29 Jun 2022", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Two-part interview. The first was a phone call discussing qualifications and the second was a tour of the lab. Very thorough and the interviewer requested a list of three relevant references. Not a difficult interview if you have the qualifications.", "Interview Questions": "Tell me a bit about yourself? "}, {"date": "16 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Had a lengthy presentation, went well overall, interviewers were friendly and had good questions about my resume and projects. Overall pretty calm and manageable. Heard back within two days and took the position.", "Interview Questions": "Describe a project you've worked on that was intellectually challenging"}, {"date": "23 Nov 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2022", "Interview Descriptions": "The interview process took two steps, the first interview was with other clinical research coordinators and if you moved on past the first round the second interview was with the principal investigator.", "Interview Questions": "Describe a time that you had to take leadership"}], [{"date": "16 Jun 2022", "title": "PSCIII Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2022", "Interview Descriptions": "The interview was with both the Nurse Practitioner and staff coordinator at the Vascular Surgery unit. The interview was fairly standard and cordial. It was not incredibly difficult although standard interview questions were asked.", "Interview Questions": "Where do you see yourself in five years? "}, {"date": "6 May 2022", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "the process started with an initial phone screen with the manager of the lab (about 15 min long), then an interview with my PI (about 30 min long), and the offer came three to four weeks after initial interview with info about salary, benefits, etc.", "Interview Questions": "1. What are your future educational plans?\r\n2. How does this role fit into those plans? \r\n3. Behavioral scenario about dealing with a difficult coworker\r\n4. Any questions I have about the role"}, {"date": "28 Mar 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital in May 2022", "Interview Descriptions": "Very smooth and fast interview process. Conducted interviews virtually and was hired within a few days. The questions were very person and experience focused. Allowed me to elaborate on my answers and were very receptive to everything I had to say.", "Interview Questions": "Why are you applying for this position?"}, {"date": "28 Apr 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I was contacted for an interview about interview 2 weeks after applying, received job offer 1 week after applying, reference check and background check. The process took a long time but went relatively smoothly.  This all happened quicker than average because I was an internal applicant and already in the Mass General system as an employee", "Interview Questions": "Tell me one thing that excites you about being a new grad RN"}, {"date": "13 Apr 2022", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Applied via partners site and was invited for an interview within 5 days of applying. \r\nMet with everyone in the lab short meetings and chats mostly. Interview with the PI involved talking about past experiences and future aspirations. Some scientific knowledge was also tasted like pathways and genes of interest.", "Interview Questions": "Future plans \r\nTalk about pathway I studied \r\nGene of interest I studied "}, {"date": "18 Apr 2022", "title": "BI Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I had a first interview with Mass Gen for a short term analyst position.  The interview was promising and the recruiter was professional.  I was overwhelmingly qualified for the position.  Unfortunately they had just offered the position to someone else just an hour prior to my interview; we did the interview anyway in case that fell through but it didn't work out.", "Interview Questions": "Describe how your background is a good fit for this position."}, {"date": "26 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2022", "Interview Descriptions": "I went in for a in person shadow and interview. I got to get a feel of the floor itself and see if it would be a good fit. After I had an interview with the nurse manager of the unit.  I was asked at the end when I would potentially like to/be able to start.", "Interview Questions": "Can you give me an example of when you believe you made a difference for a patient/family?\r\n\r\nTell me what brought you to this point now, as a nurse applying for this job?\r\n"}, {"date": "25 Mar 2022", "title": "ICU RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "- discussed past experience / who I am\r\n- explained why am I leaving my current job\r\n- why did I choose nursing \r\n- what type of patients do I see at my current job", "Interview Questions": "what type of pts do you see"}, {"date": "15 Mar 2022", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Quick and efficient communication from HR; interviewer was transparent,  friendly, and asked relevant questions despite not being in the nursing field. Overall was a straight forward interview with no unexpected questions", "Interview Questions": "Conflicts with employers you worked out"}, {"date": "16 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital in Mar 2022", "Interview Descriptions": "I talked with a lab manager then the PI on the phone and then over zoom about interests and the job description. It was pretty quick calls both times. I did not end up getting the job.", "Interview Questions": "Why are you interested in the position?"}], [{"date": "29 Apr 2022", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital in Mar 2022", "Interview Descriptions": "I interviewed once with the senior/HR manager then again for a panel interview. They used a lot of standard questioning, often extremely repetitive and did not make it into a conversation. Then there was a case study that you are expected to review. After that they told me it would take a few weeks to process (which is a long time) and then 1 month later still have not received any replies to follow up emails.", "Interview Questions": "What technical skills do you have? \nWhat is your 5 year plan? \nWhy are you interested in PM in a hospital? "}, {"date": "7 Apr 2022", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital in Mar 2022", "Interview Descriptions": "Two interviews the first is with a group of current workers in this position and the second is an interview with the head of the lab I was applying for", "Interview Questions": "Experience on scientific method and availability"}, {"date": "28 Feb 2022", "title": "Patient Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was quick and easy they ask you about scenerios regarding patient safety and about your availability.  Then they put you on the schedule. Shifts are usually Thur, Fri, Sat, Sun, Mon", "Interview Questions": "What would you do in this situation? ( patient safety) "}, {"date": "24 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Contacted by HR, they set up an interview. It was very Conversational describes workplace, job roles and expectations. Job offer shortly after with benefits. Very easy process overall they are looking for nurses", "Interview Questions": "Your skills and your past job"}, {"date": "16 Feb 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very friendly and smart interviewers who asked questions about my background experience and interest in the role, as well as future career goals. Also provided very honest thoughtful responses to my questions about the job, responsibilities, and culture within the team.", "Interview Questions": "Why do you want this position?"}, {"date": "23 Feb 2022", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2022", "Interview Descriptions": "Interview process was very seamless. Primary interview involved learning more about their research projects, my background and career goals and how I would contribute to their team. Asked about different roles I have performed in my career and what was the most challenging.", "Interview Questions": "Why do you want to join this team"}, {"date": "4 Feb 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "first round interviews are quite standard. 15-30 minute phone interview with current CRC, asking you basic questions about your resume and research experience. must ask questions back to learn more about role", "Interview Questions": "why do you want this role"}, {"date": "5 Mar 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Feb 2022", "Interview Descriptions": "was very informal- did not ask much questions and called me through an unknown number, but the HR recruiter was very sweet about everything and explained the job as much as he could. when he couldn't, he set up a phone call with the nurse manager which was really sweet and professional.", "Interview Questions": "1. What days can I work? 2. Tell me about your experience"}, {"date": "24 Jan 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very laid back. Just generally wanted to get a feel for how I would fit into the unit. They asked about prior experience and what I would bring to this role.", "Interview Questions": "Why do you want to work at MGH?"}, {"date": "5 Jan 2022", "title": "PSR I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I met with the entire department and was interviewed all day. I met with all three departments that I was going to be working with. and each presented its own challenges.", "Interview Questions": "why are you the best person for the job"}], [{"date": "3 Apr 2022", "title": "Admin Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2022", "Interview Descriptions": "Easy interview with a recruiter. Got a call back a couple of days later to schedule another one. I did not take the job as I was looking for a higher pay at that time.", "Interview Questions": "Tell me about your experience."}, {"date": "29 Apr 2022", "title": "Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Jan 2022", "Interview Descriptions": "Zoom chat as starter. Said there will be contact and updates but no follow up. \r\n\r\nFirst introduce yourself, then introduce your projects. Follow up/ demo your projects. Question about previous experiences.", "Interview Questions": "Explain your resume and projects. Some BQ and reverse BQ"}, {"date": "25 Nov 2021", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Over the phone conversation followed up with a lovely zoom interview. There were several people in the zoom meeting. Everyone got to speak and ask questions. It lasted for about 30 mins. I prefer this zoom interview over any I have had in the past.", "Interview Questions": "Give me three reasons you would be a good fit for the company?"}, {"date": "24 Nov 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I got a couple of questions off the reviews on Glassdoor, used them to prepare and the interview went quite really well. The interviewers were very professional, courteous and welcoming.", "Interview Questions": "How do you manage busy Principal Investigators?"}, {"date": "29 Oct 2021", "title": "Special Events Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "One round, relatively easy. very friendly environment if a bit simplistic in work load and effort. I was remote so different than normal experience but still extremely very valuable though", "Interview Questions": "what are you strengths and weaknesses "}, {"date": "8 Oct 2021", "title": "Executive Director Area Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was pretty simple. We coordinated an interview time and the interview lasted about 40 minutes. They later contact you about getting references and work history. They were also very responsive to any questions or concerns I had about the position.", "Interview Questions": "What is something you had to take responsibility for?"}, {"date": "16 Nov 2021", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2021", "Interview Descriptions": "The initial interview is usually with other clinical research coordinators and/or the principal investigator of the particular clinical research team. I have had pretty nice people interviewing me, felt pretty welcome.", "Interview Questions": "What are your strengths and weaknesses?\nWhy are you qualified for this position?\nWhat are your plans for the future?\nProvide an overview of who you are."}, {"date": "1 Mar 2022", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2021", "Interview Descriptions": "it was a zoom interview where they asked one question each, it was very casual. They were hiring from different departments and asked if I had a preference which was uncomfortable. It was only 25 minutes.", "Interview Questions": "Tell us about yourself. How do you handle change? "}, {"date": "13 Mar 2022", "title": "CRC II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2021", "Interview Descriptions": "Fairly straight-forward and direct. No beating around the bush, expectations on what to bring to the interview (information) were given, and the hiring manager was honest with timelines on hiring and HR communication. \r\n\r\nInitial round was a phone screen, then there was a 5-hour interview portion (I believe this used to be a panel interview pre-Covid), that was several individual interviews over zoom with 15 minute breaks in between. \r\nIt was nerve-wracking but everyone was kind and direct, and questions were straightforward.", "Interview Questions": "Q: What are your previous experiences in IT?\r\n\r\nQ: Why are you interested in working in this department?"}, {"date": "11 Aug 2021", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Interview process was very seamless and easy. All parties are extremely professional! Questions are straight to the point, and not meant to trick you. Definitely prep beforehand, and do not be afraid to take a moment to think before responding.", "Interview Questions": "What would you do in a situation of conflict with another employee? "}], [{"date": "29 Jul 2021", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was a standard interview process. I first had a phone interview with one of the managers and then had in person interviews with 2 managers and the director of the team.", "Interview Questions": "How would you describe your organizational skills?"}, {"date": "25 Jun 2021", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Phone screening with appointment for in person interview following this.  Meeting with the program Director last. Interview process requested a writing sample and went relatively smoothly, I had an offer within two weeks following the interview.", "Interview Questions": "Tell me about yourself?\nTell me about a difficult situation you encountered at work and what you did to overcome this?"}, {"date": "21 Jun 2021", "title": "Clinical Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Spoke for about 15 minutes on zoom typical questions like tell me about your background and what made you want to apply for this position. Pretty standard and striaght forward", "Interview Questions": "Why do you want to work  here"}, {"date": "9 Jun 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Three separate, virtual interviews with individuals of increasing status. Took approximately 1 month in totality. Very friendly scientists. However there was a lengthy references process with quick turnaround. Was told I would hear back by HR but radio silence and difficult to get a response sometimes.", "Interview Questions": "What are your future goals? Why do you want to work in research?"}, {"date": "19 Aug 2022", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2021", "Interview Descriptions": "I was referred by a researcher from the lab. I met with the lab PI, and shared my academic and programming backgrounds. He and the lead on a project were happy with my background and gave me the position.", "Interview Questions": "I was not given any technical questions, only background questions related to programming experience."}, {"date": "1 Apr 2022", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2021", "Interview Descriptions": "The interview consisted of me giving a 45 talk, and then individual meetings with my supervisor and other members of the lab. Each person asked me similar questions about my PhD experience and my goals for my postdoc, as well as long term goals. They asked me what training I thought I needed.", "Interview Questions": "What are your specific long term career goals?"}, {"date": "22 Nov 2021", "title": "Radiology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2021", "Interview Descriptions": "It was strange on Zoom. Interviewers were pleasant and easy to speak with.  I was given an opportunity to ask question, which were answered in detail. Very quick but not lacking quality.", "Interview Questions": "Can you tell us about yourself?"}, {"date": "26 Oct 2021", "title": "Research Engineer/Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Phoenix, AZ) in Jun 2021", "Interview Descriptions": "Two interview rounds, one with the team, one with the PI. Everyone was very nice and not intimidating. You could tell that they want you to grow as a researcher.", "Interview Questions": "Project you're most proud of\nPrevious projects\nRole in a team project"}, {"date": "22 May 2021", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Was asked 11 questions, but they were not hard. The interview itself was pretty easy going and felt more like a conversation than an interrogation. She made me feel comfortable.", "Interview Questions": "What is one of your strengths and weaknesses?"}, {"date": "21 Apr 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Interview with two supervisors. It was over the phone. They asked me several questions about my approach to the therapy process. I answered and they asked clarifying questions. It was moderately stressful, but in the end not difficult.", "Interview Questions": "Describe your modality and approach to psychotherapy."}], [{"date": "8 Apr 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "First, I spoke to the outgoing coordinators, who asked me a few questions, and then I had the chance to asked them questions, Then, I spoke to the nurse practitioners who manage the coordinators.", "Interview Questions": "Describe your approach to communicating with others"}, {"date": "28 Sept 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2021", "Interview Descriptions": "First I had a phone interview with HR and we went over my resume.  Then I had the interview with the floor I applied to over zoom with the nurse manager and clinical nurse specialist.  They asked the regular interview questions (tell me about yourself, your strengths, your weaknesses, an example of how you solved conflict) and they also gave multiple hypothetical scenarios and asked what I'd do.", "Interview Questions": "There is patient A with xyz going on, patient B with xyz going on, and patient C with xyz going on.  In what order would you go to each patient and why?"}, {"date": "2 Apr 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "fairly straightforward: you submit an application, answer a few questions in person, and shadow until you are ready to volunteer. the process could take a longer time depending on when orientation meetings are available.", "Interview Questions": "why do you want to volunteer?"}, {"date": "21 Mar 2021", "title": "Critical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Was in a happy environment, interviewed with both nursing director and clinical nurse specialist. Very easy to find the unit, direct questions were asked. Interview lasted for about forty-five minutes and was conducted on the unit.", "Interview Questions": "Why do you want to work in the ICU?"}, {"date": "7 Mar 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "They email you if they see, and like, your resume. The process is very quick. The first and second interviews happen days apart. The people I spoke to were friendly and nice.", "Interview Questions": "They asked about my experience. "}, {"date": "4 Mar 2021", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was an Easy interview for a first out of college job . Met with 3 people who described the role and asked average interview  questions. Overall was a good experience.", "Interview Questions": "How do you prioritize competing tasks?"}, {"date": "2 Mar 2021", "title": "Marketing and Communications Manager, Think: Kids Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Long-drawn out process where I didn’t meet hiring manager except over the phone. Had phone interview, writing assignment and two additional rounds. Was unnecessarily long and odd to not have a video interview with the person who would be managing me. Process was 2-3 months.", "Interview Questions": "Why are you interested in this role?"}, {"date": "18 Mar 2021", "title": "Clinical Research Data Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Mar 2021", "Interview Descriptions": "Submitted my resume and got an email to set up an interview a few days later. The interview was on the phone, where I was given a brief description of the job and more info about the hospital itself. I had some questions about the job that I thought were good ones to ask but I was told they didn’t know the answer. They said that the managers would be good to ask and that speaking with them would be the next steps. That sounded very positive and I thought the interview went well and sent a thank you and a follow up. No response.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "22 Apr 2021", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Saint Louis, MO) in Mar 2021", "Interview Descriptions": "This was a two round process, they actually got back to me within a week because I told them I had another offer(which was true). They made sure to give me an answer before that deadline.", "Interview Questions": "Strengths/weaknesses, why i wanted to work there"}, {"date": "3 Feb 2021", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Was definitely intimidating. Know your stuff regarding the hospital/ the program applying for. Know the hospital message. Ask questions. Dress professional and well groomed. Have case examples ready.  It was intimidating meeting with a group of like 4 people against just yourself but everyone was nice.", "Interview Questions": "What do you like about this program "}], [{"date": "8 Jun 2023", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2021", "Interview Descriptions": "The interview process involves screening, scheduling, and conducting interviews to assess candidates' qualifications, skills, and fit for a position. It includes various stages like phone screenings, in-person or virtual interviews, and reference checks.", "Interview Questions": "SQL joins Python Data related questions"}, {"date": "25 Jan 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "There was an initial phone screen early on, followed by a zoom interview with recruiting department/members of the department, followed by interview with members of the lab. The whole process took about 1 month. The interviews were around 45 min- 1 hour long each.", "Interview Questions": "What was one initiative you took to improve the workplace? "}, {"date": "15 Jan 2021", "title": "Sr. Grants Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "MGH recruiter invited me to apply for the position. I went through two video interviews with various members of the team/PI's and it was all in all a smooth process", "Interview Questions": "Why are you looking for another position?"}, {"date": "16 Jan 2021", "title": "Crnp Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "(5) interviews with administrative personnel. All extremely professional, welcoming, and relaxed. Answered all questions without hesitation. Transparent about role, expectations, and the mission of the department and hospital as a whole.", "Interview Questions": "5 year plan for the future"}, {"date": "14 Jan 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Connected by a recruiter to come in and interview with the hiring manager / supervisor.  Unfortunately radio silence from them in the weeks following and did not answer follow up emails which is frustrating.", "Interview Questions": "Do you perform better individually or as a team member?"}, {"date": "8 Jan 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Not too intensive. Video call with PIs, second interview with other coordinators, and references needed. Applied, then took around 2 months to hear back, but after that it took 2 weeks to hiring.", "Interview Questions": "When was one time you dealt with conflict?\r\nTalk about your leadership experience."}, {"date": "21 Feb 2021", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2021", "Interview Descriptions": "January 2020 Process\r\nFirst, I was invited to a zoom meeting with 5 of the team members in the research lab. After, I was scheduled with an interview via zoom with the PI of the lab one-on-one.", "Interview Questions": "First: Tell us about yourself.\r\nWhat do you see yourself doing in the next 5 years?\r\nWhat experience do you have that is relevant to this lab?\r\nWhat do you seek to gain with working in this lab?\r\nWhat are things you love about research? What are things you don't love so much?"}, {"date": "25 May 2021", "title": "Clinical Practicum Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2021", "Interview Descriptions": "It was pretty short but gave me a basic idea of what I was responsible for. The interviewer was incredibly nice and I felt reassured that I was a great fit for the team.", "Interview Questions": "What prior experience do you have with data analysis?"}, {"date": "7 Dec 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Asked questions about my experience, qualifications, and wanted to know why I was interested in that specific position. Overall fine but had to reschedule multiple times which was frustrating and felt like my time was disposable.", "Interview Questions": "What is your previous experience in research"}, {"date": "10 Jan 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Dec 2020", "Interview Descriptions": "The process was dragged out for 11 months because of COVID. All interviews were conducted remotely, the final being a 2-hour panel discussion. The communication by MGH over those 11 months was subpar, as I was the one who had to keep reaching out to check in. I was confident with my interview performances, and am ultimately relieved I did not get the position because it means I have a chance to land with colleagues who are good communicators and always of top of things.", "Interview Questions": "Tell us about a time you were under pressure and how you handled it? How would your former employer describe you in three words?"}], [{"date": "18 Jan 2021", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Dec 2020", "Interview Descriptions": "Simple phone interview. Call lasted about 30 minutes. Was asked to provide brief background of myself and future goals related to the position. Interviewer did a good job answering all of my follow up questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "11 Mar 2021", "title": "Web Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2020", "Interview Descriptions": "I went through three rounds with the MGH Ambulatory Management Team, one round being a two hour interview panel and a written test where they asked me for consulting advice for their website and newsletter content. I was floored after I interviewed for the final round and was ghosted. I completely understand not getting an offer, but to not get a rejection notification after interviewing for 4+ hours with the team and providing a written test submission (unpaid work) was very unprofessional on their part.", "Interview Questions": "How would you improve our website?"}, {"date": "20 Nov 2020", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Zoom Interview with Principal Investigator of lab,  lasted about an hour and was very conversational and informal. Next interview was with entire research team and was also conversational. Mostly discussed my experience and the lab's current research projects", "Interview Questions": "Tell me about your research interests"}, {"date": "31 Jan 2021", "title": "Staff Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2020", "Interview Descriptions": "Applied for a job, about a month later I was contacted (email) by HR to set up a phone screen. Phone screen lasted 15mins and I was told the hiring manager would reach out to schedule an interview. Interviewed with the hiring manager over zoom, entire interview was about an hour. I was emailed the next day with the information to check references. Once references were filled out, I was contacted 1-2 days later by HR and was offered the job.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Dec 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital in Nov 2020", "Interview Descriptions": "Generally 2-3 interviews depending on lab. Usually starts with a phone screen, followed by meeting members of the team. The last tends to be with the PI. Exact process depends on the lab.", "Interview Questions": "Why are you interested in this postion? "}, {"date": "6 Nov 2020", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2020", "Interview Descriptions": "It was very nice. Got a call from the nursing manager and then talked in zoom with the nursing educator and manager on the floor 4 days after I applied. The interview composed of several questions about my experience and they explained the logistics working on the floor. Got reference check in  in 2 days and was offered the position 1 day later", "Interview Questions": " why do you want to become a PCA and what do you want to gain out of this job "}, {"date": "6 Apr 2021", "title": "Clinical Trial Assistant Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Oct 2020", "Interview Descriptions": "Was 3 months long, several phone and Zoom interviews with multiple team members. They all seemed great to work with but the process was terrible. HR was barely in touch and I did not feel I was being properly recruited. In the end, they offered an insultingly low salary which amounted to a complete waste of my time.", "Interview Questions": "What would you do if you didn’t know how to complete something on your own?"}, {"date": "16 Sept 2020", "title": "Clinical Fellow - Speech Language Pathologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "The interview process consisted of two rounds. The first round was a  phone screening with the supervising SLP. The second round was with the entire rehabilitation team.  They were all very personable and receptive. Overall this was a positive interview experience.", "Interview Questions": "Tell us about a difficult clinical experience."}, {"date": "25 Aug 2020", "title": "Training Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Process took over 2 months. It was a long process in my opinion. It took two weeks between each interview to hear from either the recruiter or hiring manager. I think it was because the hiring manager was on vacation. \r\nPhone screen with recruiter. \r\nPhone screen with hiring manager. \r\nIn-person interview with hiring manager and director.", "Interview Questions": "How do you handle conflict? "}, {"date": "24 Feb 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Massachusetts General Hospital in Jul 2020", "Interview Descriptions": "Easy and smooth. Asked the typical questions. The managers and MDs interviewing seem to have a strong commitment to the team and wanted to hire others who were also genuinely committed.", "Interview Questions": "What are your strength and weaknesses?"}], [{"date": "15 Jul 2020", "title": "Desktop Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2020", "Interview Descriptions": "I applied online.  I had a preliminary interview with a recruiter, then a half-hour phone interview with the hiring manager the next week.  I received an offer the next day.", "Interview Questions": "Are you going to feel comfortable working in a hospital, given the coronavirus situation?"}, {"date": "25 Jun 2020", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Got the interview through an employee referal. on the phone interview for 40 minutes, it went well, asked general questions. however the interviewer did not respond to my follow up email except after two weeks.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "14 Jun 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Phone screen and an at-home case study, followed by checking three references and a final round interview with several faculty members as well as current CRCs. Whole process took about two months from start to finish.", "Interview Questions": "What was one way that you made sure to stay organized in your previous work experience?"}, {"date": "18 May 2020", "title": "CRC Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "The process itself took a long time to schedule which required a lot of back and forth. Multiple rounds of interviews and many individuals to meet with. Didn't meet the PI.", "Interview Questions": "Why are you a good fit?"}, {"date": "9 Mar 2020", "title": "Intern Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "first-round email communication, I sent my cv to them\r\nthen onsite, not difficult, good conversation, they asked me about my social media experience\r\nemailed me one hour after onsite and gave me the offer", "Interview Questions": "Any related experience in social media?"}, {"date": "26 Mar 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2020", "Interview Descriptions": "Interview with manager and clinical specialist in a separate room. Meet manager first. I am lucky and the manager is great. I had a very pleasant conversation with her. She even tries  to help me how to sell myself to the clinical specialist for my next interview.", "Interview Questions": "Help me walk through your resume. \r\nWhat is your response to a unresponsive patient? "}, {"date": "29 Jul 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2020", "Interview Descriptions": "Not to bad. Everyone was different so prepare for everything. Make sure you do a god amount of your own research into the PI academic interest and be sure to ask many questions.", "Interview Questions": "Why do you want the job?"}, {"date": "22 Mar 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital in Mar 2020", "Interview Descriptions": "Quick response and good communication throughout.  It was a 3-step interview, all held over Zoom.  The first interview was with the hiring manager and was quick and straightforward.  The second interview was with the core team and went very well; interesting conversation.  The final interview was with another, related team who seemed disorganized and disengaged.  My questions were answered in a few words with limited detail, and one of the interviewers was looking at her phone almost the whole time and  kept asking me to repeat myself because she wasn't listening.  At one point I was asked to identify the \"diverse\" characteristics of my prior team, which felt like a very restrictive/tokenizing way to go about that topic.  I left the final interview uncomfortable with their lack of engagement and concerned with the limited way they wanted to address important topics in the DEI&B space.", "Interview Questions": "Why are you interested in this position?"}, {"date": "10 Mar 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2020", "Interview Descriptions": "Interview  lasted  approximately 2 and a half  hours.  Interviewed by  5 individuals from physicians, staff and manager all rotated  with 30 min. interval.", "Interview Questions": "What do you  do in your  spear time."}, {"date": "19 Feb 2020", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Interview process was slightly different as manager reached out to me as a result of a collegue of his forwarding him my resume. We had a brief phone call and then he called me in for an in person interview. I interviewed with him and the other program manager, was then asked for references and was offered the job.", "Interview Questions": "What do you look for in a manager?"}], [{"date": "24 Feb 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2020", "Interview Descriptions": "I went through a phone screening and now I am going in for an in person interview with the department. The phone interview was less than 30 minutes and I will have to travel to Boston to meet everyone", "Interview Questions": "Tell me about yourself "}, {"date": "7 Oct 2020", "title": "Unit Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital in Feb 2020", "Interview Descriptions": "It was like any other type of interview.  I went there and waiting for the supervisor who was really nice.  We talked over the job description and my experiences as well.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Feb 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Feb 2020", "Interview Descriptions": "It was a phone screen where the interviewer told me about the position and asked me a few questions about my self. Then I was given the opportunity to ask the interviewer questions about the job, and what they would be expecting me to accomplish in the role.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Jan 2020", "title": "Clinical Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "A phone call and questions about the experience both detailed on your resume as well as about coursework, extracurriculars, volunteering etc.  It was a very open conversation and was more of a discussion than the interviewer firing questions at you.", "Interview Questions": "Can you describe a time when you delt with a difficult patient?"}, {"date": "10 Feb 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Jan 2020", "Interview Descriptions": "Vey kind and efficient people. Everyone was very kind in relaying what the work would be like. Do not be intimidated by the titles of those you speak too and hear from.", "Interview Questions": "What would you like to bring to the table?"}, {"date": "1 Dec 2019", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I met the recruiter during a career fair. She got in touch with me through email. I submitted the application online and then received a phone call for the interview.", "Interview Questions": "Describe your experience that you overcame language or cultural barrier when you  communicated with another group"}, {"date": "25 Oct 2019", "title": "Instructor, Medicine Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Internal promotion,  just needed paperwork approved by the manager and the chief. Interviews of the external candidates are highly dependent on the managers and units that you will get hired.", "Interview Questions": "N/A"}, {"date": "18 Oct 2019", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "phone interview first since i was a bit further away from boston. once they decided they wanted to move forward with my application, i was requested to visit boston anyway and redid my interview process.", "Interview Questions": "what made me apply/transfer to the hospital"}, {"date": "17 Oct 2019", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Short interview with the two organizers of the program. Asked mostly about my interest in oncology, easy and casual interview. Most people who get an interview will get at least a PCA job on one of the floors", "Interview Questions": "Why are you interested in this particular specialty? Why are you interested in nursing? Any questions?"}, {"date": "23 Sept 2019", "title": "Medical Laboratory Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Applied online, was contacted for phone interview 3 days later since I was out of state. Phone interview was about 1 hour, then 3 weeks later I was invited for an on-site second interview, HR interview, and tour. I was offered the job by HR later that day. I wish they had reimbursed my travel since Boston is very expensive and they insisted I come visit and stay several days. Also, if you don't have an internship after graduating, you aren't actually interviewing for Med Tech I, you're interviewing for a lower position with a big drop in pay, and can move up to Med Tech I after one year. Still worth it since it's better than an unpaid internship, but I didn't expect it. Management was really nice and easy going. Interviews were fairly casual and just required some basic preparation prior to.", "Interview Questions": "Biggest strength, biggest weakness, my biggest fear"}], [{"date": "11 Sept 2019", "title": "Personal Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was brief, calm, not stressful.  There were two individuals interviewing me, and they made the process very comfortable and chill, like it was just a conversation.  I am very happy with how the process went", "Interview Questions": "When is a time you had an issue with a coworker? How did you resolve it?"}, {"date": "8 Sept 2019", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "First you will get a phone interview and once they approve you will meet with the manager and the supervisor  of that department for a second in person interview.", "Interview Questions": "Why should we hire you?"}, {"date": "6 Sept 2019", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Straightforward & pleasant. Everyone was upfront about the benefits and challenges of the position. It was a combination of group and one on one interviews. Each department likely has its own interview process.", "Interview Questions": "A mix of technical and behavioral questions."}, {"date": "16 Sept 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Sept 2019", "Interview Descriptions": "Applied Online, HR Contacted me for on-site interview. The interview was technical. The hiring manager was very friendly. Made interview process comfortable. The interview lasted for 20 minutes and got a reference check email from HR withing 5 hours of giving interview.", "Interview Questions": "Why opt for Clinical career. General Resume question. Strength and Weakness."}, {"date": "2 Nov 2019", "title": "Revenue Cycle Operation Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Sept 2019", "Interview Descriptions": "It  started with getting to know call with hiring manager followed by a  phone interview with group of people and then onsite with the same group. The questions were pretty straightforward and  situational.  They were prompt in  responding with interview results.   Since the hospital has many buildings and is pretty difficult to navigate, It would have been better to have  detailed instructions to the interview room to avoid confusion.", "Interview Questions": "How do you troubleshoot with a particular given dataset?"}, {"date": "29 Jan 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Sept 2019", "Interview Descriptions": "Easy going from the initial contact until the end. There were two rounds. The first-round interview was 1:1 with the physician that was hiring for the position. It was nice, more like a chat and with typical interview questions (tell me about yourself, strengths, weaknesses, where do you see yourself in 5-10 years from now, etc). There was some very specific questions related to the position (questions about how to prepare an IRB protocol, sample size calcu.ation, etc - specific but nothing difficult). Then, the second-round interview was a panel interview. I was face to face with two other attendings, who asked me very typical interview questions.", "Interview Questions": "Tell me about yourself."}, {"date": "13 Aug 2019", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "The whole process for the Research Intern position took around 2 weeks. I interviewed at the place in October, 2017. Was offered a position by November, 2017. Very swift and fast-paced process.", "Interview Questions": "Describe your previous research backgrounds. "}, {"date": "13 Nov 2019", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital in Aug 2019", "Interview Descriptions": "A phone screen first. The In-Person interview consisted of a 2 hour panel interview, one on one with three peer team members. The last portion of the interview consisted of a case study.", "Interview Questions": "A case study to solve and present to the panel. "}, {"date": "25 Aug 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2019", "Interview Descriptions": "Prescheduled phone interview with the PI directly. PI was nice and patient, very thorough when introducing and explaining her research. Interview questions were predominantly about my past research experience and my future career plan.", "Interview Questions": "Introduce your past research experience"}, {"date": "24 Aug 2020", "title": "Staff Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital in Aug 2019", "Interview Descriptions": "initial phone screening with basic outline of the job  and responsibilities in the roll and initial screening questions such as strengths and weakness, salary expectations, previous experience , in-person interview with the team you are working with.", "Interview Questions": "What are your strengths and weaknesses? "}], [{"date": "10 Sept 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2019", "Interview Descriptions": "I was contacted five days after completing the application. The first stage was comprised of a phone interview, while the second was an in-person interview. All parties were extremely kind and understanding of all questions.", "Interview Questions": "What is it about this program that drew you here instead of another in the area? "}, {"date": "3 Jul 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "very thorough, I had 4 interviews for 1 position. Overall, very warm and friendly interview process. I spoke with multiple people on the research team which was helpful because they asked varying questions and I was able to hear different perspectives. A very smooth interview process!", "Interview Questions": "How do you work well balancing multiple projects and responsibilities?"}, {"date": "20 Jun 2019", "title": "Summer Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was a 1:1 phone call with the PI. He asked about my research and my extracurricular. It was a nice conversation. A few days later I was in contact with HR representative to start the hiring process.", "Interview Questions": "What extracurricular are you apart of?"}, {"date": "11 Jun 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I talked to the head researcher on the phone, and she explained to me the work they do and then asked me to come in in person if I was interested.  I then met her in person and she asked me some questions, then was offered and accepted the role.", "Interview Questions": "Do you have clinical research experience or experience working in a hospital setting?"}, {"date": "22 Jul 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2019", "Interview Descriptions": "I filled out an application online for the Clinical Research Coordinator position, and I was contacted by the site principal investigator for an hour-long Skype interview with the site PI.  The PI asked questions about my current position and other relevant research experience, but most of the interview consisted of the PI explaining the nature of the study, multisite collaboration, and job duties.", "Interview Questions": "Describe a challenge that you had when recruiting participants."}, {"date": "10 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital in Jun 2019", "Interview Descriptions": "The interview process was very efficient and they kept me informed the whole time. Phone call and then an interview with the hiring manager and and two other managers. Interview was informative about role and responsibilities.", "Interview Questions": "Asked to discuss my academic and internship experiences, how those skills can be applied to role, no unexpected questions "}, {"date": "23 May 2019", "title": "Research Scientist/Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "There was a research seminar presentation. There was a lunch with the PI and senior members of the group. There were a number of one on one individual meetings with various members of research group.", "Interview Questions": "Research related questions"}, {"date": "22 May 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "one phone screen,  one skype interview. Was generally an easy process and not stressful. Did not make me come in for in-person interview since I was applying from out of state.", "Interview Questions": "Regular questions about work experience"}, {"date": "2 May 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was a skype interview. We have issues of connectivity but it was resolved. They were very friendly and asked about the current projects that I was doing. They also were very accomodating.", "Interview Questions": "What do you want to learn out of this experience?"}, {"date": "21 Jun 2019", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2019", "Interview Descriptions": "I got an invitation to interview with the PI after waiting for a month. The interview was pretty straightforward, asking about my background and what I expect for this job.", "Interview Questions": "What is your future career plan?"}], [{"date": "3 May 2021", "title": "Software Development Engineer In Test (SDET) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2019", "Interview Descriptions": "Good communication, procedures and expected time and expectations explained in each step and response is provided in reasonable time and explained after each step. Team is very professional and open for communication during the process.", "Interview Questions": "Difference between testng and cucumber test frameworks."}, {"date": "28 Apr 2019", "title": "CRC Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "good not too stressful not to easy just asked to explain my resume not much else good not too stressful not to easy just asked to explain my resume not much else", "Interview Questions": "typical"}, {"date": "3 Apr 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "The interviews took place over the course of 3 weeks, was not an intensive process - the team was very relaxed and they were happy to have me join. This interview process is very subjective based on the research group you will be joining - they have a lot of say in who they would like to hire.", "Interview Questions": "Why do you want to join this division?"}, {"date": "6 May 2019", "title": "Patient Service Coordinator III Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2019", "Interview Descriptions": "Had a phone screen with the department and they then reached out to me for an in person interview. Interviewed with multiple doctors and practice admin's for 30 minutes. The offer was incredibly low (17.40/hour for someone with 4+ years experience) and the benefits were much more expensive than surrounding hospitals so I declined the offer.", "Interview Questions": "Why are you looking for a new position?"}, {"date": "12 Apr 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2019", "Interview Descriptions": "I applied online. I was contacted for a phone interview that week. I then had an in-person interview the next week and was offered the job the week after.", "Interview Questions": "What would you do in a situation where you and another person are working together and the other person is not doing there work. "}, {"date": "4 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Received a 10 minute phone interview. Phone call was mostly describing the position and asking about my availabilities and interests. Phone call was with someone currently in the position. Overall, not difficult experience.", "Interview Questions": "Why are you interested in this study?"}, {"date": "8 Mar 2019", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2019", "Interview Descriptions": "You will speak to the hiring manager if your resume gets accepted. This is a screening call which can lead to an invitation for an on-site interview. On the on-site interview, you will be asked to work through a case study.", "Interview Questions": "Tell me about a time you failed. "}, {"date": "7 Sept 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2019", "Interview Descriptions": "I went to a job fair and was hired on the spot. It was very easy and chill. I was interviewed by the nurse manager on the floor. We had a conversation about my educational background and work experience.", "Interview Questions": "Where do I see my career going? What hours/schedule was I interested in working? "}, {"date": "27 Jun 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2019", "Interview Descriptions": "Applied online through MassGen careers site. Got email for interview about 3-4 weeks later. Met with PI, another CEC and program manager. very nice, 30 minute interview, they told me about the program and what my role would be in the program; after the interview they asked for my references", "Interview Questions": "What do you do when you are faced with an issue?"}, {"date": "28 Mar 2019", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2019", "Interview Descriptions": "Applied online through the career site and got a phone interview. The phone interview lasted 45 minute and was more general. The second round was a video interview with more technical questions which lasted for an hour.", "Interview Questions": "Experience with PCR"}], [{"date": "31 Jan 2019", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "The interview was very straightforward. It was a 30 min phone call with a recruiter. All questions were behavioral questions--there were around 8-10 questions. Overall, it was a good experience.", "Interview Questions": "Tell me about a time you worked with a team."}, {"date": "21 Mar 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Feb 2019", "Interview Descriptions": "Easy going and very general. Met with the HR person first. Then the boss/ head nurse. Everyone described their roles and experiences on the floor. This was followed by them asking me about my experiences. The boss also showed me around the floor.", "Interview Questions": "What  made you apply for this position."}, {"date": "3 Jun 2019", "title": "Registered Nurse Residency Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2019", "Interview Descriptions": "Received an email to schedule a phone call. Scheduled a phone call interview then interviewed in person with floor manager.  However, the HR lady who phone screened me was extremely rude and inappropriate.", "Interview Questions": "Specific to the needs of the floor and specific to my experiences and education. "}, {"date": "11 Feb 2019", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2019", "Interview Descriptions": "Was contacted to schedule an interview via e-mail shortly after I submitted my job application. It was subsequently rescheduled twice (I guess it happens). \r\n\r\nI was originally supposed to be interviewing with 3 people, but ended up talking to only one of them.\r\n\r\nThe interview  took about half an hour, it was a pleasant conversation. The interviewer made me feel at ease. He asked me to walk him through my resume (standart questions), then he asked a few statistics, data cleaning and machine learning questions to test my knowledge of the subject and to evaluate my thought process. He seemed to be satisfied with my responses. At the end I walked out feeling pretty good overall. \r\n\r\nAlas I did not get the offer. Not a big deal, part of the job searching game :) \r\nThe only negative was that I did not get a rejection e-mail, nor any response after I had followed up with them. I figured after additional 4+ weeks of waiting, no response means 'no offer' which was a bit frustrating, but again it is not an uncommon way to turn down an applicant.", "Interview Questions": "How to prevent overfitting of the data?\r\nHow to deal with data redundancy?\r\nWhat methods of visualization would you use  to find outliers?"}, {"date": "19 Mar 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2019", "Interview Descriptions": "The interview was extremely professional and quick. I had an interview with three people back to back before moving onto the final one over the phone with a boss of the industry.", "Interview Questions": "Past experience and why I wanted the job"}, {"date": "7 Feb 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2019", "Interview Descriptions": "smooth, friendly environment. more of a friendly conversation as though you are part of the team already.  she even asked when i want to start the job. i dont know what else you want me to answer", "Interview Questions": "so, tell me about yourself"}, {"date": "12 Jun 2019", "title": "BMET Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2019", "Interview Descriptions": "the process it been changed \r\nwas a long time ago and after a phone call for 30 min asking a lot of question \r\nafter 3 weeks they send me an email saying im sorry directors can take second interview", "Interview Questions": "N/A"}, {"date": "6 May 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2019", "Interview Descriptions": "Phone screen with HR. Invited to shadow and come in for an interview. HR followed up the same day to discuss how the day went. The process moved very quickly from one stage to another.", "Interview Questions": "What is your interaction with nursing assistants like?"}, {"date": "21 Aug 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2019", "Interview Descriptions": "interviewed by a couple of managers and a supervisor. all separate interviews. i've worked as a temp and they wanted me right away. The managers liked the way I worked and I got the job done. they also liked how quickly I worked and gave me tasks to take on. iI am a fast learner and was willing to take on anything they threw at me.", "Interview Questions": "can you multi task?"}, {"date": "3 Mar 2022", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital in Jan 2019", "Interview Descriptions": "Zoom interviews with lots of people. Quick turnaround on status of an application. Friendly people. Zoom interviews with lots of people. Quick turnaround on status of an application. Friendly people.", "Interview Questions": "Who are you as a person?"}], [{"date": "8 Feb 2019", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2019", "Interview Descriptions": "The in person was very chill, spoke with Project Manager and another Coordinator, met some doctors; no stupid \"interview\"-type questions. Understood the setting where i would be working and the vibe. They make you feel very good about the whole thing.", "Interview Questions": "A time a project feel through"}, {"date": "30 Sept 2019", "title": "Recovery Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 9 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2018", "Interview Descriptions": "9 months and 4 references a drug test met with 22 different people in different departments. 4 supervisors 3 did weekly supervision, interview was like being in therapy session", "Interview Questions": "Give us an example of how you handle patients who blame you for not being available for them, "}, {"date": "30 Nov 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very easy process. The PI contacted me directly. Not one of those formal interviews, more of like a friendly one. She did not ask any of those expected questions, there were more general questions.", "Interview Questions": "Why did you decide to study that major?"}, {"date": "10 Nov 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "only one interview through skype. very basic questions. Since it was an undergrad student intern, the process was generally informal. The process was really quick. I got the offer two days latter after the interview", "Interview Questions": "what role do you play in team work"}, {"date": "10 Dec 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2018", "Interview Descriptions": "I received an email about the position within a week, and had a phone screening within the next couple of days. The next week I had scheduled an interview with the program manager and the associate director. Interview was standard and the people I met with was very nice. I did not hear back from them until I had to email them, 3 weeks later.", "Interview Questions": "What are three things that are most important to you?"}, {"date": "30 Oct 2018", "title": "PSC Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It was pretty basic but very rushed and unorganized. I Didn't accept the position, I didnt get a good vibe from the Unit while i was there. Employees seemed to have an attitude when I told them i was there for an interview.", "Interview Questions": "Why do you want to work for MGH"}, {"date": "30 Sept 2018", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I've interviewed for MGH twice and have had negative experiences both times. First time (several years ago): I had a phone screen, then in person interviews with 4 or 5 people. I didn't hear back from the hiring manager or recruiter for weeks. I reached out to follow up by email and by phone and got no response. They did eventually call me to discuss next steps and an offer, but I had already accepted another position because I had assumed I'd been cut. \r\n\r\nI interviewed again a few months ago and the recruiter again disappeared. She never responded to email or voicemail requesting a brief update. I again accepted a position elsewhere. I never received any clarity on where I stood with MGH. \r\n\r\nI've enjoyed my in person/on site interviews and have been very impressed by MGH otherwise.", "Interview Questions": "Tell me about a difficult patient experience? Why this specific job and specialty?"}, {"date": "29 Mar 2022", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Sept 2018", "Interview Descriptions": "Must speak English\nMust take typing exam \nMust take orientation and training for patient record access \nMust meets Immunization criteria\nShould dress busniesslike \n30 words is  a lot for a review", "Interview Questions": "Where do you see yourself in 5 years ?"}, {"date": "13 Aug 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I was contacted 1 month after applying.  The phone interview was a generic interview with some behavioral questions and general questions about background and career goals.  I had an interview the next week, where I met with the lab coordinator and two other CRCs.  It was a very nice experience, and they were very cordial.", "Interview Questions": "What was a time where you had to sacrifice for the greater good of the team and what was the outcome?"}, {"date": "9 Aug 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "It was pretty straightforward, I had a phone interview and was asked behavioral questions. The interviewer said she'll get back to me during that week but didnt till 2 weeks later which was annoying.", "Interview Questions": "How do you deal with difficult situations?"}], [{"date": "8 Aug 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Received phone interview invitation a month after I applied online. Phone interview was with current CRCs, they were very conversational and asked basic questions from my resume. Then, went in for an in person interview a few weeks later. The total interview was around 3 hours long and met with several PIs, CRC, and staff members. Asked questions about research interests as well as skills from past research experience. Later I was asked for references. It took a very long time (around 3 weeks) to hear back about final decisions which was the only negative part of this experience.", "Interview Questions": "How do you work in a team environment? What is your experience working with patients in a medical setting? "}, {"date": "22 Jul 2019", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2018", "Interview Descriptions": "- Phone interview\r\n- In-person interview with PI\r\n- Received an email from HR that I was offered the position\r\n- Negotiated salary/pay with HR and heard back from PI\r\n- Scheduled orientation and first day of work", "Interview Questions": "What is one your strengths?"}, {"date": "17 Sept 2018", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2018", "Interview Descriptions": "I was initially phone screened and asked to come for an in-person interview. It was a quick and easy process. It was very easy and smooth to connect to the hiring manage.", "Interview Questions": "How do you think that you will the fit the role?"}, {"date": "16 Jul 2018", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "1-1 with nurse manager. They will ask you questions like why do you want to work there, what can you bring to the table. They want to get to know you. Dont forget to smile and look at them when speaking.", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Jun 2019", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2018", "Interview Descriptions": "Very brief, easy, basic questions. Just think what would be the most important aspects of the job you would be doing based off of the application and then think how your qualities apply to you excelling in those tasks.", "Interview Questions": "How would you deal with a disgruntled patient?"}, {"date": "7 Mar 2022", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2018", "Interview Descriptions": "The interview process was very easy.  It was a casual environment that made me feel at ease. An EA set up a phone screening and then I had an in person interview with the Senior Admin Manger and the Executive Director.", "Interview Questions": "Why are you interested in EA role?"}, {"date": "2 Jun 2018", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very formal. Ask all the typical interview questions; why healthcare, why mass gen, what are your strengths and weaknesses, describe yourself. Got a call a few days later to offer me the job over the phone and then emailed me the offer letter afterwards.", "Interview Questions": "Describe yourself in 5 words."}, {"date": "6 Jul 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2018", "Interview Descriptions": "Overall very smooth process. The clinic I interviewed with was really responsive and receptive to my questions and concerns. They were also accommodating for me since I was not located in Boston at the time of my interview.", "Interview Questions": "What do you think the clinical research coordinator position would look like from a day-to-day basis?"}, {"date": "15 Oct 2018", "title": "Patient Room Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2018", "Interview Descriptions": "Initially had a phone screen after about a week and everything went great. Then asked to have in person interview which also went good but didn't hear back for months. They finally had said my e-mail was lost and would like to interview again. We did a final Skype interview and I did not get the position.", "Interview Questions": "Why I had moved to another state in the past."}, {"date": "19 Jan 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Massachusetts General Hospital (Cambridge, MA) in Jun 2018", "Interview Descriptions": "It was fun. Meet the interviewer in his office. We chat about my college life and career goals. We define the expectation of the role and whether my skills set fits the role. We discuss confidentiality and what kind of tools I will be working with if I get the job.", "Interview Questions": "Why MGH?"}], [{"date": "5 Aug 2018", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2018", "Interview Descriptions": "Phone interview that lasted approximately 1 hour. Ended with a scheduled tour of the laboratory and work environment. Followup on site discussion about the job and the work it entails.", "Interview Questions": "Relevant job experience"}, {"date": "24 May 2018", "title": "Biomedical Equipment Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Had a conference call with a group of managers who run equipment at different departments. Basically a \"tell me about yourself\" interview  then the interview ended there. The interviewer didn't offer an opportunity to let the candidate ask questions.", "Interview Questions": "Tell me about yourself."}, {"date": "6 Jun 2018", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2018", "Interview Descriptions": "The process took about 2 weeks total.  I was contacted first by the current CRC for a short phone interview on a Friday. Then brought in the next Wednesday for an interview with the PI. The next day I was called by the hiring manager and offered the job contingent on my references.  The following Monday I received a call from the hiring that I got the position and on Tuesday morning I received the official offer from HR.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "25 May 2018", "title": "Grants Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2018", "Interview Descriptions": "I applied online and was contacted for a phone interview almost a month later. The phone interview was with the Development Director for the department I would be working under. The interview was pretty standard but I was suprised how easy going he was and it was more like a conversation. Before we hung up we were already scheduling a second interview, in person. Two weeks later I flew up to Boston and met with the man I spoke to before (my boss) for about 20 minutes- didn't ask much interview questions cause he had previously. Then I went and met with the Senior Grants Administrator whom I would be working with and saw what my office would be and what not. Meeting with her was more so for her to see if she could work with me side by side each day so pretty relaxed. Then I the last person I met with was the lead Doctor of Surgery for the Center of Transplantation Sciences and was pretty brief. He asked about my experience and really wanted me to thoroughly explain it. Then the following day I was contacted by someone from HR to submit my references 2 days later they were contacted and the following week I received a job offer.", "Interview Questions": "Past experience\r\nOrganizational skills\r\nStrengths/ Weaknesses\r\nWhat I want to learn\r\nWhy I should be hired\r\nWhat I bring to the table\r\n"}, {"date": "27 Apr 2018", "title": "Community Health Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It wasn't a very productive interview and the interviewer didn't seem that interested in getting to know me. She asked me questions but didn't ask me to elaborate further on those answers.", "Interview Questions": "What are your salary expectations. "}, {"date": "4 Jun 2018", "title": "Partners BioBank Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2018", "Interview Descriptions": "I applied through the mgh website and had a phone interview the following day. I had an in person interview with two people the following week. They asked standard behavioral questions. They said they would get back to me the following week but never did.", "Interview Questions": "How can you contribute to the BioBank?"}, {"date": "28 Jan 2019", "title": "Patient Service Coordinator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2018", "Interview Descriptions": "Straight forward, came in for an interview and met with the doctor, manager and staff. Came in a few days later for another interview with NP staff. They asked for references and I received the offer 6 days later", "Interview Questions": "What experience do you have in healthcare?"}, {"date": "1 Jun 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2018", "Interview Descriptions": "Applied through indeed, and found a doctor's email online to send in my resume that way as well. My resume was circulated through the department, and I was invited for a phone screen for a couple of different projects. I then had Skype interviews with the doctor and 2 CRCs, and then was invited for an in-person interview. I interviewed with 4 different people from the team. It was very casual, a lot of questions about my previous experiences and transferable skills, and just seeing if I was a good fit for the team.  It was a great experience, my only concern was the pay - which was not up for negotiation at all, and I when I tried to ask for more, it sounded like HR was trying to devalue me as an employee and act like they weren't almost 10k less than the average in the area. For someone with student loans and paying rent anywhere near Boston, it's going to be difficult to swing, but I took it because I really enjoyed the team and the job description.", "Interview Questions": "Tell me about you research experience"}, {"date": "26 Mar 2018", "title": "Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I received a phone call from HR. A few days later I was brought to the department to meet with the hiring manager. From start to finish I interviewed and received a job offer within 1 week.", "Interview Questions": "Average questions "}, {"date": "22 Mar 2018", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Met with Supervisor and the team. Questions asked where off resume. Very low pressure- was more about finding the right fit for the team than qualifications. Pretty standard and casual.", "Interview Questions": "What was a time you had a problem and solved it? "}], [{"date": "22 Mar 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "MGH Diabetes research center. Interview took about 30 minutes and I met with 4 different people at different times. The asked questions about my clinical research experience and experience working with patients. I met with the RA I was going to replace,  2 RNA's and the program manager. The interviewers seemed to be in a hurry to rush through the questions since they were interviewing other candidates concurrently.  But overall they were cordial and friendly.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Mar 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Quick process. Applied online then contacted by HR. They set up and interview and a few days later I was offered a job after my background check passed. Interview process was very easy and the questions were not hard at all. Overall a very pleasant process.", "Interview Questions": "Why Massgeneral"}, {"date": "9 Mar 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Was contacted by someone to do a phone screen. This department received my resume from a previous interview I had at MGH (and did not get the job). I did a 30 min phone call with another CRC. It was pretty easy, just answering questions to clarify my skills and talking about my experiences and resume. I was then asked to come in for an in-person interview a few days later. When I arrived, I met with 4 different people separately. Everyone was extremely nice and welcoming, so I did not feel anxious during the interviews. I met with the manager last, and at the end, she said the next step was to be contacted by HR and do a reference check. The reference check took about a week. I was then contacted to set up a time to talk to the manager, where I received an offer for the position.", "Interview Questions": "Tell me about your most recent research experience. "}, {"date": "22 Mar 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2018", "Interview Descriptions": "I found the job through indeed.com and applied on the company's website. I honestly forgot that I applied to this job. There is no way for the applicant to contact HR or hiring manager. After about 2-3 months, I heard back from one of the doctors to schedule a phone interview. I passed the phone interview and 2 week later, I schedule and in-person interview. I was interviewed by the attending doctor, a fellow and another clinical research coordinator. It took about 1 hour.", "Interview Questions": "Why do you want this job?\r\nWhat are the qualifications that make you a better candidate?\r\nwhat are your interest in life (hobby/career)\r\nHow do you respond in certain situations? (I was interviewing in a department that work with patient who are severely ill, so a question about death threw me off guard). I have no experienced death in my family (thank God); so I did not know how to respond to that. Be ready for those kind of questions. "}, {"date": "18 Mar 2021", "title": "Clinical Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2018", "Interview Descriptions": "Difficult, 4 interviews . The first interview is an easy one with HR or someone from the Biomed department that does the first filter. Second interview is with the managers, third interview you have to present a project to the team and the last interview is with the director .", "Interview Questions": "Tell us about an interdisciplinary project you have worked."}, {"date": "6 Feb 2018", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Spoke with research assistant, doctor on staff, and asst director of program. Asked about why I wanted this job, what my strengths and weaknesses were, prior research experience and plans for the future", "Interview Questions": "Asked extensively about past research"}, {"date": "9 Feb 2018", "title": "Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2018", "Interview Descriptions": "Brief but the recruiters were very kind and gave a good review of expectations and ordered their help anytime in the process even if it was too just check up on my application process.", "Interview Questions": "Salary expectation"}, {"date": "19 Feb 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2018", "Interview Descriptions": "I applied to the Clinical Research Coordinator position at Massachusetts General Hospital in January of 2018. In February of 2018, I received an email from an employer, and after a few email exchanges, I had a phone interview. After 2 days, I got called back for an in person interview held in the beginning of March 2018.", "Interview Questions": "What are your future plans or goals?"}, {"date": "15 Jan 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Applied online and then received interview offer. Talked to head researcher, head of lab, and research assistant. They checked references after and got back with an offer in 2 days.", "Interview Questions": "Asked to discuss past research. "}, {"date": "8 Jan 2018", "title": "Medical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "straight to the point  . the interviewer asked me question from the job description , and was very pleasant and welcoming . he  also asked me some personality questions and was very creative .", "Interview Questions": "why do you think your a asset to the department of interpretation ?"}], [{"date": "23 Jun 2021", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2018", "Interview Descriptions": "Invited down to the office for a one-on-one interview with the Primary Investigator. Thorough and personable. Then interviewed by the two head lab techs. No study was required to prep for this interview.", "Interview Questions": "The questions were about prior jobs. Length of time worked, responsibilities held, etc."}, {"date": "22 Dec 2017", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "I Interviewed twice, the first time back in August. It went really well, however I was not chosen for the job. I applied again on November 11th, got a callback 3 days later for a second interview. I interviewed with the department manager, and a few days later HR called me to get the ball rolling.", "Interview Questions": "What is your availability?"}, {"date": "30 Nov 2017", "title": "Financial Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "There was a phone interview that was pretty laid back, followed up with an in person interview with multiple supervisors. Overall everyone seemed genuinely interested in talking with me. Were very positive and reassuring.", "Interview Questions": "Have you worked with people from different backgrounds? Do you know any languages other than english?"}, {"date": "15 Nov 2017", "title": "Clinical Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2017", "Interview Descriptions": "I was reached out to for a brief phone interview in which I was I given more information about the position and asked several basic interview questions. After the initial phone interview, I was emailed several days later to schedule a tour of the facilities and in-person interviews with the  Principal Investigator and the Senior Clinical Research Supervisor of the department. A week after the in-person interview, I was asked to submit my references. After this, I was contacted by HR to set my salary and then immediately contacted within 24-hours with an offer letter for the position.  The entire process took approximately a month.", "Interview Questions": "Basic interview questions about myself, my interests, my education/career goals and then mostly behavioral questions."}, {"date": "10 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "HR took over 3 weeks to get back to me with a date and time for interview, interviewed with HR representative for approximately 30 minutes, asked your usual questions, tell me about yourself, why do you want to work here etc. A couple weeks later I interviewed  on the unit. I walked into a board room of people: the nurse manager, CNS, and 4 staff RNs who were all taking turns asking me clinical questions; it was nerve wracking to say the least. The interview lasted approximately 1 hour. I received an offer a few weeks later. I was never warned about having to interview in front of more than just the nurse manager- I was completely taken by surprise.", "Interview Questions": "What motivates you to succeed?"}, {"date": "5 Oct 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Met with a couple of the head PI's briefly and then was interviewed in front of a panel of employees in the same role I was applying for. Very friendly and descriptive.", "Interview Questions": "How comfortable are you with learning new programs?"}, {"date": "13 Oct 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2017", "Interview Descriptions": "Submitted resume online, then a phone screen with someone working in role currently. Following that, the next step was an interview with the PI and logistical manager at the site, as well as a tour of the working space and a review of the possible projects that one might be working on.", "Interview Questions": "Most of it was a discussion of Resume."}, {"date": "17 Sept 2017", "title": "Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "invited to a low key dinner the night before with residents. full day event the next day including breakfast, presentations, tours. actual interview included two individual interviews and one panel interview. overall good experience, but very tiring day.", "Interview Questions": "detailed questions on basic science research"}, {"date": "28 Sept 2017", "title": "Post Doctoral Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital in Aug 2017", "Interview Descriptions": "I presented my PhD work. They asked about my other experiences on my resume and explained about the project and what they want. At the end, they said they had another more suitable candidate for the position.", "Interview Questions": "They asked questions regarding that."}, {"date": "23 Aug 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Massachusetts General Hospital in Aug 2017", "Interview Descriptions": "The interview process was overall really swift and simple I received a phone screen and was asked to come in the next day for an interview. Absolutely everyone I interacted with was helpful and friendly. Benefits and expectations were laid out right away. The interview itself was conversational and I feel I learned as much from them as they did from me. The next day I was contacted for references. A really nice experience.", "Interview Questions": "Amount of animal experience and examples"}], [{"date": "8 Jul 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Sent my resume and was scheduled an interview for 11am on a Friday with Judit Sore. Got there 10 minutes early and ended up waiting 20 minutes before I was actually seen. I had to tell someone to get her while she was speaking to someone in the office. She came out and said \"you're the 11am right?\". She then took me to the lobby and sat me down and asked me a few questions and tried to scare my off from the job saying that there are a lot of compliance issues and that it is a highly stressful job...  Then she proceeded to put words into my mouth and accuse me of being an under-qualified applicant saying that I did not have any work experience. Graduating from college what did she expect. I am not bitter about not getting the job and i did make mistakes during the interview but I do not think that gives her the excuse to disrespect someone because of it. Do not ask for an interview if you do not see me as a qualified individual, do not waste my time by making me wait and most of all respect the people around you.", "Interview Questions": "Tell me about the job."}, {"date": "17 Aug 2018", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2017", "Interview Descriptions": "Applied online. In 1 month, contacted by the manager vai phone. After a phone screening, I went in for a in-person interview. The in person interview included a tour in the department, a quick meeting with other staff and finally sat down with the manager to go over the details.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "5 Oct 2019", "title": "Registered Nurse NICU Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2017", "Interview Descriptions": "Phone call Interview was first step and then a meeting with manager and nurse educator was arranged where we met to discuss the role and the start date and the scheduling", "Interview Questions": "Doctor gives you order you’re uncomfortable with and how you proceed?"}, {"date": "5 Dec 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2017", "Interview Descriptions": "It was quick but pleasant, get to know all the people in the department and went to a couple of talks and see what other people think about my skills", "Interview Questions": "How do your skills fit our lab?"}, {"date": "26 May 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "tell me about yourself?  tell me about customer service? how is your team work ?They asked me if I knew anyone who worked for the company. I told them I did. They asked me if I knew the rates for home health visits. The manager then quoted me incorrect lower rates. I actually did know what they were paying before my interview. I lost respect for the company after that. The rates per visit were lower than I would have accepted...AND THEY TRIED TO OFFER ME A LOWER RATE THAN THEY PREVIOUSLY PAID NURSES!!", "Interview Questions": "Tell me about yourself?"}, {"date": "24 Aug 2017", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2017", "Interview Descriptions": "Basic process is phone interview, references and lastly in person interview. The phone interview was simple but prepare to answer any question. Then she contacted my two references and decided to have an in person interview.  After I arrived MGH, I had separate interview with three people. The three people included the two PI and the lab coordinator.", "Interview Questions": "What techniques did you learn in the lab that you worked at?"}, {"date": "5 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 7 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2017", "Interview Descriptions": "I was able to network with people through my connections to get a summer internship, and there was no rigorous recruitment legitimate process. In this sense, my experience was not necessarily perfectly repeatable.", "Interview Questions": "Why do you want to work hear?"}, {"date": "14 Jun 2017", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2017", "Interview Descriptions": "I received an email about a good time to do a phone screen. During the screen I was asked basic questions about my experience, what I'm hoping to end up doing, and just general information about this particular lab. After the phone screen, I ended up interviewing with 4 people in the lab. It was very laid back and low pressure. A couple of weeks later I received an email about discussing logistics and received an offer that was too low for me to accept ($16/hour), unfortunately. It's hard to justify making a starting teacher's salary after earning a Master's degree in science. The overall interview itself was very casual and felt a lot more like a conversation.", "Interview Questions": "What are your future career goals?"}, {"date": "27 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2017", "Interview Descriptions": "Thorough, friendly, motiving team of nurses. It was very clear what they were looking for.  Not just a body to fill a spot but truly fit the needs of the unit and the tram that was already in place.", "Interview Questions": "What is your experience with solid tumor chemotherapy"}, {"date": "25 Oct 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital in Apr 2017", "Interview Descriptions": "The process started by me applying online and receiving an email about a week and a half later to set up an interview. The first interview was a phone call and it asked basic questions about how I deal with criticism, my past experience etc. After the phone call, I got scheduled for a video interview which ask more job-related questions instead of general questions. I soon made it to the third round which was also a video call with two people on the other end instead of just one.", "Interview Questions": "Can you describe your past experience in detail?\r\nHow would you describe your relationship with your past bosses?"}], [{"date": "25 Mar 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I was applying as a new grad nurse on a unit where I worked as a tech during nursing school. So interview was with a manager who already knew me", "Interview Questions": "How do you see yourself giving back to this unit in 2 years?"}, {"date": "15 May 2019", "title": "Assistant Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2017", "Interview Descriptions": "Meet with multiple panels from the PM team. Talked about experience, why you would be a good fit, and answered behavior questions. Had to follow-up with manager 2 weeks later.", "Interview Questions": "What is your weakness?"}, {"date": "23 Mar 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2017", "Interview Descriptions": "There was a phone interview followed by an in person interview with two principle investigators and a division manager. They asked questions about my background in the field and my future aspirations.", "Interview Questions": "What are you long term goals? "}, {"date": "7 Feb 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Received a call and voicemail asking me to call back to schedule an in person meeting. Called back and we agreed on a time and I was given instructions on where to go. Interview went well, was asked by research study head about my experiences on my resume and why I am interested in the job", "Interview Questions": "Why are you qualified"}, {"date": "5 Apr 2017", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Massachusetts General Hospital (Cambridge, MA) in Feb 2017", "Interview Descriptions": "Easy, the professor only asked some basic questions, such as solving a quadratic function, MCMC, and my projects. Although my answer to technical questions is right, my previous backgroud in hardware design is not mached with his offered position. In all, the discussion was really great.", "Interview Questions": "solve quadratic function\r\n\r\nMCMC"}, {"date": "26 Feb 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2017", "Interview Descriptions": "I first applied online, and then I got an email about a phone call with one of the senior coordinators, then later got another email about scheduling an interview with them in Boston.", "Interview Questions": "What is a mistake I have made?"}, {"date": "18 Aug 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2017", "Interview Descriptions": "I was referred, met with a coordinator. A couple weeks later I had a phone interview, and after following up was invited for an in-person interview. A month later and 2 more follow up emails I was offered the job.", "Interview Questions": "What helps you succeed in a clinical research coordinator position?"}, {"date": "23 Feb 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2017", "Interview Descriptions": "I had a short phone interview and was asked to come into the office. The first interviewer I spoke with was very friendly and asked me a few basic interview questions, and gave me a detailed job description. Then I spoke to the associate program director and she immediately asked me to describe everything that the previous interviewer told me about the job. I did not get the position—my tip would be to take short notes during the interview, which I did not. Both interviewers wanted to know my weaknesses, and this question seemed very important to them.", "Interview Questions": "Describe this position to me in detail."}, {"date": "1 Mar 2017", "title": "Grants Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2017", "Interview Descriptions": "i applied online and the recruiter contacted me for phone screen. The interview went well and we did discuss about salary. The interview was about my career experience, and why do i think i am qualified and why am I interested in the position.", "Interview Questions": "Tell me about your experience "}, {"date": "2 Jan 2018", "title": "Clinical Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2017", "Interview Descriptions": "Was referred by a friend to contact the research coordinator. Did not even apply to the job since I couldn't find the application online but after I was in contact with RC I didn't need to. First there was a general phone screen about why I was interested in the internship and then an interview which I did via Skype since I was studying abroad. The interview wasn't bad although mine could have been shorter since it wasn't in person", "Interview Questions": "What brought you to apply to Mass General Hospital for research specifically?\r\nWhy are you interested in (whatever area you applied to) type of research and how does your experience back this up?\r\nWhat other research experience do you have?"}], [{"date": "11 Mar 2018", "title": "Animal Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2017", "Interview Descriptions": "Spoke on the phone with hiring manager and then went in for an interview a week later. You sit down with a group of managers and they talk to you about the position and what your responsibilities would be. Then they ask you questions about yourself and questions about different scenarios. Afterward, you are given the chance to ask the managers questions about the job. Once this process is over, you are given a tour of one of the facilities. This concludes the interview and then it's just a matter of waiting to hear back from them.", "Interview Questions": "Give an example of a time when you had a conflict with a coworker and what did you do to resolve it. "}, {"date": "25 Apr 2017", "title": "Data Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2017", "Interview Descriptions": "One day, 5 interviewers, follow up with HR for salary negotiations, 1.5 day orientation. skills test, background check, no drug test. Generally cordial, took 4 hours, was on schedule. Inerview on location,  one interview with remote employee via Skype", "Interview Questions": "Database Development Skills, Prior Exposure to Health Care"}, {"date": "31 Jan 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2017", "Interview Descriptions": "I had brief interview with the HR recruiter, which went very smoothly.  Few minutes later, I received a call from the hiring manager, requesting in person meeting.  Everyone in the office was professional, and respectful.  The meeting took about 45min, it was mainly a discussion format.  I learned lot about the organization, and they lean a lot about me.", "Interview Questions": "- Do you have any questions about the job description?\r\n- What is your day like at your current job?\r\n- Why are you leaving?\r\n- Who do you report to at your current job?\r\n- How do you learn?\r\n- What is your time-frame?"}, {"date": "1 Mar 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2017", "Interview Descriptions": "Applied online after emailing the PI. Came in to meet him + the other researchers in their office at MGH. Was very helpful that I had read the entirety of their publications ahead of time. Would recommend doing so to anyone who is interested in a research role. The two most important qualities they were looking for were being 1) personable and 2) detail-oriented.", "Interview Questions": "Talk about your research experience. "}, {"date": "2 Dec 2016", "title": "Radiochemist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (New York, NY)", "Interview Descriptions": "Applied online, got an email a few days later. It was about a 2h long in person interview. The interviewer was rather aggressive and tried to establish that the position was going to be extremely stressful (unless you have survived war, you don't know what stress is).", "Interview Questions": "Why should I hire you (looking for an answer that could not be found on the resume)"}, {"date": "15 Dec 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2016", "Interview Descriptions": "Submitted application on MGH career site, received request for phone interview a few days later, a few days after phone interview, was contacted and asked to come to Boston for an in person interview with the team. Met with four different individuals who were all part of the team over 1.5 hours.", "Interview Questions": "What is a mistake you have made in your professional life?"}, {"date": "6 Oct 2016", "title": "Staff Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "The interview process was very long but you got to meet with a lot of people to get their insight as to how it is to work here. The same questions asked by multiple people was very repetitive.", "Interview Questions": "Why I wanted to work here?"}, {"date": "26 Oct 2017", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2016", "Interview Descriptions": "interview process was quick and easy, depending on the position they have you interview with the doctor you may be working for.  Everyone is very friendly. Don't be intimidated", "Interview Questions": "Do you have hospital experience "}, {"date": "17 Aug 2016", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "The PI e-mailed me to meet him at his office. It was a smooth interview with lots of questions about my experience and analytical skills at the lab. He went through my CV and asked what I contributed to some of my major publications. He gave me a tour of the lab and introduced to some of his lab members.", "Interview Questions": "Mainly about my research experience and my collaboration with my coworkers."}, {"date": "25 Apr 2017", "title": "Medical Assistant Gastroenterology Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2016", "Interview Descriptions": "I was called for an interview after submitting my resume. When I sat down with dept manager we exchanged a few pleasantries. She had a copy of my resume in front of her. She said to me \" Let's start with you telling me what you did after  graduating high school.\" (I am 45 years old) I proceeded with my past 27 years when I noticed she was sleeping for about a minute. Then when I was talking about my career that was on my resume she was getting it all confided. She took a few more minute more cat naps. She was then called out to resolve an issue with a patient. She asked me to wait in the waiting room where I could see her resolve the matter with the patient. The patient left and I waited an hour on the waiting room. She then was walking by and notice me with a look of surprise. (Like oh no I forgot I was interviewing before I just took an hour long nap). She came over to me and said she would not be able to continue with the interview and would call me.  A week later she called and asked if I could send her a copy of my resume. I did not", "Interview Questions": "What I did after graduating high school 27 years ago"}], [{"date": "11 Jan 2017", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2016", "Interview Descriptions": "4 interviews that lasted at least 2 hours each. I interviewed on the phone and through Skype. I also interviewed with the direct manager, and human resources. I suggest you plan your day around the day of the interview since it took so long.", "Interview Questions": "Why MGH?"}, {"date": "12 Sept 2017", "title": "Senior Project Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Burlington, MA) in Aug 2016", "Interview Descriptions": "I applied directly to by gmail to a Human Resource Person in August . She replied  7 days later . After reviewing my resume, the HR person thought I was a good candidate and set up a phone screen. The interview was arranged via email for the following week.", "Interview Questions": "It was a phone interview. I discussed the nine years of project experience I had had thirteen years ago in depth. I also discussed my recent 9 months of project experience."}, {"date": "27 Feb 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2016", "Interview Descriptions": "There were a couple of phone interviews, and because I was located far away, they were able to let me do a Skype interview instead of paying for me to come in.", "Interview Questions": "Tell me about a time when you had to manage multiple projects at a time, and how did you handle that?"}, {"date": "5 Apr 2018", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital in Jul 2016", "Interview Descriptions": "HR department will contact you and conduct a brief phone interview. If HR thinks you are a great candidate then they will set up an in-person interview with the nurse manager of the unit applied for.", "Interview Questions": "What do you do now for work? Why are you looking to leave current employer?"}, {"date": "12 Jun 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2016", "Interview Descriptions": "The application was accepted through email or online. There is short interviews with PI and lab members. Then, scientific presentation for the unit members.  The presentation time is about 1 hour including question and discussion.", "Interview Questions": "Why did you apply?"}, {"date": "29 Jun 2016", "title": "Operations Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "Must have open availability, rotating shift is the norm. Remember to dress professionally, show respect, and have a positive outlook. Obviously, it is like most interview processes with the employer trying to get to know you as a potential employee. So be prepared to answer questions about yourself and your future plans.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Jun 2016", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2016", "Interview Descriptions": "Submitted a cover letter and resume on hr website, contacted by project director by email, spoke with director over the phone and came in to the office to interview twice", "Interview Questions": "Where do you see yourself in the field?"}, {"date": "12 Aug 2016", "title": "Data Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in May 2016", "Interview Descriptions": "Had multiple interviewers. The reactions seemed a bit mixed. They claimed they wanted someone more towards financial instead of research but kept asking about research. Asking too much of the position; data analyst plus programmer although position is for an analyst.", "Interview Questions": "What was a time you had to defend your position and how did you do it?"}, {"date": "17 Apr 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Interviewed by the office manager, the director of the practice, three nurses, and then I was called by HR, and offered the position. I was offered less money by HR than discussed in the interview. I called the office manager to question the change in what was discussed? She took care of the issue and I was given what I was initially offered.", "Interview Questions": "What I brought to the table? Why me?"}, {"date": "7 Apr 2016", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very straight forward interview -- met with the nurse manager on the unit. They look to hire nursing students or long-term PCAs. We met for 20-30 minutes and discussed my experiences with patient care.", "Interview Questions": "Why MGH?\r\nTell me about a difficult patient situation you had to deal with?"}], [{"date": "21 Apr 2017", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2016", "Interview Descriptions": "I met with the financial and administrative director first thing in the morning. Afterwards, I met with the Principle Investigator of the lab and finally all of the lab members", "Interview Questions": "What is your biggest weakness/ strength? What is a obstacle that you faced in your last job that you overcame?"}, {"date": "8 Feb 2018", "title": "PSC II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2016", "Interview Descriptions": "1 interview after being referred by a friend to bulfinch temp, started as a temp and applied for a perm position after one year and got it. Very positive people with very high standards.", "Interview Questions": "good/bad qualities"}, {"date": "19 May 2016", "title": "Patient Services Coordinator/Intake Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital in Apr 2016", "Interview Descriptions": "Was contacted via phone by the Hiring Manager who was very nice. Set up an interview for a few days later. Interviewer seem very unprepared and barely asked me any questions. She kept asking what questions I had, and I asked many--but still she asked me very little. Then, she had me meet with the other intake coordinators who were very nice. I then back went to her office and she told me there would be a second round of interviews the following week. The manager never followed up with me.", "Interview Questions": "Tell me about yourself."}, {"date": "20 Mar 2016", "title": "Patient Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very nice, went into the office. My interviewer was very nice and talked about how professional mgh is and it is special at the forefront of care and is the number one hospital. Asked questions about my experience working and experience and other parts of my resume. It is an intense place.", "Interview Questions": "Why MGH?"}, {"date": "8 Aug 2018", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2016", "Interview Descriptions": "Interviewer are doctors and software engineer. Even though some of them have no idea about technical term but they still be very friendly and ask what they really want I do for them.", "Interview Questions": "Tell us about yourself."}, {"date": "19 Jul 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2016", "Interview Descriptions": "First I interviewed via phone with HR. Following that, I received an email from the manager on the unit I applied for which stated different times to set up an interview. Interviewed with the manager and then toured the unit. Within 1 week, I heard back from HR stating that I got the job which is when I decided to move forward with the offer. From the sending in my application to starting the job took about 1 month.", "Interview Questions": "Why do I want to work for MGH? "}, {"date": "21 Mar 2017", "title": "Clinical Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2016", "Interview Descriptions": "I interviewed with 3 people, it was a very casual meeting. They asked me some hypothetical scenario questions and about my experience, as well as future career goals. They were transparent with expectations and are very interested in timelines of how long employees will stay.", "Interview Questions": "How to handle uncomfortable situations"}, {"date": "14 Feb 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "The interview process was a positive one and quite simple. There were no intimate questions regarding how I would handle a bad situation or positive situation. They were nondiscriminatory and gracious. I was called for a second interview and received a phone call telling me that I was accepted for the job.", "Interview Questions": "Can I file. Am I computer savvy. Can I handle the commute into Boston. Am I available right away."}, {"date": "24 Feb 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2016", "Interview Descriptions": "sent in resume ~ 3 months ago..rec'd phone call from HR recruiter..was set-up for face to face interview with 2 directors, 5 staff members and 2 lead CM. was told by HR they would get back to me in a few days post interview but it is a month later, and, have not heard back either way..lead CM during interview thought I may have to come back and shadow another CM before they decided.", "Interview Questions": "What type of position are you looking for..describe your previous work experience. what type of CM model did you previously work in."}, {"date": "24 Apr 2019", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2016", "Interview Descriptions": "The interview itself was fairly long, but the supervisors were purely seeking if you’d be a good fit for the team and if you maintained loyalty in your career. It was basically a personality interview!", "Interview Questions": "What is a MCV?"}], [{"date": "18 Mar 2016", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2016", "Interview Descriptions": "I emailed the director of the laboratory myself after applying to the job online.\r\nThe job description said that it had a preference for a candidate with a Master's Degree, thus I qualified as a good candidate for this position, and thought that the compensation would be reasonable and parallel to the requirements that they had put on the job description.\r\nThe lab PI thought I was a good match for the position, and told me to come in for an interview.\r\nThe administrator scheduled the interview for me 2 weeks later, and I interviewed with 5 people one on one , on the same day for about 3 hours. Even though the interview process was intense, it went well. They asked for my references, I send them the references on time. I waited  6 weeks to hear back from them, where they offered me the position, and was told that the HR was going to be in contact with me. A week after the HR didn't reach out as of yet, so I had to get in touch with hiring manager once again. Finally HR called me and when they did they had all the wrong information, and were making me an offer for a different part time position. I had to wait another week until they clarified things out with the hiring manager , and then I was contacted again, and the offer that they made  for a position that is within the range of $45K, was $31,900, and this apparently was based on some calculations the HR did. I had applied to similar positions in hospitals where they didn't even require or prefer a Masters degree , and the offer was 14 thousand dollars higher, at least. Anyways I told the HR, I would get back to them the next day, and when I called the next day to decline the offer, the HR now said offer was $31,200. I do not know what was going on, but there was no consistency, and the whole process was certainly not a positive experience.", "Interview Questions": "Tell us about a previous experience where you had to resolve a conflict with your supervisor?"}, {"date": "21 Jan 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital in Jan 2016", "Interview Descriptions": "The interview process was relatively quick and easy. I applied online and heard back within a week. Had an interview over Skype with two CRCs who were very friendly. They asked about my previous research experience, my interest in their Center, and some behavioral-type questions and about future goals. Types of questions asked: Why do you want to work at MGH? Tell us about yourself, your research. Tell us about a time you experienced a conflict at work and how you resolved it. What do you do for fun?", "Interview Questions": "Why do you want to work at MGH? Tell us about yourself, your research. Tell us about a time you experienced a conflict at work and how you resolved it. What do you do for fun?"}, {"date": "20 Mar 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2016", "Interview Descriptions": "Sent them my resume and heard back within a couple days. They asked to schedule an interview for about a week later. The interview was pretty easy. The CRCs mostly wanted to go through each of my research experiences and the skills that I learned from them. They also went over their general responsibilities for the various studies that were going on in the lab. I met with the PI last. My conversation with him was about the same as the one I had with the CRCs, but we also went into my academic background, interests, and plans for the future.\r\n\r\nAfter the interview, they told me the process would be finalized in a few weeks, although it ended up taking 2 months. They asked for my references and HR contacted me about a formal application and references.", "Interview Questions": "Tell me about your research experience. Tell me about your academic background. When will you be able to start? Do you have any questions about the lab?"}, {"date": "28 Dec 2015", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Email followed by phone call. Came in for interview to the lab. Discussed skills and fit for role. It was a pretty straight forward process. I am sure it is different for every lab. Salary and terms laid out. Got job on same day.", "Interview Questions": "How much lab experience do you have in a lab"}, {"date": "30 Dec 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2015", "Interview Descriptions": "3 hour in person interview, there was no phone screening. I met with 6 different people and overall the interview was pretty laid back. Was able to ask a lot of questions. There were no technical questions, all basic resume interview questions.", "Interview Questions": "How do you take instructions?"}, {"date": "24 Nov 2019", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2015", "Interview Descriptions": "Short, simple to the point. Interview is more of an acclimation and getting to know you, seeing if you're a good fit for the job. It felt more casual and comfortable.", "Interview Questions": "What do you do in certain emergency situations? (Such as patient coding and you're in the room.)"}, {"date": "6 Dec 2015", "title": "Registration Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 weeks. I interviewed at Massachusetts General Hospital (Medford, MA) in Nov 2015", "Interview Descriptions": "Takes a while to get called for interview.  It's a bit of a long process.  They are very nice and professional.  Job and training process are explained in detail.  Once you get an interview it's an easy process.", "Interview Questions": "Why did you choose MGH?\n\nAre you flexible as to days and hours?\n\nWhat salary are you looking for?"}, {"date": "10 Dec 2015", "title": "Clinical Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2015", "Interview Descriptions": "First I had a phone interview and then I was invited in for in-person interview with project coordinator and his manager. We discussed my resume and thoroughly went over the requirements for the position, as well as room for growth within the position. They both asked typical interview questions", "Interview Questions": "Describe a time when you had to deal with an unruly customer or patient"}, {"date": "9 Dec 2015", "title": "ECare Nurse Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2015", "Interview Descriptions": "I applied online and received a call from HR. She asked me several questions and scheduled me to meet with the nurse manager. I got there and she didn't know I had an interview or had a copy of my resume. The interview went great and I got a tour of the unit. She called HR immediately after we were done. I didn't hear anything for a week, then got an email at 10pm saying they chose someone else. I honestly think they forgot about me all together.", "Interview Questions": "Why are you interested in this type of nursing?"}, {"date": "16 Dec 2015", "title": "Clinical Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2015", "Interview Descriptions": "Great interview. Very thorough with description of job role. Easy-going rapport. Was asked about skills obtained at previous jobs and what I have learned through academics. I shadowed and it was a very nice and diverse group.", "Interview Questions": "What can you bring to the department"}], [{"date": "14 Oct 2015", "title": "Research Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "I received an email to schedule a phone interview, as I was out of state. The phone interview with the Principal Investigator (PI) went well, so I emailed him the next day thanking him and expressing my interest in the position. About a week or two later, I followed up and we scheduled an in-person interview. I traveled 7 hours and the interview lasted about 3 hours. I was shown all the labs. I returned home, thanked the PI, and expressed my interest in the position once more. About a week later, I received an email stating that I was being offered the position. A week or two later, I received a phone call from the HR department stating that someone else had been hired who had more experience than I did, and who requested a significantly smaller salary offer. I was shocked by their lack of professionalism.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "9 Oct 2015", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Easy going and very general. Met with the boss first. Then the director followed by all the different post-docs there. Everyone described their projects and their experience in the lab.This was followed by them asking me about my project, my interests. The post docs also showed me around the lab. This was followed by lunch.", "Interview Questions": "What motivated you to come to this lab?"}, {"date": "8 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I did my interview over the phone. It lasted about 45 minutes. The interviewer asked questions mostly about why I was interested in the research, my previous research experience, my experiences in dealing with challenges, strengths and weaknesses, etc. No questions that were particularly out of the ordinary. I had the opportunity ask many questions about the lab at the end, which was helpful because the posting did not contain much detailed information.", "Interview Questions": "Give me three words your best friend would use to describe you."}, {"date": "16 Nov 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2015", "Interview Descriptions": "I applied online for the position, and received an email around a week later to set up a time for an in-person interview with the co-investigator for the lab. The interview was fairly standard: she had a copy of my resume and asked for more information regarding my education and previous experiences, asked the usual behavioral questions (where do you see yourself in 5 years, what are your strengths, etc.), and at the end, she went through all the duties a RA would be responsible for and gave a short tour of the lab. The entire interview took around 30-40 minutes. She emphasized the need to commit to the role for 2 years and told me she would get back to me within a week if I was selected for a final interview with the PI and RA that was being replaced (he chose to take a different career path). I received another email a little under a week asking to come in again for the final interview. I first met with the PI, who once again asked me questions about my resume, although more in depth this time, and went through some behavioral questions. A few of the questions overlapped with the last interview, a few were new. Still, none of the questions were unexpected at all. After about 30 minutes, she sent me to another room to interview with the current RA of the lab. He generally asked questions regarding my personality (what do you do when you encounter a problem, how do you deal with stress, etc.), and this lasted around 30 minutes as well. I was told I should get either an offer or rejection in 1-2 weeks, and after not having heard for over 2 weeks, I emailed them only to find out they had filled the position. I felt that all 3 interviewers were amiable and pleasant to talk to, and while I'm disappointed I didn't get an offer, the interviews were painless and enjoyable.", "Interview Questions": "Are you comfortable with having occasional evening/weekend hours and accommodating your schedule accordingly?"}, {"date": "28 Nov 2015", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Massachusetts General Hospital in Oct 2015", "Interview Descriptions": "Emailed for an interview invite which was very brief (30 min). Talked about my background and what my future interests are. PI also talked about what projects they needed help with and expectations of the role. No phone interview. I had another interview with another lab in the same department (which I didn't get an offer for) but your hiring process experience will be highly dependent on the PI and the lab. Pay is not great but the rich environment makes up for it. You're surrounded by smart and great people (and equipment) \r\n\r\nApplied in early Sept, emailed back in mid Oct, started in Nov.", "Interview Questions": "What kind of data analysis did you do for your project in undergrad?"}, {"date": "19 Apr 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Massachusetts General Hospital (Boston, MA) in Sept 2015", "Interview Descriptions": "I registered for orientation, completed an online application (where they asked for staffing preferences), attended orientation, then signed up for an interview slot at orientation. To get the interview slot you really want, I recommend sitting in the front row at orientation. During the interview, if you can commit to a pre-designated time slot, you will get the position. With that said, after the interview, it was nearly 3 weeks later before I heard what my start date would be.", "Interview Questions": "What experience do you have working with kids?"}, {"date": "12 Dec 2017", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Sept 2015", "Interview Descriptions": "The interview process took about an hour. With questions from the director . After the interview questions. You go through each classroom; infant, toddler and preschool and spend some classroom time to see if your capable of working with kids.", "Interview Questions": "How would you greet the children in the morning? "}, {"date": "25 Sept 2015", "title": "Research Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital in Sept 2015", "Interview Descriptions": "Very relaxed and great enviorment. I enjoyed the atmosphere and everyone who I interviewed was very relaxed. They asked me what I want to do in my future. I responded.", "Interview Questions": "what do you see yourself doing in the future?"}, {"date": "21 Aug 2015", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "There was a phone interview initially. For the in person interview it began with a one on one with the PI, followed by a one on one with a post-doc, and then a group meeting with the other technicians.", "Interview Questions": "I was asked what I would like to achieve while working in their lab."}, {"date": "24 Sept 2015", "title": "Research Technician II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital in Aug 2015", "Interview Descriptions": "Standard Interview Process. Applied online on their website. 2 weeks later directly contacted by Investigator. Phone Interview followed by on site interview. Process was easy and straightforward. Met with few members of lab. general and HR based questions and not much technical. Visited the lab. The job duties are good and lot of opportunities to learn. However, they offer very low salary.", "Interview Questions": "What are your strengths ?"}], [{"date": "23 Jul 2015", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Had a phone interview first- only about 10 minutes-rapid fire but normal questions. Interviewers were not very personable or friendly. was invited for in person interview but was unable to attend my assigned time (due to it being during the middle of the work day) and they were unwilling to reschedule.", "Interview Questions": "what is your management style?"}, {"date": "6 Aug 2015", "title": "ECare Nurse Residency Program- Sept 2015 Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2015", "Interview Descriptions": "Applied online, HR contacted me two weeks later for a phone interview. Basic questions about myself and why I wanted to work there. Scheduled an interview with the nurse manager a few days later. The in person interview consisted of her explaining the job, tour of the unit and two questions. This is a new grad position so there wasn't a lot of experience to talk about there. HR called me two hours after my interview asking for 4 references which were done online via skills survey. Never heard back for two weeks, called HR asking for an update and she updated me that I did not get it. Would have been nice to get a rejection email or something.", "Interview Questions": "What would your peers say about you? Whats a challenge you had to face? "}, {"date": "4 Aug 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2015", "Interview Descriptions": "Heard back around a month after I applied for the job. Had a in-person interview the next week. The interviewer either already had a candidate she wanted to hire or was just not prepared for the interview. Literally just asked 2 general questions - nothing specific pertaining to whether I would be a fit for the job, and asked her intern, who was in the room with her, if she had any questions for me. I ended up doing the asking. Was told she would get back to me the next week but never heard back. Overall, a frustrating experience.", "Interview Questions": "Tell me about yourself"}, {"date": "13 Aug 2015", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2015", "Interview Descriptions": "The interviews were individual in  a round robin form with some of the PIs and research fellows. There were 6 candidates. First part was a tour of the lab facilities, then interviews then finally all 6 candidates met with the head of the lab and listened to him speak. Was asked for references, but did not recieve an offer.", "Interview Questions": "What are you future research interests?"}, {"date": "16 Nov 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2015", "Interview Descriptions": "for the ecare residency program I sent in my resume was contacted by HR, then sent to interview w/ a director of a unit that I had interest on.", "Interview Questions": "What can I bring to the table that other candidates do not."}, {"date": "19 Nov 2015", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2015", "Interview Descriptions": "Called by human resources, interview set up through human resources, met directly with the nurse manager. interview was standard with basic interviewing questions. have questions of your own. no tour of unit.", "Interview Questions": "what are your future career goals/plans?"}, {"date": "4 Nov 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2015", "Interview Descriptions": "I received a call from the HR that my resume is selected. There was 2 rounds of onsite meeting. 1st meeting I visited the place and met the team. Team interviewed me for about an hour. I got clear for the second round and was informed about the same in 2 weeks. Before scheduling second round I was asked to submit 2 recommendation letter. For my second interview round I met the manager. The interview went on for 1 and half hour. I got cleared and was offered a job. The entire processing took 3 weeks. It was a long process. There was a lot of delay from HR side.", "Interview Questions": "My past and recent work experience, my graduate coursework, my interest in working in their lab. There were lot of behavioral questions as well to check my attitude towards work, my personality to work with others, what were my job expectations, how can I contribute to the team."}, {"date": "10 Aug 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2015", "Interview Descriptions": "Laid back, Open ended questions, Asked a lot about my previous experience as a CRC, Ended up chatting about other things aside from the role. Pleasant experience with the PI and the program manager.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jun 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2015", "Interview Descriptions": "Applied online, received an email about 5 days later & scheduled a phone interview. After the call, I heard back from them to schedule an in-person interview. Took about 2 weeks total.", "Interview Questions": "Describe a difficult situation you've been in & explain how you handled it."}, {"date": "1 Mar 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2015", "Interview Descriptions": "not bad, took a week. trainings and hippa compliance. they had you do a phone screen and an in person interview. not too hard. took a week at max length", "Interview Questions": "what are your strengths"}], [{"date": "28 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2015", "Interview Descriptions": "Applying was through the Partners job portal. Applied to many positions with resume and cover letter (got interviews for less than 10% of applications). Was called into the first interview and met with the current coordinator, and 2 other members of the team. About a week later, I got an email request for a second interview and met with the manager and the PIs and recieved the job offer the next day. However, it took about 2 weeks to get the offer from HR.", "Interview Questions": "What is your method of organization?"}, {"date": "30 Apr 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Phone interview, then asked to provide 3 references and writing samples, then was called in for an in-person interview.Phone interview, then asked to provide 3 references and writing samples, then was called in for an in-person interview.", "Interview Questions": "How much GSI training do you have/ "}, {"date": "5 Sept 2015", "title": "Animal Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2015", "Interview Descriptions": "There's a phone interview and an in person interview. After I applied, it took a few days to get the phone interview, then about a month to get the in person interview. They told me I got the job about 2 weeks after the interview.", "Interview Questions": "Describe a situation in which you had to compromise with someone on something you disagreed with."}, {"date": "29 Jun 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2015", "Interview Descriptions": "I sent a resume and cover letter to the principal investigator, who responded almost immediately, offering me a call, and if it went well, an in-person interview.  The call was relatively informal, mostly one of the current coordinators telling me about what their lab did, with a few questions about my career goals and why I wanted to work there.  After the call, I was offered an in-person interview, which was pretty short, mostly just fit questions.", "Interview Questions": "What experience do you have working with other people, specifically children?"}, {"date": "19 Oct 2016", "title": "Grant Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2015", "Interview Descriptions": "I applied to the position through the Partners career portal in October and didn't hear from HR until April. HR screened me with a phone interview and then I was asked to return for an in-person one on one interview with the hiring manager and a few others. After that, it moved quickly. The HR phone interview was standard behavioral questions and the in-person interview had more role-specific questions.", "Interview Questions": "Q: What experience do you have that would make you well suited for this role? "}, {"date": "2 Jul 2015", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital in May 2015", "Interview Descriptions": "I was contacted for an onsite interview by an assistant of the lab and since I was unable to drive up to Boston that week I was given the option of a Skype interview. The interview was about 30-45 minutes in length and not very difficult it had some detailed questions pertaining to skills/experience and more behavioral questions, overall it seemed to have gone very well and I ended it feeling confident in either a follow up interview or perhaps even an offer. 2 weeks after the interview I followed up with the lab with an email to see the status of the position. In total it has been over 4 weeks since my interview and I still have not heard a response, which is very unprofessional, especially when it takes 2 seconds to send out an email with a simple update.", "Interview Questions": "Questions vary for each lab you apply to."}, {"date": "21 Apr 2015", "title": "Bulfinch Temporary Employee - Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "I transferred from a Full-Time employee to a Temporary employee so that I cold finish graduate school. The transfer was uneventful and was easy because I had 6 years of service. Mike knew me and was responsible for filling roles with an employee that he could count on. After my first job, he felt comfortable placing me in roles in or near executive suites at MGH and BWH.", "Interview Questions": "What would you like to do? Where would you like to work?"}, {"date": "19 May 2015", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2015", "Interview Descriptions": "15 min personal introduction (both sides), 45 min technical questions. There were about 5 technical questions, one programming , the rest stats/ML like what is cross-validation or how do you control for overfitting in regression.", "Interview Questions": "Given an existing set of purchases, how do you predict the next item to purchase of a new basket?"}, {"date": "28 May 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2015", "Interview Descriptions": "I was asked to speak in detail about my past experience and was asked questions about my resume. They had questions prepared, but it ended up being more of a conversationally structured interview. They were already familiar with my experience and had clearly gone over my resume so we mostly discussed specifics. I was interviewed by several people in succession over the course of a few hours, each meeting was 1 on 1. My interviewers spoke a lot about the project and I was given a tour of the lab after we spoke, then I met other people in the lab. I was offered the position within 24 hours after the interview.", "Interview Questions": "What interests you about our project?"}, {"date": "28 Feb 2016", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2015", "Interview Descriptions": "I applied for an NIH fellowship and needed a research mentor. I applied to the laboratory of my choice and was given a phone interview. After which, I was asked for a site-interview where I toured the lab and spoke with all the lab members individually.", "Interview Questions": "Why do I want to work in the laboratory? They also wanted to know some details about projects lifted on my CV. They also required a 45 minute presentation of your previous research."}], [{"date": "27 Jun 2015", "title": "CLA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2015", "Interview Descriptions": "The interview process was nice. They allowed for me to interview with the hiring manager, current employees, and the department director all in one moment (which is a lot better than being called back for every step). Everyone was very kind and they were very prompt with their responses.", "Interview Questions": "What attracted you to this position? What skills can you bring to the position? What are your career aspirations and how would this position help you further those goals? How did you hear about this position? Tell us about yourself and where you see yourself in 5 years. What would you describe as your strength?"}, {"date": "21 Apr 2015", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital in Mar 2015", "Interview Descriptions": "Applied online and got a phone call interview three days later that lasted around 30 minutes (with two interviewers), asked general questions in regards to resume, skills, and education background. Then got an in-person interview after two weeks and heard back a couple days later. Typical interview questions and orientation information about their lab, nothing too surprising.", "Interview Questions": "Tell me about this particular project- what were your roles in it?"}, {"date": "2 Apr 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2015", "Interview Descriptions": "Very friendly, cared very much about what type of person you are not so much can you answer technical questions.  Do ask some questions pertaining to past experience, but they try to get a feel for who you are versus can you recall a specific protocol.", "Interview Questions": "What I did on my free time."}, {"date": "4 Jun 2015", "title": "RN- Travel Contract Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2015", "Interview Descriptions": "Phone only from Dept. Manager. The manager described the layout of the department, staffing ratio, professional staff available and specifically MDs of all levels on site at all times,  as is typical of teaching hospital. Gave me available shift options and options of number of hours per week available.  Stated a lot of positives about position to consider and flexibility of nurses to change schedule as needs vary.", "Interview Questions": "Can you handle a fast paced, high patient turnover environment"}, {"date": "29 Feb 2016", "title": "Clinical Trials Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (East Boston, MA) in Mar 2015", "Interview Descriptions": "I went through two rounds of interview. One of their regulatory affairs managers had a phone interview with me then I received the onsite invitation. The interview panel members were all very friendly, but I felt they were looking for someone has more integrated knowledge in all areas of clinical trials.", "Interview Questions": "use one word describes yourself"}, {"date": "24 Jun 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (New Haven, CT) in Feb 2015", "Interview Descriptions": "12 minute interview with senior management that involved asking questions about MGH, how you could contribute, and what you look forward to getting out of the internship. There was also an opportunity to ask one question at the end of the interview.", "Interview Questions": "Why are you interested in MGH?"}, {"date": "9 Nov 2016", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2015", "Interview Descriptions": "Skype interview with the Principle investigator is the first things happens if you are not in the US. Sometimes you will be required to come to the laboratory and have interview with all of the lab member entire of day and give a presentation in the lab meeting.", "Interview Questions": "Mostly technical questions"}, {"date": "12 Jan 2015", "title": "Pharmacy Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "1 interview and it was fairly easy with straight-forward questions and interviewer was nice enough and was not trying to throw you off with unexpected questions or scenarios, typical interview", "Interview Questions": "Can you handle a high volume environment?"}, {"date": "9 Jan 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I applied online and then got called in for an interview. The interview was about an hour long and they asked questions mostly about my past experiences and research skills. Everyone was very friendly. They are not making a decision immediately but said they will get back to me in a few weeks.", "Interview Questions": "no really unexpected questions"}, {"date": "31 Mar 2015", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2015", "Interview Descriptions": "Qualified for a telephone interview after submitting a cover letter, resume, and writing sample. Spoke in a conference-style manner with the project head and a current coordinator. Both took turns asking questions. Very open-ended.", "Interview Questions": "Tell me about yourself.\r\nTell me about a prior research experience.\r\nWhy our lab?"}], [{"date": "16 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital in Jan 2015", "Interview Descriptions": "15 min Skype interview with all possible preceptors (about 8 of them). General questions about motivation and past experiences. They will interview about 10 people. Pretty high chance of getting the job once got an interview.", "Interview Questions": "why MGH, area of interests"}, {"date": "26 Jan 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2015", "Interview Descriptions": "Great. The process was short and very fair. I was told immediately after the interview what the outcome was. My interviewer was very polite and respectful. They basically just wanted to know what kind of project i wanted to undertake. They were very polite an professional. The interview started with me sitting in on a group meeting then meeting one on one with the team leader.", "Interview Questions": "Describe the project you want to do"}, {"date": "24 Nov 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2014", "Interview Descriptions": "it was supposed to be a phone screen because i was oversees. but ended up to only phone call because of internet connectivity problem from my side. we scheduled a few days before. interview was done on-time.  I was asked to talk about a bit from myself and a few questions from my CV and my previous research projects. then I was told about what they are doing, what responsibilities i would have there, with whom i would work and i also had the chance to ask questions. the interview was very patient (as I told there was internet problem from my side and I thought it might be affect negatively on the process of the interview)", "Interview Questions": "a brief summary of myself and research experiences, a brief summary of their projects and my role over there"}, {"date": "11 Nov 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2014", "Interview Descriptions": "Had an initial phone screen with the Senior Project Manager in charge of the project. A week later I was called in for a three person Panel Review with Senior Management. They made a quick decision and I heard back from the Recruiter the same day after the final interview.  It took about 3 weeks from the initial interview to a job offer.  It took another week to complete the full background check and start employment.", "Interview Questions": "Describe a situation of how you handled conflict in  your previous position"}, {"date": "18 Apr 2015", "title": "Patient Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2014", "Interview Descriptions": "It was very straight forward and simple. It took only 1 day. It was well organized and all questions asked were related to the position. I gave a skill test after reading the job duties which helped me to get familiar with my possible responsibilities at work. The interviewer was very considerate and gave me enough time to respond. Also answered my all questions.", "Interview Questions": "1.Why do you want to do this job?\r\n2.Do you have any experience working in ER?\r\n3.What are your 3 strength and 3 weaknesses?"}, {"date": "30 Sept 2014", "title": "Staff Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "applied online, 2 weeks later phone interview, 1 week later in person interview with manager and staff, online reference check, offer extended (pretty basic things as with any interview)", "Interview Questions": "all general basic questions"}, {"date": "22 Oct 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital in Aug 2014", "Interview Descriptions": "Interviewer asked me about my past work and projects that I've worked on. She described the position and the skills that she was looking for. She also outlined the benefits and positive attributes of the department.", "Interview Questions": "What skills do you bring to the job?"}, {"date": "2 Apr 2018", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2014", "Interview Descriptions": "Went through a phone interview then an in-person interview with three people, 1-on-1 for each. We discussed my research experience and understanding, reasons for entering the field, and plans for the future.", "Interview Questions": "Please explain your previous research experiences and techniques."}, {"date": "25 Jul 2014", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very friendly. Had 2 interviewers at the same time. Started off by explaining their backgrounds and current projects. Went in depth about what the position required. Asked about my background, education, experiences, and what attracts me to the position/why would I be great for the position. Ended with a tour of the office. Also requested 4 references.", "Interview Questions": "At the end of the interview, I was asked to send a writing sample."}, {"date": "3 Apr 2015", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2014", "Interview Descriptions": "Applied online, then had a skype interview. Got offer. It was kind of sketchy since they literally gave me three days to decide whether to take it or not should have been a RED FLAG in my mind, but unfortunately I was a stupid recent graduate who panicked and accepted the first job I got.  if the interview process is this easy, there's bound to be a catch which I later found out (crappy benefits, low salary, bad work environment). Moral: See what else is out there and carefully investigate the position and lab before making a choice (as in actually talk to every person in the lab, this one lab hid away all the sad angry people so it looked like it was functional and happy). ALSO, note that other hospitals in the area have benefits that match what this place has to offer and the pay is often much better.", "Interview Questions": "Tell me about your previous research experience"}], [{"date": "10 Aug 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2014", "Interview Descriptions": "It was a very easy going atmosphere. the  manager was very down to earth and welcoming. she was very nice at explaining about the unit and what is expected of me", "Interview Questions": "Tell me a time, you went above or beyond for a patient?"}, {"date": "27 May 2014", "title": "Billing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Interviewed by 4 to 5 managers. Good process, great interviews, everyone was very pleasant. Questions are generally based on experience/background, behavioral based questions, and situational based questions. The interviewers (managers) have to all agree on a particular candidate in order to extend an offer.", "Interview Questions": "Questions are pretty much straight forward, aside from standard behavioral questions, nothing out of the ordinary if you can speak to your background and the job for which you are being interviewed."}, {"date": "5 Jul 2014", "title": "Clinical Research Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital in May 2014", "Interview Descriptions": "The interview and hiring process was fairly painless, with a fast reply rate.  The current clinical research assistant was very friendly and responded to my email. even gave me feedback on my interview when asked.", "Interview Questions": "the most difficult question I had was what would I do if a patient involved in my study for 20 years decided to quite what would I say"}, {"date": "2 Mar 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2014", "Interview Descriptions": "I was contacted by phone for a phone interview then met in person with two people in the department. The first interview was more general questions about why I wanted to work for the organization and the second interview was more specific about things on my resume such as explaining my research project", "Interview Questions": "Describe a difficult situation and how you handled it"}, {"date": "21 Jul 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2014", "Interview Descriptions": "Had to wait awhile after submitting resume and application, but once I got a call back, the process was straight-forward. The interview was not too difficult, more just about getting to know the hiring managers.", "Interview Questions": "Why do I want the position?"}, {"date": "29 Apr 2014", "title": "Senior Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It took about two weeks after submitting my application to get an email from lab supervisor requesting a phone interview. The phone interview was brief and went well, so I was invited to come in for a face to face interview a week later. The next week I was offered the job and accepted, however it takes a month for HR and background checks to be completed. So start date is a month after job acceptance. Which is a bit inconvenient.", "Interview Questions": "How do you troubleshoot and give me an example of a situation. Walk me through it."}, {"date": "26 Apr 2014", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "I submitted an application and heard back with a request for an interview about 3 weeks later. We scheduled an interview for the following week. The first round was about 45 minutes, with 2 employees who are of the same title as the job for which I was applying. They first asked me about myself and my resume and then moved into a section of behavioral-based questions. It was pretty relaxed and they were friendly. We then proceeded with an interview with the department head, with whom I spoke about my resume and general life (personal, school, and professional) with. It was an overall good experience but I withdrew my application because the salary was below what I could really accept.", "Interview Questions": "What are your salary expectations. Tell us about a time you failed and what you did about it. Several behavioral based questions but mostly standard in that respect. "}, {"date": "20 Apr 2014", "title": "Programmer/Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "It took a little under two months for them to respond to my application. They contacted me via email and set up a phone interview for the next day, followed by a 4-hour in-person interview series a week later. The interview series was 8 30-minute interviews with the various faculty/staff. I appreciated only having to go in-person once. After that, I waited a week for a decision.", "Interview Questions": "They quizzed me thoroughly on my knowledge of programming topics."}, {"date": "17 Apr 2014", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Standard interview process once called to interview.  Really difficult to get an interview here, though. They receive about 350K applications hospital-wide per year and hire less than 3,000 each year.", "Interview Questions": "Depends on the PI"}, {"date": "22 Apr 2015", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2014", "Interview Descriptions": "Phone screen with Human Resources then about a week and half later a call for a physical interview.  After the physical interview with 5 people they called two weeks later and offered me the position.", "Interview Questions": "Why do you think you would be a good fit"}], [{"date": "11 Jul 2016", "title": "R&D Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2014", "Interview Descriptions": "HR manager interview, based on CV and previous conversation over the phone. A presentation was required about previous work, then I met the whole group and. Result was given within 2 weeks. Things were smooth and efficient.", "Interview Questions": "Why do you want to work with our company?"}, {"date": "23 Mar 2014", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Phone interview, 20min, pretty standard and chill - the interviewer asked about what attracted me to the position, what my qualifications, and career outlook. Most of it was me asking questions about the position (what does a typical day look like) and learning about the different aspects of the job.", "Interview Questions": "What made the position stand out to you?"}, {"date": "3 Mar 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I applied to a different position and my application was forwarded to another person who had a postdoc position open. He spoke with a former coworker of mine whom he knew, and then contacted me.", "Interview Questions": "None really"}, {"date": "14 Oct 2015", "title": "Senior Project Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2014", "Interview Descriptions": "The process was Lengthy and included Many rounds. Fairly informal interviews. Most of the interviews were 30 minutes and intended to get to know me. Low pressure environment , but interviewers asked some questions about my interest in the work. Most people had not read my resume so bring copies. There wasn't extensive time to ask questions so come prepared with your top 2-3 questions.", "Interview Questions": "Why MGH? \r\n"}, {"date": "4 Aug 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2014", "Interview Descriptions": "It was straightforward. I was contacted by phone to come in for an in person interview where I met my future coworkers, went on a tour and spoke with the head of the departments to discuss my qualifications and interests. Was called back a few days later with a job offer.", "Interview Questions": "Why would you like to work here?"}, {"date": "13 Apr 2014", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Massachusetts General Hospital in Mar 2014", "Interview Descriptions": "I had two one-on-one interviews and an interview with the existing CRCs.   One of the individuals I interviewed with one-on-one was rude and condescending, barely made eye contact, and even checked their e-mail during the interview.  I was also asked an inappropriate question.  The other interviews were okay, and they gave me a good idea of what the job would be like.  However, it did not seem like a friendly work environment overall.", "Interview Questions": "Interview questions were predictable and not difficult."}, {"date": "26 Feb 2014", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "worked with 1 PI. and other 3 lab members...Only Interviewd with the PI. How many people interview you Depends on the lab you might work for", "Interview Questions": "N/A"}, {"date": "20 Feb 2014", "title": "Patient Care Observer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Massachusetts General Hospital (Boston, MA)", "Interview Descriptions": "call to schedule interview, scheduled interview than hired", "Interview Questions": "no difficult questions"}, {"date": "12 Feb 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Application, followed by e-mail and Skype interview followed by an 1 day interview day including a 45 min. Presentation.", "Interview Questions": "N/A"}, {"date": "19 Jan 2015", "title": "Bulfinch Temporary Service Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Massachusetts General Hospital in Feb 2014", "Interview Descriptions": "The Bulfinch Temporary Service (BFT) coordinator requested permission to send my profile to a faculty member who needed assistance with submitting several documents that comprise a grant proposal.  The position required experience with ensuring that federal funding agency specifications were met before submitting documents; I have relevant experience.  Upon receiving approval from the faculty member, the BFT coordinator arranged an appointment for us to meet.  The explanations were clear.  On the job, supervision by the faculty member was excellent.", "Interview Questions": "Communication was clear.  The interview and subsequent work was a rewarding experience."}], [{"date": "8 Apr 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2014", "Interview Descriptions": "Research presentations with whole group of researches and director of the department. They ask typical academic questions. Interview with the director of the department was a little intimidating, he only asked a couple of questions and the rest of the time, he kept asking me what can I answer for you. A particular principal investigator asked me illegal questions such as my citizenship and marital status, which I found very disrespectful. However, my direct boss was very nice and approachable and of course very smart. So, I decided to join after they gave me the offer.", "Interview Questions": "What other places are you interviewing at?"}, {"date": "21 Dec 2013", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Very easy. They call you if they are interested in your resume. You do a telephone interview or two, they bring you in for a formal in-person interview, and then they call and let you know if they decide to hire you. Salary is almost always nonnegotiable. They are very tough about that here. Don't waste your time trying to prove otherwise. You are essentially being given the \"gift\" of working at MGH and having it on your resume. That's it.", "Interview Questions": "What was your biggest failure and why?"}, {"date": "15 Dec 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Was contacted a week after submitting my application. Invited in for interview without phone screening. Took two hours; met with four members of the team.", "Interview Questions": "\"Where do you see yourself in five years?\""}, {"date": "2 Sept 2015", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2013", "Interview Descriptions": "Light, informal interview directly with PI, did not have to interview with any HR personnel. The interviewers were scientists and physicians who had obviously interviewed techs and post docs previously, but, having interviewed with professional hiring managers and other HR people for other positions, this was relatively low pressure and actually quite pleasant. They mostly want to get to know you and talk shop about experiences and goals.", "Interview Questions": "Describe a research experience where you solved a difficult problem."}, {"date": "14 Nov 2013", "title": "Medical Resident Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Interviewed with 5 faculty members.  Most were very kind and proud of their program.  They answered questions honestly and provided access to other residents so we could get honest answers about what resident life at MGH is like.  Some interviewers were socially awkward, however.", "Interview Questions": "If you could be any musician, who would you be?"}, {"date": "7 Dec 2017", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2013", "Interview Descriptions": "The Department conducted telephonic interview and then personnel panel interview with technical team. After this selection, it was  followed by interview with Director and telephonic  talk with HR", "Interview Questions": "Technical and managerial"}, {"date": "15 Oct 2015", "title": "Administrative Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2013", "Interview Descriptions": "dinner with current fellows and other candidates the night before the interview. one day onsite interview with a panel of senior leadership. key speakers and leaders are invited to present throughout the day while candidates are escorted to a 45 minute interview. reception at the end of the interview day", "Interview Questions": "Why are you interested in a fellowship as the MGH"}, {"date": "15 Sept 2013", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Applied via company website with resume and cover letter.  Invite to interview.  Interview lasted half a day.  Decision 2-3 weeks later.", "Interview Questions": "Why should we hire you?"}, {"date": "8 Apr 2014", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital in Sept 2013", "Interview Descriptions": "Applied online, and did a phone interview within a week. HR person was very kind, and asked me questions regarding my background, but mostly asked me why I wanted the position. What my best traits were and what qualities/traits/skills I learned in my previous position. They offered me the position a week later.", "Interview Questions": "The questions were all easy. Be prepared to provide scenarios during in-person interview, but overall it was a very great experience."}, {"date": "22 Nov 2013", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Massachusetts General Hospital (Charlestown, MA) in Sept 2013", "Interview Descriptions": "Was contacted directly by PI. Asked to submit references and invited in for a lunch interview the following week. Lasted about two hours. Fairly straightforward questions about my qualifications.", "Interview Questions": "What are your goals in life?"}], [{"date": "5 Aug 2013", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "applied online and was emailed to come in a month late, got a tour of the lab, had two 20 minute interviews with the head scientists in the lab, was emailed for references the next day, and received an offer by the end of the week", "Interview Questions": "Give me an example of your organizational skills"}, {"date": "11 Jan 2017", "title": "Statististician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2013", "Interview Descriptions": "I first got a phone call asking if I was available to speak on a conference call with the team members (~8 researchers). Phone call was about an hour long and I was asked about my current job, previous experience, and asked about technical skills. After that, I had a very small group of team members with a presentation of a previous project I worked on followed by a question and answer session regarding the project.", "Interview Questions": "What was the decision for the modeling technique used?"}, {"date": "23 Jul 2013", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2013", "Interview Descriptions": "About a week after I applied to the CRC position online, I received a phone call from the Associate Director of the Clinical Trials Office and she conducted a brief phone interview and then scheduled an in-person interview.  At the in-person interview I spoke with the Associate Director again and she explained the position in more depth. Most of the questions she asked were the same questions she asked during the phone interview. After speaking with her, I met with a Senior Coordinator (who I would report to) and he asked fairly standard interview questions. Examples include: \"What types of bosses have you worked with in the past?\", \"How would you rate your organizational skills on a scale of 1-10?\", etc. They didn't ask any technical questions and there really weren't any difficult questions. It was a run-of-the mill interview. Both interviewers were pleasant and engaging.", "Interview Questions": "This isn't difficult at all. It's just another example of one of the questions they asked. What's your biggest accomplishment to date."}, {"date": "27 Aug 2015", "title": "CRC II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2013", "Interview Descriptions": "Heard about the opening through school list-serv; submitted the resume directly to the head CRC; received email to set up an in-person interview; interviewed at MGH, toured lab, clinic, campus; heard back within 2 weeks from the head CRC, then from HR.", "Interview Questions": "Tell me a little about yourself. Generic interview questions"}, {"date": "19 Feb 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2013", "Interview Descriptions": "I responded to an online ad on jobs.phds.org for a postdoctoral position.  I explained my research background and interest in the project presented. The researcher in question liked my CV, and then requested my recommendations.  After receiving those, I was invited for an  on site interview.  The interview process consisted of a formal presentation (similar to a dissertation public defense), followed by a short Q&A.  I was then given 1:1 interviews with several other PIs in the group, the department chair, and then a few other postdocs in the lab.  I was given an offer letter a few days later, and accepted a few days after that.  Full time employment began several months later after paperwork and a background check.", "Interview Questions": "The department chair asked me what I wanted to do with my career.  This is the question you have to answer honestly to get the most out of the interview. "}, {"date": "26 Jun 2013", "title": "Research Technologist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Phone interview which lasted 3 minutes. Generally went through your resume and tried to assess whether your skills were what they were looking for. They tell you about their project and you et to ask questions.", "Interview Questions": "How the cells are passages?"}, {"date": "2 Jun 2013", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "Applied to the volunteer program at Massachusetts General Hospital through their website. Signed up for the mandatory orientation session where I chose a date and time for the one on one interview. Positive/typical interview experience was received. I was asked the typical questions such as \"Why do you want to volunteer at Mass. General Hospital?\" \"Tell me about your family...\", etc.", "Interview Questions": "All questions were standard interview questions."}, {"date": "14 May 2017", "title": "Online Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2013", "Interview Descriptions": "Met with employees and three levels of management for a total of five interviews spread on two days. Overall the process was easy enough, but the job description did not match the actual job.", "Interview Questions": "Some technical questions about websites"}, {"date": "7 Jan 2014", "title": "Systems Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2013", "Interview Descriptions": "It was quick and fluid. You meet with members of a few different departments. Not much difficulty question wise.", "Interview Questions": "There was none. Just be yourself and talk about interests that pertain to techonology."}, {"date": "17 Apr 2013", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Massachusetts General Hospital (Charlestown, MA)", "Interview Descriptions": "Applied online through the Harvard portal. Received a phone call next day to arrange for an interview. The interview was 1 on 1 and fairly straightforward. Discussed skills and past experience, career goals, and work hour flexibility. The total process, including lunch with the current laboratory members, lasted approximately 3 hours. Received an offer the next day, which I accepted.", "Interview Questions": "One unexpected question that I was asked pertained to specifics of a recent scientific conference that I had attended. I was asked what my opinion of the keynote address was.   "}], [{"date": "11 Apr 2013", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital", "Interview Descriptions": "I was first contacted by HR and had a 20 minute phone interview with the HR rep. This was pleasant and mostly limited to answering the basic questions about my experiences, my strengths, my weaknesses, and then lastly the dreaded salary question. The HR rep was quite pushy about this when I said it would be negotiable and asked for my current salary. However, the interview was overall a pleasant experience (I guess as pleasant as it can be). \r\nI then was invited to have an in-person interview with the Head of the Department and 1 of the lead dietitians (I did not know she would be there). This was actually a lot less formal and serious than I expected. Oddly, the interviewers did not seem prepared with questions. The questions they did ask were a little more specific to my internship experience, my career interests, my clinical interests and experiences.", "Interview Questions": "Have you ever had a bad multidisciplinary experience?"}, {"date": "9 Apr 2013", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2013", "Interview Descriptions": "Email and phone call", "Interview Questions": "N/A"}, {"date": "12 Nov 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital in Apr 2013", "Interview Descriptions": "Very relaxed, just wanted a good assessment of my skills. I went to Bullfinch Temps to complete work (used as a hiring agency for parts of MasGen) and they gave a good overview of what to expect and if I had any further questions where I could reach someone to help.", "Interview Questions": "Previous experience specifically using computers"}, {"date": "21 Oct 2015", "title": "Operations Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2013", "Interview Descriptions": "It was easy I met with an HR woman and then my Boss she asked me basic interview questions. It was easy and short. My boss lied about the position and told me I would be working in a different department than I am.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Jul 2015", "title": "Web Content Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Mar 2013", "Interview Descriptions": "There are a lot of steps in the process. You have to meet with various groups and explain your work history on numerous occasions. You also have to be very patient, as the hiring process takes a long time. It is better to have a job already than to be unemployed and looking for work.", "Interview Questions": "How would you handle it if you were getting two competing sets of instructions from senior leadership in two departments?"}, {"date": "24 Sept 2015", "title": "Assistant In Neurology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 8 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2013", "Interview Descriptions": "I sent in my CV to the hospital, specifically to the head of the division that I was applying in and to the chair of the department.  I first had a phone interview and then was brought in for an in-person interview.  I met with several of the faculty members and had 30-45 minute interviews with all of them.", "Interview Questions": "What are your goals in terms of your career?"}, {"date": "9 Oct 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2013", "Interview Descriptions": "I applied online and sent my CV together with motivation letter, I got the Skype Interview, Presented my own research and publications, Some technical questions about skills and future plans", "Interview Questions": "about your own research and publications, future plans, educational background, computational skills"}, {"date": "13 Mar 2016", "title": "PSC III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2012", "Interview Descriptions": "Tedious and very long before position was offered after the first interview.  Was called back four times for different interviews since it was difficult to get everyone together that needed to meet me. First step was a phone interview.  Then met with the manager on two separate occasions, then was called back to meet with the doctors and other employees in the department.  Two weeks later, got a call with an offer.  Salary was non negotiable.", "Interview Questions": "How I handled working with difficult coworkers in the past."}, {"date": "24 Oct 2012", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Massachusetts General Hospital (Cambridge, MA)", "Interview Descriptions": "Fairly easy. Got an email from the lab director. Set up a time to interview.", "Interview Questions": "Most questions were just about my resume and experience."}, {"date": "24 Dec 2012", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2012", "Interview Descriptions": "Interviewed for an advertised *new* position(with job description);during interview process it became clear very quickly that the hiring manager still hadn't really thought out all the aspects of the job...as I was sitting there in front of him, he was thinking out loud about all the \"extra\" things they could tack on, \"now that we'll have someone here to do(this)\". Read:moving target. Every job does have its grey areas, granted, but they were in such a hurry to fill this one that they started getting people in to interview without the position being fully-formed.", "Interview Questions": "While still thinking up extra duties, he had a thought bubble and then told me that they had another site I'd \"probably need to monitor if there are problems they can't handle\", and it was located 2 miles across town. Since pretty much anyone who's got a brain takes the train to work there, I responded quietly: \"Okay, but just to clarify, if I'm taking the train in to work, what would be the best way I'd be expected to get there?\"\r\nAnswer: \"Oh, good question. Um, well, I guess we'll have to figure that out at some point...\"\r\n"}], [{"date": "19 Aug 2013", "title": "Business Intelligence Analyst - Department of Imaging Informatics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Massachusetts General Hospital in Oct 2012", "Interview Descriptions": "I was an internal candidate recommended by the person who was vacating this position, whom I had also worked with on a number of projects in the past and who was familiar with my abilities and skill set. The panel of people who I met with were relatively new to the department and had never had the opportunity to work with me before. The interview was panel-style and each of the members of the panel had a 2-page list of very specific (almost TOO specific) and multifaceted questions that I found very difficult to answer on-the-fly without giving them some amount of time and/or consideration to answer.", "Interview Questions": "N/A"}, {"date": "28 Jul 2016", "title": "Research Animal Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Massachusetts General Hospital in Sept 2012", "Interview Descriptions": "submitted application, got called in for interview. I met with a technician who took me on a tour of the facility. I then met with the facility manager to continue the interview process. I waited about a month or so to hear back that I got the job.", "Interview Questions": "What are my strengths? How would I handle certain situations."}, {"date": "25 Oct 2013", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2012", "Interview Descriptions": "Interviewed for position via skype while still in undergraduate. Tough interview but very straightforward, no surprises", "Interview Questions": "What are your thoughts and feelings on medicating people?"}, {"date": "16 Jan 2014", "title": "Clinical Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2012", "Interview Descriptions": "Very relaxed Interview environment.  For the most part, we just reviewed what was already on my resume and discussed job requirements.  Both interviewers were pleasant and responsive in answering all my questions.", "Interview Questions": "What do you think is your greatest weakness."}, {"date": "20 Oct 2015", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Massachusetts General Hospital in Jun 2012", "Interview Descriptions": "The interview process takes a little while, so be patient. I had an employee refer me for this position. There is an initial phone interview with human resources. Then an interview with the practice manager, then asked back to meet with the department head. The interview was quite typical. I went through my resume and talked about future goals.", "Interview Questions": "Why do you think you will be a good fit at MGH?\r\nWhere do you see yourself in 5 years? \r\nCan you work independently and as a part of team?"}, {"date": "28 Sept 2016", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2012", "Interview Descriptions": "I had two interviews. in both the interviewrer brought other postdocs to interview me. They were very interested to know what I can do for them. It was strange becaouse I was supposed to be independent, and i was promised Assistant professor possition within 4 months. I was more experienced than them, I didn't understand why they were so interested to know what I can do for them. And, indeed once I started to work there I understood.", "Interview Questions": "I was asked for my age among other things."}, {"date": "22 Mar 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2012", "Interview Descriptions": "It was a good experience, we developed a very good rapport very quickly. I was referred by a colleague so the manager that interviewed me already new about me to some extent. Also I had a lot of experience for this positive so that was very helpful. The interview skills of the manager that met with me were great and that helped me relax immediately which is so important in any interview.  I also prepared by bringing copies of my resume and making notes about specific points that I felt were important to discuss.", "Interview Questions": "Most of the interview was centered around my experience and background. We also talked about working at MGH."}, {"date": "30 Apr 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Massachusetts General Hospital in Jan 2012", "Interview Descriptions": "I was interested in learning whether or not a specific department had any openings so I sent an e-mail to HR of that department - she responded unfortunately there were no openings at the time - two days later I received an e-mail from the research coordinator asking for a phone interview, I was very confused as I was told there were no available positions, so I was unsure what I was even interviewing for - the phone interview was pretty standard; however, I was informed they were still figuring out their needs, and I would hear back within the next few weeks - I NEVER HEARD BACK EITHER WAY, I sent two follow-up e-mails, and called three times. I left two voicemails and spoke to the research coordinator herself who said I should hear back within the next week (at this point it had been 4 weeks since my phone interview), and again, no response, and no response to my follow up e-mail. I was very disappointed I had never heard either way, and thought this was very unprofessional from such a reputable hospital.", "Interview Questions": "All standard questions."}, {"date": "6 Jan 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2012", "Interview Descriptions": "Submitted resume via e-mail, was contacted a few weeks later for an in-person interview. They were very slow to get back to me. I had to follow up with multiple e-mails before I received any response. Additionally, I know one person who they initially didn't offer the job to, and then they called them back and offered the job. Very strange.", "Interview Questions": "Why are you interested in researching XXX? Tell me about past research projects?"}, {"date": "2 Aug 2016", "title": "IV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2012", "Interview Descriptions": "I was called and asked to interview. First I had a phone interview with HR then proceeded to interview with the Nurse Manager of the IV Department in person. The interview was not very lengthy as I can recall, but thorough. It took place in a small office which may seem a little untraditional, but to me seemed to be a little bit more comfortable and was easier to communicate with the nurse manager. The process I thought was a little lengthy as it took maybe a month or more to hear back, but I did end up getting the job!", "Interview Questions": "What qualities I think are important in a work place."}], [{"date": "18 Jul 2012", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (South Boston, MA) in Jan 2012", "Interview Descriptions": "tough. You have to prepare", "Interview Questions": "why do you chose this place"}, {"date": "8 Nov 2015", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2011", "Interview Descriptions": "Easy going and very general. Met with the HR person first. Then the boss/ head nurse. Everyone described their roles and experiences on the floor. This was followed by them asking me about my experiences. The boss also showed me around the floor.", "Interview Questions": "Q: Explain your experience in healthcare\r\nQ: How many years of experience do you have"}, {"date": "4 Nov 2015", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (Charlestown, MA) in Aug 2011", "Interview Descriptions": "Interview takes about 1 day. They will ask you about your prior experience on your resume just to see if you fully understand what you were doing. Usually you will get to meet the entire team and walkthrough the lab during the interview.", "Interview Questions": "Past experience, projects etc "}, {"date": "14 Sept 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2011", "Interview Descriptions": "Basic questions. Hiring manager was very open and honest. He explained clearly the expectations for this job role. He was a good listener and very friendly as well. He was willing to hire right candidate even though he/she don't have enough experience. However, he was keen in the candidate expressing passion and interest for the job", "Interview Questions": "1. Why are you interested in this job?"}, {"date": "16 Apr 2013", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2011", "Interview Descriptions": "phone interview first and provide basic information of education and experience including volunteer experience.\r\nface to  face interview with the PI. more details about the job requirement and  functions.", "Interview Questions": "the weakess"}, {"date": "12 Nov 2015", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2011", "Interview Descriptions": "Quick and easy interview, and was offered the job via phone call within a week.  However, the interviewer asked me to confirm the salary that I negotiated during the interview with another manager, then emailed me to \"follow up\" a few minutes later - and rescinded the offer.  Totally unprofessional.  Will not interview here again.", "Interview Questions": "Usual questions about previous research management experience."}, {"date": "10 Apr 2013", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2011", "Interview Descriptions": "Quick and easy.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "30 Apr 2015", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2011", "Interview Descriptions": "I had to submit a resume via HR. The employer emailed me to set up an in person interview. The in person interview started with an initial interview with the current coordinator. Afterwards the PI of the study and a second coordinator joined us for a panel interview.", "Interview Questions": "How do you feel about working with sensitive patient populations?\r\nTell us about your past patient experience?\r\nThis job involves a lot of fast paced multitasking - How will you handle that?"}, {"date": "20 Aug 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Feb 2011", "Interview Descriptions": "Fairly generic, get to know you interview. Went for one in-person interview and was offered the job soon afterwards. There was no room for negotiation, start date or salary, but was a pretty standard process. Interview was with other Clinical Research Coordinators and then with a couple of the doctors that you would be working directly with.", "Interview Questions": "Tell me about your research. Why are you interested in this job? If you had unlimited money, what research would you do?"}, {"date": "15 May 2014", "title": "OR Resource Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2011", "Interview Descriptions": "The hiring process was relatively quick. The management is young and understanding, but a bit intimidating during the panel interview. I received an offer within 30 days of applying. HR didn't communicate very clearly, but this wasn't important because of the direct communication with the hiring manager.", "Interview Questions": "Give me an example of a time where you lead a work unit and experienced challenges?"}], [{"date": "5 Jul 2012", "title": "Biostatistics Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jan 2011", "Interview Descriptions": "The hiring manager was very friendly.  The direct supervisor was very knowledgeable about the subject matter.  The research group dynamics is very good too.  People there are very open to new comers with different culture/background.  I overall think the interview process is not very hard but you need to do your homework on what they are looking for.  The hospital is a huge one and have many many cutting edge research centers with research fellows doing very advanced work to cure the hardest diseases.", "Interview Questions": "Tell me about yourself"}, {"date": "23 Nov 2010", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Nov 2010", "Interview Descriptions": "Emailed resume as response to job posting, heard back two weeks later by phone and email to schedule interview for the following week.\r\n\r\nInterview was at 9 am and started on time. I met with a current research assistant who was very friendly, did not ask much, just for a brief overview of my experience. She told me a little bit about the position.\r\n\r\nNext, met with the lab director. We spoke more in-depth about my experience and the position. He was very approachable, not intimidating at all.\r\n\r\nLast, I met with a post-doc in the lab. She hadn't been given a copy of my CV previously so I gave her a copy. She glanced it over and asked a few questions about various positions, then asked more about my career aspirations. She seemed nice but unprepared for the interview due to miscommunication.", "Interview Questions": "Tell me about your experience."}, {"date": "14 Dec 2011", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2010", "Interview Descriptions": "The hiring process involved an interview with several of the organizaition's key critical members, including director level management, senior level management, and program level management. The interview process was thorough and involved several questions with regard to prior skills and experiences, educational background, as well as situational questions (e.g. conflict resolution strategies, strengths-weaknesses, etc.)", "Interview Questions": "What are your weaknesses? "}, {"date": "13 Nov 2010", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2010", "Interview Descriptions": "The process was fairly straight forward.  Emailed letter of interest and updated resume.  Then phone phone interview and 1 to 1 interview in person.  It may have helped that a current research person referred me for  the position.", "Interview Questions": "Standard questions about my experience and interest in the position."}, {"date": "25 May 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jun 2010", "Interview Descriptions": "Down to earth; open conversation; dialogue. The Program director had carefully read my resume and truly wanted to find out how my previus experiences could help in the job I was interviewing for. He seemed willing to give me a chance even though I did not have direct healthcare experience before.", "Interview Questions": "N/A"}, {"date": "12 Jun 2013", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2010", "Interview Descriptions": "2 interviews with 5 different people\r\nTypical quetions: why are you switching jobs? Do you know about XYZ? How long?", "Interview Questions": "Why should we pick you over the other candidates?"}, {"date": "17 Feb 2014", "title": "Materials Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2010", "Interview Descriptions": "Easily Done through High School, and hired without company interview", "Interview Questions": "N/A"}, {"date": "16 Jun 2010", "title": "Medical Technologist I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2010", "Interview Descriptions": "The interview process went very well. The group was professional and the overall culture of the group seemed positive.  The HR review process took several weeks. The HR representative did not have my full information or application, even though I was an internal Partners Applicant. This made for a bumbling phone call when I received the offer, with particular emphasis on salary.", "Interview Questions": "General questions regarding pertinent experience."}, {"date": "14 Mar 2011", "title": "Assistant Research Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2010", "Interview Descriptions": "I applied to a position directly from the MGH hospital website. Within a week I got an email from the scientist that would be my potential boss, just clarifying a few things on my resume. We emailed back and forth a couple time and then she set up a phone interview with me. The phone interview lasted about 20 minutes and she asked questions involving my background and education, but spent the majority of the interview on what goals I had for the future. I was less prepared to answer these questions-which were a lot about research goals, continuing my education, and specific areas of interest. My take on it was that they wanted to give someone the opportunity that had a very specific goal for future research.", "Interview Questions": "Describe how you contributed your own ideas to your adviser's research project? "}, {"date": "9 Aug 2012", "title": "Staff Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Apr 2010", "Interview Descriptions": "Applied online-- very easy to apply to dozens of jobs without a cover letter!", "Interview Questions": "What would I do if I needed my boss's signature immediately but wasn't able to locate him as he was in a rural area of a poor country?"}], [{"date": "18 Jun 2012", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Dec 2009", "Interview Descriptions": "Very low stress interview. It doesn't matter how well you can do your job, they mainly looks for individuals who will be their friends.", "Interview Questions": "What are your weaknesses?"}, {"date": "5 Nov 2009", "title": "Research Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Oct 2009", "Interview Descriptions": "I was asked about my mems and microfluidics experience and details on the current projects. Was also asked to explain in detail all the things written on my resume. I was asked for a very easy Labview code as well.", "Interview Questions": "Can you explain your microfluidic experience in building a fuel cell?"}, {"date": "12 Jan 2011", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Aug 2009", "Interview Descriptions": "Meet first with the hiring director, then meet with the project director, then with the team", "Interview Questions": "Describe your expectations over the next 5 years"}, {"date": "11 Jul 2011", "title": "Administrative Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in May 2009", "Interview Descriptions": "Phone Interview with Recruiter followed by another phone interview with hiring manager 1 week later. 2 weeks later, interviewed with panel of employees I would be working with. 2 weeks later, accepted the offer.", "Interview Questions": "How would you describe your management style?"}, {"date": "5 Aug 2010", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Massachusetts General Hospital (Boston, MA) in Sept 2008", "Interview Descriptions": "The interview consisted of a pleasant phone conversation with the hiring scientist, going over my background and the expectations for the position.  This was followed by an oral presentation with questions in the department seminar.  After a few days, an offer came by e-mail with a stated salary.  A copy of the research proposal was also e-mailed to me.", "Interview Questions": "There were no difficult questions.  All questions pertained to my background and familiarity with particular scientific techniques.  There were no surprises; the questions were straight-forward."}, {"date": "3 Aug 2010", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2008", "Interview Descriptions": "Interviewed at staffing firm with Director and Finance Manager. Interview Structure 1:1.  Two 45 minute interviews.", "Interview Questions": "Describe how coming from a large public firm you will be able to add value to a non for profit environment?"}, {"date": "6 Aug 2009", "title": "Bioinformatics Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Massachusetts General Hospital (Boston, MA) in Jul 2007", "Interview Descriptions": "The interview was thorough and welcoming. I was treated with care and understanding and my duties were clearly explained to me. The actual hiring process took longer than I would have liked, but the decision on whether they wanted to hire me was quick. After that decision there was a long wait as the HR department let me drip through the many filters of bureaucracy. Once that was finished the work environment proved to be very nice.", "Interview Questions": "What do you know about linkage disequilibrium and it's affect on human genetic disease?"}]]