[[{"date": "23 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Memorial Healthcare", "Interview Descriptions": "I Interviewed in a 3 person panel for the NICU. They were very informative. Be honest and not scripted in order to carry on the conversation. My interview lasted about 36 minutes, however was given a 30 minute time slot. Still waiting to hear back.", "Interview Questions": "Asked behavioral style questions including challenges. Be prepared to tell them about yourself."}, {"date": "14 Dec 2022", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Memorial Healthcare", "Interview Descriptions": "The interview process was a phone and zoom meeting with in person at the end. Very long onboarding process though having to do physicals and drug testing. Easy enough and standard questions. If you can write a grammatically correct email and manage a calendar it’s fine.", "Interview Questions": "What are my greatest attributes."}, {"date": "20 May 2021", "title": "Education Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Memorial Healthcare", "Interview Descriptions": "Two separate zoom interviews (after submitting resume online).  Interview process took over a month between calls.  First call was with director then they brought on some other team members I would be working with directly. Interview was formal and went over my resume (how experience there would apply to the job).", "Interview Questions": "What are some challenges at your previous employment and how did you handle them?"}, {"date": "28 Jan 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Memorial Healthcare", "Interview Descriptions": "The interview was a Panel style Interview with about 5-6 people interviewing the candidates. Each person took turns asking questions. Everyone was very nice and created a comfortable environment. It lasted about 20 minutes.", "Interview Questions": "How have you handled a difficult patient? "}, {"date": "30 Oct 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Memorial Healthcare", "Interview Descriptions": "DInterview process was a bit lengthy.  Waited a couple of weeks to hear back on whether a position was being offered or not. Recruiter was helpful. Manager seemed very nice, but position was not offered", "Interview Questions": "What are your skills for positoon"}, {"date": "24 Sept 2020", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Memorial Healthcare", "Interview Descriptions": "had to describe situations in a work place, was fairly easy got hired right on the spot. Got interviewed by 2 people. I studied all night for the interview. I asked questions in the end aswell", "Interview Questions": "work experience\r\ntell me about yourself\r\nare you organized\r\n"}, {"date": "26 Aug 2020", "title": "Telemetry RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Memorial Healthcare (Ventura, CA) in May 2019", "Interview Descriptions": "initial conversation over phone, then invited me to come for in person interview. it was the manager and supervisor asking questions. quesstions were mostly \"what would you do in this situation\" They were very pleasant and easy to talk to.", "Interview Questions": "How would you handle an upset family member?"}, {"date": "3 Sept 2018", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Memorial Healthcare (Ventura, CA)", "Interview Descriptions": "It was a very friendly interview with lots of the basic questions. I was asked, \"Tell me about yourself, greatest strengths and weaknesses, greatest professional achievement, how do you handle conflicts, greatest challenge in the role, etc.\"", "Interview Questions": "Tell me about yourself."}, {"date": "8 Apr 2020", "title": "Help Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Community Memorial Healthcare (Ventura, CA) in Jan 2017", "Interview Descriptions": "Very casual interview process. They ask some technical questions but are more concerned with customer service. This is a job that can be learned over time so they are more concerned with how you interact with users and solve problems. They just want to make sure you have a good attitude.", "Interview Questions": "How would you fix a printer remotely? What steps would you take?"}, {"date": "13 Sept 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Community Memorial Healthcare (Ventura, CA) in Jul 2011", "Interview Descriptions": "The interview was done by a ntimidating man who spoke very little, his strategy was to let you fill the silence with nervous conversation in order to throw off your whole game plan and expose more of yourself than you planned on. A couple times I didn't have anything more to add to my response so we sat in silence while he stared at me.", "Interview Questions": "Tell me a story."}]]