[[{"date": "4 Jul 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at St. Francis Hospital (Roslyn, NY) in Jun 2023", "Interview Descriptions": "Very calm, very nice and polite. They did ask a few questions testing my knowledge with medications, sicknesses. They really want someone who is compassionate, knowledgable, and is willing to take the night shifts lol", "Interview Questions": "What medications would you give someone with CHF? S/S of CHF Where do you see yourself in 5 years? Are you thinking of going back to school? Tell me about yourself..."}, {"date": "23 Jun 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Topeka, KS) in May 2023", "Interview Descriptions": "Amazing interviewers, they really go into detail as to what is required on the job. They really instill what the hospital stands for during the interview and all the growth the company has done in recent years.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Francis Hospital", "Interview Descriptions": "Pretty Straight forward interview , mostly experience related questions questions, care of patients, the types of different patient care managed, your skills and level of experience with triage /stemi/ stroke /trauma , Peripheral intra venous start skills, then brief overview of unit and team environment, as well as scheduling guidelines etc", "Interview Questions": "Tell me about your experience"}, {"date": "2 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Francis Hospital", "Interview Descriptions": "Behavioral questions with manager and educator. Was nice and easy. They made it feel casual without the interrogation interview feeling. They just want to understand my goals and why I want to work with that unti", "Interview Questions": "Tell me about a time when you had a conflict with a coworker and how did you handle it"}, {"date": "25 May 2022", "title": "Insurance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Saint Francis, WI) in Apr 2022", "Interview Descriptions": "30 mins,  The company gave me great information on the salary and benefits. The time you start work and end work. Also in-site on what they are looking for in an employee. But overall it was a pleasant interview.", "Interview Questions": "Tell me about yourself and etc..."}, {"date": "7 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Francis Hospital", "Interview Descriptions": "It was  an interview with HR first on the phone then an in person meeting with the unit manager and nurse educator. First asked general questions then asked nursing related questions.", "Interview Questions": "When did you take the NCLEX? What school did you go to? What are your strengths and weakness?"}, {"date": "9 Aug 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Francis Hospital", "Interview Descriptions": "Very easy and laid back. The questions were usual interview questions. I felt comfortable and very relaxed. The atmosphere was welcoming and I was put at ease and less nervous.", "Interview Questions": "Asked to tell them about my skills and experiences"}, {"date": "1 Sept 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Francis Hospital in Aug 2021", "Interview Descriptions": "professional interview with nurse manager and fellow nurses on the unit. Each and every member of the team, from the nurse recruiter to the nurse manager made the process smooth and were only amazing things were said about the environment.", "Interview Questions": "Tell me about yourself, tell me how you deal with conflict. "}, {"date": "22 Apr 2021", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Francis Hospital", "Interview Descriptions": "Questions were tough but not too tough. Interviewer was friendly and focused on finding a good fit. Overall a good experience, and helped me to determine whether or not I would be happy in the job.", "Interview Questions": "When was a situation where someone in another position in your office knew more than you did? How did you handle that?"}, {"date": "23 Apr 2021", "title": "ER Admitting Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Columbus, GA) in Apr 2021", "Interview Descriptions": "Managers were welcoming, upfront and honest. Position was explained in detail, questions were both asked and answered and did not feel rushed or stressed.  Process of hire were explained in detail and managers were helpful with getting me in during my crazy current schedule.", "Interview Questions": "Why I should be the candidate chosen"}], [{"date": "27 Jan 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Chicago, IL) in Jan 2021", "Interview Descriptions": "The interview went very well. The staff was really great at communicating the floor I would be working on. I look forward to working there for many years, the end.", "Interview Questions": "fgrtfdcsx refef rwefe. rwqr er. qwr "}, {"date": "2 Feb 2021", "title": "Registered Nurse, Critical Care Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Monroe, LA) in Jan 2021", "Interview Descriptions": "Super friendly Director and the team. The interview went in a real friendly manner.  They answered all of my queries without any hesitation.  Give needed details related to policies, responsibilities and job description.", "Interview Questions": "What makes you choose this profession?"}, {"date": "29 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (San Francisco, CA) in Dec 2020", "Interview Descriptions": "The interview process was concise, short and direct. It was very prompt shortly after setting up and interview date. The interview itself was through Zoom and it was pretty short.", "Interview Questions": "Was I good at starting IV’s?"}, {"date": "14 Oct 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Francis Hospital", "Interview Descriptions": "I had an interview with the Nurse Manager and  Clinical Educator, they asked a series of behavioral questions and specific questions about medications and scenarios. Interview lasted about 40 minutes.", "Interview Questions": "What are some medications you would expect a patient with CHF to be prescribed."}, {"date": "27 Oct 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital in Oct 2020", "Interview Descriptions": "easy first interview \n\njust basic interview questions \n\nThey called me about 3 weeks after I submitted an application to schedule a phone interview. Then after the interview scheduled me for an in person interview.", "Interview Questions": "why do you want to work here \n\nstrengths/weaknesses \n\nwhere do you see your self in 5 years \n\ntell me about yourself "}, {"date": "10 Sept 2020", "title": "R N Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Francis Hospital (Greenville, SC) in Jun 2020", "Interview Descriptions": "Very friendly manager. Answered questions thoroughly and honestly. Gave feedback in regards to how i would fit in the unit. Did not try to misrepresent what hours and days would be expected of me", "Interview Questions": "A time i had conflict with a coworker and the resolution "}, {"date": "3 May 2022", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Francis Hospital (Lynwood, CA) in Mar 2020", "Interview Descriptions": "I was called in for an interview first over the phone then in person. Basic questions were asked, we discussed my experience. I didn't meet their qualifications, they told me they were not able to hire me.", "Interview Questions": "why do you think your experience and education makes you a well trained candidate for the position. "}, {"date": "24 Jan 2020", "title": "Patient Care Technician/Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital", "Interview Descriptions": "First Interview was pretty short with Nurse Recruiter. Asked pretty basic interview questions. Second interview with Floor Manager was 4.5 weeks later, likely due to the holidays. She was much more personable than the recruiter, asked some basic questions but seemed genuine.", "Interview Questions": "Strengths, weaknesses, what would your boss/coworker(s) say about you, why do you want to work here, etc."}, {"date": "9 Jun 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Francis Hospital in Jan 2020", "Interview Descriptions": "comfortable environment, very nice managers, questions were kind of tricky, a lot of clinical scenario questions. make sure you know your heart and blood pressure meds. know about a-fib and patient education. make sure you know your mission statement and how you can relate to it. over all very nice people. the process is very smooth I'm just waiting to hear back from them. they told me it will take 2 weeks", "Interview Questions": "tell me why you chose nursing? "}, {"date": "10 Dec 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital", "Interview Descriptions": "I am a new grad. I had an interview with the nurse recruiter and it went smooth and two days later I had an interview with a nurse manager and a clinical nurse. They were very cardiac focused. They asked about CHF and stroke care plan , Afib. Meds for CHF.", "Interview Questions": "Describe an empathetic person"}], [{"date": "5 Dec 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Hartford, CT)", "Interview Descriptions": "Had a lovely interview- followed up with 2 emails, and never heard back! Very frustrating to go months without an answer either way.  I found it very unprofessional.  I had many years of experience in the field, and felt a great vibe from the unit.  This was definitely a disappointment.", "Interview Questions": "Past experience"}, {"date": "19 Nov 2019", "title": "Telemetry RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital", "Interview Descriptions": "I received a call after an online application from the nurse recruiter, went in next week to meet her and was interviewed (step 1) for RN residency programs. I had an overall neutral experience, but she was not very friendly and it was a little off-putting. There is a residency in telemetry and one in the ED. I am not very interested in cardio but I went into the interview to practice and learn more about the position.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "3 Oct 2019", "title": "Revenue Cycle Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Francis Hospital (Columbus, GA)", "Interview Descriptions": "I was contacted for interview. A week after the interview I was offered the job and 2 days later went in for paperwork and drug testing. Recieved a start date but no information on testings and HR does not return emails.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Oct 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Francis Hospital", "Interview Descriptions": "Submit application online. You will receive a phone call interview (2 questions about your interests). They will get back to you if your interest matches their availability. Then you will go through a background check and you have to get your immunization records and submit. And finally, you must go to the hospital to receive uniform and go over your job in the hospital.", "Interview Questions": "What department in our hospital would you think fits your interest to volunteer?"}, {"date": "19 Jun 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Francis Hospital (Los Angeles, CA)", "Interview Descriptions": "Met with director for first interview, then two supervisors for second interview and CNO and panel for third interview.  Panel\r\nInterview is sometimes daunting but was made at ease.", "Interview Questions": "Tell me about a difficult situation and how you dealt with it l"}, {"date": "11 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Francis Hospital (Indianapolis, IN) in May 2019", "Interview Descriptions": "very kind, asked about interests and experience, if I would need pto. they were very friendly and understanding. i would definitely recommend this company to many others. it seemed to be an environment that many would definitely enjoy to work at", "Interview Questions": "do i have any experience, do i have parent responsibilities/dependents, what i am most interested in and what i'm most excited for to begin working, why i am interested in their company"}, {"date": "4 May 2019", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Francis Hospital in Apr 2019", "Interview Descriptions": "I first applied online on their website for the position (included cover letter, resume, and references). Following my submission, I was contacted for a phone interview. Correspondence occurred both via phone and e-mail.", "Interview Questions": "Elaborate on past experience."}, {"date": "14 Feb 2019", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Francis Hospital (Roslyn, NY) in Feb 2019", "Interview Descriptions": "Interview wasn’t bad I think I was nervous for nothing. I practiced the day before and I got asked the same basic questions. Nurse recruiter smiled at me at all times and very nice.", "Interview Questions": "5 year plan, strengths & weakness, difficult situation, why do you want to work there and what do you know about st Francis. "}, {"date": "19 Jan 2019", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital", "Interview Descriptions": "There were two interviews, one with HR, and one with the floor manager.  You met with HR first and they ask a series of questions they ask in any interview.  I believe if HR likes you, they set up a second interview with the Floor/Unit manager that has the opening.", "Interview Questions": "They ask the normal questions, what are your strengths or weaknesses.  Give an example of a time you went above what was asked of you. Give me an example of a time you had conflict and how did you resolve that conflict"}, {"date": "17 Jan 2019", "title": "PBX Operator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Memphis, TN) in Jan 2019", "Interview Descriptions": "It was brief and wonderful interview. She was very informant and very pleasant.She was very concise and clear. She explained everything to me very well.I really did appreciate the opportunity to be given an interview.", "Interview Questions": "How much experience did I have "}], [{"date": "29 Nov 2018", "title": "Comfort Care Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Francis Hospital (Roslyn, NY) in Nov 2018", "Interview Descriptions": "First interview- person was super informal, no eye contact, poor handshake. Put me in an open room to fill out papers where it was loud and lacked privacy. Walked into her office and she made me close the door and began asking questions. She did not look at me the entire interview, but wrote every word I said. Did not walk me out when I needed key card access to get back into the main building.\r\n\r\nSecond interview- friendly nurse manager, but began the interview in the elevator and as we walked down the unit. Again, wrote every word I said but maintained eye contact more often and seemed generally interested in my clinical stories.", "Interview Questions": "What are your strengths\r\nWhat are your weaknesses\r\nName a time that you had challenges within a hospital? How did you resolve it.\r\nTell me about a time you went above and beyond for a patient."}, {"date": "11 Dec 2019", "title": "MLS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Francis Hospital (Tulsa, OK) in Oct 2018", "Interview Descriptions": "I had a phone interview while living in another state. The interview went well and was straight forward. They asked me questions and they appreciated that I had questions ready for them.", "Interview Questions": "Why did you chose St. Francis?"}, {"date": "28 Jun 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Francis Hospital (Grand Island, NE) in Apr 2018", "Interview Descriptions": "I applied online from a link on indeed.com and was called a day or two later. The gentleman I spoke with gave me a few options for interview dates/times. Had an interview the following week with 2 supervisors and a manager, was contacted by the manager 2 days later and told I would be called by HR from a Florida number.", "Interview Questions": "What are the 3 things you value the most?"}, {"date": "25 Jan 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Francis Hospital", "Interview Descriptions": "I applied for the position online. They called me in for an interview a week later. There was one in-person interview with two supervisors. I was asked a series of pretty standard interview questions and told I'd hear from them within a couple of weeks.", "Interview Questions": "How would you deal with a coworker who wasn't pulling his or her weight when the ER is busy? "}, {"date": "16 Jul 2018", "title": "Health Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Francis Hospital (Lynwood, CA) in Feb 2018", "Interview Descriptions": "It was very easy, almost everyone that applied got a interview offer. It was mostly for them to meet you. It was in MMI style for those interested in preparing medical schools. We got to go around and meet everyone else on the leadership team as well.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "19 Dec 2017", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Tulsa, OK) in Dec 2017", "Interview Descriptions": "After applying online I did a phone interview ,after which I was called for an in person interview. It was a easy process to apply and interview. Unfortunately I was not selected for the position.", "Interview Questions": "General expected questions of strengths and weakness. "}, {"date": "8 May 2017", "title": "Clinical Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Francis Hospital", "Interview Descriptions": "Set of interview questions regarding experience and interest in the field.\r\nWrite a sample treatment plan and a Spanish Test if you are bilingual.\r\nInterview was with the executive director.\r\nAsked much about work history and experience that connects to therapy.", "Interview Questions": "Explain a difficult situation in your last employment, how did you solve it?"}, {"date": "12 Aug 2021", "title": "Housekeeping Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Memphis, TN) in Mar 2017", "Interview Descriptions": "Great simple easy interview I flew right through the questions with no problem . Interviewer was very nice . Was on time quick simple and to the point . Got a call within 2 days", "Interview Questions": "How many years of experience have I had?"}, {"date": "25 Mar 2021", "title": "Veterinary Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at St. Francis Hospital (Newark, NJ) in Jan 2017", "Interview Descriptions": "They were very nice and explained everything very well. They followed up with me immediately. They were very nice and explained everything very well. They followed up with me immediately.", "Interview Questions": "They asked me to tell them about myself "}, {"date": "4 Oct 2016", "title": "Room Service Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Francis Hospital (New York, NY)", "Interview Descriptions": "They asked about my experience and why I wanted to work with Room Service.  I do not remember them really asking any tough questions.  The interviewer was very friendly.", "Interview Questions": "N/A"}], [{"date": "21 Sept 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at St. Francis Hospital (Columbus, GA)", "Interview Descriptions": "My interview was with the nurse manager and unit manager. It was a pretty simple interview asking about my experienceand why I wanted the job. Im sure if I were applying to the medical hospital it would have been a liitle more detailed. They opened the floor for questions and said they would contact me in the next few days.", "Interview Questions": "How much experience do you have in psych?"}, {"date": "11 May 2016", "title": "Med Surg Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Francis Hospital (Roslyn, NY) in Apr 2016", "Interview Descriptions": "Very intense, a panel of nurses asked many different kinds of questions.  It almost seemed like a NCLEX test.  Then it was more like a personality  assessment. To me it seemed extremely intense and it put the candidate under  lot of pressure.  Not even going there that there is a pharm test and a math calculation test to take.   I think its a lot in a short amount of time.", "Interview Questions": "Why should we hire you instead of some one else?"}, {"date": "1 Apr 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Francis Hospital (Roslyn, NY) in Jan 2016", "Interview Descriptions": "It took a couple of days after I applied to get a call back. Human resource interviews you and then interview with floor manager. they ask basic interview questions and then behavioral questions such as what will you do when faced with a difficult patient. Hiring managers seem to like this question a LOT.", "Interview Questions": "What are your strengths?"}, {"date": "24 Mar 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Francis Hospital (Wilmington, DE) in Dec 2015", "Interview Descriptions": "Was very relaxed but professional. Was a mixture of nurses and CNA's with one administrative representative. They asked a variety of questions and ensured that I knew the entirety of the role and the associated benefits.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "24 Jun 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Francis Hospital (Wilmington, DE) in Jun 2015", "Interview Descriptions": "HR emailed and called to set up interview.  Interview process was easy. Interviewed with two people. They went over what they expect of you and where the company is planning to go in the future.", "Interview Questions": "what type of manager are you."}, {"date": "29 Apr 2016", "title": "Comfort Care Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Francis Hospital (Roslyn, NY) in Jun 2015", "Interview Descriptions": "A brief interview with the nurse recruitment administrator, which consisted of a standard questionnaire judging work ethic, relatable experience, reasons why you would benefit the hospital. Followed by 2nd interview with the specific unit manager you would be working under asking similar questions followed by more specific questions on stress management.", "Interview Questions": "Both interviews asked about any relatable experience in health care and how it will benefit you working at the hospital."}, {"date": "3 Jun 2015", "title": "Cardiac Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Francis Hospital (Tulsa, OK) in Apr 2015", "Interview Descriptions": "You talk to Human Resources first and get the basic interview then they send you over to the main hospital to talk to the manager of the department and they show you around and chat to get to know you and see if you are a good fit. Then they will talk to HR and discuss and then get back to you.", "Interview Questions": "What is your definition of integrity"}, {"date": "6 Mar 2015", "title": "RN Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at St. Francis Hospital", "Interview Descriptions": "Interviewed with five to six other supervisors, manager, and director of the department . Also interviewed with my fellow peers group consisted of approximately eight people. Each asked a question as I answered some would ask additional questions related to the first then I would answer.", "Interview Questions": "How do you feel that you will hand it when it comes to disciplining your peers. "}, {"date": "10 Dec 2014", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at St. Francis Hospital in Dec 2014", "Interview Descriptions": "Very long and boring\r\nPanel\r\nWait is three months\r\nRequest of licence\r\nClasses and courses\r\nThey are very paticular about personal skills\r\nFour nanagers \r\nDifferent opinion and questions about group work as a tearm\r\nGoogle the q uestions about hospital", "Interview Questions": "Experience"}, {"date": "26 Apr 2017", "title": "Paperwork Audit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Francis Hospital (Hartford, CT) in Nov 2014", "Interview Descriptions": "Nice and casual.   Met at the managers office and just discussed items in my resume, and the tasks involved in the available job.   Was dressed on the dressy side of business casual.    I remember getting a soda at the machine and the machine dispensing two.   I met the interviewer holding two pepsis and offered her one.   It ended up being a good joke", "Interview Questions": "They asked about the volunteer experience I had listed at their hospital and neighboring Hartford Hospital."}], [{"date": "3 May 2014", "title": "Clinical Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Francis Hospital (Trenton, NJ) in Apr 2014", "Interview Descriptions": "Very fast response to application, HR representative very engaging and professional. You leave with a sense of hope, but the follow up was lacking. As the candidate not selected it would be kind,courteous and professional to receive a rejection letter in lieu of time passing relaying the obvious. Because of this I would not recommend this facility to anyone else nor will I apply again.", "Interview Questions": "How tall are you? Was unexpected but of course not difficult to answer."}, {"date": "28 Jan 2018", "title": "X-ray Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at St. Francis Hospital (Santa Barbara, CA) in Feb 2014", "Interview Descriptions": "Good experience for entry level opening.  Job was 20 hours per week.  I was a student intern at the hospital so they new what they were getting.  I graduated top of my class.", "Interview Questions": "Experience"}, {"date": "21 Sept 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Francis Hospital (Memphis, TN) in Mar 2013", "Interview Descriptions": "Applied online and was called for a face to face and also had a peer jnterview with the staff nurses to see if i was going to be a good fit", "Interview Questions": "How well do u work in a team"}, {"date": "29 Jan 2014", "title": "Prn, Ekg Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Francis Hospital (Memphis, TN) in Jul 2012", "Interview Descriptions": "The interview process was a little lengthy but it wasn't too bad. I had to wait a little for a call back but that's all jobs these days", "Interview Questions": "What are my weaknesses?"}, {"date": "2 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Francis Hospital (Roslyn, NY) in Jun 2012", "Interview Descriptions": "THE person interviewing me was late claimed she was in an emergency meanwhile she came into the room smelling like a pack of cigarettes there was the manager the educator and a staff nurse it was disorganized and un professional i wanted to vomit from the smell of cigarettes and her phone rand in the office and she took the call and it was a personal call really how rude", "Interview Questions": "asked me about my experience"}, {"date": "6 Nov 2012", "title": "Multi Care Tech Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Francis Hospital (Columbus, GA) in Jun 2012", "Interview Descriptions": "I applied online got a call three weeks later for an interview. I had one interview with two employees both asking questions. It was not harsh just important to be honest and sell yourself! I received a call less than a week later with an offer which I accepted. The next step is HR for paperwork and drug screen, background check. Then orientation  which is three days for the company then you do specified job training.", "Interview Questions": "Tell me about yourself any child(ren) or husband? Which is very direct and personal."}, {"date": "20 Aug 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Francis Hospital (Charleston, WV) in Jul 2011", "Interview Descriptions": "the interview went great I went in being me they fell in love with me not only bcuz I have a great personality but because I proved it at well.we interview did labs tooks a drug test did a baclground check took a tour of the building met the drs and some of the staff", "Interview Questions": "am I reliable"}, {"date": "15 May 2015", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at St. Francis Hospital (San Francisco, CA) in Jan 2011", "Interview Descriptions": "No interview needed.  I applied for privileges to the hospital by contacting medical staff office and request an application for privileges and submitted a resume and references.  Also accepted transfer of privileges from another hospital.", "Interview Questions": "Where did you get your medical degree"}, {"date": "10 Sept 2010", "title": "Hematologist Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Francis Hospital (Columbus, GA) in Jun 2010", "Interview Descriptions": "Why do you want to become a team member at St. Francis Hospital? \r\n\r\nWhat qualities could you bring to St. Francis to help us better live out our mission? \r\n\r\nGive an example from your last employment of how you delivered high quality services by incorporating your personal values into your job?", "Interview Questions": "Give an example from your last employment of how you delivered high quality services by incorporating "}, {"date": "1 May 2010", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Francis Hospital (Tulsa, OK) in May 2008", "Interview Descriptions": "Came in and met with manager, she asked a few questions and then sent me to HR to finish filling out paper work and that I was hired.", "Interview Questions": "Why would you want to work in pediatric oncolgy."}]]