[[{"date": "1 May 2023", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American College of Surgeons", "Interview Descriptions": "Everyone is subject to a minimum number of interviews even if the manager has made up their mind after meeting you. It’s even worse if you’re interviewing at the executive level (months-long process, 10+ interviews…). Take the interview process as a red flag that they don’t value your time or your life outside of being an employee.", "Interview Questions": "Why do you want to work in this industry?"}, {"date": "8 Mar 2023", "title": "Senior Meeting Planner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American College of Surgeons in Feb 2023", "Interview Descriptions": "The phone screen was more like an interrogation versus an introductory call to begin a conversation about mutual employment. It left me feeling on guard. She also outlined their intensive interview process which included 2-3 more rounds of interviews. After that, I never heard back even though I emailed the individual, thanking her for her time. Overall bad taste which is unfortunate given the noble mission of the organization.", "Interview Questions": "I don’t see “x” on your resume anywhere."}, {"date": "25 Aug 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American College of Surgeons", "Interview Descriptions": "Quick paced and well organized. The interview process began with a phone call with one of their recruiters followed by one group interview and two interviews with management. All  were conducted virtually. The interviews were fairly laid back and not particularly difficult.", "Interview Questions": "How do you prioritize and manage tasks? "}, {"date": "26 Jan 2022", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American College of Surgeons (Chicago, IL) in Dec 2021", "Interview Descriptions": "Pleasant, well organized, lengthy; met with many people and the College has intelligent staff who care about the mission of the organization.  HR was great; overall, I would recommend pursuing opportunities here.", "Interview Questions": "Why would you work at the Ameircan College of Surgeons?"}, {"date": "1 Nov 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American College of Surgeons", "Interview Descriptions": "I thought the interview process was well organized and gave me a good impression of the company.  They kept me in the loop every step of the way - there was no guessing about my interview status.", "Interview Questions": "Why I wanted the position "}, {"date": "13 Jul 2021", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at American College of Surgeons in Jul 2021", "Interview Descriptions": "Four part interview process, first screened with HR. Two interviews with managers and peers over zoom. They asked experience related to the position and personality. They wanted to know how you would work in different systems and would address problems with customers.", "Interview Questions": "What is one thing you like and dislike about being a business analyst?"}, {"date": "29 Apr 2021", "title": "Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American College of Surgeons (Chicago, IL) in Mar 2021", "Interview Descriptions": "Began with a screening call from HR. \n\nThen, a 30 minute call with the hiring manager followed by a third call which consisted of a panel interview and meeting with hiring manager. \n\nQuestions were straightforward.\n\nNote that the College checks references before extending an offer.", "Interview Questions": "When was a time you made a mistake at work and how did you handle it?"}, {"date": "11 Feb 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American College of Surgeons (Chicago, IL) in Feb 2021", "Interview Descriptions": "The phone interview with the recruiter went very well. She was very professional but also personable and engaging. Interviewer was able to answer my questions and showed genuine excitement during interview.", "Interview Questions": "What interested me most about the position"}, {"date": "19 Jan 2021", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American College of Surgeons (Chicago, IL) in Aug 2020", "Interview Descriptions": "Nice group of people. The interview required pre-work. Systems seem a bit outdated and the org seems siloed and stuck in its ways. Had a few panel interviews with different teams.", "Interview Questions": "What is your greatest strength. "}, {"date": "29 Jul 2019", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Jul 2019", "Interview Descriptions": "After completing an application online I was asked to speak with Cindy from HR for a phone screening. At the conclusion of the conversation I was invited to an in person interview. The first interview lasted two hours and included a 1:1 with Cindy, followed by a 1:1 with the hiring manager. This interview was followed by an email inquiring into my continued interest in the position, as well as a request to move forward to schedule another interview. \r\n\r\nMy next interview lasted 3.5- 4 hours and included three separate interviews consisting of one 1:1, and two panels consisting of three people each, and a follow up conversation with the hiring manager. This interview was followed by another email.\r\n\r\nLastly, I was asked to return for one more interview, which lasted about 2.5 hours and consisted of meetings with the directors of education, and two managers. \r\n\r\nIn all, the process took about a month. \r\n\r\nI was incredibly impressed with Cindy and Lorin in HR. They were professional, communicative, timely, and went above and beyond what was required of them. I felt cared for and prepared each step of the way.", "Interview Questions": "Which of the company values speaks the most to you, and where do you see yourself adding to this value?"}], [{"date": "5 Jun 2019", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American College of Surgeons", "Interview Descriptions": "Contacted by HR immediately after submitting my resume. The in-person interview process was long due to conflicting travel schedules. Great communication with HR. For the first interview, I met the hiring manager, the second round was with a panel, and the third was with the hiring manager again.", "Interview Questions": "Tell me about your professional experience "}, {"date": "1 Aug 2019", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at American College of Surgeons (Chicago, IL) in Apr 2019", "Interview Descriptions": "At approximately 4 months in total, the interview process at ACS was quite lengthy, but also very thorough. The process began with a phone interview, followed by several one on one as well as group interviews. Though intensive, the interview process allowed an excellent preview into the ACS culture and allowed me to assess personal fit. The HR group was exceptionally helpful and transparent during the whole process.", "Interview Questions": "Several behavioral scenarios to assess management style, problem solving, customer service, etc."}, {"date": "10 May 2019", "title": "Trauma Education Program Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Mar 2019", "Interview Descriptions": "During my hiring process all questions were addressed. My interview was smooth and interviewer was very transparent on what to expect about the job. HR was very courteous and professional. I recommend any one to try!", "Interview Questions": "Questions were mainly about your emotional intelligence, and there were no right or wrong answers. Be ready to explain how you overcame complex situations.  Give examples from the lessons learned through failures and achievements.  "}, {"date": "22 May 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at American College of Surgeons (Chicago, IL) in Sept 2018", "Interview Descriptions": "I started in a temp position. The interview process was really quick for the temp and then I was hired within 3-5 days and started working the following Monday. \r\n\r\nAfter a month, I had to re-interview when the position went permanent. I went through the same HR interview, then interview with the hiring manager, and finally a third interview with leadership. I believe this is the usual process followed when an employee is coming on straight into a permanent role.", "Interview Questions": "What was a difficult project you had to complete?"}, {"date": "8 Dec 2021", "title": "Clinical Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Jan 2018", "Interview Descriptions": "Basic interview with Human Resources. Once that was complete I had an interview with the manager. Then an interview with multiple team members. I also met with various managers as well.", "Interview Questions": "What can I bring to this company? "}, {"date": "28 Sept 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at American College of Surgeons (Chicago, IL) in Sept 2017", "Interview Descriptions": "Multiple rounds with multiple people, which can be nice because you get a good sense of the sort of folks you would be working with. Two-on-one interviews can be tough, but doing them well is a great testament to the interviewee's talent! HR was pleasant and communicative, with interviews scheduled around my existing job which was really nice!", "Interview Questions": "Asking about my ability to \"manage up\", as many of the surgeons they work with are esteemed and have great ideas, but those often come with managerial challenges "}, {"date": "11 Jul 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American College of Surgeons (Chicago, IL) in Jun 2017", "Interview Descriptions": "This was one of the strangest interviews I've had. The HR person proceeded to tell me she believed I was overqualified for the position based on the last job on my resume(then why did she contact me, at all?), that the \"Coordinator\" role was more of an entry level \"Assistant role\" (why not call it that in the advertisement then?) and that if I was looking for room for growth, that there \"really was no room for growth\", a bizarre comment as there is almost always some room for growth unless the company has widespread layoffs.  She came across as difficult and bullying. She asked \"Why are you a good fit for this job?\" (a question I rarely get any more, because it's designed to make the candidate \"beg\" for the job). She also asked, \"Why didn't you use your last job as a reference?\"(none of her business who I use as references--very unprofessional). For people out there who are new to interviewing, don't put up with this type of interview! HR interviewers should be polite, respectful, and appropriate at all times. Having this person represent the ACS and their HR department, is only hurting the ACS. It makes me concerned as well, that their current employees may be receiving really poor services from HR.", "Interview Questions": "Why didn't you use your last job as a reference?"}, {"date": "11 Apr 2017", "title": "Data Quality Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Apr 2017", "Interview Descriptions": "First interview was a brief 30 minute phone screening with HR, second interview was also on the phone but with two managers for 1 hour, and third interview was in an person full day panel in Chicago at the headquarters.", "Interview Questions": "Why do you want this job?"}, {"date": "16 Jan 2017", "title": "Congressional Lobbyist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American College of Surgeons (Washington, DC)", "Interview Descriptions": "The interview process was relatively extensive.  I went in on 2 occasions and met with three individuals at various levels within the organization.  The process of receiving a final decision was relatively long and the final decision was relayed through HR.", "Interview Questions": "The extent of my relations with staff and members of the Senate."}], [{"date": "7 Apr 2015", "title": "Director, Convention and Meetings Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American College of Surgeons in Apr 2015", "Interview Descriptions": "I didn't make it past the online application.  I've stopped applying to places with horribly-designed job sites that quit unexpectedly and require me to spend more than 15 minutes in submitting an application.  Just as HR plays a numbers game with applicants, I play a numbers game with companies.  The more job submissions I can get it, the more interest I generate.  Since most online submissions get screened by poorly configured computers, I don't bother with sites that waste my time or seem unprofessional.  The American College of Surgeons site was both.", "Interview Questions": "N/A"}, {"date": "16 Apr 2015", "title": "Senior Java Developer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at American College of Surgeons (Chicago, IL) in Apr 2015", "Interview Descriptions": "American college of Surgeons refused to work through my agency, requiring me to apply directly on line.  Their online application process is very bad.  It is poorly written, and it took at least an hour for me to complete the same questions which my agency already had me answer, and which were on file and I had been thoroughly vetted by my agency.\r\n\r\nThen I had a rambling 30 minute phone interview with HS. The woman again asked the SAME questions, and passed me on to the next step.\r\n\r\nI heard from my agent that I had been passed on, and he scheduled with American college of Surgeons an in-person interview.  This interview would take all afternoon in downtown Chicago.\r\n\r\nI agreed to the meeting, which required me to book travel to Chicago at my expense, taking time off from my current job. \r\n\r\nThen that same evening I received a form email from American college of Surgeons telling me I had been rejected by American college of Surgeons for the job and please do not attempt to contact them!\r\n\r\nI called my agent immediately and he took a day basically asking them what happened?\r\n\r\nAfter that my agent called and said \"Oh, just a little mistake, ignore it.\"\r\n\r\nWell, here I am, with four other real applications in play, with real companies who are being sincere with me, and who so far seem competent.\r\n\r\nSo I told my agent - \"I've got at most twelve hours of business time every week to interview, and American college of Surgeons wants to talk with me directly, and they rejected me, so unless I hear, directly, from American college of Surgeons, from someone with some authority and competency, who can tell my why this mistake was made and why I should now trust them after screwing up such an easy task, I'm done with them. \r\n\r\nI'm writing this negative review to warn any other competent, sincere, busy professionals to stay away from American college of Surgeons or agencies that represent them.  Your time is precious, and there are plenty of competent firms out there.  Don't waste your time on American college of Surgeons.", "Interview Questions": "My background."}, {"date": "1 Mar 2017", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Apr 2015", "Interview Descriptions": "It was long, intense but all in all still a pleasant interview.  Very nice people. HR was extremely well coordinated and again...pleasant about the whole thing.  Seemed that they had representation from all stakeholder areas to come in and meet the candidate.", "Interview Questions": "What is your management style?"}, {"date": "6 Jun 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Feb 2015", "Interview Descriptions": "The phone interview was brief and to the point. The interview scheduled a time via email and called promptly at that time. The interviewer was professional and the session lasted for approximately 30 minutes. I received an email a couple of weeks later informing me that another candidate had been selected.", "Interview Questions": "What was a program that I had to create from scratch without guidance."}, {"date": "16 Sept 2016", "title": "Clinical Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Feb 2015", "Interview Descriptions": "I received a call from a recruiter after submitting my application and resume online.  I performed a telephone interview with the recruiter who asked standard interviewing questions and basic job requirement questions to assure I had the experience to fulfill those requirements.  After a couple of weeks, I received a call and was asked to come for a face-to-face interview with the recruiter and then the manager followed by meeting some of the staff members of the department.  Later I was asked to do a second and final interview.  Days later the recruiter called to offer me the position.", "Interview Questions": "Tell me about your employment background"}, {"date": "22 Oct 2014", "title": "Membership Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American College of Surgeons in Oct 2014", "Interview Descriptions": "The hiring process was lengthy. Take great caution when considering and applying to any positions available in membership and the division of education. The hiring managers were rude, condescending, and did not ask relevant questions that were related to the role. The hiring team rushed through the entire interview (lasting about 25 minutes); the first half of conversation was them trying to figure out what position within membership I actually applied to and the second half of the interview encompassed the hiring leads side-stepping (in a condescending tone) relevant questions that I had - as the interviewee - in regards to the overall health of the division and the culture and climate of working in membership.", "Interview Questions": "There was none. The interviewers were unorganized and cold, and at times, really unprofessional, taking questions that I asked of them in regards to the division, personal (getting defensive)."}, {"date": "10 Nov 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American College of Surgeons (Chicago, IL) in Oct 2014", "Interview Descriptions": "The interview process was very thorough. The first part was a phone interview with HR. The representative was very knowledgeable about the company and position as well as friendly. The 2nd part was a face to face with managers of the department. They offered great detail about the role and upcoming challenges. The final stage was a face to face with chief of department.", "Interview Questions": "N/A"}, {"date": "3 Sept 2014", "title": "Regulatory and Quality Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American College of Surgeons (Washington, DC)", "Interview Descriptions": "Applied online.  HR contacted for a phone interview.  Complete phone interview within a few days.  Called 3 days later for an in person interview.  At the in person interview I met with the the two managers I would be working with.  The first interview went well, she explained the position, her role and how this position would be of an assistance.  The second manager came in.  At first glance she seemed to have made up her mind about me.  Throughout the interview she repeatedly asked the same question, without listening to my answer.  Then when asked a question, she was rude.  After meeting with her, she changed my perspective of this office.  As a manager, you should be able to listen, and I could see from the interview I would not be able to work with her from her lack of attention to detail and to someone who would be working with her.", "Interview Questions": "No questions were difficult.  Questions asked were normal interview questions."}, {"date": "27 Apr 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at American College of Surgeons", "Interview Descriptions": "Speaking with the talent manager was very relaxed and informative", "Interview Questions": "There was nothing out of the ordinary on the phone interview- just be prepared for the basics. I found myself skipping around my resume a lot to find appropriate answers"}, {"date": "16 Apr 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at American College of Surgeons", "Interview Descriptions": "The interview process was a very basic process. Depending on the department you may have two or three different days that you have to come in for an interview. The first interview is with the Human Resources Department. The second on is with the department manager and the third is with the Administrator or Director of the department or division.", "Interview Questions": "Basic questions. Nothing out of the ordinary."}], [{"date": "15 May 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at American College of Surgeons in Apr 2014", "Interview Descriptions": "The process took about two weeks, was relaxed and enjoyable. The recruiter was very pleasant and easy to talk to. There is an online  process, then a phone screen and an in-person interview with hiring/department managers.", "Interview Questions": "Nothing too unexpected. Thoughtful questions."}, {"date": "22 Feb 2014", "title": "SAS Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American College of Surgeons in Feb 2014", "Interview Descriptions": "Brief HR phone screening, then telephone interview, then face-to-face interview.", "Interview Questions": "Nothing particularly unusual.  Job description was vague as to experience level desired; I spent some time trying to tease out exactly what they wanted."}, {"date": "22 Jul 2013", "title": "Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American College of Surgeons", "Interview Descriptions": "I applied online and got phone interview.", "Interview Questions": "No difficult or unexpected question."}, {"date": "11 Nov 2010", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at American College of Surgeons (Chicago, IL) in Jan 2010", "Interview Descriptions": "Interview was basic. Wanted to know what type of of supervisory experience I expected and was pleased to learn That I preferred a hands off approach.  My leader lacked supervisory and interpersonal skills.  Open door policy was almost non-existent and received little training.", "Interview Questions": "Do you work well independently?"}]]