[[{"date": "31 May 2023", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at GlobalGiving in May 2023", "Interview Descriptions": "The interview process, while very lengthy, was very well thought out and gave me a good understanding of the work environment/culture at GlobalGiving. I first had a 30 minute interview with HR where we covered basic questions related to competencies. The next step of the interview process included a homework assignment where I had to create a deck for a client. The assignment felt very relevant to the type of work the role would entail. They were very clear on the next steps for the interview process as well as the interview timeline which I really appreciated. I did not continue with the interview process but was informed that the next step would include a panel interview with the team members to discuss specifics about the role/job scope and a final interview with someone from Management to discuss soft skills and assess overall compatibility. Overall, the interview process was very thorough, intentional and gave me a positive impression of the working environment at GlobalGiving.", "Interview Questions": "What experience do you have in account management?"}, {"date": "23 May 2023", "title": "Marketing And Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GlobalGiving (London, England) in Apr 2023", "Interview Descriptions": "The process was fairly lengthy, starting with a written task and followed by three rounds of interviews with different team members. The first round was with members of the marketing team, the second round was with members of the UK branch, and the third round was with the UK CEO.", "Interview Questions": "Which of our values do you align with the most?"}, {"date": "5 Oct 2022", "title": "Business Partnerships Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GlobalGiving", "Interview Descriptions": "Online application, phone interview, and homework assignment. Overall, the homework assignment was disorganized and lacked clear directions. I was given two different homework assignments instruction. The interviewee was a hired recruiter and could not answer specifics about the organization or give feedback.", "Interview Questions": "How do you like being managed and working within a group."}, {"date": "5 Oct 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "Online application, phone interview, and homework assignment Overall, the homework assignment was disorganized and lacked clear directions. I was given two different homework assignments instruction. The interviewee was a hired recruiter and could not answer specifics about the organization or give feedback.", "Interview Questions": "Tell Me About Yourself. What’s Your Management Style?"}, {"date": "21 Feb 2022", "title": "Disaster Response Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "Initial video interview, followed by a two to four hour assignment and then a video interview with several members of my potential new team. At each stage candidates were eliminated.", "Interview Questions": "What is the most important part of disaster response?"}, {"date": "29 Dec 2021", "title": "Grants Management Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "The process is incredibly complex. Global Giving demands signifiant amounts of time over 5 stages. At the end of the process all you receive emails is a curt email.  You must be all in.", "Interview Questions": "When did you encounter adversity? "}, {"date": "4 Jan 2022", "title": "Senior Associate Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at GlobalGiving in Aug 2021", "Interview Descriptions": "20-30 min intro call, invitation to submit an assignment, 60 min call with team members and 30 mins with hiring manager to answer additional questions, not sure about the process following this last step", "Interview Questions": "how do i handle multiple incoming requests?\nWhat partners would I be excited to work with?\nWhat would be training I want to focus on?\nTell us about a time that was a learning experience.\nWhat is my working style?"}, {"date": "3 Jan 2023", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at GlobalGiving (Washington, DC) in Aug 2021", "Interview Descriptions": "Long and tedious. Take home test and a lot of hoops to jump through. It is totally unnecessary as at the end of the day sometimes people may not know everything but are fast learners and hard workers and really have the potential of exceeding expectations.", "Interview Questions": "The usual questions but the take home exam was alot. Clearly they have no respect for other peoples time."}, {"date": "19 Jul 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "Long with a Lot of questions and a homework assignment. this was very tiring but the organization prides itself in selecting the right person for the right job so it is a great place to work.", "Interview Questions": "Why are you interesting in this position?\r\nHow are you a good fit?\r\nWhat do you think about the way traditional non profits work?"}, {"date": "7 Jul 2021", "title": "Desktop Support Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "One on one interview, mostly behavioral questions. followed by a \"homework assignment\" to create a piece of training material for a touch screen whiteboard. We were given two weeks to complete this assignment. There was a final interview stage after this that I was not selected for.", "Interview Questions": "Q: What is your dream job?"}], [{"date": "5 Apr 2023", "title": "Social Media Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at GlobalGiving (Washington, DC) in Jun 2021", "Interview Descriptions": "The first interview was a typical screener interview. I then made it far enough to do a panel interview with several team members, but first, I had to complete a \"homework assignment.\" The panel interview was interesting, and I didn't feel like any questions were \"gotcha\" questions. However, the HR portion of this interview was a bit odd, and I felt as though it did not accurately get a feel for how I would fit into the environment at GlobalGiving. Despite all of the kind people I interacted with, I was saddened by the fact that after this interview, I was dragged along for six weeks, with promises that I would find out whether or not I would get the job scattered throughout that time. I found out I did not get the job because they decided to relist the position on LinkedIn. It was quite a bummer, given that I gave them over 4 hours of interview time and a presentation I made to show my skill set. I would still be interested in working here; it was just a bummer at the time.", "Interview Questions": "When did you disagree with someone and have to deal with the problem?"}, {"date": "27 May 2021", "title": "Vetting and Grants Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "Not too long , fairly easy. They were nice but I was not expecting a homework question so through me off a bit. Also o felt like the job description was kinda vague so I honestly didn’t really know what the role was for but overall it turned out okay. Just didn’t get hired", "Interview Questions": "Asked me to go over my homework in detail which I wasn’t expecting "}, {"date": "5 May 2021", "title": "Operations Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GlobalGiving", "Interview Descriptions": "3 stages: one-sided video interview (answering questions and submitting video answer), written assignment, then practical interview with spreadsheet/SQL questions. Everyone was very nice and the process went quickly. Good response time on emails as well.", "Interview Questions": "standard questions about the role/organization"}, {"date": "19 May 2021", "title": "Vetting and Grants Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at GlobalGiving in May 2021", "Interview Descriptions": "First round was a digital interview, with three tries per question. Second round was a 4 hour assignment. Final round was a video interview with current staff and team supervisors.", "Interview Questions": "What was your thought process in approaching the assignment?"}, {"date": "13 Aug 2021", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GlobalGiving (Washington, DC) in May 2020", "Interview Descriptions": "The interview was typical and straightforward. They were friendly and nothing was too unexpected, but I did not get the role. However, I had a positive impression and would be interested in GlobalGiving in the future would a position arise.", "Interview Questions": "Examples of challenges you've faced"}, {"date": "8 Apr 2020", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "Fair and straightforward interview process with several stages and a written task. More than one sentence feedback after the rejection at the final stage would have been great. Nice people overall that also try to get to know you on a personal level.", "Interview Questions": "The usual interview questions were asked, no big surprises"}, {"date": "9 Dec 2019", "title": "Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GlobalGiving", "Interview Descriptions": "The interview process was lengthy but fair and transparent. They will want to know that you have the passion to carry out their vision while being well versed in the technical aspects of whichever position you are going for.", "Interview Questions": "How will you be a valuable addition to the GlobalGiving team?"}, {"date": "27 Apr 2019", "title": "Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GlobalGiving", "Interview Descriptions": "The interview process was pretty comprehensive. It ocat least a 3 part interview. The first round is behavioral questions, the second round you complete a homework assignment. Did not make it past the second round.", "Interview Questions": "Typical behavioral questions"}, {"date": "5 Dec 2018", "title": "Programmer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GlobalGiving", "Interview Descriptions": "Positive experience, two stage interview in person and over the phone. There is a written, situational task during the interview. Both interviewers were lovely and put you at ease and asked a wide range of questions", "Interview Questions": "What are you passionate about "}, {"date": "6 Sept 2018", "title": "Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at GlobalGiving (Washington, DC)", "Interview Descriptions": "The interview process at GlobalGiving is thorough. They do a phone interview, and at least one in-person interview, usually with several people.  The whole process was a few weeks long and they run a tight ship. I was very impressed with how organized it was. I interviewed with 8 people in one day which was exhausting but gave me a very well-rounded idea of the team and what it was like to work there.", "Interview Questions": "What software do you use?"}], [{"date": "6 Sept 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at GlobalGiving (Harare) in Aug 2017", "Interview Descriptions": "Two step process with board and employees. Involved presentation to the board and financial competency test, plus the opportunity to engage with community members as well as staff members and volunteers.", "Interview Questions": "Q: What would your vision to enhance sustainability be"}, {"date": "30 Mar 2017", "title": "Field Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at GlobalGiving", "Interview Descriptions": "One phone interview and two skype interviews. Interviewers are very friendly and are there to answer your questions. They don't try to put you on the spot or intimidate you. I would recommend having lots of questions for them.", "Interview Questions": "Tell me about a time you were traveling and something went really wrong."}, {"date": "24 Mar 2017", "title": "Fellowship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GlobalGiving", "Interview Descriptions": "Very quick interview scheduling after I completed my interview.  The first step is a 15 minute phone interview with someone in the department you are applying to.  There are multiple steps to the interview process if you get trough.", "Interview Questions": "Behavioral questions (Tell mw a time when you.....) look over common behavioral questions before you interview"}, {"date": "2 Oct 2018", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at GlobalGiving in Mar 2017", "Interview Descriptions": "I had a phone screen with the hiring manager. I then had multiple video virtual interviews with several members of the team I was interviewing for. I also completed two assignments based on the type of work I'd be doing. I knew the salary, vacation time, and start date in advance for the fellowship role, so there was no negotiation.", "Interview Questions": "How have your experiences prepared you for this role? How would you develop a new partnership?"}, {"date": "1 Jul 2016", "title": "Programs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GlobalGiving in Jun 2016", "Interview Descriptions": "The vetting process at GlobalGiving is very extensive, but speaks to their desire to invest in their employees.  The process took 4 weeks and included 2 phone interview, a homework assignment and an in person interview. Despite taking a month, the process was seamless and the hiring manager was true to her timeline.", "Interview Questions": "What does GlobalGiving do? Name a time you received feedback you disagreed with? 30 second elevator speech for your self? How would your former colleges describe you? Describe a project that made you proud?"}, {"date": "15 Apr 2016", "title": "Program Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at GlobalGiving (Washington, DC) in Mar 2016", "Interview Descriptions": "The interview process for the GlobalGiving Fellows program was incredibly well-organized, professional, and thorough. The initial application was extensive, and followed by a brief preliminary interview. The next round consisted of a homework assignment that gave insight into the type of work typical of the position. This was followed by an interview with the entire Program team. The final round was an interview with a member of the executive team.\r\n\r\nThe interview process was incredibly comprehensive and it was clear that GlobalGiving wanted to explore each applicant's \"fit\" in terms of experience and work style, as well as personality.", "Interview Questions": "How would you explain to someone what GlobalGiving does in the most simple, concise way?"}, {"date": "1 Mar 2016", "title": "Fellowship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GlobalGiving in Feb 2016", "Interview Descriptions": "Around a week after submitting my application online I was asked to do a phone interview. The interview was brief, the interviewer told me ahead of time she would limit it to fifteen minutes, and covered standard questions. The interviewer was very helpful in answering my own questions about the organization and the hiring process. I was informed via email within a week that I had not moved onto the next round.", "Interview Questions": "Describe a time you had to work with someone difficult"}, {"date": "10 Nov 2015", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GlobalGiving", "Interview Descriptions": "I was offered an initial phone interview just two days after applying. The interview lasted 15 minutes and was very straightforward. The interviewer was friendly and gave me time to ask questions. Unfortunately, I did not move onto the next round of interviews and was informed by email one week after initial phone interview.", "Interview Questions": "What does Globalgiving do?"}, {"date": "1 Oct 2017", "title": "Field Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GlobalGiving (Washington, DC) in Nov 2015", "Interview Descriptions": "Skype interview was very straight forward and they were very understanding when it came to technical issues! Questions revolved around experience with nonprofit organizations, ability to travel alone and handle unexpected circumstances, also some quirky questions about personality and work style.", "Interview Questions": "What would you do if you made all your travel plans in advance and everything that could possibly go wrong did? How would you react?"}, {"date": "31 Aug 2015", "title": "Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at GlobalGiving (Washington, DC) in Aug 2015", "Interview Descriptions": "After submitting my application online, I very quickly (within a day) received an email asking me to sign up via Doodle for an initial phone interview the following week. I was interviewed by the correct office manager, who was very kind and helpful, answering all my questions. I haven't heard back from the company yet but am told I will hear within the coming week either way (whether I move on to a second round interview).", "Interview Questions": "What is the nicest thing you've done for somebody lately?  Give me your 30-second sales pitch for yourself. When is a time you were most analytical?"}], [{"date": "14 Jun 2015", "title": "Presidential Writing Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GlobalGiving", "Interview Descriptions": "The interview experience consisted of submitting an online application, followed by a phone screen interview. After getting through the phone interview stage, I was asked to submit a writing assignment  informed by several articles. I was not successful after this stage, but if I had been would have had one more round of interviews. I really enjoyed my phone interview and found the writing assignment interesting and challenging. Also, GlobalGiving was willing to provide me with feedback on my writing assignment, which I appreciated.", "Interview Questions": "What are your sources for news and current events? What is a recent article that you read?"}, {"date": "12 Jul 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at GlobalGiving (Washington, DC) in Mar 2014", "Interview Descriptions": "Set up a phone interview after a week of communication. Interviewed with three members of prospective team in an informal manner. Discussed my experience and desire to work at GlobalGiving. Opportunity to show personality and research!", "Interview Questions": "Why do you want to intern with us?"}, {"date": "29 Apr 2014", "title": "Program Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at GlobalGiving (Washington, DC) in Dec 2013", "Interview Descriptions": "Found them through my universities career site, got initial interview, had in-person interview in the GG office, heard back within a week", "Interview Questions": "What was a difficult customer service situation?"}, {"date": "29 Apr 2013", "title": "Intern Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at GlobalGiving", "Interview Descriptions": "Phone interview with questions about past experiences and why I wanted to work with GG", "Interview Questions": "Asked to summarize GG's mission. Tip: Go through GG's website and get a good understanding of the organization. "}, {"date": "10 May 2013", "title": "Justiziar / Leiter der Rechtsabteilung Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at GlobalGiving in Jan 2013", "Interview Descriptions": "- Really rapid answer - got job offer 2 days after interview\r\n- Asked me about my knowledge about GlobalGiving, why I wanted to work there, why I was interested in working within nonprofits, about my passion.\r\n- Asked me about my experience, what I contributed in my previous work experiences.", "Interview Questions": "Asked me why they should hire me."}]]