[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great team doing meaningful work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Jun 2021", "job_title": "Anonymous Employee in San Jose, CA", "duration": "N/A", "pros": "This is a very mission-driven organization, and it shows in every aspect of the Foundation's work. The leadership and staff care deeply about helping women in need. \n\nThe office environment is also kind and supportive. This was true throughout my tenure, and was particularly important during the pandemic. I truly enjoyed coming to work every day at Fistula Foundation.", "cons": "No red flags to note."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Honorable work. Forward-thinking international charity.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Aug 2016", "job_title": "Senior Director, Donor Relations in San Jose, CA", "duration": "N/A", "pros": "I returned to Fistula Foundation 6 months ago, because it aligns with my personal values.  I now get to show up every day, do a job I’m good at, for an honorable mission, knowing that each day I’m changing women’s lives and enabling hardworking developing country hospital teams who are dedicating themselves to healing them.  \r\n\r\nSince 2010, I’ve seen the full-time staff headcount increase from 4 to 13.  I’m impressed and grateful to see the impact this expanded team is having daily.  \r\n\r\nMy colleagues are interesting and smart.  They are self-disciplined.  They care about producing individual work that positively impacts the Foundation’s bottom-line results, to fulfill Fistula Foundation’s mission.  \r\n\r\nI earn a competitive salary.  My benefits include health insurance, a 403b match and a good number of vacation and sick days.  Within the last 6 months, I’ve seen three colleagues take vacations of two to three weeks away from the office.  Such a thing was not considered acceptable at all the other workplaces I’ve known.", "cons": "Fistula Foundation’s mission is ambitious.  Right now, for every one woman Fistula Foundation helped provide fistula surgery for, 50 are still waiting.  \r\n\r\nSo, for my individual work, my biggest enemy is time.  Perpetually, I face more opportunities and things I could do than are possible to do in a day, or even over a year.  So, I rely on decision-making and priority setting in order to leave at the end of the day and feel satisfied for myself that I’ve done a good day’s work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Aug 2019", "job_title": "Anonymous Employee in San Jose, CA", "duration": "N/A", "pros": "Fistula Foundation's mission is outstanding. It is truly profound to go to work every day, knowing that you are giving a woman the precious gift of health. What's more, this vital mission is embraced by the staff, and it shows. The team here is dedicated, supportive, driven, and kind.\r\n\r\nFistula Foundation is well-run, transparent, and effective with all its resources. The leadership takes its responsibility seriously and steers the organization well.\r\n\r\nI feel very lucky to do this work. In previous nonprofit jobs, I felt that I was sowing seeds that I would never see come to fruition. However, one fistula repair surgery can truly transform a woman’s life. That’s a great feeling!", "cons": "Only the natural hiccups that come with a growing organization, nothing of great concern."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Mission - Supportive Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 Jul 2019", "job_title": "Anonymous Employee in San Jose, CA", "duration": "N/A", "pros": "Fistula Foundation is a great place to work.  the mission is meaningful: it helps indigent women in Africa and Asia receive life-changing care.  The atmosphere is friendly and generally relaxed.  Benefits are terrific, including fully paid health care premium, summer hours -- meaning early out on Fridays, and generous PTO.   New employees usually get to go to Africa to see the work being supported by the Foundation.", "cons": "Because it's a women's health issue, women seem to be attracted to working here.  We only have one guy on the US based staff team."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great people, well run", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Oct 2020", "job_title": "Database Administrator in San Jose, CA", "duration": "N/A", "pros": "This is an organization that is focused on it's mission and cares about everyone \r\n (women receiving services, donors, and staff) involved in fulfilling that mission.", "cons": "Some seasons can be very busy."}], []]