[[{"date": "7 Oct 2021", "title": "Assistant Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Lighthouse Guild (New York, NY)", "Interview Descriptions": "Referred by an employee at the company. Submitted my resume then called in for an interview. Was placed in a classroom for observation to see how the classroom is conducted. Then called back so they can observe me with a few students.", "Interview Questions": "How do I feel about toilet training and teaching proper hygiene to the teenage students?"}, {"date": "2 May 2021", "title": "Bar Staff Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Lighthouse Guild (Shoreditch, England) in Jan 2020", "Interview Descriptions": "Two managers interviewing people back-to-back in the same space so I could hear the conversation the other manager was having with the other applicant. The manager I spoke to had only recently started working at the venue and didn't seem like they really had the hang of it yet, they didn't even know what other venues were part of the same group - unless that was a way to test my knowledge but only made them seem unprofessional and clueless.", "Interview Questions": "Can you tell me a little bit about yourself."}, {"date": "12 Dec 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lighthouse Guild", "Interview Descriptions": "It was about getting to know me and how I can help others.  They wanted to know that I can be kind towards others and that I know what to expect from the interview.  Overall, it was very simple and I liked to know more about the staff there.", "Interview Questions": "What do you see around you? What's different about the people"}, {"date": "19 Sept 2016", "title": "Associate Director Development Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Lighthouse Guild (New York, NY) in Jun 2016", "Interview Descriptions": "Contacted by Human Resources for 30 minute phone interview. Invited for meeting with two people in development department. Interviews were approximately 45 minutes apiece. Both were conducted by extremely intelligent, thoughtful people clearly invested in their work. Both were informative sessions filled with appropriate, inquisitive questions pertinent to the work available. It was a give and take exchange of information between curious professionals. The organization is still going through some growing pains which were communicated in a fair way.", "Interview Questions": "What is your experience regarding donor management and stewardship."}, {"date": "5 May 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Lighthouse Guild (New York, NY) in Jan 2014", "Interview Descriptions": "The process was very brief and organized. They required you to register, and fill up a couple forms online, and was met with somebody from the organization to verify your interest and capabilites.", "Interview Questions": "Why are you interested in volunteering with Lighthouse Guild? \r\n"}, {"date": "20 May 2017", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Lighthouse Guild in Dec 2013", "Interview Descriptions": "it's a pretty grueling 3 hour process which includes case management skill test and computer skill test. They aim to recruit very qualified candidate for case management. I think they succeed for the most part. They then set these case managers up to fail by bombarding them with unmanageable case load, very little support and incompetent and micromanagers.", "Interview Questions": "Case scenario about handling crisis on the phone and it's the end of your work day. "}], [], []]