[[{"date": "6 Jul 2023", "title": "Research Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ODI (London, England) in May 2023", "Interview Descriptions": "The interview was held via a panel of four via Microsoft Teams. The questions were thoughtful but tough. The team was clearly invested in finding the right person and it was a good experience. I did find it odd that the interviews were held in a single call, which means you could see the next interviewee in the virtual waiting room.", "Interview Questions": "If you could research any topic without budget constraints, what would it be?"}, {"date": "29 Oct 2022", "title": "Fellowship Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ODI", "Interview Descriptions": "Three people taking turns to ask questions, focused on Econ knowledge, reasons for wanting the job, and past experience. Took place on zoom as was during Covid. There was an opportunity to ask questions myself at the end", "Interview Questions": "If you were finance minister of a developing country, how would you consider ESG"}, {"date": "24 Mar 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ODI (London, England) in Oct 2022", "Interview Descriptions": "Mostly based on past experiences as well as how I will be an asset to the company. This also includes tying in personal experiences to the particular role and how I could be of value to the company.", "Interview Questions": "Region of expertise or interest if any"}, {"date": "28 Mar 2022", "title": "Marketing and Communications Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ODI (London, England)", "Interview Descriptions": "A 30 minute test finding grammar and spelling mistakes in a report. Some re-writing required. \r\n\r\nFollowed by an interview with 2 employees who asked about previous experiences. The interview was conducted at the London office and lasted for about 90 mins.", "Interview Questions": "Explain your previous editorial experience. "}, {"date": "5 Nov 2021", "title": "Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ODI", "Interview Descriptions": "The usual questions on experience, but also a broad ranging economics grilling to explore suitability for posting in overseas government. quite academic focused, as scheme hires many graduates of masters degrees", "Interview Questions": "Development focused economics questions and experiences"}, {"date": "12 Jul 2022", "title": "Project Management Officer (PMO) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ODI (London, England) in Jul 2021", "Interview Descriptions": "I was sent an online task and given one hour to complete. This was scheduled in advance. Was asked to complete a series of tasks and mail back the responses to the HR team.", "Interview Questions": "3 different sections\r\n1: An excel spreadsheet where you had to respond to some questions based on the data given\r\n2: A prioritisation task with 3 scenarios and had to justify answers\r\n3: Write an email in a given scenario"}, {"date": "2 Mar 2021", "title": "Research Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ODI (London, England) in Oct 2020", "Interview Descriptions": "The interview process comprised of a quantitative data analysis test on excel, R or Stata (held the day before the interview), a powerpoint presentation on the specific subject matter (subject provided beforehand) and an interview with 3 people.", "Interview Questions": "Go over your past experience, subject specific questions, strengths, weaknesses. "}, {"date": "2 Jul 2020", "title": "Digital Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ODI (London, England) in Jun 2020", "Interview Descriptions": "Shortlisted applicants were asked to attend an interview (online due to COVID) and prepare a presentation about a given topic. \r\n\r\nThe interview was reasonable, and the panel explained the next steps of the process clearly, saying that they'd communicate their decision in the beginning of the following week. Unfortunately that wasn't the case, instead they told me two weeks later and after several follow-up emails from my side. They didn't apologise for the delay, nor they explained the reasons why, which I found unprofessional and disrespectful of my time.  \r\n\r\nFinally, the HR person told me I didn't get the job via what was obviously an email template (ie \"we won't be progressing with your application further\") and no specific feedback. In my experience, I've always received feedback on the interview and/or task when I got to the final stage.\r\n\r\nAlthough this company seems to be doing some interesting work, these were some red flags to me and I was somehow relieved I wasn't offered the position.", "Interview Questions": "How do you prioritise content production and distribution?"}, {"date": "3 Mar 2020", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at ODI (London, England)", "Interview Descriptions": "The whole process has been three months, from applying, interviewing and then never hearing back.\n\nInterview: 30 min test to be presented during the interview. They lost the USB I saved it on and I had to present from memory. The interview panel was different from those listed in the email and did not include the line-manager.\n\nAfter: they said I would hear back about a second interview in the next week, but despite chasing them a few times, two months later I haven't heard a response.", "Interview Questions": "Why are you interested in ODI?"}, {"date": "18 Nov 2019", "title": "Project Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ODI (London, England) in Aug 2019", "Interview Descriptions": "Applied online, was sent a test (mainly Excel) to complete a day before the interview (had one hour and a half to complete it) and then attended a 45mn interview.\r\n\r\nNever heard from them after that, not even to say I was unsuccessful.. I contacted HR but they never got back to me, so unprofessional and disappointing from such a reputable organisation!\r\nI've always been offered feedback from every single interview I've had in the charity sector, even from very small and short-staffed organisations, so I wasn't expecting a bigger organisation with an HR department to not even take 2 mns of their time to follow-up with an email after the interview...", "Interview Questions": "Why do you want to work for us\r\nHow do you manage up\r\nWhat tools do you use to manage projects"}], [{"date": "28 Jun 2019", "title": "Digital Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ODI (London, England) in Apr 2019", "Interview Descriptions": "Contacted via email following an online application on the company recruitment platform. \r\nI was sent a short test to complete (45 mins),  and expected to create a small presentation for the panel. \r\nCommunication for the test was confusing and unclear that it had to be completed during working hours. \r\nNo feedback at all was provided following the process--not even information stating the interview was unsuccessful", "Interview Questions": "general questions on the digital environment, what you think could improve the digital plan for the organisation, and how you deal with different circumstances in the workplace "}, {"date": "23 May 2018", "title": "Fellowship Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ODI (London, England)", "Interview Descriptions": "There were two parts. The first one was a group discussion in which the participants were confronted with different situations that could occur during the fellowship. We were supposed to discuss and present our views and opinions.  The second  part was a personal interview with two ODI staff members and two external economists who asked economics-related questions.", "Interview Questions": "Sexual harassment in the workplace. What do you do? \r\n"}, {"date": "10 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ODI", "Interview Descriptions": "Very informal and chill. Applied through school. It was unstructured. Interviewer was really friendly and made clear what projects I would be able to work on. Did not ask any technical questions.", "Interview Questions": "Tell me about yourself"}, {"date": "19 Feb 2018", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at ODI (London, England)", "Interview Descriptions": "I applied on their website and received an email for an interview about 3 weeks after making the application. \r\nI was asked to complete three pre-interview tasks (1. Excel task - finding errors, updating the sheets and explaining what sort of changes you made and why 2. Prioritisation - giving you a list of tasks and ask you to number them in terms of priority 3. Email draft - writing to a contractor who hasn't submitted his work for a while) remotely for an hour before the interview. \r\nThe interview was with a panel of 3 - line manager to be, a senior manager who'd work closely with a selected candidate and a programme manager who will be your colleague in the same team. \r\nThey all seemed nice and it was quite average - competency based questions, tell us about your experience, what skills do you have to do this all based on the job description.  No challenging or provoking questions. They also went through my CV and asked  me to explain further about some relevant experience. \r\nSomething I found a bit odd was that, during the interview, the programme manager who could be your colleague in the same team asked me my current salary & salary requirement for the role. That could be quite awkward for your colleague in the same role as you in the same team to know your salary. \r\nAbout a week after the interview, I got an email that I didn't get the role.", "Interview Questions": "Q. Out of the three pre-interview tasks, which one did you find most difficult? \r\nQ. Tell us why you want to work for ODI\r\nQ. Tell us why we should hire you"}, {"date": "1 Nov 2017", "title": "Senior Event Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ODI (London, England) in Oct 2017", "Interview Descriptions": "I applied on the Overseas development institute website, got invited to an interview two weeks later. It was a Panel of two. Backgroud and competency based questions, written test afterwards", "Interview Questions": "What is the most important element required to make a project work"}, {"date": "10 Jul 2017", "title": "ODI Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at ODI (London, England)", "Interview Descriptions": "3 essays, 1 group discussion and 1 panel interview.Group discussions include questions around how would you deal with corruption in the work place?  Essays and group discussion are mostly to test personality traits. 1 Panel interview is technical (economics related questions).", "Interview Questions": "If you had 2 energy sources to invest in, how would you go about deciding which one is better ?"}, {"date": "22 Feb 2018", "title": "Senior Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ODI (London, England) in Jun 2017", "Interview Descriptions": "As I was not in London at the time, I was asked to appear for a Skype interview, which I did. The interview began on time and lasted for approximately an hour. There were three individuals on the interview panel, two of whom were mid-level professionals and the third a member of the top brass.", "Interview Questions": "I was asked to describe my doctoral research briefly (as I was close to completed a PhD at the time)."}, {"date": "23 Aug 2018", "title": "Research Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ODI (London, England) in Mar 2017", "Interview Descriptions": "One week later the application, a skype interview was conducted. Candidates needed to provide presentation relating to the job description. Then, the interviewees asked questions relating to the presentation, technical skills and knowledges. No competency based questions.", "Interview Questions": "How do you communicate wit the team remotely? what is your experience in quantitative analysis?"}, {"date": "8 Feb 2021", "title": "Sales Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ODI (Newyork, Argyll and Bute, Scotland) in Jan 2017", "Interview Descriptions": "Very thorough as they mainly focus on your speech ability and your ability to convince customers. They also hold the interview through a number of panalists and they take turn interviewing.", "Interview Questions": "Sell me a product you think i can buy"}, {"date": "6 Nov 2016", "title": "ODI Fellowship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ODI", "Interview Descriptions": "The interview consisted of a group activity and then a panel interview. The group activity was relatively straightforward and involved discussing hypothetical scenarios that could happen on the posting. The interview was more tough and involved discussing a number of economics questions, generally of development economics relevance, and then competency questions. There was also a question about country preferences, where you would be willing to go etc,", "Interview Questions": "What is Dutch Disease?"}], [{"date": "12 Nov 2016", "title": "Personal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ODI (London, England) in Sept 2016", "Interview Descriptions": "You'll begin by undertaking a PA test. You'll have an hour to complete as many PA related tasks as possible, including replying to emails as yourself and as your boss, spreadsheet work and prioritization activities. \r\n\r\nIf you pass the PA test, you then move onto a physical interview with your line manager and a panel of two more people.\r\n\r\nYou are required to undertake a background and health assessment check.", "Interview Questions": "How do you prioritize what is most urgent?\r\nHow do you react under pressure?"}, {"date": "24 Jun 2019", "title": "ODI Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ODI (London, England) in Jun 2016", "Interview Descriptions": "There were 2 main interviews. The first was a group exercise where various candidates were asked to discuss the various responses to a hypothetical challenge. The second was a panel interview where I had to answer questions about economic theory.", "Interview Questions": "What is the relevance of information asymmetries in the provision of loans. "}, {"date": "13 Dec 2016", "title": "ODI Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at ODI (London, England) in Feb 2016", "Interview Descriptions": "First one has to submit an online application with lots of behavioural HR questions. The subsequent interview is with a panel of 3-4 ODI employees and very technical (lots of econ questions). In addition to the interview there is a very generic assessment center where one has to discuss in a group a solution to a problem arising in a developing country work environment.", "Interview Questions": "What are the dangers of expansive fiscal policy in developing countries?"}, {"date": "18 Feb 2015", "title": "ODI Fellowship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ODI (London, England) in Feb 2014", "Interview Descriptions": "Group discussion and panel interview with 4 interviewer. In the group interview, everyone will be given a scenario that  might face during the job, and you need to disuses your scenario with your group mate and have a short presentation at the end. In the panel interview, there will be mixture of behavioral and technical questions. The interviewers are quite nice, if you don't know the answers, they will give you some hints.", "Interview Questions": "what's QE and its effects on developing countries"}, {"date": "29 May 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at ODI (London, England) in Aug 2013", "Interview Descriptions": "Met with group leader. Walked through resume and my academic background. Explained to me what the job was about. It was a great experience and I learnt a lot from the internship experience. I assisted research fellows on several ongoing projects.", "Interview Questions": "Walk me through your resume"}, {"date": "2 Aug 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at ODI (London, England) in May 2013", "Interview Descriptions": "Very positive experience. First round was a phone interview and was interviewed by two members of staff. Really enjoyed working with their HR department and everyone was very friendly and welcoming. Staff is very knowledgeable and collaborative. Excellent working environment.", "Interview Questions": "Create a sample research methodology."}, {"date": "24 Jul 2016", "title": "Programmer Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ODI (London, England) in Apr 2013", "Interview Descriptions": "I was interviewed by two people. Lengthy interview asking about competencies, work experience. I had to sit tests (1) IT skills (2) prioritising workload. \r\n\r\nI didn't get the job and was notified via email. I requested feedback on my application but I simply recieved another email telling me that my application was unsuccessful.", "Interview Questions": "They asked about my previous experience with budgeting."}]]