[[{"date": "14 Apr 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Covia (Charlotte, NC) in Jan 2023", "Interview Descriptions": "It was really awful. To replace someone who was leaving after less than a year at that position. Interviewer was doing first interviews for his replacement. He was leaving in 2 days.", "Interview Questions": "Asked about experience with financial hedges."}, {"date": "17 Nov 2021", "title": "Outreach Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Covia (Walnut Creek, CA) in Nov 2021", "Interview Descriptions": "It is a quick and remote interview, the interviewed person is friendly. I would say it is not too hard and you can talk a lot to HR. Recommend to you", "Interview Questions": "What is your career plan in the next 1-2 years."}, {"date": "24 Oct 2021", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Covia", "Interview Descriptions": "Easy, laid-back interview. Simple questions about goals, what shift looking for, etc. Took a tour of the building. Able to ask plenty of questions. Staff was very friendly and inviting.", "Interview Questions": "What shifts can you work?"}, {"date": "1 Oct 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covia", "Interview Descriptions": "The interviewers were very friendly and flexible. Questions were of average difficulty. Enjoyed my interview with them the time flew by. I was excited to work for the company after the interview.", "Interview Questions": "What draws you to work with older adults? "}, {"date": "21 Apr 2021", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covia", "Interview Descriptions": "Met with majority of leadership within the team. Met with team members multiple times and had the opportunity to ask questions to them. Felt like they answered a majority of my questions and gave honest feedback about areas they needed support in.", "Interview Questions": "Why I was looking to join the company and what skills I could bring. "}, {"date": "17 Jan 2021", "title": "General Labor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Covia", "Interview Descriptions": "Applied on line within about 3-4 days was contacted by HR asked few questions.  Called by Director set up interview in person. Interview was about 40 mins, more chit chat basic questions.", "Interview Questions": "Front Desk Person was very nice and friendly.  The waiting area was very nice and they offered refreshments.  The interview did start on time. Simple questions ask, strengths, weaknesses, etc.  Some what forth coming and made sound like would get properly trained.  Which was not true.  "}, {"date": "27 Oct 2021", "title": "Chaplain Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Covia (Sonoma, CA) in Sept 2020", "Interview Descriptions": "The interview went through several iterations, starting with the Lead Chaplain and HR person, and  ending with the Executive Director and the senior staff at the facility I was applying to - totalling about seven or people.", "Interview Questions": "Why do you think you be a good fit at this place?"}, {"date": "24 Oct 2020", "title": "Chaplain Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Covia (Santa Rosa, CA) in Aug 2020", "Interview Descriptions": "The interview process was well planned and organized. There was a Resident Committee who interviewed first, and then a second interview with the Executive Director and the management staff.  There was a bit of a gap between the second interview and the time I learned that I had not been offered a position.", "Interview Questions": "Tell us your experience working with well-educated adults and how would you go around engaging them?"}, {"date": "26 Feb 2019", "title": "Service Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Covia (San Jose, CA)", "Interview Descriptions": "Hiring and interview process for Resident Service Coordinator:  The Manager talked for the entire interview about themselves and Covia in general. There were no questions or discussion of the job responsibilities.", "Interview Questions": "N/A"}, {"date": "3 Nov 2017", "title": "Associate Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Covia (Oakland, CA) in Oct 2017", "Interview Descriptions": "the interview process consisted of a teleconference and then an in person interview with the Executive Director, followed by an in person interview with the COO. The interview process with the Executive Director was meaningful and I had an opportunity to tour and meet some very nice people.\r\n\r\nI then met with the COO for AED and was asked some open ended questions. I thought I answered them to the best of my ability. None of the questions really brought in my experience and background which would both have been relevant to my success in the position.", "Interview Questions": "Questions by the ED involved my job experience, current roles and other relevant information requests."}], [{"date": "8 Mar 2019", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Covia (Walnut Creek, CA) in Sept 2016", "Interview Descriptions": "Phone interview led to an in-person interview. The manager did review my resume and  knew my background. It was a good two-way dialog conversation about the team, culture, and how my skills would fit into their environment.", "Interview Questions": "Tell me about the different HR jobs you've had and how your skills fit into this role?"}, {"date": "9 Sept 2014", "title": "Clinical Implementaion Coordinator (EHR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Covia (Walnut Creek, CA) in Jun 2014", "Interview Descriptions": "The interview process was fairly extensive.  I interview over the phone with 2 Directors from the company, including my future supervisor.  The discussions were fairly informal but thorough.  After this I went to the company and interviewed with 5 people at separate times for 1/2 hour intervals.  I met with the 2 from the phone interview then 3 additional colleaugues.  After this I had 2 additional interviews.  I met with the COO of the company and a Nursing Director from one of the facilities.\r\nMy interactions with all were very throrough and challenging but comfortable.  I felt welcomed and respected.", "Interview Questions": "How will you be able to contribute to the team and hit the ground running?"}, {"date": "19 Aug 2015", "title": "Certified Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Covia (Santa Rosa, CA) in Dec 2011", "Interview Descriptions": "Sit down in director of staff development office. Very relaxed, nice, typical questions such as \"how many patents do you normally have per shift?\", \"have you worked as a cna before/where?\", \"are your hours flexible?\", \"how do you perform peri-care?\", etc.", "Interview Questions": "\"What's your work history as a cna?\""}]]