[[{"date": "28 Jun 2021", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Musical and Dramatic Academy", "Interview Descriptions": "One call with HR before in person interview. Very broad questions: “Tell us about yourself”. You are then asked to take a quick quiz that measures general skills.", "Interview Questions": "Tell us about yourself"}, {"date": "9 Nov 2020", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Musical and Dramatic Academy", "Interview Descriptions": "Thorough, they respect your time.  I interviewed with three different parties and I found the process to be informative and relatively fast. First I spoke with HR, then with the hiring manager and finally with my direct report.", "Interview Questions": "Are you comfortable with sales? "}, {"date": "16 Oct 2019", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Musical and Dramatic Academy", "Interview Descriptions": "Wonderful experience.\r\nComfortable phone interview and in person interview.\r\nMade me feel at ease when I was looking to transfer from a small town into the big city.\r\nAlthough I ended up declining the offer due to accepting another, it was a pleasant experience.", "Interview Questions": "What professional challenges have I faced and how did I overcome them?"}, {"date": "14 Sept 2020", "title": "Film Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Musical and Dramatic Academy (Los Angeles, CA) in Jan 2019", "Interview Descriptions": "I was asked a few questions about my previous experience, my organization skill and I would be a good fit for the company. I had to apply online and they got back to me about a week after", "Interview Questions": "How do you stay organized?"}, {"date": "10 Dec 2018", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Musical and Dramatic Academy (Los Angeles, CA) in Jul 2018", "Interview Descriptions": "Interview was straightforward and friendly. No real surprises, probably ran around ten minutes in length. I was hired later that day.  The interview was deceptively easy and honest, which was not an accurate portrait of how the company ended up being.", "Interview Questions": "General background/professional questions. "}, {"date": "8 May 2018", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Musical and Dramatic Academy (Los Angeles, CA) in May 2018", "Interview Descriptions": "The first phone interview with human resources went well, and they scheduled me for a second phone interview. At the scheduled time, I waited for the call, which never came.  After waiting 15 minutes, I emailed, asking if the call was still happening. Over two hours later, I got an email saying the call is cancelled, and that they reviewed my background and have no current positions that are the right fit. Could they have told me that BEFORE I spent the day prepping for the second interview? YES, a professional human resources department would have. This experience was total waste of my time and showed a complete lack of courtesy in the way they treat people — a bad reflection on AMDA’s staff.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "23 Oct 2017", "title": "Assistant General Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Musical and Dramatic Academy in Sept 2017", "Interview Descriptions": "I submitted an application through email and the next day was contacted for a phone screening with an HR person. At the time of the phone screen, the HR person just completely flaked - no attempt to contact me was made. The following day, I got another email from HR asking to reschedule the phone screening without any acknowledgement (let alone apology) that I had been stood up. When the phone screen finally happened about a week later, all seemed to go well (although it was still never acknowledged that I had been stood up the previous week). I got a phone interview with an executive the following day. That interview went well, too. I checked back in with HR about 1.5 weeks later and was told I would hear about potential next steps by the end of the following week. The end of the following week came and went and I didn't hear from anyone. A week later, I wrote to HR again inquiring about the position and got no response. I sent a final email about a week after that to say that I was weighing other job offers and would need to know soon if I was still in the running. No response. Nothing. I thought it was all very disrespectful of the time and effort I put into the process.", "Interview Questions": "How would you respond to an emotional student coming to you for advice?"}, {"date": "25 Oct 2017", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at American Musical and Dramatic Academy (New York, NY) in Mar 2017", "Interview Descriptions": "This process was rushed; I interviewed twice and essentially knew I had the position after the first interview. AMDA is very focused on \"keeping it positive\" and this meant the interview process only focused on the \"good\" about this program/institution. I thought both of the people who interviewed me were courteous and seemed interested in what I had to say. That being said, the job was not accurately described in the interview process.", "Interview Questions": "Are you ok with a 12am curfew?"}, {"date": "12 Dec 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American Musical and Dramatic Academy (Los Angeles, CA) in Jan 2017", "Interview Descriptions": "Was straight-forward but felt they were in a bind to hire someone. I was hired with little time to prepare for the course. Same happened the following semester. This was probably the most normal for experience with them.", "Interview Questions": "Nothing out of the ordinary. Standard questions. "}, {"date": "28 May 2016", "title": "Senior Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Musical and Dramatic Academy (Los Angeles, CA)", "Interview Descriptions": "I applied through indeed.  About a week later I did a phone interview with HR.  A week later I was called in for an interview with the Assistant Director and Director of Admissions.  Two weeks later I interviewed with the CFO and CEO of AMDA.  The process seemed to be going quickly, but there's a lot of steps in the interview process.", "Interview Questions": "Explain previous job history"}], [{"date": "19 Aug 2015", "title": "Accounts Payable Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Musical and Dramatic Academy in Aug 2015", "Interview Descriptions": "About 40 minutes to an hour met with the AP manager and CFO, did an Microsoft Doc and excel computer test, same day my references was called. \r\n\r\nStay away if you can honestly speaking!", "Interview Questions": "Does your current employer know you looking for another job?"}, {"date": "28 Oct 2014", "title": "Director of Student Services Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Musical and Dramatic Academy in Sept 2014", "Interview Descriptions": "Very open and communicative. Met with entire staff during the process and even the same person in same potion at another site.Truly disappointed that we could not come together on the salary. What a great place.", "Interview Questions": "I thought I was going to meet with one or two people. I ended up meeting with everyone. They all really love the institution."}, {"date": "15 Apr 2014", "title": "Human Resources Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at American Musical and Dramatic Academy (New York, NY)", "Interview Descriptions": "Multiple interviews with leadership team and Human Resources, quick hiring process, and great offer made very quickly after the interview. Great benefits offered and great management team. The interview process was a terrific experience here and I would highly recommend this as a place to work to anyone. There is a lot of upward mobility as well.", "Interview Questions": "You must prove your skills, specifically Excel. There can be testing and you must pass in order to be considered qualified for the role at hand. This is a great way to determine your skill level and qualifications for the role in which you are interviewing. Be prepared for official testing of any languages or skills listed on your resume prior to your interviews. Great way to test your own skills also."}, {"date": "7 Oct 2016", "title": "Associate Technical Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at American Musical and Dramatic Academy (Los Angeles, CA) in Mar 2013", "Interview Descriptions": "This was a very confusing interview process.  I had applied for a slightly different position - but quickly learned I was being considered for something else - although no one really told me anything about the shift in focus - until I asked the HR director what the focus of the second interview was.", "Interview Questions": "mostly just discussed my resume, and application materials.  There were a few questions about my skills, and some about my experience.  But it was a very informal interview process."}, {"date": "11 Oct 2013", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at American Musical and Dramatic Academy (Los Angeles, CA) in Sept 2012", "Interview Descriptions": "Absolutely terrible experience. Interviewed with a recruiter who placed a blind ad. They were planning on firing their current Marketing Director. I had several interviews with the recruiter before finally getting an opportunity to speak with the HR Manager. I was told the phone interview went well and then I was passed along to speak with their In-House Counsel. This person told me the meeting went well and that I would get to interview with their President. Well, weeks went by and no update or feedback. I tried emailing and calling the recruiter and HR Manager and asking for an update. None came. Finally I get an email from the recruiter claiming they were going with another candidate. Well the same day, they re-posted the same blind ad on several websites for the exact same job. They basically lied to me. I guess this was probably a good thing, as I spoke to a former employer who told me it was a terrible place to work, as the President was mercurial and tended to micro-manage.", "Interview Questions": "Most difficult question was what do you see as the future of Marketing."}]]