[[{"date": "3 Jan 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at TCU (Fort Worth, TX)", "Interview Descriptions": "Everyone was very nice, pleasant, accommodating, and friendly. The process was smooth and did not take too long. I interviewed by phone, panel interview in person, then a series of interviews in person. I ended up the #2 choice but I don't hold it against them. They were very kind.", "Interview Questions": "How would you learn about this community since you are not from here?"}, {"date": "21 Nov 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TCU", "Interview Descriptions": "I was called on for an interview. I was interviewed by supervisor and her boss. Relaxed no pressure. Friendly and accommodating. There were no curveball questions. Lasted about 30 minutes total.", "Interview Questions": "Examples of past work difficulty and how I overcame them"}, {"date": "15 Nov 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "it was not hard, it was a personal interview where the interviewers try and get to know you better. It was smooth applying for the position via TCU handshake postings.", "Interview Questions": "Basic personlaity questions relating to me"}, {"date": "7 Mar 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "It was as average interview. It was a panel interview consisting of a few department members and HR. The interview was held over zoom. Overall it probably lasted close to an hour.", "Interview Questions": "What is your management style? "}, {"date": "7 May 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TCU in Feb 2022", "Interview Descriptions": "Interview was set within 2 weeks of me applying. There were 3 people in the interview. Everyone was friendly and professional and made me feel very comfortable since I walked in.", "Interview Questions": "What would you do if someone wants confidential information but is not student or parent? "}, {"date": "6 Dec 2021", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "It was quite friendly. Nothing too aggressive, and the environment was just right. I felt like I fit right into it. I had no problem answering the questions. There were two staff through a zoom call.", "Interview Questions": "What would you do when your co-worker is constantly late for the shift after you?"}, {"date": "1 Dec 2021", "title": "Videographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "Panel discussion with members of the communications department.  Presented portfolio and discussed the job requirements. This interview was done  before the covid pandemic, so their current process now may have changed.", "Interview Questions": "Experience and previous video projects."}, {"date": "22 Jul 2021", "title": "Grad Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "It was very welcoming and they have zoom options and waivers for GRE. You will have individual interviews with each faculty where they describe their projects throughly. This will give you the chance to choose", "Interview Questions": "Why is our program a good fit for you?"}, {"date": "8 Feb 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at TCU in May 2021", "Interview Descriptions": "Mostly just discussed my areas of interest and plans after graduation. As I was an undergrad student already they had a good sense of who I was as a person and a professional", "Interview Questions": "What industry do you hope to work in after graduation? "}, {"date": "14 Apr 2021", "title": "Connections Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at TCU (Fort Worth, TX)", "Interview Descriptions": "Online Application with Resume and In-Person Interview.  with 5-6 interviewers of previous Director Board and Advisors. Business Professional / Business Casual Dress code. I'm sure with pandemic restrictions it will be a virtual process.", "Interview Questions": "What role on the Director Board do you fit best?"}], [{"date": "28 Mar 2021", "title": "Office Asisitant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at TCU", "Interview Descriptions": "Personable interview no technical questions. I got To ask the questions i wanted To in the interview. Got the job week after interview and went through training. Training was about 4 hours of videos and mini quizzes going over office conduct and etiquette.", "Interview Questions": "Where do you see yourself in 10 years "}, {"date": "22 Feb 2021", "title": "RA Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "The interview process was around 7-12 hours total. Completely unnecessary. 3 hour zoom call, 1 hour meeting, 3-8 hours of these sessions where you got advice from other RAs. Especially if you don't get the job, which is most people, it is a lot of time to waste.", "Interview Questions": "Tell us about your self"}, {"date": "9 Sept 2020", "title": "Event Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at TCU", "Interview Descriptions": "They asked me about myself and had a nice conversation about how I would be a good fit. The position was Event Specialist in Brown Lupton University Union (the university's main building). I had to apply online and then I got an interview.", "Interview Questions": "Tell me about yourself and how you would be a good fit for this job."}, {"date": "30 Jun 2020", "title": "Career Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TCU (Fort Worth, TX)", "Interview Descriptions": "It was a half day interview process with multiple rounds of group and individual interviews  with key stakeholders including center staff, faculty and students.  First round interview was a phone screen followed by an on-campus interview.", "Interview Questions": "Give me an example of a creative program you executed to address a need."}, {"date": "15 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at TCU (Fort Worth, TX) in Mar 2020", "Interview Descriptions": "The interview process was extremely relaxed. I let was during COVID-19 so it was over zoom but extremely conversational. I talked a lot about my passions for TCU and how I wanted to help improve the department.", "Interview Questions": "How do you think that you can improve TCU branding and licensing visability?"}, {"date": "18 Feb 2023", "title": "Academic Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at TCU in Sept 2019", "Interview Descriptions": "Panel interview with department members. Everyone was very friendly and welcoming. The interview took around 30-45 minutes. I was given a tour of the office, and notified within a week about my offer for the position.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Jun 2019", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "Brief and easy going.  It was online and over Skype but still maintained a level of inter-personal professionalism.  It included questions specific to the position and was with the head of the program.", "Interview Questions": "What leadership experience do you have?"}, {"date": "17 Feb 2022", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at TCU (Houston, TX) in May 2019", "Interview Descriptions": "Went over easily and the interviewers were pretty laid back. Most questions were trying to get to know you and to see if you would make the correct decisions when faced with a problem. They want someone who is honest and will take the work seriously and abide by all protocols", "Interview Questions": "Cannot remember the questions but most were scenarios and what would you do"}, {"date": "28 Jan 2019", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at TCU", "Interview Descriptions": "Applied online, the entire process took about one week to get through. I met up with the interviewer for a very informal meeting. The interviewer is usually the Assistant Hall Director for a building.", "Interview Questions": "Why do you want to be a Desk Assistant"}, {"date": "21 Jan 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at TCU", "Interview Descriptions": "Prep work has changed this year but it is still a long and engaged process. You need to be dedicated to the role or you won't make it through.", "Interview Questions": "What are your priorities? Why do you want this position? What would you do in this situation ...? "}], [{"date": "16 Feb 2019", "title": "Athletics Learning Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TCU in Dec 2018", "Interview Descriptions": "I applied to the Athletics department on a Thursday in December. I received a call on Friday and set up an interview on Monday. During the interview, both interviewers were nice and asked direct questions. Throughout the interview, they continually made references that indicated I may get the job (\"here's where you'll get your background check/your direct deposit should be set up in a couple of days/etc). Then, they said they'd call me by Friday. Walking out of the interview, any reasonable person would think that they had gotten the job.\r\n\r\nFriday rolled around and I had no call. Not a big deal, of course. I emailed them and politely asked if they had an update on the job process. No reply.\r\n\r\nNext Tuesday came with no response, email or phone. I decided to call the Athletic Learning office. They said the staff was having a meeting that day. They had had some people moved around, and they'd be making the decision shortly. I was a little frustrated at this point, but the update gave me some direction.\r\n\r\nFast forward to the next Tuesday. It had been over two weeks now, with a promised reply by one week. At this point, I figured I didn't get the job, but had no idea why. I called the office once again. They said they had moved forward with someone else for the position, but that I could apply for future jobs in the Spring semester. \r\n\r\nNo calls, no updates, and no communication on their end. I had to do all the heavy lifting. I understand that day-to-day ops can push things back, but the radio silence on their end was ridiculous. It was one of the most unprofessional experiences I've ever had. \r\n\r\nIf the Athletic Learning Department runs their talent search like they do their operations, don't apply here; it's not worth it. You'll walk in with optimism and leave with empty promises.", "Interview Questions": "What do you know about the athletic learning process?"}, {"date": "18 Oct 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TCU (Fort Worth, TX) in Oct 2018", "Interview Descriptions": "The interview process was fun and engaging. It was a unique experience that helped me learn more about myself. Additionally, the training once becoming an RA was helpful and rewarding.", "Interview Questions": "If you were a kitchen appliance what would it be and why?"}, {"date": "19 Nov 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at TCU (Fort Worth, TX) in Sept 2018", "Interview Descriptions": "The interview process was very easy. It is probably different for every department on campus, but overall very straightforward. It helps to have connections with professors in the department. Overall an easy process and great job for any college student.", "Interview Questions": "Tell me about yourself. "}, {"date": "17 Jun 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at TCU (Fort Worth, TX) in Jun 2018", "Interview Descriptions": "I first sat down with Dr. Sherwood (very nice and very talkative) while he asked questions about what I knew about tutoring and editing and then I took a short editing test.", "Interview Questions": "Do you know APA and MLA format?"}, {"date": "28 Jul 2022", "title": "Campus Rec Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at TCU (Fort Worth, TX) in Apr 2018", "Interview Descriptions": "The interviews are done in groups of three with Rec Center upper management. The entirety of it lasted approximately 30 minutes and it was very open and very effective. Most questions were based on personality and overall work ethic.", "Interview Questions": "What do you hope you get out of this job?"}, {"date": "31 Aug 2021", "title": "Post Office Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TCU (Fort Worth, TX) in Apr 2018", "Interview Descriptions": "There were multiple members on the hiring committee, each member asked a question. The questions varied in degrees from each person. They made me think and had me ask them questions as well.", "Interview Questions": "What type of animal would you be and why?\nWhy am I interested in this position?"}, {"date": "19 Feb 2018", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at TCU (Fort Worth, TX) in Feb 2018", "Interview Descriptions": "It was easy. The interview lasted for 30 mins. The manager asked me a few basic questions on computer networks. He explained the expectations for this position and what a typical work day looks like.", "Interview Questions": "What is DNS?"}, {"date": "11 Apr 2017", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TCU (Fort Worth, TX)", "Interview Descriptions": "Very typical structured interview. Began with a phone interview and then later, if you made it to the second round, you would interview with an assistant hall director. I also believe that there is an online form that you fill out first and answer some basic questions like why do you want to be a desk assistant. Good position to prepare you for being an RA if that is what you are looking to do.", "Interview Questions": "Name a time where you had a conflict with a friend and how you handled it. "}, {"date": "16 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at TCU (Fort Worth, TX)", "Interview Descriptions": "A general clerical test is required before you are able to apply for a job.  Contacted HR for an appointment, which was easy and quick.  Once you pass the test, you are invited for an interview within the department for which you are applying.", "Interview Questions": "What makes you qualified for this position?"}, {"date": "20 Jan 2017", "title": "Gallery Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at TCU (Fort Worth, TX) in Nov 2016", "Interview Descriptions": "I interviewed with 4 people and it lasted 45 minutes. You interview with the curator, administrative assistant, director of school of art, and one of the assistant professor. He was doodling most of the time and look bored, but the others were great - very friendly. It took 1.5 months to hear back for an interview after applying.", "Interview Questions": "We teach students often. What kind of skills or knowledge can you pass onto them?"}], [{"date": "31 Aug 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TCU (Fort Worth, TX) in May 2016", "Interview Descriptions": "Your typical higher education questions. What would you implement, how, and how would you be an asset to the office and the students. Nothing some research and someone who is passionate about what they do couldn't handle.", "Interview Questions": "How would you contribute to the success of our students outside of the classroom?"}, {"date": "2 Apr 2017", "title": "Guest Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at TCU (Fort Worth, TX) in Jul 2015", "Interview Descriptions": "Brief and low-key interview that mainly sought to determine whether one could handle the balance between working and classes. General customer service questions and what-if scenarios on how to deal with visitors.", "Interview Questions": "How will you maintain your grades and keep up with homework while working here?"}, {"date": "29 Mar 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at TCU (Fort Worth, TX) in May 2015", "Interview Descriptions": "We did a Skype interview. The overall experience was great. The person who interviewed me was very easy to talk to and informative on the job position. I was nervous at first, but after we started talking I felt better. He asked about 6 questions, then went into the job. I was offered the position at the end of they interview.", "Interview Questions": "Strengths and weaknesses?"}, {"date": "16 May 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TCU in Mar 2015", "Interview Descriptions": "Most of the process is off-site through emails or phone calls, but once you are accepted you have one-to-one interviews with all the professor in the department to help you choose your mayor and research group", "Interview Questions": "What were my career expectations?"}, {"date": "17 Feb 2016", "title": "Phonathon Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at TCU (Fort Worth, TX) in Feb 2015", "Interview Descriptions": "It was easy. They called me for an interview after submitting an application through frog jobs. I went to the interview. One person interviewed me. Basic questions to see your personality and if you would fit the job position. You have to be very open, have good communication skills, and be persistent with people you call. It is not a job for everyone.", "Interview Questions": "What skills or capabilities do you have that will make you successful in Phonation?"}, {"date": "9 Sept 2014", "title": "Intramural Official Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at TCU", "Interview Descriptions": "For the hiring and interview process, you meet with the leader of intramural officiating, Sheldon Tate. The training for the intramural department is top notch here at Texas Christian University. I cannot say enough about this program.", "Interview Questions": "N/A"}, {"date": "20 Mar 2014", "title": "Chapel and Events Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at TCU", "Interview Descriptions": "I filled out an application first. Within about a week, I was contacted to come in for an interview. I came dressed in normal interview attire (suit, blouse, heels), and the interviewer was dressed in jeans and a casual top. I was expecting a little more on the professional end, especially because they work professional events. After the first one-on-one interview, I was invited back for a second interview, in which I was interviewed by the same woman in addition to two others. About two weeks after that interview, I was contacted to let me know that I was not being offered the position.", "Interview Questions": "They asked all the normal interview questions. In the second interview, they asked more situational and hypothetical questions, such as \"How would you react if XYZ happened?\""}, {"date": "28 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TCU in Mar 2014", "Interview Descriptions": "First, I received an E-Mail asking me for a phone interview. I scheduled for the phone interview via E-Mail. I was invited for a face-to-face interview two days after the phone interview. Then I was invited for a second interview about a week later. I was given a job offer the same day I went for the second interview", "Interview Questions": "I was asked to review a survey and offer suggestions to improve the survey"}, {"date": "15 Jul 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at TCU", "Interview Descriptions": "Get to know the professors, and prove that you know what you're doing as a grad student. They asked me to do it without an interview, it was awesome!\r\n\r\nIt really helps to have some teaching experience in undergrad to pull from, so try to get in there first, it makes the interview less important when you've already proven your skill-set.", "Interview Questions": "No questions asked except for \"do you want to be a TA?\""}, {"date": "9 Oct 2017", "title": "Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at TCU (Fort Worth, TX) in Jun 2013", "Interview Descriptions": "They were nice people. My friend got me in the door, so other than my basic qualifications, they just wanted to know if my personality would mesh well with the others.", "Interview Questions": "Are you going to do further studies into your chosen field?"}], [{"date": "22 Jul 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at TCU (Fort Worth, TX) in May 2013", "Interview Descriptions": "It was very easy. The head of my graduate program reached out to see if any of us would be interested in working with a professor. We were all assigned at random a few months later. It was our responsibility to reach out to our professor during the school year to see what we could do for them.", "Interview Questions": "Only if I wanted the position"}, {"date": "16 Aug 2016", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at TCU (Fort Worth, TX) in Jul 2012", "Interview Descriptions": "I submitted an online application via TCU's HR website, which included a personality quiz. A week later, I had a phone interview with the director of the office. A week after the phone interview, TCU flew me (from out of state) for an in-person interview, which was a full day event: multiple meetings, a working lunch, and a panel interview. Within a few days, I received a phone call and was extended an offer, assuming I passed the background check. Which I did.", "Interview Questions": "What drew you to apply for the position?"}, {"date": "5 Aug 2015", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at TCU (Fort Worth, TX) in May 2012", "Interview Descriptions": "App is submitted online. If you get any questions such as \"Do you have a college degree\", it means this is a requirement. Answer \"no\" and you won't be allowed to complete the app or to change your answer. Just FYI. \r\n\r\nRound one was an email with additional scenario questions including composing a response to a complaint letter.\r\n\r\nRound two was a telephone interview. Mostly a review of my resume. \r\n\r\nRound three was a group interview with five people including peers.", "Interview Questions": "Was asked to define about 40 different IT terms, some very obscure. "}, {"date": "11 Mar 2016", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at TCU (Fort Worth, TX) in Jan 2012", "Interview Descriptions": "Had 1 phone interview, then was invited for a 2-day in-person interview.  Interview consisted of giving a colloquium talk, an hour-long meeting with the students in the department, several meetings with management (dean, university president, human resources).  Was provided a tour of neighborhoods and downtown area, with suggestions on where to look for housing, etc. The interview process was thorough and effective, and gave me and the employers a very good introduction of each other.", "Interview Questions": "Why do you think you would be a good fit to our department?"}, {"date": "2 Nov 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TCU in Aug 2011", "Interview Descriptions": "I applied online after getting information from the website. The person in charge of Athletic Office interviewed me. One-to-one interview. She was nice and she just asked basic questions. \r\nAfter a week, I knew I got the job. Overall experience is great. Casual and friendly interview", "Interview Questions": "What grades did I get in that class?"}, {"date": "28 Feb 2014", "title": "Senior IT Support Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at TCU (Fort Worth, TX) in Jul 2010", "Interview Descriptions": "I kept bugging them with emails, phone calls and letters.  It was a lengthy process because they did not need anyone at the time and I had to convince them that they needed me because of my specialized people and compter skills.", "Interview Questions": "How to do wireless connectivity."}, {"date": "8 Aug 2010", "title": "Graphic Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at TCU (Fort Worth, TX) in Nov 2009", "Interview Descriptions": "I was invited in for an interview. The company worried that the position was below my desired income", "Interview Questions": "Would you be happy working for this salary, and knowing that raises or promotions would be rare?"}, {"date": "31 May 2012", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at TCU (Fort Worth, TX) in Aug 2009", "Interview Descriptions": "I was interviewed by my future boss about my skills and work history. She asked me about my skills and what I would be able to contribute the office. When I was hired I was told I was on a probationary period and could be terminated at anytime during that month. I preformed well and ended up working with them for 3years.", "Interview Questions": "What was a time when you failed?"}, {"date": "12 May 2011", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at TCU (Beaumont, TX) in May 2009", "Interview Descriptions": "It was very easy and well organized and everyone genuinely was interested in what I had to say. They were courteous and helpful with regard to the position as well.", "Interview Questions": "Why do you want this position?"}, {"date": "20 Mar 2010", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at TCU (Fort Worth, TX) in Feb 2008", "Interview Descriptions": "Put in an application. It was reviewed. Had a telephone interview. Was offered the job.", "Interview Questions": "None"}]]