[[{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic environment, poor ethics and bullying of staff", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Dec 2022", "job_title": "Zoo Keeper in Wellington, Wellington", "duration": "N/A", "pros": "When you get into zoo keeping, you find yourself amongst two types of people. The first being the incredibly compassionate, dedicated hard workers who want to spend their life caring about the planet and saving animals in the wild. Those people are the best part of zoo keeping - along with the animals, of course. The second type of people will be mentioned in the cons section…", "cons": "There is such a long list, I’ll try to keep it bullet pointed and summarised… - the egotistic, narcissistic people who get into this industry because they like the power of controlling animals and being able to say they’re a zoo keeper. These people unfortunately are the toxic ones that will remain while the good people see the cracks in the industry and leave. - Wellington Zoo boasts about paying their zoo keepers well, however they actually do the bare minimum to sit just above the rest of the industry and have no intentions of making the wages viable for zoo keepers to rely on for your career. Many zoo keepers either rely on their partners being the “bread winners”, have to live a life of barely scraping by or are young enough to have this as their first job and are still flatting without large outgoings. You will notice a trend of very young people being employed as zoo keepers at Wellington Zoo - this is a huge contributor as to why. - The zoo insists on creating an incredibly difficult, time consuming and unnecessarily stressful system that you must complete if you want to progress in your career. They make you write essays, prove your competence in way of assessments and beg for time from management to get this done. It took months to complete this work, many of which was done outside of work hours (unpaid for) and overall ended up being more work than most university level certifications - all just to get a small pay rise. The system is also based on your tenure as a zoo keeper, so people who are performing at a high level of competence are unable to advance like they would in other professions and are subsequently held back in their careers. I believe this is to stop people from being able to negotiate a higher wage as the zoo does not want to pay people what they deserve. - The management has a long history of bullying staff, starting right from the top with the CEO and down to the Team Leaders. Staff would be constantly gaslighted, belittled, ignored and have been subject to incredibly inappropriate behaviour such as yelling, scolding and “meetings” that would involve being criticised and questioned without any notice or due diligence to ensure correct processes are followed (no prior notice of issues, no support person invited, treated as warnings etc). - The zoo made strong efforts to remove the union presence from the zoo, including having one of the Team Leaders (who was very close both at work and outside of work with the direct manager) be the only union contact for years. Once other zoo keepers joined the zoo and another connection to the union was formed, the Team Leader in question would rely information from the meetings back to management. The Union negotiated an extra week of leave for union staff who has been there for 5+ years, then the zoo introduced the same benefit to the non-union employees straight after to try and avoid more people joining the union. This was against the agreement between the zoo and union that was made during negotiations. - The ethical values of many management staff were incredibly worrying. Animals were being kept alive because they were good display animals for visitors to look at, when they actually should have been humanely put down. Other animals were also put down as they were no longer “needed”, yet were healthy beings that had no medical issues and should have continued to live long healthy lives. - concerns for animals welfare often came second to the need of the business and what would bring in money. - The zoo once gave a member of upper management an award for his commitment to mental health at the end of the same year where a young female employee was being bullied out of her position as a keeper because she was struggling with her mental health and needed assistance and time off work. - During Covid, the zoo gave an award and huge thank you to the upper management team who had been working from home during this time. The zoo keepers, who had been working during Covid, received a Covid themed cake at a meeting. This Covid themed cake was presented while Covid was still rampant in other countries and many international staff were upset by the lack of compassion for those still dealing with loosing loved ones abroad. - Due to the constant neglect to listen to keepers, especially those that were younger, poor decisions were often made by management that would affect the welfare of animals. People in higher positions felt threatened by new staff who had come out of recent study and learnt new, better and updated ways of doing things. - The zoo has a history of using poor and cruel methods or teaching animals. One being that they would bait the electric fences with food, to make the animals touch said electric fence and then “it would teach them not to touch it anymore”. The reality is that the animal thinks that touching the electric fence will give them food. They have a tiger that touches the electric fence daily because of this practice. They then tried to do it to the new lemurs, and done it in secret. When other keepers found out, they openly vocalised their objections to this practice and it was quickly covered up by those involved. I could go on forever, but hopefully this helps paint a picture of how disgusting Wellington Zoo is."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A very stressful place to work , with a lot of unhappy people", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Jul 2014", "job_title": "Anonymous Employee in Wellington, Wellington", "duration": "N/A", "pros": "Great being around animals", "cons": "Senior management team are very ego driven, a couple of them are bullies.\r\nConsidering this company is a not for profit the senior team seem to travel a lot .\r\nA high number of staff currently employed are looking for work elsewhere and the turnover is huge .From the outside looking in this should be a great place to work but once staff have been employed for six months to a year they are often stressed and unhappy"}], []]