[[{"date": "13 Mar 2023", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wyoming", "Interview Descriptions": "Initial phone call and then interview after with hiring manager. Second interview with a panel of people from the department. Waited a few days between phone call and first interview and around 5 days for the second interview.", "Interview Questions": "Why do you want this position?"}, {"date": "2 Feb 2023", "title": "Senior Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Wyoming", "Interview Descriptions": "screening phone call followed by full day in person on campus visit with on campus tour. meetings with multiple stakeholders, lunch public research/values/practice presentation with set topic and student panel", "Interview Questions": "public presentation on a set topic"}, {"date": "20 Jan 2022", "title": "Discussion Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Jan 2022", "Interview Descriptions": "Professor interviewed me, was very informal. I have nothing to really say other than standard questions for a position like this, 'Discussion Leader\".  I had an opportunity to ask any questions I might have.", "Interview Questions": "Schedule availability,  understanding of material"}, {"date": "10 Nov 2022", "title": "Annual Giving Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Wyoming in Jun 2021", "Interview Descriptions": "I had two interviews. The first interview was with the hiring manager and the HR manager. It was 45 to 60 mins long. second interview had me present on mailing appeal and how would i make it better", "Interview Questions": "What are your goals? (Explain your 5 year to 10 year goal)"}, {"date": "14 Jan 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wyoming", "Interview Descriptions": "Interviewed with multiple people within the department. They each took turns asking about experience with programming and background relevant experience. At the end there was ample time to ask questions.", "Interview Questions": "What statistical programs have you used?"}, {"date": "16 Mar 2023", "title": "Office Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Wyoming in Jan 2021", "Interview Descriptions": "1 interview - about an hour long. The interview was in person with 6 other staff members asking questions. The majority of the interview process included problem-solving questions including \"describe a time when you faced a challenge and how did you overcome that challenge\".", "Interview Questions": "Describe a time when you faced a challenge and how you overcame that challenge."}, {"date": "12 Dec 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wyoming", "Interview Descriptions": "Collaborative and mellow with a group interview and individual interview.  Questions are wide ranging and are a good indicators of what applicants experiences are. Be prepared to be a team player.", "Interview Questions": "Tell us about an experience with diversity. "}, {"date": "9 Dec 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wyoming in Jul 2020", "Interview Descriptions": "Interviews are competency based and fairly strait forward. The competencies are listed in the job description, so my advice to prepare is google sample interview questions based off what is listed. I had three interviews, the last two were scheduled 5 weeks after the initial interview, and I received an offer 6 weeks after the 3rd interview, so the process was quite lengthly.", "Interview Questions": "How do you handle criticism at work? \r\n"}, {"date": "10 Feb 2020", "title": "Project Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at University of Wyoming", "Interview Descriptions": "Simple, quick, friendly. The management was great to interview with, and it was fairly informal. It was simple and low-stress, and it has been fun working with the team after I was offered the job and hired.", "Interview Questions": "Where have you worked before? Do you have project management experience?"}, {"date": "18 Feb 2022", "title": "Mathematics Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at University of Wyoming (Laramie, WY) in Aug 2019", "Interview Descriptions": "The interview was over phone and was very quick, less than five minutes. Not much preparation was needed. The purpose was to find a fitting teaching assistant capable at teaching college algebra.", "Interview Questions": "What is your experience regarding mathematics?"}], [{"date": "25 May 2018", "title": "Dishwasher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Jan 2018", "Interview Descriptions": "Very brief interview. I was not asked many questions related to the job. I mostly had to come in to fill out forms (such as the I-9 and direct deposit). The interview was obviously not a challenge.", "Interview Questions": "What was the most difficult question?"}, {"date": "18 Feb 2020", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Wyoming (Laramie, WY) in Oct 2017", "Interview Descriptions": "I applied online through the university's website and IT brought me in to interview me within a week. The interview was very quick with a few key questions about situational awareness.", "Interview Questions": "If a user comes to you with a question you KNOW how to answer, what do you do?"}, {"date": "19 Oct 2016", "title": "Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wyoming (Wyoming, MI)", "Interview Descriptions": "First round of telephone interview with faculty members and then was offered an onsite interview. A day long process meeting the director, faculty members, lunch followed by my research presentation, again meeting with faculty members, students and ended with dinner. The interview process was traditional with questions about research, teaaching and funding.", "Interview Questions": "Mostly concerned with my research background and how it will contribute to the department"}, {"date": "8 Jan 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Jul 2016", "Interview Descriptions": "I took a  class with the professor with whom I am working currently. I did very well on the \"Spatial Decision Support System\" class which was offered by the professor during Fall, 2015. After I took the course, I approached my professor asking for a research job at the The Wyoming Geographic Information Science Center (WyGISC). After that I was interviewed on my job experience and research interest.", "Interview Questions": "What is my interest area? How may I help with preparing lab exercises for students taking courses in land use planning?"}, {"date": "20 Sept 2016", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Wyoming (Laramie, WY) in May 2016", "Interview Descriptions": "Mostly questions about \"how to work with clients\".  There were two skill checks.  One was basically a check to see if you could read code.  The other was a basic algorithm.", "Interview Questions": "After reading a function, what was the output?  (basic code reading test)"}, {"date": "7 Feb 2018", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Wyoming (Laramie, WY) in Nov 2015", "Interview Descriptions": "Job ad was posted on discipline listserv. I wrote a cover letter and submitted a CV to the faculty member. The faculty member and her lab contacted me for a Skype interview, then a full day on-campus interview.", "Interview Questions": "What is a difficult work situation you encountered and how did you handle it."}, {"date": "19 Dec 2017", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Wyoming (Laramie, WY) in Sept 2015", "Interview Descriptions": "Very professional. Ask a standard set of interview questions to each candidate. Strive to be fair and unbiased.  You meet with a panel of three people who ask questions in turn. Sometimes you answer the question ahead of time, but they have to ask you it anyway.", "Interview Questions": "The typical strengths and weaknesses question. Also - they wanted examples of how you had done a particular task in your current/past jobs. "}, {"date": "14 Nov 2016", "title": "Career Peer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Wyoming in Jun 2015", "Interview Descriptions": "Mostly behavioral questions, nothing too in-depth. Asked me about what my greatest strength is and how I behave in a group. Asked how I would explain things to a student.", "Interview Questions": "I honestly don't remember a specific question, but I know that they asked me about how I would go about helping a student who is really emotional and struggling to understand why what we are doing is relevant."}, {"date": "7 Nov 2016", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wyoming (Laramie, WY) in Mar 2015", "Interview Descriptions": "Wasn't too bad. They just wanted to know that you could do the necessary job. They were also very interested in problem solving and communication skills. Also, any previous IT experience would be a plus so be sure to advertise any skills you have or any problems you've encountered and solved in that area.", "Interview Questions": "Why do you want this job?\r\nList a scenario where you showed leadership\\problem solving skills."}, {"date": "15 Dec 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Wyoming", "Interview Descriptions": "As with most academic position, submitted a application package prior to the posted deadline. Was contacted about four weeks later to schedule a phone interview.  Was invited for a 3 day visit/interview.  Was flown into Denver which is a two hour drive from Laramie.  Picked up by a potential faculty member. While the formal interview doesn't start until you're on campus, expect lots of questions during the long drive from and back to the airport.", "Interview Questions": "Are you a vegetarian?"}], [{"date": "10 Dec 2014", "title": "Campus Photographer/Videographer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Wyoming in Dec 2014", "Interview Descriptions": "1st step is to fill out the HR forms fields and then add resume. They never asked for samples of work. 2nd step is to get a call asking to do a Skype. \r\n Skype interview - \"what is your editing workflow\", \"how long does it take you to edit a 1 min video\", \r\n3rd step is to create a video with stills suitable for magazine front cover. Length of video 1-3 min including 5 transitions from outside to inside. \r\n4th step is the in person interview.", "Interview Questions": "nothing too difficult"}, {"date": "18 Sept 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Apr 2013", "Interview Descriptions": "There was no interview process. For international students, there is an interview conducted by english department to check the accent of the student. If not cleared, they have to sit through for one semester. \r\nApplied for Teaching assistant in my departement. Get a recommendation from your academic advisor. Apply as early as possible before the position gets filled up. Maintain good GPA", "Interview Questions": "N/A"}, {"date": "20 Nov 2015", "title": "Website Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Mar 2013", "Interview Descriptions": "Took only 1 day , the interview was easy . I graduated from here so it was easy to get a job as well since i knew a lot of people in the department . Just apply online , and let them call you .", "Interview Questions": "They asked about projects that you have done"}, {"date": "12 Mar 2013", "title": "College Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wyoming (Laramie, WY) in Oct 2012", "Interview Descriptions": "Submit resume and cover letter, panel interview, review process, job offer.", "Interview Questions": "Name a time that your authority was questioned. How did you handle it? "}, {"date": "18 Jan 2016", "title": "Shuttle Bus Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Wyoming (Laramie, WY) in Jun 2012", "Interview Descriptions": "The interview was short and concise. The questions were very direct and experience related. There were also safety related scenarios presented for response. Their was a panel of about 5-6 people in on the process but it still felt low key.", "Interview Questions": "How long would I stay?"}, {"date": "21 Jul 2016", "title": "Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in May 2012", "Interview Descriptions": "They called me after the close date and asked if I wanted a phone or in-person interview (I lived 6 hours away at the time). I chose to interview in person (because we all know you have to be a PRETTY special phone interview to get anywhere with a job search). \r\n\r\nPretty typical panel interview. The associate dean, department head, business manager, and", "Interview Questions": "How will you handle multitasking and being able to get tasks completed when you are often interrupted by faculty, staff, and students throughout the day?"}, {"date": "12 Jun 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Wyoming (Laramie, WY) in Mar 2012", "Interview Descriptions": "I am an international student therefore I didnt have change to have in person interview. After my application, two of the professors arranged a skype meeting. We have talked about my resume and qualifications. In addition to that, there were some basic HR quastions.", "Interview Questions": "Why should we choose you among all the applicants?"}, {"date": "7 Oct 2011", "title": "Program Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Wyoming (Laramie, WY) in Aug 2011", "Interview Descriptions": "The interview was a basic phone interview with four people asking questions.  I was flattered to get the interview but in the back of my mind I am a city boy and I really do not think I could adapt to living in Wyoming.\r\n\r\nIn this economy if you are unemployed you may start applying for positions which you are adept and qualified for but the opportunity is in a local, region or country which you may not have considered if you were not in financial hardship or anxious to return to your career.  Make sure before you start the application process that the position is located in a community, region or country where you want to live.  I understand we have to be adaptable to our environment but in my opinion you spend 40 hours a week at your job.  You spend 128 hours in the community which you will be living.  Make sure that the job which you take is in a place where you want to live.  It doesn't make sense to be unhappy, bored or not interested with the community, and its culture and your only respite is when you are at work.", "Interview Questions": "Your supevisory skills are very weak.  Why are they so after all these years in this profession?"}, {"date": "20 Nov 2012", "title": "Telephone Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Feb 2011", "Interview Descriptions": "You sign up and read the survey. If you can enunciate your words to where they understand them you will be hired. It is not very difficult to get hired here. You need to be able to handle answers that are not exactly like the answer responses. Normally just ask again but sometimes can read between the lines.", "Interview Questions": "Handling answers that are not exactly the same as the answer responses. "}, {"date": "14 Jun 2012", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Jun 2010", "Interview Descriptions": "We met, and discussed our interests. We decided that we could work well together.", "Interview Questions": "What are your interests?"}], [{"date": "20 Mar 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Wyoming (Laramie, WY) in Feb 2010", "Interview Descriptions": "Applied online", "Interview Questions": "People are supposed to explored their own view on the research topic. Not just rely on the PI."}, {"date": "26 Oct 2009", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Wyoming (Laramie, WY) in Oct 2009", "Interview Descriptions": "There were six professors asking some intense research and teaching questions in a short duration of 20 minutes.", "Interview Questions": "Differentiate lower level teaching from upper level"}]]