[[{"date": "6 Jul 2023", "title": "Student Nurse Extern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jul 2023", "Interview Descriptions": "Just did my first step of the interview process. Got a phone call, and was asked questions. Then I was given a run down of the departments and positions available. I mentioned three departments I was interested in. Unfortunately, ER nurse externships aren't available (unless you are a float nurse extern) I was then scheduled for my next step of the interview. Fingers crossed!", "Interview Questions": "Got a phone call, and was asked: - why I want to become a nurse - If i did clinicals during the semester - describe a time during clinical i went above and beyond for a patient"}, {"date": "8 Jun 2023", "title": "Mechanical Engineer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in May 2023", "Interview Descriptions": "One 30-minute interview with two hiring managers for different roles. They asked behavioral-based questions. Very straightforward. The interviewers were very nice and knowledgeable. My only complaint is that HR is a little slow moving.", "Interview Questions": "Describe a time where someone was not following correct procedure/rules and what did you do?"}, {"date": "6 Jul 2023", "title": "Clinical Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in May 2023", "Interview Descriptions": "RN with a Masters in Education with over 25 years of clinical experience but was told by HR that they are only considering candidates with a MSN. Unfortunate because I have a wealth of experience and knowledge to share with nursing students. I also work as a clinical instructor for 2 other college/university nursing programs and had no issue with my M.Ed. credentials.", "Interview Questions": "Do you have a MSN?"}, {"date": "6 Jun 2023", "title": "Advanced Practice Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Apr 2023", "Interview Descriptions": "Challenging, but the interviewers are personable and seek to get to genuinely know you. They appreciate when you ask quality questions and are interactive. I recommend reviewing list of most commonly asked interview questions and coming up with answers before this interview. Indeed has a list for APPs", "Interview Questions": "So, (insert name here) Tell me about yourself?"}, {"date": "7 Mar 2023", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health in Mar 2023", "Interview Descriptions": "Straight to the point. Asking about my experience. The interview was very friendly and welcoming. Gave me greet information about the team the company. It wasn’t a long interview . I was able to ask question . And she answered clearly", "Interview Questions": "Tell me about your experience"}, {"date": "11 Apr 2023", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Mar 2023", "Interview Descriptions": "Very straightforward and thorough. They showed me around the lab and made sure it was what i wanted to learn. They answered every single question i had. Very nice people", "Interview Questions": "What was i doing since graduation"}, {"date": "20 Apr 2023", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Mar 2023", "Interview Descriptions": "Very Straightforward. Supervisor showed me around the lab and explained what i was going to do. The process was very simple and easy going. It was sort of like a conversation.", "Interview Questions": "What did i do since graduation"}, {"date": "29 Jan 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "It was a Simple interview with straightforward questions. Seems like a good company to work for with good benefits. I recommend you interview here. It was also a quick interview process that was made easy.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "16 Nov 2022", "title": "MRI Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "The interview was very easy and comfortable I felt very fortunate to be a part of the Jefferson team. !!!!!!!!!!!!!!!!!!!!!!!!! If you are thinking of applying I would highly recommend it", "Interview Questions": "Why you? How do you deal with a difficult patient? Do you stresss eaaily"}, {"date": "8 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "After submitting the application, I got an email to set up a phone call w a recruiter. After successfully completing that interview, the recruiter slotted me for a zoom meeting w the unit manager + an add'l nurse", "Interview Questions": "A time you put something you learned into practice?"}], [{"date": "20 Dec 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University and Jefferson Health in Oct 2022", "Interview Descriptions": "First intro interview with recruiter, which took about a month of phone tag to set up. Brief and standard interview with no technical questions. Did not move forward and heard back a month later that it was declined.", "Interview Questions": "Do you have experience with Agile DevOps?"}, {"date": "30 Sept 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "It was okay. The interviewer started ranting and complaining about previous employees, and it made me feel uncomfortable. Maybe it was short-staffing but definitely should not have taken longer than 30 minutes to interview.  ", "Interview Questions": "Tell me a time you problem solved. "}, {"date": "17 Sept 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health in Aug 2022", "Interview Descriptions": "I applied online and heard back after about 3 weeks. The hiring manager invited another department person to the call, so we made small talk while waiting for her. Questions were a little more difficult than standard, asked in a ping pong way. At the end they asked if I had spoken to the recruiter, which I had not. \n\n3 days after the meeting, I heard from the recruiter who wanted to set up a call with me. I sent an email back asking if it would be covering the same line of questioning as the main interview. No response, got a canned email rejection at about 3AM a week later. \n\nDuring main interview, team was unable to answer questions regarding COVID and working environment as well as uncertainty around the full scope of the role.", "Interview Questions": "What experience do you have with college students?"}, {"date": "19 Jun 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "It was very chill and  lay back. She was very nice, and understanding, it took me all together 15 minutes over all.   The questions weren't very hard, she made it very comfortable.", "Interview Questions": "Tell me about yourself.\r\nWhy do you want to work in a health care profession? "}, {"date": "30 May 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jun 2022", "Interview Descriptions": "The interview process was in a two part series. The first interview was with a Data Analyst which was very thorough. The second interview was with an engineer which was in a form of a conversation and an overview of the first interview.", "Interview Questions": "Have you ever worked in research before? Why do you want to work at Jefferson? Tell me about a time where you had to think under pressure."}, {"date": "3 May 2022", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "it was quick and easy and very comforting, the interviewer made the environment exteamly  friendly. the interview itself didnt take much time either, it felt as if i was having a professional easy going conversation rather than applying for a job", "Interview Questions": "how well do you work in high stressful situations"}, {"date": "16 Apr 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Received email to set up a zoom interview, the lady was very nice and asked about 5-6 questions. The whole interview took about 20 mins and I got another link for a second interview.", "Interview Questions": "-Tell me about yourself\n-Name a time where you experienced conflict with a coworker and how you handled it"}, {"date": "1 May 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Apr 2022", "Interview Descriptions": "HR asked all the interview questions, gives you como salary and talks to you more about expectations and  hiring manager talks to you more about the unit, asks you what would make you the perfect fit and draws you in more about why to work for them", "Interview Questions": "Why do you want to work for us"}, {"date": "10 Jun 2022", "title": "Surgical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health in Apr 2022", "Interview Descriptions": "it was great and smooth, it was on zoom do to the current covid 19 pandemic. Everyone i spook with was great and knowledgeable. defiantly cant wait to join the team", "Interview Questions": "what was my work experience "}, {"date": "2 May 2022", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Jersey City, NJ) in Apr 2022", "Interview Descriptions": "Online video you had to answer prewritten prompts. You had three tried to film yourself and answer the question. Six questions total. Took less than a hour to do. It was easy to do.", "Interview Questions": "What makes you want to be a nurse\nWhat would make you good for the position "}], [{"date": "29 Apr 2022", "title": "Clinical Nurse 1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health in Mar 2022", "Interview Descriptions": "I was contacted by a recruiter for a zoom interview. I conducted the interview and was contacted with an offer 2 days later. I was also given the opportunity to tour the unit and complete a shadow with an RN.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "8 Dec 2022", "title": "Patient Access Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Mar 2022", "Interview Descriptions": "My interview was truly a breeze, be yourself and you’ll do great. Most of the time the interviewer wants to see how you are as a person because it’s easy to train someone on the job but working in the healthcare field we need people who truly CARE for our patients.", "Interview Questions": "Name a time where you had to deescalate a situation with an angry patient and how did you do so?"}, {"date": "23 Feb 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Feb 2022", "Interview Descriptions": "Three steps where the HR Business Partner should have been irrelevant. One person was not sure what the position was all about, or could answer questions relating to the position.", "Interview Questions": "Have you ever been criticized on your work? "}, {"date": "30 Jun 2023", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Feb 2022", "Interview Descriptions": "First online interview was a general talk with the head of the department. later on I had some online interviews with multiple lab members as well as multiple PI's to see if there was a match", "Interview Questions": "previous experience concerning the research subject"}, {"date": "10 Jan 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "please try and find past co workers and managers who you can use for a reference when applying because they wiill ask for atleast 5 and people contact information changes so this can be tricky depending on if your past employers are still reachable", "Interview Questions": "employment history is important to review your resume and correct dates"}, {"date": "14 Jan 2022", "title": "FACT I Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jan 2022", "Interview Descriptions": "Was very streamlined and a group interview! There were all sorts of FACT students at the interview, traditional, etc.  They were relaxed, open to questions, and informative. I think it was good as a student in undergrad to have a group interview in order to see other peoples interview styles.", "Interview Questions": "They asked the usual questions, I heard since the pandemic they have been sending out the questions beforehand?"}, {"date": "18 May 2023", "title": "Compliance Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Dec 2021", "Interview Descriptions": "Interview #1 was a group interview with multiple candidates circling between various offices competing for the same position. Interviews #2 & #3 were held via Zoom, 6 interviews in total. After the interview with the 6th person I was completely ghosted.", "Interview Questions": "N/A"}, {"date": "19 Oct 2022", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Dec 2021", "Interview Descriptions": "Phone Screen followed by multiple zoom interviews that ended with a meeting of C-suite. meet the team for a culture fit. I was told in the culture fit that the company is very conservative in terms of policy and presence.", "Interview Questions": "What was the largest donation you secured? How did you improve your previous program?"}, {"date": "17 Nov 2021", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA)", "Interview Descriptions": "HR phone screening interview then video panel interview scheduled with department leadership -  director, manager and supervisor.  Manager was absent. Over all the video interview was more than one hour.", "Interview Questions": "Asked questions on statistics of workload (annual cases) that only management would have access to.\r\nCertain questions felt more probing/prying than inquisitive for the purpose of hiring; two female interviewers making unprofessional/condescending gestures to response during video interview. \r\nFelt uncomfortable and lost interest in working with them."}, {"date": "27 Oct 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Once the nurse recruiter contacted me, the process was very quick and easy. I did a virtual interview with the nurse manager, clinical nurse specialist, and a charge nurse. Everyone was very nice and friendly, and they answered all of my questions. I got an offer the day after my interview.", "Interview Questions": "Talk about a time you were surprised."}], [{"date": "20 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health in Sept 2021", "Interview Descriptions": "I first got called from HR who interviewed me and then I received a call back. They then schedule you with the unit manager of the department you applied for which is more to get a feel for who you are.", "Interview Questions": "Tell us of a difficult time with a patient and how you dealt with it. Have you had any conflict with coworkers, if so how did you handle it."}, {"date": "24 Feb 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Thomas Jefferson University and Jefferson Health in Sept 2021", "Interview Descriptions": "The interview process went great. The questions I was asked were simple and to the point. I would advise anyone interviewing with Jefferson to do their research on the hospital's mission statement and values.", "Interview Questions": "Name a time you encountered conflict in a previous work environment and how you handled it. "}, {"date": "26 Jan 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Sept 2021", "Interview Descriptions": "First, interview with a recruiter, then you can interview with the department manager.  Both of the interviews are on zoom meeting. Usually, they ask when your available range of days for an interview.", "Interview Questions": "What is your strength and weakness?"}, {"date": "7 Jan 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Aug 2021", "Interview Descriptions": "Being that they are in high demand of this position the interview process was pretty quick and easy. I put in a resume on the website and they got back to me in about a week. Then had a in person interview and basically got the job.", "Interview Questions": "What would you do in a difficult situation and how did you resolve it?"}, {"date": "3 Jun 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Was very easy minimal questions asked. Mainly why jefferson and 5 year plan. The manager just talked about the job responsibility and what i would be doing. Overall the easiest interview I’ve ever had", "Interview Questions": "What is your 5 year plan \r\nWhy jefferson"}, {"date": "19 May 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "A recruiter reached out to me via email to set up an interview with one of the managers on the floor. The interview was conducted through Zoom, for which the link was sent through an email.", "Interview Questions": "Why should I hire you? "}, {"date": "14 May 2021", "title": "NPD Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Group then manager.  The group interview was very comfortable and they covered appropriate topics to get insight into my experience. This is an organization that supports and encourages nursing education.", "Interview Questions": "How did you deal with a situation in which you disagreed with a colleague. "}, {"date": "5 Apr 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "great process great nursing manager asked few general questions \ndid not ask any clinical situation questions\ndid not regret accepting this position at all\nwas about thirty minutes in length overall", "Interview Questions": "why do you want this position"}, {"date": "16 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University and Jefferson Health in Mar 2021", "Interview Descriptions": "Total of three interviews. One with recruiter, one with manager and final one with clinical operations. It was pretty straightforward. The offer was brought quickly after third interview. Onboarding was tedious with HR", "Interview Questions": "Tell us about your previous experience"}, {"date": "16 Feb 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health in Feb 2021", "Interview Descriptions": "The interview process was very quick. I applied on Monday, had a phone interview on Wednesday and a zoom call interview on Friday, got an offer the following Monday.  One interview involved 2 interviewers and the other only had one. They made me feel super comfortable and I had a great experience.", "Interview Questions": "What is a 5 year plan?"}], [{"date": "18 Jan 2021", "title": "Research Technician-Department of Pathology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "The first part of the application process was completing the actual application. Questions were very straight forward (as in most applications) but the site they use is a bit outdated and so I had difficulty figuring out things like how to upload attachments.", "Interview Questions": "Explain the experience I had in the position I was applying for"}, {"date": "3 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "It was simple and personal. The manager took the time to introduce me to everyone in the unit and I also got to talk to some of the more experienced nurses one to one.", "Interview Questions": "What’s one of my greatest strengthen?"}, {"date": "21 Jan 2021", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Langhorne, PA) in Dec 2020", "Interview Descriptions": "The interview process consists of a simple cellphone call. The questions were straight to the point and the additional information that they required was submitted through an online portal making the hiring process easier to navigate.", "Interview Questions": "Why are you interested in this position?"}, {"date": "30 Aug 2021", "title": "Registered Nurse, Float Pool Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Dec 2020", "Interview Descriptions": "one interviewees, virtue interview took about 15 minutes,  started with introduction about the float pool program, followed by some general questions, scenario questions, end with do you have any questions from  me?", "Interview Questions": "what to do if  you come to a new  unit, other nurses don't wanna communicate with you?"}, {"date": "22 Aug 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Very easy and nice, simple no stress and simple process, you'll love the process and everything about it. You'll love the job and everything. I enjoyed the life style and work loved it", "Interview Questions": "Q: Where did you go to college?"}, {"date": "16 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "The first step was a phone interview with HR. I was then scheduled for a zoom interview with the nurse managers on the floor. There were 2 managers I interviewed with and they asked me a variety of questions.", "Interview Questions": "5 year plan \nTell me about yourself \nTime I did not know the answer to something "}, {"date": "8 Jun 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Easy interview, asked about 5 questions.  My interviewer was very engaged and even followed up my answers with her own perspectives, so it made the process a lot more personable.  Got offered the position 5 days after the interview and I start this month!", "Interview Questions": "Why Jefferson and why this floor (oncology floor)?"}, {"date": "14 Aug 2020", "title": "Medical Lab Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jun 2020", "Interview Descriptions": "Interviewed with manager and was able to meet some staff members.  Toured facility and was given a brief plan for future improvements.  Human Resources rep was very nice and professional and explained pay and benefits very well in offer letter.", "Interview Questions": "To tell them about myself"}, {"date": "7 Jun 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in May 2020", "Interview Descriptions": "Interviewed last year during Covid so process was entirely virtual. Questions were straight forward and consisted of: strengths/ weaknesses, tell me about yourself, a time you dealt with a difficult patient, etc.", "Interview Questions": "Strengths/weaknesses, a time you dealt with a difficult patient"}, {"date": "20 Apr 2020", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "applied online and received an interview offer by a talent recruiter a day or two later. Scheduled the interview for a few days later and it was over webcam.  The interview itself was resume regurgitation and walked through every job on the resume and lasted about 50 minutes.", "Interview Questions": "What was the situation when you felt that challenged you or was stressful?"}], [{"date": "23 Jan 2020", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jan 2020", "Interview Descriptions": "I met two administrative hiring experts who hire and train the people they hire. They were welcoming, funny, asked great questions and really interested in my experiences. They seemed open to the fact that I would need training to work in a hospital as I’ve gained most of my work experiencing in skilled nursing facilities. \r\nI later met with the VP and a woman who, I think, was from HR. They were all great. I’d be happy to work here.", "Interview Questions": "Three strengths and three weaknesses. "}, {"date": "3 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Relaxed, informal. Nurse manager and clinical charge nurse, very straightforward questions with low pressure. Was given information on the unit and expectations right away and taken to meet nurses on the unit. Was given an offer the following monday and started after christmas.", "Interview Questions": "What was the hardest thing you had to do during your clinical experience?"}, {"date": "8 Nov 2019", "title": "Population Health Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Nov 2019", "Interview Descriptions": "I was contacted via email to schedule and then reschedule an interview.  I showed up to the interview to find out the interviewer called out sick and never notified their staff to cancel or reschedule the interview with me. Unfortunately, I later on found out the next day after calling the interviewer that they are no longer interviewing for the position. The position, however, is still posted. This interview was not coordinated by a human resources representative and I have yet to speak with the interviewer about this discrepancy.", "Interview Questions": "“Hi. How may I help you?”"}, {"date": "8 Dec 2021", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Sept 2019", "Interview Descriptions": "I went through a staffing agency and the process was very straightforward. I went in for the interview and by the end of the day was contacted I had landed the job.", "Interview Questions": "For the position I was going for there were a lot of scenario questions like, \"What would you do if the ac went out on a very hot summer day\""}, {"date": "20 Sept 2019", "title": "Registered Nurse, Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Aug 2019", "Interview Descriptions": "The interview was brief, I was early so we started sooner. I met with the manager, talked for 30-40 minutes then took a tour of the department . After the tour the manager said she only had one position and if I didn’t hear back right away that doesn’t mean they may not call weeks later to offer a position that became available", "Interview Questions": "Why Jeff? "}, {"date": "12 Aug 2019", "title": "Technical Support Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Aug 2019", "Interview Descriptions": "It was straight forward, and in person. It ran for about 30 minutes or so. It wasn't anything out of the ordinary for the process, and it ran pretty quick.", "Interview Questions": "What is your life like outside of work?"}, {"date": "10 Jul 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Jun 2019", "Interview Descriptions": "Got a call to set up an interview date. Talked to HR first to go ofer pay and benefits. I was then told to walk over to the manager’s office and had my interview there. Was told that they would get back to me in 1-2 weeks. Its been a month and I’ve gotten no contact from HR or the manager...not even a reference request.", "Interview Questions": "What is one thing you like about nursing and one thing you hate?"}, {"date": "28 Apr 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Apr 2019", "Interview Descriptions": "First interview phone call with hospital HR, then in person interview on specific unit. In person interview I met with nurse manager, nurse educator, and charge nurse. They all asked questions, very laid back in the managers office.", "Interview Questions": "Why do you want to work at Jefferson?\r\nTell me about yourself.\r\nWhere are you from?"}, {"date": "22 Mar 2019", "title": "Software Application Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Mar 2019", "Interview Descriptions": "Very casual, they sat me down with 3 other developers on a phone call and asked about my experience. They were very nice and simply wanted to know more about myself. It felt more like a conversation.", "Interview Questions": "Describe your background"}, {"date": "14 Mar 2019", "title": "MA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Mar 2019", "Interview Descriptions": "disorganized no signs were posted, A person could get lost finding the interview. I was placed at the wrong table for the interview. Appointments  were not followed. It seemed like a long wait before you meet with someone. No one showed me the way out, all doors were closed.", "Interview Questions": "what type of job I was applying for"}], [{"date": "17 Feb 2019", "title": "Research Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Thomas Jefferson University and Jefferson Health in Feb 2019", "Interview Descriptions": "I had my interview 2/6/19 with the Supervisor and Manager. The interview went great. The following Monday I received and email to give 5 references. By the end of the week I received a phone call stating I got the job and later that day received my acceptance letter.", "Interview Questions": "What your your strengths and weaknesses within the workplace"}, {"date": "2 Jan 2019", "title": "Staff Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Two lengthy interviews, the first with management and the second with staff. Submitted five references. No response from HR which I found to be very unprofessional.  An automatic rejection email doesn't take long to send. Would not recommend this employer to anyone.", "Interview Questions": "How do you deal with a difficult employee?"}, {"date": "28 Mar 2021", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jan 2019", "Interview Descriptions": "Had four interviews, one with each person of the department one on one. Overall a very easy interview. I feel like overprepared for this interview, but it might be different with other departments.", "Interview Questions": "What is your history in the department you're applying to?"}, {"date": "16 Jun 2023", "title": "Dental Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jan 2019", "Interview Descriptions": "Very long and was unsure about the position, I really don't have much to say about it. It was pre Covid. This amount offered was not enough to travel to and fro Philadelphia.", "Interview Questions": "If I was willing to travel"}, {"date": "13 Dec 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Dec 2018", "Interview Descriptions": "I was a new grad and this was my first interview out of school. I applied online and within the week received a call from a nurse recruiter who scheduled me for an interview. I completed an online med/skills test and listed 5 references before coming in.  I first met with the recruiter who reviewed the documents I brought and explained information on training, benefits, policies, etc. I was given a map and directions to walk to the hospital where I met with the nurse manager. The interview was fairly conversational and consisted of some standard behavioral questions. I was then given a tour of the unit and met with the clinical nurse specialist who talked a little more about the unit and the orientation process. Lastly, was given the chance to talk with one of the RNs/charge nurses on the unit who answered any final questions I had about the unit being a good fit for me (What is the culture like?, Do you feel  supported?, What is a typical shift like and what are your typical patients?, etc.) The nurse manager had given me her business card so I emailed her later touching on a few points from our conversation and thanking her for her time.  I received an offer a few days later and accepted.", "Interview Questions": "Why are you interested in working at Jefferson?"}, {"date": "15 Sept 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Nov 2018", "Interview Descriptions": "I interviewed with Human Resources Nurse Recruiter first. They asked me basic interview questions. Then I walked over to the hospital unit I was interviewing for and the nurse manager sat me down in the lounge. There, we discussed the position. I got the impression I already had the job before I met the Nurse manager because they were asking me if I'll work here if they give me the job.", "Interview Questions": "Tell me about a time you had an agitated, confused or uncooperative patient.\n"}, {"date": "6 Sept 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Nov 2018", "Interview Descriptions": "Very easy. Just a conversation. No hard questions. You meet with the nurse recruiter and then you walk over to your specific unit to meet with the manager and clinical specialist.", "Interview Questions": "Do you have any questions? "}, {"date": "2 Jan 2019", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Oct 2018", "Interview Descriptions": "It was the best interview I've ever had! My interviewer was very welcoming. She is such a pleasure to work for. I can definitely see myself going very far with this company!", "Interview Questions": "What can you bring to the company?"}, {"date": "29 Sept 2018", "title": "Insurance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Sept 2018", "Interview Descriptions": "I submitted my application in August I went for the interview in September,I met with the hiring manager and supervisor the interview went well,they explained that it was an very busy and position.", "Interview Questions": "How long after you submitted your 5 reference did you get call back?"}, {"date": "8 Aug 2022", "title": "Patient Transportation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jun 2018", "Interview Descriptions": "The interview was nice and short not to many questions.The one question was Why do you wanna be employed at Jefferson.what makes u a qualified person for the Job.what does Your work ethic may u qualify to to work here", "Interview Questions": "Why do u wanna work at Jeff"}], [{"date": "22 May 2018", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in May 2018", "Interview Descriptions": "In an office with HR. Two test- one for @problem solving\", \"CMA test\". Not difficult. \r\nShort Interv with HR manager. The very friendly atmosphere in the office.\r\nThey give EPIC training for 1 day, after that, you need do background check", "Interview Questions": "What about your experience"}, {"date": "14 Aug 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in May 2018", "Interview Descriptions": "pleasant and informative, information provided about the position I applied for, the manager did not ask me any typical interview questions , maybe because the decision was made based on my appearance", "Interview Questions": "No specific questions but asked about my responsibilities in another role"}, {"date": "12 Apr 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (New York, NY)", "Interview Descriptions": "I was called to come in for an interview within a week of applying. I first met with the nurse recruiter who collected my paperwork and asked me some questions about my employment history. She then gave me directions to walk over and meet with the nurse manager. I interviewed with him for a bit and then he left and sent in a few of the nurses on the unit to speak with me. A few days later I was called with the job offer.", "Interview Questions": "What are some of your strengths/weaknesses?"}, {"date": "13 Apr 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Apr 2018", "Interview Descriptions": "Applied online, received phone call a few weeks later to schedule an interview...met first with the HR recruiter, who was very standoffish and told me they had been interviewing tons of people for the job and would be in the upcoming weeks (not sure why I needed to know that)...I then met with multiple managers at the head of a table..they acted like they wanted nothing to do with me and the one interviewer was on his phone the entire time...the whole thing probably lasted less than 10 minutes and it was one of the most awkward experiences of my life", "Interview Questions": "What do you think is the role of the OR nurse"}, {"date": "22 Oct 2019", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health in Jan 2018", "Interview Descriptions": "Interview was pretty straight forward. Be prepared and you'll have no issues. They asked for a copy of your resume. They discussed the position a lot and informed you on what you would be doing. They also asked several questions about yourself and your future goals.", "Interview Questions": "What would a previous job say about you?"}, {"date": "2 Nov 2017", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "I was pulled into a joint interview between my potential supervisor and manager. They both proceeded to explain the position basically tag teaming the who interview without letting me get a word in. Then I was told that the job was really hard and if I made a mistake I would potentially be killing a patient.  I was not phased knowing that this was a billing/registration job and that the actual possibility of risking a life was zero.", "Interview Questions": "Are you willing to stay late if your work is not completed?"}, {"date": "12 Sept 2017", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "I interviewed with the manager who then showed me around the facility and introduced me to everyone.  I was invited back the next day to shadow the nurse.  I received the benefit package from HR the same day.  Everyone was very friendly. Unfortunately,  they were interested in hiring a nurse with experience in that specific field and I am a new graduate nurse.", "Interview Questions": "Why do you want to work here"}, {"date": "17 May 2017", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Interviewed with a recruiter and nurse manager. Process was quick and painless.  The recruiter ask very generic questions all of which were situational. I was offered the position the very next day.", "Interview Questions": "Describe a situation where you dealt with a patient who had different morals than yourself "}, {"date": "6 Oct 2021", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Feb 2017", "Interview Descriptions": "Very straightforward process the included the usual discussion about how one's past experiences and education would dovetail with the requirements of the job at hand. Low stress and a people-oriented interview process.", "Interview Questions": "How I worked in a team-oriented project scenario."}, {"date": "17 May 2017", "title": "Administrative Fellowship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Oct 2016", "Interview Descriptions": "Initial 30-minute phone call with a group of former fellows, followed by an on-site interview that included a dinner with the formal fellows, a tour of the facility, and a formal interview with a larger group.", "Interview Questions": "How do you keep up with the changes in healthcare?"}], [{"date": "11 Dec 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (New York, NY) in Oct 2016", "Interview Descriptions": "Applied online, 2 weeks later received a phone call to set up interview, did a medication exam, went to interview at HR first then with the unit manager, and lastly with a nurse", "Interview Questions": "What IV meds have you give?"}, {"date": "13 Jul 2016", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jul 2016", "Interview Descriptions": "Fill out the form..meet and greet..\"We need to put a face to the resume\"fast talking interviewer who had his script down pat. \"We'll call you by 4:30 if we think you can go on to the second interview\" Led out to back door.", "Interview Questions": "When could I start work?"}, {"date": "14 Jul 2016", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jul 2016", "Interview Descriptions": "meet with director. Manager. And training manager. They take you to a office ask you few questions. Just try be as calm and relax as possible. And just be honest and straight up with everything. At the end of the process they said they'll send a email", "Interview Questions": "Tell me about yourself"}, {"date": "19 Feb 2018", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jun 2016", "Interview Descriptions": "I received a phone call from HR with basic screening questions such as why I wanted to be a nurse. And then received an email the next day to schedule an interview, where I met with HR, nurse manager on the unit, and two nurses. They had basic questions regarding my clinical experiences. The whole process took less than 2 weeks.", "Interview Questions": "Why nursing? "}, {"date": "15 Jun 2016", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in May 2016", "Interview Descriptions": "CAUTION ADVISED\r\n\r\nI had to travel a few hours via train and cab to get to the location of the interview.  Once there, I was soon after greeted by my potential director/manager and brought into his office with another person from the team.  After the interview was complete, I was walked to the elevator and was told someone would be in touch.\r\n\r\n\r\nWhile the interview was an overall pleasant experience in all aspects, I was later appalled to learn that after spending roughly $250 in total for cab and train fair....for a mere CHANCE at getting the position, they would not reimburse me for even a fraction of those expenses.  I wasn't even asking for them to pay my food costs while in the area, which wasn't exactly cheap, either.  Turns out that TJU doesn't reimburse anyone that isn't an employee.  You would think that you would do so for people you may want to become an employee, but no...they're oblivious to the costs people have to endure to even come to an interview if they live a decent trip away or more.  That amount is a lot of money to someone in my position and thanks to this crude policy TJU seems to have, I'll never see it back.  If they treat candidates like this, wonder how they are with their employees.  Dodged a bullet by not working there.  Here's a big middle finger to TJU.", "Interview Questions": "Standard interview questions; easily answered in my opinion"}, {"date": "28 Sept 2016", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Apr 2016", "Interview Descriptions": "I had an initial phone screening with the recruitment office. Fairly typical screening process.  I was invited then for on-site interviews  and met with several individuals on the team with whom I'd be working, the VP HR, and finally the CHRO and assistsnt CHRO.  I thoroughly enjoyed the conversations I had and learned a lot about the organization.  Everyone was very professional and collegial, and it made me want to work there. They then initiated the reference check and employment verification process. I submitted my references and employment was successfully verified, then ten days later I was told I was not selected. I was a bit confused since I went through the final steps of the process, so I asked for any constructive feedback they could give me. I didn't expect a lot, but I thought I'd at least some kind of response. I even expressed interest in another vacancy a few months later, but again received no response. I found the end of this process to be incredibly unprofessional and dismissive to me as a candidate and as a fellow HR professional.", "Interview Questions": "Since I was trying to come back into healthcare from another industry, they asked what one thing I learned outside of healthcare that I could bring with me. "}, {"date": "11 Apr 2017", "title": "Evs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Feb 2016", "Interview Descriptions": "Very easy, come prepared to answer comprehensive questions on background. Human Resources department was very helpful throughout process. Hired me on the spot, started a month later due to current job.", "Interview Questions": "Hardest obstacle at former job & how did you handle it. "}, {"date": "4 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jan 2016", "Interview Descriptions": "I applied online and two days later was called for an interview. I first met with HR and have a brief interview with her and then was given a map to walk over to the floor where I would be working on to meet the nurse manager. The nurse manager was very nice and she talked a lot about the floor and what kind of patients they have and what to expect. She then brought me onto the floor to meet some of the nurses as well. It took a little over 3 weeks to hear back from HR about the position, but in between then I would call HR to check the status of my application. Overall it was a good experience, but took a while to hear back.", "Interview Questions": "What sterile procedures have you done?"}, {"date": "23 Oct 2015", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA)", "Interview Descriptions": "It was the usual hospital interview. When I was contacted for an interview, I received a call to set up an interview, shortly after I received a detailed email about the interview, where to go, what to do, etc. On the interview day, I went up to the receptionist of nursing recruitment, then the HR representative greeted me, and I had my short interview. Interview was short & sweet. It seemed pretty informal, she didn't have specific questions written down to ask. Afterwards I was given a campus map to meet with the dept. supervisor. Also was short & sweet. Then I had a tour of the ER with one of the techs. Process afterwards with the job verifications & references took a couple days and I heard back in about a week from when I interviewed.", "Interview Questions": "Why did you choose Jefferson hospital?"}, {"date": "3 Sept 2015", "title": "Clinical EMR Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jul 2015", "Interview Descriptions": "The initial position i applied online via their portal and was contacted with a week by their recruitment.  I was contacted two week after that the position was filled but they would like to keep me in mind for positions in the future.  I was contacted again by the recruiter several weeks later informing of a position and requesting references.  I recently received an email that explained the department was going to consider other candidates.  There was a severe lack of communication from their recruitment department between delayed response to emails and no returned phone calls.", "Interview Questions": "Directly asked how much money I make."}], [{"date": "22 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jul 2015", "Interview Descriptions": "Placed an online application. Contacted within 10 days to set up an interview. Interviewed with nurse recruiter and hiring manager on the same day. Set up for a shadowing interview with my unit within seven days after the initial interview. After reference and skills check (online process) I was contacted within a few days with the job offer.", "Interview Questions": "With the nurse recruiter:\n\nDiscuss a time that you had a difficult situation with the patient and how you handled it."}, {"date": "30 Jul 2015", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jun 2015", "Interview Descriptions": "I was contacted by someone in HR to come in for an interview the following week. The day of the interview I met first with HR and she discussed the benefits and ask general interview questions. I was told that there were 3 positions open and only 4 people were being interviewed. I was pretty excited about this and just knew that i had the job. Next I met with the administrator of the department. He didn't seem interested as soon as I walked through his office door. Afterwards i was shooed off to meet with the head nurse. She was very nice and welcoming but it was very unprofessional. We were in her office (she shared a closet sized office with another nurse) and practically every 4 minutes someone came barging in looking for candy. After being asked the same interview questions as before I was given a 3 page knowledge test that every MA should know. It was fairly easy and took only 10 minutes. I also had to complete vitals on 2 separate \"patients\". I did a very good job (so I was told) and was told that I will here back from HR about their decision. Let's just say I never heard back. I emailed HR myself and asked for an update and was blatantly told that I didn't meet their expectations. Unbelievable!", "Interview Questions": "What is the first thing that comes to mind when you hear Thomas Jefferson University Hospital?"}, {"date": "26 Aug 2017", "title": "Training and Documentation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health in Mar 2015", "Interview Descriptions": "I had an hour long interview with a panel of other trainers and the director. It was a very pleasant experience, I felt appreciated for my talents.  I applied for the interview on a Thursday got called on a Friday for an interview the following Monday and had an offer by that Friday.", "Interview Questions": "Please describe a time where you had to work with multiple departments to get something"}, {"date": "19 Jun 2015", "title": "Surgical Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Jan 2015", "Interview Descriptions": "I met briefly with a young woman from HR who discussed the hospitals values and their benefit package. There was a large group of RNs who were beginning their orientation that day- at least 30 of them. A young woman sat in the chair next to me before I was called and was sitting there after we finished. I suppose she was being interviewed next. I was then escorted to the department I was interviewing for. She was very friendly and we chatted during our walk.", "Interview Questions": "She asked how I dealt with people from other cultures or who shared different values/views than I did."}, {"date": "14 Aug 2015", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Aug 2014", "Interview Descriptions": "i was asked how was my clinical experience, what were my weaknesses and strong points. if given a difficult situation, how would i handle it. overall, it was very straight forward questions.", "Interview Questions": "i was asked how was my clinical experience, what were my weaknesses and strong points. if given a difficult situation, how would i handle it."}, {"date": "5 Jun 2014", "title": "Patient Account Representative III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA)", "Interview Descriptions": "I heard of the job opening from a friend. I was called in for one interview and was notified later that day I was hired. I was scheduled for a physical and upon passing was sent for orientation and classes to learn the system I would be working on.", "Interview Questions": "If you are hired to work for this company what will you bring to them, and what do you expect to be brought to you. "}, {"date": "26 May 2014", "title": "Clinical Research Assistant I Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "Applied through their online database. Interviewed 2 wks later. mostly asked questions about past work experience and studies. The interview was laid back, more conversational. I was in a conference room with two interviewers.", "Interview Questions": "What was a challenge at a past job i overcame."}, {"date": "17 Apr 2014", "title": "Senior Data Analyst/Bio Statistician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "in depth interview-interviewed by several physicians,nurses in a hospital program. Department was not ready for me to join their group even thouygh there were a at least a few weeks before I initially started my position. Poor planning for a new employee.", "Interview Questions": "long term goals"}, {"date": "23 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Apr 2014", "Interview Descriptions": "I had a phone interview with one of the senior administrators. They asked why I wanted to work at Thomas Jefferson University Hospital, what I could bring to the table, and what I wanted to get out of the internship.", "Interview Questions": "Basically asked about my prior roles"}, {"date": "13 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "My initial job interview was quite unique.  I was basically begging for the job, and not taking no for an answer.  I explained my assets and how I would be a great mix for my unit and for the institution.  I got the job!", "Interview Questions": "\"What is your greatest asset?\""}], [{"date": "22 Feb 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Thomas Jefferson University and Jefferson Health", "Interview Descriptions": "I knew somebody that was friends with the manager. That is how I found out about the job opening. I applied and was called for a interview that same week.", "Interview Questions": "Goals in mynursing career. \r\nWhat are my bad traits."}, {"date": "17 Oct 2018", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Jan 2014", "Interview Descriptions": "Long interview process which took a total of 2 months to complete.  Filled out application and was contacted by supervisor a month later.  I had 2 interviews in the department with the supervisor and department heads.", "Interview Questions": "Where have you trained?"}, {"date": "29 Aug 2013", "title": "Systems Engineer Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA)", "Interview Descriptions": "Initially, a head hunter told me about this job. I had 3 interviews.  The first one was with my future manager.  The next one was with my future coworkers.  I had one more with my future manager.", "Interview Questions": "This interview was done 17 years ago.  They were most interested in my prior experience and did not try to catch me on a question.  I provided this information in great detail."}, {"date": "16 Feb 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Jun 2013", "Interview Descriptions": "Already worked there part time. So I interviewed with people I already worked for. Plus I interviewed with HR. It was not difficult. It did not take me long to find out that I got hired. The process was not hard.", "Interview Questions": "How fast of I worked was I."}, {"date": "31 Aug 2014", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Apr 2013", "Interview Descriptions": "There are 2 interview process. First, I was interviewed with human resources. After I passed the interviewed, HR decided what unit i will work for and take me to the nurse manager for the second interview.", "Interview Questions": "How do you deal with difficult patients?"}, {"date": "29 Jul 2015", "title": "Patient Safety Companion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Thomas Jefferson University and Jefferson Health (Phila, PA) in Oct 2012", "Interview Descriptions": "This was a standard interview in difficulty. Not too strenuous on me.\r\nIt turned into a very relaxed and casual conversation.\r\nIt was a one-on-one setting. I met with the director & she was very nice and easy to talk to. The office environment there seemed comfortable & inviting.", "Interview Questions": "What is your goal in five years"}, {"date": "20 May 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University and Jefferson Health (Philadelphia, PA) in Aug 2011", "Interview Descriptions": "I applied online with a resume and short \"cover letter\" to the TJUH website.\r\nI was contacted (via email) a week later about the two positions I applied for. I was sent a link to a \"skills test\" that was a mandatory step in the process. Once I \"passed\" the online skills assessment, I would contacted directly by phone to set up interviews for the positions.\r\nI was contacted by the Nurse Recruiter two days after I submitted my test and we set up a day that I would come to the hospital for my face to face interviews for each department.\r\nA week later, I was told to come to the Nursing Recruitment office to fill out some paperwork and submit all my relevant documents for the position (state licensure, child abuse clearance, FBI background check, CPR card, etc etc). \r\nAfter the paperwork was done I was escorted to my first interview. It was with the Nurse Manager of the department and the Assistant Manager. It was in a small office where I was asked realistic and relevant questions about my work background and how I could / would adapt to working at the TJUH. The interview took about an hour. Both interviewers were friendly and knowledgable about what their department's needs were and what I would be expected to do while employed there. \r\nI was then sent (with directions) to another building on the campus  for my next interview.\r\nI interviewed with 3 people from the department - the Nurse Manager, and the two Nurse Educators.\r\nThe panel interview was pleasant and very informative. They each asked two or three questions of varying topics. The interview took a little over and hour and I was told I would be contacted by the Nurse Recruitment department if I was an appropriate candidate for the position(s). \r\nA few days later I was contacted with a job offer from the hospital and the process moved forward without any problems.", "Interview Questions": "Why shouldn't we hire you?"}]]