[[{"date": "N/A", "title": "RADIOGRAPHY Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at American Career College (Los Angeles, CA) in Jan 2021", "Interview Descriptions": "Pretty easy if you did your research beforehand. Questions are very similar to a typical job interview. Most  questions are self-reflected and things that got you interested in this path", "Interview Questions": "Why did you choose to pursue this career"}, {"date": "28 Jun 2021", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Career College", "Interview Descriptions": "it was 2 step interview process. it was Phone interview and then in person interview in the office with hiring manager. it was quick process. It took about 2 weeks to get hired", "Interview Questions": "Why you want to work here?"}, {"date": "19 Jun 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Career College", "Interview Descriptions": "I was interviewed by three cheery administrators. They challenged me with tough questions about how I would handle stressful classroom situations. Afterwards, I gave a sample lesson, which they were happy to participate in. Very fun interview.", "Interview Questions": "How would you adapt to your class if your computer, internet, and projector suddenly stopped working?"}, {"date": "24 Feb 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Career College (Anaheim, CA) in Jan 2018", "Interview Descriptions": "HR recruiter reached out to me directly about interview times. Scheduled them quickly with the direct supervisor for the department. Great part of the recruitment process is that it allowed for me to accept teaching assignments throughout American Career College campuses.", "Interview Questions": "Experience teaching students with diverse educational backgrounds."}, {"date": "29 Sept 2016", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at American Career College (Irvine, CA) in Sept 2016", "Interview Descriptions": "Phone interview with Director.  In person interview the following week with Director, Manager of NOC and Sr Systems Admin.  Process was very professional and straight forward.  Pleasant location as well.", "Interview Questions": "When approached with multiple problems at once how do you determine which to take care of first?"}, {"date": "3 Oct 2016", "title": "Coding Manager for HIM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at American Career College (Santa Ana, CA) in Jul 2016", "Interview Descriptions": "The interview process went very well and I also got a second interterview, was offered the job, but HR never sent papers and so I was being told it was on another bosses desk and I inquired every week and this was what I was being told.  then just this morning I emailed and was told they went with another candidate.", "Interview Questions": "What would I bring to this company?  What makes me the right candidate for this position?"}, {"date": "23 Jul 2019", "title": "Student Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at American Career College (Orange, CA) in Dec 2015", "Interview Descriptions": "Phone screen with the hiring manager and then an hour long interview with the hiring manager before a panel interview with potential peers. The process took approximately 14 days in total. The communication between the stages was not the best and it took another week to receive a formal offer. However, the interviewers were professional and did their best to keep me up to date on the next stages.", "Interview Questions": "How do you manage multiple demands on your time?"}, {"date": "30 Oct 2015", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at American Career College (Irvine, CA) in Jul 2015", "Interview Descriptions": "The interview process was fabulous. Everyone that I interviewed with made me feel really at ease. American Career College has really thorough interview process. After interviewing with American Career College, I feel prepared for any future interview that I may have.", "Interview Questions": "How would you handle a discrepancy that you caught at work."}, {"date": "3 Apr 2015", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Career College (Los Angeles, CA) in Mar 2015", "Interview Descriptions": "Recruiter was very nice and professional but did not much about culture of campus since she was not on campus but sits in administration building. Interview schedule changed a few times. Phone interview was more like a quick scan of what's on your resume then meeting with manager/program director who asked questions already on my resume. Do not need teaching experience so I felt fine.", "Interview Questions": "Describe your last work experience."}, {"date": "26 Aug 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at American Career College (Irvine, CA) in Nov 2012", "Interview Descriptions": "Met with President and VPs and the department.  Pretty informal questions were asked about the management style I preferred, the background of my experience, pretty run of the mill.", "Interview Questions": "What kind of manager would you like?"}]]