[[{"date": "13 Dec 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Furman University", "Interview Descriptions": "Interviewed on campus with department and cross campus partners. It was panel style and one on one interviews. Asked general questions on past experiences and what I would bring to the team", "Interview Questions": "Tell me about when you worked on a team?"}, {"date": "14 Aug 2021", "title": "Assistant Director, Student Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Furman University", "Interview Descriptions": "3 part interview. \n\n1st round--phone interview with the director\n\n2nd round--Zoom interview with students and members of the office\n\n3rd round-day-long meeting being interviewed by multiple stakeholders including: students, office members, auxiliary partners, and vice presidents.", "Interview Questions": "Describe how you plan on incorporating the Furman Advantage into your work."}, {"date": "19 Feb 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Furman University", "Interview Descriptions": "The interview was conducted very professionally!  I had a great conversation with several professors.  The interview took place in January and lasted about 30 minutes.   I dressed formally for the interview.  I found the professors to be very polite and would have enjoyed working with them.  My sense is that the professors enjoy working at Furman", "Interview Questions": "My research interests and goals"}, {"date": "12 Jan 2022", "title": "FitRx Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Furman University (Columbia, SC) in Jan 2019", "Interview Descriptions": "Short questions. 1 question. Not stressful at all. Just talk about why you want to complete this internship in the instructor's office. The interview last under 10 minutes. The style is relaxed.", "Interview Questions": "Why do you want to do the intenrship"}, {"date": "15 Aug 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Furman University", "Interview Descriptions": "Phone interview followed by on campus Interview meeting fellow co-workers and related offices. Discussed new goals for the University and diversity awareness in advising students needs.  Long on campus interviews with full day schedules.  Positive Experience meeting faculty", "Interview Questions": "Why did you choose your area of study?"}, {"date": "21 Sept 2020", "title": "IT Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Furman University (Greenville, SC) in Jan 2016", "Interview Descriptions": "The interview process was very easy if you can problem solve, and it helps to know how computers work generally speaking. There were a panel of your future colleagues who asked based questions about customer support and what you would do in particular situations.", "Interview Questions": "What would you do if someone called who couldn't connect to the internet / printer?"}, {"date": "10 Jun 2015", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Furman University (Greenville, SC) in May 2015", "Interview Descriptions": "I applied, then was contacted by email to schedule a Skype interview. After the Skype interview, I was contacted by phone to schedule an on-campus interview. The on-campus interview consisted of a whole day of meetings and interviews with various campus groups, including the Admissions leadership team, all the counselors, and all of the Admissions staff. I had to give a presentation to everyone I met with that day, a room of about 30 people. I also toured the facilities in the departments I'd be recruiting students for, and had individual meetings with faculty. The great thing was that the person who had the job last took me on the tour and was available for me to ask questions. I was able to get a really good perspective on the true day-to-day functions of the position.", "Interview Questions": "What is your spirit animal?"}, {"date": "3 Apr 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Furman University", "Interview Descriptions": "Multiple steps including phone interview, group interview with hiring department, panel interview with a search committee.", "Interview Questions": "Told to give a 15 minute presentation on a relevant topic"}, {"date": "1 Apr 2014", "title": "Admissions Student Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Furman University", "Interview Descriptions": "Found the opening via a job fair during freshman orientation, my name was put in and I was called in for an interview", "Interview Questions": "N/A"}, {"date": "24 Nov 2013", "title": "Library Assistant At James B Duke Library Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Furman University in Jun 2012", "Interview Descriptions": "I had an interview with the boss.", "Interview Questions": "Asked me what my favorite book was"}]]