[[{"date": "4 Jul 2023", "title": "Education Abroad Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purchase College (Harrison, NY)", "Interview Descriptions": "2-part interview, both online. First interview was standard interview questions with the hiring committee (~30 minutes). Second interview was more standard interview questions with the hiring committee, a presentation delivered to them, and a one on one interview with the hiring manager.", "Interview Questions": "What made you interested in the position? What are the modern day issues facing students in study abroad? What can students learn from you as a study abroad advisor?"}, {"date": "3 May 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purchase College (Purchase, NY) in Apr 2023", "Interview Descriptions": "They bring in Black academics for the interview process to satisfy quotas and look like they're being inclusive, but they're just wasting your time. They have no intention of hiring you, and the faculty is quite against you. I interviewed with the Communications department. The process was rushed so that they could get me out of there as they had no intention of actually listening to me but just being able to say they interviewed a Black girl. I was forced to work through technical difficulties with their equipment that ruined my presentation with no assistance from their chair. In fact, she was the one who rushed me and refused to assist. Just one of the most racist experiences I've ever had in my life.", "Interview Questions": "How do you handle difficult situations in the classroom?"}, {"date": "1 Apr 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Purchase College", "Interview Descriptions": "I first had a 15 to 30 min phone interview with the interview panel. After about a month or so, I was invited to an onsite-interview with the same committee, followed by a 1-on-1 interview with the hiring manager. Afterwards had a tour of the building with one of the staff.", "Interview Questions": "What do you know about Purchase College"}, {"date": "18 Feb 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Purchase College (Purchase, NY)", "Interview Descriptions": "The whole process can take months. There is a phone interview and then an in-person interview.  If you don't meet all of the criteria, and sometimes having the preferred qualifications help.", "Interview Questions": "Very basic. The search committee has to come up with the questions in advance. You have to know what FERPA means for almost every job."}, {"date": "17 Jul 2019", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Purchase College", "Interview Descriptions": "I applied for the position and was emailed to schedule an in person interview. After an hour long interview I heard back a few days later with time/day options for available courses.", "Interview Questions": "How do you teach to the least prepared student?"}, {"date": "15 Dec 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Purchase College in Dec 2018", "Interview Descriptions": "There is a search committee who is not necessarily in the department you are applying for. As with most colleges, the interview process is lengthy. There were two interviews in person.", "Interview Questions": "Skill related questions, general performance questions."}, {"date": "5 Jan 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Purchase College (Purchase, NY) in Apr 2018", "Interview Descriptions": "I met with the director of the center at one of the Career Fairs. She talked to me privately about the positions and the kind of individual they were looking for. She made me feel super comfortable and capable. I ended up learning a lot from her in the position.", "Interview Questions": "What are your ultimate career goals? \nDo you have experience in customer service? \nAre you able to problem solve? "}, {"date": "6 Dec 2017", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Purchase College (Purchase, NY)", "Interview Descriptions": "I submitted my resume in person at a job fair on campus (I was a student.) I called a week or so later to set up an interview. The position was to start the following semester. It was an easy and pleasant interview. Two senior staff interviewed me. They were very warm and welcoming. I heard back via email a few weeks that they would like to offer me the position. I started the following semester as planned.", "Interview Questions": "Much of the job consisted of boring and repetitive tasks like stuffing envelopes. They asked how I would handle the boredom and remain productive."}, {"date": "13 Jul 2017", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Purchase College (Purchase, NY) in Jan 2017", "Interview Descriptions": "Simple and straightforward. Came into the student government office and spoke with a coordinator of student affairs. They were welcoming and courteous, just wanted someone for the right job. After 15 minutes of questions and conversation it was done. I was offered a position two days later.", "Interview Questions": "What problems do you see happening on the job and what would you do to solve them?"}, {"date": "26 Jan 2016", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purchase College", "Interview Descriptions": "For staff: the whole process is lengthy because of State regulations. You will be contacted usually a week or 2 /3 after they close the posting,. Expect a first interview (could be by phone) if you are part of the finalists, then an interview in person for the finish line. All interviews are done by a committee, which can  be intimidating if you are not used to it, however the people involve usually go out of their way to make you feel comfortable. Same questions are usually ask from every candidate, which makes it as fair as possible. Standard questions. If you get to the 2nd (usually final) interview, you will probably also have a one-on-one with your supervisor. Dress code for staff is casual professional. Good luck!", "Interview Questions": "Standard interview questions - Same questions are asked to each candidate usually."}], [{"date": "14 Mar 2014", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Purchase College (Purchase, NY)", "Interview Descriptions": "Applied for and got Civil Service position.", "Interview Questions": "Do not remember there being a difficulty question."}]]