[[{"date": "2 Feb 2023", "title": "Therapeutic Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaPointe Health in Jan 2023", "Interview Descriptions": "My interviewer was very informative . She also broke down all the requirements and duties of the job. She also explained how the benefits and pay works . How the position applied for was a PRN and what that meant . She also explained what the company does and who they mostly provide for .", "Interview Questions": "Just questions about my self and my experience."}, {"date": "19 Jul 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AltaPointe Health (Mobile, AL)", "Interview Descriptions": "I applied for a position and within 24 hours was called for a phone interview. The phone interview was set for a week later. I have not completed the interview.", "Interview Questions": "N/A"}, {"date": "25 May 2021", "title": "Behavioral Health Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AltaPointe Health", "Interview Descriptions": "Very Friendly. Great benefits. Hard work. Flexible work schedule. It's a very demanding and rewarding job opportunity. High risk of burn out. Adequate pay and benefits. It is very exciting but not for myself.", "Interview Questions": "Do you have any experience with individuals with developmental disorders."}, {"date": "10 Dec 2020", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AltaPointe Health", "Interview Descriptions": "2 step interview process. HR is really slow to getting back with you. Company does not pay well. I don't know what else to say. Beginner job for experience only. High turnover rate.", "Interview Questions": "How are your writing skills"}, {"date": "2 Sept 2020", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AltaPointe Health (Sylacauga, AL) in Jul 2020", "Interview Descriptions": "I had an initial phone screen, had to do an intro video, and then met the supervisor in person for an interview. I applied for the position in late June. I didn’t called for an interview until late-mid July. Overall, the process was fairly easy.", "Interview Questions": "Do you have any experience working with people with psychotic disorders? "}, {"date": "7 Aug 2019", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AltaPointe Health", "Interview Descriptions": "Interview with a nice woman at HR then with coordinator of location at job location site. All happened within a week of initial phone call for interview.  Everyone was kind and while it was professional it was not pressuring.", "Interview Questions": "Previous experience that relates to job."}, {"date": "21 Jul 2018", "title": "Admission Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AltaPointe Health (Mobile, AL) in Jun 2018", "Interview Descriptions": "Interview was very easy and laid back. It was more of a conversation than an interview. I was called a day after i applied online and then met the following week for an interview and then was called back for the second interview and was given an offer", "Interview Questions": "Tell me about yourself?"}, {"date": "1 Nov 2017", "title": "Informational Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at AltaPointe Health (Mobile, AL) in Oct 2017", "Interview Descriptions": "She was super nice and informative and I loved the building. The staff was nice and the interview was pretty much painless. I wouldn't mind going back for another one if needed.", "Interview Questions": "What makes you different from other candidates?"}, {"date": "7 Dec 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AltaPointe Health (Mobile, AL) in Sept 2016", "Interview Descriptions": "Received an email and call to come in to the HR department first.  The HR person stated their was a list of jobs I qualified for, and we went over the list together. Pick one, had the interview with that supervisor and got the job.", "Interview Questions": "Did I mind doing outreach.\r\nHave I ever worked with the homeless population.\r\nCase management experience.\r\nAm I familiar with difference computer programs.\r\n"}, {"date": "4 Dec 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AltaPointe Health (Mobile, AL) in Sept 2016", "Interview Descriptions": "Had an initial interview with hr. It was pleasant and eased my concerns because I was prepared to answer several questions. Then meet with supervisor and coordinator of the program and had a brief interview and they asked some of the same questions.", "Interview Questions": "How would I handle a difficult situation "}], [{"date": "31 May 2016", "title": "Business Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AltaPointe Health", "Interview Descriptions": "Decent. No problems. HR very sensible in submitting education and additional documents via e-mail. Documents needing signature were easily to complete and fax back. Remember currently on hiring freeze and increase in pay ONLY comes from change in title. Period. No change in title then no change in pay. So remember what salary is offered to you could be yours for a very long time.", "Interview Questions": "General background questions. Nothing out of the ordinary or complicated."}, {"date": "14 Aug 2020", "title": "Behavior Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at AltaPointe Health (Mobile, AL) in Feb 2016", "Interview Descriptions": "Quick and polite interaction. Multiple levels of interview with HR and Director.  Helpful HR staff and easy interface for applications. Took about a month to get the process completed. Drug screening and background check.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "21 Jul 2017", "title": "Behavioral Aide Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at AltaPointe Health (Mobile, AL) in Feb 2016", "Interview Descriptions": "The process was pretty quick it only took about  seven days to get things moving and when it did things started to happen fast\r\n but, they should look harder at who they are picking to take care of these elderly/mentally people", "Interview Questions": "They asked why do I think I want to work there at their comoany"}, {"date": "4 Mar 2016", "title": "Behavioral Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AltaPointe Health in Jan 2016", "Interview Descriptions": "Interview lasted around 20 min. The girl I interviewed with was friendly and informed me of what I would be doing. She told me about EastPointe Hospital and made me feel more comfortable with my decision to try mental health. I went on a second interview at EastPointe and was able to see what a behavior aide does and what it's like to work at the hospital.", "Interview Questions": "Why did you decided to apply to Altapointe? "}, {"date": "15 Oct 2017", "title": "Behavioral Aide Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AltaPointe Health (Mobile, AL) in Jun 2015", "Interview Descriptions": "I was called for an interview at HR which is more than 40 minutes away from me. After talking for 10 minutes, I was told I would be contacted by the coordinator (which took about over a week). I was then interviewed by the coordinator and heard back over a week later saying I got the job.", "Interview Questions": "Tell me about yourself. "}, {"date": "21 Aug 2014", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at AltaPointe Health (Mobile, AL)", "Interview Descriptions": "The first interview is with HR and lasts about 10 minutes, shorter than your waiting time. It is extremely rushed and begins with their offered salary for the position and typical daily tasks. If the interview goes well they will call you to set up a second interview. They do not have a time frame in which you can expect a call back and it is almost impossible to get anyone on the phone to assist you.", "Interview Questions": "\"What did you do in your day of rotation at a mental health facility that helped a patient the most?\"\r\n\"Why are you seeking a job in mental health?\"\r\n-I can't even remember any more questions because they were so rushed with no feedback or conversation between questions."}, {"date": "20 Jan 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at AltaPointe Health (Mobile, AL) in Jun 2014", "Interview Descriptions": "Interview was all of 10 minutes, then went to site where you will be employed, walk through building, answer a few questions, offer received same day as walk through interview. Not much was said about the job and what to expect at either interview. After accepting, had to go for agility, physical test, sign multiple forms etc.", "Interview Questions": "N/A"}, {"date": "7 Feb 2014", "title": "Multiple Positions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AltaPointe Health", "Interview Descriptions": "2 interviews.  The first interview lasted a total of 10 minutes.  It didn't go well.  They made me wait longer than my interview lasted.  I got the call for the second interview the next morning and turned it down because of my perception of the company's knowledge of mental health and the poor pay.\r\n\r\nPrior to the interview I was called and told to apply for as many positions as I wanted to be interviewed for, so I did.  When I got to the initial interview I was told that I could only go through the interview process for one position, which the hiring manager chose without fully explaining the differences.  I had applied for about 6 positions and they chose one of the lowest paying and most dangerous positions to recommend me for.\r\n\r\nUpon arriving, the hiring manager told me that my masters degree did not make me eligible for masters level positions and that I was not going to be considered for any of them until I provided a transcript and it was evaluated and approved.  I have a masters in psychology with an emphasis on clinical psychology.  Based on the hiring manager's expectations, they want all masters level employees to have a counseling degree.  So, when you are looking at positions if it says masters degree don't apply unless you have completed 2 mental health internships.  If I had pressed the matter, I probably could have gotten my transcript approved, but it didn't seem worth the effort for $10.78 an hour when everywhere else I've interviewed at during the past week has offered me a third or double more.  Even if none of the interviews this week work out for me, I'd rather continue my job search and that is saying something since job searching is a horrible process.\r\n\r\nMy advice for individuals with psychology degrees, bachelors or masters level, is to look elsewhere.  There are places in Mobile that pay more for less work and fewer hours.  You just have to look a bit further than AltaPointe. \r\n\r\nI was asked:\r\n\r\n\"What do you want to do?\"\r\n\"What population do you want to work with?\"\r\n\"How would you handle a crisis situation?\"\r\n\"Are you comfortable in crisis situations?\"\r\n\r\nSince there seemed to be an emphasis on the crisis stuff, I asked how often they expected there to be a \"crisis situation.\"  I was told once a week.  I might have to get the police involved and I might not be able to leave if the situation looks bad.  Then I was told if I worked in the hospital there might be a crisis once an hour.  I've worked in a mental hospital of a comparable size and that is unacceptable.  Where I worked previously had 50 beds and treated individuals currently experiencing psychosis and they only had a \"crisis\" maybe three or four times over a period of months.  Either something is terribly wrong here or the hiring manager's information is very inaccurate.", "Interview Questions": "What population do you want to work with?"}, {"date": "17 Jan 2014", "title": "Therapist ; Work With Federal Parolees, Dual Diaganosis and Severe Mental Health Issues Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AltaPointe Health (Mobile, AL) in Oct 2013", "Interview Descriptions": "Two interviews; 1-2 weeks of  comapny policy; safety, computer netwoking skills and training. TB skin test and Hep. testing. Complete physical with drug screen and physical endurance test.", "Interview Questions": "Do you have any biases against mental illness."}, {"date": "3 Oct 2017", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaPointe Health (Mobile, AL) in May 2013", "Interview Descriptions": "The process was not intense, but very calm, my interviewer was professional. She asked questions and waited for my responses . She told me about the department that I would be working in and also the supervisor I'd be working with!!!", "Interview Questions": "Can you tell me about one of the most challenging experiences you have had?"}], [{"date": "25 Mar 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at AltaPointe Health (Mobile, AL) in Jul 2012", "Interview Descriptions": "I first interviewed with HR. This was a quick interview. I don't remember much about it. I then interviewed with the director of the program where I'd be working. I sat in her office for over an hour and had to listen to her brag about all of her inflated accomplishments. The only question she asked about me was where in Florida I had lived.", "Interview Questions": "N/A"}]]