[[{"date": "10 Jun 2022", "title": "Outreach Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Toronto", "Interview Descriptions": "It was a group interview with one candidate interviewed by three representatives. Mainly behavioral questions were asked. Candidate is expected to be very familiar with the campus facilities. The interview process was interesting.", "Interview Questions": "What are some of the biggest challenges for university students to have a healthy lifestyle?"}, {"date": "18 Nov 2021", "title": "International Student Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Toronto", "Interview Descriptions": "Called in for first round interview which went fine, only to find out that the position had been filled. They sent me an information packet for the next year which I was subsequently successful in.", "Interview Questions": "Previous experience working with LATAM students"}, {"date": "7 May 2021", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Toronto", "Interview Descriptions": "They first emailed to set up the interview time. Then after we agreed on time, they sent an invite for a virtual interview through Microsoft Teams. It was only around 30 minutes.", "Interview Questions": "Do you have any questions?"}, {"date": "16 Nov 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Toronto in Feb 2021", "Interview Descriptions": "Interview process was very easy and straightforward, only one round. Interviewed with manager and their co-worker , asked why I was passionate about the role, what I was going to get out of it, etc.", "Interview Questions": "Why did you apply to this position?"}, {"date": "26 Jan 2021", "title": "PhD Program (Direct Entry) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Toronto", "Interview Descriptions": "Generally ask about my research work; no technical question; research interests; career goal; chance to accept their offer; funding situation in the dept; living in toronto; placement of graduate, etc.", "Interview Questions": "Generally ask about my research work; no technical question; research interests; career goal; chance to accept their offer"}, {"date": "20 Oct 2020", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Toronto", "Interview Descriptions": "They asked questions about my resume, especially my master thesis.  They asked about my ideas for some technical problems.  The interview was through skype. After being accepted in the interview you need to apply through the online application website.", "Interview Questions": "Many questions about my resume"}, {"date": "31 Jul 2020", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Toronto", "Interview Descriptions": "The interview process was straightforward and short. Interviewers looked for a good dynamics fit. The technical interview seemed mainly used to gage general familiarity rather than expertise. I would advise being open and honest if there is something that strikes you as unfamiliar.", "Interview Questions": "How familiar are you with using various different plug-ins on wordpress?"}, {"date": "31 Dec 2020", "title": "Softwaere Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Toronto (Des Moines, IA) in Jan 2020", "Interview Descriptions": "HireVue interview with coding questions. There was no personality questions, which threw me off guard. I would have appreciated a notice in the email before my interview that there would only be coding questions.", "Interview Questions": "They asked a lot of coding questions in Java. "}, {"date": "8 Feb 2019", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at University of Toronto (New York, NY) in Feb 2019", "Interview Descriptions": "Four panels with white paper and pens,recording their marks, good communication, good presentation, nice office, discipline people,good language, very aggressive, no jokes,questions well asked,checking of collect English,well looking good and dressed neat", "Interview Questions": "how to take blood sample, how to do blood typing (blood grouping),urine analysis"}, {"date": "6 Mar 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Toronto", "Interview Descriptions": "I emailed professors in the department I was interested in before I applied online. Then I we discussed my past experience and research I worked on and what I was interested in pursuing for my graduate research", "Interview Questions": "What project would you like to work on"}], [{"date": "17 Sept 2021", "title": "Customer Service Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Toronto in Feb 2018", "Interview Descriptions": "First a Single interview, then a second interview, sometimes an essay or test is administered, then references, then a meet and greet. Overall very easy and straight forward, there is no guessing they are straight shooters", "Interview Questions": "5 things you bring to the work place? What are your worst qualities?"}, {"date": "8 Sept 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Toronto", "Interview Descriptions": "Applied online, as stated in the job ad.  Made sure to mention in my cover letter someone I had met at a conference and whose papers I found interesting.  One day, I got an e-mail out of the blue offering me the job.  Paid my own way to go visit before accepting.  As a foreigner, I had to apply for a work permit to work in Canada, but this wasn't so bad.", "Interview Questions": "Would you like the job?"}, {"date": "2 Dec 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Toronto", "Interview Descriptions": "Once admitted to a graduate program, you will be assigned an advisor (if not already previously arranged) or you will meet with the department administrator. Based on your previous studies or current research interests, you will typically be assigned, rather than be asked to choose, a professor to work with. There's no negotiating this. Because of this, it's not uncommon for scheduling conflicts to arise between the undergraduate class you're assigned and your own graduate school courses.\r\n\r\nIn some cases, professors will ask to meet you ahead of the class starting to judge the fit, but the likelihood of swapping assignments is slim. Show confidence so you're not taken advantage of by unreasonable work expectations, but do ask as many questions as needed to clarify the professor's expectations and avoid surprises later.", "Interview Questions": "Professors will ask to meet you ahead of the class starting to judge the fit, but the likelihood of swapping assignments is slim. You may be asked how knowledgable you are on the subject matter be taught in class - if in doubt, ask the professor for material and/or suggestions on how to catch up.\r\n\r\nThere was no mention prior to hiring, but all Teaching Assistants must join the union and pay dues. This also means deferring to the agenda set by the union and occasional strikes during contract negotiations."}, {"date": "2 Jul 2009", "title": "Digitalization Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of Toronto in Sept 2008", "Interview Descriptions": "The interview was not very formal and the hiring process was quick.  Interviewer was very direct and the questions were straight forward.  Dress code was also informal as the position was meant for a student part time.  Hence, interviewer was very friendly and was very approachable.  The knowledge needed for this job was limited but there was a small learning curve when working there.", "Interview Questions": "Do you know anything about old record keeping?"}]]