[[{"date": "22 Apr 2023", "title": "Physician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cedar Park Regional Medical Center", "Interview Descriptions": "Very smooth process. The company will help with paying for transportation and accommodation. Fair interview questions. I didn’t get to tour the facility I would be working at. Lunch was good", "Interview Questions": "How would you describe yourself?"}, {"date": "24 Mar 2022", "title": "Physician Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cedar Park Regional Medical Center (Austin, TX) in Mar 2022", "Interview Descriptions": "I was given a call I missed it and returned it twice but never heard from them since. I will keep waiting. But I am going to focus on things that are more ready and available.", "Interview Questions": "Give me a call back"}, {"date": "2 Mar 2022", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Feb 2022", "Interview Descriptions": "Very last minute. Texted me at 11am and asked for an interview at 1pm. Very informal interview over the phone that lasted 30 minutes. Asked basic experience questions and when I could start.", "Interview Questions": "Favorite part of working in clinical?"}, {"date": "8 Feb 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Jan 2022", "Interview Descriptions": "Very simple interview process, however seemed very desperate for staff and hired on the spot. Started with two people in the interview and then within a few minutes one got up and left. Very friendly made me feel very comfortable.", "Interview Questions": "How do you handle conflict?"}, {"date": "28 Dec 2022", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Feb 2021", "Interview Descriptions": "General interview questions and process. Focused on patient experience, financial integrity, and committment to excellence. Everyone was professional and polite. Hiring process was a little slow but that is expected with larger employers.", "Interview Questions": "How many years of experience"}, {"date": "9 Jun 2021", "title": "Imaging Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Dec 2019", "Interview Descriptions": "The interview was full with different scenario questions. I thought it was very interesting and learned a lot of skills from the interview questions. The process helped me learn how to prepare for future job interviews.", "Interview Questions": "What are your biggest weaknesses and strengths?"}, {"date": "4 May 2016", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cedar Park Regional Medical Center in Mar 2016", "Interview Descriptions": "There were several rounds of interviews. A phone screen with the recruiter in HR, an interview with my manager, a peer interview, and finally an interview with the executives. It was an easy process and they accommodated my schedule no problem.", "Interview Questions": "Typical questions. Name a time where you made a mistake and had to correct it, name a difficult co-worker and how you try to overcome the difficulties, proudest accomplishment from your current position, etc."}, {"date": "16 Jun 2016", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Mar 2016", "Interview Descriptions": "Prompt call from HR to schedule interview, interviewed same week, offer received same week. Nothing unusual or tricky. The employment website is easy to use and jobs are updated frequently so the list remains current.", "Interview Questions": "The usual behavioral interview questions"}, {"date": "23 Jun 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Feb 2016", "Interview Descriptions": "Interviewed with the team in the area I was trying to get into. They are the coworkers I ended up working with. It was a good interview where I got to know them and they got to know me. They were pleasant and welcoming to me and even included gimme questions like \"What do you do for fun?\"", "Interview Questions": "What would you do if you had a problem with another RN?"}, {"date": "27 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Jun 2013", "Interview Descriptions": "Interviewed with director and manager first. Then was sent for peer interviews with more direct questioning from staff. I was given a tour of the unit and job responsibilities were discussed. Also perks and benefits of the position were highlighted. Overall experience was positive.", "Interview Questions": "How would you handle an issue you had with a co-worker?"}], [{"date": "19 Nov 2016", "title": "Laboratory Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cedar Park Regional Medical Center (Cedar Park, TX) in Jan 2013", "Interview Descriptions": "The first thing that really impressed me is peer interviewing at this facility.  I know this is starting to become standard practice, but this is the first time I've ever seen it.  \r\n\r\nI was interviewed by the administrative laboratory director and medical laboratory director at the beginning - asking general questions about experience and scenarios of things that could happen and how I would handle it. \r\n\r\nI was then peer interviewed by two of the laboratory technologist, asking questions to get to know me and how I have handled past situations.  Opportunity for me to ask them questions about the facility and department. \r\n\r\nI was then interviewed by the HR director and a nurse department manager asking various questions to get to know me and how I handle things as well.", "Interview Questions": "How I would handle a particular situation that often relates to intra-departmental communication between the laboratory and nursing?"}]]