[[{"date": "22 Sept 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tyndall National Institute", "Interview Descriptions": "Involved creating a presentation where I had to discuss a project I completed in college and then was asked about what knowledge I know of the company, my previous work experience and why I applied for the job", "Interview Questions": "How would you have done your project differently "}, {"date": "2 Jun 2022", "title": "Operations Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tyndall National Institute", "Interview Descriptions": "A case was needed to present, with a week to prepare and send it before the interview. \r\nthere was a selection committee asking questions about the role, experience,  and personality questions. HR and team members involved", "Interview Questions": "asking questions about the role, experience,  and personality"}, {"date": "18 Aug 2021", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Tyndall National Institute (Dublin, Dublin) in Apr 2021", "Interview Descriptions": "In short, it was professional, quick and well structured. Started with my brief introduction. Then some questions were asked, to clarify the details of my cv and cover letter. Afterwards, my skills were checked, using simple questions, related to the internship structure and applied technologies.", "Interview Questions": "What is a low pass filter?"}, {"date": "18 Jan 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tyndall National Institute (Cork) in Aug 2019", "Interview Descriptions": "I was asked a variety of questions about engineering, biological scientific and goal related questions. It worked out very well. It was easy going. Very nice and happy environment for an interview.", "Interview Questions": "Experience, hypothetical situations, willingness, goals"}, {"date": "16 Nov 2020", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Tyndall National Institute in Sept 2017", "Interview Descriptions": "I got an interview a month after applying and I got a job offer 6 weeks after the interview. There was a panel of 3 people. The interview process was transparent and done well.", "Interview Questions": "What kind of boss do you work well with"}, {"date": "2 Jul 2017", "title": "PhD Candidate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tyndall National Institute (Cork)", "Interview Descriptions": "Was offered a Skype interview with the PhD adviser and the group leader for a PhD position which was very much related to my Master Thesis. I had prepared very well for the interview by browsing through their research papers on the topic and I was well acquainted with the topic and the physics involved, before the interview. The group leader seemed least interested in the interview and my knowledge on the topic (I made sure to delve into details about their research to give examples to show my knowledge on the topic) did not seem to interest them as well. Technical questions hovered only around my Master Thesis, and the rest were HR questions.", "Interview Questions": "Master Thesis: explain electrical characterization (and details related to my thesis).\r\nHR: Future plans, strengths and weaknesses. "}, {"date": "22 Jan 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Tyndall National Institute", "Interview Descriptions": "Contacted university researcher to find out the available projects. He told me and it was really helpful. The rest was pretty straightforward as he just checked to make sure I had the necessary technical skills for the job at hand, and I did so it was OK.", "Interview Questions": "All questions were fair"}, {"date": "20 Apr 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Tyndall National Institute (Cork) in Dec 2012", "Interview Descriptions": "Applied from internet through the Marie Curie portal. The process consisted in two phone interviews: in the first one I was asked about my experience and degree and in the second for at least two references. Last, I was interviewed on site: this was quite nice while they show me all the researche center, after lunch was the main interview with the supervisor and the team leader. In this case I got the offer after this interview.", "Interview Questions": "What do you know about the topic? Can you explain how these devices work?"}, {"date": "2 Nov 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Tyndall National Institute (Cork) in Sept 2011", "Interview Descriptions": "I met 3 people on a board who interviewed me. They made me very comfortable. It wasnt too detailed as they had looked at my cv previously, They were very accommodating and asked questions that were suited to the job i was applying for.", "Interview Questions": "Would i prefer morning or afternoon part time"}, {"date": "8 Dec 2012", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tyndall National Institute (Midleton) in Jul 2009", "Interview Descriptions": "pretty quick and nice interview. actually it depends on your superviser", "Interview Questions": "N/A"}]]