[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Love being part of this amazing work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jan 2021", "job_title": "Anonymous Employee in Glasgow, Scotland", "duration": "N/A", "pros": "Great opportunity to create impact in such a positive way, your input is really listened to and valued. Colleagues are aligned in purpose and vision, so we are all working to the same end and motivation is really high due to that.", "cons": "Very busy and fast paced , it's not really a con though, we are a low cost charity so have smaller teams, it keeps life interesting."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Huge potential, but not realised due to poor management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Oct 2021", "job_title": "Marketing in Glasgow, Scotland", "duration": "N/A", "pros": "The concept of the \"Mary's Meals Family\" is great, there was a warm welcome on my induction, lunchtimes were very sociable, after work drinks and special \"lunch and learn\" events were frequent, and the \"bring and share\"/potluck lunches were always great. \n\nThe pension scheme was great (no employee contribution needed, employer only!) and salary was reasonable. Very nice, modern office with good equipment and facilities.", "cons": "Very poor management, and a very top-heavy organisation. The antiquated phrase of \"too many chiefs and not enough Indians\" comes to mind. There are a number of managers who lack experience but have been promoted due to nepotism, their relationship to senior staff, or due to their Catholic faith. For a so-called secular charity with Catholic origins, it is notable how openly Catholic staff are treated and elevated. \n\nOne very poor manager hired a staff member who could not do basic word-processing (rather than copy and paste from a Word Doc to an email, she was typing everything word for work - didn't know how to copy and paste!). Other staff had to carry her and do much of her work for her. Yet, she somehow passed probation, and had a full-time permanent contract on almost £30,000 per year!! How was this allowed to happen?\n\nThere is a sense of \"us and them\" between MMI and MMUK, who share the office, and this leads to lack of communication and important things falling through the gaps. \n\nOpportunities to develop and progress are few, and very experienced and eager staff and not given opportunity to use their skills effectively, due to the excess of managers. \n\nThe Board is (or at least was, during my time) comprised entirely of Western white business people. There was no representation from Africa or Asia where the work was being carried out. To me, this is a major red flag due to high risk of \"white saviour syndrome\" where interfering westerners seek to do good but inadvertently cause harm. There needs to be qualified professionals from the countries Mary's Meals works in, advising and guiding the strategy. \n\nThe food served varies hugely between countries. Some countries like India or Haiti have a variety of meals served through the week, with rice, vegetables and fish or meat. In Malawi, where the vast majority of meals are served, it is a thin watery porridge which lacks nutritional value. They are so eager to \"reach the next child\" and increase the numbers of children fed, that they don't pay attention to WHAT is being fed, and whether it is good enough. For context, when I started working here, they reached the 1 million children milestone. Now, about 5 years later, they have just announced 2 million children fed - but the quality of food has not improved."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Divine providence? Wake up MM!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Nov 2021", "job_title": "Anonymous Employee in Glasgow, Scotland", "duration": "N/A", "pros": "- great cause \r\n- good work/life balance \r\n- progression opportunities \r\n- getting to visit the programmes in action was an amazing experience \r\n- great group of people in MMI that are really striving to make a difference to the lives of children around the world.\r\n- reasonable pay in some departments", "cons": "- The religious elements have been creeping in over the past few years and it’s extremely divisive amongst staff as MM markets itself as being open and representative of ‘all faiths and none’. There’s a bit of a strange cult atmosphere, with the bizarre prevelence of religious fundamentalists across teams, and this becomes apparent in the first few weeks as an employee. An example being all staff meetings where leaders ask staff to join them in a catholic prayer and new starts are left mortified or overjoyed. Staff quickly learn about their colleagues’ personal faith due to this incredibly visible forum, which is not very inclusive or professional\r\n- The PDR process that they recently rolled out is the worst I have ever experienced in my career. Unattainable levels to get a pay rise, completely subjective rating, SLT feed into individual grades despite not knowing what individuals are working on (or even who they are!) and there’s a lack of clarity and feedback on grading. This leaves colleagues disgruntled and many leave as a result \r\n- People are scared to give feedback over fears of coming across as ‘negative’ or against the goals of MM, when it’s usually the people who care the most that want to offer up positive changes and are shot down.\r\n- Lots of talented, intelligent and incredibly hardworking staff at officer and middle manager level who do the majority of work while unnecessary heads of and directors (in their droves) sit in meetings all day. Ask yourselves MM, do you really need a head of every single tiny department (some not even managing anyone)? What are they doing all day apart from sitting in meetings? Is this good stewardship of resources?\r\n- There’s a huge amount of money wasted on international travel and training that could happen on Teams. It’s always the same people going on trips and it’s often booked or changed at the last minute and costs thousands of pounds for flights. Quite frankly, it appears that some senior staff are only there for the photo opportunity.\r\n-Nepotism is rife. Its run like a family business and those who are related to the founder are often promoted without the job being advertised. It’s a running joke in the Glasgow office whenever an email comes round to advertise a role, that it has been created for one of the founder’s relatives. Most of SLT and affiliates seem to be in jobs because they’ve been in the right place at the right time or are friends with the CEO and family.\r\n-The culture seriously needs looked at. Office politics are unlike anywhere I’ve ever worked, with infighting amongst teams and money getting lost because of constant battle between MMUK and MMI and their leadership to save their egos and impress the founder.\r\n- High levels of turnover and people ‘getting disappeared’ - where they’re sacked or go on a period of absence before they never return again. There’s a joke between staff that there’s a trap door in one of the meeting rooms! One senior recruit lasted a record of only 3 days!\r\n- The final straw for many staff was the CEO’s weekly emails throughout the covid 19 pandemic - which were (I think) designed to inspire employees but overall had quite the opposite result. He frequently described the charity’s success in keeping afloat down to ‘divine providence’, in a manner that, as a non-catholic, I found truly insulting. The reality? Experienced professionals working long hours from their sofas and dining tables to do everything they could to ensure that those kids wouldn’t go hungry, all while worrying about their own jobs and livelihoods."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Frustrating & disappointing experience, could have been great..", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Jan 2020", "job_title": "Administrative Assistant in Glasgow, Scotland", "duration": "N/A", "pros": "Some lovely people work here, although I don't feel they are often appreciated. \nSeeing video footage from affiliate countries of the feeding programmes in action was amazing.", "cons": "Where do I start..??\nLack of policies and procedures made my job extremely difficult to the point I felt I was almost being expected to swim with my arms tied behind my back. \nTerrible office politics which I didn't expect in a charity which is really pushed as being 'one big global family'.\nRepeatedly told not to share information with other teams, as backstabbing was taking place, this wasn't dealt with in a professional way.\nManagers not getting along filtered down and affected how we could do our jobs, again making things more difficult than they should be.\nSome members of the organisation are clearly in high positions due to donating lots of money, this leads to them treating admin staff like slaves when they get a chance.\nRidiculous amounts of money and resources spent on flying staff around the world for training which could often be carried out via Skype! Is this really the best use of donations?\nUnable to raise concerns without being made to feel that you have a 'bad attitude'."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "International Ambassador", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "19 Aug 2018", "job_title": "International Ambassador in Glasgow, Scotland", "duration": "N/A", "pros": "Beautiful cause which needs to be believed in , if working there. Very motivated and committed staff . Hard working ,friendly. Serious approach to all aspects of work.\r\nValues and Mission statement essential for understanding the heart of the charity and its culture. If respected and accepted , joy at work ..\r\nPersonally saw huge growth and much movement . Constant learning necessary and available .\r\nOpportunity to meet committed people from different countries ,on the fundraising side and the school feeding side.\r\nSalaries smaller for good reasons. No personal enrichment financially , but certainly humanly .\r\nObvious gratitude to donors , nothing taken for granted. \r\nHave been in fundraising countries and school feeding countries. Met employees and volunteers world wide , which confirmed the importance of having the above mentioned values and mission statement in common .\r\nMary's Meals does not pretend to be perfect ,nor solve all problems.\r\n Enjoying contacts and interaction with diverse cultures and mentalities/languages necessary if applying for work at MM. Patience needed on all levels for above mentioned reasons , and this from all sides .", "cons": "No cons. Awareness needed of a Charity living the ongoing movement of growth. Needs emotional stability and maturity. Flexibility."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Wonderful ethos, management lacking", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Jul 2020", "job_title": "Anonymous Employee in Glasgow, Scotland", "duration": "N/A", "pros": "Excellent pension scheme, fair pay, fantastic \"family\" of staff, regular socialising, supportive colleagues, impactful work", "cons": "Inexperienced & ineffective management, nepotism/favouritism, overtly Catholic whilst being \"secular\""}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great to be part of something so good", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jan 2020", "job_title": "Anonymous Employee in Kinning Park, Scotland", "duration": "N/A", "pros": "Great sense of purpose and really enjoy being involved in something bigger than myself. \r\n\r\nThe organisation trusts you to do your job well and there is a real opportunity to create an impact, improvement ideas are listened to and discussed which is really refreshing. \r\n\r\nStaff are really friendly, driven to do a good job and genuinely care about each other.", "cons": "Some of the processes can be a little unclear to new people, more documentation of processes would be great."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Extremely poor management and misguided organisation", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Apr 2018", "job_title": "Anonymous Employee in Glasgow, Scotland", "duration": "N/A", "pros": "Colleagues (at junior level) are nice, social atmosphere", "cons": "- some staff, especially senior staff, are hired and promoted and put into positions that they have little to no qualifications or experience for. Sometimes they create roles for themselves to make themselves more senior and increase their salary. Promotion is particularly easy for white men within the organisation\r\n- nepotism is a serious problem related to the above point, with relatives and friends being hired and promoted for positions they are not qualified for, overlooking the skills and experience of unrelated staff who are qualified for jobs. I saw this happen many times, to the disadvantage of young people, women, and people from ethnic minority backgrounds who had more relevant academic qualifications, and more experience in the sector, compared to those who were hired and promoted who had no relevant qualifications and little to no experience in the sector\r\n- unfair and unclear hiring practises related to these points, with some favoured staff being moved into good roles without these roles being advertised internally or externally to anyone else\r\n- strange and unexplained/covered up quick dismissals of staff, especially HR\r\n- senior staff are on £40-50k +.a year and keep increasing their salaries while keeping junior staff on small salaries\r\n- The organisation treats 'aid' like it's still in the 1960s, giving handouts including backpacks bought in the U.K. And shipped to Africa, with no consideration of the negative implications of this. This is because senior staff do not have experience or qualifications in international development \r\n- they only provide school meals and do not think about the comprehensive needs of the communities they work, because they are focused on making more and more money from the public by trying to do as little as possible for vulnerable families, to make a stronger selling point for the public (ie. number of children fed - which is extremely misleading)\r\n- their 'meals' lack calorie and nutritional value and they are aware of this but do not do anything about it - this is shameful practice and they are misleading the public with their messaging\r\n- they think more about making money and selling their message to the public rather than what will really make a long term difference to the communities they target\r\n- high turnover rate because staff are unhappy\r\n- extremely poor management at senior levels - decisions are made by a few people\r\n- run like a business not a charity\r\n- for some reason do not identify as an 'ngo' and are afraid of the term"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great org and enjoying being here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Apr 2018", "job_title": "Anonymous Employee in Glasgow, Scotland", "duration": "N/A", "pros": "Clear purpose and focus, many very talented and committed staff, good conditions.  Fast growth means work is challenging, which means lots of learning and personal development.", "cons": "Nothing particularly comes to mind"}], []]