[[{"date": "21 Jun 2023", "title": "Event Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rice University", "Interview Descriptions": "This was for the Public Affairs department AND the multicultural center. I learned it was a lot of administrative work. After interviewing I felt overqualified for the position based on my experience with other jobs. They asked some questions that I didn’t feel needed elaboration on such as explaining what calendar coordination is/my familiarity with it. Even after explaining that I’ve done it one of my previous jobs for 10 executives they still wanted me to elaborate more..it was odd to me that they asked how I calendar coordinate. They also asked if I was familiar with graphic designing and website design. not sure why they were pushy with that question because one of the interviewers clarified that they have dedicated team for those things. Asked if I was familiar with Microsoft and Google products, I said yes. They asked me to elaborate. I mentioned Mail merging, cleaning up data in excel. They didn’t seem to understand that.. they asked what mail merging was and what data I’m talking about and where I get it from. Any information that is put into excel is data.. I was also asked about my experience in building relationships with the community. Based on my previous jobs I explained how I build those relationships, etc. but they seemed to downplay a lot of my skills which I didn’t appreciate. One of the panelists also talked a lot so it cut me on time to ask my questions. Also, did not inform me that I didn’t get the job after I sent my thank you email. I personally felt like they wanted someone inexperienced and could maybe have more management over. Not upset that I didn’t get the position because I was planning on saying no. Overall, my interview experience with them was not great. I feel like the panelists kept saying “for the good will” too much as if I didn’t understand what they meant and the mission of the university.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Apr 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Applied during school year. Talked with professor and PhD student about my goals. Answers questions regarding prior research experience. The interview was conversational and friendly. The interview process occurred quickly and I heard back for the position soon afterwards.", "Interview Questions": "What research experience do you have."}, {"date": "2 Jun 2023", "title": "Information Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rice University (Houston, TX) in Apr 2023", "Interview Descriptions": "Really easy and chill out interview, didn't feel as intense as the other corporate formal interview. Introduce yourself and why you interested in cybersecurity. Ask about my technical background and experience with some security tools.", "Interview Questions": "N/A"}, {"date": "27 Feb 2023", "title": "Student Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "There is no interview. You just need to fill the form which was sent by the department via email. If you are qualified, the department assistant will put your name on the final list.", "Interview Questions": "no questions were asked, just apply."}, {"date": "25 Jan 2023", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "It was just a brief phone call, like 15 minutes, and the onboarding process was really easy, too. My coworkers were great, the work was easy, and the scheduling was flexible with my classwork and courses. It pays above the national minimum wage", "Interview Questions": "situational questions about dealing with customers"}, {"date": "11 Nov 2022", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Pretty simple and straightforward. They give you Tour Guide scenarios that you must respond to on the spot. Some of them may be tedious depending on the interviewer but not too shabby", "Interview Questions": "If a student comes up to you and asks you about your political views, what would you do?"}, {"date": "7 Aug 2022", "title": "Purchasing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Very wasy and transparent. As soon as i went in the recwprionist was very friendly and gave me necessary paperwork to fill out prior to interview. The whole process was easy. They have a very good environment", "Interview Questions": "Hello Tell me about yourself "}, {"date": "23 Dec 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rice University in Dec 2021", "Interview Descriptions": "Introduce research background, future research proposal, and personal research interest. Be asked about specific research outcomes from personal statements, CV and publish. Ask if any question about funding or research.", "Interview Questions": "What’s research interest?\r\nAny challenges through research experience?"}, {"date": "29 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "The interview was held virtually. The zoom included 5 interviewers who  each asked their own questions and confirmed if the position would be available with a follow up email. The interview lasted about 40 minutes.", "Interview Questions": "Explain your best and worst experiences while working."}, {"date": "19 Oct 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Self introduction first, and then describe research experience and answer questions . It was only a ten minutes interview, so very short and straight forward. You should also expect to have a opportunity to ask their questions.", "Interview Questions": "Can you talk about your research?"}], [{"date": "16 May 2021", "title": "Information Security Analyst Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "Several behavioral questions and a couple low-level technical questions, such as which languages I programmed in. Pretty casual interview that was no-pressure and straightforward. Asked questions about what I would contribute, experience with cybersecurity, etc.", "Interview Questions": "Q: Which programming languages have you used before?"}, {"date": "3 Nov 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rice University (Houston, TX) in May 2021", "Interview Descriptions": "Then interview was held virtually over zoom. I was in a meeting room with 4 different people who asked separate questions about  my experiences and interests with the program. the interview lasted between thirty minutes and one hour", "Interview Questions": "What was the best and worst experience you've had while working."}, {"date": "15 Oct 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rice University (Houston, TX) in Mar 2021", "Interview Descriptions": "Smooth process and I was very impressed. We had great conversations. It was clear that Rice has a great history and pedigree. The culture from top leadership portrays a citadel where the education received is worth more than the cost. Overall, I enjoy the interview and was proud of my choice.", "Interview Questions": "Why Rice University? Why now?"}, {"date": "23 Feb 2021", "title": "Videographer/Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "The interview process started with a phone interview. The questions most came from my resume and experience. After I passed that phone interview, they asked me to come in for an in person interview. They had a panel of 3 people interviewing me. They focused more on specific skills like ENG/EFP and web streaming experience.", "Interview Questions": "What is your level of experience when it comes to web streaming?"}, {"date": "9 Jan 2021", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rice University", "Interview Descriptions": "Sat down with Marketing Director and Dean of the School, discussed responsibilities and qualifications.  They asked me for a salary requirement. Job responsibilities were not discussed in great detail, but the larger questions of expected longevity and loyalty to the position, hopes for advancement.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "3 Nov 2020", "title": "IT Service Delivery Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Interview was positive and the position was described in detail.  My only disappointment was, I was expecting notification if I was chosen or not, however I did not receive that confirmation.", "Interview Questions": "Give some examples of previous experience."}, {"date": "7 Nov 2020", "title": "Full-time MBA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rice University (Houston, TX) in Jul 2020", "Interview Descriptions": "On campus and phone and Skype. Very professional. Each step of the journey was friendly and informative. Really appreciated the experience of a full day on campus with current students.", "Interview Questions": "Always important to know your WHY and your WHY NOW."}, {"date": "9 Apr 2020", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Admission is based on essays,  resume, transcript; for some departments an interview is required and for others interviews are not required. You also get the chance to visit the university in an accepted students' weekend.", "Interview Questions": "N/A"}, {"date": "28 Jan 2021", "title": "Industry Consultant - Junior Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rice University (San Antonio, TX) in Apr 2020", "Interview Descriptions": "The university conducted a virtual interview by phone.  And a second interview again by phone.  Nothing out of the ordinary although the role description did seem a little less descriptive than what I anticipated.", "Interview Questions": "I honestly don't recall any specific questions. "}, {"date": "5 Mar 2020", "title": "Director of Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Feb 2020", "Interview Descriptions": "Applied online. Had one initial phone interview with the Managing Director. I live out of state so they flew me in for an in-person interview. They told me I would have a group interview with the whole team for one hour. The interview ended up lasting three hours and the interviews were split into three separate groups. They asked some gotcha-type questions. Once interview was completed, they said they'd reach out to me in a couple weeks to inform me of their decision. One month later, I received no response. I emailed them and mentioned that I would be able to move to Houston sooner than expected and wanted to check in on the hiring process for this position. No response. Not only do I feel that this is unprofessional behavior, but it is  quite rude to not follow up or respond to applicants, especially after flying 6 hours there and back to apply. I still haven't received the reimbursement for my travels but I'm expecting the check to come in the mail in the coming days.", "Interview Questions": "Why do you want to work here? How did you find this position?"}], [{"date": "23 Nov 2022", "title": "Graduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rice University (Houston, TX) in Feb 2020", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "Walk me through your resume"}, {"date": "31 Aug 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "I applied from out of state, so I initially had a phone interview. Afterwards, I received a couple different assessments/personality profiles to complete. I was asked to come in for a formal interview. Travel and accommodations were covered. My interviews lasted a majority of the day and I met with about 5 different people from different departments. Overall, a very good experience.", "Interview Questions": "Just typical interview questions. No gotcha-type questions. Everyone was professional. "}, {"date": "18 Dec 2021", "title": "Research Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Sept 2019", "Interview Descriptions": "Was referred to this staff-level, non-tenure track research manager position by a mutual connection of the department head. Had an initial phone screen with the hiring manager then a group interview  followed by a written assignment. Final round was an interview with department head.", "Interview Questions": "Asked to prepare a detailed research proposal."}, {"date": "20 Aug 2019", "title": "Staff Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rice University (Houston, TX) in Jul 2019", "Interview Descriptions": "The in-person interview lasted about 3 hours. Met with the team for a meet and greet, had a more professional interview with a panel of 3 people that asked basic questions, met with the director of the department. That was a more strict, harsh interview. After driving four+ hours to the interview, they didn't pay any type of travel expenses. After waiting 2 weeks after the interview process, I didn't even get an offer. Very long process. Kind of wasted my time, but the people were nice.", "Interview Questions": "Why Rice?"}, {"date": "22 Jun 2019", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rice University (Houston, TX) in Jun 2019", "Interview Descriptions": "Overall process took abt 1.5 month.  After u applied, then initial phone interview with hiring manager, if they like you then you go on to take an assessment test.  If you do well on the test then they invite you on campus for a group interview which last abt 3hrs.  You interviewed with other peers in same dept, other peers different department and hiring manager.  After all that I got the standard rejection.  I thought I did well enough but guess that wasn’t enough.  The last panel interview mainly consist of behavioral questions.", "Interview Questions": "How you prioritize your tasks?\nHow you handle stress."}, {"date": "15 May 2019", "title": "Student Club Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rice University (Houston, TX) in Mar 2019", "Interview Descriptions": "I applied and a week later was contacted for an initial phone screening. The hiring manager said she was going out of the country the following week but expect to have an update upon her return.  Her return has come and gone, I even followed up with an email and still haven't heard anything.", "Interview Questions": "Tell me about yourself? Are you willing to work outside of business hours?"}, {"date": "11 Mar 2019", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rice University (Houston, TX) in Feb 2019", "Interview Descriptions": "The process was straight forward, but did take a substantial amount of time. about 3 months from application to initial interview/response. Did a teleconference for the second interview and an in-person 3rd interview. Interview ranged from high level to more technical based. Overall it wasn't bad, but hiring manager/main interviewer was poor at responding. \r\nI was \"ghosted\" by the department manager though. They never responded to my emails, nor returned any calls after the final interview. \r\nWas only aware I didn't receive the offer because the recruitment portal listed the job as filled.", "Interview Questions": "Typical response to improvement requests"}, {"date": "20 Jan 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Jan 2019", "Interview Descriptions": "No interview was required，the admission committee only reviewed the application materials. After they decided to give me the offer, one professor sent me an unofficial congratulation letter and we had a nice chat", "Interview Questions": "No interview questions were asked. I introduced briefly my past research experience. And the admission committee asked me if I have question about the school."}, {"date": "1 Sept 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rice University (Houston, TX) in Aug 2018", "Interview Descriptions": "it was very unorganized and abrupt, like Rice always is\r\nbut also very friendly and casual - typical Rice experience\r\none thing though, even though the process did went on very casual and smooth, it does not mean that you get the offer", "Interview Questions": "What is your favorite thing about Rice?"}, {"date": "29 May 2019", "title": "Bus Driver II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rice University (Houston, TX) in Aug 2018", "Interview Descriptions": "It was promising and kind of intimidating at the same time. Interview was kind of rushed for the position seeing they quickly needed someone to cover that spot.  Didn't really get an orientation after getting the position tho.", "Interview Questions": "Why do you want to work for rice?"}], [{"date": "30 Apr 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "It was an phone call interview. My research adviser asked about my previous research experience. Couple coding questions and some problems about machine learning. It was an overall positive experience", "Interview Questions": "What's your previous experience"}, {"date": "15 Feb 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Skype screening and then onsite interview with other candidates and professors within the program. Professors will give presentations during onsite interview. Before that some professor will request skype interview to include presentation of previous research experience.", "Interview Questions": "What do you want to do after graduate school"}, {"date": "12 Sept 2017", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rice University", "Interview Descriptions": "Online application with resume and cover letter. Then a phone interview and then in person group interview with the entire office about two weeks later. In person interview was very extensive and can't even remember all of the questions that they asked me.", "Interview Questions": "What is most important in a job, when have you had a disagreement with a coworker and how did you handle it?"}, {"date": "2 Nov 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rice University (Houston, TX) in Sept 2017", "Interview Descriptions": "The Mcnair center of Baker Institute at Rice wants a student to do graphic work for them. In the interview they took a look at my portfolio and asked me how many hours could I work per week. The interview went really well.", "Interview Questions": "how many hours could I work per week"}, {"date": "16 Aug 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "You submit and application online and depending on the department, will be contacted by a faculty member. I had a skype interview with my advisor. I basically described my research I completed during undergrad and asked about what I would be working on in graduate school. I was assigned to the faculty member that interviewed me but some departments offer a rotational program.", "Interview Questions": "What will you contribute to the research group?"}, {"date": "22 Jan 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Rice University", "Interview Descriptions": "Meet with professor and talk about your past research experiences and what their type of research includes and involves. Was very casual and inviting. Also met with other graduate students.", "Interview Questions": "What programming languages do you know?"}, {"date": "28 Jul 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rice University", "Interview Descriptions": "I had a skype interview. It was brief. We talked about my research and some of my technical stuff. It wasn't hard. Just a matter of getting to know each other", "Interview Questions": "Programming languages I know."}, {"date": "18 Jul 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Skype interview ask me whether and when I can come, do not have the Q&A session, the HM is very busy. Was told the salary is not high and he need some time to make a deicision", "Interview Questions": "The rank of your BS insititute"}, {"date": "9 Jan 2020", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Rice University in Jun 2016", "Interview Descriptions": "E mail Application with resume , technical interview through skype, Research discussion with the professors group regarding the PhD research, Research work presentation in group meeting, Job offer\r\n\r\nOverall it was a good experience", "Interview Questions": "Research experience"}, {"date": "13 May 2016", "title": "Office Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "Long interview process. First I had a phone interview, then took a skills test in person, then a panel interview which lasted about 2-3 hours total meeting back to back with different groups. They are also very strict about getting all 3 full references so that adds to the time the process takes. Overall now that I've been working there, I'm surprised they went through all this for the position I'm in. It's a very simple repetitive position that they could really hire a high school student for. I feel like I could do the job with my eyes closed. Not the job for someone with a degree and several years experience.", "Interview Questions": "Mostly asked general questions about me personally and why I was interested in working there. Also some basic questions about what I did at previous jobs. Despite the long process the interview, the questions aren't structured at all."}], [{"date": "17 Jul 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rice University (Houston, TX) in May 2016", "Interview Descriptions": "I applied to be a Program Coordinator last year. I first had a phone screening which went very well and was invited to an in person interview the following week. I thought it went very well and everyone in the panel seemed very welcoming to me. However, I was not selected and to be honest, I think it was very rude and inconsiderate of how I was told I would be kept up to date about my status only to log in 3 weeks later  and find out I was not selected via the job portal system. I really think it was due to my racial background that I was not selected because no one in that department looked like me. I have 5 years work experience in an educational setting with a 1 year background working at a University, only  to be told someone with more experience in that particular department was more qualified was very appalling since this job demanded no experience.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Apr 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rice University", "Interview Descriptions": "Sat in front of a panel of about 8 department members. They asked a lot of questions, mostly repetitive. All questions were related o the job, but vague. Job was a bit more glorified in the interview than what it actually is...", "Interview Questions": "How would I handle multiple members asking for tasks done ASAP?"}, {"date": "5 Jan 2020", "title": "Videographer/Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rice University (Houston, TX) in Apr 2016", "Interview Descriptions": "Very easy interview process because it was through a university referral and through emailing and then a 1 on 1 interview in person about a week later. Interview was with future supervisor that asked about experience and skills.", "Interview Questions": "Experience, skills"}, {"date": "28 Mar 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rice University", "Interview Descriptions": "My potential advisor gave me a phone interview. She asked me some questions related to my research experience in my old university. She also asked me to tell her about what I did in the project, what role did I play, what results did I get. She also told me about the department.", "Interview Questions": "What role did you play in the Project XXX?"}, {"date": "24 Mar 2016", "title": "Maintenance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "To get the job at Rice university I went through a staffing agency.  The recruiter from the staffing agency called me and had advised me that my skill set matched the qualifications for the job at Rice University.", "Interview Questions": "N/A"}, {"date": "31 Oct 2016", "title": "Postdoctoral Fellow Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rice University in Jan 2016", "Interview Descriptions": "Very little structure to the interview, not much information provided without having to drag it out with multiple questions, overall seemed disorganized. Didn't get really get a feel for the culture of the group or a good sense of how they work together despite asking many questions on the subject", "Interview Questions": "Why are you interested in this role?"}, {"date": "24 Oct 2016", "title": "Graduate Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Rice University (Houston, TX) in Nov 2015", "Interview Descriptions": "This is your chance to show how much you know about this school, and how well you fit. A detailed and thoughtful response demonstrates you cared enough to research the department of your choice in advance. If you’re super stoked on the school, by all means, express it, but stop short of sucking up. And if you’re not that stoked on the school, but it’s your only option for financial or convenience reasons, you better think of a reason to get excited about it – fast.", "Interview Questions": "Techical"}, {"date": "26 Sept 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Oct 2015", "Interview Descriptions": "I was first contacted via phone where management described the position and responsibilities of the marketing intern and if I was interested. A couple of weeks later, I came into the office and for a face to face interview. The atmosphere was conversational, very comfortable. We went over my resume and what I was looking for and I was asked basic behavioral interview questions. Not intimidating at all.", "Interview Questions": "Why should I hire you?"}, {"date": "14 Aug 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rice University", "Interview Descriptions": "phone interview with the PI of interest, technical questions. Be prepared to answer questions about your phd research in detail. They may be couple behavioral questions and future career plans questions", "Interview Questions": "usual technical questions about research expertise"}, {"date": "16 Sept 2015", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Aug 2015", "Interview Descriptions": "Intensive interview process that included four rounds over a period of 4 weeks: \r\n(1) Initial Phone Screening\r\n(2) Casual Meeting with Team Members\r\n(3) Formal In-person Panel Interview  (lasting 3 hours, met with a total of 9 people)\r\n(4) Phone Interview with Executive Member\r\n\r\nThis was one of the most intensive interviews of my life. It seemed that I was interviewing for a C-level position (I was not). I was disappointed not to receive an offer, as I was under the impression that I was the first choice. The position was offered to someone whose education was slightly more in line with the role. I would have preferred to spend a little less time in the interview process, but I also learned quite a bit during each round.", "Interview Questions": "What is your preferred management style? "}], [{"date": "14 Aug 2015", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Rice University (Houston, TX) in May 2015", "Interview Descriptions": "Brief telephonic interview followed by on-site presentation in front of the department faculty. This was followed by one on one interview with mentor/supervisor. General questions as to research interests, teaching plans, etc", "Interview Questions": "Future areas of research and plans"}, {"date": "3 Jun 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Mar 2015", "Interview Descriptions": "behavioral and lasted a few hours with lunch. you then met with several groups of people and then did lunch with the main team after doing a short presentation. Be prepared to met a lot of people and prepare a short presentation a head of time.", "Interview Questions": "tell me about yourself"}, {"date": "9 Jun 2016", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rice University (Houston, TX) in Mar 2015", "Interview Descriptions": "I received a call from the departments HR, did a phone interview, did an assessment (proofreading, excel, mail merge), interview with group staff, then interviewed with the executive  director.", "Interview Questions": "Why do you want to work here? Why Rice?"}, {"date": "15 Jan 2015", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rice University", "Interview Descriptions": "The talk went well.  the communication was quite friendly. the campus is beautiful. office people is nice. everything went very well, nothing went wrong. meet with students, faculties. Have lunch and dinner together.", "Interview Questions": "not difficult"}, {"date": "18 Nov 2014", "title": "Recruiter Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University", "Interview Descriptions": "Called by their HR dept for a phone interview. Phone interview lasted less than 10 mins. All the questions were negative and no amount of practice could of prepared you for this interview. At one point, I heard the interviewer sigh with disapproval when she asked me about the salary (keep in mind the application asked for my salary expectations so I don't understand why it was such a surprise to her). After the interview was done, was told I would hear about the next steps.", "Interview Questions": "This is exactly the order of negative questions I was asked: 1. Why are you leaving your current employer? 2. Salary expectations 3. Your weakness (never asked about my strengths) 4. Name one thing you don't like about your job and etc......."}, {"date": "26 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Oct 2014", "Interview Descriptions": "I went through a total of 3 months's rotation program. I stayed at 3 different labs during the time. The professor or owner of different labs talked with me and asked me my interest/expectations for academia.", "Interview Questions": "What's your background?"}, {"date": "23 Aug 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rice University (Houston, TX) in Aug 2014", "Interview Descriptions": "Met with grad student heading project. She asked about my past experience in research and was extremely friendly. She asked about my aspirations and how this position could help me attain that.", "Interview Questions": "What is your interest in our specific research?"}, {"date": "1 Jun 2014", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "I had no interview process since I applied for my PhD program online.The online fee was around $100 if my memory is correct. Staff in the department was pretty helpful and friendly to answer all my questions before I attended to Rice. GRE requirement is not quite high for perspective students in Engineering School.", "Interview Questions": "If the professor's funding is cut, you probably need to find your own financial support. There is no guarantee that you can always receive the financial support until you graduate from the department or your advisor. This situation might make your life more stressful."}, {"date": "24 Apr 2014", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "I submitted an application and then went in for a single interview. I interviewed with the entire administrative staff first (roughly 12 people) and then with the directors. I then received a call about a week later and was offered the position.", "Interview Questions": "Every question was a standard interview question, i.e. \"how do you handle stress?\"."}, {"date": "1 Apr 2014", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Very smooth process, gave great direction and set clear expectations", "Interview Questions": "What is your greatest weakness"}], [{"date": "1 Apr 2014", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Rice University", "Interview Descriptions": "Very straightforward. \r\nA few technical questions to access skill and a few behavioral questions. Job offer was prompt.", "Interview Questions": "A few questions about networks and equipment"}, {"date": "8 Mar 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "The recruiting/hiring process followed the pretty standard iter of academic jobs, at least in science department.  No surprises.  Being one of the smaller top-tier universities, and being in the Houston, the experience was somewhat less formal than in other places.  The department is smaller than elsewhere, which makes the interview visit less hectic.\r\nOnce the interview were over the offer, second visit, and negotiation parts were quite smooth and uneventful, and moving in a timely fashion.", "Interview Questions": "We are talking about faculty hires, so most of the interview revolves around research (match, promise, etc...).  It's hard to mention any specific example because the hardest questions tend to be about fairly candidate-specific points.\r\nOverall in faculty hires there is the concern with the likelihood that the candidate will develop a robust (and well funded) research program, attract students, cultivate collaboration opportunities. "}, {"date": "13 May 2014", "title": "Summer Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Mar 2014", "Interview Descriptions": "You begin by turning in an application, then you should respond to emails regarding the interview. After setting it up, you should go to the interview, and then wait for an offer.", "Interview Questions": "Describe a time you dealt with frustrating circumstances."}, {"date": "18 Feb 2014", "title": "Tour Guide Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "Turn in application. Everyone accepted for the next round interviews on the same day, 4 days later, in 15 minute intervals. Learned whether you are accepted by the next week after the interview.", "Interview Questions": "If your group contains students from every division, how do you fit all of their department building locations on the same tour."}, {"date": "17 Dec 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "you have the chance to work as a T A when you are a PhD at Rice. you work in the department in which you are a student. There is a process that you get a chance to select which course you want to TA. It's basically an evaluation form which includes instructor and requirement.", "Interview Questions": "Grading and teaching."}, {"date": "19 Nov 2013", "title": "Payroll Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "The Hiring process was fairly simple, a lot of personality questions.\r\n\r\nAfter applying I received a phone interview from hiring managers and then two weeks later a second interview was requested.  I was in NYC so they arranged a skype interview for me.\r\n\r\nThe second interview they asked about my job qualifications etc. Very easy overall.", "Interview Questions": "The most difficult question was \"How do i deal with office politics\""}, {"date": "17 Oct 2013", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "I had a phone interview with them and they promised to let me know the outcome. Unfortunately no one contacted me to at least inform that they are not interested in the second interview. It is a courtesy and I was expecting a better interview experience at Rice.", "Interview Questions": "N/A"}, {"date": "11 Oct 2013", "title": "Help Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "Sit down interview with the IT Director and other staff in the IT department.  Basic question and answer session asking about your reaction in various potential scenarios, previous work, etc.", "Interview Questions": "There were really no unexpected questions."}, {"date": "9 Jul 2014", "title": "Summer Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rice University in May 2013", "Interview Descriptions": "Emailed my resume to the department coordinator, agreed to meeting a few days later to discuss the position and responsibilities. Everyone was very nice and they gave me an offer on the spot.", "Interview Questions": "Nothing unexpected"}, {"date": "21 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rice University", "Interview Descriptions": "sent email to professor-->he replied and said he need student-->apply phd through department-->ask for visit--> got invitation of visit-->interview, meet people--> back, get offer", "Interview Questions": "no, enjoyed talking and lunch"}], [{"date": "29 Jul 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Rice University in Apr 2013", "Interview Descriptions": "A professor called me on my landline. She first introduced herself, then talked about Rice and then her own research. After a nice introduction, she asked me several questions on my bachelor studies and the research I had done so far. From her questions, I understood that she was trying to make sure that I had a clear conception on my research objectives. Later she explained what should I expect during a Ph.D. program at Rice University. The interviewer was nice and thorough.", "Interview Questions": "Basic questions on semiconductor physics (since I applied for ECE dept - Nano). \r\nSome concepts on nanophotonics (that was my intended research area). \r\nDetails about my 4th year project and my publications. Asked technical questions during my explanations.\r\nFuture plan and goals.\r\nWhy I chose Rice University?"}, {"date": "13 Mar 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "after submitting all the applciation materials in december, heard the decision in march", "Interview Questions": "no questions were asked "}, {"date": "11 Mar 2013", "title": "Sociology PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rice University (Houston, TX)", "Interview Descriptions": "The interview process was very exciting and very enticing. I was extremely pumped up about going to Rice and being a successful PhD student. Unfortunately, there is a bait and switch mentality where they do a lot of work to recruit good students, but in reality, the program is very different from what they say during recruitment. The Sociology program is a mess. If you are a decent student and you have other options for graduate education--take one of those instead. The program is entirely mismanaged, professors frequently leave the country for 6-12 months at a time, and the opportunities to be successful are very different from what they advertise during the February recruitment period. If you are a local Houstonian, and you feel like you can spend about 8+ years dealing with a problematic program, then this place is for you. They mention on their website that it is a five year degree program, but this is entirely inaccurate. They won't let you follow their advertised program of study. RUN.", "Interview Questions": "The interview phase itself was not difficult. The program itself is, and not in the sense of academically challenging, I mean it in the sense that it is just an awful place with little opportunity. "}, {"date": "28 Oct 2017", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rice University (Houston, TX) in Feb 2013", "Interview Descriptions": "I just visited the university in an open interview but I was already offered admission by that time. They asked about other universities that had offered me admission. They were evaluating to see whom to give extra fellowship to entice to come.", "Interview Questions": "They asked about other universities that had offered me admission"}, {"date": "10 Oct 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rice University (New York, NY) in Mar 2012", "Interview Descriptions": "You just follow the instruction given on the website and prepare all documents needed.\r\nThey may ask for a phone interview. But it's not required. If they think you're qualified. They'll give the offer.", "Interview Questions": "What's your past research experience?"}, {"date": "23 Dec 2016", "title": "Researcher, TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rice University (Houston, TX) in Mar 2012", "Interview Descriptions": "Interview for the science PhD program was over Skype. It was relatively easy. I was asked to describe the courses I took and what I studied. Most students had to travel to Houston for the series of 1:1 interview over 2-3 days. I was allowed to do so remotely, which was a nice but infrequent gesture. Rice faculty is very selective in their students and prefer to meet them in person before giving the final offer.", "Interview Questions": "I was asked to describe the courses I took and what I studied. "}, {"date": "9 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rice University (Houston, TX) in Mar 2012", "Interview Descriptions": "Initial emails were sent, followed by phone conversation.  The next round was a Skype interview.  After a week, I got the acceptance letter.  It was all very straight forward and very professional.", "Interview Questions": "What is one strength and weakness of your research question, and how can we assist you?"}, {"date": "28 Oct 2013", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Nov 2011", "Interview Descriptions": "E-mailed the professor I wanted to work with.  Scheduled an interview which consisted of a 1-hour presentation with lots of questions and a 1-on-1 talk with the professor.  Met a few of the lab members.", "Interview Questions": "What do you want to research in my lab?"}, {"date": "20 Sept 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 months. I interviewed at Rice University (Houston, TX) in Aug 2011", "Interview Descriptions": "scheduling an appointment with  PI (Principle Investigator) and having a meeting in his or her office. For some departments the PIs will assign a qualification project to test the abilities of students on problem solving, taking challenges and presentation skills.", "Interview Questions": "The questions are about the students interest in research groups. Such as any specific projects they are interested into and what abilities they have which is making the interested."}, {"date": "11 Oct 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Jun 2011", "Interview Descriptions": "You get peer reviewed in the team you will end up working with. Questions usually come up regarding past experience and whatever is put on the resume. There were three interviews. Two were technical and the third was basic personality assessment type questions.", "Interview Questions": "How would you resolve differences with your teammate?"}], [{"date": "18 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rice University (Houston, TX) in May 2011", "Interview Descriptions": "It was pretty straightforward. Interview is sort of strong.  They mainly told you about different labs to see if any were a good fit for you.  If they were not, then they just talked about other things.  Actually, if you're invited for interview weekend it's just a recruitment.  They are a little heavy on alcohol during recruitment, which could be a plus or minus depending on your likes.", "Interview Questions": "What attracted you to Rice University"}, {"date": "31 Jan 2014", "title": "Assistant Athletic Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Rice University (Houston, TX) in Mar 2011", "Interview Descriptions": "Had a full days itinerary of meeting with various department personnel", "Interview Questions": "N/A"}, {"date": "16 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rice University (Houston, TX) in Feb 2011", "Interview Descriptions": "Basically talk to prof. Mentioned my previous experience, research interest, and courses I have taken. I read the prof's papers, though din't understand most of them. But this familiarity is definately helpful during the interview. It was a quite smooth talk and there aren't lot of unexpected questions.", "Interview Questions": "Just some basic CS questions and my work availability"}, {"date": "14 Jun 2012", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rice University (Houston, TX) in Jan 2011", "Interview Descriptions": "Please be sure to come prepared to pay for parking as not everyone validates your parking.  The interview process was fairly quick.  I had two interviews which lasted less than 15 minutes but had to pay for parking for both of them.  My resume spoke for itself so it was fairly simple.", "Interview Questions": "Where do you see yourself in the future?"}, {"date": "21 Jul 2014", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Aug 2010", "Interview Descriptions": "Interview process was smooth. It includes meeting with lab members, supervisor, discussing the proposed project that you work on etc. We had a lunch with lab members and dinner. I presented my past research. Then I needed to wait couple more weeks to hear from the faculty who interviewed me. I negotiated the salary but it was fixed and nothing has changed from the initial offer.", "Interview Questions": "why you want to stay in academia?"}, {"date": "13 May 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rice University (Houston, TX) in Apr 2010", "Interview Descriptions": "Very brief phone interview. Just talked about my background.", "Interview Questions": "what is your background"}, {"date": "22 Jun 2010", "title": "Engineering Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rice University (Houston, TX) in Mar 2010", "Interview Descriptions": "Asked me some simple puzzles. Could answer them. Then went on to ask about C, C++ programming. Asked some behavorial questions about dealing with people and conflicting situations. Was able to answer well. Finally there were questions about the alary compensation expected and about relocation , if required. Also asked if travel was not an issue.", "Interview Questions": "What salary do you expect??"}, {"date": "6 Jun 2011", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Rice University (Houston, TX) in Nov 2009", "Interview Descriptions": "There was alot of time in between the phone interview, the face-to-face and offer.", "Interview Questions": "Describe your QA/QC experience."}, {"date": "23 Oct 2012", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Rice University (Houston, TX) in May 2008", "Interview Descriptions": "It all goes through HR", "Interview Questions": "N/A"}, {"date": "7 Feb 2010", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Rice University (Houston, TX) in Apr 2008", "Interview Descriptions": "I was interviewed by an assistant professor. The whole talk lasted about 40 minutes. She asked me what types of project I worked on and my research interests. I had a paper at that time and she asked me about some details and the results. The overall difficulty was average.", "Interview Questions": "Why should I choose you? Give me some reasons and your advantages."}]]