[[{"date": "7 Jun 2023", "title": "Volunteer Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PDSA", "Interview Descriptions": "Easy, and very laid back. Mainly done as a formality rather than assessing your answers. I suppose they just want to see if you are committed to a time and actually show up, and see if you are an easy person to talk to. Just be relaxed and be you.", "Interview Questions": "Why do you want to work here?"}, {"date": "25 Jan 2023", "title": "Animal Care Auxiliary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PDSA (Glasgow, Scotland)", "Interview Descriptions": "laid back, wanted to know my experience and if I'm okay doing nightshift, and if I'm comfortable taking animal related calls. I was then given a tour of the place and told id hear back within the week", "Interview Questions": "Are you comfortable taking calls from a distressed owner"}, {"date": "24 Mar 2023", "title": "Veterinary Care Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PDSA (Swansea, Wales) in Oct 2022", "Interview Descriptions": "I applied on the PDSA website and the short time later I was emailed by the practice manager to attend an interview which I subsequently attended I travelled 400 miles to Swansea for this interview and invested a considerable amount of time and had to book a hotel to be able to attend this interview. On the morning of the interview I met the head nurse and we had a one-on-one interview and the first question that she asked me if I was local had I travelled far and then this took me back and it showed me that she had not reviewed my details and did not have the due diligence to check key information about candidates such as location. She then asked me a variety of common interview questions about my experiences and then the interview was concluded. I received a email about a week later to say that I hadn’t got the job because of practical experience, even though I had a years worth of work experience in a veterinary practice where I did all basic practical tasks and outside of this. I also had experience in several other different animal settings, where I did all aspects of practical, animal, husbandry and care. The only part of the job role that I did not have experience with was receptionist experience and experience of animal anaesthesia. I was very surprised when she asked me if I had animal anaesthesia experience, as this really should not be a responsibility of a veterinary care assistant, and the extent to which the veterinary care assistant role has come to have such a broad scope of responsibilities, breaching into clinical duties, where they really should not be doing them, and it should be the responsibility of a veterinary surgeon, and a veterinary nurse highlighted to me what appears to be a declining level of standards in the veterinary industry. In my application, I mentioned nothing about having experience of animal anaesthesia, monitoring or receptionist experience, so it shows to me that they had not properly reviewed my CV in relation to what they supposedly wanted, and showed no real respect for what I had invested in the interview process up until that point.", "Interview Questions": "Tell me about your experiences"}, {"date": "22 Dec 2022", "title": "VCA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PDSA (Brighton, England) in Dec 2021", "Interview Descriptions": "This was an all day interview, team building activities and 1:1 interview questions followed with a tour around the hospital. I was able to listen to obs with an animal under anesthesia Very friendly atmosphere. Started at 10 finished at 4.", "Interview Questions": "When did you challenge yourself at work"}, {"date": "9 Mar 2022", "title": "Senior Press Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PDSA (London, England) in Apr 2021", "Interview Descriptions": "1 hour interview via Zoom with a task that needed to be completed. Interview with the manager and press officer. Asked about my experience and what I could bring to the team. \r\n\r\nThe team does not value diversity, no ethnic minorities in the whole of the company. I think racism plays a part here .\r\n\r\nI also didn’t get any feedback, the team should have the decency to least provide that. During the interview a very sarky comment was made ‘ Do you even own a pet’ which was not needed. \r\n\r\nI didn’t get the job because I don’t have blonde hair, I was clearly more than qualified. Also, they continued to ask me how I gained coverage, I can only assume they wanted my tips and ideas because they couldn’t get this type of coverage themselves. E.g TV Coverage .\r\n\r\nDidn’t get the job because they didn’t feel like I would fit into the team, feedback should be offered . I also hope in the future they invest more in diversity and inclusion.\r\n\r\nAlso the pay for this type of role is very low.", "Interview Questions": "Why do you want to join the team?\r\nWhat media contacts do you have ?\r\nHow would you deal with working in a fast-paced organisation. "}, {"date": "24 Apr 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PDSA (Barking, London, England) in Apr 2021", "Interview Descriptions": "Had only two phonecalls, neither with the actual store manager. First interview took 10 minutes and never actually asked me questions related to my capabilities to the role. Second interview took literally 3 minutes and I was offered the role. Quite underwhelming", "Interview Questions": "How old are you?  (odd question as I didnt think this was a tinder date) \r\n"}, {"date": "26 Dec 2020", "title": "Online Product Lister Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at PDSA", "Interview Descriptions": "Two interview part , one interview showing you can appropriately list items and second interview with questions with hiring manager and head of retail. Overall not challenging as long as you know how to describe items you’ve not seen before", "Interview Questions": "How would you describe this item "}, {"date": "28 Oct 2020", "title": "HR BP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at PDSA in Sept 2020", "Interview Descriptions": "Informal telephone discussion with the recruiting manager to share information about the role and  although not progressed I was impressed that the recruiting manager phoned rather than emailed to  advise me and explain why.", "Interview Questions": "How do you partner with stakeholders"}, {"date": "12 Aug 2020", "title": "Assistant Store Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at PDSA", "Interview Descriptions": "I had a telephone interview and then a face-to-face interview with the store manager and area manager in which I gave a presentation on a SWOT analysis that I prepared followed by a competency-based interview.", "Interview Questions": "How would you increase donations to the shop?"}, {"date": "9 Aug 2020", "title": "Veterinary Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PDSA", "Interview Descriptions": "Tour around the hospital. Competency questions asked about experience and given some scenario based questions\r\nFairly informal and got to meet different team members. Opportunity to ask questions and get a feel for how the company works", "Interview Questions": "Why do you want to work for pdsa "}], [{"date": "30 Oct 2019", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PDSA", "Interview Descriptions": "Interviewed by manager, relatively casual and a comfortable environment, Nothing that was particularly demanding or challenging in regards to what you bring to the table, they were just looking for a position to be filled quickly.", "Interview Questions": "What are your biggest weaknesses"}, {"date": "24 Mar 2019", "title": "Nursing Team Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PDSA (Bournemouth, England) in Mar 2019", "Interview Descriptions": "Easy to apply online through a recruitment agency. Uploaded my CV, was asked to supply 2 references out of the PDSA, filled in details as to why I'm applying etc.\nGot asked to come for an interview 2 weeks later. Wasn't asked to supply or bring anything.\n3 parts to the interview...\nFirst part was questions on why I want the job. Clinical scenarios with medical knowledge being needed. Remembering scenarios where I've helped people or clients etc.\nSecond part was to write a report with conclusion within a set time period of an hour about me taking on a nursing team leader role in a broken practice with lots of issues and how I'd introduce a new type of consult clinic for wellbeing.\nThe third part was a one to one session with an employee who I was giving a job role to that should last no longer than 20mins. I had 20 mins to prepare for this as well.", "Interview Questions": "Why are you looking to get this role?"}, {"date": "3 Oct 2018", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at PDSA (Glasgow, Scotland) in Sept 2018", "Interview Descriptions": "I applied online and then received an email a few days later with a date for a telephone interview which I confirmed.  At phone interview I was asked to tell them about myself and go over my CV before they went on to ask me questions and tell me more about the position and the hours.", "Interview Questions": "What do you consider good customer service be?"}, {"date": "18 Aug 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at PDSA", "Interview Descriptions": "A job interview typically precedes the hiring decision. The interview is usually preceded by the evaluation of submitted résumés from interested candidates, possibly by examining job applications or reading many resumes. Next, after this screening, a small number of candidates for interviews is selected.", "Interview Questions": "How long will you be here for?"}, {"date": "16 Oct 2017", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PDSA (Romford, England) in Oct 2017", "Interview Descriptions": "Received email from HR dept, telephone interview was offered. Had interview felt it went really well.  Said they would contact me Friday with a decision if was through to the Next interview. Monday came and went didn't hear anything, Tuesday afternoon for an email saying thanks but no thanks.", "Interview Questions": "What skills can I bring to the company ?"}, {"date": "3 Oct 2016", "title": "Volunteer Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PDSA in Oct 2016", "Interview Descriptions": "Applied online through PDSA website, got back to me 2 weeks after. The most laid back interview I've had and got the job then and there!! Interviewed on the Monday and went for my first day on the Saturday!!", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Jun 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at PDSA (Telford, England)", "Interview Descriptions": "Applied. First interview to get to know you and explain the role and the organisation. Provided with information about the organisation. 121 with hiring manager.\r\nSecond interview with presentation and tests. Hiring manager plus member of team - no HR.\r\nI also had to complete a personality questionnaire that was never reviewed (I found this out when I accepted the job and found an organisation completely different to the one described at interview", "Interview Questions": "What I'd implement in my first 6 months"}, {"date": "14 Oct 2016", "title": "Retail Area Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PDSA (Telford, England) in May 2016", "Interview Descriptions": "Once again, on a pattern of re-advertising this position which I would suggest not to apply wasting your time, energy and money going for this position has no job there. \r\n\r\nI personal think they are looking for ideas on the cheap and have no idea how to run a retail business, getting excited of producing a 1.5% profit is shameful !!!! to say that most goods they sell are donated. They live in a fantasy world of we are great, but in reality are self indulgent", "Interview Questions": "Presentation of PDSA"}, {"date": "16 May 2016", "title": "Area Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at PDSA (Telford, England) in Apr 2016", "Interview Descriptions": "Online application then telephone interview then assessment day then further interview, the PDSA have been advertising for an Area Manager for the East Midlands since Autumn 2015 It's now May 2016 I can't believe they haven't found a suitable candidate \"who on earth are they looking for\" the head of retail recently left the 'charity' without even having a job in place to go to, the retail operations manager left too as did the CFO and most of his team, shop managers and their assistants have been leaving the 'set up' in droves too this clearly is a company in crisis. DO NOT WASTE YOUR TIME APPLYING FOR A VACANCY AT THIS ORGANISATION!!! they are clearly using the application process to brainstorm ideas from hopeful candidates, there's nothing charitable about this so called charity.", "Interview Questions": "How would I change my communication style to fit the customer/employee"}, {"date": "13 Oct 2017", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at PDSA (Newcastle upon Tyne, England) in Jan 2016", "Interview Descriptions": "applied on monday interview wednesday job offer thursday applied online on monday short form to fill out and few scenario questions took about 10 minutes to do got reply next day to go for interview on the wednesday", "Interview Questions": "why pdsa"}], [{"date": "22 Jan 2016", "title": "Apprentice Animal Care Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at PDSA (Liverpool, England) in Jan 2015", "Interview Descriptions": "I was interview by two members of staff, I was asked \"the usual\" interview questions as well as given many detail about the job. Interview was a lot quicker than I was expecting, didn't really get a chance to say everything I wanted. Everything felt a bit rushed however the interviewers were lovely and friendly. We ended with a quick tour of the hospital and more information.", "Interview Questions": "What do you know about the company?"}, {"date": "6 Feb 2015", "title": "Client Services Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PDSA (London, England) in Feb 2014", "Interview Descriptions": "After an annoying box filling exercise answering questions loosely related to the role; there was a subsequent assessment day. There was no opportunity to ask questions about the organisation owing to the assessment day setting where there was no one on one time to have a quality conversation about the role.", "Interview Questions": "Leading questions such as Tell me about a time that..."}, {"date": "25 Oct 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at PDSA (Christchurch, England) in Jan 2014", "Interview Descriptions": "very short and only one question didn't really have to say much to be honest, just had to bring in my CV in and they said when do you want to start. A week later I had the job and was working in the shop, they were very laid back about times you couldn't attend volunteering and after 6 months they just let me leave whenever I wanted.", "Interview Questions": "Why PDSA?"}, {"date": "29 Mar 2017", "title": "Veterinary Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at PDSA (Antrim, Northern Ireland) in Jul 2013", "Interview Descriptions": "After my initial job application by post I attended an aptitude test with a group of other applicants followed by an individual interview with 3 memebers of management. Upon completion I was contacted by telephone and offered the job.", "Interview Questions": "N/A"}, {"date": "27 Oct 2015", "title": "Volunteer Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at PDSA (Mexborough, England) in Jun 2012", "Interview Descriptions": "Very easy only asked a few questions and told me about what it would be like volunteering for them. Was shown around the shop and stock room so I could see where everything is kept. Went through fire regulations and health and safety.", "Interview Questions": "Why do you want to volunteer for the PDSA?"}, {"date": "20 Sept 2011", "title": "Web Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PDSA (Telford, England) in May 2009", "Interview Descriptions": "All positive, good location, good process, friendly staff.", "Interview Questions": "Solve PHP problem X."}]]