[[{"date": "16 May 2023", "title": "Business Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action for Children (UK) (Cardiff, Wales)", "Interview Descriptions": "Interview consisted of two small written tasks followed by an interview panel of two managers. Tasks were on a time limit. Managers asked a series of questions and scored the questions against success.", "Interview Questions": "How would you ensure equality and diversion in the workplace?"}, {"date": "3 May 2023", "title": "Campaign Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action for Children (UK) (London, England)", "Interview Descriptions": "It was overall easy and straightforward. Got a campaign email task before the interview and then had a positive interview experience where I was asked competency based questions demonstrating skills like teamwork, organisation, time management, communications", "Interview Questions": "A time when you successfully run a project from start to finish?"}, {"date": "10 Feb 2023", "title": "Digital Content Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Action for Children (UK)", "Interview Descriptions": "Quite a standard structured interview conducted by two panellists. The interviewers listened intently and were interested. I felt like the experience was good. It went so well I was expecting to be taken to next stage but clearly was not what they needed.", "Interview Questions": "N/A"}, {"date": "27 Jan 2023", "title": "Play Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Action for Children (UK) (Warrington, North West England, England) in Oct 2022", "Interview Descriptions": "application form with personal statement activity demonstration and lesson plan for young children. interview with 2 staff background, linked to EYFS curriculum, previous experience, what you could bring to the job", "Interview Questions": "how would you cope with the environment development difficulties for children safeguarding considerations"}, {"date": "18 Jan 2022", "title": "Senior Brand Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Action for Children (UK)", "Interview Descriptions": "Application process asked for CV and cover letter, answering specified questions. One hour task at 8am before speaking with anyone from the charity. A one hour interview with panel of 2 over video call.", "Interview Questions": "Tell us about a time you developed a brand, the process you went through, what stakeholders you liaised with and tell us about a particularly difficult stakeholder in the process"}, {"date": "25 Apr 2023", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Action for Children (UK) (Watford, East of England, England) in Jan 2022", "Interview Descriptions": "It was a Teams call with Two interviewers, took around 45 minutes. There was Only 1 interview in the process. The role was Offered to me immediately after the call. There was no paperwork or forms to complete", "Interview Questions": "About inclusivity Systems used Data migration"}, {"date": "15 Dec 2021", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Action for Children (UK)", "Interview Descriptions": "Interview was fine but very informal \nFelt slightly rushed and there where a few technical problems \nStaff who contacted before the interview were very friendly and informative.\nProcess for applying was very easy.", "Interview Questions": "Askee about experience, personal qualities  and current role."}, {"date": "7 Jun 2021", "title": "Digital Asset Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Action for Children (UK) (London, England) in May 2021", "Interview Descriptions": "I found the post on Glassdoor and LinkedIn and applied directly on the charity website.\r\n\r\nThe process was smooth, I was contacted by the recruiter Anne-Marie. She was very lovely and responsive.\r\n\r\nLater on I had a Teams interview with the team and I cannot stress more everybody I have met so far had been very friendly and welcoming. \r\n\r\nThey were very clear when to expect to hear back and they delivered. Feedback was also offered for those who'd like them.", "Interview Questions": "Why do you want to work at the charity?"}, {"date": "29 May 2022", "title": "Youth Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Action for Children (UK) in Aug 2018", "Interview Descriptions": "Panel was understanding of nerves and were patient. The interview itself was thorough and covered multiple aspects of what the role would be. Overall, it was a positive experience and I was told of the outcome only hours later.", "Interview Questions": "What is a challenge you've experienced and how did you overcome it?"}, {"date": "11 Nov 2016", "title": "Children's Service Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Action for Children (UK) (Barrow, England) in Nov 2016", "Interview Descriptions": "Group interview- observed whilst interacting with others in a group activity task which was relatively easy. However, trying to communicate and voice my opinions was not easy as people tried to get a word in. Just be confident and be lengthy with your opinions. Although I feel group interviews are not a fair way of assessing someone.", "Interview Questions": "Group task- showed a poster asked to explain potential reasons as to why certain families were not accessing the service."}], [{"date": "5 Oct 2018", "title": "HR Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Action for Children (UK) (Watford, East of England, England) in Jun 2015", "Interview Descriptions": "Typical process, although had Skype interview initially to discuss the role with the Senior Partner, which was helpful to align my requirements with what they were looking for in the role and provided an opportunity to ask more about the organisation.", "Interview Questions": "Why you want to work for Action for Children "}]]