[[{"date": "3 Jan 2023", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Health University Medical Center", "Interview Descriptions": "This was a virtual interview that lasted minimum 30 mins and consisted of 2-3 parts of phone calls from a the nurse manager or director. I interviewed with two mangers of a specific unit and was asked various questions.", "Interview Questions": "Tell me about yourself was a question and why you choose a particular unit. Also was asked about teamwork and what I do for self care. One question ask how I handled a difficult patient or family member in the past."}, {"date": "9 Jun 2022", "title": "Sonographer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center (Savannah, GA) in May 2022", "Interview Descriptions": "Manager who interviewed me was very sweet. The interview did not take long maybe 30 minutes. They didn't require a scanning interview and all the questions were basic interview questions.", "Interview Questions": "Would you rather work on one project at a time or multiple at once?"}, {"date": "22 Apr 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Memorial Health University Medical Center (Pooler, GA) in Mar 2022", "Interview Descriptions": "Career Event , networking your self, have resume and cover letter available to give to Director’s ,  shadowing for a couple hours in your preferred area you would like to be hired in .", "Interview Questions": "Why did you become a nurse ? "}, {"date": "27 Jul 2021", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center", "Interview Descriptions": "The interview process was laid back and open for conversations. Multiple managers involved in the interview process. Each person asked their own question and then left the table open for the person to ask their own questions.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "23 Feb 2021", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Memorial Health University Medical Center", "Interview Descriptions": "It was one on one with recruitmentand then an interview with the hiring leader. Don't wear flip flops. I am typing words here no to fill up this space. I really have nothing more to say about this.", "Interview Questions": "I had to tell them about their pillars. Integrity, etc..."}, {"date": "2 Dec 2020", "title": "STaff Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Health University Medical Center", "Interview Descriptions": "It was great! The management team is very down to earth and asked some really great questions. They also provided great insight into the role and what to expect if I was hired.", "Interview Questions": "What do you think you can contribute in this role if you are hired? "}, {"date": "2 Nov 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Jan 2020", "Interview Descriptions": "Very basic questions and multiple people sat in on the interview. Also, there’s different phases of the interview process so it may be long and tedious when it comes to scheduling .", "Interview Questions": "What peeked your interest in the position? What skills will you bring to this role?"}, {"date": "23 Jun 2019", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Jun 2019", "Interview Descriptions": "My interview was set up through a recruiting company and the person I was supposed to interview with wasn't there. I \"interviewed\" with the lead tech and a couple other techs. I haven't heard back and feel it was a waste of time.", "Interview Questions": "What do you want to learn from us?"}, {"date": "16 Aug 2017", "title": "RN Float Pool Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center (Savannah, GA)", "Interview Descriptions": "Applied via internet. Met with an Hr representative and a Nurse Manager for one of the Icu units and the staffing office Nurse Manager. Had fingerprinting done for a background check.", "Interview Questions": "Asked me a question how to evaluate a patients fluid status based of an Abg."}, {"date": "15 Jan 2017", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Memorial Health University Medical Center", "Interview Descriptions": "Over the phone interview. Ended up not even being a manager but the person making the schedule only. She just went over info found online and asked why i was interested in a job in Savannah and what kind of experience i had", "Interview Questions": "Name your experience as a CST\r\nWhy are you interested in a position in Savannah while living in another state"}], [{"date": "24 Jul 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center in Jan 2017", "Interview Descriptions": "An online interview with managers in various pediatric departments. Most of the managers that I was told would be there were unable to attend and many of them were not even hiring at the time.", "Interview Questions": "How do you feel about teamwork and flexibility"}, {"date": "11 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Jan 2017", "Interview Descriptions": "I reached out to the person who handles internships, I informed her of my skills, and career goals. I was given the intern position a few days later, was told to fill out all on boarding paper work,and then told to attend  team member orientation the following week.", "Interview Questions": "What interests you about Human Resources"}, {"date": "5 Feb 2016", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Memorial Health University Medical Center", "Interview Descriptions": "Formal interview with Human Resources. Asked typical questions. Met with the main department manager who asked more job specific questions. Interview with Human Resources was more formal than the department manager. I was notified within a week whether I got the job or not.", "Interview Questions": "Asked about their core values. "}, {"date": "20 Feb 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Jan 2016", "Interview Descriptions": "I interviewed with the manager and then some members from the current team. Everything was phone or Skype. The questions were focused on reviewing my resume and my skills in the system. There were some questions about how my current team worked and how management worked. They asked fairly detailed questions about different master files and my build experience.", "Interview Questions": "Explain a certain thing I built at my current system and how it was difficult. Explain my experience with different applications of the system."}, {"date": "30 Nov 2015", "title": "Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Nov 2015", "Interview Descriptions": "A panel of managers at a table for each department (i.e. med. surg., ICU, ED, mom/baby & L&D). Each group asked the interviewee a set of questions: \"Tell us about yourself\" priority/delegation questions, and  how one may have dealt with situations in the past. Interviewers were nice and did not try to intimidate the interviewee.   Interviews tended to last around 15 minutes or so, due to the chain of candidates being interviewed for that morning. \r\nNote to Reader: An Interview for this residency program will at the very least be good for preparing you for other nurse residency interviews. Each department of interviewers gave slightly to very different vibes.", "Interview Questions": "Name a situation in the past where you have had to delegate and prioritize. What happened and how did you handle the situation?"}, {"date": "24 Apr 2016", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Oct 2015", "Interview Descriptions": "I applied for the PCP - Nursing student position.  It was quick, I showed up and was interviewed by the head of nurse management.  She asked me simple questions regarding my background and what I was hoping to accomplish as a tech.", "Interview Questions": "Explain a time I had to make a tough decision and what helped me make sure it was the right choice."}, {"date": "21 Oct 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Jun 2015", "Interview Descriptions": "one on one with manager ,then talked with human reasourses and provided documentation ,references. went for drug screen before everything was processed, I do not want my name mentioned in your review, overall process was tedious.", "Interview Questions": "yereferencesars of experience, requested lic & certificates,"}, {"date": "27 Dec 2014", "title": "Charge Capture Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center", "Interview Descriptions": "I applied for this position in September. I received a phone call in November and did a phone interview. After my phone interview, my resume was forwarded to the hiring manager. I received a phone call a week or two later to set up the sit down interview. I went to the sit down interview which went really well. All of the ladies were nice, and was really a position I was interested in (besides the fact that they wanted someone to work every weekend).", "Interview Questions": "Tell me your strengths and weaknesses"}, {"date": "5 Jun 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Memorial Health University Medical Center (Savannah, GA)", "Interview Descriptions": "I had one interview as I originally was being hired for the position that I had when I left MHUMC a few years before 2009. I was going back to work for the same boss that I had before & they needed someone ASAP in the position. That did not equal having any kind of negotiating room when it came to pay! MHUMC pays as little as they can whenever they can.", "Interview Questions": "Will you take a pay cut?"}, {"date": "16 Feb 2017", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Memorial Health University Medical Center (Savannah, GA) in May 2014", "Interview Descriptions": "Very Collegial, excellent group to work with.  Good culture, included tour and lunch, as well as dinner the night before.  Did not feel rushed, had an opportunity to meet the staff.", "Interview Questions": "What coverage can you provide"}], [{"date": "24 Apr 2014", "title": "Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Apr 2014", "Interview Descriptions": "What guideline do you follow when you code EM services, 1995 or 1997, and why?", "Interview Questions": "There was none. All questions were based off your experience with coding."}, {"date": "17 Apr 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Jul 2013", "Interview Descriptions": "Human resource called me in for an interview for the laboratory and two supervisors ask me questions about my experience, education and accuracy they also wanted to know what can I contribute to this company I work here before", "Interview Questions": "You have worked here before what was the one thing that you contributed to this company"}, {"date": "15 Jul 2017", "title": "Billing Team Leader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center (Savannah, GA) in May 2013", "Interview Descriptions": "Applied in March.  In May, had the first interview with HR. Hr asked the usual questions. Weeks later got called for 2nd interview.  Mostly talked about the company and what they needed. Not many questions.  Had to take a test that lasted about 30 minutes on billing, math, accuracy & interpreting an insurance remittance.  Another couple of weeks later I was offered a job.", "Interview Questions": "Why are you interested in working here?"}, {"date": "12 Mar 2013", "title": "OR Scheduling/Charge Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Health University Medical Center in Mar 2013", "Interview Descriptions": "Applied online and a week later I was invited to come in for an interview. The interview was completely situation based and I was offered a second interview the following week.", "Interview Questions": "Nothing was difficult it was all a \"what would you do\" interview"}, {"date": "1 Mar 2017", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Feb 2013", "Interview Descriptions": "Job fair,  3 different department heads interviewing you at one time. There was no second interview for me. Received a phone call the next day from HR with a job offer.", "Interview Questions": "How many cc are in one cup of juice"}, {"date": "6 Dec 2016", "title": "Desktop Support Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Oct 2012", "Interview Descriptions": "It's pretty straight forward.  There was an initial interview with a short technical quiz.  A follow-up interview with the team. An offer is made.  Extensive background check and drug screen.  Orientation on your first day and a probationary period. 90 days.", "Interview Questions": "How do you troubleshoot network connectivity"}, {"date": "8 Sept 2015", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Health University Medical Center (Savannah, GA) in Jun 2011", "Interview Descriptions": "You apply online, HR forwards your resume or CV to the appropriate manager. The manager reviews your application and decides if they want to interview you or not. There may be a phone interview before the actual interview.", "Interview Questions": "Describe a situation where you worked well as a team? What are your strengths and weaknesses? "}, {"date": "13 Nov 2009", "title": "Billing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Memorial Health University Medical Center in Oct 2009", "Interview Descriptions": "An application was submitted via their website. About one week later, a telephone call was made to me to invite me in for an interview for the position they were looking to fill as soon as possible. The called was made on Wednesday and the Interview was scheduled for Friday.  The interview lasted for about 15-20 minutes. The interviewer started by describing the position in detail then ask of me to state a little bit of information about myself. All of the questions were situational.", "Interview Questions": "State an example of a confict that you created a resolution for."}]]