[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great to work at Timberland", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Apr 2021", "job_title": "Dietary Aide in Story City, IA", "duration": "N/A", "pros": "It was nice working there because of the flexible schedule being a student!", "cons": "None. When I worked there I loved it!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work - has its cons like all but overall a positive environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 May 2023", "job_title": "Personal Companion in Story City, IA", "duration": "N/A", "pros": "One of my favorite things about Bethany is that when new problems arise - as happens - they are quick and efficient at developing ways to deal with it. For example, there was some stuff going on with anonymous posters literally making up things online (was proven to be made up) and within two days we get a notice that the management team has already implemented a team to deal with it specifically. Just really neat that they quickly rise to deal with new challenges. They are great staff, very friendly and actually will listen to you.", "cons": "My biggest \"downside\" is that we tend to be short staffed and though the handbook says \"points for tardy\" there's rarely discipline that happens so certain staff (not many) will abuse it and cause stress for the rest of the staff to constantly cover which can become stressful. While I do appreciate being lenient in some situations - it is hard when other staff abuse it and cause stress on us. HOWEVER I think a large part of that issue is more certain staff that usually don't work out anyway - not Bethany as a whole. Other downside is there can be a lot of gossip. My personal manager is good at stopping it, but it still happens behind the scenes and it's hard when rumors start flying. But for the most part that isn't a problem"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Not the greatest", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Mar 2018", "job_title": "CNA in Story City, IA", "duration": "N/A", "pros": "Co-workers are very friendly and helpful and residents are a fun to communicate and do things.", "cons": "Management doesn't seem like what they are doing: there's more agency in the building than actual employees. Management shows up after chaotic situations are over and they avoid chaotic situations. I had one supervisor come into a household and basically turn around and walk out because it was so chaotic that day."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I love coming to work each day!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Dec 2019", "job_title": "Marketing Director in Story City, IA", "duration": "N/A", "pros": "Bethany Life is a wonderful place to work. Not only is the management team supportive but the new household model is awesome to be a part of. The newly renovated building is beautiful for the staff and residents.", "cons": "I don't have a con at this time.  I love everything about my job and the work everyone does here at Bethany Life!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Collaborative Team Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 May 2019", "job_title": "Management in Story City, IA", "duration": "N/A", "pros": "Large mgmt team and shared responsibility, someone always available, competitive pay and benefits, flexible work schedule, great impact on personal growth, education and personal development.", "cons": "People work different shifts so it's hard to get to know everyone at Bethany if you aren't here for various shifts."}], []]