[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Delightful", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Feb 2023", "job_title": "Anonymous in Oklahoma City, OK", "duration": "N/A", "pros": "I’m enjoying the flexibility and getting to know everyone has been delightful. :)", "cons": "Nothing comes to mind at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Best organization for Entry Level PRSS", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 May 2023", "job_title": "PRSS in Oklahoma City, OK", "duration": "N/A", "pros": "The training is excellent. This is a good place for entry level PRSS. The community based treatment is a good solution for client needs, which just makes our jobs easier. There are many avenues a PRSS could take at Northcare. The best benefit package I have ever seen and heard of. Most everyone is fun and nice and respectful to work with.", "cons": "Many mental health non profits are grant driven, and when the grant runs out, your job may too. If you are good at what you do, the company will try to find you an open position with in the organization if available. However, having a back up safety and financial plan for yourself is a good idea, should the grant that covers your salary run out suddenly."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Not worth it", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Apr 2023", "job_title": "Admission Specialist in Oklahoma City, OK", "duration": "N/A", "pros": "Good pay, ok benefits, great PTO/recharge days.", "cons": "Unprofessional management at Classen location that tries to keep you from using PTO/recharge days, will yell at you over other people calling in, will expect you to work through lunch some days and come in early/stay late. Very nosey and will make comments about you. If you don’t feed into their drama, they’ll basically create problems for you. Out of my 11 coworkers, only 5 of them acted professional and were kind to me. Training also isn’t great, but you’re expected to know everything and will be absolutely overloaded with work. Short staffed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Case management", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Feb 2023", "job_title": "Case Manager in Oklahoma City, OK", "duration": "N/A", "pros": "Working there was a good learning experience. I felt adequately supported in my role. WLB was good too.", "cons": "Managing a high number of caseloads day in and day out gets overwhelming. It’s essential to plan your time accordingly and to take time for yourself to avoid the dreaded burnout."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome Supportive agency", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Feb 2023", "job_title": "Family Preservation Specialist in Oklahoma City, OK", "duration": "N/A", "pros": "Did a great job of ensuring work-life balance. The pay was decent and office life was comfortable. There was a lot of focus on making sure the staff's cup was full after all the work was done.", "cons": "I have no cons to list."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Avoid", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Mar 2023", "job_title": "Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "Trainings are excellent for the newly minted therapists", "cons": "Micromanaging Punitive Controlling No productivity met/no vacation"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to work at", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Feb 2023", "job_title": "Registered Nurse in Oklahoma City, OK", "duration": "N/A", "pros": "You get to help people and staff is supportive.", "cons": "Work can be high stress"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Very hard to get salary adjustment", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Dec 2022", "job_title": "Wellness Coach in Oklahoma City, OK", "duration": "N/A", "pros": "Collaborative work, free 10 minute massage", "cons": "No merit pay, discourages professional growth"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "CHBS Worker", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2023", "job_title": "Family Support Worker in Oklahoma City, OK", "duration": "N/A", "pros": "I wish I could think of some.", "cons": "Overworked, underpaid, unappreciated with toxic management"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great people with a couple of bad eggs", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Oct 2022", "job_title": "Director in Oklahoma City, OK", "duration": "N/A", "pros": "Great coworkers, great training, fun culture, lots of support", "cons": "Some politics in Vice Presidents and director level management leading to some toxicity in workplace, CEO not willing to remove them"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Entry Level Job", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Aug 2022", "job_title": "Behavioral Health Coach in Oklahoma City, OK", "duration": "N/A", "pros": "I got a lot of experience entering into the workforce after graduating college. My team at Family Treatment Services was supportive of me and my team.", "cons": "The amount of change and transition that occurred during my employment made my time at NorthCare pretty chaotic. Adjusting to frequent changes throughout the company was challenging, and led to burnout very quickly."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Average", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Oct 2022", "job_title": "Family Preservation Specialist in Enid, OK", "duration": "N/A", "pros": "Flexibility\nWork at home hours", "cons": "Clients can refuse to collaborate"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "terrible", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Oct 2022", "job_title": "Anonymous Employee in Oklahoma City, OK", "duration": "N/A", "pros": "none that I can think of", "cons": "poor pay, worst leadership, don't help the people it is intended to."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Be ready for what you are getting into, not good or bad, just is.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Sept 2021", "job_title": "Pre-licensed Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "-it is a job that pays you money\r\n\r\n-8:00 am 5 days a week, if that's your thing. Be ready for a lot of zoom meetings and that weird corporate smell in the building. \r\n\r\n-I honestly don't think the pay and benefits are that bad for community mental health if you are prelicensed. Once you are licensed and can bill insurance on your own then the pay is low. But I was warned in my Master's program getting into mental health that the pay is low so IDK maybe get better professors if you aren't ready to like, have a roommate for a year or two and make 45Kish for a while. There are cheap rent options available within 30 minutes of the agency that are still safe. This was something that was brought up a lot and..... I mean it is what it is, unionization for mental health workers is the only way out that I see. I could go on a rant about how pay symbolizes what our society values in America but people tell me it's a lot for a Tuesday. \r\n\r\n-trainings, at the agency and they'll send you to some out. They are free, however, if they are over zoom you will probably unofficially/officially still be working during these trainings. I was straight up asked to do work things once or twice when I was at \"a training\" so eh. Probably didn't get as much benefit from them as I could have.\r\n\r\n-get to meet people in your field \r\n\r\n-do get to work with interesting clientele and people who need treatment intensely\r\n\r\n-will say very openly LBGTQ+ affirming\r\n\r\n-I was specifically in substance abuse treatment and I did learn a lot, learned about safety planning, places to refer, treatment modalities for substance abuse, all in all not too shabby. It was trial by fire though, which can get a little sticky.", "cons": "-they have a lot of paperwork, which is a systemic issue in community mental health, but I feel based on my current employment that Northcare requires more in their notes than typical mental health centers, which generally go off of what's needed for insurance/Medicaid. Plus, they encouraged you to leave by 5:00-5:30 but are upset if you don't get the work done, but it takes 7 minutes to write a note that was a 5 minute phone call, versus me being able to write a therapy note in 3 minutes with all the required information for my new agency that still gets signed, audited, and billed. Something I don't understand but I will give them grace that maybe they have to justify more than other places, I don't know, but it was not it for me. \r\n\r\n-main reason I came back was for more feedback and more trainings so that I can become an effective therapist. I was burned out by the end of my time at Northcare (as you do), and now I am prelicensed in private practice and feel like I'm getting a more varied clientele and more feedback/consult opportunities here than I did there, so that negates a lot of their reasons for going there rather than somewhere else.\r\n\r\n-now with Covid there are online CEUs out the wazzoo so the trainings aren't really as appealing as they used to be. Also, the r/psychotherapy subreddit is absolutely great for gathering advice/perspective/consult. I thought I would have to be at a place like Northcare for guidance and I realize now that, as Maya Angelou said, nothing will work unless you do. Don't rely on your supervisor to do that for you at Northcare, they will most likely be too busy. Be your own advocate. \r\n\r\n-I have more time to talk with my current coworkers and am building better relationships with them than I did coworkers at Northcare. There are a lot of youngish prelicensed/newly licensed people there but in the role I was in I had so much paperwork I felt guilty if I ever was to take a break and talk to any of them/eat lunch/do anything other than after official work hours. \r\n\r\n-I had to deal with people in systems outside of mental health. I'm prelicensed, so new to the field and had no experience with this system. I have noticed other people saying they felt micromanaged at Northcare, but I had the opposite experience where they were operating under \"no news is good news,\" but I don't want my only feedback to be when I'm doing something wrong, then feeling defeated that I am getting in trouble for something that may not have been explicitly communicated from the start. It just gets to you after a while, particularly if you come from a love is earned environment..... I even went online to try to get more consult on working with this particular system (I'll just go ahead and say it was the legal justice system) but they are all so varied and treatment's role / ethics change so much for each one I couldn't get a solid grip on best practice the way I can when I'm learning about an evidenced-based practice, for example. They were trying to put me in another role after I told them I was thinking about leaving but after a week or two I realized I was too burned out and just needed to leave. Which sucks for the clients but it's common in the system. \r\n\r\n-I don't want to be micromanaged but some feedback that I'm generally doing what I need to be doing would be nice. Also, if I'm having conflicts with people in this system, then some role-plays on appropriate ways to draw boundaries with people in a leadership role would have been nice. Instead they just told me to \"draw boundaries\" and then told me not to worry, or just say \"I'll ask and find out.\" You can figure out how that went. (Spoiler, I was constantly anxious regarding this individual in a leadership position outside of Northcare and felt like he was trying to run me out of my job. I guess in the end he did.) So, building a network of people to consult with may be a good idea. If I could go back I would make a point to talk to other providers in the area about their practices within the legal system to ensure I was doing the right thing, rather than relying on a supervisor who really didn't have the experience of the role I was doing, and being trained by a peer who was understandably burned out as well. \r\n\r\nSo, at the end of the day, being a new therapist is hard. If you want health benefits and want to work with adults I would advise going here, doing the intake team for a yearish, taking advantage of trainings/being able to take off without having to reschedule a lot of people (because you will probably only have maybe 5 clients you actually see for therapy,) then from there decide if you want to go to a particular program within Northcare or then look at other places for a different experience. \r\n\r\nCommunity mental health is kinda like the Walmart of mental health, its providing to a lot of people so the quality is a mixed bag. The insurance/credentialing system in the state/nation makes it where basically new yuppies out of school are working with people who need experienced therapists, but that's not what they get. Additionally, depending on how staffed/understaffed/who's in a management role, it can either be an amazing place for treatment or you are just a number. It all really depends and fluctuates from year to year, as it most likely does for ALL the community health/large corporations/organizations in the area. \r\n\r\nMost random thing about my time there, I wish they had a Starbucks closer to Northcare so that I could have gone to a coffee shop at lunch just to take a break. Stitch isn't too far away, but still a bit of a drive when you really only get 30 minute lunches :/ I know that's terrible when some of the people who come in are truly truly suffering from a capitalistic society but lunch breaks off of work have always been a major coping component for me in the past, so instead of only needing to get through 4 hour increments of work until I had something to look forward to it was like, 9 hours straight of people arguing with me/paperwork. Honestly I don't even like to think about it for too long.\r\n\r\nBut honestly.... the worst thing they do there.... is REPLY ALL to sooooo many emails. I'm generally laid back, Grateful Dead live-your-truth hippy dippy kind of gal but that is just unacceptable workplace behavior. When I left I had 300 unread emails that I just left because there were so many reply all \"Wow guys, thanks!\" emails. Truly unforgivable in modern America. Just text/tiktok/dm your friends at work instead of repying all to a work email, my God."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Job", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Feb 2022", "job_title": "Case Manager in Oklahoma City, OK", "duration": "N/A", "pros": "Management is supportive and does their best to be flexible and understanding of your needs.", "cons": "High caseloads and change happens often"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "fun place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Feb 2022", "job_title": "Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "Lots of support and training.", "cons": "consumer base can be difficult if it is not your passion"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Care Navigator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Aug 2021", "job_title": "Care Navigator in Oklahoma City, OK", "duration": "N/A", "pros": "Leadership can be flexible. Options for promotion if you stay.", "cons": "Lots of turnover with colleagues. Grants come and go all the time so things can change a lot year to year."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Accountant", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Oct 2021", "job_title": "Accountant in Oklahoma City, OK", "duration": "N/A", "pros": "Great boss. Great people. Flexible hours", "cons": "Not much room for growth\r\nNot open to new ideas"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Care Navigator/ Case Manager- Outpatient", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Feb 2021", "job_title": "Care Navigator in Oklahoma City, OK", "duration": "N/A", "pros": "The job is in an office setting Monday-Friday 8:00 Am to 5:00 pm for Outpatient. You have a multi-disciplinary team to work with that is knowledgeable and helpful. You may even have your own office.", "cons": "Consumers have a hard time keeping scheduled appointments. Consumers will walk in randomly and you may be expected to meet with them and have to adjust appointments. Supervisors' expectations can be very different between supervisors. Consumers will often beg for Individual Therapy and we never have enough Therapists. Many Case Managers are left to tell desperate consumers that we don't have enough therapists/ or they have to be on a waitlist."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great job opportunity, difficult at times", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Apr 2021", "job_title": "Administration Assistant in Oklahoma City, OK", "duration": "N/A", "pros": "Great work family and support, great learning experiences, and multiple experienced team leaders to help with any given situation. Great benefits and pay!", "cons": "Extremely fast paced at times, highly difficult situations to manage with clients from time to time leading to an extremely stressful work environment but manageable."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Overworked and underpaid", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Sept 2021", "job_title": "PRSS in Oklahoma City, OK", "duration": "N/A", "pros": "Occasional bonuses, pto increases overtime.", "cons": "Micro managing, work harder than clients, management makes decisions that will benefit them only."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 May 2021", "job_title": "Certified Pharmacy Technician in Oklahoma City, OK", "duration": "N/A", "pros": "Great schedule and good work environment", "cons": "There is little room for advancement"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Northcare", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Feb 2021", "job_title": "Labeling in Closter, NJ", "duration": "N/A", "pros": "good great excellent family happy", "cons": "There's nothing bad to say about this place"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Northcare", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Feb 2021", "job_title": "Care Navigator in Oklahoma City, OK", "duration": "N/A", "pros": "Flexibility, benefits, travel pay, trainings", "cons": "This company has too many cliques."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Dec 2020", "job_title": "Executive Leadership in Oklahoma City, OK", "duration": "N/A", "pros": "great opportunities for growth, meaningful work, great co-workers, mission-driven", "cons": "braces would be a good benefit to add to dental plan"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Maybe", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Dec 2020", "job_title": "Case Manager in Oklahoma City, OK", "duration": "N/A", "pros": "Good if you are in school", "cons": "Not good if not is school"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Healthy organization, employees, and management", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Aug 2016", "job_title": "Anonymous Employee in Oklahoma City, OK", "duration": "N/A", "pros": "Probably the most available management I've ever worked with-- you can get a supervisor quickly, in a crisis, or to even just staff a diagnosis, or even to just process.  Lots of opp's for communication with colleagues and management-- meetings, one and one support meetings, team meetings. Tons of training and support from management-- they try to do trainings and such without making extra meetings, so they do a kind of lunch and learn format. Lots of CEU opportunties.  The management/supervisors constantly ask for feedback and actually act on a lot of ideas when they can, and are at least open with us when they can't change something. Emotionally healthy staff who feel the sincere care of the management staff.  Fun activities on the job.  Happy staff.", "cons": "The building is old, but that's changing. But, temperature control has been sketchy, hot or cold. \r\nGoing to a new building soon. \r\nVolume seems to have greatly increased lately, but management works a lot behind the scenes t help."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Northcare makes a difference", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "13 Aug 2015", "job_title": "Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "This company primary purpose is to take care of the very poor who have experienced trauma addiction or suffer with depression and other mental illness like schizophrenia.   The management have very long tenure and care very much for people served.  They do an outstanding job considering how poorly government funds these services in Oklahoma.   They also do an excellent job of eliminating positions of employees who lack compassion for clients or who bring excessive drama to work.   Many consumers credit Northcare for saving their life.", "cons": "If you are looking to learn and grow as a professional in mental health this is an excellent place to start.   Employees who want increases salary need to be willing to move into supervising for advanced pay.   Employees who are lazy or can't get along with co workers or are not customer friendly get fired"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Upper management uses intimidation and circular arguing", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Aug 2016", "job_title": "Oklahoma Children Services in Enid, OK", "duration": "N/A", "pros": "Provided laptop. Privides good educational training. Says you can flex your 40 hr week but when you do you get questioned and told well only at the companies request not the families. The staff that do work there all are full of excellent skills and with the appropriate leadership would stay a long time. Offers overtime", "cons": "Offers overtime but doesn't always grant it. Quantity of cases over quality of case management.  No PO access for 6 months, that's an extremely long time when you are suppose to be an agency that values the family- oh we value the family but you can't take 1 day off before 6 months unless oh wait you don't get paid for it. That's a quick way to get staff to burn out quick!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Clinician", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Aug 2017", "job_title": "Mental Health Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "Very team oriented, lots of training and learning opportunities. Camaraderie among similar level co-workers. Very detail oriented services provided to clients.", "cons": "Poor salary for the amount of work required. Team leaders always appear stressed and overwhelmed. Very secretive when employees leave or are fired. They don't promote self care for employees. If you're considering working at Northcare, do your homework and talk with current and previous employees and ask the hard questions. Don't assume that since Northcare is a large community mental health provider, has great programs for clients, and a decent reputation, that they will support you in times of need. They are truly about THEIR bottom line, not your well-being."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Confusion is an understatement", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Sept 2015", "job_title": "Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "Hires newbies in the field \nAll major holidays off\nNice policies for clients\nStaff is generally nice \nLocated down town", "cons": "Lack of management skills\nLack of consistency \nTons of professional red flags \nHorrible pay\nIncompetent programs heads -\nThe head honchos do not like to be corrected so mismanagement continues \nThere is no room for critique, even during my exit interview the woman made faces as I made suggestions or stated what things I think the company should approve of, her mood literally changed she stopped writing and looked up at my then preceded to write . \nStats on program succeeds aren't accurate, our department head constantly spoke of how our program had a 70 % success rate yet we were no where close . This made me very uncomfortable ."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Political, but good experience", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Feb 2016", "job_title": "Therapist (AFOS) in Oklahoma City, OK", "duration": "N/A", "pros": "Variety of work, great training, fantastic clients, good job to start your career", "cons": "Extremely political, very difficult to reach \"productivity\" requirements and should you not do so you will not be allowed to take the time off you have earned by putting in 9-10 hours per day. If you are not \"popular\", and agree with management to a level of drinking the kool aide, you will not advance. Low pay, management is very top heavy (multiple \"supervisors\" for a relatively small staff), older staff members are often passed over"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Amazing place to learn, Grow and thrive", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Jan 2015", "job_title": "Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "Working at NorthCare was absolutely one of my most rewarding opportunities of my career. It is important for me to know that I have management support, training, appropriate growth oriented feedback and to know that the people I work  with love what they do everyday. The management is 100% behind their therapists and this permeates everything from the didactics that are offered, meetings conducted and the way they communicate with you and the clients, on a daily basis. NorthCare is dedicated to providing the clients serve with a dignified, respectful and compassionate therapeutic experience, this is felt daily through interactions with reception on up to interactions with upper management. They provide learning opportunities and encourage appropriate implementation of  in practice of  variety of therapeutic modalities and orientations. The work culture is a free flowing, open, vibrant and at the same time structured work environment that appreciates and encourages diversity in their employees. Perks include, tons of didactic training, a effective and supportive supervision experience, money to be used each year to use toward training not offered at NorthCare, fun activities for all employees. Lastly, employee self care is extremely important in the eyes of the directors and upper management they understand the stresses of the job and encourage work/life balance.", "cons": "Productivity seemed to be quite challenging for some as it relies on a variety of factors. However, I found that management was always willing to help you brainstorm ways to increase productivity. Additionally, if you needed to take off for any reason this also affects productivity. For me the productivity measure would not have been a deal breaker but it is a bit of an obstacle at times."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Professional Family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Aug 2016", "job_title": "Mental Health Provider in Oklahoma City, OK", "duration": "N/A", "pros": "Great Benefits\r\n-Great PTO package that offers PTO payout for those workaholics who find self-care in other avenues than consistent time off. Actually, the PTO package allows for vacation and payout. I am never able to use all my PTO physically. It is nice that I have the opportunity to utilize it in other avenues of life!\r\n-reimbursements such as mileage, cell-phone and ad wage for speciality projects\r\n-Leaders are open to feedback and continue to seek growth/development\r\n-Open door policy: if an employee does not feel comfortable or safe speaking with their direct supervisor another member of leadership's door is always open.\r\n-Employees at Northcare are often on the cutting edge of evidence based trainings at the company's expense and have opportunities to be apart of community changes that are directly impacting the lives of Oklahoma citizens for the good.\r\n-Highly ethical, creating a safe environment for employees and consumers.\r\n-Very affordable onsite licensure supervision that results in being fully reimbursed if an employee chooses to remain at NorthCare for 2 years after licensure [supervision is relatively cheap when comparing to private, $40/50 dollars monthly compared to 90/120 per week privately].\r\n-Many employees work at NorthCare for years while completing school and choose to continue working at Northcare in a different capacity once graduated.\r\n-Compared to other nonprofits and community mental health agencies NorthCare has a very competitive salary and benefits package.", "cons": "-Some employees choose to leave northcare after completing licensure to seek private practice and greater pay. These are generally individuals that have chosen not to commit to a nonprofit or life in the community mental health field. There is nothing wrong with this. I personally loved when my supervisor challenged me on this once I had completed my candidacy. It really helped me see how much I LOVED community mental health and working for a nonprofit. \r\n-Pay: I am hesitant to put this on here because I truly believe for a non profit and ethical community mental health agency the pay is comparable if not competitive. Would I like to make more money? Of course, but is that desire greater than being a small part in big changes in Oklahoma? Is that desire enough to walk away from a strong professional support system? No, I knew what I was signing up for when I choose to work at NorthCare."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Hard work for little pay", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Feb 2016", "job_title": "Family Preservation Specialist in Oklahoma City, OK", "duration": "N/A", "pros": "Some support of supervisors,  cell phone reimbursement,  closed on government holidays,  laptop is provided, CPR certification is provided,  mileage reimbursement.", "cons": "Expected to do a very hard job for little pay,   Unrealistic expectations,  lots of office politics,  expected to be on call.  Hard to have a good worklife balance.  Very little room for growth"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Run Away!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Jun 2016", "job_title": "Anonymous Employee in Oklahoma City, OK", "duration": "N/A", "pros": "You will get great benefits and training opportunities. The front line staff are very hard working. There is variety in the client population.", "cons": "The agency is obsessed with money and numbers at the expense of client and employee care. The agency only cares about productivity and will not reward staff for other merits. The agency has inexperienced middle management with upper management is entirely unavailable. Lots of manipulation and coercion was used with employees during my tenure. They don't allow former employees to have references and you can't use PTO for 6 months following your start date!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "\"If you can survive you will be better, but prepare to be bullied.\"", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jul 2016", "job_title": "Anonymous Employee in Oklahoma City, OK", "duration": "N/A", "pros": "Pretty good education opportunities (Unfortunately all of them are mandatory and often during inconvenient times), wide variety of experiences to be had (many EB practices used, adults, children, adolescents, etc), other front line staff are generally trustworthy and hardworking individuals.", "cons": "Upper management never available or present, middle management totally unwilling to take any sort of feedback or listen to their employees, if you disagree with management staff you are likely risking your job or at least will be made very miserable for the rest of the time you remain there, manipulation tactics employed the majority of the time so that management can suck as much out of you as possible, employees are seen more as objects to be used rather than people to invest in, pay the deplorable considering the number of hours required, often having to work overtime without any overtime pay or even acknowledgement, already earned PTO is denied if you are not meeting the very difficult to meet productivity standards, or if your supervisor forgets you asked off, any number of reasons, unless you are a favorite of the administrative staff it is unlikely you will ever receive any sort of a raise, productivity bonuses can be withheld for any reason they see fit and often it is for tiny little things employees literally haven't had the time to do because they are busy working 5-10 hours overtime just to keep up, the employees that management like to put on a pedestal are too busy engaging in office affairs and trading gossip to actually inspire or help anyone, there is enough money to build a fancy new building but not enough money to give a pay raise to an employee after they have literally sacrificed a year of their life to this company, the CEO has literally no relationship with the employees who actually make the money that this company thrives off of. At best it can be considered a sweat shop.  Oh yeah, and you might be terminated illegally if you have to have an emergency C-section and your doctor recommends you to take off two extra weeks, management will tell you that your doctors note serves as your resignation letter when you aren't willing to take their \"recommendation\" to get a second opinion by a strange doctor that recants the doctor who actually did your c-section's opinion. The way management treats their employees at the adult location is reminiscent of  an abuser/victim relationship, employees are too scared to say anything and everyone has to whisper behind closed doors to even talk about the weather much less communicate about the upper management politics and ways to survive the experience."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for, lots of opportunities for advancement.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Dec 2016", "job_title": "Outpatient Therapist in Oklahoma City, OK", "duration": "N/A", "pros": "Great community between staff and supervisors. The organization really focuses on self care.", "cons": "As with any non profit, you don't get into it for the pay. However, NorthCare is great at providing longevity bonuses, productivity bonuses and raises."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Administrative Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Aug 2015", "job_title": " in North Kansas City, MO", "duration": "N/A", "pros": "Great staff that had cared for patients as if they were family members; all would go above and beyond the call and made sure the families were taken care of.", "cons": "Morale was down due to miscommunication among staff and administration to the point that key staff was let go and other terminated."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "very good to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Oct 2013", "job_title": "CNA in Greenville, NC", "duration": "N/A", "pros": "Very good places they send me to work. I have met a lot of nice families and friends while working here. Need more hours sometimes.", "cons": "hours sometimes not enough. Pay raise not very often. Benefits not good enough. Sometimes work hours are cut and not replaced fast enough."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place to work.  Great continuing education.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Dec 2012", "job_title": "Therapist in Oklahoma, Clearfield, PA", "duration": "N/A", "pros": "Emphasis on continued training; really learn how to practice as a therapist; very supportive bosses; ability to work with a variety of populations.", "cons": "The pay could be more."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I LOVE NORTHCARE!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Feb 2017", "job_title": "Family Preservation Specialist in Oklahoma City, OK", "duration": "N/A", "pros": "The best job I ever had!", "cons": "You need healthy self care habits"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "4 stars", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Oct 2020", "job_title": "Family Preservation Specialist in Lawton, OK", "duration": "N/A", "pros": "Adjustable work schedule, floating holidays", "cons": "Demanding, micromanaged, have to adjust work schedule to see families"}]]