[[{"date": "22 Nov 2022", "title": "Data Entry Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at CenterLight Health System (New York, NY)", "Interview Descriptions": "Text through website and email. Odd seemed like a phishing robot. Don’t know yet. Then an offer letter that seems odd as well. Looking further into it. We have to be careful at all times.", "Interview Questions": "List three ways that you stand out from other applicants as to why you’re a great fit for this position."}, {"date": "15 Oct 2020", "title": "HR- Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CenterLight Health System (New York, NY) in Oct 2020", "Interview Descriptions": "You will interview with the senior recruiter and then the director. Once you interviewed with the Director they will have the other HR staff interview you to see if you are a good fit for the company.", "Interview Questions": "What would you do if your Applicants didn’t arrive for orientation."}, {"date": "14 Mar 2021", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CenterLight Health System (New York, NY) in Jan 2019", "Interview Descriptions": "Friendly, however, informed company offers annual increases to find out it hasn't given annual increases in years. Not informed of PTO to take by deadline. Forced to cover others due to lack of staffing. Feeling of mistrust, multiple emails as reminders. HR leadership is dishonest.", "Interview Questions": "What skills I would bring to the site. "}, {"date": "24 Oct 2016", "title": "Business Intelligence Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at CenterLight Health System (New York, NY) in May 2016", "Interview Descriptions": "I applied through school network and then was invited to an interview. The manager was kind and nice, and they are very willing to understand more about you. I was invited to the corporate office at Bronx and was asked to do a demonstration on an analytic project I did before", "Interview Questions": "What was the analytic project you did that has the most impact?"}, {"date": "6 Jan 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at CenterLight Health System (Bronx, NY) in May 2016", "Interview Descriptions": "Location is horrible but felt promising because I met with some good ppl that promised a better outlook for the organization. Unfortunately, after I came onboard the company changed management and this game started to fall apart", "Interview Questions": "If I was a team player?"}, {"date": "22 Mar 2016", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at CenterLight Health System", "Interview Descriptions": "interview was quick, easy and interviewer asked questions about my life and values. Very friendly, down to earth lady and it was more like a conversation than anything else.", "Interview Questions": "why are you interested in this job and what makes you good fit?"}, {"date": "15 Feb 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CenterLight Health System (Bronx, NY) in Dec 2015", "Interview Descriptions": "Met with the Director and then the VP at a later date. Very timely and informative interview, they make sure you know what you are in for if you should be selected. Second interview was mostly situational questions, what would you do if....Still waiting for a final decision to be made. The company appears to be a great place to work, one that definitely places their consumer needs first.", "Interview Questions": "How would your current staff describe you"}, {"date": "13 Nov 2015", "title": "UM Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. I interviewed at CenterLight Health System", "Interview Descriptions": "The process took a day and the agency called me to make an offer .. The manager was very nice and the environment was very friendly when I got there the first time .", "Interview Questions": "Work me through your resume"}, {"date": "10 Aug 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at CenterLight Health System (Bronx, NY)", "Interview Descriptions": "Interview was fine but overall onboarding process took too long.  They need to overhaul the onboarding process.  Also, probationary period upon being hired is six months - this is entirely too long and should be reduced to the more normal 3 months.", "Interview Questions": "What can you do to help us in this position within the first thirty days if we were to hire you?"}, {"date": "20 Mar 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CenterLight Health System (Bronx, NY)", "Interview Descriptions": "Comprehensive 1 hour phone screen with an HR recruiter.  Very impressive.  However the interview with the hiring manager was the opposite.  He read my resume for the first time during the interview, asked perfunctory questions.  He provided his contact info on a piece of scrap paper and then never responded after I attempted to contact him.  Not surprised the company's customer service is poor with him in charge.", "Interview Questions": "Walk me through your resume"}], [{"date": "26 Oct 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CenterLight Health System (Bronx, NY) in Mar 2013", "Interview Descriptions": "Interview and hiring process was simple and smooth. But it would have been better if everything was done at the same place verses running around to multiple locations.", "Interview Questions": "No real training provided. A real training procedure is needed"}, {"date": "2 Apr 2013", "title": "Human Resources Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at CenterLight Health System (Bronx, NY) in Feb 2013", "Interview Descriptions": "When I met with the hiring manager, she was running late with no apology.  She was not very friendly and did not warn me that she had a hard cut off for the end of the interview.  She cut me off as I was speaking.   Many times, she would not let me finish the answers to my questions.  I brought a portfolio to show some work and she didn't want to see it.  She didn't ever ask about my over all experience and focused on an old job and not my most recent position.  It felt a bit agressive and like she wanted me to fail the interview.  I've interviewed a dozen people and I try very hard to make them put thier best foot forward.  Everyone is nervous no matter your experience - a threatening environment doesn't allow people to do their best.", "Interview Questions": "N/A"}, {"date": "20 Mar 2013", "title": "Systems Integration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CenterLight Health System (New York, NY) in Feb 2013", "Interview Descriptions": "Had phone interview for 30 minutes. Mostly consisted of integration related questions. Many of the questions surrounded around knowing the product and it's interaction with various systems that they are using. The interview went pretty well. I have not heard from them after that. The interviewer seemed pretty knowledgeable in the product.", "Interview Questions": "One of the question that was asked was how do I see myself in five years."}, {"date": "27 Apr 2011", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at CenterLight Health System (Bronx, NY) in Sept 2010", "Interview Descriptions": "interviewed with a BA & program director(who knows nothing about project management & comes from nursing background) then later interviewed with COO", "Interview Questions": "Tell us about yourself"}]]