[[{"date": "26 Feb 2023", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "I would say the interview process was really really great interview process. For a the faculty position I applied for, It was relatively fair process. It also took a fair amount of time", "Interview Questions": "Regular and general interview questions"}, {"date": "29 Mar 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Vermont (Burlington, VT) in Feb 2023", "Interview Descriptions": "The first round of screening phone interviews was conducted via Zoom for around 30 mins. The committee members first asked around 6 questions. Then I was given time to ask 2 questions.", "Interview Questions": "Which course are you planning to teach?"}, {"date": "19 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Vermont", "Interview Descriptions": "Interview was very casual since it was intended for a student. Easy to connect with interviewer and felt more like a general conversation than a pressured interview. Though personally, my interview was very low-stakes.", "Interview Questions": "Why are you interested in this position."}, {"date": "26 Feb 2023", "title": "T.A Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Vermont in Aug 2022", "Interview Descriptions": "30 minute teams call. Emailed my resume and cover letter in advance. Very laid back, more like a conversation. Was easy to set up and the interviewer basically offered me the job by the end of the interview. Very clear expectations and next steps.", "Interview Questions": "What courses did you take at UVM that made you want to be a T.A.?"}, {"date": "13 Jul 2022", "title": "Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Vermont", "Interview Descriptions": "Multiple interviews with different stakeholders. These were done via Zoom over the course of a few hours. Very pleasant and standard interview process. No offer but they sent an email and didn't leave me ghosted, which should be standard.", "Interview Questions": "Why would you be a good fit? What skills do you have? Etc"}, {"date": "7 Jan 2022", "title": "Residential Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "It was an informative interview. I learned a lot about the position and the expectations of the position. I gained a lot of networks.  This interview was a great experience.", "Interview Questions": "What makes you a great leader?\r\nWhere do you see yourself in 5 years?\r\n"}, {"date": "16 Aug 2022", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Vermont (Burlington, VT) in Jan 2022", "Interview Descriptions": "Met with team lead and primary investigator in person. They were nice and straightforward. Once I was basically screened for the job it was about finding a fit between the researcher's needs and my skillsets.", "Interview Questions": "Why do you want to be a research coordinator?\n\nWhy is your non-clinical experience relevant?"}, {"date": "18 May 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Vermont", "Interview Descriptions": "No interview process. I was emailed a contract by the director of graduate studies in my program. I was asked no questions but was informed that I was waitlisted originally.", "Interview Questions": "If you accept this offer, please e-mail us a copy of your signed contract. "}, {"date": "29 Apr 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "Easy process, interviewers were very welcoming. Looking for standard experience and basic background. Come in with questions. Process was seamless and over video chat. Follow-up was quick and heard back within the week.", "Interview Questions": "What experiences in research have you had?"}, {"date": "23 Mar 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "I met with my potential advisor, and we had a very engaging conversation about our mutual goals, and whether I would be a good fit on the research team.  It was all relatively painless because I was in the right place.", "Interview Questions": "Which project do you want to work on?"}], [{"date": "1 Dec 2020", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Vermont (Burlington, VT)", "Interview Descriptions": "I interviewed for the Biology PhD program during a year when they had few accepted applicants. I was alone (no other applicants) during the time I came and a stay at a local hotel was covered. I received an agenda for the following day where I met 1-on-1 with PIs of the department who described their research and asked me questions. I felt comfortable with the process and the administrative staff were kind.", "Interview Questions": "One question asked of me was what sort of (protein) mutation I would make to mimic or evaluate an effect."}, {"date": "11 Mar 2021", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Vermont (Burlington, VT) in Dec 2020", "Interview Descriptions": "Since UVM seems to be screaming diversity and inclusion from the rooftops, I had high hopes for an equitable experience. Unfortunately, that wasn't the experience I had as there was no diversity in the panel that interviewed me. While I had prepared and researched every member of the panel, they hadn't taken the time to read through my resume or even look at my portfolio. I know this because I actually asked them and they all admitted to not looking at my portfolio. As a matter of fact, they had HR email me afterwards requesting the same link to my portfolio which I had already submitted as part of my application. They then proceeded to take turns each asking me a generic question one of which was 'Why do you think diversity is important?' So 3 white people ask a hijabi why diversity is important. Imagine how uncomfortable that was for me. I was beyond disappointed. UVM you can and should do better. How is it okay for your learning and development team-the same people that are creating your trainings-not have such a fundamental and basic understanding of cultural sensitivity? How are your trainings going to be inclusive if your instruction design team isn't? How do you plan to hire an ID without taking a minute to review the quality of the designer's work? This interview happened a few weeks ago and I was planning on just letting it slide, but then I felt a moral obligation to speak up. I have no intention of getting anyone in trouble, but now that you know I am confident that you can and will do better in the future.", "Interview Questions": "How do you write learning objectives?\nWhy is diversity important?"}, {"date": "4 Oct 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "Had 5 people interview me at once.  They took turns asking basic interview questions. They got back to me fairly quickly with a n offer which I accepted. I started work 2 weeks later. Definitely grateful for the opportunity to work for the hospital that saved my life", "Interview Questions": "What are your strengths "}, {"date": "14 Sept 2020", "title": "Research Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Vermont (Burlington, VT) in Sept 2020", "Interview Descriptions": "Interview was 20 minutes long with the Principal Investigator and the manager over Zoom. They told me about the job position, asked me a couple of basic questions, then I asked them questions.", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Aug 2021", "title": "UTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Vermont (Burlington, VT) in Feb 2020", "Interview Descriptions": "Friendly, helpful, together people who cared. Deliverable results, and a win-win. I really was astounded at how together, polished, and nice my interviewer was. I loved landing the job: It was an amazing opportunity. My interviewer was upbeat, and it was an all around positive experience.", "Interview Questions": "What are you looking to do, and why?"}, {"date": "26 Oct 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Vermont", "Interview Descriptions": "The interview took place over the phone with two interviewers at once. I thought the interview had gone very well, as I was prepared for all of their questions and was qualified for the position. I was told that they were busy but that I could expect to hear back within a few days. I was not contacted by either interviewer at any point after the interview despite attempts on my end. I received a generic email approximately a month later saying the position had been filled.", "Interview Questions": "Tell us about yourself"}, {"date": "2 Oct 2019", "title": "Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "Long and hard process for Admissions to be continued when I can go back and interview again someday. If love to work there but it wasn't right at the time.", "Interview Questions": "How much experience do you have"}, {"date": "3 Sept 2019", "title": "South Zone Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Vermont (Burlington, VT) in Apr 2019", "Interview Descriptions": "The hiring manager, who has a foreign accent and whom I found difficult to understand called me to schedule an interview several weeks ahead. This was after waiting for over 6 months from the job posting being taken down. When the date came, they forgot to call. He called to apologize and rescheduled. The interview was a conference call, roundtable format; one question per person, with no commentary or follow up.", "Interview Questions": "How have you elevated diversity in your life"}, {"date": "31 Mar 2019", "title": "Senior Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Vermont", "Interview Descriptions": "Round 1- Phone interview.\r\nRound 2 - Case study exercise with presentation as part of in-person interview.\r\nRound 3 - Three hours of interviews with multiple groups. Each person in the group took turns asking questions. They were careful about asking the same questions that had been asked to another candidate.", "Interview Questions": "How would you contribute to the diversity and excellence of the university?"}, {"date": "29 Mar 2020", "title": "UVM Athletics Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Vermont (Burlington, VT) in Apr 2019", "Interview Descriptions": "It was a quick and easy process, submitted my cover letter and resume via email.  Was called in for one interview, and got hired a few days later.  Interview lasted around 30 minutes or so", "Interview Questions": "How are your public speaking abilities?"}], [{"date": "10 Apr 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Vermont in Feb 2019", "Interview Descriptions": "Interview process was with two people over the phone. Interview went well in my opinion and I was told someone would be following up with me within a week. Never heard back from anyone until I received an auto-generated email saying that the position had been canceled, over a month after the interview.", "Interview Questions": "What would be the biggest challenge for you in this position?"}, {"date": "26 Apr 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Vermont (Burlington, VT) in Jan 2019", "Interview Descriptions": "Super easy and straightforward, everyone is so nice and you basically just need to ask any professor about their research to get your foot in door, great place to work", "Interview Questions": "Q: why do you want this"}, {"date": "6 Oct 2017", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Vermont (Burlington, VT) in Jan 2017", "Interview Descriptions": "Apply online and 1 on 1 interview. The employees require some references (from old jobs, professors, etc.). The interview is pretty straight-forward, and focuses on strategies of studying and taking exams.", "Interview Questions": "what is your studying strategy?"}, {"date": "5 Dec 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Vermont (New York, NY)", "Interview Descriptions": "Just like normal academic interview. Since it's a phd postion application, I contacted my potential advisor directly. During the screen phone interview, we talked about my research and my potential advisor's research projects. A few academic questions were asked to evaluate my research background.", "Interview Questions": "Please describe your research background"}, {"date": "15 Apr 2016", "title": "Pharmacy Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at University of Vermont (Burlington, VT) in Apr 2016", "Interview Descriptions": "I interviewed at this job a couple days ago.  First of all they never called me back to tell me what was going on.  IN the interview it was pretty odd.  They asked a bunch of odd questions and never really asked me about myself, my experience or anything like that.  It was a lot of questions that didn't make sense to me.  Sort of felt like they had their mind made up ahead of time, but they were interviewing me as a formality.  I like the hospital a lot, but this interview did not go well.", "Interview Questions": "They asked me if I had ever been late to another job."}, {"date": "19 Feb 2016", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Vermont (Burlington, VT)", "Interview Descriptions": "Very prescribed questions without much time to ask your own questions. Many different teams and functional areas, even within the Colleges. Be sure to ask questions about specific job responsibilities and who you report to and who will report to you.", "Interview Questions": "As the candidate, I asked a question about work-life balance, to which I was given an answer (summarized here) that 'this is a professional organization' (that kind of response was a red flag that I missed and should have given more weight to)"}, {"date": "6 Jan 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "Very easy interview\r\n\r\nthe people were very nice and straight forward\r\n\r\nbusiness professional attire\r\n\r\n3 board panel quesitoned me which was a little intimidating but they were all very nice and encouraging\r\n\r\nOverall it ended well and I got the position.  they called me back within a week so i didnt have to wait too long for an answer", "Interview Questions": "What was your greatest failure?"}, {"date": "26 Jun 2015", "title": "Project Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Vermont", "Interview Descriptions": "A basic phone interview followed by an in person interview.  \r\nIt took a long time to be contacted after the online application, however after that the process moved quickly.", "Interview Questions": "How would your previous employer describe you? "}, {"date": "2 Jan 2016", "title": "Research Assistant, Economics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Vermont (Burlington, VT) in May 2015", "Interview Descriptions": "1 informal interview with professor I was applying to work with, after submitting letter of interest to department chair. At the end of the interview said I had the job and asked when I could start working.", "Interview Questions": "Wanted to assess my ability to use relatively basic computing packages and overall analytical/quantitative background and ability."}, {"date": "13 Jan 2015", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Vermont", "Interview Descriptions": "I had a phone interview with a hiring committee. Asked me basic questions about my resume and my experiences. Asked job related questions to my field. Do you have experience with statistic software? Can you use excel? Then I had a Skype interview were they asked more behavioral type questions.", "Interview Questions": "Can you tell me a time were you have had to deal with difficult people? How do you manage your time? "}], [{"date": "31 Oct 2014", "title": "Business Support Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Vermont (Burlington, VT)", "Interview Descriptions": "It happened so long ago so it's not really relevant. It was an internal move. I was referred to this program by another star employee who knew I was looking for a move.", "Interview Questions": "N/A"}, {"date": "22 Sept 2014", "title": "Event Coordinator (At the Dudley-Davis Center) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Vermont in Sept 2014", "Interview Descriptions": "I applied for this position online, though the university's website and was called about a month later to schedule a phone interview for the following week. The interview was conducted by two people: the supervisor of this position and another staff member the candidate would work closely with. They said they had seven questions they were asking each candidate; this took about 30 minutes and then I had a chance to ask questions. \r\n\r\nI was told they were conducting phone interviews the remainder of that week followed by in person interviews for final candidates; they were looking for someone to begin about a month later. I was told that I would be notified regardless of their decision about me moving forward. After two and half weeks and two follow up emails, I have heard nothing nor received a response from my initiative.", "Interview Questions": "I was asked about my view of social justice."}, {"date": "30 Dec 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Vermont (Burlington, VT) in Mar 2014", "Interview Descriptions": "Emailed person in charge of hiring and emailed my resume. Then went for a short meeting and got a tour of the lab and started a week later after the paper work was filed.", "Interview Questions": "What is your course load this semester?"}, {"date": "18 Feb 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Vermont", "Interview Descriptions": "The online application process was fairly straightforward, and was followed by two rounds of interviews (first a phone screen, and then a full day interview with multiple people/panels). Communication prior to the onsite interview was sufficient and helpful. The interviewers were all very welcoming and kind, however each group I met with had a list of prepared questions that they took turns asking, without any follow up or conversation in between. Definitely felt slightly awkward, and it would have been nice to have an interview that was a bit more conversational. Overall though, it was a good experience.", "Interview Questions": "Perhaps not unexpected from UVM, but there were several questions regarding diversity and sustainability."}, {"date": "7 Jul 2017", "title": "TechTeam Student Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Vermont (Burlington, VT) in Feb 2014", "Interview Descriptions": "Applications are submitted via an online form and selected applicants are interview by the supervising team for technical skills, ability to fit with the current team, and customer service skills.", "Interview Questions": "How would you respond to someone asking for help illegally downloading media? "}, {"date": "4 Jan 2014", "title": "Customer Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Vermont", "Interview Descriptions": "Interviewed with several representatives from several sections of the school of business in a panel style interview. The interview was informal in nature, which lead to a comfortable interview environment. Each interviewer had a different idea of what they expected the interviewee to accomplish in their role, which was not ideal.", "Interview Questions": "What advise would you give a graduating business student from UVM in order to ensure they get a job over an Ivy League graduate?"}, {"date": "2 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Vermont (Burlington, VT) in Jan 2014", "Interview Descriptions": "I was hired from different University directly from graduation.  The position was great and I began working on my research with a small team of employees which turned out to be great.  There was  no process for me, I was simply chosen for the job.", "Interview Questions": "Do you want the Job?"}, {"date": "5 Aug 2013", "title": "Part Time Job Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Vermont", "Interview Descriptions": "through email", "Interview Questions": "write a summary about yoursel"}, {"date": "19 Oct 2015", "title": "Teacher's Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Vermont (Burlington, VT) in Jun 2013", "Interview Descriptions": "Chosen based on academic excellence, I received and email from my professor complementing me on my success in her class, and asking me if I would help her with a class the following fall. It was one of my favorite teachers that semester so I gladly took the position.", "Interview Questions": "Would you like to be a TA?"}, {"date": "6 Jun 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Vermont (Burlington, VT) in Feb 2012", "Interview Descriptions": "Phone screening, in person with staff and interested parties including a presentation. Pretty standard questions but repetitive.Keep answers brief and to the point and provide detaield descriptions of when you performed this task in a previous position.", "Interview Questions": "Why did you apply to this position?"}], [{"date": "30 Jan 2011", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at University of Vermont (Burlington, VT) in Sept 2009", "Interview Descriptions": "Very informal meeting with the other people in the office. All very nice. Typical 'so tell us about yourseld' lead-in. Our discussion about my background moved easily into how my skills might translate to the needs of the position. We also discussed what sort of changes my presence in the office would bring about. Very positive altogether.", "Interview Questions": "Tell me about yourself."}, {"date": "30 Jul 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Vermont (Burlington, VT) in May 2009", "Interview Descriptions": "A multi-stage process.", "Interview Questions": "Where do you find yourself in 5 years, 10 years?"}, {"date": "15 Aug 2012", "title": "Student Support Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at University of Vermont (Burlington, VT) in May 2008", "Interview Descriptions": "I submitted after seeing the posting on Chronicle of Higher Education. In a relatively short period of time--I think they were behind in making the hire--I got a call, and they flew me in for an interview. I was one of three people to get an in-person interview and eventually got the job. The in-person interview was 2 days and involved 20 to 25 people. \r\n\r\nIt took UVM about three weeks to offer me the job. After 2.5 weeks, I got another job offer and called UVM to ask them to match it, which they did. That was nice.", "Interview Questions": "I should have expected it because of the university's and department's mission statements online, but I didn't: How do you live the values of Social Justice in your life?"}]]