[[{"date": "23 May 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Anthony's Hospital (Gig Harbor, WA)", "Interview Descriptions": "Quick interview process, I have applied and was scheduled on the next day for an interview. Initially , they just ask a brief background of your experiences and your reason why you apply for a certain position The process is smooth.", "Interview Questions": "Give an instance that the patient is not satisfied about your care and what did you do?"}, {"date": "15 Nov 2022", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Anthony's Hospital", "Interview Descriptions": "Started with submitting my resume, a phone interview, then an in-person interview. After the interview , my interviewer told me about an upcoming skills test. After the skills test they make an offer", "Interview Questions": "My strengths and weaknesses. Experience?"}, {"date": "27 Feb 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at St. Anthony's Hospital (Gig Harbor, WA) in Feb 2022", "Interview Descriptions": "Interviewer asked 10-15 behavioral questions over a zoom call that lasted 40 minutes. Afterwards we discussed what a normal day would be like on the unit and the types of patients that are common. Relatively casual setting and she joked around with me.", "Interview Questions": " Tell me about a time you disagree with a provider's order."}, {"date": "27 May 2021", "title": "Assistant Nurse Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Anthony's Hospital in May 2021", "Interview Descriptions": "It was a panel interview which included the manager, director, ANM, and staff. They used standardized questions and they provided an opportunity to ask my own questions at the end.", "Interview Questions": "Can you describe what professionalism is?"}, {"date": "16 Mar 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Anthony's Hospital", "Interview Descriptions": "was not too difficult, was asked general interview questions like where I see myself in 3-5 years  and what experience I have had in the past and was also asked about scheduling preference", "Interview Questions": "where do you see yourself in 3-5 years?"}, {"date": "15 Oct 2020", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Anthony's Hospital", "Interview Descriptions": "Was a very good process! Manager was super kind, and gave a walk around the unit . Felt very at ease, and welcomed . It was a one on one interview at the time do to the unit being small .", "Interview Questions": "Tell me about yourself ?"}, {"date": "13 Aug 2019", "title": "Surgery RN I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at St. Anthony's Hospital (Oklahoma City, OK) in May 2019", "Interview Descriptions": "Registered online, applied to position, received a call back within 2-3 weeks, attended initial interview in May, followed up with director, received a second interview with scheduler/supervisor, received a call within that week with a job offer, accepted offer and received start dates available.", "Interview Questions": "Why am I interested in the position?"}, {"date": "31 Jan 2019", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at St. Anthony's Hospital (Oklahoma City, OK) in Jan 2019", "Interview Descriptions": "I interviewed in a relaxing atmosphere and we both spoke our minds and discussed how I can help bring the patients to a more comfortable and convient setting and show them that we at St Anthonys want our patients to feel number 1", "Interview Questions": "what are my goals"}, {"date": "6 Sept 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Anthony's Hospital (Shawnee, OK) in Aug 2018", "Interview Descriptions": "Everyone was friendly and informative. They made you feel completely comfortable. They gave you the chance to see if the job would fit you. They questions where straight to the point for the job you would be doing. They also prepared you for if they made an offer the kinda of shifts and hours you would be working.", "Interview Questions": "what was one example of my compassion toward a patient, person, or customer. "}, {"date": "15 Apr 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Anthony's Hospital (Oklahoma City, OK) in Apr 2018", "Interview Descriptions": "Conducted and interview with the off going and on coming nurse manager and then had a peer interview.  I loved the opportunity to have a peer interview to ask questions specific to the unit.", "Interview Questions": "How do I handle stress"}], [{"date": "21 Feb 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Anthony's Hospital", "Interview Descriptions": "I applied online through Indeed and heard back 2 weeks later. I was preinterviewed by a recruiter and the questions were straightforward. It was about my experience, nursing education, etc.", "Interview Questions": "How will this position help you in the future?"}, {"date": "26 Jan 2018", "title": "Mental Health Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at St. Anthony's Hospital (Oklahoma City, OK) in Feb 2017", "Interview Descriptions": "Went Good very professional. They ask me where would I be in 5 years. They were very Respectful. I told them I'm a team player, Respectful, on time, and very compassionate.", "Interview Questions": "What's your weakness"}, {"date": "15 Jun 2018", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Anthony's Hospital (Shawnee, OK) in Dec 2016", "Interview Descriptions": "First a phone call interview then a in person interview then they brought me in for a peer to peer interview. It was intensive!  It was hard to get to the interviewer due to not knowing where her office was but found it on time", "Interview Questions": "How will you balance work and school"}, {"date": "3 Apr 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at St. Anthony's Hospital", "Interview Descriptions": "Submitted application Sunday night, contacted by secretary of DON on Monday. An interview scheduled for later in week. Contacted the day after interview to set up phone interview on the following Monday.", "Interview Questions": "N/A"}, {"date": "25 Dec 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Anthony's Hospital (Denver, CO) in Feb 2014", "Interview Descriptions": "Very relaxed. They need more staff. Awesome manager at the time. I was interviewed by two floors and they called me as soon as I got home to give me an offer. I should have asked for more money at the time because of this. If you don't have any experience put in clinicals as if they were employers to get through the computer screening process. The floors are desperate to hire more people but the canidates have to go through a recruiter first and They will only call you if you meet the written requirements. They hire on a rolling basis so you may not hear from the recruiter for a while depending on when you apply. First an email is received then a scheduled phone interview to talk about qualifications then an interview with a manager.", "Interview Questions": "Describe a time where you reacted well in a difficult situation."}, {"date": "2 Dec 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at St. Anthony's Hospital (Lakewood, CO) in Mar 2012", "Interview Descriptions": "Very straightforward. I interviewed with the manager and 2 peers. They asked behavioral questions, no clinical questions. They were friendly and valued my previous experience. They had enough of a need for nurses that I could start directly on days.", "Interview Questions": "name a time you had to deal with a difference of opinion with a doctor."}, {"date": "21 Jun 2013", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Anthony's Hospital (Gig Harbor, WA) in Sept 2011", "Interview Descriptions": "First you will individually interview with an upper management person and then you come back for a team interview where they take about 6 people from the department you are going to work in to ask you questions about everything. They want to make sure they are a good fit for you too. You will also be drug tested and they test for nicotine too now.", "Interview Questions": "How do your own core values correlate with Franciscans values?"}, {"date": "30 Aug 2013", "title": "Staffer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Anthony's Hospital in Jul 2010", "Interview Descriptions": "Long time ago, don't remember much.", "Interview Questions": "What would you do if you didn't have enough people to fill the requirements?"}]]