[[{"date": "19 Apr 2023", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Foundation for Electoral Systems (IFES) (Crystal City, VA)", "Interview Descriptions": "Phone interview followed by an interview with two program officers, the regional director and the associate regional director. The process was straightforward and was at the headquarters. It was largely probing on my interests in elections and democracy at large.", "Interview Questions": "What is your interest in elections?"}, {"date": "13 Apr 2023", "title": "Program Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "The interview process was pretty straightforward, and the individuals that I interacted with were friendly. However, I would hesitate to relocate for this organization given their unprofessional communication and actions after extending an offer. In particular, they provided conflicting information about the start date and salary, and failed to provide any details about the benefits package.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "1 Apr 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Foundation for Electoral Systems (IFES) (Crystal City, VA)", "Interview Descriptions": "Very well structured. Not alot of time wasted. Small panels therefore relaxed. The interview panels had very good questions and you could feel the passions they have for what they do.", "Interview Questions": "Why are you interested in working for us"}, {"date": "3 May 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES) (Arlington, VA) in Mar 2023", "Interview Descriptions": "The interviewers were not qualified enough for the interview. One program manager and one program officer attended the interview process. I believe that a program officer is not qualified enough to take an interview from a Program Coordinator position, hence, that will create a sense of issue in the interview.", "Interview Questions": "Why did you apply for this role?"}, {"date": "31 May 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "The interview was very formal, no welcoming remarks from the interviewers. The questions were on some theoretical approaches, not making sense based on the actual position requirements. No feedback received after the thank you letter.", "Interview Questions": "What's your socio-behavioral approach toward youth programs?"}, {"date": "6 Jun 2023", "title": "Communication Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES) (Nairobi) in Nov 2021", "Interview Descriptions": "My interview had 2 people - one from IFES and one from IEBC. I wondered why the IEBC staff was in the room, she barely looked at me! IFES staff was extremely kind but all they asked me are misogynistic and sexist questions -", "Interview Questions": "His line of questioning revolved around my family and children, where I would leave my children when I came to work! Who would cook for my husband when I left work late Maternity leave and not provisions of support but to show me how hard it was to be a woman who can birth children"}, {"date": "13 Dec 2021", "title": "Program Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at International Foundation for Electoral Systems (IFES) (Washington, DC) in Oct 2021", "Interview Descriptions": "The first interview was fantastic, a 1-hour group interview with the team and the person who would be my direct supervisor. Great working vibes and would be a fabulous team to work with. \n\nMy second interview was a bit of a disaster. It was supposed to be a 1-hour interview with the regional director of the team. They flat out said they hadn't read my resume or application and asked me for which position I was applying. Spent the first 5 min of the interview trying to pull up my resume and read it. Then they actively complained about their team members IN the interview. They unofficially offered me the job and the call ended in 20 min. Did very little to sell me on the company or the management environment to which I would be subjected.\n\nBetween the benefits package, the low salary (for D.C.), and management... definitely did not feel like employees are valued at this organization. I rejected the offer.", "Interview Questions": "Why do you want to work at IFES?\nAre you comfortable with remote travel?\nWhat budgeting experience do you have?\nIn your career do you want to go the management route or analyst route?"}, {"date": "18 Mar 2021", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "Someone from HR first called me out of the blue and did a screening and then we scheduled an interview the next day with people from the team. The interview went well but both people interviewing me were very closed off. Not friendly. Be prepared for that.  They also never contacted me after the interview. Never took the time to tell me I didn't get the job.", "Interview Questions": "To make sure I actually spoke Arabic, they asked me to say why I want to work at IFES in Arabic. "}, {"date": "12 Jan 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "I interviewed with 2 members online. It was a very casual process, and it only took 30 minutes. They asked about my experiences and interest. It was an extremely basic interview, nothing surprising.", "Interview Questions": "Why are you interested in this position?"}, {"date": "24 May 2021", "title": "Director of Regional Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES) (Washington, DC) in Feb 2020", "Interview Descriptions": "The process was long and drawn out with multiple conversations, but I enjoyed the conversations at each level. The HR manager didn't seem to be able to change my email in the system, so I missed one email but thankfully found it in my junk mail.", "Interview Questions": "Describe a program you would implement. \r\nThey asked about M&E experience and regional knowledge. "}], [{"date": "4 Sept 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Foundation for Electoral Systems (IFES) (Remote, OR) in Jul 2018", "Interview Descriptions": "The interview process took over two months! I had an initial interview with two team members. It went very well and the HR woman told me that I was the preferred candidate, and asked that I wait for the Manager who was overseas,  for the final interview. I waited patiently, finally speaking with the manager 6 weeks later, who asked me the exact same questions as the first round. It turned out that they had continued to interview new applicants after telling me I was the preferred candidate. They asked for my references, who I worked quickly to mobilize, but they never checked them. I sent a follow-up email asking how it was going and was then informed that I was unsuccesful. The entire process has been absolutely appauling  - disconnect between HR and hiring team and total disregard for candidates.", "Interview Questions": "How would you work to get colleagues on board /establish your credentials?"}, {"date": "24 Oct 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "online app, one in-person interview with 2 POs and a final interview with the Director. the overall process was easy. they checked the references too.  people were nice during the interview", "Interview Questions": "Why are you interested?"}, {"date": "9 Oct 2017", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "Applied online. Phone interview a few weeks later with a junior HR person. Questions were very basic, asked about work style, how I like to be managed, etc. A week or two later, had an in-person interview. Questions were again quite basic and I wondered how they would be able to tell between candidates with such basic questions. They seemed to care about my interest in the position as much or more than my answers and qualifications.", "Interview Questions": "How do you like to be managed?"}, {"date": "25 Dec 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Foundation for Electoral Systems (IFES) (Arlington, VA)", "Interview Descriptions": "Take charge of your interview process. Start doing things the right way. First, do the practice and research necessary to wow the hiring manager. Then, take the time to really review how the interview went. Using these two steps you will start to see progress. With progress comes success. You will not regret perfecting your interviewing skills when you get a job in the career field of your dreams. Remember, your interviewing process should not end at the interview. Keep reviewing job interviews to continue improving and work towards success.", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "25 Dec 2017", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at International Foundation for Electoral Systems (IFES) in Dec 2016", "Interview Descriptions": "It was mostly a performance based interview. It lasted approximately 30 minutes.  The interview committee was formed by two members.   It was held in their offices. We started on time. They were very polite.", "Interview Questions": "What are your salary expectations. "}, {"date": "30 Jun 2016", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "I had a terrible experience with this company after applying for a position. I was first contacted by HR to set up a phone screen, and after giving my availability, never heard back. Then I received the same email from HR a week later asking me again for my availability, and after responding, we were able to identify a time to speak. The time for the interview came and went, and I didn't receive a phone call from the HR rep. After sending an email, I learned that the rep was in a meeting before our scheduled call and it ran over. We rescheduled for the next day. Again the time for the interview came and went, and I did not receive a call from the HR rep. The company still hasn't reach out to me, but at this point, I would not be interested in working for an organization that has such unprofessional hiring practices.", "Interview Questions": "N/A"}, {"date": "15 Jun 2016", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "The HR rep conducted a phone screening, it was easy and about 10 minutes long. Then I interviewed with two staff members from the department, it was about an hour and very informative, there was great rapport with them. I was asked to do a final interview with two members of senior management, one who told me I came highly recommended by the two people I had interviewed with previously. The final interview went well, nothing to \"throw you off.\" After the final interview I have heard nothing from the organization. Nothing.", "Interview Questions": "How do deal with doing mundane activities daily?"}, {"date": "23 Apr 2016", "title": "Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "Sr Recruiter was great. Shared inflation about team and job at being ing of call that helped better prepare mlny answers. I had more context and felt able to focus in those areas.", "Interview Questions": "task management and difficult people"}, {"date": "16 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "The process took about two weeks. I applied online, and received a call for an interview about a week after I submitted my application. I had a second interview shortly after, and was offered the position soon after that. Both calls were about 30 minutes, and gave time to discuss the position and ask questions.", "Interview Questions": "There were no difficult or unexpected questions asked. The questions focused on my experiences and qualifications as related to the job responsibilities."}, {"date": "15 Sept 2014", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "I applied online and the process took less than a month. Two weeks after I submitted my materials through their hiring portal, I received an email from a recruiter asking to set up a phone interview. The phone interview with the recruiter happened that same week and the next week I went in to interview with two program people.  They ended the interview almost exactly one hour after we began, which I thought was a bit premature. I only got to ask two questions of my own.", "Interview Questions": "There were no unexpected or difficult questions. Most questions were behavioral questions regarding times I've had to work with subgrantees, handled an unexpectedly stressful situation, or handled conflict with a coworker. "}], [{"date": "7 May 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "They were interested in hearing about your ability to work with a team, writing abilities (in preparation to draft proposals), regional/language experience, and your familiarity with the Microsoft Office suite (Excel in particular). Know a bit about the programs IFES currrently has underway, as well USAID funding mechanisms (grants, contracts, etc.)", "Interview Questions": "The same one that gets people every time: what is your greatest weakness?"}, {"date": "2 Oct 2016", "title": "National Election Expert – CRC National Adviser - Count and Results Centre Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at International Foundation for Electoral Systems (IFES) (Pristina) in May 2014", "Interview Descriptions": "I had no interview since the people who called me to work for IFES they already where familiar with my skills and abilities. I've been working in several Elections in Kosova and abroad with almost the very same people so that's why I was able to work again with them. We've been colleague in Elections organizations beside IFES like OSCE, IOM, UNOPS", "Interview Questions": "N/A"}, {"date": "13 Dec 2014", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Foundation for Electoral Systems (IFES) in May 2014", "Interview Descriptions": "Disappointing experience.  The HR rep was professional and friendly.  Scheduled an interview within a week or so of submitting resume online.  It helped I had met him at a professional event a few weeks beforehand at IFES HQ.  Met with two program people (One sr. level, one mid-level).  Felt it was a positive hour spent, although the mid-level woman sat for the entire interview giving me a blank stare and saying virtually nothing.  At the conclusion, the sr. person and I had established a positive rapport and she asked me to submit a writing sample, which seemed like a hopeful sign. I sent the samples and never heard back despite sending follow up emails (including to two HR people) for several weeks.  I found it very unprofessional behavior.  If someone comes in for an interview, IFES should at least have the professional courtesy to send a follow up note once a decision is made.", "Interview Questions": "Nothing terribly unexpected or out of the ordinary.  Began interview by describing position and asking with words to the effect of \"based on all that, how would you bring your skills to bear?\" "}, {"date": "6 Mar 2014", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at International Foundation for Electoral Systems (IFES)", "Interview Descriptions": "HR person was very annoying - she talked more than me", "Interview Questions": "Why are you interested in elections?"}, {"date": "10 Feb 2016", "title": "International Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at International Foundation for Electoral Systems (IFES) (Arlington, VA) in Jan 2014", "Interview Descriptions": "After applying for the internship I was contacted by HR to set up a phone interview. A few days later I had a phone interview with an HR associate for about fifteen minutes. I was shortly thereafter given notice that I had been selected to move onto an in-person interview. The in-person interview was approximately a week later and lasted a little over a half hour. Overall, I thought the process was smooth and fair on both ends. While I did not end up being selected I have no critiques or complaints of the process.", "Interview Questions": "Explain to my your writing credentials? "}, {"date": "21 May 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at International Foundation for Electoral Systems (IFES) (Washington, DC) in Jul 2013", "Interview Descriptions": "This was fairly standard - a phone interview with HR, a second interview with mid-level staff, and then a final interview with department directors. The latter two each had two interviewers in the room, and the atmosphere was cordial - professional, but not high-pressure. There were about two weeks between each of the steps.", "Interview Questions": "The interviews focused on fairly standard behavioral questions, like explaining how you had dealt with difficult situations, made major contributions, resolved an ethical dilemma, et cetera. There was also a focus on you asking questions about the position, while they learned more about your personality."}, {"date": "3 Sept 2013", "title": "Contracts and Grants Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Foundation for Electoral Systems (IFES) (Washington, DC) in Jun 2013", "Interview Descriptions": "I received a phone call initially from HR and arranged for a time to talk on the telephone for an interview.  The \"interview\" over the phone lasted about 45 minutes with the HR recruiter, 35 minutes of which the recruiter spent talking about various things including herself so I'm not quite sure from what she gleaned information during the less than ten minutes that I participated in the \"conversation\" but I was then invited to the office and spoke with C&G staff and then was ultimately hired.", "Interview Questions": "When I was brought into the office I initially spoke with two people in C&G and then two others from C&G.  I don't think that there was anything surprising but just many behavorial type of questions....\"tell me about a time when you were confronted by a coworker.....\""}, {"date": "17 Jul 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Foundation for Electoral Systems (IFES) (Washington, DC)", "Interview Descriptions": "The interview process will vary greatly depending on with which division you are applying to work .\r\nFor the intern position I submitted the application online and had an in-person interview shortly thereafter. The interview was pretty unorganized (due to shortcomings in the HR Department). The questions were generic. Three staff members were in the interview.", "Interview Questions": "Why are you interested in working with IFES?\r\nTell me about your past experience (asking about specifics from resume)?\r\nWhat do you think are the major factors holding back democracy in the region?"}]]