[[{"date": "21 Aug 2022", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University in Aug 2022", "Interview Descriptions": "The interview took about 20 minutes.\nTalk about the job description, your skills, work experience, status, behavioral issues, and beliefs. They also ask some Christian questions if you study or attend church.", "Interview Questions": "Tell me about yourself / what is your faith?"}, {"date": "23 Feb 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle Pacific University", "Interview Descriptions": "No complaints about the interview process. Had three interviews total - two with staff members, one with HR. Just keep in mind when applying that it may take more time than usual (depending on the interview processes you're used to) to move through the process.", "Interview Questions": "The classic \"greatest weakness\" question."}, {"date": "12 Feb 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seattle Pacific University", "Interview Descriptions": "It was overwhelming. I appreciated how they were able to ask me simple questions and quesitons that were easy to answer. The interview process was more likely to be prepared", "Interview Questions": "When would I be able to start"}, {"date": "8 Feb 2021", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle Pacific University", "Interview Descriptions": "Filled in forms about availability at start of each quarter. In the interview, we basically went over schedule and availability, that was it! Checked in with management from time to time for training or about how job was going.", "Interview Questions": "What's your availability per quarter? How many hours do you want? "}, {"date": "15 Jul 2020", "title": "Instructional Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University in May 2020", "Interview Descriptions": "The interview consisted of three rounds.\r\n\r\nThe first  was an interview with the full search committee that lasted about an hour.\r\n\r\nThe second was a 'fit' interview with an HR representative\r\n\r\nThe third had three components. I met with the team I would be joining, made a presentation of recommendations to a faculty member, and met with the search committee again. I was given the details of the presentation a few days ahead of time.\r\n\r\nMy only negative experience was in the 'fit' interview. As a Christian school, they want to know if you are a Christian and if you broadly agree with their beliefs. My issue was that all but one of those beliefs was disclosed on their website ahead of time. Their \"Statement Regarding Human Sexuality\" is not advertised online. As such, one cannot determine before this 'fit' interview whether or not they agree with the statement.\r\n\r\nAs one might fear, the statement makes claims about sex, gender, and sexual orientation that many people, including some Christians, disagree with. The HR representative made it clear that I did not have to personally affirm this statement, but that one needed to be comfortable being a part of an institution that held this belief.\r\n\r\nFortunately, I turned the job down, so I did not have to make a decision about whether or not to live with this. I wish this all had been very clear at the beginning of the interview process.", "Interview Questions": "What was an example of a team project that went well or poorly? and why?"}, {"date": "19 Mar 2022", "title": "Visiting Assistant Professor, Economics Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Seattle Pacific University (Seattle, WA) in May 2020", "Interview Descriptions": "One interview with department head. Small department, most faculty are senior. Offer compensation around $70,000. Very easy interview as they really needed people. Interview about teaching methodology, no teaching demonstration.", "Interview Questions": "Describe how you promote inclusion and diversity in the classroom "}, {"date": "10 Jun 2021", "title": "Mail Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Seattle Pacific University (Seattle, WA) in Jan 2020", "Interview Descriptions": "One quick in person interview. Met with the two main people in mailing service. They just asked pretty basic questions. It felt like a conversation rather than an interview. I got offered the job almost immediately afterwards.", "Interview Questions": "If you were a piece of furniture in a room, which one would you be and why?"}, {"date": "1 Jun 2019", "title": "Human Resources Benefits Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seattle Pacific University", "Interview Descriptions": "This is a faith-based institution.  Be aware that you will be asked about your faith, your relationship with God, whether you attend church regularly.  Also, it may or may not come up that SPU has a policy prohibiting the hiring of anyone who is openly LGBTQIA or \"espousing the lifestyle\".  This was as far as I made it in the interview process before withdrawing my candidacy.  I continue to have high regard for the institution, but am rather disheartened by this policy.", "Interview Questions": "Tell me about your faith journey."}, {"date": "16 Jun 2022", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle Pacific University in Oct 2018", "Interview Descriptions": "It was a 4 round process, started with a phone interview, then an in-person interview with the person I spoke with on the phone and their manager, then a large panel interview with 4 team members, and finally an interview with the VP. That doesn't include the faith fit interview with HR.", "Interview Questions": "Why do you want to work at SPU?\nHow does your faith affect your life?"}, {"date": "12 Feb 2021", "title": "Cage Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle Pacific University (Seattle, WA) in Sept 2018", "Interview Descriptions": "Apply through Hand shake. have a one on one interview with the person in charge. The best way to land an interview would be to network and know the people there.", "Interview Questions": "Why do you want this job? \n"}], [{"date": "31 Aug 2018", "title": "Senior Systems Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Seattle Pacific University (Seattle, WA) in Aug 2018", "Interview Descriptions": "Interview Process:\r\nI discovered the position on CL and applied online.  This was followed by a phone interview, an in person with the hiring manager and one of their peers, an interview with the positions team peers, an interview with HR, and finally an interview with department directors.  After that, I received an offer letter in timely manner.  All in all about 2 weeks worth of time based on scheduling.\r\nProcess was conducted professionally.  Based on how they interviewed me, It is understandable why they were among the only 3 universities in WA to be ranked in the 2017 <major college reviewer> best national universities list.\r\n\r\nEnvironment:\r\nFirst of all, it is a private religious college.  Expect to get questioned about your religious belief.  That being said, the university has an open and inclusive policy.  During the interview process, I never felt judged.  In fact I was surprised that during the HR interview process, the main subject was about not discriminating nor judging others choices.  \r\nSecond, a benefit that I felt during the application process was that this was a mission driven institution with preparation of students for a productive positively impact life was the priority.  \r\nDuring the interview process the majority of people I met seemed open, interested in me, and easy to communicate with.  I felt they loved where they worked and made me want to work there too.\r\nThe position itself had a diverse set of technology to support as well as immediate growth plans for new technology with stated ability to contribute to current and future solutions.  This would have been a great position to learn and bolster my career.\r\n\r\nReason for declining offer:\r\nA review of salaries from GlassDoor indicates a 15% drop in salary compared to corporate salaries in the King County WA area.  I mention this because anybody comparing will notice this fact.  I recognized it at the beginning but fully believe that the benefits offered by SPU did more than just offset the salary difference.  Both personal benefits such as contributing to a world improving organization as well as benefits such as vacation, holidays, ...  \r\nUnfortunately, after reviewing the position, I could not take it due to commute distance and time impact on family.  If lived closer, I would be working there now.\r\n\r\nWhy the long review?\r\nI wanted to work there.  It looked like a great team as well as a great employer.  SPU was the best interview process out of 25 jobs applied for which generated 8 in person interviews.  Professional.\r\n\r\nBest of luck in your search.", "Interview Questions": "A significant amount of questions were of the type \"Explain how you handle conflicting tasks/deadlines\".  "}, {"date": "22 Mar 2018", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University (Seattle, WA)", "Interview Descriptions": "Applied online. Scheduled for a first round interview over email. Interviewed by a small group of current staff. Advanced to a group interview with the whole staff (also scheduled over email) and asked for deliver a short presentation. Difficult to get a sense of the pay until an offer was made.", "Interview Questions": "\"An International student asks to meet with you to discuss searching for Biology internships. In the meeting, you learn that she really dislikes studying Biology but feels like she has to because her parents are supporting her education. What do you say to this student?\" "}, {"date": "26 Aug 2018", "title": "Technology Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seattle Pacific University (Seattle, WA) in Nov 2017", "Interview Descriptions": "I applied online and after about two weeks I heard back from the hiring manager. Then I had a phone screening with several very easy and simple IT questions.  After that process I went to the campus to have an in person interview with two gentlemen (Doug and Jon). This was a really nice conversation but very basic for an interview process. The usual things were discussed (past experience, skills, and how I treat customers in some situations)After this, there was a breif moment where I was asked to wait outside then I was brought back into the office and told I would be moving on to the HR interview. A couple days later a lady from HR called to do a interview to talk about my walk with Christ and my story with Christianity. (SPU is a Christian university) After this, I was called to do a director level interview and this was done in front of a panel of 5 directors of the entire IT department. The whole process spanned several weeks but only took up about 5 total hours of my time. Overall, the questions were challenging but thought out, the people were very kind and I really did enjoy the entire process.", "Interview Questions": "You have a large volume of log files that all contain data you need. The data is preceded by a keyword and after, the data is 25 characters long. How could you automate this data gathering  easily with PowerShell? "}, {"date": "1 Dec 2017", "title": "Assistant Program Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University in Sept 2017", "Interview Descriptions": "I applied at the end of August and was contacted for an interview in mid September. The first round was a one-on-one with the supervisor, second round was with the small search committee. Third round was a \"mission fit\" interview with HR, a tour of campus, then the unofficial job offer. \r\nI was very interested in the job until the Mission Fit interview. The HR rep and I reviewed SPU's policies, which are quite conservative for me. They have a statement on human sexuality, which describes at length their views on marriage and sex (being only between men and women). I questioned further and found out that they do not hire people who identify in the LGBTQ community, because they physically can't abide by the human sexuality statement. As an ally to that community, this was a deal-breaker and I declined the position.", "Interview Questions": "Normal interview questions, but in each interview, the first question was about my christian faith. "}, {"date": "4 Jun 2019", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle Pacific University in Aug 2017", "Interview Descriptions": "I had 3 separate interviews; one with the direct supervisor, one with a panel of faculty and the supervisor, and a final interview with HR and then the direct supervisor again. The process was pretty standard until the HR interview. They make you acknowledge that you are ok with their stance on human sexuality. Basically, it states that God only made man and woman (no in-between), and that marriage is only between men and women. They also basically make sure you know that they don't hire people who identify as LGBTQ. \r\nI got an offer right after I completed the HR interview, but after reflection, realized there was no way I could work at an organization with those ideals. Plus, the salary was on the low end and vacation benefits were minimal. I turned them down.", "Interview Questions": "They asked about my experiences with advising, supporting at-risk students, admission, and other pretty standard office job questions (conflict, decision-making, leadership, etc). "}, {"date": "17 Jun 2019", "title": "Certification Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Pacific University (Seattle, WA) in Jan 2017", "Interview Descriptions": "You meet with a lot of people, including a \"mission match\" interview with HR. The mission match is to determine if you're a practicing Christian and if you agree with their values.", "Interview Questions": "What do you think is necessary for good data management? "}, {"date": "27 Oct 2016", "title": "Undergraduate Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seattle Pacific University", "Interview Descriptions": "There were multiple rounds. I was first screened in person by a manager, then called back for a two part interview (meeting first with a panel, and then with the director), and finally finished with a \"Faith Fit\" interview with HR. From the first interview until the offer, the process was 6 weeks.", "Interview Questions": "Asked to give a 5 minute presentation to the panel, as if presenting to prospective students."}, {"date": "5 Oct 2016", "title": "IT Support Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle Pacific University", "Interview Descriptions": "I had applied via online. Along with your professional experience Pacific University will require intimate details on your spiritual life prior to your interview. They will also require you to agree and sign some sort of lifestyle code.  I thought it was strange but it did not chafe with my values.\r\n\r\nThere was a phone screening and a week later there was an on-site interview. The on-site interview consisted of a test with various mathematical, hypothetical and professional problems. Most of them were fairly easy and was only really used to show your thought process. The remaining time was spent in conversation with professional experience emphasized.\r\n\r\nI was told my candidacy was to be pursued at the conclusion of the interview. However after a brief discussion of my faith I was told since I was not a Christian, I would not get the position. It seems like a weird place to work if they are screening for only Christians ( which I told them prior I was not, nor was it listed for obvious reasons that you would not get hired if you are not a Christian. ). It is discrimination and illegal. \r\n\r\nI have no doubt it is a nice place to work so long as you tow the line.", "Interview Questions": "What is the next number in this sequence? 4 , 5 , 8 , 17 , 44"}, {"date": "12 Oct 2016", "title": "Desktop/Laptop Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seattle Pacific University (Seattle, WA) in Sept 2016", "Interview Descriptions": "Started off with a phone interview, Interview went well and was asked to come to an in person interview. This is where it gets a little odd. As soon as I arrive I am asked to take a written test, which is fine, except for the fact that over half of the questions were not related to the position at all. For example, lots of logic questions like this:\r\n\r\n A windowless room contains three identical light fixtures, each containing an identical light bulb or light globe. Each light is connected to one of three switches outside of the room. Each bulb is switched off at present. You are outside the room, and the door is closed. You have one, and only one, opportunity to flip any of the external switches. After this, you can go into the room and look at the lights, but you may not touch the switches again. How can you tell which switch goes to which light?\r\n\r\nAnyways, after going through that I had yet another phone interview with the HR department asking me about my religious preferences, and to explain their christian lifestyle (kind of odd, but no big deal). \r\n\r\nAfter this I was administered an online test since I didn't answer any of the logic questions on the first test and was told that not answering these would disqualify me. This test was a little more.... Interesting. The first part was a personality test consisting of around 50 questions, followed by a 6 minute \"cognitive\" test consisting of something like 20 questions. These are pretty hard, and again, did not relate to the position at all. \r\n\r\nAll in all it was a very strange interview process, I will say that the person I interviewed with (both Eric and the HR lady) were both extremely nice and seemed like they would have been a pleasure to work with, so there was that.", "Interview Questions": "N/A"}, {"date": "23 Oct 2019", "title": "Retail Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Seattle Pacific University (Seattle, WA) in Sept 2016", "Interview Descriptions": "It was professional and brief. Nothing out of the ordinary for food services. They asked the usual questions about food and beverage preparation, store front experience as well as customer service experience. During this, they also asked for my availability and willingness to be transferred between the various retail shops that they have one campus.", "Interview Questions": "Do you have any prior experience to food handling?"}], [{"date": "16 Aug 2016", "title": "Helpdesk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University (Seattle, WA)", "Interview Descriptions": "Very long interview and subjectively difficult process. Began with a phone screening, then an in-person interview with the manager, followed by a team interview. They interview for about 70% people skills and 30% technical know-how. Be persistent and focus on smiling.", "Interview Questions": "If a computer is running slow, what would you do to diagnose the issue?"}, {"date": "29 Jun 2016", "title": "Finance Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University (Seattle, WA) in Nov 2015", "Interview Descriptions": "Was brought in for a very informal interview, we ended up talking about our personal lives more than anything. Also had a screening first before going into the interview to discuss my current faith/beliefs.", "Interview Questions": "Personal Life questions\r\nAsked about minor finance questions\r\nWas sent home with homework"}, {"date": "1 Jul 2016", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle Pacific University (Bristol, VA) in Feb 2015", "Interview Descriptions": "Brief personal interview with Assistant Store Manager.  This was a positive experience and I was asked questions about my past work in the retail business.  The interviewer asked me about myself and told me about the company and her experience with Belk.  I was told that the hourly pay I requested was approved and the date they wanted me to start.", "Interview Questions": "How much experience have you had in Retail sales?  How much do you expect in hourly pay?  Do you want to work part-time or full-time?  What is your idea of excellent customer service?   Is it OK to be just a little bit late for your scheduled shift?  How do you feel about covering for other departments as needed?  How would you handle a difficult or angry customer?"}, {"date": "5 Feb 2015", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University (Seattle, WA) in Jan 2015", "Interview Descriptions": "First, there is a phone interview with one of the employees who has a role related to the job position. The interview is fairly standard with a lot of behavioral questions, and the interviewer asked about what kind of technical skills I had.", "Interview Questions": "Tell me about yourself"}, {"date": "12 May 2017", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Seattle Pacific University (Seattle, WA) in Sept 2014", "Interview Descriptions": "Filled out an application and had an easy going in person interview with the person in charge of housekeeping and grounds staff. He asked about why I wanted the job and if I have had any previous experience.", "Interview Questions": "Do you have any previous experience?"}, {"date": "5 Aug 2014", "title": "Accounting Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle Pacific University", "Interview Descriptions": "Called HR office to follow up and the person I spoke to appreciated my follow up call and gave me their expected timeline and contact info to follow up again.  Had an interview about two weeks later and then received their decision about two weeks after the interview.  My interview was with the hiring manager and department head.  Interview felt more conversational and friendly compared to my other interviews in which I felt like I was being heavily analyzed.", "Interview Questions": "None of the questions were terribly difficult.  Perhaps the most difficult would be 'what is something that frustrates you/is challenging for you?'"}, {"date": "20 May 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Seattle Pacific University (Seattle, WA) in Sept 2013", "Interview Descriptions": "This job was posted originally through the school. I Contacted the hiring manager directly to a attain an interview. There was a basic skills test and then I was hired on the spot.", "Interview Questions": "Do you see yourself enjoying sitting in an office for long periods of time."}, {"date": "13 May 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Seattle Pacific University (Seattle, WA) in Apr 2013", "Interview Descriptions": "The tutoring position requires a recommendation from a faculty member in the course.  Applications are submitted in hard copy to the front desk of the Center for Learning.  Prospective employees are contacted by phone and/or email to schedule an interview time.  Applicants are interviewed one-on-one by the Coordinator for Learning Services, who oversees all of the tutors.  There is only one interview, and I was notified within the week that I got the job.", "Interview Questions": "There are general questions (i.e. Why do you want this position?  What qualities/strengths would you bring to this position?) and scenario/behavioral-type questions (i.e. Suppose a student comes in with no idea where to begin studying for his/her exam.  How would you approach that student?)."}, {"date": "31 May 2012", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Seattle Pacific University (Seattle, WA) in Jan 2010", "Interview Descriptions": "Interview was easy, clean and positive.", "Interview Questions": "What is cash report?"}]]