[[{"date": "21 Aug 2022", "title": "Clinical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Columbia Care Services", "Interview Descriptions": "Interview questions were given beforehand. Interviewed with 2 people online. Overall good process and thorough questions.  The interview lasted pretty long , over an hour.  People were pleaseant and asked follow up questions when needed.  Having the questions beforehand gave adequate time to prepare.", "Interview Questions": "How do you align with our core values and if there is any difference what is it? "}, {"date": "13 Jun 2022", "title": "Caregiver Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia Care Services (Portland, OR) in Jun 2022", "Interview Descriptions": "Its a phone interview, wait a week and a long online interview. They asked some simple questions during the phone interview. The zoom online meeting was much longer, with more in depth questions towards with people with experience in the social worker fields.\r\n\r\nThey seemed sort of \"stuck up\". My guess its the 1000$ sign up bonus. Which forces you to work for them for one year or you're forced to pay it back. Such an attitude.", "Interview Questions": "Its common caregiver knowledge questions"}, {"date": "22 Aug 2021", "title": "Resident Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia Care Services (Portland, OR) in Aug 2021", "Interview Descriptions": "It was a 3 person interview via zoom.  It lasted about 20 minutes and I liked it. I felt like it gave me an idea of the environment. I think the questions that they asked were pertinent to the job I was interviewing for. They answered my questions pretty throughly.", "Interview Questions": "What did a former manager teach me and why did I value them. "}, {"date": "25 Aug 2021", "title": "Facilities Supervisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Columbia Care Services (Portland, OR) in Feb 2021", "Interview Descriptions": "disorganized at best, lack of education as evidenced by interview questions. 15 people are too many in interview, many were late. Opportunities to ask questions were not given. Wouldn't apply there again.", "Interview Questions": "Based off the \"Columbia Care Way\" which they don't provide a review prior to interview. "}, {"date": "9 Jul 2021", "title": "Supportive Housing Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Columbia Care Services (Medford, OR) in Oct 2020", "Interview Descriptions": "Terrible at best. Never called to let me know about the job until i called them then they wanted to hire me. Lame. Then they wanted me to start 7 days later.", "Interview Questions": "What is my experience working in mental health. "}, {"date": "26 Nov 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Columbia Care Services (Medford, OR) in Dec 2017", "Interview Descriptions": "I was interviewed for the administrative assistant position. I was asked questions about possible client scenario's, such as \"What would you do if?\". I actually had the best interview I have ever  participated in, but was not hired because of their discriminatory practices. The person they hired did not work out and I eventually got the job.", "Interview Questions": "What would you do if a client was upset about taking their medications? How would you handle dealing with an upset family member? "}, {"date": "30 Dec 2021", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Columbia Care Services in Mar 2017", "Interview Descriptions": "I was interviewed in person by just one person.  I was asked a few questions.  The interview was quick, easy and casual.  And I was immediately offered and accepted the job.", "Interview Questions": "What interested you about the position?"}, {"date": "13 Jan 2017", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Columbia Care Services (New York, NY)", "Interview Descriptions": "Lengthy and redundant. Multiple call, email and facetime interactions. The person who interviewed me was not the person who I reported to, and not even in the same discipline.", "Interview Questions": "How I \"handled difficult\" clients. "}, {"date": "16 Dec 2016", "title": "QMHA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Columbia Care Services (Medford, OR) in Aug 2016", "Interview Descriptions": "I met with two of the supervisors who I would be working with. It was a very casual interview based on philosophy of their mission statement and how my own views blended with theirs.", "Interview Questions": "Did I read their treatment philosophy? "}, {"date": "22 Nov 2015", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Columbia Care Services", "Interview Descriptions": "Interview with the big 3 in charge. Applied online then HR reached out to me. Set up an interview with the 3 people on the upper management team. Interview process  was quick and painless.", "Interview Questions": "No questions out of left field. Kept referencing the company philosophy and appeared annoyed that I didn't know all the ins and outs of the company."}], [{"date": "14 Jan 2015", "title": "Assistant Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia Care Services", "Interview Descriptions": "Good thorough interview with a lot of questions. It lasted about an hour in duration. I was interviewed with the current admin and someone from the Medford office. The questions were odd though, not typical of other interviews, but still good. i had to think on my feet, which was challenging.", "Interview Questions": "N/A"}, {"date": "21 Mar 2017", "title": "Residential Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Columbia Care Services (Portland, OR) in Jul 2014", "Interview Descriptions": "Was called to the facility to interview. Interacted with the clients while I waited. Was asked questions about relevant experience and qualifications. Did not have much experience with adults with mental illnesses, but had education and other caregiving experience. Was offered the job (on-call) at the interview, and was given instructions on how to continue with the background check and QMHA verification. It took a long time to get my QMHA verification and background check completed, so I didn't start for 2 months.", "Interview Questions": "What are your qualifications for QMHA?"}, {"date": "21 Feb 2014", "title": "Residential Associate (Counselor) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Columbia Care Services (Portland, OR) in Oct 2013", "Interview Descriptions": "I interviewed at 3 of their facilities in 2013.  Applications are submitted online.  They call you, without any sense of what other facilities are doing, so unlike Cascadia, they take multiple applications.  I had turned down one job because of the very high risk at that facility for assault - the person interviewing me or their work partner had been assaulted that week, but a couple days later, I was called by another facility for an interview.  Interviews are casual, they chat with you.  Usually two people interviewing me.  They are all different, some interviewers talk your ear off, some ask questions.  They want to know what you would do if a client refused meds, or was yelling at you.  They ask you questions as though you'd been doing that exact job for years before. You are told there is little opportunity for advancement, start at eleven, cap out at twelve an hour. They have training, so that plus experience is the good part.  They seem to decide fairly quickly, but I'm not happy with how they did it.  At one facility, they told me they would call me the next day, that they wanted to hire me but they had to sort out the schedule, and then we could confirm the days they'd be offering me.  No response.  I called the only number I had, the co-interviewer's number, they finally called back and said they were no longer associated with the organization.  The second facility offered me the job on the phone the day after the interview, and the day after that, withdrew their job offer.  No explanation, and wouldn't answer my questions about why they were withdrawing the offer.  I always appreciate knowing what the problem is, but all they said was \"at will\" employer.", "Interview Questions": "None, really, other than they want to know what you'd do in this case or that, as though you already were trained and worked there."}, {"date": "22 Mar 2014", "title": "Residential Associate II Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Columbia Care Services in Aug 2011", "Interview Descriptions": "Receive a phone call. Talk about your qualifications. Go in. Talk to one person. Go in again, talk to multiple people. Your interviewer will either hire you on the spot, or take you through a series of questions that presume incompetent staff and situations to deal with said staff's incompetence. If you are going in for a staff position, the questions assume your job is more serious than anyone else really thinks it is, so try to act like a phd even though you will be spending most of your day cleaning up feces. Don't let on that you understand this fact.", "Interview Questions": "These questions speak to the arrogance of the management here. If they cannot use counseling principles when managing their own staff I can only imagine how their residents are treated. I also can only imagine how pervasive of a problem this is through out the whole company."}]]