[[{"date": "3 Jan 2023", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AtlantiCare", "Interview Descriptions": "Very friendly and personal. They really want to make sure all of your questions are answered completely. They really advocate for their employees. I would highly recommend taking the time to listen and apply to a job at Atlanticare if it works for you.", "Interview Questions": "What would yojr previous manager say about you"}, {"date": "24 Aug 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AtlantiCare (Egg Harbor Township, NJ) in May 2022", "Interview Descriptions": "At first, the interview process was great! I was interviewed by a really nice woman and it was going well. I then talked to a group of people who I would be working with and I got interviewed some more. Everything went great. I got a call saying I got the job and they continued the process. I then let them know about some vacations I was planning and some days I would like off. Only one of them I could not accommodate but the rest were up to them to decide on whether I was given those days off or not. After bringing this up, I was told there was a scheduling issue and I was no longer able to have this position. The position offered to me was per diem so that confused me but stuff happens and I accepted it. I was then offered two other job positions which were completely different to the one I applied to. I wanted to look into them some more before making a final decision and I was told to take my time. After two days, I contacted the person I was told to contact and never received a response ever again. All that for no job? I can’t believe it.", "Interview Questions": "3 strengths and weaknesses\nWhat would I bring to the team"}, {"date": "18 Jul 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AtlantiCare", "Interview Descriptions": "There are a total of 2 interviews, 1 with HR, 1 with nursing supervisor. The process is fairly easy. Be confident and honest can help you a lot. Just telling them whatever you think.", "Interview Questions": "Why you choose this company?"}, {"date": "1 May 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AtlantiCare", "Interview Descriptions": "HR called and scheduled an interview. It was very organized and professional. Received an offer through email and everything went smoothly. It was overall a good experience with the interview process.", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "18 Apr 2021", "title": "EMT-B Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AtlantiCare (Dover, DE)", "Interview Descriptions": "Got a call from outsource recruiter \nThen got moved to an in person interview\n25 question BLS test and BLS skills lab. \nTalked about my vast knowledge and where I want to be\nMade it a point to tell them what my professional goals are \nBut it looks to be a bait and switch \nBeing crossed trained to do several things. \nThen told just the one is open. To be alerted the next day that another position is open", "Interview Questions": "Why do you want to work here"}, {"date": "24 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AtlantiCare (Atlantic City, NJ) in Aug 2019", "Interview Descriptions": "First interview was with HR. They made copies of my documents, asked a few interview questions and then I completed a background check form. \r\nThen we discussed potential units I could interview on. They try to place you on a unit that will fit the experience you have. \r\nA week later I interviewed on a unit with the manager. The interview was conversational with a few interview questions thrown in. It was the most enjoyable interview I've had.", "Interview Questions": "How have you ever had conflict with a coworker? "}, {"date": "16 May 2019", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AtlantiCare", "Interview Descriptions": "The typical process with no unusual questions. I interviewed with Human Resources and then two weeks later with unit director.  Both were polite and professional. The whole process took about four weeks.", "Interview Questions": "Confirm credentials"}, {"date": "31 Jan 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AtlantiCare in Feb 2018", "Interview Descriptions": "The interview was great. It was a panel of managers who asked a series of questions related to the job. They gave me a detailed description of the job that I will be doing. Also, let me know about other benefits the job can offer. I enjoyed the interview.", "Interview Questions": "Why Do You Want to Work at This Company? "}, {"date": "16 Feb 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AtlantiCare (Galloway, NJ) in Jan 2018", "Interview Descriptions": "Met with the 2 supervisors for the floor. It was a basic interview where they asked some of the normal questions (strengths, weakness, previous experience in healthcare). They also asked about my interest and plans for the future in regards to education and career goals.", "Interview Questions": "What are things you enjoy/ find difficult about working in a team."}, {"date": "16 Dec 2017", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AtlantiCare (Little Egg Harbor, NJ) in Dec 2017", "Interview Descriptions": "took a quick competency test about 25 questions that were basic paramedic questions. once test was completed, interview with HR who asked a few more question to get to know me. After quick interview HR representative proceeded to tell me about the company and about the job position pay and benefits.", "Interview Questions": "what made you want to get into EMS?"}], [{"date": "6 Sept 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AtlantiCare in Sept 2017", "Interview Descriptions": "I completed the online application. Received a call from HR. It took a few weeks to get an interview scheduled. I interviewed with the HR rep and Program Manager. Then had a 2nd interview at the Teen Center with the Program Manager and Clinician where I performed a presentation made specifically for the interview. Then I spent time with the teens in the common area. I got to observe and speak with them. Shortly thereafter I was hired.", "Interview Questions": "Why do you want to work here?\nHow would you handle a difficult situation?\nHave you worked with adolescents before?\n"}, {"date": "25 Aug 2017", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AtlantiCare (Atlantic City, NJ) in Aug 2017", "Interview Descriptions": "The HR called and performed an interview over the phone. At the end she asked my availability for a face to face interview. An email was sent to confirm a date and to  inform me about the  second interview. It went well.", "Interview Questions": "I was asked to explain a time when I respected someone who had different views from my own. "}, {"date": "14 Feb 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AtlantiCare (Pomona, NJ) in Jul 2017", "Interview Descriptions": "It was one of the best interviews. The manager was so nice and friendly and it was genuinely like a conversation as opposed to a threatening interview. It was very quick as well- about 10 minutes.", "Interview Questions": "What are strengths and weaknesses"}, {"date": "10 Jan 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AtlantiCare (Egg Harbor Township, NJ) in May 2017", "Interview Descriptions": "Surprisingly was treated coldly during initial interview with Nurse Recruiter. Accepted position with a different organization due to this encounter, hopefully they were just having a bad day and not a reflection on their institution as a whole,", "Interview Questions": "Typical interview, nothing worth repeating."}, {"date": "5 Dec 2016", "title": "EMS Flight Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AtlantiCare (Egg Harbor Township, NJ) in Nov 2016", "Interview Descriptions": "Initial interview was with with AtlantiCare Human Resources representative. This was a screening tool for the organization to determine general compatibility between the organizations vision and values and mine. The interview was cordial and professional, lasting approximately one hour.", "Interview Questions": "How do you approach resolving conflicts? Please provide an example of how you did this in the past.  "}, {"date": "23 Feb 2016", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AtlantiCare in Feb 2016", "Interview Descriptions": "Interview process was quick and straightforward. I recognized my interviewer from my previous job. She was very inviting with a warm and upbeat personality. Also very knowledgeable when answering the questions I had for her. Great experience!", "Interview Questions": "What is your greatest strengths?"}, {"date": "23 Jul 2015", "title": "Medical Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AtlantiCare (Pomona, NJ)", "Interview Descriptions": "Submitted application online (no in person or phone calls permitted), returned phone call within one week. Met with manager in an informal manner to discuss experiences and ideas for the department as a whole. Took competency and various required drug tests instantly. Upon passing all requirements, training for position started 2 weeks after.", "Interview Questions": "Where do I see myself in 10 years?"}, {"date": "1 Apr 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at AtlantiCare", "Interview Descriptions": "It was a \"by the book\" panel interview using all the HR greatest hits.  Note to hiring managers:  lose the \"what are your strengths/weaknesses\" questions.  What could be viewed as a strong point in one arena could well be a weakness in another.  Shows a read lack of creativity.", "Interview Questions": "Describe your strengths/weaknesses."}, {"date": "14 Dec 2014", "title": "Practice Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AtlantiCare in Nov 2014", "Interview Descriptions": "First interview was wonderful and met with two Directors.  Feedback was excellent and called for 2nd interview with VP.  Knew as soon as I walked in the room I was not going to get the position.  I still marketed myself but I still did not get the position.  Extremely disappointed in outcome.", "Interview Questions": "I did not have any unexpected questions."}, {"date": "26 Jun 2013", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at AtlantiCare", "Interview Descriptions": "Initial communication was very smooth. They are excellent in keeping in touch.", "Interview Questions": "Can I check this information with your former boss. "}], [{"date": "15 Nov 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AtlantiCare (Atlantic City, NJ) in May 2012", "Interview Descriptions": "Brief phone interview with HR, set up 1:1 interview, first met with human resources representative and discussed my credentials with HR, discussed Magnet status and Malcom Balbridge award, discussed hospital values, met with Unit Manager and discussed experience, met with unit staff and briefly discussed my qualifications, experience and interest in the position, toured unit.", "Interview Questions": "Provide an example of a difficult situation and what you did, discuss a time when you had a conflict with a coworker and how did you resolve it, how do you manage stress, why did you decide to become a nurse, what are your educational gosls."}, {"date": "24 May 2011", "title": "Healthcare Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at AtlantiCare (Atlantic City, NJ) in Apr 2010", "Interview Descriptions": "Not much too it. Here is the job do you want it?", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Jul 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at AtlantiCare (Pomona, NJ) in May 2009", "Interview Descriptions": "22 years ago they just said your were hired I was a PCT at that time", "Interview Questions": "N/A"}, {"date": "4 Jun 2009", "title": "Radiology Transporter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at AtlantiCare (Galloway, NJ) in Nov 2008", "Interview Descriptions": "The interview process went very smoothly. It was very quick and concise. All of the questions were run of the mill interview questions. The human resources department is very friendly and flexible. They help you pick the position that best fits your needs and abilities.", "Interview Questions": "What is your worst quality?"}]]