[[{"date": "7 Feb 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alliant International University", "Interview Descriptions": "Enjoyable down to earth people who ask relevant and thorough questions. After a few rounds, you interview with the dean and then you will be asked to do a Job Talk where you highlight your research or present a teaching session.", "Interview Questions": "Questions about teaching style and student engagement "}, {"date": "13 Jul 2021", "title": "Student Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alliant International University", "Interview Descriptions": "Took a few weeks - one standard phone interview, then zoom interview. Quoted one salary range during phone interview, and offered completely different salary. If I had to do it over, possibly record the conversations had with employees? That's my advice anyway.", "Interview Questions": "Why do you want to work for us?"}, {"date": "2 Jun 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alliant International University in Mar 2021", "Interview Descriptions": "The first call was with the VP of marketing and it seemed to go very well. The second call was a zoom interview with 3 team members. Then I never heard back. Didn't even get a generic denial email.", "Interview Questions": "How would you handle conversations where you have to manage expectations, their perceptions of what you need to do, and then your own professional advice & strategy?”"}, {"date": "27 Aug 2020", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alliant International University (San Diego, CA) in Jun 2020", "Interview Descriptions": "general questions, how you interact with multiple supervisor and fast paced environment. Why you want to work for our university.  Some what professional, nice campus. Phone screen , then invite to meet in person.", "Interview Questions": "1.  Tell us a time when you were told a particular way to process something then your other supervisor said it was incorrect, how did you handle that situation,"}, {"date": "18 Feb 2020", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Alliant International University (San Diego, CA)", "Interview Descriptions": "This entire experience from start to finish was a joke.  I applied online, got a phone interview that went well. I was offered a second in person interview which also went well. The time in between both of these interviews was about 2 weeks, which was long but manageable. I was told a decision would be made that week, and heard nothing. I was then sent an email saying things were busy but I was still a strong candidate. Another week went by.. finally I was offered a final interview, I accepted and it went great. After that I received an email from the head of admissions adding on more job responsibilities and asking for my address ( it is listed on my resume). I gave her the additional info, told her I was okay with the added responsibility of driving 100 miles per week to Irvine (generous on my part).  After that I heard nothing.. they didn't even have the courtesy to let me know they had gone in a different direction. The saddest thing, is that I was overqualified for this position, and an Alumni of Alliant. For them to treat me like this, speaks volumes for the Admissions office, and the entire school in general. It is a train wreck run by people who lack basic courtesy and communication. Run while you can!", "Interview Questions": "\"Are you okay with an additional responsibility of driving to Irvine once a week for our campus presentations\""}, {"date": "21 Nov 2019", "title": "Campus Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alliant International University (Fresno, CA) in Nov 2019", "Interview Descriptions": "Initial interview is a phone screening conducted by a talent acquisition recruiter.  The recruiter was kind and sincere in the questions asked.   The screening lasted about 45 minutes in total.", "Interview Questions": "What was your primary duty/responsibility at your last job."}, {"date": "30 Sept 2019", "title": "Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Alliant International University (Alhambra, IL) in Aug 2019", "Interview Descriptions": "Phone interview consistend of several questions and was offered an in-person interview. The in-person interview was supposed to be 20 minutes long but lasted over an hour. The interviewees had high expectations for the person filling this role.", "Interview Questions": "Are you able to connect with prospect students? "}, {"date": "29 Mar 2019", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alliant International University", "Interview Descriptions": "I found the interactions with staff was very professional, warm, and friendly. I was  greeted and taken back to interview right away, and environment was pleasant too. The location is also nice in San Diego, CA", "Interview Questions": "N/A"}, {"date": "31 Jul 2017", "title": "Helpdesk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Alliant International University (San Diego, CA)", "Interview Descriptions": "You will have only one interview and they were to nice and friendly. Be dress up and they need to know calm you are. The job is too easy and  they will train you.", "Interview Questions": "How do you handle the angry customer?"}, {"date": "7 Sept 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alliant International University", "Interview Descriptions": "I interviewed with both the Director and Assistant Director of Admissions, and they alternated between each other when asking questions. Informed me that there are 1st and 2nd round interviews beore making a final decision. Very welcoming and friendly", "Interview Questions": "What three adjectives would your co-workers use to describe you"}], [{"date": "21 Oct 2016", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alliant International University (San Francisco, CA) in Aug 2016", "Interview Descriptions": "Interview was based mainly on questions about job-related tasks.  Whether I had experience doing the functions the position required, and how I would handle certain situations.  The interview would likely be average difficulty for someone with experience in administrative positions.  The interviewers were all very nice and easy to speak with.", "Interview Questions": "Have you ever done research with online polls?"}, {"date": "18 Dec 2014", "title": "Academic and Administrative Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alliant International University", "Interview Descriptions": "Questions were basic behavior type and some organizational - how to do handle multiple tasks? Finding a site with sample questions works best for this type of position. They are most concerned with whether you can handle multiple tasks with multiple deadlines and if you will be an agreeable person to work with or not.", "Interview Questions": "No difficult questions."}, {"date": "28 Aug 2013", "title": "Academic Affairs Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Alliant International University (San Francisco, CA)", "Interview Descriptions": "Approximately 2-3 interviews depending on staff/faculty availability. Once everyone has given their input, if all is positive you'll get hired.", "Interview Questions": "There aren't really any difficult questions, but it may be intimidating or awkward to some to sit in a room staring into faces that look like they'd rather be anywhere else but interviewing you. The entire organization is full of disgruntled employees."}, {"date": "29 Mar 2013", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alliant International University", "Interview Descriptions": "The interview was at the campus and involved a typical interview followed by a weird scenario interview. The scenario part involved listening to a narration and taking notes. There were 2-3 scenarios. The 2 interviewers then collected the notes. After this, I was taken to a 3rd interview who reviewed me based on fit. She wanted to see if my personality fit with the staff.", "Interview Questions": "Be ready to listen and write."}, {"date": "6 Mar 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alliant International University (San Francisco, CA) in Feb 2013", "Interview Descriptions": "A wonderful session where I was asked questions and then asked to teach a part of a course. I found the panel interviewing me kind, helpful, interested in my presentation, and full of information.", "Interview Questions": "Why are you interested. What is your experience. Show us how you teach."}, {"date": "26 Oct 2015", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Alliant International University (San Diego, CA) in Jul 2012", "Interview Descriptions": "Was already an employee at Alliant and working in the same department.  I was asked to interview for the position and had to interview with people I knew.  I suppose that helped me in the end but it made me a little nervous.", "Interview Questions": "Asked for examples with handling difficult people and was I comfortable working with program directors."}, {"date": "17 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Alliant International University (Fresno, CA) in Aug 2010", "Interview Descriptions": "I was approached by staff for the position. There was one brief interview and I was hired.", "Interview Questions": "N/A"}, {"date": "9 Aug 2012", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Alliant International University (San Diego, CA) in Sept 2008", "Interview Descriptions": "resume, presentations, interviews", "Interview Questions": "N/A"}]]