[[{"date": "7 Jul 2023", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Laguna Hills, CA)", "Interview Descriptions": "I first received a phone call to schedule an in person interview. The interview was a panel interview that lasted 1 hour. There were a list of of situational/behavioral questions that they went through followed by 2 clinical questions and 2 video clinical case studies.", "Interview Questions": "Describe a time when you had to think on your feet and switch gears. Describe a time when you had a difficult patient."}, {"date": "22 Jun 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MemorialCare (Long Beach, CA)", "Interview Descriptions": "The interview process is professional and I appreciated the help during the process. They email you and keep you up to date with all the information needed. Anyways do not worry and be patient.", "Interview Questions": "They asked what type of relative experience I have."}, {"date": "18 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MemorialCare (Long Beach, CA)", "Interview Descriptions": "Applied via organization's career page, director of the department of choice reached out via email and arranged a 30 minute in-person interview. Heard back from the director about a week later and written offer was sent by HR.", "Interview Questions": "Tell me about your self, why nursing, why this organization, why this department, strengths and weaknesses, situational questions"}, {"date": "9 Jun 2023", "title": "RN New Grad Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MemorialCare (Long Beach, CA)", "Interview Descriptions": "15-20 minute interview with director and manager. Both were welcoming and made it clear that the interview was informal. They were also on time. Received an offer a few days later by phone and email.", "Interview Questions": "Tell me about yourself Strengths and weakness Name a QI measure experienced during clinical"}, {"date": "1 Feb 2023", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MemorialCare (Los Angeles, CA) in Feb 2023", "Interview Descriptions": "I applied to the new graduate RN program for the float unit on their website using the applicant portal and was contacted by email a few weeks later for an interview. I was emailed on Monday about an interview that would take place on Wednesday. I was interviewed with the person who emailed me and two other unit managers.", "Interview Questions": "What would my preceptor say is my biggest strength?"}, {"date": "27 Jan 2023", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Laidback interview process, recover phone call then in person interview, more of a conversation. They asked about experience, scenarios, how would you handle a difficult patient. Background check , drug testing, all that stuff .", "Interview Questions": "Tell me about your experience"}, {"date": "1 Feb 2023", "title": "Registered Nurse, Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Long Beach, CA) in Jan 2023", "Interview Descriptions": "Super easy. I received a request for an interview a day after I applied and just met the nursing manager. The interview was ~ 1 hr long. Just asked general questions about why I wanted to work there and what skills I brought to the table. I heard back from them after a week", "Interview Questions": "patient scenarios about prioritization and appropriate interventions"}, {"date": "7 Oct 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Expect scenario based questions, I was questioned on priorities, stroke interventions, and DKA. Describe yourself, why Memorial Care, why you want to be a nurse, describe a time you had a difficult patient.", "Interview Questions": "N/A"}], [{"date": "7 Oct 2022", "title": "RN New Grad Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MemorialCare in Oct 2022", "Interview Descriptions": "Very lax. Panel interview. About 20 min for the whole thing. They ask you simple questions and the panel was very nice. They mostly focused on clinicals, which department you did your preceptorship in and why you wanted to work at LBMC", "Interview Questions": "If we called your preceptor, what would they say about you?"}, {"date": "10 Apr 2023", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MemorialCare in Sept 2022", "Interview Descriptions": "The whole process was about two weeks long. The interview itself was extremely easy and the interviewer did most of the talking. I was given a tour of the cafeteria and kitchen.", "Interview Questions": "I was asked about my experience and availability."}, {"date": "16 Aug 2022", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Panel review (about 4 people).  Situational questions.  Personality questions.  Know your medications and side effects of it, and how to manage ventilator settings given an ABG.  Staff is nice and friendly, very personable.", "Interview Questions": "Why should we hire you?"}, {"date": "16 Aug 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Application online was easy with long questionnaire at the end. Called to interview 2 weeks after submission of application.  in person interview with staff RNs. Received no  follow up after interview.", "Interview Questions": "Tell me about strengths and weaknesses"}, {"date": "18 Jun 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MemorialCare (Laguna Hills, CA) in Jun 2022", "Interview Descriptions": "I applied online when the next new grad residencies became available. I heard back about scheduling an interview within 1-2 weeks. I met with two nursing directors in a conference room and the whole process took about an hour. It was the hardest nursing interview I’ve had so far as a new grad. After the usual questions to find out more about your nursing journey and gauge your personality and behavior, I was given a priority question, then had two watch two video clips. After the short clip I had to answer questions about diagnosis, interventions, expected orders, and expected outcomes. I also took a tour of the unit I was applying for. I was told it would take about a month to find out if I was selected for the new grad residency or not.", "Interview Questions": "Tell us about yourself and your nursing journey "}, {"date": "23 Apr 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MemorialCare in Feb 2022", "Interview Descriptions": "Applied and was called within the same week to set up interview date and time\nConsisted of a two part interview process with manager and directors\nPosition was offered to me two weeks later", "Interview Questions": "How familiar are you with Microsoft Products?"}, {"date": "24 Jan 2022", "title": "ICU Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare", "Interview Descriptions": "The interview was via zoom, with 3 interviewers taking turns asking questions. It started with a brief introduction of the interviewers and the program, a self-introduction, then a series of behavioral questions.", "Interview Questions": "Tell me a time you went above and beyond for a patient."}, {"date": "21 Feb 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MemorialCare (Long Beach, CA) in Jan 2022", "Interview Descriptions": "Interview was about 40 min. Consisted of 10 questions regarding strengths, weaknesses, and why we want to work on that specific field. Scenario questions were also asked throughout the interview.", "Interview Questions": "What are your strengths, what are your weakness, why should we choose you to work for our units, how do handle high pressure situations. "}, {"date": "1 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "The interview only takes about 10 to 15 minutes. Simple questions, not tricky. Managers are really nice. 2 people interviewed me. About five questions. I received an offer one week later", "Interview Questions": "what is your strength and weakness"}, {"date": "9 Nov 2021", "title": "New Graduate RN - Mother/Baby Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Long Beach, CA) in Oct 2021", "Interview Descriptions": "The unit manager and nurse educator were very nice and welcoming. The interview was very relaxed and the interviewers were very good at making me feel comfortable. Overall the questions they asked were your typical new grad nurse interview questions", "Interview Questions": "what is your learning style?"}], [{"date": "28 Jul 2021", "title": "Front Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at MemorialCare", "Interview Descriptions": "The interview process went very smooth. The questions that were asked, were easy and fair. The interviewer was attentive and answered all of my questions at the end. Overall an easy interview.", "Interview Questions": "Describe how would you handle a conflict with a coworker?"}, {"date": "12 Jul 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MemorialCare (Long Beach, CA) in Jul 2021", "Interview Descriptions": "After you submit your application you will be asked to meet for an interview. Mine was on zoom during COVID. The interview on zoom was still with a panel of individuals that are in charge of the unit you are applying for. The zoom interview was 30 minutes long and several questions are asked in that time frame.", "Interview Questions": "Tell us about a time you advocated for a patient or yourself. "}, {"date": "4 Jul 2021", "title": "New Grad Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MemorialCare in Jul 2021", "Interview Descriptions": "I haven’t finished the interview process  yet. However, I will say that what has stood out to me as an applicant is receiving a direct telephone call for my interview. Most new grad programs send you a generic e-mail but not with Long Beach Memorial.", "Interview Questions": "Would you be interested in interviewing?"}, {"date": "27 Mar 2022", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MemorialCare in Jun 2021", "Interview Descriptions": "It was very casual and friendly. They asked a few situational question and your career goals. It was overall around 45 mins to 1 hrs.  They gave a small tour around the pharmacy and a brief summary of each staffing shifts", "Interview Questions": "what are your long term goal? "}, {"date": "24 May 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Asked behavioral questions and had a clinical scenario. Had questions such as why nursing and why this specialty. I had a panel interview with managers of the departments from acute care services.", "Interview Questions": "Why did you choose nursing?"}, {"date": "8 May 2021", "title": "Pharmacy Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Interview with the director and pharmacy technician for about an hour, with about 10 questions. Friendly interview and just wanted to get to know you to see if you were a good fit for the position.", "Interview Questions": "Tell me about yourself? Greatest accomplishment?"}, {"date": "25 Jun 2021", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MemorialCare in Mar 2021", "Interview Descriptions": "The interview process was pretty normal for being during Covid. I had a phone screen with the recruiter, two zoom interviews with the HR team and an in person final interview.", "Interview Questions": "Why do you want to work in Healthcare"}, {"date": "24 Sept 2021", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MemorialCare (Long Beach, CA) in Mar 2021", "Interview Descriptions": "The interview process was brief and easy going. Although I did not get the job.  The interview was a good experience and helped me prepare for the future employment opportunities.", "Interview Questions": "What situation prompted you to apply here?"}, {"date": "16 Feb 2022", "title": "Market Specialist, Community Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MemorialCare (Fountain Valley, CA) in Jan 2021", "Interview Descriptions": "Pleasantly expedited process with a hiring manager who did the phone screen. Received an offer following a second interview. Very efficient and strong communication throughout the departments. If offered, consider opting for a reference sheet instead of reference surveys if you have a truncated timeline.", "Interview Questions": "What do you do in your current role?\r\nWhy MemorialCare? "}, {"date": "16 Nov 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Received a call about scheduling interview, upon arriving I was taken into a room where it was a  interview panel set up where I answered questions from a group of staff members", "Interview Questions": "tell me about yourself, strengths, weakness, mistakes, why you want to work here"}], [{"date": "7 Nov 2020", "title": "New Grad RN Float Pool Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Long Beach, CA) in Nov 2020", "Interview Descriptions": "I applied online through the Memorial Care careers website. After 3 weeks, I received an email on a Wednesday from the hiring manager asking if I can come for a scheduled interview on Friday that same week.\n\nMine was a one-on-one interview and was asked about myself along with a few other questions; how committed will I be to this organization, why I chose this hospital, why I wanted to be a nurse, etc. I was also asked to relax a bit in the beginning cause I guess I looked pretty nervous haha (I thought I was quite calm and collected but maybe not).", "Interview Questions": "Describe a time when you had a patient who had a quick change of status and what did you do?"}, {"date": "25 Oct 2020", "title": "Front Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Long Beach, CA) in Aug 2020", "Interview Descriptions": "They will do a phone interview first and then an in-person interview. After an in-person interview, the recruiter from HR will reach out to you to continue the process and extend an offer.", "Interview Questions": "How do you deal with difficult customers or patients?"}, {"date": "22 Oct 2020", "title": "Float Pool Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Long Beach, CA) in Jul 2020", "Interview Descriptions": "One-to-one interview with the float unit manager. Was asked general questions regarding nursing school and clinical rotation experience. The manager was very nice and friendly, and she made the interview feel more like a casual conversation.", "Interview Questions": "Tell me an incident that occurred during your clinicals, and what you did or could've done to solve it."}, {"date": "9 Sept 2020", "title": "Registered Nurse New Grad Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Laguna, Los Angeles, CA) in May 2020", "Interview Descriptions": "Online interview via webex being I am an external candidate from out of state. Two to three individuals asking behavioral based questions. Nerves kicked in at first but then began to relax as the interview process went on", "Interview Questions": "Tell us about yourself. Why do you fit this position"}, {"date": "12 Feb 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MemorialCare", "Interview Descriptions": "Submitted an application, received a call back 1 week later to schedule an interview, interview lasted about 1 hour. About 12 question interview, with a case scenario question at the end in which you are asked the medical diagnosis, nursing interventions, expected labs, and expected outcomes.", "Interview Questions": "Tell me about yourself."}, {"date": "31 Jan 2020", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MemorialCare", "Interview Descriptions": "Took a few weeks to hear back. Was told to go in for interview. Was fairly quick. Asked about resume/experience. Mostly what previous experience you have that can relate to the position. Overall, average in difficulty.", "Interview Questions": "Do you have any experience as a receptionist?"}, {"date": "4 Feb 2020", "title": "Healthcare Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MemorialCare (Fountain Valley, CA) in Jan 2020", "Interview Descriptions": "Applied online, two days later I had an in-person interview.  The in-person interview was a discussion between myself and the manager about what he was looking for in a candidate and what he wanted the position to do.", "Interview Questions": "Asked what my previous responsibilities were, what type of work I did, how well I could code"}, {"date": "10 Jan 2020", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MemorialCare (Long Beach, CA) in Nov 2019", "Interview Descriptions": "Applied online- less than a month later, I got an email to schedule the interview. Arrived and checked-in the front desk, they told me the location of the interview, arrived early and they took me in. Was interviewed by one of the hiring managers and one floor nurse.", "Interview Questions": "Tell us about you?"}, {"date": "2 Dec 2019", "title": "Healthcare Analytics Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MemorialCare (Fountain Valley, CA) in Nov 2019", "Interview Descriptions": "The interview itself was fine. It was an hour long panel interview with what I assume was the entire department (several people). The Director said I'd hear back early the following week but no one ever contacted me. When I followed up with the person that scheduled the interview she replied that she had no idea on the status of my application and that she only schedules the interviews. She did, however, emphasize that I would hear back either way. Well it's been a few weeks now and I still haven't heard anything. Very unprofessional.", "Interview Questions": "Typical stuff: how do you prioritize deadlines, how do you deal with difficult customers, some very easy technical questions, etc. "}, {"date": "14 Oct 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "It was really easy and the hiring staff made it easy to get a job. Interview process was short and found out right away.  The manager of the unit showed me around the hospital and everyone was nice.", "Interview Questions": "Name a time you went above and beyond for a patient?"}], [{"date": "13 Aug 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MemorialCare (Fountain Valley, CA)", "Interview Descriptions": "I had two separate interviews on different days. First with the Charge Nurse then with the interim DON. They were friendly and made me feel comfortable. Questions were fairly average. They don't pressure you, they listen and very encouraging.", "Interview Questions": "What is the most common arrhythmia you know? "}, {"date": "28 Aug 2019", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MemorialCare (Laguna, Los Angeles, CA) in Aug 2019", "Interview Descriptions": "Well over an hour in a small office answering questions about how I would respond to patients and other employees,  then given a scenario to work out a  nursing plan of  care. Walked around the unit, got the feeling that I was doomed already from not being young and pretty.", "Interview Questions": "Why do I want to leave my current."}, {"date": "18 Oct 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at MemorialCare (Laguna Hills, CA) in May 2019", "Interview Descriptions": "A little intimidating. There were three  members of staff are there to ask you questions, you were in a room all by yourself. They took their turn to ask you a questions, they did not have a very friendly personna, however very professional. I was very nervous.", "Interview Questions": "What are the positions for a double contrast Barium enema? "}, {"date": "10 May 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MemorialCare in Apr 2019", "Interview Descriptions": "I interviewed on a Tuesday at 12p. Got the offer within 24 hours, Wednesday at 10a. Accepted the offer with a little negotiating within 48 hours. Start date  in 3 weeks.", "Interview Questions": "Tell me about yourself? Do you have experience with Medi-Cal?"}, {"date": "1 Apr 2020", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MemorialCare (Long Beach, CA) in Mar 2019", "Interview Descriptions": "Interviewed with two managers department manager and unit manager. I heard back in about three to four weeks via phone call. I accepted job offer, standard protocol for a new job background check, physical, etc.", "Interview Questions": "Why do you want to work in patient care?"}, {"date": "6 Feb 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MemorialCare", "Interview Descriptions": "Interview 1 was 3 managers. Quick and east process. Very friendly. Interview 2 was 2 panel interviews, 5 nurses per panel. They had a short list of questions for the first interview and got back to me within 5 days.", "Interview Questions": "Tell me about your strengths?"}, {"date": "5 Nov 2018", "title": "Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MemorialCare (Fountain Valley, Orange, CA)", "Interview Descriptions": "Too long, four months. Horrible experience and very disorganized communication. It was a waste of my time and even worse after the 1st onsite meeting and several cancellations on their part for the next round, never contacted me about status; just ghosted in the middle of the process. I was actually warned by a former employee not to waste my time. Very unprofessional experience with the recruitment folks and the people I was actually interested in working with at that company. I have never experienced awful treatment and a lack of respect in the interview process.", "Interview Questions": "They were more interested in where I worked at the time."}, {"date": "22 Sept 2021", "title": "Executive Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MemorialCare (Long Beach, CA) in Sept 2018", "Interview Descriptions": "I applied online and received an email to interview for the position.  It took over a month before I started.  They only start employees on a Mondays 2x per month.", "Interview Questions": "What advanced computer skills do you possess that would be beneficial to this position? "}, {"date": "13 Jul 2018", "title": "Clinical Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at MemorialCare", "Interview Descriptions": "Poor interview process. Zero communication and follow up despite email. Not a fan of companies who have no respect for applicants’ time and hiring managers playing ghost. Highly recommend Memorial Care to learn from other companies that is more responsive and professional when dealing with applicants.", "Interview Questions": "Interviewer works in healthcare but is oblivious to industry terms."}, {"date": "9 Jun 2018", "title": "Interventional Radiology Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MemorialCare (Long Beach, CA)", "Interview Descriptions": "I was called in to answer a few questions. I was told that it was not an interview but the type of questions asked seemed like it was. Also, I was told that I would have an answer by the end of the week.", "Interview Questions": "What is your availability?"}], [{"date": "16 Jan 2019", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MemorialCare in Jun 2018", "Interview Descriptions": "Called in for in-person interview process. Didn't hear back for a month then called in for a phone interview. They were really friendly. Two marketing coordinators interviewed me for the in-person interview process. Then another one called me.", "Interview Questions": "Tell me about yourself?"}, {"date": "19 Jan 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MemorialCare in Apr 2018", "Interview Descriptions": "It was very informal with two senior managers. One pre-interview over the phone with one of those individuals. I was a referral from a company employee. I was coming from within healthcare, a facility close to the location I was applying at, and while I thought the interview went well, they passed on me and went with an MBA who didn't have healthcare experience but because of the title. I went and got an MBA after that.", "Interview Questions": "Applicable experience, growth within my current role"}, {"date": "18 Dec 2017", "title": "Critical Care RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at MemorialCare in Dec 2017", "Interview Descriptions": "Phone interview with detail questions like patient handling and emergent cases in ICU area takes about 1 hour. Then meet with ICU manager and I got an offer very shortly.", "Interview Questions": "All in test-book  e.g. what will you do if your patient heart rate is 160 sinus."}, {"date": "19 Oct 2017", "title": "Paramed RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MemorialCare (New York, NY)", "Interview Descriptions": "I was contacted a few days after I applied via phone call. I made the interview for the following Monday and met with the nursing manager and facility director. Overall I felt the interview went well and the questions were fair. They said I would hear back either way the following week but I haven’t heard yet and it has been 2 weeks.", "Interview Questions": "What would your family say is a quality you need to work on"}, {"date": "15 Oct 2017", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MemorialCare", "Interview Descriptions": "Called in for an interview, and I got asked basic normal interview questions such as what is greatest strengths and weaknesses. I also got asked customer service questions, and then followed by case scenarios.", "Interview Questions": "Who do you contanct when two employees are arguing?"}, {"date": "24 Jun 2021", "title": "Intake Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MemorialCare (Fountain Valley, CA) in Oct 2017", "Interview Descriptions": "Interview was straightforward, I met with the hiring manager who I would be working directly with in the office and she was the one who conducted the interview. easy questions and very pleasant interview process.", "Interview Questions": "What is a strength of yours?"}, {"date": "17 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MemorialCare", "Interview Descriptions": "Transitioned from travel nursing to staff . I met with department manager as the time approached for renewing my contract. They offered me a chance to be hired on as they were not renewing travel contracts at that time.", "Interview Questions": "How many hours a week I'd like to work"}, {"date": "16 Nov 2018", "title": "Front Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at MemorialCare (Long Beach, CA) in Jun 2017", "Interview Descriptions": "Applied online  with my resume, as well as answered a series of questions that you had to do before submitting your application. Then, they called me about 3 weeks later for an interview to come in. The whole process from applying to being hired took a little more than a month.", "Interview Questions": "If theres a person checking in for a doctors appt, a lady that has a screaming baby and the phone is ringing, what order would you check them in at?"}, {"date": "15 May 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MemorialCare", "Interview Descriptions": "I was interviewed by the charge nurse. This was my first interview ever and I was pretty nervous walking in, but she was very nice and made me feel comfortable. She just asked me a few questions about myself and then asked a few scenario questions and then explained some rules they had in place and asked if I am ok with those rules if I were to be hired", "Interview Questions": "tell me about yourself"}, {"date": "7 Feb 2017", "title": "New Grad RN Emergency Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MemorialCare (Long Beach, CA) in Jan 2017", "Interview Descriptions": "Submitted my application online in December 2016. Received a call from the Director of Clinical Operations and scheduled an interview for January 2016. Comfortable environment and questions were geared towards a New Grad RN. \r\n\r\nAfter interview, I was informed that the hospital does contract with Long Beach State & Cal State Long Beach. From what I understand, Long Beach Memorial awards scholarships to multiple nursing students who declare ED nursing as their specialty. In return, the students enter into the New Grad ER RN program and work for the hospital for 2 years after graduating and passing the NCLEX. Therefore, as an outside New Grad RN, it is extremely hard to get into the program unless you are one of those Long Beach State/Cal State Long Beach students or you have a STRONG connection to the hospital (relatives, etc). Best of luck to those applying!", "Interview Questions": "What made you want to become a nurse?"}], [{"date": "16 Oct 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MemorialCare (Long Beach, CA)", "Interview Descriptions": "Went good...but it is taking forever to hear back from them\r\nHad 1 on one then a group panel..went really well \r\nI don't have anything else to say just that the process took forever", "Interview Questions": "N/A"}, {"date": "16 Jan 2018", "title": "Certified Clinical Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MemorialCare (Laguna Hills, CA) in Sept 2016", "Interview Descriptions": "applied online, took them 2-3 weeks to reply via email and then the phone call. I had 2 interviews. Classic experience questions. First with nurse and manager, second with manager and provider.", "Interview Questions": "Previous job experience and the reason for leaving."}, {"date": "23 Aug 2016", "title": "Registered Nurse, Clinical II/Telemetry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at MemorialCare (Laguna Hills, CA)", "Interview Descriptions": "I was interviewed by the former director of Telemetry. The interview was semi-formal and the director was very nice, friendly, and made me very comfortable. Questions were easy since I already have experience in the department I was interested in. In fact, I was hired on the spot and started shortly after that.", "Interview Questions": "Do you know what a Core Measure is?"}, {"date": "6 Jul 2017", "title": "Contract Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at MemorialCare (Fountain Valley, CA) in Aug 2016", "Interview Descriptions": "The interview took place in a very smooth and relaxed environment. I was a little bit nervous at the beginning but then it faded.  It was about 20 minutes.", "Interview Questions": "Experience, overall skills"}, {"date": "14 Aug 2016", "title": "Out Patient Admistration Assitance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at MemorialCare (Long Beach, CA) in Aug 2016", "Interview Descriptions": "It was very detailed orientated. They ask a lot of questions about my past experience and why I chose to apply for Memorial care Health. \r\nHow did I hear about the position I applied for.", "Interview Questions": "my past experience and some of my good and bad experiences with the companies."}, {"date": "1 Aug 2016", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Applied online and received a call for interview after week. I was scheduled with hiring manager for interview.  Interview went well and felt at ease with hiring manager. Clean environment and staff were very professional.", "Interview Questions": "How would you mitigate disputes between staff?"}, {"date": "19 Jun 2016", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at MemorialCare (Los Angeles, CA)", "Interview Descriptions": "I do not remember a lot of things because the interview happened many moons ago. I was working on a contractual basis foa a staffing agency and I guess they really liked my performance so I did not have to go to a lot of screening process.", "Interview Questions": "whether i would like to remain temporary or a permanent employee"}, {"date": "27 May 2020", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Long Beach, CA) in Feb 2016", "Interview Descriptions": "interviewed with the manager, questions were mostly about previous work experience. the manager gave me a tour of the pharmacy and discussed with me what the shift and schedule would be like.", "Interview Questions": "What were your responsibilities or duties at previous work place?"}, {"date": "26 Jan 2016", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MemorialCare", "Interview Descriptions": "it was more of a difficult interview. It was very long and took about 2 1/2 hours. There were a lot of difficult questions so definitely prepare for behavioral and clinical type questions. Also had a clinical scenario which I had to discuss and determine medical diagnoses and treatment plans.", "Interview Questions": "Describe a situation with a demanding patient/family."}, {"date": "10 Nov 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at MemorialCare (Laguna Hills, CA) in Nov 2015", "Interview Descriptions": "Very relaxed, personable.  Interviewed with two supervisors.  They were very nice, explained a lot about the position.  I was escorted to a conference room by a HR person, she was very personable. She explained a little about the position while we waited for the two supervisors I would be interviewing with.  They were very nice, easy to talk to, and I felt very at ease during the interview process.  They explained more about the position, and my qualifications.  They said I would be contacted in the next couple days.", "Interview Questions": "Do you have experience in this area applying for?"}], [{"date": "23 Oct 2015", "title": "Manager Regulatory Compliance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MemorialCare (Long Beach, CA) in Oct 2015", "Interview Descriptions": "The interview process was informal. Hiring directors did not take the interview serious. They could not provide information about hiring process, dates nor next steps. I was thanked for coming to the interview. I think the interview was only scheduled to say that interviewed candidates outside the organization. This organization is great with succession planning.", "Interview Questions": "What do you know about the position?"}, {"date": "1 Jun 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MemorialCare (Long Beach, CA) in Oct 2015", "Interview Descriptions": "I applied online and was contacted within the next week. The marketing representatives contact you through email to see if you're still interested in the position and to set up a time to meet. The in-person interview consists of about a 30 minute Q&A with two marketing representatives and after, a writing test to gauge your skills. Don't worry about the writing test because they just want to see if you have general knowledge of AP Style and if you have general knowledge of the social media writing style.", "Interview Questions": "What did you learn in the classroom that pertains to our role?"}, {"date": "2 Oct 2015", "title": "Corporate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at MemorialCare (Fountain Valley, CA) in Sept 2015", "Interview Descriptions": "I arrived 15 minutes early to get settled before the interview.  The receptionist was very pleasant.  The Manager came out to greet me right on time.  She was very friendly and professional.  The interview was conversation-like with me giving details about my background and work experience.  She then described the job, the company and the expectations.  I asked questions throughout the interview, and I felt this is a good company to work for based on the professionalism of my interviewer (compared to other nightmare interview stories I've read).\r\n\r\nStill waiting to hear back...", "Interview Questions": "Tell me about your background."}, {"date": "23 May 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MemorialCare (Fountain Valley, CA) in Aug 2015", "Interview Descriptions": "As usual, be prepared when you come to the interview. You will be overwhelmed with the amount of people who participate in the interview process even though it is an internship program. It is important to be confident, smile and believe in yourself. You might get to meet all the managers or team leads, and they are there to evaluate your performance. Don't be too vague. Get to your point and demonstrate your technical skills.", "Interview Questions": "You background experience. Why healthcare if you are coming from a different background."}, {"date": "27 Sept 2015", "title": "Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at MemorialCare (Laguna Hills, CA) in May 2015", "Interview Descriptions": "you have a interview with the hiring manager, then background checks and drug tested a few days later, hr calls you with the job offer if you passed to offer you the position. you can haggle then about how much  you will be paid. your first day will be a new hire orientation. bring a jacket its cold!! it takes 6 to 7 hours bring caffeine its boring. you get your schedule after the orientation.", "Interview Questions": "where do you see yourself in the next five years"}, {"date": "12 Sept 2016", "title": "Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MemorialCare (Long Beach, CA) in May 2015", "Interview Descriptions": "Received a phone call from a manager who received my application online, and she said she was interested in my experience and wanted to set an interview. I was interviewed with two managers, they asked basic questions of my experience and qualifications. It was easy and simple and they were very pleasant.", "Interview Questions": "They asked if I could see myself staying with the company or working in this field long term."}, {"date": "20 May 2015", "title": "Med-Surg/Tele Registered Nurse (RN) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at MemorialCare (Long Beach, CA) in Mar 2015", "Interview Descriptions": "I was interviewed by the Unit Director, then he brought in his assistant and another RN to also interview me at the same time. They were all nice and professional.", "Interview Questions": "Scenario Question: Which of these 4 patients would you see first and why? Then, if this (they would come up with an emergency or change in status) happened with this patient, what action would you take (They asked this with all 4 patient scenarios)?"}, {"date": "21 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MemorialCare (Los Angeles, CA) in Mar 2015", "Interview Descriptions": "completed an applied online; received  call for an in person interview with Nurse Recruiter, tour, meet and greet unit managers and other employees; informed someone will follow up; received and accepted position", "Interview Questions": "Why would I like to work with Memorial"}, {"date": "30 Jan 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 9 months. I interviewed at MemorialCare", "Interview Descriptions": "Lack Luster, very dated process with poor communcation throughout the entire process.  Recruitment was not very versed in using their Tracking System and fall victim to the \"Black Hole\" of internet application.  Recruitment is not very proactive and often do not have any relationship with the Hiring Managers they are responsible for sourcing and filling the positions.", "Interview Questions": "There was a technical question about a patient's clinical presentation that was not clear, neither the interviewer or interviewee were clear on what it meant and how to properly treat."}, {"date": "3 Nov 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at MemorialCare (Long Beach, CA) in Feb 2015", "Interview Descriptions": "/very easy. basic questions-Challenges in nursing? Weaknesses? wanting to grow? I spoke to HR before the unit manager and she prepped me for the interview. Just be honest. Tell them you want to grow on the unit and become a leader .", "Interview Questions": "What are your challenges in nursing?"}], [{"date": "17 Jan 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MemorialCare", "Interview Descriptions": "Basic behavioral questions about yourself. Tell me about yourself, where do you see yourself in five years, why here, what can you contribute (or why should we pick you), what do you like to do for fun,  etc.", "Interview Questions": "N/A"}, {"date": "13 Sept 2015", "title": "RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MemorialCare (Laguna Hills, CA) in Jan 2015", "Interview Descriptions": "Not a panel interview. Manager invites you to her office. Manager asks questions about your resume. She has a set of questions that she needs to asks and writes down your answers. Afterwards, she gives you tour of unit. Very relaxed atmosphere.", "Interview Questions": "Scenario: Patient with pneumonia. How will you care for that patient?"}, {"date": "8 Oct 2014", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MemorialCare", "Interview Descriptions": "Interview was easy, getting off the waiting list is what took a long time for me. There is a group interview/orientation if you do make it, along with a background check, tb tests, and meeting with the coordinator.", "Interview Questions": "Why do you want to volunteer here."}, {"date": "16 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MemorialCare (Long Beach, CA) in Jul 2014", "Interview Descriptions": "Meet with HR in a room across from hospital. Must get interview by emailing certain members on the hiring team. Definitely try to look good. Be prepared and know what magnet means.", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Jun 2014", "title": "Discharge Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MemorialCare (Long Beach, CA)", "Interview Descriptions": "Hiring process was acceptable.  A check of my education and experience was made, along with a background check.  There was no internet yet when I interviewed for my position, as it was listed in the employment opportunities section of the Los Angeles Times.", "Interview Questions": "LIst medical experience of which I had none before my employment at Long Beach Memorial Medical Center."}, {"date": "6 Feb 2017", "title": "Business Intelligence Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MemorialCare (Fountain Valley, CA) in Jun 2014", "Interview Descriptions": "The first interview was over the phone. The Second interview was with management. The Third interview with staff (this means you are close to coming in). Very easy technical questions and more about the personality style and what you look for in a manager. And finally how is your problem solving like if you come to a situation where information isn't readily available.", "Interview Questions": "What do you know if the information required for the job isn't available?"}, {"date": "22 Aug 2014", "title": "Various Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MemorialCare in Jan 2014", "Interview Descriptions": "It was great.  the staff was very pleasant and warm.  They did do several phone interviews, but it is a  hospital.  They have to be able to make sure that you are going to be the best hire.  Great parking and directions.", "Interview Questions": "What would you do if there was a terrorist attack?"}, {"date": "13 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MemorialCare (Long Beach, CA) in May 2013", "Interview Descriptions": "Initial phone interview was with the hiring manager and an outgoing manager.  Following that I had a face to face interview with the hiring manager and another manager that I would be working with directly.  This occurred at the Long Beach campus location.  The whole process was quite informal and pleasant.", "Interview Questions": "They asked about my direct experience with the type of work that I would be doing."}, {"date": "13 Jan 2017", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MemorialCare (New York, NY) in Mar 2013", "Interview Descriptions": "Submitted application online at the company's website.  Sent tests to me online that needed to be completed.  Once that was done I was invited to come in for an interview.  During the process, I was in contact with the recruiter online until the interview was conducted.", "Interview Questions": "Do you have experience conducting home visitation?"}, {"date": "9 Feb 2013", "title": "Executive Level Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MemorialCare (Long Beach, CA)", "Interview Descriptions": "They communicated to me via email from HR. I went through a series of in-person interviews. I sent them all thank you letters and never heard a word.", "Interview Questions": "I was asked to develop a strategic plan for them as part of interview. "}], [{"date": "30 Jan 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at MemorialCare", "Interview Descriptions": "Interviewed 1 time with the unit manager", "Interview Questions": "N/A"}, {"date": "2 Oct 2015", "title": "Diet Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at MemorialCare (Long Beach, CA) in May 2012", "Interview Descriptions": "The interview was brief, and asked mostly situation questions. There were two interviewers, in the dietetics office. It took quite a while for the interviewers to get back to me after I had the interview (3 months I think?). The interview was fairly painless, and I felt pretty good afterwards.", "Interview Questions": "What would you do if a nurse, volunteer, and customer all wanted your attention at the same time?"}, {"date": "23 Sept 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MemorialCare (San Clemente, CA) in May 2012", "Interview Descriptions": "Met with House Supervisor and Charge Nurse and got to take a tour of the hospital and meet some of the other RNs, PCT's and others.  The interview lasted about one hour.  They do not grill you on too many facts or information learned in school", "Interview Questions": "What skills will you put to use here?  Why do you want to work here?  What are your weaknesses?"}, {"date": "4 Jun 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at MemorialCare (Long Beach, CA) in May 2012", "Interview Descriptions": "Since I had met the department's manager in person prior to the official in-person interview, this was by far the easiest interview I have ever been. It was a group panel type of interview with one department manager and two nursing educators were present.  They were very friendly and calm environment.", "Interview Questions": "Why did you choose Nursing?"}, {"date": "18 Jul 2011", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at MemorialCare (Long Beach, CA) in Jul 2011", "Interview Descriptions": "I did my training here and personally met with the manager before I got hired.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "19 May 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MemorialCare (Long Beach, CA) in Feb 2011", "Interview Descriptions": "it was a one on one interview with the manager. I emailed the supervisor. Then she told the manager about my application. The HR called me to complete their requirements. I started working 2 weeks after my interview.", "Interview Questions": "When can you start?"}, {"date": "25 Jul 2010", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at MemorialCare (Long Beach, CA) in Sept 2008", "Interview Descriptions": "I was already hired as an employee of the hospital but in the emergency department under a different job.  After I graduated nursing school, I contacted the manager of the pediatric intensive care unit and got an interview.  All it was, was a face to face, and we chatted nothing in particular and I was in.  Within a few days I was transfered and in new grad orientation.", "Interview Questions": "The current manager does most of the talking, so just let her."}]]