[[{"date": "17 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Palomar Health", "Interview Descriptions": "In person Group interview. I had 5 other candidates with me. There were 3 people conducting the interview. Giving us scenarios in the hospital that could occur and asking us how we would react. Took about an hour .", "Interview Questions": "You enter an inpatient’s room who is a minor that is requesting to go outside to play. What do you do?"}, {"date": "5 Jan 2023", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Palomar Health", "Interview Descriptions": "Talking component and a behavior component. Both were fun and it was interesting to see it virtually. I hope to do it again and you get to interact with various staff.", "Interview Questions": "What is your experience volunteering?"}, {"date": "8 Dec 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Palomar Health", "Interview Descriptions": "MMI style interview. Interviewers are pretty indifferent or even cold, so you have to ignore it and be upbeat. I personally didn't appreciate the tone of the entire interview - it was very impersonal and felt like hazing.", "Interview Questions": "Strengths/Weaknesses, how will these effect you on the hospital floor."}, {"date": "24 Jan 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Palomar Health (Escondido, CA) in Jan 2022", "Interview Descriptions": "very thorough, hour long interview. They really get to know you and they give you a tour of the unit. They would ideally like you to stay for at least 3 years.", "Interview Questions": "Do you take constructive criticism well? \r\nWhat do you bring to the company?\r\nWhat do you need to be successful?"}, {"date": "18 Aug 2021", "title": "Pathmaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Palomar Health (Escondido, CA)", "Interview Descriptions": "MMI format, kind of a tricky interview but overall very thoughtful. Best way to prepare is to attend their provided workshop to understand what types of questions they will ask.", "Interview Questions": "Name a time you struggled to be compassionate"}, {"date": "26 Jul 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Palomar Health", "Interview Descriptions": "Very convoluded and difficult for an internship that is only supposed to last for a limited time. Many stages of interview were simply designed to trick candidates into answering wrong and exposing their weaknesses.", "Interview Questions": "Not allowed to divulge interview questions."}, {"date": "7 May 2021", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Palomar Health (San Diego, CA) in Apr 2021", "Interview Descriptions": "Ghosted! Informal phone interview and then nothing. I emailed the coordinator and didn’t hear back - extremely unprofessional. You’d think for a role especially within HR it would be proper but this is a red flag for sure!!", "Interview Questions": "Tell me about your experience"}, {"date": "26 Feb 2021", "title": "Palomar Health Pathmaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Palomar Health (San Diego, CA) in Dec 2020", "Interview Descriptions": "Attending the workshop was very useful in preparation for the interview. It provided a lot of background information on what the interview will be like.  During the interview, make sure to keep track of time because they will cut you off if you go over time and you won't have time to finish your thought. MMI interview style. Make sure to prepare some examples of experiences beforehand so you don't have to think of them on the spot.", "Interview Questions": "Choose two words that don't describe you (provided a list of words like hardworking, detail-oriented, etc.)"}, {"date": "17 Jun 2020", "title": "Patient Safety Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Palomar Health (Poway, CA) in Jun 2020", "Interview Descriptions": "I applied online and did not hear back until a month later. The interview process was pretty standard. When I got there I was handed a paper with 3 questions that required short answers. After filling that out I was asked a few more questions related to patient care and my related job experience. The whole thing lasted about 15 minutes. Really pleasant experience.", "Interview Questions": "How would you handle a combative patient? "}, {"date": "7 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Palomar Health", "Interview Descriptions": "personal and informative. great effort from company to get me the information I needed in order to make an informed decision. 1 phone interview and one in-person interview.  then received a call from HR to go over job offer, which wasn't very detailed so I had to ask a lot of questions, which is difficult because I feel like I am being annoying :)", "Interview Questions": "tell us about yourself. What are your relevant skills and experience? what is something you need to focus on more in training?"}], [{"date": "11 May 2021", "title": "Quantitative Summer Intership Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Palomar Health (San Diego, CA) in Aug 2019", "Interview Descriptions": "Mine was a fun interview. There were rotations of tasks to complete and questions that were listed on the website about interests, goals, etc, so overall not that bad. The other interviewees were also fun to talk too.", "Interview Questions": "What is a challenge that you had to consult others to overcome?"}, {"date": "12 Apr 2021", "title": "Clinical Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Palomar Health (Escondido, CA) in Jan 2019", "Interview Descriptions": "MMI Format, there's a lot of applicants. They're very strict. If you're late even just one minute (trust me, I've seen this happen to someone personally), you're denied your interview and you will only get the interview if you're lucky enough that someone failed to show up.", "Interview Questions": "Well, the MMI format is different. But you're basically asked to act out how you would react in a given scenario."}, {"date": "21 Sept 2018", "title": "Leadership Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Palomar Health (Escondido, CA) in Sept 2018", "Interview Descriptions": "Horrible experience! I was strung along for weeks. Finally when the in-person interview was scheduled it was a nightmare. There is no wonder people are fleeing this hospital for other reputable organizations. It's clear the executive team do not know what they are doing - very disorganized and rude. Low morale was VERY clearly obvious during the interviews. Leaders showing up to the interview late, Executives deciding not to show up for the interview at all and those that did show up could only meet for a few minutes b/c of other plans. I took an entire day off to participate and was treated with such disrespect. Why did I waste my time interviewing with them? Stay away!", "Interview Questions": "No specific questions were asked"}, {"date": "5 Jun 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Palomar Health", "Interview Descriptions": "I am writing this in the hopes that someone from hiring will see this and potentially rethink their application process:\r\n\r\nAfter the extensive experience and education experience, they also require you to include your SS and drivers license number - both of which are not yet necessary. IF you proceed to a background check, I understand. Common knowledge suggests you withhold your private information unless there is a clear necessity.\r\n\r\nTHEN, post the application a survey pops up. Unless you complete it, you cannot proceed with submitting your application. It contains 111 questions. 111. One hundred.....and eleven.\r\n\r\nThey really don't want anyone to apply for them, huh? \r\n\r\nNeedless to say, I cancelled the application. If their application is so needless, time-consuming, and invasive - I'll assume I don't want to know how internal operations are and both sides will be better off if I never consider Palomar Health as an employer again.", "Interview Questions": "Survey consisted of very generic character-based questions."}, {"date": "3 May 2018", "title": "Pathmaker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Palomar Health", "Interview Descriptions": "The process takes a couple months and there are tests along the way. If there is a single deadline missed, they will remove you from the program. The overall process is generally rather smooth but has a few bumps in the way.", "Interview Questions": "They stimulated reactions with a patient. "}, {"date": "3 Sept 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Palomar Health (Escondido, CA) in Jan 2018", "Interview Descriptions": "Speed dating interview, 10 minutes with each unit. Various questions asked including clinical and situational questions and certain personality questions. Each unit had a group of interviewers present. Not enough time with each unit.", "Interview Questions": "How to take care of a central line?"}, {"date": "25 Nov 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Palomar Health (La Jolla, CA) in Jan 2018", "Interview Descriptions": "It was nice. They were definitely kind and it was an MMI format. The workshop was very helpful since it had a mock interview. The MMI consisted of 3 behavior and 3 others.", "Interview Questions": "Describe a time that caused you stress and how you dealt with it. "}, {"date": "5 Oct 2017", "title": "Pathmaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Palomar Health (San Diego, CA) in Aug 2017", "Interview Descriptions": "I applied online a month prior to the interview.  Within a month, they notified me for an interview.  The interview was in a MMI format.  There were three performance based questions and three behavioral questions.  Prior to the interview their was a workshop which I think was very helpful since they had a mock interview.", "Interview Questions": "Describe a time when you tried to help someone in the face of resistance?\r\n"}, {"date": "8 Mar 2018", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Palomar Health (Escondido, CA) in Aug 2017", "Interview Descriptions": "Welcoming and relaxed environment. Management was upbeat and friendly, very understanding. Fifty question skills test was done before initiating interview. CPR card, background check needed before orientation can be scheduled.", "Interview Questions": "Why do you want to work here?"}, {"date": "28 Jul 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Palomar Health (Escondido, CA) in Mar 2017", "Interview Descriptions": "Pretty straightforward interview with the basic questions. Interviewed by a group (2-3 people in various leadership roles). I received a response later in the week. Was happy with the process from start to finnish. They didn't drag their feet like some companies do.", "Interview Questions": "Tell me about your previous experience?\r\nWhy do you want to work here?\r\n"}], [{"date": "28 Oct 2016", "title": "Marketing Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Palomar Health", "Interview Descriptions": "The interviewer was very enthusiastic and impressed by my experience and background during the phone interview and wanted to bring me in right away for a personal interview.  When she met me in person, she became disinterested and dismissive. If you're a female of a certain age, applying for a role in marketing or provider relations for which you are exceptionally qualified, good luck getting hired. I have applied for these types of roles at Palomar a few times over recent years but have never received an offer. They are clearly looking for a \"type\". A friend of mine who is employed there confirmed my suspicion. She said it's an unspoken policy.", "Interview Questions": "Basic interview questions.  Very short meeting."}, {"date": "16 Jun 2017", "title": "HRIS Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Palomar Health (Escondido, CA) in Nov 2016", "Interview Descriptions": "The interview process was easy but I worked with a staffing agency. The staffing agency connected me with the hiring manager even though I applied for the position. I was left on edge though as there was a contract issue with the agency the offer was delayed several weeks.", "Interview Questions": "They asked standard questions for my position. I interviewed with a 3 employees 1 being the supervisor and the remaining 2 members of the HR team."}, {"date": "8 Jun 2016", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Palomar Health (Escondido, CA) in Apr 2016", "Interview Descriptions": "The interview process was fairly informal. The manager picked a time that worked for us both and I went to the office to interview. There were several structured questions and several follow-up questions. Overall the interview was laid back.", "Interview Questions": "Have you ever had a patient that didn't respond favorably to physical therapy, and what did you do?"}, {"date": "12 Oct 2018", "title": "Pathmaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Palomar Health (San Diego, CA) in Feb 2016", "Interview Descriptions": "Multi Mini Interview process. Six different stations. All the different stations go through scenarios, behavior questions, and tasks. Arrive at least ten minutes early and the dress code is business professional.", "Interview Questions": "Pick 2 of your weaknesses"}, {"date": "18 Jun 2016", "title": "Applications Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Palomar Health (Escondido, CA) in Mar 2015", "Interview Descriptions": "Typical, behavior based HR Interview. Had a phone screen before flying to Escondido, CA for group interview. 3 45 minute group interviews. High turnover will work in your favor.", "Interview Questions": "What Cerner experience do you have?\r\n\r\nName a time in which you had a negative experience with a RN/Dr and how you reacted?"}, {"date": "8 Mar 2016", "title": "Revenue Cycle Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Palomar Health (Escondido, CA) in Feb 2015", "Interview Descriptions": "Phone only, few if any details volunteered, cold and impersonal. Just going through the motions, and even less detail of possibilities. Felt like they intended to hire within no matter what was said.", "Interview Questions": "How long in industry?\r\n"}, {"date": "22 Dec 2019", "title": "Volunteer Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Palomar Health (Escondido, CA) in Feb 2015", "Interview Descriptions": "Casual because they need volunteers desperately.  They described the job duties, the uniform dress requirement, the days and hours you are available to volunteer.  Do you have reliable transportation to get to work?", "Interview Questions": "Do you enjoy helping people?  Do you have experience answering phones with multiple lines?  Do you follow written instructions well?  Do you work well with others?"}, {"date": "11 Apr 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Palomar Health (San Diego, CA) in May 2014", "Interview Descriptions": "I applied for the internship online. Then they invite you for an onsite interview. The interview was consisted of 6 rooms. Each room had 2-3 people to interview behavioral based questions. I ended up completing all the interviews and in a few days, they email you letting you know if you got the internship or not.", "Interview Questions": "Name a time you deal with a challenge with a colleague and what was the outcome?"}, {"date": "27 Nov 2018", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Palomar Health (Poway, CA) in Feb 2014", "Interview Descriptions": "Two Interviews, one on the phone and the other was in person, the interview was informative and real, like the person giving the interview that helps and I was myself, relaxed on time and dressed well.", "Interview Questions": "Why I should get the job?"}, {"date": "31 Mar 2017", "title": "Pathmaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Palomar Health (Escondido, CA) in Feb 2014", "Interview Descriptions": "The interview style is similar to a med school interview, a MMI format. They had several stations set up, some one on one, others were interactive to see how you would react in a health care setting.", "Interview Questions": "A patient is asking you for water but they are NPO, what do you do?"}], [{"date": "25 Sept 2016", "title": "Account Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Palomar Health (San Diego, CA) in Feb 2013", "Interview Descriptions": "Went through a temp agency\r\nNeeded one year of experience\r\nNeeded to have insurance collections experience\r\nNeeded to have contract experience\r\nNeeded to know how to interpret matrixes\r\nNeeded to know what an ATB was and how to use it\r\nBasic knowledge of Microsoft Word and Excel", "Interview Questions": "How much experience I had in the following:\r\nContracts\r\nPhone calls to insurance companies\r\nComputer skills"}, {"date": "8 Sept 2015", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Palomar Health (Escondido, CA) in Jan 2012", "Interview Descriptions": "I sat in a room with the manager and two therapists for about 15 minutes, they basically asked me a bunch of really random questions and the entire situation felt super unprofessional.", "Interview Questions": "What kinds of books I think to read."}, {"date": "14 Aug 2016", "title": "PathmakerProgram Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Palomar Health (San Diego, CA) in Jan 2012", "Interview Descriptions": "Went in for an info session, followed by an interview and training process.The info session revolved around updating us on what we would need to do and know. The interview was a basic interview asking questions about why I wanted to take part in the program and similar such questions. I was unable to arrive on time and so did not participate in the training process.", "Interview Questions": "N/A"}, {"date": "24 Jul 2015", "title": "Clinical Career Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Palomar Health (San Diego, CA) in Apr 2011", "Interview Descriptions": "I applied online and was called in to a group interview. There was equal opportunity for everyone to talk, but some people got weird questions that I am glad I did not get.", "Interview Questions": "How would you handle a patient who needs help but cannot communicate with you?"}, {"date": "5 Oct 2011", "title": "Personal Care Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Palomar Health (San Diego, CA) in Jan 2011", "Interview Descriptions": "Contacted by their HR to submit CPR, vaccinations, other certifications in late 12/2010. Was called by home health department to schedule interview in late 12/2010. Had 25 question paper test to take on home care skills and was questioned about home care skills. No personality or traditional interview style questions.", "Interview Questions": "Are you good at cooking?"}, {"date": "7 Mar 2013", "title": "Director of Case Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Palomar Health in Jan 2010", "Interview Descriptions": "The Director of HR department was great and the interview team was professional. I felt a part of the team and organization from the very start. The interviewing executive was organized and provided me with the information I needed to make an informed decision. Orientation and on-boarding is very detailed and promotes a culture of caring and commitment to the organization and patients.", "Interview Questions": "Describe yourself in one word."}, {"date": "17 Nov 2009", "title": "Administrative Fellowship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Palomar Health in Nov 2009", "Interview Descriptions": "No introduction via phone. The questions were fired one after another by 3 panelist. The interview started 1.5 hr early--very unexpected. Questions were asked beyond the scope of the opportunity such as the area, the population of the area, demographic of the market there. \r\n\r\nI would say the interview was very hostile.", "Interview Questions": "What is the demographic of the area? "}]]