[[{"date": "12 Apr 2022", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New Horizons (Brookline, MA) in Apr 2022", "Interview Descriptions": "Met with 3 people who did not introduce themselves or indicate their role.  The 2 physicians did all of the talking.  One was very new, the other had been there for a while. Reviewed information that was posted on the web site.  Neither physician was listed on the web site.", "Interview Questions": "Was I willing to work at multiple sites?"}, {"date": "11 Oct 2021", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New Horizons", "Interview Descriptions": "Non-profit organization discriminates based on where u live.  I was only asked if the commute would work for me.  This is not a bona fide ques. and certainly falls under DOL definition of discrimination.", "Interview Questions": "Does the commute work for you for this position?"}, {"date": "6 Feb 2021", "title": "Finance Department Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New Horizons", "Interview Descriptions": "Easy first interview but the second interview they lowballed my modest offer and informed me the full time job I applied to was only a temp position.  I declined, 2 weeks later I get a call that ‘they’re going in a different direction and no longer considering me as a candidate’.  I’m Glad With my decision", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Sept 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Horizons in Jan 2019", "Interview Descriptions": "it was great the person that interviewed me was very informative and helpful. she seemed to like what she was doing and this was a pleasure to see! the interview was a little long but she really answered all my questions", "Interview Questions": "why I want to work there"}, {"date": "26 Oct 2017", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at New Horizons (Spokane, WA) in Apr 2013", "Interview Descriptions": "straightforward.  Talked about my Previous work experience working with computers and people and how I got along. I talked about all the Applications that I taught and used on a daily basis.  I showed  simple presentation that I put together using the microsoft office products.", "Interview Questions": "what is one of your best jobs and what did you learn from it."}], []]