[[{"date": "17 Mar 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MoveOn", "Interview Descriptions": "A few zoom calls working up the ladder. A case study was assigned over the weekend. And a final call where the case study was torn apart. The lead interviewer hated much of the work, after praising or describing similar ideas in the prior interview.", "Interview Questions": "Can you work on a remote team"}, {"date": "19 Dec 2022", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MoveOn", "Interview Descriptions": "It was a typical initial interview, answering questions and asking some of my own. They disclosed some areas they needed help with to improve donor retention. I shared my fundraising philosophy and let them know I’m usually a change agent at organizations I work with and could see some key areas where immediate improvements could be made. I moved to the second round which was a multi-part writing and editing assignment. That’s where it got weird. I did the assignments as requested and they asked for me to provide the reasoning/methodology behind my writing topics. I received a reply saying I wasn’t advancing, which is fine, it happens. Yet, I’ve noticed that when I receive MoveOn emails, they are slowly incorporating a number of my writing suggestions from my samples. On one hand, it’s nice to see they took some of my advice. By the same token, it does leave one feeling exploited to have your ideas stolen from a job interview for a job you didn’t get.", "Interview Questions": "Can you describe your fundraising philosophy? In your writing samples, include an explanation for why you structured the funding request the way you did"}, {"date": "25 Jun 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MoveOn", "Interview Descriptions": "Lovely interview process. The hiring team was very responsive and clear about the timeline and expectations. It was one of the smoothest interview processes I've experienced. I applied online, had a phone call with HR then a written submission then a final interview with the team. During the final interview I sensed that it wasn't a good cultural fit, but it was still a nice conversation.", "Interview Questions": "What's a cause you're passionate about?"}, {"date": "26 Mar 2021", "title": "Chief Technology Officer (CTO) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MoveOn (Los Angeles, CA) in Mar 2021", "Interview Descriptions": "I was contacted by third-party HR service and asked to set up a time for a phone interview. The interviewer sounded like they were reading from a script. It was clearly just an initial screening interview. Interviewer could not have sounded less interested.", "Interview Questions": "What about the job description appealed to you?"}, {"date": "25 Aug 2020", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MoveOn in Aug 2020", "Interview Descriptions": "The whole process took about 2 weeks.  A couple days after I applied, I was sent a link to take a testdome test in an email from moveon.org. The test is pretty easy if you have SQL, python and web experience. Passed that and was contacted by someone from DRIconsulting.  I assume moveon is outsourcing some of their interview rounds??? I was asked to select a time for a telephone meeting. On  the phone call I was asked some scenario based technical questions. The interview was not a technical person and sounded like they were reading from a script so the questions sounded very strange. No clarifications were provided. Some of the questions were system design level questions which was not part of the job description. And I ultimately didnt pass this round.", "Interview Questions": "What do you understand about moveon's mission/goal?\nHow would you debug an issue? What would be the debug process?\nHow would you launch a prototype?\nWhat previous role helped under privileged people?\nWhat previous job was most inline with moveon's mission?"}, {"date": "10 Jul 2019", "title": "Campaign Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at MoveOn (Los Angeles, CA) in Jun 2019", "Interview Descriptions": "I had a phone interview with the HR person, then a case study assignment, then a video conferencing interview with two employees, then a one-hour test, and then a final interview with three employees.\r\n\r\nAfter my final interview, they said I would be hearing about next steps in about a week. After I didn't hear back, I sent the talent manager a follow-up email to see if I was still in the process. There was no response. I sent her a text another week after that, no response. Three weeks after my interview, I checked in with the Campaign Director who had been part of my final interview. I got no response again.\r\n\r\nThis was a position I really wanted to take on and was anxious to hear back from. So I would have appreciated some sort of response letting me know that they were still considering candidates, or there was a delay, etc. Instead, after three interviews and two assignments, I was left hanging in the dark for five weeks (four weeks after I was told I would hear from them) until I finally got an email saying I was not chosen.\r\n\r\nEveryone I spoke to was friendly, had great questions, and were very forthcoming. I don't know why the process didn't reflect the same tone.", "Interview Questions": "Choose which campaign MoveOn should take on, write the starting point of a campaign plan, write the first correspondence of the campaign."}, {"date": "6 May 2019", "title": "Campaign Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MoveOn", "Interview Descriptions": "I applied for a Campaign Director role and was contacted via email to take part in a writing exercise that would take a few hours. I was not called first and I did not have a phone interview. I decided not to complete the assignment.  My time is valuable and not getting the courtesy of a phone interview being being asked to write a campaign document that would take several hours I thought was quite rude.", "Interview Questions": "Compose a campaign memo"}, {"date": "21 May 2019", "title": "Campaign Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MoveOn (Chicago, IL) in Apr 2019", "Interview Descriptions": "MoveOn claims to be a progressive organization that works tirelessly to defend workers rights and progressive values , unfortunately their hiring process is the antithesis of this.  After filling out screener questions as part of the hiring process, and then a brief interview with their HR person they send you an \"assignment\".   I am ok with all of this but when you ask someone to devote as much as time as I did for this interview process have the decency to them let them know whether or not they got the job or at least some feedback. The HR person did not return any emails after weeks of waiting, I see they posted the job all over again. As a prospective  employer you don't have to reply to every request for an update, but when you ask someone to spend hours on an assignment for you, some level of professional courtesy should be adhered to.", "Interview Questions": " Which issue do you think MoveOn should develop a campaign around in the next few months\r\nof 2019"}, {"date": "27 Mar 2019", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MoveOn", "Interview Descriptions": "I have applied for a couple positions at MoveOn. Both followed the same process: 15 min phone screen with HR with basic questions, then a skills assessment (suggested time 1 hour), then a 45 min panel interview with 2-3 people you would be working alongside, then finally a 45 min interview with the hiring manager. The whole process was organized, thoughtful, and clear.", "Interview Questions": "Have you had experience with databases of more than x thousand rows?"}, {"date": "11 Feb 2019", "title": "Social Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MoveOn", "Interview Descriptions": "The interviewer was extremely personable. I never felt uncomfortable or grilled. Talked more about the company than how asked questions. Made me feel like I was a good candidate the entire time, even if I wasn't at the top of the list.", "Interview Questions": "What is something from your past work experience that can contribute to MoveOn"}], [{"date": "8 Jun 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MoveOn", "Interview Descriptions": "Applied online and was sent a 2 hour assignment which included writing some simple SQL queries and answering a couple questions about a dataset. Seeing as the job description only mentioned R, seems like it would have made sense to ask for that instead?  The assignment was easy but I got an automated response saying I would no longer be considered. Overall, not a positive experience as I was actually interested in the job and would have preferred to actually talk to someone or get feedback if I'm going to spend time on an assignment. Hiring process seems very incompetent/lacking courtesy.", "Interview Questions": "Give an example of a data analysis project you've worked on"}, {"date": "23 Feb 2021", "title": "Digital Campaigner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MoveOn (New York, NY) in Jun 2018", "Interview Descriptions": "Had a screener interview with HR, then a phone interview with the woman who would be my boss. I was given a simple campaign exercise to complete within 24 hours which was directly relevant to the project I was to work on. I was then moved to a panel interview with several stakeholders.", "Interview Questions": "What is a campaign you didn't work on but admired and why?"}, {"date": "15 May 2017", "title": "Media Relations Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MoveOn (New York, NY)", "Interview Descriptions": "Perhaps the worst organization I've ever interviewed with. I spoke with the HR woman as well as the head of the team, and then they asked me to take a SIX HOUR long written test - included writing a draft memo/strategy doc, a draft oped (600 words), a sample press release, social media posts, etc. After I completed this, I got NO ANSWER. It's one thing to tell me that I wasn't the right fit, but to ask someone to invest so much time and effort for a position and not respond at all shows truly horrendous hiring skills and appalling people skills. I've learned never to agree to such extensive tests for interviews.", "Interview Questions": "Assume that MoveOn members are fired up about fighting income inequality. Write an internal strategy memo that puts forth your recommendation for the media and messaging strategy MoveOn should adopt in this fight.\r\n\r\nWrite a ~600 word op­ed or blog post making the case for a higher minimum wage,"}, {"date": "1 Sept 2016", "title": "Campaign Support Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MoveOn", "Interview Descriptions": "30 minute q/a.\nvery informal and relaxed which is great to build trust.\nmeeting took place over google hangouts.\nboth interviewers were great people.\ni would recommend anyone to work with them.\n\nnote... interview outcome section in this review was required but not applicable in my scenario.", "Interview Questions": "regular behavioral questions"}, {"date": "15 Sept 2014", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at MoveOn (Austin, TX) in Dec 2010", "Interview Descriptions": "Very informal. They, of course, want to talk about your qualifications but more than that they are looking for a personality match. After a few of the more formal questions, a fair amount of time was spent socializing and getting to know one another.", "Interview Questions": "The interviewer posed a scenario question dealing with an unruly contact. It wasn't particularly difficult, but those questions always seem to fluster me."}]]