[[{"date": "17 May 2023", "title": "Projektmanager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IU Internationale Hochschule (Munich, Bavaria) in Apr 2023", "Interview Descriptions": "Das Interview lief über ein vorab aufgezeichnetes Videointerview. Es wurden dort drei zur Stelle passenden Fragen gestellt, auch wenn die Antwort nur oberflächlich sein konnte aufgrund der Zeit. Seitdem leider keine Rückmeldung mehr (3 Wochen her).", "Interview Questions": "Bei welchem Projekt hatten Sie welches Erfolgserlebnis?"}, {"date": "17 Apr 2023", "title": "Senior Leadership Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IU Internationale Hochschule (Munich, Bavaria) in Mar 2023", "Interview Descriptions": "Insgesamt waren die Gespräche sehr freundlich, offen, keine \"unfairen\" Fragen, hohe Verbindlichkeit im gesamten Bewerbungsprozess. 1. Bewerbung 2. Gespräch mit Recruiter (allgemeine Infos zur IU, Aufgaben, Visionen) 3. Gespräch mit Abteilungsleitung 4. Online Assessment Centre mit Stresstest (Postkorbübung), verschiedene Logik-Tests 5. Gespräch mit Bereichsleitung", "Interview Questions": "Welche Herausforderungen stellen sich in einer Hyper Growth Environment?"}, {"date": "14 May 2023", "title": "Mediengestalter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at IU Internationale Hochschule (Leipzig) in Mar 2023", "Interview Descriptions": "Es war relativ entspannt und einfach. Vor mir saß eine nette Dame, die mich erst einmal persönlich befragt hat und daraufhin mir Logikfragen gestellt hat. Es war ein sehr angenehmes Gespräch, sodass man sich nicht davor stressen lassen sollte.", "Interview Questions": "Was sind ihre Stärken und was sind ihre Schwächen?"}, {"date": "21 May 2023", "title": "Kindheitspädagoge (BA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IU Internationale Hochschule (Leipzig) in Jan 2023", "Interview Descriptions": "kurz, knapp, freundlich. Offener freundlicher Beginn. Sehr angenehm und ruhig gesprochen, sodass man nicht aufgeregt war. Es würden fragen beantwortet und Wünsche berücksichtigt und gleich im vorstellungsgespräch gesagt ob man einen Platz bekommt oder nicht", "Interview Questions": "N/A"}, {"date": "19 Aug 2022", "title": "Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IU Internationale Hochschule", "Interview Descriptions": "gute Organisation, Berufungsgespräch mit teils fachlichen und teils Fragen allgemeiner Art, nettes Personal, freundliche und angenehme Atmosphäre, alles in allem kann man sagen es war ein angenehmes  Vorstellungsgespräch, das nicht zu locker aber auch nicht zu streng war", "Interview Questions": "Fachliche Fragen zum Berufungsvortrag, Welche Fächer würden Sie sofort unterrichten können, Teilzeit oder Vollzeit auch mit Blick auf aktuelle Tätigkeit, Ort"}, {"date": "26 Jul 2022", "title": "Campus Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at IU Internationale Hochschule", "Interview Descriptions": "Per DU, super freundlich & wertschätzend. In Summe gab es 4 Runden, zuerst mit der Regionalleitung, dann zwei Regionalleitungen und weiteren Führungskräften des C-Levels.\r\nSehr zeitnahe Rückmeldungen bekommen, sehr unbürokratischer Prozess.", "Interview Questions": "Fünf Fragestellungen müssen erarbeitet werden. In Summe gab es 4 Runden\r\n"}, {"date": "7 Jan 2023", "title": "Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at IU Internationale Hochschule (Berlin) in May 2022", "Interview Descriptions": "I applied for a student service position. Got a call relatively quickly from the HR staff asking me. They did a quick interview on the phone and offered me another position in a different department. I agreed initially and asked for more information. I got an invitation later for a zoom interview with a business case to prepare. The interview did not go well at all. The staff was not really friendly or paying attention sometimes. I got interrupted constantly by one of the interviewers while doing the presentation. I got a rejection email couple of days later. I found the interview was pretty hard specially which getting interrupted the whole time and asked too many questions, while the position was paid really poorly", "Interview Questions": "What would you do when students are not satisfied with their schedule and you can not change it?"}, {"date": "15 Jul 2022", "title": "Produktmanager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IU Internationale Hochschule (Erfurt) in Apr 2022", "Interview Descriptions": "Erstgespräch: \r\nVorstellung - erzählen Sie über sich \r\nFragen\r\nStellenbeschreibung - worum geht is in der Position\r\nArbeitskultur in der Firma\r\nFragen nach dem Gehalt und Eintrittstermin\r\n\r\nDie IU Internationale Hochschule ist eine staatlich anerkannte private Fachhochschule mit Sitz in Erfurt und 28 Standorten in Deutschland", "Interview Questions": "Was ist Ihnen in der Arbeit wichtig?"}], [], []]