[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Growing organization with many opportunities", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "10 May 2016", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "CHAN is a great place to work that has been strengthened by the ownership and influence of Crowe Horwath. Leadership is focused on growing the organization, bringing more opportunities for everyone. Decisions are made with employees in mind. Employees are surveyed annually and their feedback is taken very seriously at the highest levels of the company. I am proud to have been a part of CHAN.", "cons": "There has been a lot of change over the past couple of years, and change can be difficult, but these changes are making a better overall organization."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Counter to Positive Reviews", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Sept 2015", "job_title": "Audit Manager in Grosse Pointe Farms, MI", "duration": "N/A", "pros": "It is interesting seeing a bunch of positive reviews posted within a relatively short period of time (July-August, 2015).  I sense there was a push internally to post positive reviews.  I worked at CHAN for more than three years and there was both good and bad to the position.  Your experience will depende largely on your client and your immediate leadership; this can vary significantly.  In general, there is good work/life balance and decent starting pay.  There are ample opportunities for learning, including an annual conference in a select location.  Local management generally views audit favorably and so there is a sense of being needed (again, this will depend upon your location).", "cons": "Management was stilted under the old regime (prior to Crowe Horwath purchase).  The CEO was an ego-maniac who fed on praise and agreement of his inner circle.  Variable pay was bragged about; however, it was unclear what had to be done to receive the bonus.  Peronally, I exceeded all goals in multiple years and never received a bonus.  Promotions are entirely dependent upon your ability to move to a new city or to someone above you leaving in your assigned client.  Otherwise, you're staying put.  Raises are puny and not worth it.  At times, the home office in St. Louis can be controlling and anal about insignificant things.  Overall, CHAN is not a bad place to work but it has significant drawbacks that should be considered."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent Company and Structure", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Jul 2015", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "See my review below, but first a note to readers.\r\nNote: I find some of these reviews on this website (or any website) to be very harsh and all reviews should be taken with a grain of salt. Most people who do these are bitter and have nothing of real value to provide. Very few people who are satisfied take the time to provide a review, and I bet some of the companies on Glassdoor that have excellent ratings “encourage” current employees to post positive reviews, and this is not one of them but was made aware of the poor rating from a friend.\r\n\r\nReview: I have had an excellent experience with CHAN. I have worked for other larger services companies and CHAN has definitely has provided me with everything I need to succeed at my job. I work with a strong team and local senior management has built great relationships with our client and CHAN's senior management is very communicative to all of CHAN about progress goals as well as any news that is relevant to the company as a whole. There is a lot of specialty experience and SME's that are at your disposal throughout CHAN that are willing to help out for any type of audit engagement. From my experience CHAN is very involved in the community and focuses on giving back to those in need and provides opportunities for CHAN employees to get assistance in providing help and/or services to charitable organizations. Also, the work life balance has been excellent and senior management is flexible to work with your schedule and needs.", "cons": "I do not have any cons at this time."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Overall Good experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "14 Jan 2016", "job_title": "Anonymous Employee in Saint Louis, MO", "duration": "N/A", "pros": "The corporate office was a great place to work for the most part and there were a lot of committed and hard working professionals. The audit side also employed wonderful people with hearts to serve and mission commitment. The company strategy to focus on developing people was phenomenal! They also paid very well and had a great bonus structure. The annual conference and focus on serving others was also wonderful! Bart Cross and Kurt Held were two very respected leaders at corporate and should be held onto.", "cons": "The politics and inability to really get good leaders at the top. There were very few executives that were upstanding professionals leading the company. There was also a lot of red tape in getting things approved and done for being such a small company. There were many layers of management and review. \n\nEven with the cons, my time at CHAN had many positives and I will always be grateful for that experience."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Dont believe the hype", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Jan 2016", "job_title": "Audit Manager in Saint Louis, MO", "duration": "N/A", "pros": "Rate of pay is competitive and if you get a good client and can ignore the chaos in St. Louis, you will be fine.", "cons": "Like a prior person noted, there was a rash of raving reviews all around the same time. Don't believe the hype. The company is in turmoil. Senior Leadership fights amongst each other and openly criticizes each other in team calls and in front of others. All of the consulting team has quit. These were great people! I thought we were to be highly specialized in focused areas, but seeing what has happened to consulting, I think that may be a bad idea. My client is asking me why the CEO is saying that CHAN has 200+ consultants when they know they don't. My client interviewed me before I got hired and they worry that they will lose their dedicated team. Chaos is hurting associates and clients alike. There is no more work life balance or focus on client relationships and employee development. The current strategy is only going to work if CHAN cheats their clients and disrespects their associates."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible; Do Not Work For Period!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Aug 2018", "job_title": "Client Based Audit Manager in Indianapolis, IN", "duration": "N/A", "pros": "There are no positive comments.  I went into work almost everyday and no one said a word to me.", "cons": "I was recruited by CHAN...heavily.  When I started there were layoff for engagement based auditors..I was told it did not apply because we were Client Based Auditors and that was what our client absolutely wanted.  Plus I was in an location in which had already changed with the model.  I did not think nothing of it but my eyebrow was raised.  Then my coworker came in one day and all of a sudden was let go...I really was concerned very concerned.  Fast forward 3 months, I came in to work and I was on a client call and my Sr Manager was urging me to take a call and I was so confused because I was in the middle of speaking with the client.  I took the call and I was told that I was being laid off effective almost immediately and then the line went silent and the call ended.  What was more humiliating is that you could see every person that was invited to that call so you knew who did and did not get laid off.  I can say alot of things negative about the culture but how that situation was handled from a leadership perspective shows you the culture and the lack of value in people."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Crowe Horwath killed the previous culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Jul 2018", "job_title": "Risk Consulting in Oakbrook Terrace, IL", "duration": "N/A", "pros": "Work remotely, Health Benefits, Dress based on your day, casual or business if facing clients.", "cons": "Where to start? Since Crowe took over, many many great people, workers, and leaders, have fled, or been sterilized with office politics. They could see what was coming. Are you on the CEO's team, or not. CHAN was always profitable, but charitable. With Crowe it's all about the money, lip service to charity, lip service to the way CHAN used to be, serving our clients and each other like family. Since 2014, they have systematically erased almost everything CHAN represented, and anyone who didn't bow to the Crowe model."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "The company hires high quality auditors committed to excellence.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 May 2011", "job_title": "Senior Manager in Austin, TX", "duration": "N/A", "pros": "The company is committed to providing superior services to its clients.  Clients, primarily, nonprofit healthcare systems, pay for the services provided.  Auditors at all level are required to maintain certification.  Auditors hired are high caliber.  Strong support is provided to staff at all levels.", "cons": "Positions are geographically located to support clients.  Thus, there is some isolation from CHAN coworkers.  The senior management team has considerable turnover.  Management opportunities often require relocation."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Inept Management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Oct 2016", "job_title": "Audit Manager in Saint Louis, MO", "duration": "N/A", "pros": "Salary is very competitive. There are no other positive remarks I can make here.", "cons": "Management and direction is nonexistent. My \"team\" has had nearly 100 percent turnover in the last 10 months with no sign of slowing. Management is absent and does not provide any concrete direction. Audit plan assignments change on a frequent basis without consideration of strengths or weaknesses of the personnel. When guidance is given it is incomplete and has resulted in rework and apologies to the client. Work/life balance commitment is questionable: on one hand you hear about Crowe Horwath's \"Work from anywhere, wear anything\" initiative and on the other you are told it does not apply to you.  I would not recommend this company to anyone."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great company with an awsome purpose", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Jul 2015", "job_title": "Data Analytics Audit Manager in Salado, TX", "duration": "N/A", "pros": "I've been with CHAN Healthcare over 10 years and believe it to be a great place to work. The staff, from my peers to the CEO, are friendly, capable and of high integrity. Senior management has continually demonstrated the core values of the company by caring, sharing, investing and growing. Lots of opportunity for specialty training, project involvement and community service.", "cons": "Limited opportunities for advancement. Just not a lot of management layers."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "5 Years of Dysfunction", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Dec 2016", "job_title": "Audit Manager in Saint Louis, MO", "duration": "N/A", "pros": "Excellent starting wage. Great talent among their Audit Managers. Great Resources to complete audits. Annual conferences are a great idea, but are greatly underutilized. Great HR Team.", "cons": "Upper Management leaves much to be desired. Bonuses, promotions and annual raises are just as fictitious as unicorns. I’ve seen Directors take credit for subordinate's work to get their bonuses. I had one director who was so verbally abusive, that employees left her team-meetings in tears.  There was a lot of turnover during her reign.  After I reported her behavior to the VP (in accordance with policy), she was finally demoted, (not fired) and left to work with the team. That process took a whole year.  Unfortunately, she was quite disgruntled when she worked with the team, and caused a lot of havoc. I personally experienced a lot of retaliation from her. The new Director took credit for a lot of my work including winning a $300k consulting engagement with the client. The CHAN VP never knew I was responsible for many things my director presented to her. When it came time for bonuses, he never supported his staff. Instead, I was told I was blackballed by the VP for reporting my previous director’s behavior. My director told me that he was quoting the VP when he said employment is at will. There’s been a lot of turnover during his reign as well. I'm leaving CHAN believing I’ve been ripped off for over $15k in lost bonuses and raises that I earned. I firmly believe the future of CHAN as it is currently organized is quite limited if it continues down this current path. Crowe definitely needs to clean firmly house as far as upper management is concerned and start from scratch."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Can't believe I'm still here", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Aug 2013", "job_title": "Audit Manager in Saint Louis, MO", "duration": "N/A", "pros": "Good pay.  A good place to work as an intern or recent college graduate in order to gain experience. A good organization for those interested in video production as a considerable amount of inspirational videos are circulated around the company.", "cons": "The organization simply isn’t interested in their employee’s opinions and encourages a ‘yes man’ mentality. It is common knowledge that people have been terminated for presenting ideas not approved of by Management, even though these ideas were directly solicited.  \r\n\r\nManagement is unsympathetic.  Personal emergencies are gossiped about and employees are reminded that work commitments come first and must still be honored without exception. \r\n\r\nFaith based means fundamentalist religion according to an elite few within the company.  Faith is used as a bullying and manipulation tactic. \r\n\r\nI have been witness to false accusations made against employees. The accused had an abundance of documentation proving their innocence, however this was ignored by Management as the accuser was considered a favorite. \r\n\r\nNew employees are required to attend orientation in St. Louis.  Policies and procedures are briefly mentioned. However, a considerable amount of time is placed on discussing how one should 1) put chairs at the same level when leaving the conference room, 2) arrive 10 minutes early to all meetings, and 3) laugh at Management’s jokes and make them feel important.  On multiple occasions, my orientation group wasn’t allowed to ask questions because there wasn’t enough time.  It was obvious the instructors were more interested in sticking to a schedule than truly teaching the new employees and addressing their questions.\r\n\r\nChan has an annual conference, often referred to as the family reunion.  Employees are strictly managed and watched throughout the week.  There is absolutely no down time. Bathroom breaks are timed.  A greeting committee mans the auditorium doors like church ushers. Group workouts and group worship services are scheduled and attendance is highly encouraged.  All meals are eaten as a group, with one meal offering minimal food because the money should go to the poor.  The company spends a lot of money for this mandatory conference, however they require the majority of the employees to drive their own cars or rent a van because they don’t want to pay for airfare and airport parking fees. \r\n\r\nChan prides itself on saying they are ‘One Chan’, but this simply isn’t true.  Some of the local offices are laid back while others are extremely strict.  Some of the local teams encourage business casual attire, while others want employees in suits and overdressed compared to their clients. Some of the local offices allow employees to work from home, however others are known to frown upon working at home and strictly enforce start/stop times and lunch breaks.  Some offices encourage open communication, while others are known to document the number of questions asked by an employee during the quarter."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Think Before You Act", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 Jan 2016", "job_title": "Senior Auditor in Clayton, MO", "duration": "N/A", "pros": "They have a decent starting salary and annual raises plus a bonus program.  However, the bonus program is not as good as it is portrayed in the interview process.  If you get placed at a decent client and can avoid senior management you will be all right.  Clients with five or less on site auditors are ideal, anything more than that you risk senior management interference.  Make sure you ask how many years remain before the client contract is up for renewal.", "cons": "This is as dysfunctional an organization as there has ever been and that includes Crowe Horwath and CHAN leadership.  The CHAN CEO is not a leader and is surrounded with “yes” people that are more concerned with eliminating perceived threats than running a business.  In a span of six months, they have gutted the consulting area to the point that only a minimal number of consultants remain from the prior regime and have attempted to alter the current core model to match that of Crowe, a traditional large scale consulting firm.  Crowe and CHAN leadership function in a top down management style and if you question anything your career is on the line.  Healthy dialogue is discouraged and will be held against you.  Do not believe the recruiter when they say CHAN is different from a large consulting firm and they describe employees as a family and the work as “with a purpose”.  You will hear both when interviewing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Data Analytics Audit Senior Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "4 Aug 2015", "job_title": "Data Analytics Audit Senior Manager in Mountain Top, PA", "duration": "N/A", "pros": "Opportunity to work independently and provide quality audit services to our clients. Access to up-to-date technology, audit tools and knowledge. I have worked for CHAN for 14 years and I have only seen the company act in a positive, ethical manner. Work life balance is stressed and encouraged.", "cons": "None come to mind. CHAN is very supportive of their employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Opportunities and Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jul 2015", "job_title": "Internal Audit", "duration": "N/A", "pros": "Proactive company, If do a good job then ability to move up (may have to travel more or may need to move), Great work/life balance. Great library of knowledge and willingness to share among all associates nationwide. Ethical and high integrity. Great culture. Openness to work with all levels of the organization.", "cons": "May not be local opportunity for advancement."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Stay Away", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Apr 2019", "job_title": "Audit Manager in Saint Louis, MO", "duration": "N/A", "pros": "The salary is decent and the healthcare benefits are some of the best.", "cons": "Although there are some genuinely nice people that work for CHAN, it’s still a snakepit and backstabbing environment.  Senior leadership wants to sit on their butt while forcing staff to drum up new business and perform audits simultaneously without extra compensation!  That’s crazy."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Feel like your just a machine without a voice", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Jan 2013", "job_title": "Audit Manager in Chicago, IL", "duration": "N/A", "pros": "Salary, work-life, no one looking over your shoulder, nice down to earth colleagues", "cons": "Feels like work does not matter, only way to move up is to get connected....this company is based on perception, not reality. pretend to work hard but you dont have to really work hard"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "CHAN is a great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "3 Aug 2015", "job_title": "Senior Manager in Chicago, IL", "duration": "N/A", "pros": "If you do your job, you will be rewarded. If you don't do your job, you won't be rewarded. You have to be able to work independently. You have to be a professional.", "cons": "None that come to mind. Just do your job and you will be fine."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Worst Job Ever", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Mar 2016", "job_title": "Finance in Clayton, MO", "duration": "N/A", "pros": "Good place to learn the ugly side of business politics because you won't stay with the company. Also a good place to learn how to keep your head down and law low.", "cons": "Everything. The leaders don't care. They just wish to be left alone. As a staff member you are dispensable. The CEO is an idiot. The pay is good because of the daily political crap you have to put up with."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Jul 2015", "job_title": "Audit Manager in Denver, CO", "duration": "N/A", "pros": "Absolutely love my job and my team!  Management is very considerate of work/life balances and encourages growth and continuing education.", "cons": "Substantial PTO benefit, but rollover policy could be improved."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Work hard, good pay, long hours", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Dec 2011", "job_title": " in Cincinnati, OH", "duration": "N/A", "pros": "The pay and benefits are good.", "cons": "Work/life balance is challenging, expectations can't be met without overtime.\r\nChange is rapid."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great Team", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Feb 2019", "job_title": "Internal Audit Manager in Tulsa, OK", "duration": "N/A", "pros": "Great team work, and company communications.  Salary commensurate with experience.", "cons": "Health benefits costly. 401K match is not as generous as other companies."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "CHAN", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "30 Jun 2015", "job_title": " in Bridgeport, CT", "duration": "N/A", "pros": "great model, excellent knowledge base", "cons": "no opportunities, you need to know somebody"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Not Enough Work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Mar 2016", "job_title": "Anonymous Employee in Clayton, MO", "duration": "N/A", "pros": "Salary and benefits are generous.", "cons": "There is not enough work to keep you busy unless you're an auditor."}]]