[[{"date": "12 Apr 2023", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Duke Health Technology Solutions (Durham, NC) in Jan 2023", "Interview Descriptions": "there was a 15-minute phone screening, followed by a 1-hour zoom call with the lab manager. He asked some technical and behavioral questions. overall it was a good interview.The interview was very polite and friendly", "Interview Questions": "What is your favorite thing to do in lab?"}, {"date": "24 May 2022", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Duke Health Technology Solutions (Durham, NC) in May 2022", "Interview Descriptions": "It was a phone screen.  I was asked a few questions. I was asked could I start June 30th. I was also asked if working remote was okay with me which would be a plus for me.", "Interview Questions": "I would I describe myself"}, {"date": "8 Oct 2020", "title": "Access Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Duke Health Technology Solutions (Durham, NC) in Oct 2020", "Interview Descriptions": "I’ve had two interviews for this position, about a week apart. First one with HR and second with the hiring manager.\r\nThey were both through zoom and both interviews went so amazing because of how comfortable they make you feel.", "Interview Questions": "Tell me about yourself and why you’re interested in this role "}, {"date": "13 May 2021", "title": "Application Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Duke Health Technology Solutions (Durham, NC) in Jan 2020", "Interview Descriptions": "They have a great interviewprocess, I felt comfortable and welcomed. I was tested on my knowledge of my particular area of expertise thoroughly. All in all a very fun process.", "Interview Questions": "I was asked to explain an obstacle I had faced in my career, and asked to demonstrate how I overcame that obstacle."}, {"date": "27 Sept 2019", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Duke Health Technology Solutions (Durham, NC) in Jul 2019", "Interview Descriptions": "Drawn out process with recruiter, then manager, then technical panel interview. Next step would have been interview with higher-up. \r\nDid not connect with the panel--I found them cold and humorless. The work environment was a grim warren of cubicles; would not relish the prospect of being chained there.\r\nIn the end the feedback to the recruiter was that they doubted my troubleshooting skills. After being in the business actively for more than 20 years, while the panelists were likely in middle school, I felt that rejection was ageist, not to mention lame.", "Interview Questions": "White board and describe a network you've worked on."}, {"date": "8 Jun 2018", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Duke Health Technology Solutions (Durham, NC) in Oct 2016", "Interview Descriptions": "it took two months, first a general interview on phone by Manager and then I was flown to NC for a 4 hour interview first met CIO and then the team members", "Interview Questions": "Tell a difficult technical situation you tackled  "}, {"date": "24 Feb 2020", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Duke Health Technology Solutions (Durham, NC) in Sept 2016", "Interview Descriptions": "The interview process was very easy and convenient. I was screened via phone call, then called in for an interview day. I had an interview with the process owner, the chief PMO officer, the manager of the PMO, as well as a team panel interview.", "Interview Questions": "What projects have you worked on, what type of communication method do you use, what organization style do you prefer, etc. "}, {"date": "15 Jan 2017", "title": "Epic SER Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Duke Health Technology Solutions (Durham, NC) in Aug 2016", "Interview Descriptions": "They were quick to initially reach out to show interest but took a few months to eventually get to do an interview on site. Once I got onsite they showed me around to meet some of the staff but with it being a Friday hardly anyone was in the office since they were mostly working from home.", "Interview Questions": "What I like and don't like about what I do. "}, {"date": "14 Apr 2016", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Duke Health Technology Solutions (Durham, NC) in Apr 2016", "Interview Descriptions": "The manager described the job duties and then asked me several behavioral type questions. She also explained the hours involved and the expectations of the employees.  She also asked several technical questions related to the position and presented situations to me and asked how I would handle them.", "Interview Questions": "What can you do to promote teamwork?"}, {"date": "6 Sept 2015", "title": "David Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Duke Health Technology Solutions", "Interview Descriptions": "This was a panel style interview.  All were friendly and was a decent experience.  Found out afterwards that they have to interview who applies to the positions bc of policy, but that they normally hire from within and are looking for certain people to hire.  They also do not always keep the comments from the interview to them selves and break this confidentiality agreement.\n\nLong story short:  tell them what they want to hear, not your true feelings.  There are many snitches here.", "Interview Questions": "What magazine subscriptions do you have to stay up on technology?"}], [{"date": "25 Aug 2010", "title": "Senior IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Duke Health Technology Solutions (Durham, NC) in Jan 2008", "Interview Descriptions": "Initially phone interviewed with hiring manager who did a tertiary interview of my technical skills. Focus was mostly on soft skills. Followup was a very technical interview with senior technician. After these, was brought on-site for a full-on interview with mangers, technicians, and users; some were one-on-one and some panel type. Good process where all were able to determine a lot through this process.", "Interview Questions": "Nothing specific stand out"}]]