[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Low Ceiling, But a Good Workplace", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Jul 2014", "job_title": "Administrative Assistant in Waterloo, ON", "duration": "N/A", "pros": "Flexible schedule, usually friendly co-workers, great community, very inclusive environment. Wants to work with you instead of just firing you for the smallest mistakes. Lots of room to work independently and at your own pace. Really can't emphasize enough the friendly community and fun events.", "cons": "Did not receive any training at start, just a quick run-through from the person leaving the position and the person who had held it before - literally under an hour of discussion. No reference guide for expectations, standards, procedures, etc was provided - I had to put one together gradually through experience for myself, usually after the point when I needed it. Communication can be a problem, I keep a log book which has helped with this to some extent. Very limited hours for this position (other positions are both full time and not as limited), yearly raises do not keep up with cost of living. Shaky organizational structure leads to difficulties when there is a dispute because it's hard to tell who to take it to."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Still Here", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Jul 2015", "job_title": "Administrative Assistant in Waterloo, ON", "duration": "N/A", "pros": "Same as before... Good sense of community, co-operative spirit, etc.", "cons": "Still re-active instead of pro-active training/discipline, still no effort to provide access to procedures/precedents/expectations. I have flat-out asked for written instructions so that both parties have a written set of expectations to go off of and look back on, but was denied that out-right. I guess that would make it harder to keep gaslighting employees..."}]]