[[{"date": "9 Aug 2022", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Jul 2022", "Interview Descriptions": "3person interview and respect You as being a Nurse.  They asked 3 questions and gave you the opportunity to answer and didn’t rush you.  They don’t look down at LPN.  Unlike other hospitals", "Interview Questions": "How do get along with your coworkers "}, {"date": "26 Aug 2021", "title": "RN NURSE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Aug 2021", "Interview Descriptions": "2 person interview, very quick process. One in persona and one on the phone. They re asked for my social security number and inquired if I gave a notice to my previous job. It’s in person interview.", "Interview Questions": "Tell me about yourself, previous work history, why’d you leave, did you give notice "}, {"date": "24 Apr 2021", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chesapeake Regional Medical Center", "Interview Descriptions": "Very fast. Only took a couple hours to hear back from human resources after my interview. \r\n\r\nHuman resources was great also! Never had a job that worked so fast like this", "Interview Questions": "How do you manage heavy work loads "}, {"date": "2 Jul 2021", "title": "Radiology Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Feb 2021", "Interview Descriptions": "I was interviewed by two individuals for this position. I had a second interview and soon after, their decision showed up online. I was informed that I wasn’t selected for the position. In addition, the position has not been filled as of yet.", "Interview Questions": "How well do you work under pressure? "}, {"date": "10 Nov 2020", "title": "Nursing Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Nov 2020", "Interview Descriptions": "Waited in lobby.  Everyone was very nice, explained job thoroughly. Interview was quick. Nurse manager was polite, professional. Hospital was clean.  Information desk was helpful as well. Definitely looking forward to a new step", "Interview Questions": "What stressful situation have you handled at work and how?"}, {"date": "1 Sept 2020", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Aug 2020", "Interview Descriptions": "I applied online, received a phone call about a week later to schedule an interview with some of the ED leadership, received another call two days after the first interview to set up an HR phone interview with the nurse manager, and received an offer at the end of the phone interview.", "Interview Questions": "Past experience with difficult patients, catching mistakes (my own or others'), critical care experience"}, {"date": "4 Jul 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in May 2020", "Interview Descriptions": "Three interviews. One phone interview with Human Resources then there were, two in person interviews. A management interview and a peer interview.  All done within a week span.", "Interview Questions": "How would my past employers describe me. "}, {"date": "16 Apr 2020", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chesapeake Regional Medical Center in Apr 2020", "Interview Descriptions": "It was a quick process. I applied on the 8th and I got a call on the 10th for an interview. The manager that interviewed my was very nice and professional. I can tell she care about who she wants on her team .", "Interview Questions": "Why did you choose Chesapeake Regional Medical Center?"}, {"date": "14 Apr 2020", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Apr 2020", "Interview Descriptions": "I applied online on a Wednesday. That Friday, I received a call from the unit manager to schedule an interview for Monday. I met with the unit manager and the clinical coordinator for the unit. They took turns asking me pretty standard interview questions. The interview lasted about 20 minutes, and I was told to expect a decision to be made the same day. The following Wednesday I received a call from HR to set up a phone interview for the following day. The HR interview took about 30 minutes, and it consisted of some questions about my job history and she went over some policies before presenting my official offer. I was then scheduled for a health screening which consisted of blood work and getting up to date of immunizations. I met with HR in person for some paperwork, then submitted my drug screen. The hiring process was very simple and straightforward, I was given a start date for my orientation 2 weeks out.", "Interview Questions": "What does professionalism mean to you? Tell me about a time you went above and beyond in regards to customer service?"}, {"date": "24 Oct 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chesapeake Regional Medical Center", "Interview Descriptions": "the interview very easy going, there was an initial interview with the hiring manager then a peer interview. this took about 3 weeks total. not a bad interview process at all", "Interview Questions": "name. an achievement you are most proud of"}], [{"date": "26 Nov 2019", "title": "Registered Nurse, BSN, MSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Feb 2018", "Interview Descriptions": "Standard industry questions. There was a phone interview, a face to face interview that included a  standard background and drug screen test. There was an opportunity to meet on the floor with several of the current employees in order to ask questions and to be able to get a feel for the floor that I would be working.", "Interview Questions": "They were interested in my experience, and my interests in exploring future goals including school and professional. There were no difficult questions during the interview. Just the standard questions regarding availability, requirements from both parties, visions for the future."}, {"date": "22 Sept 2017", "title": "Nursing Care Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Sept 2017", "Interview Descriptions": "The interview takes 20-30 minutes. They basically asked what's in your resume and the questions your answer in your online application. The waiting game takes about 5 days to 1 week.", "Interview Questions": "They asked what is your stand with working with different race/nationality of people in a group."}, {"date": "5 Apr 2017", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Chesapeake Regional Medical Center", "Interview Descriptions": "The whole process was quick and simple. The job was offered within a week. I was in orientation within the next 2 weeks. Having to give my prior employer 2 weeks", "Interview Questions": "they ask the typical interviewing questions"}, {"date": "27 Mar 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Mar 2017", "Interview Descriptions": "I applied via the website and was contacted quickly for an interview. I interviewed once with the unit manager and then once with a group of peers. I was then offered the job and there was a typical hiring process after that with a visit to HR and such.", "Interview Questions": "What would you do if I saw someone breaking a rule. "}, {"date": "12 Dec 2015", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Oct 2015", "Interview Descriptions": "After being assigned to the company by the agency, I was scheduled to meet up with the manager for one of the major departments within the hospital. I came in, pretty much parroted what was already on my resume, discussed what I'd be doing at the hospital from day to day and what was expected from me performance wise.", "Interview Questions": "Do you understand what this position entails?"}, {"date": "17 May 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Jan 2015", "Interview Descriptions": "Very  good.  Interviewer made me feel at ease.  Hiring manager was very pleasant also.  She gave a tour of the facility and introduced me to others on the unit.  Staff was friendly and welcoming.", "Interview Questions": "Tell us about your strengths"}, {"date": "8 Nov 2014", "title": "Case Management Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chesapeake Regional Medical Center in Oct 2014", "Interview Descriptions": "Very thorough . Great coordination of interviews First was with the Director of Department, then had panel interview with department  peers.  Overall it took about two weeks from application to interview. Another week for a decision, after checking references and meeting with HR to show proof of educational background and licensure. Orientation is six weeks(which is fantastic). Short, appropriate general orientation followed by department job specific orientation.  Lots of one on one time with front line colleagues showing you how the work is really done and allowing to you develop your own best practices.", "Interview Questions": "Nothing unexpected was asked. Standard questions but definitely looking fora good fit with the rest of the  team"}, {"date": "10 Aug 2016", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Mar 2012", "Interview Descriptions": "Easy interview process but it was 7 years ago. I have been a part of interviews prior to leaving and there appears to be a broken process. Managers have to constantly keep after HR to send more applications to them so they can get people to interview.", "Interview Questions": "Where do you see yourself five years from now?"}, {"date": "17 Nov 2016", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Chesapeake Regional Medical Center (Chesapeake, VA) in Feb 2012", "Interview Descriptions": "Interviewed by phone and then came in for a 6 hour interview. I met with executive team for an hour and then had separate interviews with different department leaders. The interview process was one that I expected since I had been an executive leader in the past.", "Interview Questions": "How can you bring the team together?"}]]