[[{"date": "25 May 2022", "title": "MSC Candidate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ivey Business School", "Interview Descriptions": "Only behavioral questions. Around 1 hour in length. Interview time can be scheduled at your discretion. Behavioral questions can be found online. They reuse them every year. Make sure to practice a lot before the interview so you will have an organized and comprehensive answer", "Interview Questions": "Explain a time where you were given negative feedback and how you dealt with it"}, {"date": "16 Nov 2021", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ivey Business School (Toronto, ON) in Mar 2021", "Interview Descriptions": "Pretty easy just talking about how web development works, whether you are familiar with cmd, agile, and other web dev related topics. Skills in design are valued as well. Having good interpersonal relationships are something else that is valued.", "Interview Questions": "What agile is and whether I had experience with it"}, {"date": "30 Oct 2018", "title": "MSC Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Ivey Business School (London, ON) in Oct 2018", "Interview Descriptions": "There were three steps to the interview process. The first being the online application which was pretty similar to most graduate school online application processes where they ask for previous experience, why you want to join, and how you would benefit Ivey (and vice versa). The second part of the interview process was the online questions-answer session where you have roughly a minute to prepare an answer to a question and another couple minute to deliver it. The last part of the interview was the Skype/in-person interview. I opt'd for the in person interview. It was mainly behavioural questions and much of what you would expect from a graduate school interview style. That being said, they are looking for individuals who understand their industry well, and why they want to join the program. The key is to understanding how this program will benefit you.", "Interview Questions": "Tell us a time that you failed. How did you manage the situation and what did you do?"}, {"date": "28 Jul 2019", "title": "Lecturer's Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ivey Business School in Sept 2018", "Interview Descriptions": "Quite nice interviewers. Fast Turn around and timely response after every stage. Questions were very related to the role for the most part. Application process was easy as well. I think the large panel of interviewers was overkill tbh but I guess that's the system chosen.", "Interview Questions": "What would you do if a student misses a passing grade by only a few points?"}, {"date": "31 Aug 2018", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Ivey Business School (London, ON)", "Interview Descriptions": "I applied through an employment agency; when they sent my resume to Ivey I received negative feedback of 'we have received this applicant's application for several different human resources roles, and would not encourage the candidate to reapply'.", "Interview Questions": "N/A"}, {"date": "1 Nov 2017", "title": "Master Degree Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Ivey Business School (London, ON) in Aug 2016", "Interview Descriptions": "online test first,\r\nthen in person\r\nall behavior questions\r\nabout 15 questions\r\n5 question about why ivey\r\n10 questions about behavior\r\nalways ask for details\r\nbe prepared to tell lots of story of ur own\r\nkinda under pressure environment", "Interview Questions": "why ivey"}, {"date": "16 Aug 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ivey Business School in Jul 2016", "Interview Descriptions": "Two Rounds of interviews, first with HR, second with department head. Both about an hr. Very friendly and up front about the process, except that their contracted to hire internal candidates, which is what they did. Even still not a waste of time, great interview experience.", "Interview Questions": "Name a time you had a difficulty with a co-worker and how did you handle it."}, {"date": "9 Feb 2017", "title": "MBA Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ivey Business School in Feb 2016", "Interview Descriptions": "It was quite amicable and it took about 50 minutes.\r\nMostly just behavioral questions like why MBA? Why Ivey? Why now? Leadership example, etc. What the school looks for is your potential rather than your current accomplishments. Be sure you clearly know what your career goal is and how you can leverage what you gain from Ivey to achieve that goal.", "Interview Questions": "N/A"}, {"date": "12 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Ivey Business School (London, ON) in Sept 2015", "Interview Descriptions": "The process was pretty easy, submitting a resume, cover letter and a sample of writing. It was followed by a non formal interview by the professor I was going to be researching for. The professor told me immediately after the interview whether I was chosen or not.", "Interview Questions": "Have you had experience in research before"}, {"date": "18 Feb 2015", "title": "Alumni Contact Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ivey Business School", "Interview Descriptions": "The interview process consisted mainly of a telephone interview that focused on fit. Questions asked included what my strengths and weaknesses were, what would I would do in a particular situation to ensure that I had the desirable soft skills, what do I feel about this, etc. The overall process took 1 week.", "Interview Questions": "Strength/Weaknesses\r\nFit"}], [{"date": "4 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ivey Business School (London, ON) in Oct 2013", "Interview Descriptions": "Set down with a professor to discuss about my strength and my previous experiences. The professor reviewed my resume in front of me and briefly talked about the role of the research assistant.", "Interview Questions": "What is your biggest strength"}, {"date": "14 Nov 2009", "title": "MBA Applicant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Ivey Business School (London, ON) in Dec 2008", "Interview Descriptions": "One of the most interesting things about the interview process at Ivey was the fact that there actually were two admissions interviews. First interview was conducted by a member of an admissions team and another by a member of career services. I was told that the main purpose for the second interview is to determine how employable you are going to be at the end of the program, and also to confirm that you have a clear career focus, which is especially important for one year MBA programs. I think that it's a really good idea and it is unfortunate that there few other school that go through the same rigorous process to select their students. One thing that for example surprised me about Schulich MBA at the University of York, Toronto was the fact that they've told right when I met them as long as I have the 660 GMAT I'm in, no interview no nothing... that's good and not so good at the same time. It guarantees you entry but doesn't provide any assurance that the caliber of your MBA classmates is going to be up to any standards. They might have been able to wing the GMAT but they have a limited practical experience and lack of communication skills, for example...\r\n\r\nBoth interviews at Ivey were over the phone and the first interview was with a Manager of Admissions. Since I was provided with her name ahead of time I was able to do a bit of research and find out that the lady actually taught some undergrad courses at the university level and was in her late 20s. Based on that information I put together couple of relevant questions that tied together her experiences teaching undergrad business courses as well as the MBA program. During the interview she asked me the usual questions about the resume and my essays. It felt like she spent some time reading through my background and had a pretty good handle on it. One of the most interesting questions that was addressed to me was modeled after the approach that the school is using to \"cold call\" students in class when talking about different challenging situation. In this particular case I was asked what are some of the biggest challenges that the industry I'm working in is facing and possible ways those could be addressed. This question makes sure that you can really think on your feet. I found that I had to stall the conversation for couple of seconds to summarize the answer in my head before presenting it, and the interviewer approved of my approach saying that it's OK to think about it for couple of seconds. Overall interview went well and it lasted exactly 30 minutes. I found it was very well structured with excellent and honest answers to the questions that I had in return: for example I've asked the interviewer why she did not go through the program herself, and her answer was that the Undergraduate HBA program at University of Western was fairly similarly structured to the old MBA program and that it did not make that much sense at the time :)\r\n\r\nMy second interview with a member of career services took place 3-4 days after the first one. This one felt more like a job interview based on the short-term career goals that I've outlined in my admissions essay. It was a lot of questions like: What were the main reasons you moved from this position to that, what were the main skills that you've learned in that particular job that you think would be most applicable to the field that you've chosen to pursue upon the graduation from the MBA program. I would say it was the easier of the two interviews. The interview lasted 30 min and included a question period during which I clarified the finer points about the differences in early placement between the students that are graduating from the last intake of the two year Ivey MBA program and the ones graduating from the first intake of the new one year Ivey MBA program. Again I was given excellent concise answers. And was told to expect the final decision within next 3-4 weeks.", "Interview Questions": "Your resume states that you served in a leadership role. What was that experience like?"}]]