[[{"date": "7 Jun 2023", "title": "Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Wayside Youth & Family Support Network", "Interview Descriptions": "I recently went through the interview process with Wayside and wanted to provide my sincere feedback on the experience. While there were positive aspects, I must express my disappointment and concern about certain aspects of the process. One significant issue was the slow pace of the hiring process. While I understand that everyone is busy, the timeline seemed unnecessarily lengthy. This delay made it difficult for me to plan and manage my expectations, especially since I had declined other offers based on my belief in the agency's mission and leadership. Unfortunately, I was left feeling disillusioned with the overall outcome. Furthermore, I was initially impressed by the communication during the early stages. However, I was let down when many promises made were not fulfilled. Despite being assured of timely follow-up calls and receiving additional information, there was no follow-through whatsoever. This lack of fulfillment reflected a lack of organization within the company and left me feeling undervalued as a candidate.", "Interview Questions": "base interviewing questions, background and position related."}, {"date": "16 May 2023", "title": "Mentor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wayside Youth & Family Support Network (Methuen, MA)", "Interview Descriptions": "Very open and accommodating! I felt comfortable and the staff were kind. They made an effort to be respectful and friendly throughout the entire process and I enjoyed the atmosphere.", "Interview Questions": "About my experience as well as my personal interests."}, {"date": "31 Mar 2021", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wayside Youth & Family Support Network", "Interview Descriptions": "I visited their offices and I was asked questions about what made me interested in the position and about what experience I had working with a child who was dealing with difficult emotions/situation and how I helped them", "Interview Questions": "How did you help a child in the past who was very upset? How did you manage the situation?"}, {"date": "21 Oct 2020", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wayside Youth & Family Support Network in Oct 2020", "Interview Descriptions": "Because of the pandemic, the interview was conducted over Zoom. They asked me a little bit about myself, explained their facility and the position I applied for in more detail, and asked a series of questions about how I would respond in different scenarios.", "Interview Questions": "Tell us about a time where someone asked you to keep something a secret. How did you respond? "}, {"date": "28 Mar 2022", "title": "Customer Service Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wayside Youth & Family Support Network (Orlando, FL) in Mar 2019", "Interview Descriptions": "Very simple and quick paced to begin the process . All communications via phone or email. Once reached out to make sure to reply in timely manner to be able to further proceed with the interview", "Interview Questions": "Tell me about yourself and strengths and weaknesses"}, {"date": "22 Jun 2018", "title": "Clinician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wayside Youth & Family Support Network in Mar 2018", "Interview Descriptions": "The interview was with a director, a clinical supervisor, and a clinician. They asked a couple \"what would you do if ...\" questions. I didn't get to the second round.", "Interview Questions": "Tell us a mistake you made."}, {"date": "5 Sept 2017", "title": "Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Wayside Youth & Family Support Network (Framingham, MA) in Apr 2017", "Interview Descriptions": "Two interviews, the first with a Director, a Clinical Supervisor, and a Clinician, the other with several clinicians and the same Director. Everyone was quite positive and I was patient with the obvious multiple crises going on on the other side of the door, which caused several interruptions as folks had to come and go (it's residential, and to be expected).  On the second interview, the Director seemed to have her mind made up ahead of time that I was not wanted and kept hammering me with negative things like the salary being less than I wanted, the overtime being frequent, the home visiting being frequent, until I finally gave up and left (not because of those conditions, just because I felt bullied and disrespected)", "Interview Questions": "Standard clinical questions"}, {"date": "4 Apr 2016", "title": "Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wayside Youth & Family Support Network (Framingham, MA)", "Interview Descriptions": "Had two interviews\r\nthe first interview was with 2 clinicians \r\nsecond interview I was offer position \r\n\r\nWayside is all about helping children and families , if you do not have a passion for either this is not the place for you", "Interview Questions": "N/A"}, {"date": "10 Jul 2018", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wayside Youth & Family Support Network (Waltham, MA) in Apr 2016", "Interview Descriptions": "Interview process was simple. They asked you to submit resume, they then called and I went in for an interview. There were two supervisors during the interview asking questions related to experience.", "Interview Questions": "They asked about past experience and what you are excited for within their agency."}, {"date": "11 Mar 2016", "title": "Youth and Family Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Wayside Youth & Family Support Network", "Interview Descriptions": "Applied online with resume and cover letter and then followed-up via email. Was asked to come in for an initial first interview in person with one of the supervisors.  Got called back for a second in-person interview within a week or two. Came back for a second in-person interview with other supervisors and staff.  Was asked to submit 3 references and did so. Heard back from the agency within a week extending an offer.", "Interview Questions": "Give an example of a time that you worked in a group, and what the dynamic was like."}], [{"date": "3 Mar 2016", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wayside Youth & Family Support Network (Framingham, MA) in Dec 2015", "Interview Descriptions": "I met for an initial interview with the Program Director and a current program clinician and Youth Support Worker.  After this I was asked to complete clinical vignettes to submit before hiring.  Although I did not have a second interview, this is often also part of the process.", "Interview Questions": "N/A"}, {"date": "23 Nov 2015", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wayside Youth & Family Support Network", "Interview Descriptions": "Expect two interviews. They are fairly standard in regards to questions such as wanting to know about your experience, why you got into social work, and what your career goals are.", "Interview Questions": "Tell us about a time you made progress with a client."}, {"date": "3 Mar 2016", "title": "Intensive Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wayside Youth & Family Support Network (Lowell, MA) in Aug 2015", "Interview Descriptions": "It was very professional and ethical. It was clear and well explained. I applied online and a few weeks after I received a phine call from the area director. She introduced herself and invited me for an interview. It was a process. I went for a second interview and shortly after I received the job offer. She needed to verify all my information including background checks and drug testing.", "Interview Questions": "Knowledge about services for families in the community."}, {"date": "25 Aug 2016", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wayside Youth & Family Support Network (Framingham, MA) in Sept 2014", "Interview Descriptions": "It started with a somewhat lengthy phone call with the person who would eventually be my supervisor. She gave me a lot of helpful information on the position as well as the services offered by the company and programs I would work with. Benefits were discussed. First in person interview was just with 2 supervisors, 2nd interview included a half dozen managers and included multiple clients.", "Interview Questions": "Talk about your biggest mistake."}, {"date": "3 Mar 2016", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wayside Youth & Family Support Network (Framingham, MA) in May 2014", "Interview Descriptions": "Friendly,  asked a lot of good questions.  Had good feedback about company,  explained job, benefits,  expectations and service I would provided.  I left feeling like I wanted to work for this company.", "Interview Questions": "Tell me about your experience \r\nTell me about struggles with clients and how you handled it"}, {"date": "9 Oct 2013", "title": "CONTINGENCY WORKER P/T Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wayside Youth & Family Support Network (Framingham, MA) in Aug 2013", "Interview Descriptions": "Assembly line offer to join firm at first meeting, dropping client with equivalent of 100 pages to study while doing 5 full time days in training.", "Interview Questions": "Interviewer asked how I would handle interpersonal boundaries-unexpected b/c it is such a baseline query as to make me wonder how many people get fired from there (she mentioned just before they had a serious problem with a staff and fired em' the weekend before..not sure I needed/wanted to know that!"}, {"date": "3 Mar 2016", "title": "Prevention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Wayside Youth & Family Support Network (Watertown, MA) in May 2012", "Interview Descriptions": "Nerve racking; but each part of the agency has a different way of interviewing. I had at least 6-7 individuals interviewing only me at the same time. how to deal with conflicts is a question that gets asked in most interviews. Usually, switching form one part of the agency to another will require a new interview.", "Interview Questions": "What new  refreshing ideas can you bring to the table."}, {"date": "3 Apr 2016", "title": "Assistant Program Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Wayside Youth & Family Support Network (Milford, MA) in Jan 2012", "Interview Descriptions": "During the interview they brought up conflict resolved over a year before, and basically told me I have no hope for advancement in the future. The whole process was a waste of time. They interviewed me knowing I has no chance.  Less than one month later I left. The whole process could have been avoided if the director had addressed concerns when they arose rather than trying to pretend nothing was wrong.", "Interview Questions": "Why I thought I was qualified for the job. "}]]