[[{"date": "26 Aug 2021", "title": "Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Monmouth University", "Interview Descriptions": "Sent resume then talked to someone in he then they brought me in to interview in the office.  It was nice and low key.  I found everyone really nice.  Then they called me a few days later to offer me the job", "Interview Questions": "What I wanted to do in my career"}, {"date": "16 Dec 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Monmouth University", "Interview Descriptions": "Lengthy but informative. Had the opportunity to meet a variety of staff, including the Dean of the program.  I was also given an extensive tour of the campus and program amenities. The campus is stunning. Parking was challenging. Everyone was pleasant even though we were not like minded professionals", "Interview Questions": "If you were a candy, what would you be."}, {"date": "31 Oct 2019", "title": "Assistant Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Monmouth University (West Long Branch, NJ)", "Interview Descriptions": "I applied for the job and heard back to schedule an interview two weeks later. The interview was well-attended by most of the department. After the interview it was another week or so before I was formally offered the position. The hiring process (paperwork, background check, etc.) took another two weeks.", "Interview Questions": "Have you ever used a CMS before?"}, {"date": "7 Jul 2021", "title": "Area Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Monmouth University (West Long Branch, NJ) in Aug 2019", "Interview Descriptions": "Met with all members of the department and there were 2 total interviews conducted. There was a tour of campus and a short meeting with members of HR to discuss benefits. Received a call from a member of HR within a week of the interview offering a position.", "Interview Questions": "Why did you choose to apply to Monmouth? "}, {"date": "17 May 2018", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Monmouth University (West Long Branch, NJ) in Feb 2018", "Interview Descriptions": "The process was very simple, just a few personal questions about yourself and your major. basically about yourself. they tend to look at good, hardworking students and offer them positions quickly", "Interview Questions": "What is your major\r\nWhat profession do you intend to pursue\r\nGrade level"}, {"date": "26 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Monmouth University", "Interview Descriptions": "Filled out an online application. The online application just asked you about your experience and motivation for the job. After I filled out the online application, they sent me an email verifying that I had been accepted for the position.", "Interview Questions": "The questions just asked about your experience and motivation for the position"}, {"date": "10 Aug 2016", "title": "Laboratory Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Monmouth University (Long Branch, NJ) in Aug 2015", "Interview Descriptions": "I met with various professors in the chemistry department one on one as well as in a group.  They each showed me their labs and described their individual jobs at the university.  I saw all of the equipment that I would be working with and all of the job requirements were described to me in detail.  This was a new position for the chemistry department so the hours of employment were not established.", "Interview Questions": "Where do you see yourself in the future?"}, {"date": "1 Jul 2015", "title": "Director of Field and Professional Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Monmouth University (West Long Branch, NJ)", "Interview Descriptions": "Difficult committee interview. When I did it it was a small group process, but now I think it will be a larger committee. It will be a tough interview with probing questions. Be prepared to shine in your answers about advocacy and human rights.", "Interview Questions": "Standard questions"}, {"date": "27 Mar 2017", "title": "Human Resources Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Monmouth University in Sept 2014", "Interview Descriptions": "Go to student employment in Bey hall and ask to work anywhere on campus. They give you an application to fill out. then they give you options of where you might want to work. (in Campus or off campus).", "Interview Questions": "Why are you interested in working here"}, {"date": "11 Nov 2015", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Monmouth University (West Long Branch, NJ) in May 2012", "Interview Descriptions": "looked at the transcript of the relevant courses and did a mini interview on why you wanted to be a tutor. There was a training that helped identify the methods of successful tutoring, common sense.", "Interview Questions": "Why do you want to be a tutor?"}], [{"date": "15 Jul 2015", "title": "Ice Hockey Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Monmouth University (West Long Branch, NJ) in Jun 2011", "Interview Descriptions": "Spoke with HR and Director of Intramurals at the Campus, the interview was very unstressful.  I was basically asked of my knowledge of hockey as well as my coaching experiences. They explained the position thouroughly and that it required a few overnight trips on weekends and was a heavy weekend schedule with friday and saturday night games.", "Interview Questions": "Hockey experience, coaching experience etc."}]]