[[{"date": "29 Mar 2019", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texila American University (Coimbatore) in Mar 2019", "Interview Descriptions": "There were three rounds of interview. The first round was Written, followed by technical round with the team Manager and finally there was one final interview with the Marketing Head", "Interview Questions": "Content writing related to SEO"}, {"date": "21 Feb 2023", "title": "Software Tester Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texila American University in Feb 2019", "Interview Descriptions": "2 round of interview.one is technical and another is hr.And if required system test will be there.As a experienced tester I found interview is easy.They recurited myself as senior software tester", "Interview Questions": "Testplan,Test scenarios,Testcases,levels of testing,procedure to carry out testing from start to end"}, {"date": "6 Sept 2018", "title": "Enrolment Advisor Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texila American University (Coimbatore)", "Interview Descriptions": "They ask lots of personal questions the people make you feel comfortable it is a professional setting. I took my academic assessment and set an appointment for my interview the same day I received my results.", "Interview Questions": "Why do you think this position is right for you?"}, {"date": "27 Aug 2018", "title": "Marketing Manager Interview Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Texila American University (Coimbatore)", "Interview Descriptions": "I applied and was contacted a week later for a phone interview. I was told I'd hear back by the middle of the following week, but I didn't. After a follow up email, I was invited for a face to face interview. I went and met the HR and they replied saying they will give a call by the middle of the following week. Once again, I didn't hear back so I followed up with an email. I ended up getting a generic rejection email a day later.", "Interview Questions": "Have you ever increased interest in a product that was floundering? How?"}, {"date": "17 Aug 2018", "title": "Campaign Manager Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texila American University (Coimbatore)", "Interview Descriptions": "I applied online and received a call a few weeks later. There was a telephonic interview, followed by face to face interview scheduled with the HR personnel followed by interview with concerned Department head and finally a panel interview with Executive Vice President, Operations Head and Manager.", "Interview Questions": "Tell me how you organize, plan, and prioritize your work."}, {"date": "19 Apr 2018", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Texila American University (Bengaluru) in Apr 2018", "Interview Descriptions": "3 rounds of interview, \r\n1st Round was telephonic with the HR. - \r\n2nd Round was technical Round - It was not a pleasant things as it was scheduled 3 different times which did not happen on those timings.\r\n3rd Round was the CEO round. - Interview was face and scheduled at a particular time and I was on time but they made me wait for 2 hours and they were least bothered. It was really Frustrating and they were not apologetic for making someone wait. \r\nTried calling and messaging  the HR for the feed back . Never answered. Then got a email that we got other candidate.  \r\nReally not a Good Feel and no respect for the candidates.", "Interview Questions": "Over all Digital Marketing Experience"}, {"date": "17 Nov 2018", "title": "Front Office Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Texila American University (Coimbatore) in Sept 2017", "Interview Descriptions": "Initial Round was telephonic round. They screened my skills and checked whether I will suit for their requirement. The Second round was with HR team where I was asked about my previous experience and about myself.\r\nFinal round was with Admin Manager.", "Interview Questions": "Why is a receptionist important to an organization? "}, {"date": "29 Nov 2020", "title": "Student Affairs Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Texila American University (Coimbatore) in Mar 2017", "Interview Descriptions": "It was elaborate and a multi-stage process. They asked me  to fill in  a form with my aspirations and previous job description, conducted preliminary interviews, and finally in-person interviews both one on one and panel interview", "Interview Questions": "About my failures and successes in my previous employment"}, {"date": "19 Dec 2018", "title": "Account Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texila American University (Coimbatore) in Dec 2015", "Interview Descriptions": "First I had a telephonic interview and then after a week I was asked to come down for a personal interview in Texila Office. But the final result was announced very late.", "Interview Questions": "Please describe your working style? "}, {"date": "18 Jul 2017", "title": "Business Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Texila American University (Coimbatore) in Nov 2015", "Interview Descriptions": "They conduct interview in more profession ways.  First need to attend the IQ test. Once the IQ test is completed need to attend work related skill review after that group discussion Next personal interview with HR. They also conduct background verification.", "Interview Questions": "My Experience and how he will adapt to this company?"}], [{"date": "10 Sept 2018", "title": "Recruitment Manager Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texila American University (Coimbatore) in Jul 2015", "Interview Descriptions": "I applied online. The process took 2 days. \r\n\r\nReview process was fairly easy, it was conducted over Phone. It was easy. This was a recent interview, so I am still in consideration for the position.", "Interview Questions": "What would your plan be for the first 6 months of the job?\r\nHow would you convince someone who is not on board with the goals of the organization?\r\nTell me about your experience and how it relates to the job?\r\nWhy do you want to work at Texila?\r\n"}, {"date": "4 Aug 2017", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Texila American University (Coimbatore) in Nov 2013", "Interview Descriptions": "It was in a professional way. First round with aptitude test. Second round with Digital marketing head and also there is panel round interview with all the Managers which is in a professional way. Final round with HR manager. It is really a good interview process", "Interview Questions": "About my previous experience in Digital Media"}]]