[[{"date": "20 Jun 2023", "title": "Human Resources Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Appalachian State (Boone, NC)", "Interview Descriptions": "Scheduled an interview, which included 3 employees interviewers taking turns asking questions. Questions were fairly typical- included questions related to the position and questions related to previous experience. They were very nice and it took about 20-30 minutes.", "Interview Questions": "Explain your experience with confidentiality?"}, {"date": "23 Nov 2022", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Appalachian State", "Interview Descriptions": "Lengthy and unprofessional. Was considered a top candidate for a position then gaslighted when expecting a decision. Unfortunate for administrative staff—I thought a University would do better. Would not recommend working in this department if an applicant has other alternatives.", "Interview Questions": "What is your flexibility for this role?"}, {"date": "30 Dec 2022", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Appalachian State in Oct 2022", "Interview Descriptions": "Very inclusive and open. They provided questions ahead of time, and the option to provide a recording of the pronunciation of your name. The interview itself was very warm and personal.", "Interview Questions": "What about App State appealed to you?"}, {"date": "17 Aug 2022", "title": "Graduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Appalachian State", "Interview Descriptions": "one interview with professor i’d be assigned to  and head of department , straight forward questions about under grad and extra relevant curricular activities. no surprises. it was overall a quick process, 2 weeks between submitting  application and interview.", "Interview Questions": "What experience do you have? "}, {"date": "18 Jan 2022", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Appalachian State", "Interview Descriptions": "There is no interview. Being chosen is mainly based on your grades, and your professor's opinions of you. Just have a good GPA and you will be chosen for this position.", "Interview Questions": "There were no questions, as there was no interview."}, {"date": "26 May 2022", "title": "Associate Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Appalachian State in Nov 2021", "Interview Descriptions": "The interview process had 3 steps. An initial phone call, a zoom interview with the search party, and an in-person interview with the search party, plus other department heads. The final interview took about half a day 4/5 hours.", "Interview Questions": "They asked what type of events I would plan for different situations."}, {"date": "18 Mar 2021", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Appalachian State", "Interview Descriptions": "Simple, concise, professional. Everyone was super polite and seemed genuinely interested in learning more about me. They presented well-crafted questions related to the job. Overall, it was a positive experience.", "Interview Questions": "Why do you want to pursue a career in research?"}, {"date": "11 Mar 2021", "title": "Grad Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Appalachian State", "Interview Descriptions": "Simple, must meet requirements like GPA, acceptance to program, etc. it was straight forward and pretty easy to ask questions when needed. People were transparent about expectations too so that was helpful", "Interview Questions": "What are your goals for this year?"}, {"date": "19 Oct 2021", "title": "Computer Science Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Appalachian State (Boone, NC) in Nov 2020", "Interview Descriptions": "I got interviewed and they asked me a bunch of questions about myself.  Overall it was a good but stressful experience because it was an interview.  I also got to ask them questions like any interview so I would say that this interview went well because I got the job.", "Interview Questions": "They asked me about myself."}, {"date": "7 Aug 2020", "title": "Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Appalachian State", "Interview Descriptions": "The scheduling and process were straightforward. Appreciated being reached out to directly and having time to discuss my background and what they were looking for. We had a really good conversation.", "Interview Questions": "N/A"}], [{"date": "24 May 2021", "title": "Night Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Appalachian State (Boone, NC) in Aug 2020", "Interview Descriptions": "The process was quick, and included short questions about yourself, ability to work in stressful environments, confront policy violations or an a crisis, and work with others. It was pretty easy, short, and brief.", "Interview Questions": "Would you speak up to your friends "}, {"date": "17 Mar 2020", "title": "Orientation Undergraduate Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Appalachian State (Boone, NC) in Apr 2019", "Interview Descriptions": "Pretty laid back for the most part. Began with a panel interview, then those who made it to the next round completed group interviews with other applicants. The group interviews were more laid back than the panel.", "Interview Questions": "How would you deal with a parent that didn't want to leave their child"}, {"date": "12 Apr 2022", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Appalachian State (Boone, NC) in Dec 2018", "Interview Descriptions": "The interview was very conversational and low pressure with an emphasis on whether the opportunity was the right fit for my lifestyle and the university’s needs. I was impressed with their open, supportive attitude.", "Interview Questions": "Tell me about your education and experience. "}, {"date": "17 Apr 2018", "title": "Customer Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Appalachian State", "Interview Descriptions": "Very smooth process. Hired from a temp pool. Two interviews, one with immediate supervisors, and one with department director. First interview was strictly off a list of committee questions and went quickly. Second interview was a few days later and was more personal and informative.", "Interview Questions": "Give an example of one time you had to resolve a disgruntled customer's problem"}, {"date": "3 Apr 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Appalachian State", "Interview Descriptions": "Applied through emailing a supervisor, completed a phone interview and was offered the job the next day. Very easy and positive interview experience. The interview phone call took about 30 minutes.", "Interview Questions": "are you comfortable asking alumni to donate money."}, {"date": "8 Jul 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Appalachian State (Boone, NC) in Mar 2017", "Interview Descriptions": "Easy interview, with a an in-person interview and a few questions about you and who you are. I knew someone a the office, however they were looking to see if I was able to be professional and work along side other students.", "Interview Questions": "Tell me a little bit about yourself."}, {"date": "10 Dec 2019", "title": "Computer Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Appalachian State (Boone, NC) in Jan 2017", "Interview Descriptions": "The interview took about 30 minutes. They asked all the usual questions that interviewers ask to make sure you're knowledgeable in the subject. I never spoke with a HR representative but rather interviewed with the boss directly.", "Interview Questions": "Why do you feel you would make a good fit with us?"}, {"date": "17 Sept 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Appalachian State (Boone, NC) in Dec 2016", "Interview Descriptions": "I submitted my application materials in November and the department scheduled a video interview in late December. The interview occurred over Zoom, and five search committee professors participated. The committee chair conducted the bulk of the interview, although each member had at least a couple of prepared questions. The entire interview lasted approximately 30 minutes.", "Interview Questions": "How will my research program complement the department's ongoing research projects, and  what external funding can I expect to receive?"}, {"date": "8 Nov 2015", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Appalachian State (Boone, NC) in Oct 2015", "Interview Descriptions": "Following the online submission of my application materials, I was contacted within the next 24 hours via email by the selection committee and thanked for doing so and asked to complete a brief online equal opportunity survey. I was again contacted within 10 days later to schedule a time to do a video-based interview with the committee.  I was given multiple times and days to select from.  The interview was about 20 minutes in length and had about 6 committee members present (though I was only able to see about 3 of them).  I was asked 3 questions (that were provided to me via email the night before the interview) and then given the opportunity to ask questions as well.  The faculty conducting the interview were extremely polite and professional.", "Interview Questions": "How do you see yourself fitting in at App State and in the rural setting?"}, {"date": "28 Aug 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Appalachian State", "Interview Descriptions": "Discussed what the job is about and went on a tour. Very positive experience overall! Everyone is very friendly and I couldn't ask for a better place to work. No drug tests or background checks, though they did verify my listing on the CNA registry. I thought I did great, then they took FOREVER to get back to me, but I got the job! Great experience working at this place.", "Interview Questions": "Describe a time when you were put in a difficult situation and handled it well."}], [{"date": "3 Nov 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Appalachian State (Boone, NC) in Jun 2015", "Interview Descriptions": "The interview process is fairly straight forward, yet competitive. You have to submit an essay to the Walker College of Business each semester you wish to be a graduate assistant. At the same time, you are competing with other students in order to show the program why you are the best candidate for the position at that time.", "Interview Questions": "Why do you deserve to be a graduate assistant?"}, {"date": "15 Jun 2015", "title": "Business & Technology Applications Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Appalachian State (Boone, NC) in Apr 2015", "Interview Descriptions": "It was a group interview process where everyone read pre-determined questions.  There was not a lot of opportunity to interact and/or for them to learn more about you as a person.  I understand the desire for them to hire solely based upon someone's technical experience, but the position also required a lot of project management and consultation with other departments.", "Interview Questions": "How do you handle managing large projects"}, {"date": "14 Jul 2015", "title": "Media Lab Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Appalachian State (Boone, NC) in Sept 2014", "Interview Descriptions": "Short, and i felt like most anybody could have gotten this job based on the short and ineffective process. Although i think I was qualified, others there were not and still obtained a job easily.", "Interview Questions": "Why do you want to do this"}, {"date": "29 Apr 2016", "title": "Cafeteria Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Appalachian State (Boone, NC) in Jul 2013", "Interview Descriptions": "The interviewing manager is professional, thoughtful, and kind. I appreciated the brevity, she seemed to be rushed but was very collected. Interviewer seemed to be more interested in my attitude towards working on a team than my hard copy resume, which was interesting. \r\nPersonally I really like the management and their style, though I had peers who seemed intimidated by their approach.", "Interview Questions": "Describe a circumstance in which you had to deal with a special needs customer"}, {"date": "9 Dec 2011", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Appalachian State (Boone, NC) in Dec 2011", "Interview Descriptions": "The faculty and dean of the school to which I applied went out of their way to make me feel welcome.  They took a great deal of time from their busy schedules to meet with me and make sure that I was comfortable.  They listened carefully to me and offered many opportunities for me to get my questions answered.  Overall, it was the best interview experience I've ever had.", "Interview Questions": "How would you change our curriculum?"}, {"date": "2 Jan 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Appalachian State (Boone, NC) in Sept 2011", "Interview Descriptions": "I was asked to meet with a particular person in my department after I expressed interest in employment with the department while attending graduate school.  I believe graduate students in the Technology Department are ideally paired up with a professor or mentor whose research interests are aligned with the student.  My background enabled me to get involved in some building science research.", "Interview Questions": "Tell me about your computer programming background."}, {"date": "26 Oct 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Appalachian State (Boone, NC) in Jan 2011", "Interview Descriptions": "All that was required was a resume submittal and an in-person interview. No real questions other than availability and commitment level. It was extremely easy and as long as you can work a few hours a week, they're willing to work around your school schedule.", "Interview Questions": "How many hours would you like to work?"}, {"date": "14 Sept 2015", "title": "Information Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Appalachian State (Boone, NC) in Jan 2011", "Interview Descriptions": "I had to fill out an application, and came in late in the game, so they only had one shift available. However, this didn't matter because it is so easy to pick up additional shifts anytime. I had a guaranteed 6 hrs a week of work, but I worked more like 15-20 that first semester easy!", "Interview Questions": "What is your previous experience."}, {"date": "29 Mar 2010", "title": "Conference Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Appalachian State (Boone, NC) in Mar 2010", "Interview Descriptions": "Very simple and quick. Fill out an application and turn it into the office. They will call you for an interview but will not hire you until positions are open. They will keep interview and app on file.", "Interview Questions": "What are your strengths? "}]]