[[{"date": "11 Mar 2022", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Thorek Memorial Hospital", "Interview Descriptions": "Very organized and ready to hire on the spot; I met with most of the HR team and was very impressed with how open, organized and welcoming all the team was. I and looking forward to starting my new role.", "Interview Questions": "Tell me about your experience working with high acuity clients. "}, {"date": "13 Oct 2021", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thorek Memorial Hospital", "Interview Descriptions": "It was pretty laid back and non-threatening environment. I met with the CEO who was super nice and accommodating to my requests. The CMO was present briefly through call conference.", "Interview Questions": "Do you have any questions for us? "}, {"date": "28 Jan 2020", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thorek Memorial Hospital (Chicago, IL)", "Interview Descriptions": "The interview was very quick. I believe they already had in mind who they wanted. They called us in by the order of who they wanted the most and who they didnt want. Once the person they wanted turned down the position they finished interviewing the remaining 2. Which included me as well. I knew I didn't get the job before I had the interview. I was the last person they called in and I was in there maybe 10 minutes", "Interview Questions": "How do you feel about working Psych?"}, {"date": "25 May 2019", "title": "Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Thorek Memorial Hospital", "Interview Descriptions": "I was already hired due to contract status at my company  so not interviewed by Thorek directly. When my company met with them it was challenging but manageable", "Interview Questions": "How long have you been doing this "}, {"date": "23 Aug 2018", "title": "Mental Health Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thorek Memorial Hospital (Chicago, IL) in Aug 2018", "Interview Descriptions": "My interview was scheduled for 1:15pm, and I arrived at 1.  No one even spoke to me until around 1:40pm.  The woman who was supposed to interview me had already left for the day and completely forgotten about our interview, so the woman that ended up interviewing me (nearly an hour after my interview was scheduled for) hadn't even seen my resume and couldn't find it.  It was a pretty terrible experience.", "Interview Questions": "So tell me about yourself, because I don't have your resume."}, {"date": "27 Mar 2018", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thorek Memorial Hospital (Chicago, IL) in Mar 2018", "Interview Descriptions": "I submitted my resume to Indeed and a nursing supervisor contacted me by phone about setting up an interview. I had to call them back about a date and time. Then I went and interviewed with a nursing supervisor and the chief financial officer of the hospital. The HR representative just shuttled me from one office to the next and then we were done. I appreciated that the application was emailed to me and they told me I should bring an extra resume so I had time before hand to fill it all out and print it.", "Interview Questions": "What do you do? Where do you work now? Why do you want to work here? "}, {"date": "25 Jan 2018", "title": "Medical Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thorek Memorial Hospital (Chicago, IL) in Jan 2018", "Interview Descriptions": "I received a call to interview for the position within three days of applying online.  I met with the COO briefly prior to my main interview in order to review my qualifications for the position. I spoke with him for one minute and things felt rushed and awkward as he was distracted.  I then met with the supervising RC for the floor I would work on. She was rushed and unprofessional in the interview. She spent the majority of the 20 minute interview talking about the position, which was helpful, but spent no more than 5 minutes total allowing me to speak to my qualifications. I was rushed out of the interview and told I would receive a call from HR in two weeks regarding their decision.  I did not receive a call or email back ever.", "Interview Questions": "What experience do you have working in the medical social work?"}, {"date": "30 Sept 2017", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Thorek Memorial Hospital (Chicago, IL) in Sept 2017", "Interview Descriptions": "Got a call from the company and scheduled the interview the next day. Met with the HR who was nice but didn't talk about the job itself; she insures the application was fully filled out. Next, I met with one of the hiring managers (I was told I'm going to meet with another one manager afterwards). The first question she asked me was why I left my old job. After learning why I left my last job, she start asking me personal questions that DOES NOT related to the job nor my ability to perform the job. I felt VERY uncomfortable, I felt like I was being judged. At that moment I really want to ask her how is that relevant but thought it was rude to do so and thought she would stop after I gave her an answer but she keep coming with more personal questions. Her voice was not nice at all, not one smile. She kept raising her voice like I am criminal or something.  She keep emphasizing that this is a secretary position as if I can't hear her and describe the position and which department it is. I'm glad she can read my uninteresting face when she told me which department it will be and also gave me a good reason to exit the interview without being rude.  My impression was that manager was more interesting in my personal background more than my work experience and obviously she wants to scare me away from the position. The entire interview was mostly asking me personal questions. As far as I remember only 3 questions related to job: why did you left your last job, have you work at a hospital before (it's listed on the resume if she would look) and are you interested in this position. To come to think of it, I'm not even sure if the personal questions she asked  violated the code of ethic", "Interview Questions": "Why did you left your last job?"}, {"date": "29 Aug 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Thorek Memorial Hospital (Chicago, IL) in Jul 2017", "Interview Descriptions": "They got back to you in a timely manner.  If you matched their requirements, they will get back to you very timely.  They knew exactly what they wanted as an employer and they are very good at finding the right person to fit the job.", "Interview Questions": "What kind of environment are you looking to work for?"}, {"date": "23 Jun 2017", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Thorek Memorial Hospital (Chicago, IL) in Jun 2016", "Interview Descriptions": "The interview was fairly quick and simple. The doctor asked if I wanted to learn more about the medical field and asked why I chose medicine. He did not want anyone who was there just to do a job but someone who was there to make a difference.", "Interview Questions": "What is your reason for pursuing medicine?"}], [{"date": "16 Apr 2017", "title": "CNA/Caregiver Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thorek Memorial Hospital (Chicago, IL) in Jun 2014", "Interview Descriptions": "They contacted me briefly on the phone and in email. i came in the same week and was first interviewed by HR in the basement. He asks a few questions and makes copies of my documents and tell me when to come back. when i return to the second time i meet the COO and she interviews me and Vets me then i go back to the HR and he tells me if its good i will be called to come back. i come back the next day and i take a Urine and Blood test as well as a personal mask fitting and at the end they give me a form to take to a uniform store to get a free embroidered uniform which takes about a week. once you get it youll be working with another CNA that next monday of the new week.", "Interview Questions": "how experienced are you at taking and recording vitals?"}]]