[[{"date": "12 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI)", "Interview Descriptions": "First a phone interview to gather your interest in the position and verify your details. About one week later I had a zoom interview with 2 of the managers of the unit. After the interview, you are sent an email to fill in your reference details, CPR and license information. It took about 2 weeks to hear back about the position I was offered.", "Interview Questions": "What are your strengths? Tell me about a time you had conflict with another coworker? Tell me about a time you made a mistake and what did you learn? What are your career goals?"}, {"date": "14 Mar 2023", "title": "Contract Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Wisconsin (Germantown, WI) in Mar 2023", "Interview Descriptions": "Had a 3 panel interview, all very easy to talk with. Felt like they were truly listening and interested in my responses. Very good experience overall! I am excited to start working for them!", "Interview Questions": "Tell us the most impactful thing someone told you during your life that affected your work ethic."}, {"date": "21 Feb 2023", "title": "Business Operations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Wisconsin", "Interview Descriptions": "First there's a HR phone screener. The HR woman was knowledgeable, personable, and great to talk to. A lot of HR people sound like they hate their jobs but she was very outgoing and enthusiastic. About a week later I was invited to an in-person interview with the hiring manager. The interview was very casual and lasted around 30 minutes. The hiring manager seemed like she would be a great person to work for. I had an offer pending with a different company. I let Children's Hospital know this. At first they seemed eager to move the process along with me. I was asked for 3 references. The references had to fill out an online questionnaire. After that, I was asked for my transcripts. Then, I received an email telling me they had another interview to do later that week and that they didn't want me to miss out on another opportunity. I quickly responded back that I was still interested in the position I applied to and would like to remain in consideration. The hiring manager responded back positively and said she was glad. I foolishly misread the entire situation and took her at face value. I ended up declining my first offer in anticipation of receiving an offer with Children's. Unfortunately, a week passed and I emailed the hiring manager for an update. Moments later the HR woman messaged me and told me they were going with an internal candidate. It felt horrible and left a bad taste in my mouth about Children's Hospital. I would have much preferred transparency about the internal candidate; if I had known, I wouldn't have declined my first offer because we all know the internal candidate almost always wins. I also disliked that they bothered my three references and asked for transcripts when they had an internal candidate pending. Not a great experience.", "Interview Questions": "Why are you interested in this position?"}, {"date": "17 Feb 2023", "title": "Foundation Events Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Wisconsin", "Interview Descriptions": "This process took well over a month and there were many rounds of interviews. The contact at HR was very helpful and moved things along nicely, however, it was still a very long process!", "Interview Questions": "Give an example of a time that you had to innovate quickly."}, {"date": "3 Feb 2023", "title": "Org Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Wisconsin", "Interview Descriptions": "I had four interviews spoke with 9 people: screen, hiring leader, team and senior leaders interviews were positive and after the last conversation I didn't get any communication at all.", "Interview Questions": "Standard questions for a mid-level leader"}, {"date": "6 Dec 2022", "title": "Development Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Nov 2022", "Interview Descriptions": "The whole process was disappointing from start to finish. Despite rumors I had heard about the Foundation, I wanted to be optimistic because it had so much potential. I was passed along to 3 different people for preliminary stage. In second interview leader barely interviewed me and was not impressed when asked for more details on position. Overall, I was turned off by whole process and wouldn’t pursue an opportunity there. I took a job with a national organization that impressed me from start to finish. I was seeking innovation and respect and I don’t think it is with Children’s. Did not wait around for next steps as I accepted another position.", "Interview Questions": "N/A"}, {"date": "22 Jan 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Children's Wisconsin (Milwaukee, WI)", "Interview Descriptions": "I had a video interview that I thought went well, so much so that I received a voicemail stating they were not pursuing any other candidates and looking to move forward with the hiring process. They ask for surveys to be sent to former bosses, coworkers, etc. At least 3-4 people have to fill out a list of questions about you. I’m not sure if they had questions about some of their answers or what, but I was basically ghosted. I was told I needed “job performance reviews,” and that’s what their recruitment team recommended. I sent them my externships evaluations of me which stated that I was competent in all my skill check offs and went out of my way to get that information, only to have no communication. I let multiple lines of communication know that I would appreciate an answer either way, only to be left on read and have my correspondences disregarded. This is unacceptable of any company, let alone a health care facility.", "Interview Questions": "What makes you a good fit?"}, {"date": "1 Jun 2022", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Children's Wisconsin (Milwaukee, WI) in Oct 2021", "Interview Descriptions": "Basic interview but it took forever for any movement. Had two interviews one with the manager of the department I applied to. Seems disorganized and not very efficient. The questions were very basic.", "Interview Questions": "Tell me about a time ... questions. Very elementary and basic for the position I was interviewing for. This was an indicator of how the company was run - a bit disorganized and chaotic."}, {"date": "4 Apr 2020", "title": "Supply Chain Distribution Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Mar 2020", "Interview Descriptions": "Very easy and personable. Easy communication and consistent contact even during the corona outbreak. They made sure all of your shots are updated and while doing that, allowed for shadowing.", "Interview Questions": "The questions were standard questions. Mainly asking why you want to be at children's and why you think you will fit the role."}, {"date": "6 Oct 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Wisconsin in Oct 2019", "Interview Descriptions": "Long, thorough process. Video, phone, and three in person meetings with groups. HR team was very helpful and responsive throughout the entire process; they shared how each step would go, how the determine salaries, shared benefits etc from the get go.", "Interview Questions": "What is your biggest weakness? Name an example of something innovative you’ve been apart of. "}], [{"date": "4 May 2022", "title": "Supervised Visitation Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Oct 2019", "Interview Descriptions": "Initially there is a phone screen. The next round is  Virtual with the supervisor and department manager.  There is also a blood screening. If necessary a chicken pox vaccination. Fairly quick turnaround.", "Interview Questions": "My experience working with families."}, {"date": "4 Dec 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Wisconsin (Neenah, WI) in Sept 2018", "Interview Descriptions": "I was initially contacted by a recruiter over the phone and set up a phone interview with her, had that it went great. I was told my info would be set over and would then set up an in person interview on-site with a manager. A week went by and I had to contact them, received a email back to schedule an interview. Had it a week later, went really well, there was the manager and one employee who worked as a Medical Assistant as well. At the end I was VERY optimistic about the position after leaving. A week went by and I contacted to follow up, heard nothing for a week, then got the reply of we are still in the interview phase and will let you know as soon as we hear any feedback. Another week went by...and another week! It's been almost 3 months and I have still not heard ANYTHING back at all, I emailed once again and heard nothing.. Very disappointing as I was so interested in this position and let other jobs go because of it..", "Interview Questions": "What made you apply for this position, What have you done to go above and beyond for a patient. "}, {"date": "20 Oct 2018", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Children's Wisconsin (Wauwatosa, WI) in Aug 2018", "Interview Descriptions": "Long and drawn out. Took me basically 6 months to get a job, was interviewed for a job I couldn't have at first, but eventually ended up getting in. Overall, it was worth it but you need to have experience or know people to get in here is the gist I got from the whole experience. I truly wish those applying better luck than I had because it was a very heart breaking process. Extremely happy to work here now though - I love it.", "Interview Questions": "What does team work mean to you?"}, {"date": "4 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Wisconsin (Milwaukee, WI) in Apr 2018", "Interview Descriptions": "Initial phone interview with HR, followed by a shadowing experience and a panel interview with managers and supervisors. The shadow experience was helpful in gaining an understanding of the day-to-day requirements of the position.", "Interview Questions": "Name a time when you encountered a difficult patient. What professional accomplishment are you most proud of."}, {"date": "9 Mar 2018", "title": "Intern Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Oct 2017", "Interview Descriptions": "First, there was a phone interview. After I was selected to continue, I was required to do one in-person interview with the supervisor for the role and the recruiter.", "Interview Questions": "Tell us about a time you spoke up even if you were uncomfortable."}, {"date": "30 Oct 2017", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Sept 2017", "Interview Descriptions": "Phone conversation & then in person interview. Interviewed with two employees in management and one that was in the role I'd be working. Comfortable and casual atmosphere. They then had me sit with a scheduler to see just how the job was done.", "Interview Questions": "They asked about how I handle stressful situations."}, {"date": "5 Feb 2020", "title": "Youth Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Jul 2017", "Interview Descriptions": "The interview process is smooth and attentive. The company itself spends a lot of money onboarding its employees and genuinely cares about the success of its programs. The interview process reflects that.", "Interview Questions": "What would you do if a superior asked you to do something that went against your own person moral code? "}, {"date": "18 May 2017", "title": "Clinical Nutrition Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's Wisconsin (Milwaukee, WI) in May 2017", "Interview Descriptions": "The process took 6+ weeks. I was initially contacted by a recruiter.  I had 7 interviews with 11 people in total.  2 days of in-person interviewing and 2 days of Skype interviews.  The interview process was lengthy and somewhat confusing.  It seemed every individual I met with had a separate agenda and it was as if there was little communication going on behind the scenes between the multiple departments.  This, of course, made interviewing quite difficult as I found myself repeating often or leaving something out; like a question, concern, observation, etc.  The company very much expects those who interview to be more \"in the know\" about their facility.  This is advantageous for a Wisconsin-raised or internal candidate but not so much for external candidates. Overall the atmosphere and culture of the company seemed respectable, dedicated, and lively which was very refreshing.  Everyone is very knowledgeable and truly passionate about patient/pediatric care.  Throughout the interview process I was frequently told \"you're their top candidate\" however a day after relaying my salary request to my recruiter I was told they had offered the position to another candidate and she had accepted.  It felt a bit odd as one person I interviewed with relayed \"all of our RD's are grossly underpaid.\"  I did not receive a formal letter/response from Children's.", "Interview Questions": "How would you manage a team of individuals that are sincerely considered experts in their field?  "}, {"date": "6 Apr 2017", "title": "Outreach Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Feb 2017", "Interview Descriptions": "I am a current employee who applied for another position within the CHW system.  I heard from HR about a month after I had applied for the position, set up a 30 minute phone interview with HR where he explained the usual, job, potential compensation etc, then set up a time for me to meet with the department manager a week later.  I met with the manager and a supervisor, they were very nice and welcoming and seemed to be interested in hiring me.  At the end of the interview I had asked when I could expect to hear a response and they told me that HR would contact me by the following week.  The next day I sent the manager a thank you note and let her know that I was still very interested in the position.  One week went by without a response.  I brushed it off as perhaps something came up or they got busy.  The beginning of the second week I sent an email to HR to follow up with the interview and offered to provide information if needed. No response.  I contacted HR again one week later (this is 3 weeks now) NO RESPONSE!  Again, I waited another week, still giving the benefit of the doubt. Again, NO response!!!  Nothing!! It has been a month and a half since I interviewed and didn't even get the reject email for closure.  The HR department here seems to lack in the communication department of potential employees and internal transfers. It really sucks not to hear back, even a decline letter would have been nice.  At least then I would know for sure.", "Interview Questions": "What skills do you have to offer this department?"}, {"date": "24 Jun 2021", "title": "Foundation Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Wisconsin (Wauwatosa, WI) in Jan 2017", "Interview Descriptions": "It was a series of two one-on-one interviews followed by an afternoon of a series of interviews.  Offered the chance to hear from different people across the organization what they envisioned for the position-holder.", "Interview Questions": "What do you think the most challenging thing about working here could be?"}], [{"date": "4 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Nov 2016", "Interview Descriptions": "Very simple, I was an internal candidate, so the interview process was a quick phone call with HR to identify my goals as a nurse and where I would like to be, followed by a standard interview with the unit manager and shadowing opportunity on the unit I was interviewing for.", "Interview Questions": "Why Children's?"}, {"date": "9 Mar 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Children's Wisconsin (Brookfield, WI) in Sept 2016", "Interview Descriptions": "Never had a chance was told i wasnt qualified because not an RN BUT job  was given to non nurse who only had high school diploma and no college", "Interview Questions": "Always ask where do you see youraelfbin 5 years"}, {"date": "17 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Apr 2016", "Interview Descriptions": "I applied for this job through a referral of an employee. I had a phone interview by the end of the week and after passing that sent in my paperwork (privacy, background check, etc.) and then was brought in for a panel interview with the floor managers. Everything was laid back and the interviewers were very nice and not intimidating.", "Interview Questions": "What is one time you had to make a decision without supervision?"}, {"date": "24 May 2016", "title": "Physician Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Wisconsin (Wauwatosa, WI) in Mar 2016", "Interview Descriptions": "I was an out of state candidate, so we did a Skype interview.  After that, I was invited for an onsite interview. I went to visit (at my own expense as it was worked into a visit I was already making to the area) and met with the HR rep, the Director of HR, and the team.  They were accommodating and friendly. There was little to no follow up after the interview without me having to seek them out.  Weeks later, I was asked to complete another phone interview with a physician I would be working closely with.  The phone interview was pleasant, but very repetitive. No one from Children's followed up with me after that interview despite several attempts by me to reach out to close the loop as I had other opportunities I was pursuing.  It was a very long and drawn out process with no closure. I was really disappointed.", "Interview Questions": "Nothing was out of place or particularly challenging. "}, {"date": "10 Feb 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Aug 2015", "Interview Descriptions": "Phone interview, followed by a 30 minute in person about a week later.  Very simple process.  There was a computer skills assessment first, and then the interview.  The whole thing took about 60 minutes.", "Interview Questions": "Basic background type questions, what my overall attitude is like.  They shared a lot of what they were looking for."}, {"date": "14 Dec 2015", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Wisconsin (Milwaukee, WI) in Jun 2014", "Interview Descriptions": "I met with both the Unit manager and Unit supervisor at the same time.  It made for an easy going experience.  We talked about my resume` and what my professional goals were and then got to go on a tour of the different areas where I would be working.  I was able to ask questions along the way.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "8 May 2014", "title": "Human Resources Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Apr 2014", "Interview Descriptions": "Applied online, about three weeks later got an email for a phone interview. Phone interview was about 20 minutes, basic behavioral questions, during the phone interview got invited to come in for an in person interview the following week. Met with three different members of HR team and basically walked through my resume, asked me questions about my past experiences. They left to discuss and then offered me the job. .", "Interview Questions": "In-person interview had no hard questions. Phone interview- \"tell me about a time you consider a success..etc.\""}, {"date": "28 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Children's Wisconsin (Milwaukee, WI) in Mar 2014", "Interview Descriptions": "Met with Supervisor regarding intern position. Great experience, and great questions asked during process to really get you to think about why you are applying for this position and why you want to go in to this field.", "Interview Questions": "How do you determine boundaries between client/worker relationship?"}, {"date": "24 Mar 2011", "title": "Summer Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Wisconsin (Birmingham, AL) in Mar 2010", "Interview Descriptions": "Met an interviewer at a campus career fair and described my career interests. She told me about the summer aide program and suggested I apply. After filling out an online application, I was contacted by phone for a phone interview at that time (rather than to schedule a phone interview). She asked a few simple questions about career goals and interest in working with children. I took her email in case I thought of further questions, and continued some email correspondence. They notified me that I had been offered a position in a certain department approximately a week later than the notification date, and  that I was asked to accept or decline the offer within two days.", "Interview Questions": "What experience do you have in the healthcare system?"}]]