[[{"date": "25 May 2023", "title": "Agente de relacionamento com o apoiador Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Greenpeace (São Paulo, São Paulo) in May 2023", "Interview Descriptions": "Me candidatei recentemente e não demorou muito para enviarem uma mensagem pelo WhatsApp avisando sobre a entrevista em Pinheiros - SP. Quando cheguei no local eles pediram para preenchermos um formulário que era relacionado ao comportamental e depois explicaram sobre a vaga (sua função, atividades diárias e benefícios). Depois disso todas as pessoas da sala fizeram a entrevista coletiva. Em duplas tínhamos que nos apresentarmos (falarmos de nós, nossas experiências profissionais) e logo em seguida dar continuidade com a dinâmica. A dinâmica consistia em você pegar um tema sortido (como o combate à violencia contra mulher, pessoas em situação de rua, animais abandonados, etc) e tentar convencer a outra pessoa da sua dupla a se tornar um apoiador. Basicamente uma dinâmica para ver como vc se sairia na função, ligando para um cliente e tentando convence-lo a se tornar um apoiador. Após a dinâmica a dupla se retira da sala e aguarda a resposta do recrutador em até 2 dias.", "Interview Questions": "Durante a sua apresentação pessoal eles podem realizar algumas perguntas para entender melhor sobre a sua experiência profissional."}, {"date": "21 Feb 2023", "title": "Agente De Relacionamento Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Greenpeace", "Interview Descriptions": "Tranquila a dinâmica de criar uma ONG e tentar ganhar doação. Avaliam entoação da voz. Responder .um papel sobre o seu perfil............. A empresa é agradável e oferece um café de máquina muito bom", "Interview Questions": "Se já trabalhou com vendas"}, {"date": "9 Dec 2021", "title": "Agente de relacionamento com o apoiador Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Greenpeace (São Paulo, São Paulo) in Dec 2021", "Interview Descriptions": "Entrevista coletiva, com cerca de 25 pessoas. Não foi informado previamente que a entrevista seria coletiva, Duração de mais de 2 horas. Apresentação pessoal de todas as 25 pessoas e após isso dinamica,", "Interview Questions": "Estrutura para trabalho home office. Dinâmica em grupo: simular ser de uma ong e contatar novos apoiadores. "}, {"date": "10 Oct 2022", "title": "Agente De Relacionamento Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Greenpeace (São Paulo, São Paulo) in Sept 2021", "Interview Descriptions": "Entrevista em grupo com +/- 25 pessoas, com uma atividade dinâmica, explicam sobre a empresa, sobre a vaga  e o que se precisa para trabalhar com eles em home office", "Interview Questions": "Como você conheceu o Greenpeace?"}, {"date": "18 Nov 2021", "title": "Analista De RH Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Greenpeace (Rio de Janeiro) in Sept 2021", "Interview Descriptions": "Entrevista de triagem via telefone questionando sobre experiências anteriores correlatas ao cargo de Analista de RH e pretensão salarial. Posição para vaga 100 % home office. Não informou detalhes sobre as atividades a serem desempenhadas pelo profissional contratado. Recrutadora informou que retornaria com feedback positivo ou negativo até o fim da semana, no entanto o contato não foi realizado.", "Interview Questions": "Conhecimentos prévios de Excel e pretensão salarial."}, {"date": "1 Mar 2021", "title": "Agente De Atendimento Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Greenpeace (São Paulo, São Paulo) in Feb 2021", "Interview Descriptions": "Bastante dinâmico, entrevista e depois um tema para mostrar sua habilidade com vendas. Foi solicitado um video no primeiro processo, para respondermos duas perguntas. Depois da aprovação nesse primeiro teste, tivemos uma entrevista pelo zoom e uma dinâmica individual.", "Interview Questions": "Tem experiência em telemarketing? "}, {"date": "23 Aug 2019", "title": "Estagiário De Comunicação Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Greenpeace (São Paulo, São Paulo) in Jul 2019", "Interview Descriptions": "Primeira etapa foi em grupo (5 pessoas), apenas uma conversa onde cada um se apresentou e tivemos que responder algumas perguntas típicas. Recrutadoras muito simpáticas e gentis. Decidiram que todos fariam a fase seguinte, uma atividade (um texto para ser feito em casa) que seria repassada ao gestor e ele escolheria alguns para uma entrevista presencial. A fase seguinte foi a entrevista com o gestor, também muito cortês, e uma das recrutadoras. Todo processo foi muito tranquilo. As respostas do RH foram super rápidas. Ao todo foram apenas 3 dias.", "Interview Questions": "O que não espera encontrar no Greenpeace?"}, {"date": "12 Jun 2019", "title": "Captador De Recursos Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Greenpeace (Frei Paulo)", "Interview Descriptions": "Bem rápido , simples e objetivo. Eles identificaram a personalidade de cada um e o quanto a causa Greenpeace é importante para a vida de cada um .", "Interview Questions": "Se me importo com causas ambientais?"}, {"date": "5 Feb 2019", "title": "Captador De Recursos Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Greenpeace (São Paulo, São Paulo)", "Interview Descriptions": "O processo seletivo foi em grupo, contendo atividades e dinâmicas de interação para avaliar a capacidade comunicativa de cada candidato. Em suma, eu achei bom e interessante, consegui me avaliar e avaliar o perfil traçado pela empresa.", "Interview Questions": "3 Campanhas da ONG."}, {"date": "22 Jan 2019", "title": "Captador De Recursos Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Greenpeace (São Paulo, São Paulo)", "Interview Descriptions": "O processo seletivo é bem dinâmico, e avalia a capacidade que o canditato tem de lidar com as adversidades que ira encontrar nas ruas. A recrutadora explica o funcionamento da ong, a questão salarial e as especificações da vaga.", "Interview Questions": "O recrutador pede para que você venda um produto peculiar, para testar a sua capacidade de convencimento"}], [{"date": "18 Jan 2019", "title": "Coordenador De Campanhas Digitais Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Greenpeace (São Paulo, São Paulo)", "Interview Descriptions": "O processo seletivo é muito organizado. Existe uma primeira etapa com o RH e uma segunda com gestor(a) da área. Com o RH é falado sobre o cargo, benefícios e história da empresa, além de um teste psicológico. Na entrevista com o gestor da área foi um bate-papo bem informal e descontraído.", "Interview Questions": "O que você espera encontrar no GreenPeace?"}, {"date": "26 Dec 2018", "title": "Captador De Recursos Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Greenpeace (Belo Horizonte, Minas Gerais)", "Interview Descriptions": "O processo seletivo foi muito curto, não avaliaram muito as capacidades, parecia que queriam qualquer um para preencher um cargo péssimo de emprego.", "Interview Questions": "N/A"}, {"date": "26 Aug 2018", "title": "Captador De Recursos Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Greenpeace (São Paulo, São Paulo)", "Interview Descriptions": "Foi bem simples, em grupo, cada um recebeu uma folha para preencher, depois a recrutadora fez perguntas básicas pessoais, de carreira e sobre o que sabemos da ONG.\r\nAchei que podiam nos conhecer melhor, para terem uma análise mais eficaz.", "Interview Questions": "Cite campanhas do greenpeace e como funciona."}, {"date": "27 Apr 2018", "title": "Captador De Recursos - Belo Horizonte - (Aquisição De Doadores Pessoa Física) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Greenpeace (Belo Horizonte, Minas Gerais)", "Interview Descriptions": "Tranquilo, uma unica entrevista em grupo, resposta um dia após a entrevista, perguntas básicas e testes de conhecimento sobre a ong !!!!!!!!!!", "Interview Questions": "Perguntas sobre as ações da ong no passado"}, {"date": "29 Mar 2018", "title": "Captador De Recursos Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Greenpeace (Recife, Pernambuco)", "Interview Descriptions": "Em minha experiência como fui a primeira equipe da minha cidade, houve 2 dias inteiro de seleção, onde o primeiro dia se baseava em explicação sobre a empresa, o que faziam, o objetivo. E interacao e dinâmica em grupo.", "Interview Questions": "As perguntas eram mais sobre você expressar sua opinião sobre tal título que eles davam, eles querem saber se você é bom de argumentação."}, {"date": "17 Dec 2017", "title": "Estagiário Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Greenpeace (São Paulo, São Paulo)", "Interview Descriptions": "Achei bem simples. Previsei resolver um case e responder a um questionário para o RH me conhecer melhor. A última fase foi uma entrevista com a chefe de setor e o RH.", "Interview Questions": "Porque você gostaria de trabalhar nessa empresa?"}]]