[[{"date": "14 Nov 2022", "title": "Associate Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Network for Organ Sharing", "Interview Descriptions": "-First contacted by HR after applying on website. Quick discussion to see what time works best to meet Director of the Division. -Interview with Director and discussed my resume and went over my projects and technical skills -Afterwards email HR a week plus later and mentioned they still are conducting interviews. Haven't heard a response back after more than a month. -Probably will ghost you and many people mention HR never replies back and waste your time.", "Interview Questions": "Tell me more about your internship experience?"}, {"date": "11 Jul 2022", "title": "Research Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Network for Organ Sharing", "Interview Descriptions": "It was good, just asking some questions about my previous projects and give me some future projects to find which I would be interested in. But after the interview, hr doesn't reply the email, it really makes me upset.", "Interview Questions": "Do you have any experience in R?"}, {"date": "19 Jun 2022", "title": "Performance Improvement Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Jun 2022", "Interview Descriptions": "1. Phone Screening with the Supervisor to discuss role and company\n2. Screening from HR Representative regarding expected compensation and  interest in position \n3. In person panel interview\nThe full hiring process  took about 6 weeks", "Interview Questions": "What QAPI tools have you used ?"}, {"date": "18 Apr 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Network for Organ Sharing", "Interview Descriptions": "There was one initial round with a recruiter and then a second round with an interviewer. The questions were pretty straightforward and I had done research ahead of time on the role.", "Interview Questions": "Why do you want this position?"}, {"date": "30 Mar 2023", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Mar 2022", "Interview Descriptions": "One panel interview with 3 individuals with different backgrounds on Zoom. Generally behavioral questions with some questions regarding some familiarity with programming languages. Very straightforward and easy process. Interviewers were very kind and helpful. They explained a lot about the organization's mission, which was helpful in understanding what my role was.", "Interview Questions": "Why do you want to work at UNOS? Are you familiar with R, specifically tidyverse and ggplot2?"}, {"date": "23 Feb 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Network for Organ Sharing", "Interview Descriptions": "1. First round: hiring manager interview.\r\n2. Second round: Team interview. A presentation (~45-mins) is needed to describe a previous machine learning project you have done. All teammates will ask questions based on the presentation.\r\n3. Third round: director interview.", "Interview Questions": "Part of the questions:\r\n1. Machine learning vs deep learning\r\n2. Model evaluation, imbalance data solution, feature selection\r\n3. Behavior questions including team collaboration, challenge experience etc."}, {"date": "28 Sept 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Network for Organ Sharing", "Interview Descriptions": "They were extremely unprofessional and unresponsive. After contacting them several times, they dropped off the map and did not contact me until several months after they hired for the position", "Interview Questions": "This was not an interview"}, {"date": "15 Aug 2018", "title": "Instructional Innovation Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Aug 2018", "Interview Descriptions": "Received a phone call and asked if I am still interested in the position, then they asked for my current salary. They called back and asked if I would like to come in for an interview and if I was willing to make less. I agreed to it but did not commit to the salary amount. Initially, I was to be interviewed by two people; the number increased on my arrival. Each person had a list of questions to ask, and they took turns. I asked many questions and came to the realization they are not well versed in the Instructional System Design field. Their approach is antiquated and lacked clear vision on how to create unified eLearning courses. They expressed concern about the lack of creativity in their work and how it is not received well by their targeted audience. I said I would need to evaluate the material before I can give them any suggestion. They agreed, and I was pointed to location on their website to review some documents. Next day, I sent a thank you letter and took a single frame to suggest possible changes by placing a before and an after example. That was not received well. The following day, I received we are not an interesting letter and was told that I lied on my resume regarding having experience in specific software. During the interview process, I stated the name of the application I was using and that I have experience in their preferred app.  Apparently, that information fell on deaf ears. They concluded the letter by saying I should think about this before I continue searching for work.\r\nThis group lacked tact and professionalism. I can understand if they are not interested, but to flatly lie so they can feel better about themselves, shows there insecurities. \r\nMy opinion of this company and the amateurs who work in the Instructional Innovation group;  stop living inside of a bubble, remove the silos within your group and move into the 21st century. Their learning materials are below average at best. The company serves a particular purpose to the medical community, but this group is a negative asset.", "Interview Questions": "Give examples on how to create testing materials?"}, {"date": "4 Jun 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Mar 2018", "Interview Descriptions": "Informal panel interview, lots of 'how have you resolved this in the past' questions, be ready to give concrete examples of solutions to common problems in the desired role, theories are not as important as specific examples", "Interview Questions": "Explain how you solved for a project that is going to miss its deadline?"}], [{"date": "14 Sept 2020", "title": "Associate Software Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Dec 2017", "Interview Descriptions": "Interview took a few hours, met with HR and technical staff. Did have to consent to a fingerprint in order to proceeds to work here since it is a non-profit with a federal contract.", "Interview Questions": "How do you debug your code?"}, {"date": "23 Feb 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA)", "Interview Descriptions": "In depth. Long process due to the fact that they are a government contractor requiring in depth background checks. After resume submission (numerous followup calls made) 1 phone interview with HR screener (Focused on the job description and salary range and was clear that that was the range, no negotiation) This followed with another, more in depth phone interview with HR to verify resume, job history, goals etc.  This followed with an onsite panel interview with four members of the department I'd be working for including the hiring manager.  Each had a set of scripted questions that they asked.  Mostly open ended questions around working with others, conflict resolution, working in a fast paced environment, decision making, performance metrics, matrix reporting.  This followed with a call and an offer from HR.", "Interview Questions": "Lots of open ended \"describe how you would handle.., have you ever..., why do you want to work here...strengths..weaknesses."}, {"date": "21 Feb 2017", "title": "Instructional Innovator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at United Network for Organ Sharing (Richmond, VA) in Nov 2015", "Interview Descriptions": "It was a small, panel interview. This was the first interview of two for a position that had opened in the department. It was quite formal. The second interview, which was less formal but still quite similar, occurred in February of 2016 for another instructional innovations position that had opened. The first position went to someone outside the company with very current experience, and the second position went to someone within that department requesting a change.", "Interview Questions": "How do you feel you will contribute to the team?"}, {"date": "4 Aug 2015", "title": "SAS Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Jul 2015", "Interview Descriptions": "I applied via LinkedIn and was initially told by HR (via LinkedIn message) I did not have enough SAS experience for the position. A week later I received an email from HR requesting a phone interview the following week (obviously that surprised/concerned me but I was excited about the change of heart). The phone interview was with two managers and another SAS analyst. It was short (25 minutes or so) and consisted of basic behavioral questions with a few questions geared toward SAS experience. After three days I received a final round interview offer and so I flew to Richmond a few days later. I was told there would be a panel interview and a management interview. Much to my surprise, I had a panel interview, a management interview, as well as a technical interview, and a senior leadership interview. \r\n\r\nAll went great except for the technical interview which was a bit awkward as the main interviewer was via Skype and it was requested I write SAS code on a whiteboard. As I was caught off guard, I definitely didn't do my best and left thinking they had no idea what I was actually capable of. All in all I was looking forward to the opportunity to work with UNOS, but the indecision of whether I was qualified or not with HR and the surprise interview strategy was disheartening. I was told I'd hear something by the end of the week, but did not receive a follow-up until I emailed HR late the following week.", "Interview Questions": "Tell me about a time an urgent project came up but you were juggling multiple other projects with upcoming deadlines. What did you do?"}, {"date": "1 Jul 2015", "title": "Policy Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Jun 2015", "Interview Descriptions": "It was longer than I had anticipated. Brief interview with HR, phone interviews with 2 managers, phone interview with a director, then an in person interview with one of the managers.", "Interview Questions": "Why do you want this job?"}, {"date": "31 Jul 2014", "title": "Cass Delivery Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at United Network for Organ Sharing", "Interview Descriptions": "The process to get an interview was a little slow but overall smooth. My interview was excellent and they verbalized my being well qualified. I was offered the position and when I asked why the salary was low, I was told it was what I made at my other employer... with 30 hours per week. They were matching my salary but now with 40 hours working and said they didn't know that I would have made any more at 40 hours. I told them that was obviously not the case (yes I did this politely and professionally) but also told them I was still interested and maybe I could telecommute. HR checked with the hiring manager and when she called me back, I was told that I was no longer being offered the job. No explanation as to why.", "Interview Questions": "Why are you interested in this position?"}, {"date": "16 Jul 2015", "title": "Communications & Public Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in Apr 2014", "Interview Descriptions": "Very easy; met with three members of the public relations department and discussed my interests and skills from previous internship experiences. Once we started talking about my aspirations and how they align with the company's mission statement and internship program, we lost track of time and it became a more open-ended, friendly conversation. Great experience!", "Interview Questions": "How do you perform under pressure or with a sudden deadline?"}, {"date": "2 Oct 2016", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at United Network for Organ Sharing (Richmond, VA) in May 2012", "Interview Descriptions": "First, I submitted a resume with work samples (in this case my graphic designs from prior employment). My resume was chosen and I was then called to schedule an in office interview by the person who would be my future manager. I interviewed with him and showed more work samples. Then, same day, I was interviewed by two departmental employees, one was on a worker level and the other was a manager but not my direct report. Finally, on the same day I interviewed with the department director. Long day, but I liked having it over with in one swoop.  Then I waited a little over a week and got a call that they hired me.", "Interview Questions": "How would I handle this (hypothetical) situation. It was related to conflict resolution.\r\n\r\nAnother question dealt with my experience handling multiple projects at once and communicating with clients about establishing clear expectations and timelines."}]]