[[{"date": "7 Jul 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (Toronto, ON)", "Interview Descriptions": "A thorough interview process starting with a phone interview, followed by a timed exam (remote from home), and two interviews. Everyone involved was friendly and considerate. I felt they were serious about finding the right candidate based on multiple skill sets.", "Interview Questions": "Describe a time you worked cross-functionally to achieve a goal."}, {"date": "4 Mar 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "First, you send cv and cover letter through their platform. A few month later they contacted to make a case assessment a few days later on a specific day and time. \r\nHad 2 hours to complete a case at home and send it in a specific frame of time\r\nboard interview both English and Spanish", "Interview Questions": "Why the role\r\nA crisis you managed\r\nYour relation with the values of the organization"}, {"date": "28 Jan 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Dec 2020", "Interview Descriptions": "Focussed on past experiences and taking questions from two or more people.  There is often, but not always, a very deferential approach to the hierarchy.  Consultants are, apparently, not subjected to the requirement for regional equity that staff positions are.", "Interview Questions": "Describe a difficult situation and how you handled it."}, {"date": "22 Jun 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UNICEF", "Interview Descriptions": "The interview process was fairly straightforward. I gave a written test that was for about two hours. Second round was a behavioural interview- normal strength, weakness questions. It was all online. The written test was emailed and had a time limit", "Interview Questions": "why UNICEF? "}, {"date": "20 Nov 2018", "title": "HR Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF", "Interview Descriptions": "There were 2 interviews with many members of the management team. 1st general, second more specific for the job. Each person asked a question relevant to their position. Many questions were probing into experience relevant to the position. There were also questions regarding HR trends and practices.", "Interview Questions": "What are the most important issues in human ressource management in an international NGO?"}, {"date": "21 Sept 2018", "title": "National Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF", "Interview Descriptions": "I was sent an online test to complete over 2.5 hours. The questions were very specific to knowledge about the subject area and about UNICEF country plan priorities. There was also a case based scenario.", "Interview Questions": "TBC. I have not yet been called for an interview. "}, {"date": "26 Jul 2018", "title": "Senior Marketing Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Markham, ON) in Jul 2018", "Interview Descriptions": "antiquated process ... before the phone prescreen I had a lengthier email exchange around salary expectations, nature of contract and benefits.\nThe phone screen was 30 minutes . It included  pauses as the interviewer was taking notes.", "Interview Questions": "Why I wanted the job?\nWhat qualifications made me the best candidate?\nWould I be ok with a 12 month contract, and no benefits ?"}, {"date": "4 Apr 2017", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Toronto, ON) in Feb 2017", "Interview Descriptions": "Did a phone interview 3 months after submitting my resume. Phone interview with HR was pleasant. Did a 2-hour technical assessment that tests your skills in marketing strategy, branding  and proof reading. Didn't reach the face-to-face interview with hiring manager.", "Interview Questions": "Create a marketing plan based on the conditions provided."}, {"date": "2 Aug 2016", "title": "Senior International Programmer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF", "Interview Descriptions": "About 1 week after sending the application online, I received an email saying I had been selected for an interview. The interview asked basic competency questions. A couple days later, I received an email stating I had made it to the written assessment stage. The written assessment was done at home with a two hour period. A few days after, I was contacted again for the final interview: a one hour Skype call with the supervisor of that dept, another advisor, and the human resources coordinator.", "Interview Questions": "Give an example of a time when you juggled different information for different donors."}, {"date": "12 Jul 2019", "title": "Donor Engagement Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (Toronto, ON) in Oct 2015", "Interview Descriptions": "There was a phone screening with the HR recruiter. Next, I was invited to an in person interview with the option to have it via video-conference. I chose to head to Toronto, where the head office is located, as I really wanted the job and assumed in-person contact would be better.  There were three interviewers, including manager, team lead, and HR recruiter.", "Interview Questions": "How do you manage time and priorities?"}], [{"date": "15 Jul 2015", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF in Jul 2015", "Interview Descriptions": "I applied to the job posting then about 1 week later they asked me to send a financial proposal detailing my services and remuneration. They then scheduled a phone interview about a week later which happened today. The interview was literally 15 minutes with a panel of 4. They said there won't be another round of interviews and they will be deciding in the next week or 2.", "Interview Questions": "They asked 4 questions--all which were competency questions. Given that the interview was so short I can't imagine an interview panel could make a fair assessment of a candidate in that amount of time. I'm wondering if they actually have someone in mind for the position and are just going through the motions as standard policy? Does anyone know if this is common and if this situation sounds like that case?"}, {"date": "7 Sept 2018", "title": "Supporter Relation Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNICEF (Toronto, ON) in Jan 2014", "Interview Descriptions": "Generally friendly and pleasant. Questions are reasonable at the time. Feeling ease and relaxed. Friendly environment and nice office. Interviewed at the time that there were new campaigns were going on. Enjoyed the people there.", "Interview Questions": "Why do you want to work for Unicef?"}, {"date": "5 Nov 2011", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at UNICEF (Toronto, ON) in Nov 2009", "Interview Descriptions": "First stage of the interview was a phone call. Pretty much typical questions. Second step was 1:1 Interview, again pretty standard stuff ( teamwork, how you handle stress and pressure although the environment is far from stressfull, position related questions etc.). One of the managers interviewing me was rather uncomfortable, Im guessing candidate screening wasnt her strong suit.", "Interview Questions": "According to me, questions were really easy. "}]]