[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jan 2023", "job_title": "Care Manager in Fort Atkinson, WI", "duration": "N/A", "pros": "I really enjoy working for My Choice WI. I have an incredibly supportive supervisor, with the other supervisors ready to lend a hand whenever it is needed. There is great flexibility to schedule your meetings how they work with your schedule. The job is different each day but I never feel alone with problems. I know how to do my job with no micro managing. You are set up for success with all the support there is with the company. There are also many options to move up or within the company, depending on your passions.", "cons": "The dental plan offered is not as good as other companies I have worked for, but that is nothing against the company as a whole. Sometimes you have to drive far, if a member moves but that is not a regular event"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "RN Case Management", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Apr 2023", "job_title": "RN Case Manager in Pewaukee, WI", "duration": "N/A", "pros": "Excellent Manager support. Excellent work life balance.", "cons": "Takes more than 40 hours weekly to complete workload."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run as fast as you can! Recently ran😀", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jun 2023", "job_title": "RN Case Manager in Madison, WI", "duration": "N/A", "pros": "You can work from home…. Kind of. The supervisors are inexperienced for program. Unprofessional! They micromanage to the point of insanity. Everyone walks out. Many nurses with health issues due to stress.", "cons": "Members angry and leave because care teams cannot get them what is needed. They are so busy making new papers to complete that all of the care is gone. Not sure who is writing the reviews but we all feel the same. There is not work/life balance at all. Drove My Choice into the ground in 2 years! The young ladies in charge lie so they cover up what they do not do. Many of the young supervisors don’t have a clue and are lazy."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Sincerely love my job!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2023", "job_title": "Corporate Management in Wauwatosa, WI", "duration": "N/A", "pros": "Flexible schedule: typical hours are 8am - 4:30pm but can be flexed based on preference, emergencies that come up, appointments, etc. Appreciation: if a team or employee does a great job, it is actually recognized. This is true within teams, from leadership, and from other departments. Supervisors of the praised staff member are also looped in often so they're aware of these successes. Training opportunities: our HR team has a variety of professional growth trainings offered frequently. Leadership is also very supportive with growth into new roles. Room to grow/move within the organization: 30% of hires are internal transfers and promotions. Innovation: ability to use previous skills and knowledge to provide input, better processes, and participate in special projects. You are making a difference on a daily basis no matter what role you're in!", "cons": "Due to the office locations spread all throughout the state, you don't get to work physically close to a lot of other teams. Teams and Zoom has helped this quite a bit. Due to the nature of the industry, things change quickly. This would be a con for those who like a straight-forward schedule and set of tasks. It is fun for those of us that like a challenge and to problem-solve!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Flexible", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 May 2023", "job_title": "Utilization Review Nurse in Madison, WI", "duration": "N/A", "pros": "Work from home, flexible schedule", "cons": "Significant culture change since growth"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Seasoned Care Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "3 Jan 2023", "job_title": "Care Manager in Wauwatosa, WI", "duration": "N/A", "pros": "Some of the best reasons to work for My Choice Wisconsin is the overall great feeling of helping someone in the community. I also enjoy the flexibility and being able to work from home. It is nice to be able to go to the office to print and gather additional resources as needed. My supervisors are extremely helpful and knowledgeable, understanding, caring, and family-oriented!", "cons": "Some of the downsides of working with My Choice Wisconsin is that in the beginning, it seems like a tremendous amount of paperwork. However, there are supportive staff to assist and also you work with another employee to get the work completed i.e. (Care Manager and a Registered Nurse). At times it may be difficult to reach a member and this may warrant a home visit at a short notice. The positive side to all of this is after years of working with My Choice, managing the paperwork gets easier because now you have a good understanding and good foundation of how to get the job done!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Rewarding - hard work", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Mar 2023", "job_title": "Care Manager in Dane, WI", "duration": "N/A", "pros": "Company offers flexibility. Decent culture. Peers are supportive.", "cons": "Constant changes, it's hard to keep up with current expectations. Once you learn one way to do something, it seems it changes. Peers and management are supportive through this - but it can be a bit much. Not all changes are company based, many are from DHS. Role requires you to \"wear a lot of hats\" and don't feel compensation reflects this accurately when those who work in one single department get paid the same and in some cases more, and they only have to be the \"expert\" in that one area."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Flexible, Rewarding and Involved", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Jan 2023", "job_title": "RN Care Manager in La Crosse, WI", "duration": "N/A", "pros": "Team focused approach to assist people within the community to reach their health and safety goals. Plenty of opportunities within the organization for growth, great pay and great benefits. Ample opportunities to have your voice heard for change, both within the organization and the community. You create your own schedule in regards to seeing Members in the community and working from home.", "cons": "The main con in the position is the lack of staffing within the community agencies that support our Members. The pro to this is being able to use unique and creative problem solving skills to get our Members the support that they need."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Flexible but hard work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Jan 2023", "job_title": "Care Manager in La Crosse, WI", "duration": "N/A", "pros": "-work from home -flexible schedule -able to help those in need -good teammates -PTO is both easy and encouraged to use -work load is manageable most days", "cons": "-workload at times can be difficult (dependent on member issues) -changing policy/procedures can be difficult to track -pay is adequate, but not great -system does not offer all our members need (this is more of a society issue, not specific to My Choice), but it can be frustrating to work within the system we have"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Great company to work for as a nurse who enjoys flexibility.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Jan 2023", "job_title": "RN CM in Fort Atkinson, WI", "duration": "N/A", "pros": "I control my schedule, working remotely is a plus. Working with a great team and Lead Supervisor who listens to my questions or concerns. Meeting member's in their homes and helping them live full lives.", "cons": "Time management for multiple tasks, need to be organized for this role."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Flexibility is what keeps employees here", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Feb 2023", "job_title": "RN Case Manager in Madison, WI", "duration": "N/A", "pros": "Flexibility for sure, no weekend/holidays, can Flex Time IF you can manage to keep up with the workload. Good co-workers, the reason ppl stay is the remote work and flexibility", "cons": "Upper mgmt is a joke, don’t listen to or advocate for employees. Benefits suck and are expensive."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Flexible Work Schedule/Team Oriented", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jan 2023", "job_title": "Care Manager in Oak Creek, WI", "duration": "N/A", "pros": "I have been working with My Choice for over a year and love the flexibility and being able to create your own schedule around your members! My teammates and co-workers are always helpful and responsive, and I appreciated the guidance they have given me over this past year I really have gained much professional development in the social work field in which I can utilize in my career ahead.", "cons": "Large company with many departments and sometimes it is unclear with whom to reach out to in regard to member and vendor needs."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Review of work culture at My Choice WI", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Dec 2022", "job_title": "Lead Supervisor in Wauwatosa, WI", "duration": "N/A", "pros": "Sense of community. Over my 5 years within this organization I feel like I have been able to build relationships amongst different departments. Whether it be through email communication, phone calls, in person meetings or trainings, or simply passing by in the office. Flexibility is a huge pro with this job. If you hold yourself accountable and complete your work, your leaders allow you to flex your schedule around to make personal appointments, etc. Sense of satisfaction. Helping others is not easy, but it is an honor to do so in a profession. This job gives me that sense of joy at the end of the day that we are able to help others in our local community. Ongoing education. I strive to learn. This job brings you into a variety of different situations with working with other organizations in the state. Communication with hospitals, day programs, group homes, DHS, APS, the list is endless. It is cool to see everything connect. Ability to move around in the company is a big one. There are many opportunities within the organization.", "cons": "I personally like to focus on the positives. One con may be moving around a lot. Family care is a revolving door of change. I try to tell myself change is always for the better, but it can be uncomfortable. Additionally, as the company grows, more personalities come into the mix. It can be hard to make your voice heard but I have seen this been achieved. The more you standout in your work, the more you get recognized, and the more say you obtain."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Work/Life Balance!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Jan 2023", "job_title": "Nurse Practitioner in Madison, WI", "duration": "N/A", "pros": "I have been employed by this organization for about three years. So far it has been a great experience. They offer great work/life balance and treat their employees as professionals and with respect. There is good communication in our professional group and a general sense of support along with competitive salaries.", "cons": "For an NP who wants more patient contact or a clinic like setting this would not be an ideal job for you. There is a lot of chart review and reconciliation involved with this position."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great teams, meaningful work (but a lot of it)", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Jan 2023", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Thorough training Great coworkers Supportive supervisors Plenty of specialized support teams Room for growth Hybrid field/WFH with flexibility", "cons": "Heavy case load Uncertainty with upcoming corporate acquisition"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good starting point", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Mar 2023", "job_title": "Credentials Coordinator in Milwaukee, WI", "duration": "N/A", "pros": "Good coworker. A good place to learn.", "cons": "Not enough people to help with work"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "My Choice Wisconsin Care Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Jan 2023", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Everyone I work with, and have contact within the organization are positive, engaging and supportive. I enjoy the diversity of my client/member base, and each have their own unique challenges. I am able to split my time between the office, home, and residential visits with no difficulty.", "cons": "There will be situations in which we are unable to assist our members as completely as we would like, due to circumstances we do not control."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Love it here.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Dec 2022", "job_title": "Anonymous Employee in Milwaukee, WI", "duration": "N/A", "pros": "I have enjoyed my time with My Choice. Everyone here is super helpful and welcoming! My coworkers are fantastic - kind, welcoming, and smart - the kind of people you want by your side when things get difficult.", "cons": "It seems like not everyone has the same experience that I have had, however I think keeping a positive attitude is key. Things can be hard, as with everywhere, but the organization has great leaders."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Jan 2023", "job_title": "Geriatric Nurse Practitioner in Madison, WI", "duration": "N/A", "pros": "I have been working here almost 4 years and find it to be an excellent place to work. It is a very positive work culture, flexible and the work is very rewarding. Collaboration with other colleagues and departments is helpful and respectful.", "cons": "There have been some technology issues but the IT staff has been very helpful and responsive."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Rewarding Work - Flexibility", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jan 2023", "job_title": "Care Manager in Milwaukee, WI", "duration": "N/A", "pros": "Rewarding work caring for a population that needs it the most - makes you feel good about what you do and the positive impact you have on your community.", "cons": "There is a lot of documentation required, which is par for the course in any health care job."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Jan 2023", "job_title": "Care Manager in Fort Atkinson, WI", "duration": "N/A", "pros": "I have had a great experience working at MCW so far, and I do not see myself leaving any time soon. All team members have been great to work with and are friendly. Good benefits and flexibility. Everyday is different.", "cons": "I do not have any at the moment"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "My Choice - The only choice", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Dec 2022", "job_title": "Lead Supervisor in Wauwatosa, WI", "duration": "N/A", "pros": "Great work life balance Teamwork Lots of support from management", "cons": "Cons are the same for starting any new job, not knowing anyone, getting use to their technology, paperwork, way of doing things."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jan 2023", "job_title": "Care Manager in Wauwatosa, WI", "duration": "N/A", "pros": "-Benefits -PTO -Rewarding work -Compensation -Mostly remote -Great support from supervisor and program management -Stability", "cons": "Nothing. I really love my job!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Stability", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Jan 2023", "job_title": "RN Care Manager in Milwaukee, WI", "duration": "N/A", "pros": "Great pay No weekends or holidays", "cons": "Lots of travel Overtime Workload"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Ok", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Dec 2022", "job_title": "Case Manager in Milwaukee, WI", "duration": "N/A", "pros": "Freedom free do it yourself", "cons": "Idk people randomly fired seems like"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Innovative and Ever-Growing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Jun 2022", "job_title": "Anonymous Employee in Wauwatosa, WI", "duration": "N/A", "pros": "My Choice Wisconsin has taken many steps in the last few years to grow in serving and providing quality care to a wide population of Wisconsin's citizens. As such, there are many opportunities here to grow, learn, and to contribute to the organization's mission. The work is challenging and rewarding, and new ideas are always welcome. If you're interested in long-term care or health plans, this is a great place to learn and gain skills. There are many strong leaders here to learn from, and many of these individuals are \"homegrown\" in that they 've been with the organization for years and honed their leadership skills here. All in all, a great place to work!", "cons": "I would say as an organization, we are still fine-tuning our use of Zoom, Teams, etc. for remote work and ensuring that all individuals on the call are engaged."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Friendly and Welcoming Work Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Jun 2022", "job_title": "Customer Service Representative (CSR) in Madison, WI", "duration": "N/A", "pros": "I have really enjoyed getting to know my co-workers and I've enjoyed working within a team environment. The pay is good and management is receptive to employee ideas and concerns that may arise. Everyone I've had contact with has been friendly and welcoming. I moved from out of state around the end of 2019 and I love this company and I'm excited to see what's next in my future here.", "cons": "I feel that the main con from my personal view is not with the company. I feel the pandemic put a damper on being able to work in-person. I enjoy socializing with my co-workers and I enjoy being able to see them in-person. I'm looking forward for more socialization and the possibility of group activities."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Nov 2022", "job_title": "Care Manager in Eau Claire, WI", "duration": "N/A", "pros": "Work remotely, being able to see clients in community.", "cons": "Micro managed, extremely high case loads, unrealistic expectations."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great potential, leadership falls short.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Sept 2022", "job_title": "Operations in Wauwatosa, WI", "duration": "N/A", "pros": "- Exciting opportunity; rewarding work.\n- Ability to interact with many departments and increase both knowledge & skills base.", "cons": "- Management is inept; mid-level leadership was unprofessional and vindictive, in my experience. \n- Advancement is absolutely NOT encouraged nor supported, even parallel moves. Employees are very much boxed into the role they are hired for."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Work/Life Balance", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Apr 2022", "job_title": "RN Care Manager in West Bend, WI", "duration": "N/A", "pros": "I value working remotely as I am able to go for a walk when the sun is shining and not being limited to just going for a walk at noon. I love the hours Mon-Fri 8-4:30. The salary is good, my supervisors and co-workers are awesome, they are always willing to help others.", "cons": "The health insurance is not very good, it costs a lot and doesn't cover much. I don't enjoy being on call for one week per year. Many of my co-workers don't mind and volunteer for extra weeks but each care manager is still required to cover one week on call."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Regional Program Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Dec 2021", "job_title": "Regional Program Manager in West Bend, WI", "duration": "N/A", "pros": "I am proud to work for My Choice Wisconsin because of our dedication to service, equity, and respect. I come to work every day feeling like I'm making a difference in the lives of our members and our communities.\nI work with an incredible group of individuals who are committed to our members, as well as the organization and team. Even on tough days, it's reassuring to see how much we support one another through teamwork and collaboration. I've truly never experienced this level of support, respect, and teamwork anywhere else.", "cons": "As with any healthcare profession, there have been some challenges related to the pandemic and caregiver shortage. However, I have been very impressed with the collaborative efforts occurring between internal departments to develop creative solutions to these barriers."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Review", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Nov 2022", "job_title": "Member Rights Specialist in Milwaukee, WI", "duration": "N/A", "pros": "Flexibility, work from home during pandemic", "cons": "Staff often unheard, poor benefits"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "New Employee. The jury is still out.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Sept 2022", "job_title": "Care Manager in Wauwatosa, WI", "duration": "N/A", "pros": "Home based office, flexible schedule", "cons": "Majority of training is in office and through on demand modules which can get overwhelming to a new hire."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Hitting our stride", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Jun 2022", "job_title": "Customer Service Manager in Madison, WI", "duration": "N/A", "pros": "A organization doing important work- every role matters!\nSupportive coworkers and management\nPay and benefits are reasonable\nWelcoming environment", "cons": "It’s more a reality than a con, but you need to be adaptable and comfortable with change. It’s the nature of the business. If you looking for a position to set it and forget it, MCW may not be the right fit."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing culture and coworkers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Jun 2022", "job_title": "Regional Program Manager in La Crosse, WI", "duration": "N/A", "pros": "From day one it was evident to me that My Choice Wisconsin was a corporation that I wanted to be part of. The senior leadership team really encourages a servant leadership type environment.", "cons": "This type of work takes a person with empathy and empathetic people can get drained easily. Self care is a must."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Employment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Aug 2022", "job_title": "Case Manager in Milwaukee, WI", "duration": "N/A", "pros": "Work from home.\nStrong support locally", "cons": "Too high of caseload.\nToo many hoops with upper management."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Pays well", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jul 2022", "job_title": "Anonymous Employee in Milwaukee, WI", "duration": "N/A", "pros": "The job pays well but they do micro manage their employees", "cons": "Micro managing is hard for the company culture."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Solid salary, positive work culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 May 2022", "job_title": "Care Manager in La Crosse, WI", "duration": "N/A", "pros": "- flexible\r\n- great support from leadership team\r\n- good pay\r\n- plenty of opportunities for career growth", "cons": "- disagreements between departments at times"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "HR Hostage Nightmare stay away", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Dec 2021", "job_title": "Provider Relations Representative in Wauwatosa, WI", "duration": "N/A", "pros": "My Choice Wisconsin is a recently merged company of My Choice Family Care, Care Wisconsin and Trilogy Medicaid.  The pay is competitive to others in the market and is on the higher side to some others out there.  My direct manager was very supportive and provided help when available which was limited due to having to support many new individuals on the team.  The coworkers here are great and were supportive when needing help.  The location is good as well.", "cons": "The company recently has gone through a few mergers and as a result there has been some unclear processes since things are changing.  Lots of turnover as well between all departments.  I would have to say their hr rules and processes are cold and are archaic.  You are required to provide a 30 day notice if you’re salary to be considered leaving in good standing or as rehire able.  If you’ve been at the organization for less than a year you lose any pto left.  To be honest it felt as if they try and hold staff hostage with their rules since they know there is mass turnover all over the organization.  They also are very unprofessional with not notifying you on things that could impact you last minute.  I received word from others that this is not a first and as such I would stay away.  Management with the merger is being pulled in many different directions and are not adequately supported."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Current employee.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Apr 2022", "job_title": "RN Care Manager in Madison, WI", "duration": "N/A", "pros": "Flexible schedule, no holidays or weekends.", "cons": "Insurance is not the best."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Weak Leadership support and extremely large caseloads", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jan 2022", "job_title": "RN Care Manager in La Crosse, WI", "duration": "N/A", "pros": "Remote work available, and pleasant people to work with", "cons": "No overtime pay with expectation to work excessive overtime to keep up with oversized caseloads.\nChaotic caseload assignments\nOversized caseload assignments\nPoor management assistance with complex coordination of member benefits"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Leadership Lacks", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Nov 2021", "job_title": "Provider Relations and Network Specialist in Madison, WI", "duration": "N/A", "pros": "Working remotely was a huge bonus; the pay is decent", "cons": "the training could have been better; the pay is not commensurate with the amount of stress; slow to hire help (if they do it at all)"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Low pay for a lot of responsibility", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Jan 2022", "job_title": "Care Manager in Wauwatosa, WI", "duration": "N/A", "pros": "Coworkers are the best part about the job", "cons": "Low pay for high demand"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Pandemic Challenges", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Sept 2021", "job_title": "Case Manager in Madison, WI", "duration": "N/A", "pros": "Flexible, work from home, support", "cons": "At the time offered terrible computers and no cell phone, had to utilize phone service through computer, however, I think as I was leaving they implemented cell phones for case managers. Caseload went from 0 to 30 far too fast."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love Working for them", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Dec 2021", "job_title": "Administrative Assistant in La Crosse, WI", "duration": "N/A", "pros": "I enjoy working for the company. My boss is great, as well as my coworkers. I feel like I get paid fairly for my work, and I the bonuses given are nice.", "cons": "I wish I could work more remote"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "High caseloads", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Oct 2021", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Flexibility, fair pay in comparison to other social service jobs, working with members is great", "cons": "Very high caseloads make it difficult to ensure the health and safety of all members. You tend to feel like you're advocating for the company and not the members. Poor health benefits."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "More cons than pros", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Sept 2021", "job_title": "Care Manager in Milwaukee, WI", "duration": "N/A", "pros": "- Co-workers are very nice and do a lot to help you get accommodated\n- Members can be a genuine pleasure to work with", "cons": "- Severely underpaid for the caseload\n- Lots of pressure to get work done, which can create a dissonance between trying to help people while also meeting your deadlines\n- It can feel like you're the only one who actually cares about your members, while the higher ups make policies that directly interfere with your work"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A challenging, fast-paced, and exciting environment!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Mar 2021", "job_title": "Anonymous Employee in Milwaukee, WI", "duration": "N/A", "pros": "My job is always challenging me to be the best!\r\nThere is a lot of variety every day and things never have time to get boring. \r\nI am always learning and in turn, can help teach others on my team the things that i know.\r\nThe people I work with are THE BEST! We collaborate well and enjoy working together.\r\nI have an extremely supportive boss who helps me grow professionally and personally.\r\nThe work can be demanding but it's also fun and I work with wonderful people.\r\nMy hours are flexible and it works with my family life.", "cons": "I wish that my insurance would completely pay for my child's braces, but alas, I realize that most insurances don't!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome growth opportunities, work-life balance, and benefits!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Sept 2021", "job_title": "Recruiter in Wauwatosa, WI", "duration": "N/A", "pros": "Work-life balance, growth opportunities within your current role and the company overall, acknowledgement for wins, flexibility of working from home/in office (depending on role), awesome benefits, knowing your day to day work is positively impacting the lives of others.", "cons": "We are spread across the state, so at times it would be nice to work with teams more directly on-site."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Fun and Dynamic Place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Mar 2021", "job_title": "Director in Waukesha, WI", "duration": "N/A", "pros": "I really enjoy working at My Choice Wisconsin. I have been here for almost four years. I really love the mission of supporting people with Disabilities and the frail elder population the the variety of Programs we provide throughout Wisconsin. What I love the most is working with an incredibly passionate team of Care Managers and Nurses. I am in awe of their dedication to serving our Members. I am extremely proud of the way we had to come together as an organization to figure out how to effectively do our mission during the COVID 19 Pandemic. I also enjoy the fast pace and autonomous work environment. Every day is different, and I enjoy being challenged", "cons": "Communication can improve, but I think it is the nature of the fast pace world we work."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "It’s a Job", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Jul 2021", "job_title": "Care Manager in Wauwatosa, WI", "duration": "N/A", "pros": "Able to construct your own work day and decide your schedule.", "cons": "Management who are not helpful. Excessively high case loads. Lack of support when working with difficult clients. Community not understanding the role of the care manager and facilities being annoyed by IDT monitoring clients."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "This company does great things, but there are major issues with the hierarchy right now", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jun 2021", "job_title": "Registered Nurse, BSN in Milwaukee, WI", "duration": "N/A", "pros": "-very flexible work schedule\r\n-9-5 job, M-F with no on call\r\n-mostly remote\r\n-home visits\r\n-RN position has a lot of involvement in making decisions and care planning\r\n-same caseload = you get to really know your patients and their families", "cons": "-recent merger has caused many internal structure issues, minimal supervision, and decreased responsiveness from leadership\r\n-caseloads have increased to 80 patients per RN\r\n-policies don't always accommodate for the patient's best interest but are in place to save money for the company\r\n- Charting system is tedious and unreliable\r\n-significant repetition with the job tasks make it difficult to learn new things or grow\r\n- high turnover = always training new employees and decreased continuity of care for patients\r\n- Little to no opportunities for learning, growth, or career advancement\r\n-No significant coverage for RNs when they are sick or on vacation; RNs come back to any work on their caseload that was missed while they were out\r\n-No MAs or CNAs available to assist RNs"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Oct 2021", "job_title": "Director in Wauwatosa, WI", "duration": "N/A", "pros": "Leadership Culture Mission Values Peers", "cons": "No bonus structure in place"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic environment", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Jul 2021", "job_title": "Team Leader in Wauwatosa, WI", "duration": "N/A", "pros": "At the time they had good health insurance. From what I hear, that is no longer offered.\nCan't come.up with any more pros", "cons": "Very toxic\nLow pay\nNo work life balance \nNo growth\nPunitive\nEverything is about money\nMembers don't matter \nNumbers and cuts is all that matters"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good company, bad training", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Aug 2021", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Organized corporate environment with clearly documented job duties", "cons": "Neglectful training leaving new staff floundering to figure out their role and how to execute tasks for job duties"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Still Unstable after Merger", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 Aug 2021", "job_title": "Provider Services Specialist in Madison, WI", "duration": "N/A", "pros": "It is a non-profit organization.", "cons": "Many systems and processes have been made more inefficient.\nOrganizational culture post-merger has been weak."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Work Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jun 2021", "job_title": "Care Manager in Mount Pleasant, WI", "duration": "N/A", "pros": "The coworkers are the most supportive group of people you could ever hope to work with. The leadership is also very communicative and helpful.", "cons": "The workload is intense at times and having a strong sense of time management and organization goes a long way."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "My choice wi", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Aug 2021", "job_title": "Care Manager in Dodgeville, WI", "duration": "N/A", "pros": "Autonomy and the ability to make your schedule fit what you need it to be.", "cons": "Work load and case load can be overwhelming"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run as fast as you can", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Jun 2021", "job_title": "RN Case Manger-2 in Milwaukee, WI", "duration": "N/A", "pros": "Company does supply adequate training, but falls far short of what one really needs. Have to be on top of your game.", "cons": "Many home visits are in bug infested residences, condemned properties or drug and crime ridden areas of Milwaukee. Pay is on low end of scale, mileage and office supply is not what they promise. Support is not there, supervisors state they understand but dont change anything."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Company does not care about the health of their employees", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Oct 2020", "job_title": "Care Manager in Jefferson, WI", "duration": "N/A", "pros": "Pay, which was transitioned from Care Wisconsin, was good. After My Choice became involved, pay was lower as you are expected to put in many more than 40 hours per week.", "cons": "The work environment changed when the two organizations merged. My Choice does not care about employees mental or physical health and expect an unreasonable amount of work out from their Care Managers. In turn, this makes it very difficult to provide good Care Management to those they serve. Most people very unhappy there."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Employer Who Cares and Listens", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Mar 2021", "job_title": "Anonymous Employee in Madison, WI", "duration": "N/A", "pros": "My employment with My Choice Wisconsin has been a wonderful experience. My colleagues and supervisor include me in planning conversations, seek and value my input and give me the guidance and independence to be successful in my role.", "cons": "In a busy organization, communication can sometimes be difficult. But, I've learned that if I reach out or remind others to follow up, I play a vital role in helping our organization collectively communicate and achieve goals."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Employees are respected and valued", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Dec 2020", "job_title": "Anonymous Employee in Beaver Dam, WI", "duration": "N/A", "pros": "Management is always open to feedback and constructive criticism. Employees are treated very well, especially with everything that’s been going on in the world this past year. Schedules have become more flexible, everyone’s been given the option to work from home, managers have gone out of their way to maintain a positive and optimistic attitude during work hours.", "cons": "Communication isn’t what it should be, especially regarding patient care plan updates."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Okay", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "3 Jun 2021", "job_title": "Care Manager in Milwaukee, WI", "duration": "N/A", "pros": "Benefits, experience, clients, hours, flexible", "cons": "Constant changes, lots of paperwork."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Care Wisconsin", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 May 2021", "job_title": "Nurse Practitioner in Madison, WI", "duration": "N/A", "pros": "flexible, supportive co-workers, work from home,", "cons": "unorganized, poor company communication, not working up to level of license"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Love the camaraderie", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Nov 2020", "job_title": "Chief Executive Officer in Eau Claire, WI", "duration": "N/A", "pros": "When you work with the same group of people for a few years they start to grow on you. I’m not ashamed to say that the My Choice staff have become like family to me. We’ve been there for one another through thick and thin. Plus, the work itself is incredibly rewarding though it can have its taxing moments.", "cons": "Management has always been lacking in communication."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Clueless and harmful", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2021", "job_title": "Anonymous Employee in Madison, WI", "duration": "N/A", "pros": "comparable compensation, remote work, hard working employees", "cons": "poor leadership, little understanding of employee experience, poor communication, dictatorial/top down approach to all operations, secretive and manipulative decision-making, top-level leadership takes no input from any other levels of organization to inform decision-making"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Feb 2021", "job_title": "Care Manager in Eau Claire, WI", "duration": "N/A", "pros": "Love the office environment. \r\nManagers are awesome\r\nValue family life", "cons": "Pay is ok for type of work\r\nWork load can be to much sometimes\r\nNo raises"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": ".", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Mar 2021", "job_title": "Lead Supervisor in Madison, WI", "duration": "N/A", "pros": "love the flexibility in this role", "cons": "too much work for one person in this role currently"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Highly recommended", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Dec 2020", "job_title": "Regional Program Manager in Wauwatosa, WI", "duration": "N/A", "pros": "Lots of opportunity to learn and grow. There’s not so much oversight from management that you feel like there’s someone breathing down your neck. The mission is geared towards providing care in the best way possible. I don’t have any complaints.", "cons": "As mentioned, I don’t have any complaints."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Company Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Feb 2021", "job_title": "Care Manager in Sheboygan, WI", "duration": "N/A", "pros": "Work life balance and support from management WAS amazing", "cons": "Merged with a different MCO 1/2020 and no longer feel valued or supported"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jan 2021", "job_title": "Care Manager in West Bend, WI", "duration": "N/A", "pros": "Compensation, benefits, supportive coworkers and supervisors, rewarding work.", "cons": "Increasing responsibilities, stressful job, unclear communication"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Amazing Mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Oct 2020", "job_title": "Anonymous Employee in Wauwatosa, WI", "duration": "N/A", "pros": "Staff are empowered to provide the best care for all members.", "cons": "Executive approval process is time consuming."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jan 2021", "job_title": "Registered Nurse Care Manager in Kiel, WI", "duration": "N/A", "pros": "Work remote, flexible, work from home", "cons": "Poor management, little growth. Poor technology"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Severe lack of communication and respect", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Mar 2020", "job_title": "Human Resources in Madison, WI", "duration": "N/A", "pros": "There are no pros to working here", "cons": "The executive team and lack of communication"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love working here", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2020", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Care Wisconsin has an extremely welcoming atmosphere, and staff are always willing to help out. They are organized and have responsible, hard working employees that I’ve had the pleasure of working with this far! It is extremely rewarding to help the members that you work with, and for them to show appreciation and gratitude for your help.", "cons": "It’s a fast paced job and you definitely do a lot of learning as you go. You can’t take things personally, and you can’t slack, otherwise it will be a very difficult job."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DONT WORK FOR THIS COMPANY", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Jul 2020", "job_title": "RN Care Manager in Dodgeville, WI", "duration": "N/A", "pros": "You can work from home", "cons": "Literally everything else is a con"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Not great. Little regard for the members served.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Jun 2020", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Rey flexible work schedule and great co-workers", "cons": "All based on money. Members are not fully supported."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Decent place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jun 2020", "job_title": "Case Manager in Wauwatosa, WI", "duration": "N/A", "pros": "Work from home. Flexibility is great. \r\nMerged with Care WIsconsin 1.1.2020; promoting more opportunities.", "cons": "Sometimes your caseload will increase and can become chaotic."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Loved the Company Prior to Merger", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Oct 2020", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Flexible Schedule, Work From Home, Rewarding by making a difference", "cons": "Lots of work and hard to keep up"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "It's okay", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Mar 2020", "job_title": "Care Manager in West Allis, WI", "duration": "N/A", "pros": "Parties for staff, good coworkers", "cons": "Office environment, kind of outdated, no young people"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Work/Life Balance", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Feb 2020", "job_title": "Care Manager in Green Bay, WI", "duration": "N/A", "pros": "Supportive co workers to help", "cons": "Work life balance isn't there. Expect to work more than 40 hours a week"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "ok", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Aug 2020", "job_title": "Care Manager in Wauwatosa, WI", "duration": "N/A", "pros": "coworkers. The RNs and CMs are great.", "cons": "very heavy caseload. Unrealistic deadlines. High turnover."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Aug 2020", "job_title": "Care Manager in Madison, WI", "duration": "N/A", "pros": "Options to work remote at times", "cons": "Benefits are terrible and employees are treated poorly"}]]