[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful place to work!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I loved my time at Global Citizen Year. The team is passionate about the work they are doing and genuinely care about each other. Everyone is a continuous learner—striving to be better both personally and professionally. I felt very supported by my manager and teammates. Values like integrity, honestly, accountability and vulnerability were modeled from the top down. The organization takes its commitment to DEIA seriously by constantly examining what they are doing well and where they can improve. I deeply admired my colleagues and feel like I am a better employee and person after working at Global Citizen Year.", "cons": "I wouldn't say this is necessarily a con, but the organization does move quickly and is constantly pivoting to grow, try new things, and adapt to our ever-changing world. This is exciting and challenging in a good way but it does mean that you need to feel passionate about the work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "One of the best orgs to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jun 2022", "job_title": "Team Leader", "duration": "N/A", "pros": "Supportive admin team\nAmazing, positive team atmosphere\nMany opportunities for personal and professional growth\nExciting work environment\nUnlimited PTO (modeled and encouraged by admin)", "cons": "Work-life balance is difficult to maintain at times"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Fast-paced, visionary non-profit", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jan 2021", "job_title": "Anonymous Employee in Oakland, CA", "duration": "N/A", "pros": "You will be surrounded by smart, committed and KIND people who are at work for all the right reasons. Global Citizen Year has a collaborative culture with a genuine commitment to diversity, equity and inclusion. I love how the mission combines a focus on global citizenship, education, and leadership, and how the global Fellowship is charting a new and better pathway from high school to college. Everyone should do a Global Citizen Year!", "cons": "I only wish more funders would provide long-term core support to organizations like this, which would allow Global Citizen Year to plan longer-term, invest in core infrastructure, and scale up its programming to reach many more students."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working for Global Citizen Year", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Jun 2021", "job_title": "People and Operations Manager in Oakland, CA", "duration": "N/A", "pros": "Flexible time off and the opportunity to work remotely.", "cons": "Employee turnover rates and staff retention could be better."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Not for you if you want a career", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "25 May 2021", "job_title": "Team Leader", "duration": "N/A", "pros": "Good Work - Life Balance", "cons": "Limited opportunities - Employees not heard - High turnover"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing people, amazing org", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 May 2021", "job_title": "Team Leader in Pune", "duration": "N/A", "pros": "Loved every second of working there! The people made it great :)", "cons": "Looking back, very hard to think of any cons"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome and supportive place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Dec 2020", "job_title": "Marketing", "duration": "N/A", "pros": "Everyone is truly connected to the mission and vision of the organization and it shows. Impressively adapted to and improved remote work culture during COVID.", "cons": "very fast paced work environment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I loved working at Global Citizen Year!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Feb 2020", "job_title": "Strategy & Evaluation Manager in West Oakland, CA", "duration": "N/A", "pros": "- At Global Citizen Year, there is a focus on growth and self-development and you will always receive the support you ask for.\r\n- You will meet some of the most incredible people you've ever met in your professional career.\r\n- You'll have colleagues who'll inspire you. \r\n- You'll find a sense of community & comradery at work. \r\n- Unlimited paid time off & flexible work from home days (once a week).   \r\n- It is a very diverse and inclusive work environment.", "cons": "- Like in any role/job, your experience on the job will only be as good as your manager. I was super fortunate to have an incredible manager at Global Citizen Year and had four managers at one point, all of whom I loved!  Definitely, interview with your direct manager before taking the job. This generally a good idea! \r\n- Like with most non-profits,  you might feel overworked & underpaid at times; something that can be a challenge for a few. How you deal with this completely depends on where you are in your career and your role within the organization. In my experience, if you truly believe in the mission of the organization, value good work culture, opportunities for growth & diversity -- you are at the right place!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great leadership, Great Culture, Great Opportunities for growth", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Feb 2020", "job_title": "Anonymous Employee in Oakland, CA", "duration": "N/A", "pros": "I worked at Global Citizen Year for over 5 years, and truly enjoyed my time there.  The leadership of the organization is transparent, approachable, and genuinely values feedback from staff (and then implements it!). My fellow colleagues are smart, caring, fun and invested in their work and the mission. The organization stands behind its values around diversity, equity and inclusion - talking the talk and walking the walk! This was really important to me as a person of color. \r\n\r\nLeadership is also committed to individual growth and development. In addition to being promoted, when I outgrew the role I was initially hired for I was able to work with management to figure out how to best leverage my skills towards the needs of the organization. I was supported to develop skills I didn't yet have (but wanted to).", "cons": "The organization is still growing and building -- so there are is an emphasis on thoughtful experimentation. If you are someone that likes it to be all figured out - this might be a challenge for you."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "There's a place where passion and call are taken into consideration !!!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Feb 2017", "job_title": "Program Coordinator in Oakland, CA", "duration": "N/A", "pros": "Your thoughts and ideas are always welcome;\r\nDo what you do best and get support from your team to improve in areas that you might need it;\r\nEveryone is relevant, everyone is connected, there's no way your success is only yours, everything we achieve is as a group;\r\nBalance and personal lives taken into consideration;\r\nI had an unforgettable time at Global Citizen Year, I keep the team that I worked with close to my heart and can say I made friends for life during my time there. They believe in my potential and nurtured my personal and professional dreams. I would work or volunteer anytime for them. You actually have a chance to do something to build a better future.", "cons": "Young NGO compared to others so there's areas for improvement like any other \"new\"NGO.\r\nIf you are not ready to face new challenges, if you are not flexible and willing to embrace uncertainty every now and then don't even bother. \r\nIt's a place for you to help and be part of solutions."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fantastic opportunity to grow personally and professionally & to support youth to reach their potential!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jan 2017", "job_title": "Program Manager/Team Leader in Quito", "duration": "N/A", "pros": "Casual environment - loved this!\r\nTravel within host country and to the Bay Area once a year or every other year\r\nSpace to experiment and innovate\r\nYour voice counts! (can't say this about all organizations)\r\nMagnified experience due to a variety or realities presented by nature of the job\r\nSuper rewarding job!\r\nOne can make unique friends and learn a lot about different subjects on diverse areas such as project and volunteer management, community outreach, program evaluation and much more", "cons": "Very demanding job (working with youth in a host country presents many expected and unexpected challenges) \r\nHard to separate time for personal life sometimes, which can be hard for some people depending on at what point in their life they are at\r\nSometimes young participants can have a condescending attitude towards staff"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Selection Team Member", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good opportunity to interact with prospective Fellows for a people-person\r\nGood training in identifying good applications and candidates\r\nGot training in how to conduct interviews", "cons": "Didn't feel like my input was taken all that seriously, since the admissions officers didn't--to my knowledge--follow up on my concerns of applicants"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Amazing organization focused on values, growth, and movement building", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Emphasis placed on both personal and professional development\r\n- Mission and vision are embodied by the leadership\r\n- Inspiring and hard-working teammates\r\n- Change is welcome - good ideas are celebrated\r\n- strong team environment facilitated by things like weekly reporting tool, pulse checks, global town hall, org-wide goal setting, etc.\r\n- work/life balance encouraged and example is set by leadership team", "cons": "- growing organization so things can move quickly and change often so you need to be open to that type of environment\r\n- work environment requires taking initiative, being a self-starter, and building up your own expertise if it doesn't already exists within the organization"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Mission-driven, incredible team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Exciting environment: Energy from the fellows, incredible colleagues, and especially the mission and impact. It's palpable, like when an alum drops by the Oakland office for tea.\r\n\r\nLearning environment: Tons of opportunities to \"step up\" and test out something new, or a new way of doing things\r\n\r\nGood pace: People working quickly, creatively. Focus on end results which makes the days more exciting. definitely prepped me for grad school and a foray into the private sector.", "cons": "Prioritization- there can be so much to do (and a changing, entrepreneurial environment), it takes a lot of internal prioritization to focus on the right stuff. When I did, magical. When I didn't, I ended up having more catch-up work on some areas, and deeper-dives went under-appreciated."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Nov 2019", "job_title": "Director of Communications and Outreach", "duration": "N/A", "pros": "Really love working here. The environment is great as well as the emphasis on work/life balance. You are truly encouraged to do your best but also be your best self. There's an emphasis on professional development AND personal development. This is a great place to work for motivated people who want to work for an organization where everyone truly believes in the mission.", "cons": "Working for a start-up-like organization means things can be constantly changing and there's often something that's not totally figured out. Global Citizen Year is impressively transparent about what's going on and that is super helpful, but I think to be successful here you have to be comfortable navigating ambiguity and redirecting efforts and projects as needed"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great idea in theory, reprehensible business practices", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The theory underpinning Global Citizen Year is fantastic. Who would disagree with sending 18-year-olds to developing countries to get a dose of the real world before spending tens (or hundreds) of thousands of dollars on a college education?", "cons": "The image that the leadership puts forth to the public and its funders is entirely different from the way in which employees and paying students are treated. Salaries are decided on the whim of the hiring manager, with little regard for educational background or experience. Employees are worked to the bone. Secrecy and disingenuous dealings with employees is the status quo."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great Mission Blighted by Poor Management and Lack of Leadership at Country Level", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 May 2019", "job_title": "Team Leader", "duration": "N/A", "pros": "Global Citizen Year's mission is making an impact in young adult's lives and it is evident that employees are very passionate about the mission.  The US based staff are working hard to bring the vision and program improvements to the respective countries. The headquarters seems like it has a good office culture and work environment.\r\n\r\nTeam Leaders have a very flexible schedule and the independence to manage time and plan tasks and activities on their own.  As a TL you are able to work from home often and a computer (Mac Airbook laptop) and Google phone is provided to you.  You'll work on a rather small team which is beneficial in having your voice heard, working together, collaboration, bonding etc.\r\n\r\nThe benefits are generous: health care coverage + spouse/long-term partner, continuous learning stipend of $100 to use for non professional activities, professional development stipend of $500, adequate vacation time allotted for Team Leaders after the program cycle and around winter holidays.", "cons": "Management and leadership at the country level is evidently lacking, and is the root cause of many frustrations, even expressed by the program's Fellows. There is an apparent disconnect between HQ and country teams, and there are many inconsistencies regarding the organization's policies, procedures, and protocol. Management seems to make off the cuff decisions and are not present or accountable to their teams or fellows. Management is not willing to listen to or appreciate the opinions of team members, and seems to feel threatened when an employee is too opinionated or offers suggestions/alternatives.  \r\nEmployees are not encouraged to take advantage of benefits (health care, stipends) so you will have to put pressure on the organization to receive them. Management is constantly looking for ways to cut program costs, and do so at the expense and to the frustration of the employees and Fellows. The passion for the mission and the organization's principles is non-existent at the country level.\r\n\r\nA Team Leader is on call basically 24/7 for fellow's needs. TLs often work on the weekends (you're allowed the following workday off) however this, in addition to holidays are often overlooked, so you can feel like you're constantly working, and it can be difficult in the environment to claim these rights/speak up about it.\r\n\r\nA major inconsistency across countries is the lack of organization with regards to Health and Safety. Some countries have Health and Safety Managers, others don't. TLs are provided basic first aid training, but are often expected to take on the entire role of Health and Safety Manager without proper training, including emergency response and mental health issues. This is extremely concerning as TLs are not properly trained to handle these situations, let alone have the capacity to do both roles. Long days sitting at a clinic is a regular routine as a TL, which is tedious and can make you feel unproductive and stagnant. \r\n\r\nThere is very little room for growth in the Team Leader role and management lacks in helping to navigate the role and improve skills or provide advice when needed. You learn as you go, but it is up to you to figure things out and work on improving your skills (i.e. coaching/mentoring), with limited support. There is no career path for a TL or to move up in the company. If you're looking to \"grow your career path\" this is a dead end. \r\n\r\nTLs are extremely under-compensated, although the role is advertised to have a \"competitive local salary.\" The keyword here is local. If you are a national, this could be a good opportunity for you, however if you're an expat/foreigner, be prepared to be shocked by the below poverty line (US) annual salary, and don't expect to be able to do more than meet your basic needs each month (especially if you have student loan debt)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Highly recommended! It was an honor to spend 4 years working with them as a team leader.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Jan 2020", "job_title": "Team Leader in Thies", "duration": "N/A", "pros": "- Working at Global Citizen Year was an absolutely fantastic experience, from which I learnt a lot and that provided me with a broad set of transferable skills as well as incredible life experience. \r\n- There are many different aspects of the job, which definitely keeps things interesting : working with local partners, organizing and leading trainings, 1:1 coaching and mentorship, emergency response and risk management. \r\n- The philosophy and approach to holistic and experiential education that Global Citizen Year has developed is one with which I strongly resonate. It was truly an honor to a part of, and have an effect on, a profoundly impactful experience for so many incredible young people from many different backgrounds. \r\n-  For me, the work was relatively flexible, having a large degree of control over my schedule and responsibilities, though also often working with a small team to organize events, and set up and run all aspects of the program. \r\n- The broader Global Citizen Year program, with teams spread across 5 countries, is also a pleasure to be a part of, to learn from and contribute to. It was so rewarding to have colleagues from so many different countries, based in vastly different locations around the world, yet to have a common set of values, experiences and values that bound us together.\r\n- There is a genuine sense that the organization as a whole is truly committed to the vision and mission that it espouses and the leadership at Global Citizen Year is incredible. Each year that I worked there felt very different from the last as there always seemed to be a willingness to improve and refine the program.", "cons": "- Being a team leader is not something that I could do forever. It can be very intense and at times frustrating (although equally there are slower periods in which to recover). \r\n- Given the nature of the work and the relatively small country teams, there is limited room for progression. However, the team leader role provides skills and experience that are highly valuable for other employers."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Epic Growth, Excessive Uncertainty", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jul 2018", "job_title": "Program Coordinator in Pune", "duration": "N/A", "pros": "The company culture thrives around the the experience of the Fellows themselves, and tends to attract an amazing clientele of young leaders and curious global citizens ready to explore the world.  \r\n It has a young and experimental vibe- there is lots of enthusiasm as the firm expands and refines its product. The organization is extremely vocal about why we do what we do, exploring and refining quality at every step of the way- it is a great way to get familiar with Design Thinking and building the bridge year movement from the ground up. \r\n\r\nIt provides great training and travel opportunities internationally and locally, and exposure to students and situations of all kinds.  It will provide great insight into experiential education and intercultural adaptation, emergency response and the international workplace.", "cons": "Practically speaking there is little security in terms of your position expectations or day to day tasks. The firm is attempting rapid expansion and the workplace is highly chaotic and unreliable in terms of what it can promise employees for the year, let alone a longer career.  \r\n\r\nAlthough they try to focus on highest quality student experience, they have yet to refine a lot of the baseline logistical and internal processes at the firm.  Your job may regularly ask you to move, change roles or tasks with minimal training and in a fast paced work environment.  This refers to location, compensation, colleagues and work-life balance. \r\n\r\nThe Communication and feedback model between the US based headquarters and various field staff is yet to be fluid and effective.  \r\n\r\nThe turnover can be fast-paced meaning that it is rare to meet someone truly experienced who has been around long enough to support a stable company culture and work environment.  \r\n\r\nAt times there is a lot of talk about ethics and values- which is great; but at times lacking is practicality, and this can be extremely frustrating and exhausting when already working in a chaotic working environment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Loved the people and the cause, it was a great environment and truly believe there is a huge social impact factor in the work they do.", "cons": "Depending on where you are,  it could be a bit hard to have \"work\" environment given that the work can be very independent. There's not an office where people get together and that can be very positive sometimes."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Exceptional team on a mission to change the world", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Apr 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Global Citizen Year attracts top talent from a diverse range of backgrounds, and employees are supported in bringing their head, heart and whole selves to work.  I've never worked for a more committed, creative or inspired team.", "cons": "Because the organization is young, fast-growing, and mission-driven, it's not a place for people looking for a 9 to 5 \"job\".  It is, however a unique opportunity for people looking to design, build and have an impact."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wonderful place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 May 2019", "job_title": "Anonymous Employee in Oakland, CA", "duration": "N/A", "pros": "Global Citizen year is my 5th different employer and it has been by far the best place I have ever worked.  There is incredible leadership, a compelling mission and culture that really practices what it preaches in terms of employee benefits, challenging people to get into their stretch zone and celebrating diversity.  You can bring your true self to work here.", "cons": "Growing the program has been slower than anticipated"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Up and Coming Organization", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing people--some of the most passionate individuals I have ever met. Very invested in their jobs and the success of the fellows.", "cons": "Hard to maintain a work-life harmony at times. Work often times took over personal time. However, the staff were always there to help and support one another during hard times."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Loving my work at Global Citizen Year", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Dec 2019", "job_title": "Vice President in Oakland, CA", "duration": "N/A", "pros": "-Inspiring mission: we offer a life-changing experience for young leaders from diverse backgrounds\r\n-Results-driven organization that uses both data and technology in innovative ways\r\n-Fabulous people who are curious about the world and passionate about what they do\r\n-Focus on scaling our impact - Love building partnerships to embed our model in the education system", "cons": "Small team - everyone wears lots of hats! But this can also be stimulating."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Much Room For Improvement", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Apr 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "GCY can provide a transformative experience for Fellows, there are real opportunities for them to grow during the program. \r\nAlso, the curriculum design is great for expanding upon the lived experiences in the Fellows' host communities. \r\nAnd lastly, there are many great and interesting people that work for the organization in the different host countries and in the Oakland office.", "cons": "This organization does not fairly compensate those working in the Team Leader role. Team Leaders are expected to constantly care for Fellows and at times are made to handle emergency and mental health situations that are outside of the scope of their capabilities. \r\nThe organization also does not value the host countries or think much of the needs of host families and apprenticeship hosts. GCY does not \"practice what they preach\" when it comes to compensating and valuing local communities. Instead they look for ways to cut cost and save money, at the expense of host communities. \r\nThe organization is run by very smart people, who know what they are doing with their branding and marketing decisions. But potential employees beware, you should know before applying that GCY is a business, and at the end of the day the most important thing for management is profit. Management is great at making you feel like you voice matters and that you are engaged in important work. But when they are tested, they will show that they value profit and power over principles."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Amazing opportunity to join early stage startup with top-tier team", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Strong mission, very passionate team, extremely committed CEO.  Lives by values of open communication and transparency.  Committed to results and growing the organization.  Many opportunities to take on more responsibility.", "cons": "Up and coming organization, still going through growing pains which is normal for early stage startup.  Job titles and positions still being defined."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Decent benefits, but you work overtime with no compensation", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 May 2020", "job_title": "Team Leader in San Francisco, CA", "duration": "N/A", "pros": "- Professional development funds\r\n- 1 month paid of sabbatical\r\n- good health insurance (in-country staff)\r\n- provide everything you need to do your job (computer, phone, funds)", "cons": "- You work overtime too often and with no compensation\r\n- New projects and responsibilities are assigned to you as \"leadership opportunities\" with no compensation \r\n- male counterpart earned more"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing team and leadership!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Sept 2019", "job_title": "Assistant To The Chief Executive Officer in Oakland, CA", "duration": "N/A", "pros": "The work culture is amazing, and the team is brilliant and kind! I especially loved the flexible and mission-driven  environment. The leadership is responsive and really inspiring.", "cons": "Team was understaffed at points, but organization is working on addressing this."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Intern", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Oct 2014", "job_title": "Intern", "duration": "N/A", "pros": "Resume Builder, all expenses paid work opportunity, great way to break into non profit work, would recommend to those unsure about college", "cons": "leadership does not take into account needs of fellows, need to work more on fellow in-country job placement, and ensuring that fellows have a job upon arrival"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Summer Alum Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-Great office culture\r\n-Mission-driven\r\n-Lots of interaction with higher-level staff\r\n-Opportunity to get to know Fellows\r\n-Open to new ideas\r\n-Pretty fair stipend and help finding housing", "cons": "-Young organization\r\n-Day-to-day can get very repetitive \r\n-Sometimes not a lot of work to do"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Some of the best people I have worked with.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Committed Staff\r\n- A culture committed to improvement\r\n- Emphasis on staff diversity \r\n- Great company benefits.", "cons": "- Because it is a growing organization, there is limited room for growth"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worker beware", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Oct 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Work with great fellows\r\n-Work with a new and growing organization\r\n-Help find, foster, and support growing leaders", "cons": "-Very questionable business practices\r\n-Constant feedback cycles but feedback never taken into account; management often got angry and defensive\r\n-Very low pay for field staff\r\n-Expectation to work non-stop"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Team Leader", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jan 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits and team work", "cons": "Work/Life balance is not always possible"}]]