[[{"date": "5 Jul 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Fort Worth (Fort Worth, TX)", "Interview Descriptions": "Department was a mess. No manger or director. No information on the job itself. Everyone seemed confused. Was offered the job before I got to my car. Red flag. Seemed very unorganized and made it know that staff was not nice.", "Interview Questions": "No questions asked. You could tell they just needed to fill the spot."}, {"date": "26 Jan 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Fort Worth", "Interview Descriptions": "Very fair and typical interview. Everyone was super nice to me. Interview questions were what you would expect them to be such as \"tell me about yourself\" and \"what do you think you would contribute to our community here\"", "Interview Questions": "\"Why should we choose you to work here?\""}, {"date": "5 May 2023", "title": "Patient Safety Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Nov 2022", "Interview Descriptions": "Fast and easy just be honest about everything they love honestly and determination I was pretty nervous at first about some questions but the lady was really nice and even though I had no experience in the medical area they still gave me a chance", "Interview Questions": "What made you apply for patient safety attendant"}, {"date": "24 Mar 2022", "title": "Certified Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical City Fort Worth", "Interview Descriptions": "Very straight forward. Manager interviewed, no other  staff available join the interview that day. This was during COVID. The manager seemed very nice and attentive, she asked appropriate questions regarding experience, education, etc.", "Interview Questions": "Tell me an experience when you had to think fast?"}, {"date": "14 Feb 2023", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Jan 2022", "Interview Descriptions": "Great, it was quick and the manager was very understanding. They worked with my schedule and didn’t feel overwhelmed. Was a little nerve racking, however, isn’t that most jobs. The interview wasn’t bad at all.", "Interview Questions": "Do I want days or nights."}, {"date": "2 Dec 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Fort Worth", "Interview Descriptions": "Smooth interview process. Took about 30 minutes. Managers were very kind and upbeat. Could tell it was a very upbeat fun work environment. Peer interviewing went smoothly as well. Well structured interview.", "Interview Questions": "Qualities you look for in a leader "}, {"date": "15 Nov 2021", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Fort Worth in Sept 2021", "Interview Descriptions": "Total Two rounds: Phone interview\r\n face to face: one hour with three peopole and tour,\r\ngot offer through phone\r\nThe interviewers are friendly and professionals\r\nMade me feel comfortable during interviewed \r\nTook me 2 weeks\r\nFast interview process", "Interview Questions": "What your weakness and strength "}, {"date": "10 Jun 2021", "title": "RN Rehab Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Apr 2021", "Interview Descriptions": "First you have a panel interview with some managers. They tell you about their units and then you tell them about yourself. And then a separate interview with unit nurses. They pretty much are trying to see if you can fit in into their team.", "Interview Questions": "Describe a situation where you utilized some critical thinking during your clinical rotation as a student."}, {"date": "19 Mar 2021", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Medical City Fort Worth", "Interview Descriptions": "Nurse manager was busy but made time to make me feel seen. Second interview was with two floor nurses. We set a time to interview and they were 2 hours late in calling me. Not very respectful of my time. They also asked about another interview I had.", "Interview Questions": "What 3 things would you need from the workplace in order to stay?"}, {"date": "11 Feb 2021", "title": "RN Clinical Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Fort Worth", "Interview Descriptions": "First was the screening with the recruiter. Then interviewed with direct leadership. Then peer interviewed panel with 4-5 other Clinical educators from different facilities. Lastly, panel interview with leadership from different facilities.", "Interview Questions": "Tell me about a time when you had to use communication for conflict resolution. What did you do and what would you have done differently?"}], [{"date": "11 Nov 2020", "title": "RNER Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Nov 2020", "Interview Descriptions": "It wasn't what I was expecting. I met with 2 managers/directors first, asked the questions I had prepared and then was put in a room and various staff nurses came in and asked me questions. They were really casual, and I had to wait about 5 minutes in between each \"interview\" with a nurse. I felt like I got cheated in this interview style. It's been about 3 days and still haven't heard anything.", "Interview Questions": "Why do you want to work in the ER?"}, {"date": "26 Sept 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Sept 2020", "Interview Descriptions": "Interviewed for an ER position. One of the Management personnel was more interested in constantly looking at her watch than interviewing me. It made me feel like I was wasting my time and affected how I answered because I found it inconsiderate. I also found the questions more on a Director level and I was not hiring for that position.", "Interview Questions": "Have you ever been in a position where employees had a conflict? How did you handle the situation?"}, {"date": "21 May 2022", "title": "Regsistered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Jul 2020", "Interview Descriptions": "Interview process for a pcu floor was very easy.  I interviewed with the manager and director and both were easy going. They asked about 15 questions, why do I want to work there, how are you a team player, tell me about yourself, a couple of delegation questions etc. Very easy .", "Interview Questions": "How do you feel about taking care of a COVID patient "}, {"date": "29 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Fort Worth", "Interview Descriptions": "Telephone screening then director phone interview (which the director missed). Offered job without talking to director. Out of city interview. Nice ED recruiter.  long application on line. (just filling in words to meet the 30 word minimum)", "Interview Questions": "Do I have a close relationship with my coworkers"}, {"date": "11 Feb 2019", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Fort Worth in Jan 2019", "Interview Descriptions": "I attended the intern bash where you had a 15 minute interview with a department representative. There were several applicants as all of the hospitals were there. If you advanced then you come back for another interview in a week or so.", "Interview Questions": "They ask why I wanted to be in the unit that I was applying to "}, {"date": "1 Nov 2020", "title": "EVS Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Apr 2018", "Interview Descriptions": "Fast and to the point. They did not mince words and laid it out completely. Manager was very helpful and it mirrored the whole environment there as everyone was willing to help.", "Interview Questions": "How much experience do you have?"}, {"date": "28 Feb 2021", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Jun 2017", "Interview Descriptions": "Applied online and received aFace to Face interview. Initially interviewed with the director followed by a couple of current employees. Straight forward interview questions and wasn't put a tough spot. Was called by director a week later and offered a job.", "Interview Questions": "Describe a tough situation you were in and what did you in that situation?"}, {"date": "13 Sept 2017", "title": "RN CVICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Medical City Fort Worth (Fort Worth, TX) in May 2017", "Interview Descriptions": "Sat down with two of the day shift clinical supervisors for the intensive care units. It was not stressful at all, they made me feel comfortable, and gave me time to think of some answers when I could not off the top of my head.  I left the interview wanting to stay there and work that day.", "Interview Questions": "Patient population of previous ICU experiences."}, {"date": "15 Sept 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical City Fort Worth (Fort Worth, TX) in Sept 2016", "Interview Descriptions": "panel and peer interview, average difficulty questions. Interview process was simple and quick. They just wanted to get a feel for you and your personality. People were very nice and encouraging throughout the process.", "Interview Questions": "Research plaza, they want to know if you know about the hospital."}]]