[[{"date": "7 Mar 2023", "title": "Human Resources Business Partner HRBP Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas State Technical College (Houston, TX) in Feb 2023", "Interview Descriptions": "A few calls with a recruiter. Phone screen, then followed up with a call to organize a google meet meeting (video call) with the hiring manager - HR Manager and another HRBP. The interviewers were intense. They seemed very passionate about their jobs but the interview and conversations I had with the recruiter were very different and did not match the original job description. The recruiter explained that they were making changes to the job and listed qualities they were looking for but when I mentioned that to the interview team they seemed puzzled. The recruiter made it sound like they were looking for someone with extensive excel and reporting experience yet the interview team wanted someone with a lot of coaching experience. Over all it seemed like a waste of time and a lot of confusion for me.", "Interview Questions": "Do you have experience coaching employees? Tell us about a time you and a supervisor did not agree on how to handle an employees performance? Do you have experience with writing performance reviews/employee warnings?"}, {"date": "20 Nov 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas State Technical College", "Interview Descriptions": "Interview done via Zoom. They spent most of the time talking about the challenges they were facing. They promised a follow up regarding their decision. However, they ended up ghosting me and I never heard from them again. Very unimpressed.", "Interview Questions": "They did most of the talking about the challenges they were experiencing."}, {"date": "7 Mar 2022", "title": "Flight Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas State Technical College", "Interview Descriptions": "The interview process was simple and straight forward. They asked basic HR questions on a panel of employees. They had me teach steep turns and tried to find areas that you didn't cover.", "Interview Questions": "Why  would you want to work for TSTC? "}, {"date": "8 May 2023", "title": "Senior Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas State Technical College in Mar 2022", "Interview Descriptions": "Two step interview with manager of the department first and then the team. Informal virtual meetings and took 4 weeks to compete and get hired. Positive and good questions asked during if the meetings.", "Interview Questions": "Basic get to know questions Recruiting process full cycle"}, {"date": "24 Mar 2022", "title": "Visual Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Texas State Technical College (Sweetwater, TX) in Oct 2021", "Interview Descriptions": "Applicant beware. This organization will ghost you with no explanation. \n\nI applied for this role and was interviewed by a panel of individuals. I was then asked to produce a 60 second video on a topic of my choice. \n\nI produced the video and then only heard from TSTC once more. I sent multiple emails asking for an update and a month later I finally received the one and only response from one of the hiring managers telling me that the process was lengthy and I would eventually get an update from HR. \n\nI never heard from them again even with multiple emails asking for an update on the position. \n\nThis is completely unprofessional and is indicative of the company culture. Especially considering the amount of effort they ask you to put into the interview process.", "Interview Questions": "Name a time you went above and beyond for your job."}, {"date": "6 Oct 2022", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Texas State Technical College in Jul 2019", "Interview Descriptions": "Easy going and laid back. Interviewed with two people. There were two different interviews before the offer was extended. I didn’t feel like any of the questions were hard. Mostly situational questions.", "Interview Questions": "How do you present to a group of students?"}, {"date": "10 Jan 2023", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas State Technical College in Apr 2019", "Interview Descriptions": "Applied and called for an interview. Interviewed and the process took a while before HR got back to me. However, once they did it was pretty smooth after that. Typical, background check, drug screening, etc.", "Interview Questions": "What's the best customer service you've ever received? ..."}, {"date": "23 Oct 2018", "title": "Admissions Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Texas State Technical College in May 2018", "Interview Descriptions": "Had two video interviews. Very laid back and positive. Mostly talked about the expectations of the job (travel, benefits, how overtime was handled, etc). Gave a short presentation on the school.", "Interview Questions": "Tell me something you learned about TSTC while putting your presentation together."}, {"date": "29 Mar 2018", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas State Technical College", "Interview Descriptions": "After I applied they called and asked if we could do an interview. They were very nice and patient, asking all the typical interview questions and also asking about you and your personality to make sure you’re a good fit.", "Interview Questions": "Talk about a time when you were in a difficult position at work. What did you do? What was the outcome? "}, {"date": "20 Mar 2018", "title": "Student Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Texas State Technical College in Mar 2018", "Interview Descriptions": "Lengthy, thorough, friendly.  Very thoughtful scenarios with wide latitude to demonstrate how you'll fit in.  Standard canned questions.  Did not rush you to answer, take as long as you like to make your point.  Very patient.  Provided instant feedback.", "Interview Questions": "Multi part open ended, hard to follow.  Take notes!"}], [{"date": "23 Aug 2016", "title": "Student Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Texas State Technical College (Waco, TX) in Jun 2016", "Interview Descriptions": "I first created a profile on the college's campus jobs website (accessible only through the college's portal, one must be a student to apply for the job).  Then the hiring manager selected me for an interview based on my profile (I had also met with this person in person earlier).  After the interview, which was less than 30 minutes long, the manager contacted me a few days later to inform me that I had moved forward in the process and that they would be sending me the necessary paperwork to complete the job application.", "Interview Questions": "What does teaching mean to you?  (Or something to that effect, it has been several months since that interview)"}, {"date": "4 Dec 2015", "title": "Departmental Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas State Technical College (Waco, TX) in Nov 2015", "Interview Descriptions": "Hiring committee and hiring manager in interview; five people in the room total. Easy questions that were read off of a paper. Still have not heard back from them; I guess I did not get the job. Make sure you are aware of your previous work experiences as they asked a lot about that (good and bad moments).", "Interview Questions": "Where do you see yourself in 5 years? What is your greatest accomplishment and what is one area you need to improve in? Describe a time you made a mistake in the workplace and how you corrected it."}, {"date": "27 Mar 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Texas State Technical College (Red Oak, TX) in Jun 2015", "Interview Descriptions": "i presented myself with my resume,transcripts, and ASE and classes that I have received. To a panel of three I gave a presentation, went over my teaching experience and college transcript.\r\ntold why i wanted to teach, what i was interested in. what my goals were.", "Interview Questions": "what do you like about teaching"}, {"date": "4 Dec 2019", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Texas State Technical College (Waco, TX) in Apr 2015", "Interview Descriptions": "Character questions, Problem resolution questions, Instruction question, Technical questions.  Overall, the interview was character based, articulation of solutions, and presentation of knowledge and possible solutions.  Character questions dealt with scenarios and moral compass and integrity.", "Interview Questions": "What do I love about my field and where my interests lie."}, {"date": "1 Nov 2014", "title": "Instructor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Texas State Technical College", "Interview Descriptions": "This is a position for instructor for High voltage electrical systems. I got a phone interview without any notification, not sure about the undergoing interview process, I am still waiting for the response from the hiring manager.", "Interview Questions": "work experience required "}, {"date": "3 Oct 2015", "title": "Flight Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Texas State Technical College (Waco, TX) in Mar 2012", "Interview Descriptions": "Very easy interview mainly because i graduated from the college. Asked basic navigation, aircraft systems and airspace questions. Wanted to know why i wanted to work at TSTC. Very laid back environment.", "Interview Questions": "WHy do you want to work at TSTC?"}, {"date": "17 Aug 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Texas State Technical College (Waco, TX) in Nov 2011", "Interview Descriptions": "I had to fill out 20 pages of online work and submit all transcripts before getting an interview. The interview itself was conducted by a pannel who asked several questions off of a list, and then came up with their own questions.", "Interview Questions": "Why did I want to teach for a living?"}, {"date": "8 Feb 2013", "title": "Professional Sign Language Interpreter, Coordinator of Deaf/Disabled Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Texas State Technical College (Waco, TX) in Feb 2009", "Interview Descriptions": "My inital contact was hearing thru the grapevine TSTC would be starting a Deaf Services program there.  A good friend of mine, was hired to be the Director of the program and needed Certified Sign Language Interpreters to work there.  The persons, environment and great benefits were great!!!", "Interview Questions": "Latest book I had read...experience interpreting in a technical college atmosphere. My goals for the future..If I was willing to learn the technical field I would be working in by reading/glancing over the class textbook for appropriate signs"}]]