[[{"date": "2 Sept 2021", "title": "Financial Aid Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Davenport University (Lansing, MI)", "Interview Descriptions": "Basic interview with multiple people. Both male and female. I worked closely with almost everyone who interviewed me.  I was interviewed by phone first then asked to do an in person interview.", "Interview Questions": "Tell me your strengths and weaknesses"}, {"date": "17 Jun 2020", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Davenport University in Mar 2020", "Interview Descriptions": "Quick  turnaround from application to interview process. Interview over the phone was cordial and I felt comfortable answering all questions. Interviewer asked if I had any questions at the end and gave me the next steps in the process.", "Interview Questions": "What is your experience with Blackboard LMS?"}, {"date": "26 Feb 2020", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Davenport University", "Interview Descriptions": "Applied online and first interview was over Skype. Would have preferred in-person but that is what they requested- they're quite tech friendly.  In-person interviewers were pretty relaxed, 5 people were doing the interviewing in the first round, then an interview with the department director. Hiring process can be a bit lengthy with HR.", "Interview Questions": "Describe the skills you learned from a previous job that would be relevant/helpful for this position."}, {"date": "21 Nov 2019", "title": "Student Account Systems Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Davenport University (Grand Rapids, MI) in Nov 2018", "Interview Descriptions": "Was contacted for phone-screen roughly two weeks after applying, which was followed by two or three in-person interviews. Received an offer within six weeks of applying.\r\nCommunication throughout the whole process was frequent and effective.", "Interview Questions": "If you were a dog, what kind of dog would you be and why?"}, {"date": "4 Apr 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Davenport University in Mar 2017", "Interview Descriptions": "It started with a phone interview, however I was not selected to move to the next round.  The hiring managers were quite unprofessional at that point, which led to me accepting another job offer with their competitor.", "Interview Questions": "What does great customer service mean to you?"}, {"date": "4 Apr 2016", "title": "Bookstore Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Davenport University", "Interview Descriptions": "3 step process. Phone, one on one, group/panel. It took a pretty long time. Even after receiving the offer, it still took a few weeks to set up a start date. Pretty laid back interview process. They don't really grill you on anything. They went line by line down my resume and asked about almost everything.", "Interview Questions": "A lot of role-playing questions like, \"What would you do in this situation?\""}, {"date": "23 Mar 2016", "title": "Office Assistant - Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Davenport University (Grand Rapids, MI) in Nov 2015", "Interview Descriptions": "General interview questions, was really interested in my experience and what I was looking for. As a student worker, I was explained how beneficial the position could be the my degree plan and the flexibility for homework, etc.", "Interview Questions": "How do you think this position will benefit you?"}, {"date": "17 Feb 2018", "title": "Nursing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Davenport University in Jul 2015", "Interview Descriptions": "Met with the Director of the program and went over my qualifications before telling me the expectations for the position. Was shown around the University grounds and classrooms before ending the process.", "Interview Questions": "Why I liked teaching Nursing students."}, {"date": "27 Jul 2013", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Davenport University (Livonia, MI) in Jul 2013", "Interview Descriptions": "I was invited to a Faculty Assessment at the Livonia Campus after applying online.  There was about 30 other potential faculty members present.  Light refreshments were served.  The assessment had multiple parts and consisted of grading an essay, writing an essay, being interviewed, and giving a presentation.  Easy process.", "Interview Questions": "N/A"}, {"date": "24 Jun 2015", "title": "Security Services Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Davenport University (Grand Rapids, MI) in Mar 2013", "Interview Descriptions": "The interview process started with a phone interview and moved on to in person interviews. The whole process took about 4 months. They have a very slow hiring process. The panel of interviewers was made up of the security manager and then people from other departments. Most of the questions that were asked did not pertain to anything security related. Instead they spent most of the time asking questions about diversity, and scenario based questions that are mostly common sense. They also were very big on what you already knew about the university to see if you bothered to look over their website.", "Interview Questions": "What does diversity mean to you?"}], [{"date": "29 Jul 2015", "title": "Front Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Davenport University (Kalamazoo, MI) in Oct 2012", "Interview Descriptions": "Application process was a bit painful compared to other companies I have worked for.  Interview was pretty standard with Dean of the campus and Career Services head as well as a few department heads.  They asked the standard interview questions regarding what qualifies me for the position and what I could bring to the team.\r\n\r\nOver all a pretty cookie cutter experience after getting past the application process which was a little overbearing with extensive use of personality tests.  Yes, tests.  Almost overkill, same test over and over with slightly different names.", "Interview Questions": "What type of previous experience qualifies you for this role."}, {"date": "27 Jul 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Davenport University (Flint, MI) in Oct 2011", "Interview Descriptions": "You will be called. There is a brief review of your application. A meeting will be scheduled. This is where you must prove that you have a comprehensive grasp on the subject-matter. You will be called if you are chosen or not chosen for the position.", "Interview Questions": "Why do you want to teach at Davenport University?"}, {"date": "20 Aug 2010", "title": "Director of Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Davenport University (Grand Rapids, MI) in Jun 2010", "Interview Descriptions": "Combination of skills based and behavioral type interview.", "Interview Questions": "How would you put together a marketing plan for our university?"}, {"date": "17 Sept 2012", "title": "Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Davenport University (Grand Rapids, MI) in Mar 2010", "Interview Descriptions": "It was quite an easy process. I was asked some basic questions about my line of work. The whole process maybe took 30 minutes.", "Interview Questions": "Would be wrong of me to list this here."}, {"date": "7 Sept 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Davenport University (Flint, MI) in Aug 2009", "Interview Descriptions": "At this time the University only did one on one interviewing. I was interviewed by the Dean. This was a very comfortable experience, and I knew very quickly that I had been hired. I enjoyed the relaxed atmosphere.", "Interview Questions": "there were not any questions I could not answer I was hired because of my experience in the business community."}]]