[[{"date": "6 Jul 2023", "title": "Data Scientist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Binghamton University in Jun 2023", "Interview Descriptions": "First round on zoom easy questions and basic analysis etc. then in person second round with so many questions and clear bias in the questions. First round on zoom easy questions and basic analysis etc. then in person second round with so many questions and clear bias in the questions", "Interview Questions": "Provided data to be analyzed and sent back to them in 36 hours"}, {"date": "16 Mar 2023", "title": "PODS Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "Panel interview with six people. One round and 30 minutes total. Asked about interests and housing for next year. And GPA and previous experiences. Easy interview to get to know you and your Interest", "Interview Questions": "Three words to describe yourself"}, {"date": "20 Apr 2023", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Binghamton University (Binghamton, NY) in Mar 2023", "Interview Descriptions": "Two interviews. The first one is about yourself and your interests in working at the university. The second is about your teaching experience. There were five professors and each one of them made a different question.", "Interview Questions": "Why do you want to work at Binghamton?"}, {"date": "3 Feb 2023", "title": "Team Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Binghamton University in Jan 2023", "Interview Descriptions": "It is really easy. Just apply and you will get int I have had a great time interviewing for the university.Extrapulmonary (e.g. obstructive sleep apnea, croup) - can't get air into lungs Intrapulmonary (asthma, COPD) - can't get air out of lungs", "Interview Questions": "3. FEV1/FVC ratio ~80%, may be more sensitive measure of obstruction than FEV"}, {"date": "13 Nov 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "Interview process was good and i got to experince alot, and i was sucessfully abke to get admit and register myself to computer science program. And i also got the top three core subjects such as DAA, DB, OS", "Interview Questions": "why do you want to go to binghamton?"}, {"date": "10 Jun 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Binghamton University (Binghamton, NY) in Apr 2022", "Interview Descriptions": "Applied in March 2022. Got interviewed in April 2022 end. Heard back in June and got selected. This is not a technical job so don't expect any coding. Must possess good communication skills, able to talk in English.", "Interview Questions": "Do you know how to use or operate printers?"}, {"date": "27 Jan 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "Resume Screen, In Person Behavioral Interview with a focus on previous experience. After interview the interviewers reached out about a week later with their decision. The process was clear and straight forward.", "Interview Questions": "Can you speak to your past experience?"}, {"date": "4 Mar 2022", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Binghamton University in Jan 2022", "Interview Descriptions": "Talk to a variety of faculty and they ask questions about your experiences and what youve learned and why you want to join that program. they also allow you to ask questions to them.", "Interview Questions": "What specifically about Binghamton makes you want to join this program"}, {"date": "21 Sept 2021", "title": "Student Club Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Binghamton University", "Interview Descriptions": "Talked to team members and had three stages of interviews. There were multiple people in the room and they all took turns explaining and asking questions there was enough time to answer and ask questions at the end. Everyone was very open to answering and giving you time to answer", "Interview Questions": "What was a Time of difficulty for\r\nYou\r\n?"}, {"date": "26 May 2021", "title": "Teacher Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Binghamton University", "Interview Descriptions": "Met with Director for questions, had to lift 50lb dummy.  Whole process was about 45 min.  Asked questions about my experience, ability and willingness to learn.  Then I toured the school. Overall not difficult", "Interview Questions": "Why do you want to work at the ICD"}], [{"date": "28 Jan 2021", "title": "University Writing and Speaking Center Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "After the initial application, which had to be approved, you get either accepted or declined for an interview. Then, once you get the interview, it is virtual through zoom. Two members of the University Writing and Speaking Center were present, asking questions and laying out the responsibilities of the job.", "Interview Questions": "How do your friends describe you in three words?"}, {"date": "22 Sept 2020", "title": "Audit Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Binghamton University (New York, NY) in Sept 2020", "Interview Descriptions": "because of corona, everything was online. the interview was not hard that I expected. It seems like the interview was smooth but i did not get the offer. I would challenge on more time.", "Interview Questions": "why you want to work at binghamton university. "}, {"date": "25 May 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at Binghamton University", "Interview Descriptions": "GRE scores, GPA, previous experience. I applied as a graduate student and got full funding. I work 20 hours/week as a teaching assistant. Great job and lot of learning. I had no formal interview", "Interview Questions": "N/A"}, {"date": "7 Feb 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "It was two part interview, there was a individual interview followed by a group interview. The individual interview lasted around 15-20 minutes with a resident director and a resident assistant asking fairly basic questions concerning desire to work and how you would plan events and such.", "Interview Questions": "Group interview entailed working with others and being observed by other resident assistants."}, {"date": "10 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Binghamton University", "Interview Descriptions": "The process is very relaxed.  It was like a informal chat with the mentor.  My mentor went through every single job aspect with me in less than 30 mins.  I enjoyed the opportunity to speak with her in depth.", "Interview Questions": "Why you want to do research in Economics"}, {"date": "2 Aug 2022", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Binghamton University (Binghamton, NY) in Sept 2018", "Interview Descriptions": "Was a very relaxed process, went through word of mouth. Everyone was very nice and friendly, questions were just about my experiences and focused around why I wanted the role in the career center.", "Interview Questions": "N/A"}, {"date": "15 Aug 2018", "title": "Graduate Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Binghamton University", "Interview Descriptions": "This was a phone interview with two supervisors, and that was the only interview we conducted. Supervisors were very friendly and encouraging. It was a great experience in Harpur College.", "Interview Questions": "How do you explain the value of the arts and sciences to students?"}, {"date": "23 Jul 2018", "title": "Conference Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "There was no interview for this position. I applied to the Conference Assistant on the University website, which included questions about personal qualifications and questions about the importance of customer service. I received an email offer for the position later on.", "Interview Questions": "N/A"}, {"date": "28 Jun 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Binghamton University", "Interview Descriptions": "Applied on the website, 1 on site interview with excel tests.\r\nTests were not hard but you have to finish them all in a given time. Some questions are about pivot table, concatenate, and datetime, etc.", "Interview Questions": "Build a pivot table with the data on the sheet."}, {"date": "2 Dec 2018", "title": "Business Intelligence Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Binghamton University (Binghamton, NY) in May 2018", "Interview Descriptions": "I had applied online. I had two interview rounds. First was a face to face online interview with an entire team of the University and people I would closely work with. After that I was asked to come in for an in person interview. Again with a team of people I would be working with. The questions were asked one by one and everyone participated. Kudos to the Binghamton University Team that took my interview. The interview was very professional and everyone in the team was very knowledgeable. I was very impressed. The person who would be my Direct Manager was an amazing individual and professional. After the interview I was given a tour of the University Campus. Overall Great Experience and Wonderful and Professional People.", "Interview Questions": "Tell us Something about yourself?"}], [{"date": "1 Jul 2021", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Binghamton University (Binghamton, NY) in Mar 2018", "Interview Descriptions": "Two round interview + application. First round is general questions, second round gets more specific with supervisors as the interviewers. Two part interview, one section about yourself and one role play section", "Interview Questions": "Why do you want to be a tour guide?"}, {"date": "12 Feb 2018", "title": "IOS Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Binghamton University (Binghamton, NY)", "Interview Descriptions": "I was asked to come into the Computer Science Department and speak with a professor about helping with research and development on a school funded project.  I was not told about the specifics of the task until after the technical portion of the interview was completed", "Interview Questions": "Asked for experience with Data Structures and Algorithms"}, {"date": "23 Nov 2017", "title": "International Student Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Binghamton University in Jul 2017", "Interview Descriptions": "the most insulting and unprofessional interview experience I have ever had. they called me 3 days before a skype interview when I was packing and moving from Michigan to California, I told them if we could do it in 5 days, they still insisted to do it in 3days. then, a week later they called me again to meet on campus in 4 days  and they didn't want to pay for the flight from SD to Binghampton, so I paid for the flight + car rental for around $700( they paid for the hotel though). then, the interview itself went well and friendly. at the end, they said the result would be out within a week, and mentioned that they would reimburse some of the travel fee ( $54 if I remembered correctly). I went back to SD and started my endless waiting. a week later, I heard nothing from them, so I emailed their recruiter(who contacted before) for inquiring the result, she didn't response. A couple of days later, I called her, she didn't pickup, so I left a message on the answering machine, NO ONE ever called me back. So I emailed some of the hiring committee members, NO ONE responded to my email. So I thought maybe they were still deciding because the job posting was still on their website. However, about 5 weeks after the on-campus interview, they took down the job post. Even when it happened, I still didn't receive any notification of the position being filled. It is a common courtesy for the organizations to inform the interviewees the status of the job application. But they didn't do their job, they refused to communicate (if I was bad, lemme know, ok?). I have never seen any organization behaving like this. BTW, the hiring department was Undergraduate Admission, and the position was International Student Counselor.", "Interview Questions": "role play"}, {"date": "13 Nov 2017", "title": "Student Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Binghamton University (Binghamton, NY) in Jan 2017", "Interview Descriptions": "The interview was only a formality as I went over my resume and was hired on the spot. Only a basic understanding of technology and an understanding of how to work with customers and provide courteous service.", "Interview Questions": "What is your schedule like?"}, {"date": "10 Jan 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Binghamton University (Binghamton, NY) in Jan 2017", "Interview Descriptions": "Had several meetings with department professors and dean. Asked me questions about what I would teach and how I would. If I would stay there for 5 years and how I would prepare myself for a class", "Interview Questions": "How would I teach"}, {"date": "8 May 2018", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Binghamton University (Binghamton, NY) in Jan 2017", "Interview Descriptions": "Very brief, 1 round and around 30 minutes.  The interviewer was very nice and formal throughout the whole process. She was very forgiving with my mistakes throughout the interview process", "Interview Questions": "List your strengths and your weaknesses "}, {"date": "12 Sept 2016", "title": "Research Project Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Binghamton University (Binghamton, NY) in Sept 2016", "Interview Descriptions": "I received an email from the CS department about an opening. The interview was scheduled for the following week. They had only allotted 20 minutes for each interview, and scheduled them all in a row. There were technical questions that did not relate at all to the job description. There were 3 people interviewing me, when I thought there would be only one. Two of the people were very nice and polite, as to be expected in a formal interview. However, one of the interviewers was incredibly rude. He seemed dismissive of what I had to say and even checked his phone at one point. He refused to answer some of my questions. If there was something better he wanted to do with his time, maybe he shouldn't be interviewing candidates. If this is the level of professionalism that is to be expected in this department, it's no question why they have a problem hiring and keeping employees.", "Interview Questions": "What is the difference between Javascript and PHP? (PHP was in the job description, Javascript was not)"}, {"date": "16 Mar 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Binghamton University (Binghamton, NY) in Sept 2016", "Interview Descriptions": "had only one interview round. Questions related to experience. Questions related to web technologies such as PHP, Angular js, JAVA. The interview process was very easy, hardly for 20-25 mins.", "Interview Questions": "What web technologies I have worked on? Any experience handling client issues?"}, {"date": "5 Apr 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Binghamton University (Binghamton, NY) in Apr 2016", "Interview Descriptions": "I emailed a resume & cover letter to the office around February/March, had an interview sometime in April, and was offered the position in the beginning of the summer. Very nice people and easygoing interview.", "Interview Questions": "How do you go about helping a student who is flustered/agitated/argumentative?"}, {"date": "23 Apr 2019", "title": "GRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Binghamton University (New York, NY) in Mar 2016", "Interview Descriptions": "Phone interview followed by a lot of exchange of e-mails. Then, there was an offer  made by the secretary based on skills and experience and then the call came to submit an initial fee to book a spot", "Interview Questions": "How did you hear about us"}], [{"date": "6 Jan 2019", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Binghamton University (Vestal, NY) in Jan 2016", "Interview Descriptions": "interview process was very easy. One of my friends who worked there told his boss about me and i went in and started work in a couple of days. not too much to it. dont be rude", "Interview Questions": "How are you with technical support over the phone or in person?"}, {"date": "17 Nov 2016", "title": "Fitness Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Binghamton University (Binghamton, NY) in Mar 2015", "Interview Descriptions": "Very casual interview in a small room with three of your possible superiors. One of the interviewers will be pro staff and two of them will likely be students who are fitness managers. They are all very kind and are looking to see if you are a good fit. They are not daunting.", "Interview Questions": "Since this is a job in fitness they will ask you things along the lines of why you are interested in working at a gym and what your personal fitness story is like."}, {"date": "4 Dec 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Binghamton University (Binghamton, NY) in Nov 2014", "Interview Descriptions": "The first round is considsted of a one-on-one interview. There was the director and two other people there. Mostly asking about resume and behavioral question.  Then there is a group interview, which is not that hard.", "Interview Questions": "Tell me about yourself"}, {"date": "26 Jun 2014", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Binghamton University (Vestal, NY)", "Interview Descriptions": "The interview process consisted of 2 rounds.  The first round was to see if there was a passion among the applicants and if they knew what the position entails.  The second round was to see your behavioral skills and it was a simple interview process", "Interview Questions": "Weakness"}, {"date": "14 Jun 2014", "title": "Student Ambassador Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Binghamton University", "Interview Descriptions": "Well, there wasn't actually an interviewing process since the position did not require a salary, rather, hands on experience with customer interaction. Basically they looked for vibrant personalities that were't afraid to hold a conversation with strangers in an intellectual manner.", "Interview Questions": "N/A"}, {"date": "15 Jul 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Binghamton University (Binghamton, NY) in May 2014", "Interview Descriptions": "The interview was in a conference room with a professional staff from the office and the then current graduate assistant. We spoke for 30-45 minutes. I was nervous for the interview but felt confident afterwards.", "Interview Questions": "Your supervisor is new to the position, will you be able to act with out the support of someone who lacks the hands on experience?"}, {"date": "13 Jul 2015", "title": "Athletics Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Binghamton University (Binghamton, NY) in Apr 2014", "Interview Descriptions": "It was a 2 session process conducted in the Union. General interest interview in the 1st interview (Just do your homework and they will be impressed) and the 2nd was more behavioral and the questions were more geared to how I interacted with people. Was contacted by the hiring manager the day after the 2nd interview.", "Interview Questions": "Strength/Weakness"}, {"date": "2 Mar 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Binghamton University (Binghamton, NY)", "Interview Descriptions": "If you want to get into PODS then you need to visit PODS manager until you will not get call for the interview then interview process will be quite easy , question would be based on your academic background, some common technical questions related with computer.", "Interview Questions": "If you live off campus and if you don't have car then how would you manage to do midnight shift?"}, {"date": "25 Apr 2017", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Binghamton University (Binghamton, NY) in Jan 2014", "Interview Descriptions": "I applied for undergraduate teaching assistant for Korean 101 class and took a language test for about 30 mins to 1 hour. It was average test but grammar was kind of tricky one.", "Interview Questions": "gotta know grammar. "}, {"date": "5 Dec 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Binghamton University", "Interview Descriptions": "This was probably the smoothest interview experience I had during my entire job search.  Travel, hotel, and meals were completely paid for, requiring no reimbursement.  All the faculty and staff were very kind and friendly.  And I also got a nice tour of the general area and the university.", "Interview Questions": "Although good questions were asked, I was well-prepared for the interview and knew my subject very well.  I don't recall any questions I had a hard time with."}], [{"date": "1 Dec 2013", "title": "Grader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "I think it went very well, so that is why i got the position ,I wanna tell you guys that this position is easy to get if you have good connection with your professors, on the other hand, you need to email secretary every once a week for the interview results.", "Interview Questions": "What was your specific role in the team project and how did you show your leadership skills?"}, {"date": "27 Nov 2013", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "Got an email for interview. The interview lasted for half an hour. The past experience played a big role . Questions on DOT NET, HTML, CSS, Java Script were asked.", "Interview Questions": "N/A"}, {"date": "24 Aug 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Binghamton University", "Interview Descriptions": "The GA positions vary greatly by department. I got this one after a year of a TA position simply by filling out my department's standard application. There was no interview, and very little chance to differentiate myself from the field. I think that getting to know my advisor very well and explaining my abilities helped a lot.", "Interview Questions": "When do you expect to graduate?"}, {"date": "20 Apr 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Binghamton University (Binghamton, NY) in Jan 2013", "Interview Descriptions": "They didn't actually interview me. They chucked me around to different professors after the fact, but I'd been awarded a TAship before visiting. Some people with more teaching experience had less funding (and thereby less TAship). It was really weird. \r\n\r\nAlso, with the Clark - its not all diversity - it's just a good story diversity. If your diverse background wouldn't make a pretty picture in the course catalog, don't expect to get it.", "Interview Questions": "Are you willing to show students around the school? - seriously, they asked this"}, {"date": "17 Jun 2015", "title": "Course Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Binghamton University (Binghamton, NY) in Sept 2012", "Interview Descriptions": "Talked to the professor whose class i took the previous year.  She briefly went over my resume and transcript.  I had an A in the class and knew the professor fairly well.", "Interview Questions": "There weren't any questions."}, {"date": "12 Jan 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Binghamton University (Binghamton, NY) in Mar 2012", "Interview Descriptions": "You apply during the Fall semester.  The department will contact you by March (usually) if you are accepted and if you are given funding options. They will invite you (if there is funding offered) to come and visit (on their dime) and meet with potential advisors.  You then can decide if it is a good fit or not.  If you are initially offered funding, then it is your choice to come to Binghamton. There is no \"real\" interview.", "Interview Questions": "What field of interest do you see yourself pursuing during your time at Binghamton?"}, {"date": "7 Nov 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Binghamton University (Binghamton, NY) in Feb 2012", "Interview Descriptions": "My adviser called me at that time. He asks me many questions about my courses I learned and my technique background. He asked me several questions on my working experience, related to project I finished. We discussed how to solve some engineering problems. At last, he asked me why I prefer a Ph.D. study. I told him I really want to do some innovative research to broaden my vision and have a deeper insight into my favorite field.", "Interview Questions": "Explain the motivation for a Ph.D. study."}, {"date": "14 Jan 2016", "title": "Student Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Binghamton University in Feb 2012", "Interview Descriptions": "Written application, written questions, phone interview or in person interview. It as very easy and they just wanted to make sure that you were aware of resourc available or knew what to say/ who to call if you did not know.", "Interview Questions": "Find specific office information in the website\r\n"}, {"date": "5 Apr 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Binghamton University (Binghamton, NY) in Jan 2012", "Interview Descriptions": "Initial phone screening. Then in person interview with department head and a couple professors. They asked pretty basic questions about my education experience and projects I've worked on.They seemed eager to get someone to fill the position, as turnover for adjuncts is high.", "Interview Questions": "What is your experience working as a team"}, {"date": "2 Dec 2014", "title": "Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Binghamton University (Vestal, NY) in Sept 2010", "Interview Descriptions": "panel interview. Typical meeting with panel of potential coworkers, and other interested parties. Strange that the position advertised was not the position that they were interviewing for and hiring. Advertised for designer when actual position was for a project manager.", "Interview Questions": "typical questions"}], [{"date": "17 Jun 2014", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Binghamton University (Binghamton, NY) in Jul 2010", "Interview Descriptions": "submit a resume and they will call you back to let you know if they are interested. If they are not interested I don't know if they even send a letter declining you.  If you get an interview it's in front of a panel of employees, office personnel and board members.  If you get hired, you fill out a few papers, get a back ground check and physical with drug test.", "Interview Questions": "name a situation where you had difficulty with an underperforming employee/co-worker and how you handled it"}, {"date": "2 Apr 2010", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Binghamton University (Vestal, NY) in Jun 2009", "Interview Descriptions": "they just send me a letter to ask me if I want to be a TA. If I do, they are going to give me a interview and ask some basical questions. Then they call me, just ask me some simple questions to see how good my English is. s", "Interview Questions": "which research area are you interested in?"}, {"date": "22 Mar 2010", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Binghamton University (Vestal, NY) in May 2009", "Interview Descriptions": "What position do you expect?\r\nWhat language do you want to answer with? (I choose C.)\r\nWhat kind of questions do you meet for the online assessment?\r\n\r\nwhat is static in C? how is it implemented by the compiler?\r\nwrite the definition of a function that returns both the max and min.\r\nwhy do you use the condition variable?\r\nhow to implement a lock?\r\nUnder what condition must you use linked list instead of array?\r\nwhat data structure can you use to store elements dynamically and access\r\nthem efficiently?\r\nThe complexity of finding any element in a linked list in the worst case.\r\nmulti-thread library programming: did you write your multi-thread library\r\nwith p-thread? is there any problem you have with you library?\r\ndid you do your projects on linux? If you want to find a string in a file,\r\nwhat command should you use?\r\ndo you know vector in C++?\r\na question about real-time programming (I forgot)\r\nwhat is buffer overflow?", "Interview Questions": "Given two classes:\r\n\r\nclass B\r\n{\r\npublic:\r\nB(args_1);\r\nB(args_2);\r\n// and many constructors with different arg lists\r\n};\r\n\r\nclass D : public B\r\n{\r\npublic:\r\nD(args_1) : B(args_1) {}\r\nD(args_2) : B(args_2) {}\r\n// and many constructors with different signatures similarly implemented\r\n// some additional stuff specific to D\r\n};\r\n\r\nAssume that the arg list for B's constructors are quite long and may be\r\nrevised pretty often in the future, in which case D's constructors have\r\nto be recoded correspondingly. Duplicating the update by copy-and-paste\r\nwill certainly work here. Can you propose a better way so that the\r\nupdate can be done in one place without copy-and-paste duplication?"}, {"date": "9 Jul 2010", "title": "Assistant Web Developer/Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Binghamton University (Binghamton, NY) in Aug 2008", "Interview Descriptions": "Just asled about the basic questions regarding html, css, php etc,", "Interview Questions": "N/A"}]]