[[{"date": "22 Mar 2023", "title": "Student - Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Technische Universität Dresden", "Interview Descriptions": "They sent me a related paper 2 weeks before the interview. I was required to summarize the idea of the paper and present it by slides. Then they asked me to talk about my project which is related to the position.", "Interview Questions": "What is the main idea about the proposed method in the provided paper?"}, {"date": "5 Feb 2022", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Technische Universität Dresden", "Interview Descriptions": "There will be two rounds of interview, online and in person. For the in person interview be ready to show your technical skills. Make sure you have a presentation prepared of past work experience.", "Interview Questions": "How would you approach the project?"}, {"date": "3 Sept 2021", "title": "Werkstudent Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Technische Universität Dresden", "Interview Descriptions": "it was good, easy and more personal and educational details and work details and extracurricular activitues  it also includes has it has had all about the hobies and best performances till date so far and all good things.", "Interview Questions": "wie gut bist du in diesem stelle?"}, {"date": "23 Nov 2021", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Technische Universität Dresden in Aug 2021", "Interview Descriptions": "Sehr entspanntes Gespräch mit Lehrstuhlleitung über Interessen, den bisherigen Studienverlauf, vorherige Arbeitgeber und Erfahrung auf dem Fachgebiet. Zudem wurden die Projekte und der Lehrstuhl an sich vorgesetllt. Danach wurden Verfügbarkeiten geklärt.", "Interview Questions": "Können Sie sich bitte vorstellen?\r\nHaben Sie bisher Erfahrung auf diesem Fachgebiet? \r\n"}, {"date": "24 Apr 2022", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Technische Universität Dresden (Dresden) in Nov 2019", "Interview Descriptions": "It was very smooth and fast. The guys were already there before the interview time. The interview was basically about the qualification and experience.  They did not ask over board questions", "Interview Questions": "Introduce yourself and how you fit into the project"}, {"date": "14 Oct 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Technische Universität Dresden", "Interview Descriptions": "Meeting with the Professor to get a general idea of what projects the chair is working on, next I had an interview with some group leaders, discussing which topics would be suitable before figuring out the funding. Overall very straight forward interviews.", "Interview Questions": "What fields do you have experience in? "}, {"date": "23 Jun 2019", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Technische Universität Dresden (Dresden) in Apr 2019", "Interview Descriptions": "Wer sich auf Standard-Fragen mit Standard-Antworten vorbereitet ist hier gut bedient. Alles in allem sehr gute Atmosphäre. Nette, kompetente, sehr zuvorkommende und äußerst witzige Professoren, Mitarbeiter und Team. Das Gesamtpaket hat gestimmt.", "Interview Questions": "Standard-Fragen"}, {"date": "24 Mar 2020", "title": "WHK Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Technische Universität Dresden (Dresden) in Apr 2017", "Interview Descriptions": "A sImple discussion with two professors.  I mailed one of professor for an advertised job in his group but he told me that I am not fit for this position and offered an interview for the other position.  After agreeing on that they called me face to face meeting.", "Interview Questions": "It was more like a meeting.  In starting both the professor gave their intro. and asked me to explain my previous work experience. Then they described to me what are the job task and my supervisor etc."}, {"date": "15 Jun 2019", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Technische Universität Dresden (Dresden) in Feb 2016", "Interview Descriptions": "Lockere Interviewatmosphäre, kurzer Abriss über Lebenslauf und bisherige Erfahrungen. Mir gegenüber saßen die 4 Doktoranden, die mich später auch betreuen würden. Insgesamt war das Gespräch fair. Fangfragen wurde im Interview nicht gestellt. Wichtig ist seine Motivation für die Stelle genau auszuarbeiten.", "Interview Questions": "Erfahrungen\r\nMotivation\r\nNoten\r\nFachfragen"}, {"date": "26 Mar 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Technische Universität Dresden (Dresden) in Oct 2015", "Interview Descriptions": "Das Gespräch war auf einer sehr menschlichen Ebene und es gab sogar schon thematische Einführungen. Alles in allem ein sehr angenehmes Klima. Leider wurde nicht erwähnt, dass die Verträge immer nur begrenzt sind und es auch sein kann, dass man privat selber eine Zeit ohne Geld überbrücken muss.", "Interview Questions": "Für welches Thema interessieren Sie sich besonders?"}], [{"date": "30 Jun 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Technische Universität Dresden (Leipzig) in Sept 2014", "Interview Descriptions": "The professor invited me to this group. Everything was fine. I was invited for accommodation, lunch and dinner, and gave a talk about my masters research. However, the professor made some empty promises during the interview which were not kept after I got the job.", "Interview Questions": "Scientific background"}, {"date": "17 Oct 2017", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Technische Universität Dresden in May 2013", "Interview Descriptions": "Lockere Atmosphäre, knappe Fragen zum bisherigen Werdegang und der geplanten wissenschaftlichen Ausrichtung. Alles in allem sehr fair und prägnant, ohne Fangfragen. Beginn mit knapper Beschreibung der eigenen Stärken und Schwächen.  Einstellungsgespräch kam auf Empfehlung zu Stande und war dementsprechend einfach.", "Interview Questions": "Welche Motivation haben Sie als wissenschaftlicher Mitarbeiter zu arbeiten?"}, {"date": "19 Jan 2013", "title": "Doktorand Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Technische Universität Dresden (Dresden) in Mar 2012", "Interview Descriptions": "Die Aufnahme in die DIGS-BB ist wettbewerbsorientiert und wird ausschließlich in einem zentralen Auswahlverfahren durchgeführt, das zusammen mit der International Max Planck Research School for Cell, Developmental and Systems Biology (IMPRS-CellDevoSys) organisiert wird. Bitte beachten Sie, dass nur Bewerbungen über das Online-Bewerbungssystem innerhalb der veröffentlichten Fristen angenommen werden können. Verspätete oder unvollständige Bewerbungen werden nicht angenommen. Die Teilnahme an der Interview-Woche in Dresden ist unumgänglich, um für die Aufnahme in die DIGS-BB in Betracht zu kommen.\n\nZeitrahmen\n\n        Frühjahrsauswahlrunde\n        Herbstauswahlrunde          \nBewerbungszeitraum:\n        September bis Januar\n        März bis Juni\nBewerbungsfrist:     \n        Januar         Juni/Juli\nAuswahlwoche:\n        März         September\n\nAlle innerhalb des Bewerbungszeitraums vor der veröffentlichten Frist eingegangenen Bewerbungen werden einen mehrstufigen Beurteilungsprozess durchlaufen.\n\nBeurteilung der Bewerbungen\n\nDie Erstevaluation berücksichtigt das nationale Bildungssystem der Bewerber und wird von internen Experten für das jeweilige Bildungssystem durchgeführt. Bewerbungen von Kandidaten, die die Anforderungen der DIGS-BB erfüllen, werden zur weiteren Beurteilung durch Lehrende empfohlen, welche gemeinsam eine Auswahl der Kandidaten erstellen, die zur Interview-Woche nach Dresden eingeladen werden sollen. Die Einladungen werden ungefähr sechs Wochen im Voraus versendet.\n\nDie Interview-Woche in Dresden\n\nWährend der Interview-Woche absolviert jeder Kandidat mehrere Interviews mit Lehrenden, um die Forschungserfahrung und -interessen zu diskutieren. Die Interviews mit den Gruppenleitern enden mit einer ersten Beurteilung der Kandidaten. Für alle Bewerber folgt ein abschließendes Interview mit einem Auswahlkomitee, das aus mehreren Angehörigen des Lehrkörpers besteht. Unter Berücksichtigung der Beurteilung der Lehrenden, die die Interviews durchgeführt haben, evaluiert das Auswahlkomitee die Gesamtqualifikation des Kandidaten und empfiehlt dem Dekan, wer in das Programm aufgenommen werden soll.\n\nAufnahmeangebote\n\nAufnahmeangebote in die DIGS-BB erfolgen am Ende der Auswahlwoche. Die Aufnahme wird vom Dekan auf Empfehlung des Auswahlkomitees gewährt. Die Angebote beinhalten im Allgemeinen die Zugehörigkeit zu einem spezifischen Doktorandenprogramm und einer Forschungsgruppe. Die einzelnen Beginntermine werden mit dem Hauptbetreuer vereinbart. Für die Frühjahrsauswahlrunde ist das späteste Beginndatum der 1. Oktober des Aufnahmejahres. Für die Herbstauswahlrunde ist das späteste Beginndatum der 1. Februar des auf das Aufnahmejahr folgenden Jahres.", "Interview Questions": "Spezielle wissenschaftliche Fragen"}]]