[[{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Global Health Corps Fellow", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jan 2017", "job_title": "Fellow in Lusaka, Lusaka", "duration": "N/A", "pros": "Networking. Training Institute is really nice, but a let down if your host org is lacking.", "cons": "1. They prioritize appeasing their NGO network and the in-country partnerships over the support and safety of their fellows. Will send you to a newly recruited organization without even telling them. Will side with that organization and not support you their talent. (It can work out if the organization is well-funded and has had several rounds of fellows previously. But definitely not the norm for fellows.)\r\n2. Dont believe the GHC family hype. They will stand by idly if your organization mistreats you. If the org failed to arrange housing dont expect GHC to find something for you. Nope you'll be backpacking to work for months literally. They say they provide furnished housing, dont be surprised if you spend your stipend on furniture (fridge, stove, etc) They oust people for little to no reason. Was told I would be living alone, (the sole reason I left my former full-time position) but was placed in a house with a racist roommate. When I complained I was put on 90 probation. i begged for help and was told I was wasting GHC resources. Dont bet your last on this or you could wind up back home unexpectedly (without any warning) and jobless. Or worse missing like Stukey. Google GHC and stukey to learn about that debacle. They only responded after Zambian media got involved. \r\n3. For them to tout professional development as they do, do not expect it to be guaranteed for everyone (only a privileged few). If thats what you're looking for ask the in-country org if they offer it. If not, dont go because GHC will do nothing for you. My org basically used us for free grunt work. We werent allowed in trainings, conferences, or barely on work trips. Even though we both carried multiple masters degrees they called us Data Entry volunteers. When we complained GHC shushed us. My org later cooked up some untrue story completely unrelated to their immense satisfaction with my work quality (likely because i did the work of 4 senior staff members). Nobody informed me there was an issue, but a tribunal was held and it was decided I should go (even though my probationary period expired, no one ever even contacted my direct supervisor). The timing of everything was perfectly contrived. What about that helped me develop professionally? Nothing\r\n\r\nThe recruitment is directed towards entry to mid career professionals but they dont respect them as such in Africa. If you are such and are used to being viewed as a colleague go with GHFP-II. Its more official and supportive for adults accustomed to earning and performing."}], []]