[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Strong work-life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2021", "job_title": "Monitoring Officer in Jakarta", "duration": "N/A", "pros": "- good management, work-life balance, and understanding of local dynamics", "cons": "- field office and HQ somewhat disconnected at times"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "SFCG Indonesia: A home that supports my personal development", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2019", "job_title": "Communications Coordinator in Jakarta", "duration": "N/A", "pros": "1. My colleagues are the most supportive and positive minded people I've ever met. No toxic ambitious competition. Haha. Everyone knows what they're good at and keen to share their knowledge to others.\n2. The programs and projects here promote and protect human rights and peaceful conflict resolution\n3.  Considerate HR team and upper management. Some flexibility in working hour and phase when you're facing your personal demon. You're allowed  to work remotely/ from home or come late to the office as long as you get your work done.\n4. The country director is very knowledgeable in peacebuilding and conflict resolution. He's open minded, friendly, and a good mentor.\n5. The management will find a way to support your personal development if there's an opportunity like training or workshop you can join, whether it's a financial one or simply a permission to do it.", "cons": "- Conventional financial system. You still have to submit many paperwork in this digital/ blockchain era. \n- Time difference with  HQ makes you have to do meeting calls at night"}]]