[[{"date": "22 Nov 2022", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Queens University of Charlotte", "Interview Descriptions": "The interview process was well organized, everyone I met was friendly, it was a well-structured process with time for breaks. The information I received ahead of time was helpful and clear. No surprises.", "Interview Questions": "experience with being a librarian"}, {"date": "15 Jan 2021", "title": "Marketing Communication Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queens University of Charlotte", "Interview Descriptions": "30 minute phone interview asking very specific questions about the job’s requirements and how I fit them. The interviewers were very kind and encouraging. I heard back a week later.", "Interview Questions": "Do you have any experience with social media planning?"}, {"date": "9 Mar 2020", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queens University of Charlotte (Charlotte, NC) in Feb 2020", "Interview Descriptions": "The interview was pretty standard. It was a full day interview and required meeting with VP's, deans, faculty, staff, and students. Everyone was very accommodating and made sure I was comfortable and acclimated with the campus offerings and environment.", "Interview Questions": "How would you encourage continued learning here at Queens?"}, {"date": "28 Dec 2020", "title": "Website Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Queens University of Charlotte in Nov 2019", "Interview Descriptions": "Phone screener, followed by in person interview session with several members of the team and the person above the hiring manager. This was a multi-hour interview with back-to-back-to-back sessions with 2-3 people each.", "Interview Questions": "Why are you interested in working in higher education?"}, {"date": "24 Feb 2020", "title": "Financial Aid Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queens University of Charlotte in Jan 2019", "Interview Descriptions": "The interview was a panel interview  with three other people from financial aid and it took about 30 minutes. Each person took turn and asking  questions. The interview was relaxed and an nice flow to it.", "Interview Questions": "Tell me about a time you had to have a difficult conversation with a student"}, {"date": "25 Jun 2017", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queens University of Charlotte (Charlotte, NC) in Mar 2017", "Interview Descriptions": "I was contacted via email for a telephone interview not long after submitting my application. The interview was scheduled with the Registrar.  I received the scheduled call late and the proposed 30 minute interview lasted about 15 minutes. The questions seemed to be rushed. I am confident in my performance but felt that a candidate had already been chosen.", "Interview Questions": "Why do you want to work in the Registrar's Office?"}, {"date": "13 Feb 2018", "title": "Counseling Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Queens University of Charlotte (New York, NY) in Mar 2017", "Interview Descriptions": "Applying for the position was easy but needed to follow up in order to ensure materials were received. Interviewed about two weeks after submitting materials. Interview was the same compared to other interviews I had for similar roles.", "Interview Questions": "What can you contribute to our department that other candidates can’t?"}, {"date": "11 Jan 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queens University of Charlotte", "Interview Descriptions": "The interview process was fairly standard. First, I had a phone interview. After that, I met with the department supervisor and then I met with the rest of the team. It did they take them about a week to follow up after the second interview. The waiting was difficult, but the interview process was manageable.", "Interview Questions": "Talk about a time when you had to manage conflict with a colleague."}, {"date": "16 Dec 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Queens University of Charlotte (Charlotte, NC) in Dec 2015", "Interview Descriptions": "Phone interview, less than 30mins. Was invited to a local Starbucks to meet with 2 employees. They approved of me, and had me come on-campus for a 3rd interview with 3 additional members of the team. After that, I received a text message offer from my direct supervisor. She said that HR has a slow process and wanted to let me know ahead of the paperwork arriving.", "Interview Questions": "Why are you leaving your current position? \r\nName a time you faced adversity. \r\nWhat is your greatest strength? weakness? \r\nHow do you handle stress?"}, {"date": "22 Jul 2015", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Queens University of Charlotte (Charlotte, NC) in May 2015", "Interview Descriptions": "From an internal standpoint, postings can be posted for up tow two months before a search committee or department begin to sift through materials. Do not get discouraged. It's not a bad thing to contact them and inquire about the status of the search. After a phone interview, on-campus interviews are a dull-day affair: one-on-one with supervisor, dean, group interviews, and follow up with questions and a tour of campus.", "Interview Questions": "What would the first 90 days of being in this role look like for you?"}], [{"date": "29 Jan 2015", "title": "Student Life Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Queens University of Charlotte", "Interview Descriptions": "I applied online, had a phone interview, then was brought on campus. This took about a month. I met a lot of people when I came on campus, but I am not sure I received genuine/accurate answers to my questions about the position and what it's like to work at Queens.", "Interview Questions": "N/A"}]]