[[{"date": "19 Apr 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "It was pretty short and informal. We met first over zoom then I planned an in person interview. I have a presentation to the lab about my previous research projects, then met with reach lab member (PI too) one-in-one", "Interview Questions": "Tell me about your past research - hypothesis, outcomes, next steps."}, {"date": "17 Feb 2023", "title": "IT Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "Your application will quickly get a response. There is the initial phone screening and then afterwards a live-interview will be scheduled. There are only a few rounds to go through and a decision will be made in a week or two.", "Interview Questions": "What draws you to work for higher education?"}, {"date": "30 Jan 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "Overall, it was a pleasant experience and the folks working there all seemed to like each other. I would recommend working there to anyone that is considering an offer from them", "Interview Questions": "Why do you want to come here ?"}, {"date": "19 Mar 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University in Jan 2023", "Interview Descriptions": "It was a 30-minute video interview. They asked me to briefly introduce my research, and then they ask questions (and if I have any). It was a fast one and most of the time I was speaking. Better to be prepared for the questions.", "Interview Questions": "Why did I apply to tufts? Who are my potential collaborators? What is my research plan to start right now, and what is my next step in 5 years? What are the courses I plan to teach?"}, {"date": "3 Nov 2022", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Tufts University", "Interview Descriptions": "They ghosted me after a 3 hour in person interview which I took time off my work and drove all the way there. I had to reach out to them and they sent me an automatic rejection email. The interview felt like an  interrogation and extremely rude when I asked questions. They kept digging at me. I’m happy they didn’t want me because I wouldn’t want to work with people like that. They asked questioned out of left field.", "Interview Questions": "Tell us about yourself. Tell us why you want to work here"}, {"date": "27 Oct 2022", "title": "Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tufts University in Oct 2022", "Interview Descriptions": "Very professional and equity focused. Highly transparent and thoughtful. Committee provided ample options for candidates to select an interview time that worked well with their schedules. Highly organized interview format and questions were not typical/boilerplate. They got at the heart of the purpose of the position.", "Interview Questions": "Provided one week prior to the interview. Equity protocol."}, {"date": "23 Sept 2022", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "There was a phone screen from an HR recruiter. After the phone screen I was interviewed three different times. One time was with the team I would be working with. ", "Interview Questions": "What graduate program would you choose if you had to go back to school?"}, {"date": "23 May 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "I applied for the job. A couple weeks later, I received an email, and scheduled an interview over the phone. It was a short interview with slots of 15-30 minutes", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "30 Apr 2022", "title": "Content Creator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University", "Interview Descriptions": "The interview process was smooth, personable, and thoughtful. They were really easy to communicate with when it came to scheduling and responding quickly. The entire interview process from start to finish took about one month.  Everyone I talked to came prepared with questions and were extremely personable.", "Interview Questions": "What would your boss say is your greatest weakness?\r\n\r\nWhy did you apply to this job? \r\n\r\nWhat kind of stories do you enjoy writing about?\r\n\r\nWhat news outlets do you like receiving your information from? "}, {"date": "28 Apr 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "very clear and organized interview process. met with team for presentation as well as 1:1's.  Interview questions were appropriate and challenging. virtual interview which was very convenient for me, i appreciated that option.", "Interview Questions": "why are you interested in tufts?"}], [{"date": "8 Nov 2022", "title": "Administrative Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University (Boston, MA) in Apr 2022", "Interview Descriptions": "It took about a month after I applied to the job to get a response. Has 3 interviews with senior leadership. Then got an offer and accepted. Started a week later.", "Interview Questions": "Why about this position did you like?"}, {"date": "3 May 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tufts University in Mar 2022", "Interview Descriptions": "The interview process began with one 45-minute interview with the hiring manager about one week following my application. The second interview was a group interview with 3 members of the team, and the third interview was another 3 members of the team. These rounds went quickly, but I waited over a month for their decision. Luckily, I had other pending offers and a counteroffer from my current institution. Overall, the process was okay, but there were a couple of questions asked that left a poor impression on me.", "Interview Questions": "Tell me about yourself. Why Tufts? Why now? Tell me about your leadership style. "}, {"date": "1 Feb 2022", "title": "Researcher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "Quick East & Proficient. Asked a total of 6 questions and they were easy. The employee was nice and friendly as well. Employer was efficiently aiding and knew how to be engaged", "Interview Questions": "What superpower you want and why"}, {"date": "11 Nov 2021", "title": "Residential Life Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Tufts University", "Interview Descriptions": "This is one of the longest interviews with some of the meanest people in the world. They act high & mighty, and then offer small apartments + ridiculously low pay given it's tufts. almost as if they want you to work for the reputation. reputation doesn't pay the bills. everyone in the interview process is rude, and makes you feel like it would be a terrible place to work.", "Interview Questions": "so many i cant even remember"}, {"date": "11 Jan 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Tufts University (Boston, MA) in Oct 2021", "Interview Descriptions": "A very friendly and casual conversation with the interviewer and talked about past research experiences and areas of interest. Took an aptitude test afterward and was offered the position after a few days. Not much prior preparation is required but an opportunity for the interviewer to get to know you.", "Interview Questions": "How would I benefit from the research program"}, {"date": "25 Sept 2021", "title": "COMP SCI TA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "It was fun, not very hard, super cool, had a lot of fun, met some great people, they didn't ask me any questions, and I feel like I deserved better but hey that is just my view of it.", "Interview Questions": "How are you today at this how"}, {"date": "13 Nov 2021", "title": "Staff Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tufts University in Sept 2021", "Interview Descriptions": "Solid zoom and phone interviews. Follow up was severely lacking. Kept being told another week and they would decide if I had secured position. In the meantime I sent emails about various things like questions I had and they were never responded to. After nearly three weeks of no updates I was sent an email denying my employment and received no responses to any of my emails or telephone messages.", "Interview Questions": "Describe a situation where you overcame a problem or difficult project and what that was like -"}, {"date": "26 Jan 2023", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tufts University in Sept 2021", "Interview Descriptions": "A few interviews and a test. The people were generally nice, but then I did not find out the salary (way too low for Boston area) until the end of the process.", "Interview Questions": "Why do you want to work in this subject area?"}, {"date": "27 Aug 2022", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Tufts University (Medford, MA) in Sept 2021", "Interview Descriptions": "Excessively protracted, non-transparent, complete lack of communication even after clearing the first 3-4 interview phases. Large gaps of silence and lack of follow-up made it difficult to gage next steps, if at all. Had to follow up after every step of the  interview process to clarify status. Every communication was followed by excessively long wait periods even after ‘finalist’ round.", "Interview Questions": "Standard interview questions, panel-style round robin."}, {"date": "30 Aug 2021", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tufts University (Boston, MA) in Aug 2021", "Interview Descriptions": "interview was very fast and they moved quickly which is surprising for higher ed. Everyone was thorough and welcoming during the interview.  They asked great questions and were really informative about the department and culture", "Interview Questions": "'whats your elevator pitch and why should we hire you' "}], [{"date": "8 Nov 2021", "title": "Accommodation Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University in Jul 2021", "Interview Descriptions": "30 minute Zoom interview. It was professional and the staff was very personable and kind. I have experienced lots of similar interviews, and this one felt the most comfortable and professional.", "Interview Questions": "Why are you interested in this position?"}, {"date": "8 Sept 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University (Somerville, MA) in Jun 2021", "Interview Descriptions": "HR initially reached out to me by email to set up a zoom interview with three people.  I was invited for a second interview. I was given a list of tasks to complete before the second interview. The tasks were administrative and graphic art ( create a flyer).", "Interview Questions": "How does any of your past roles relate to the job description?"}, {"date": "17 Jun 2021", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tufts University in Jun 2021", "Interview Descriptions": "It was over zoom, the head of the lab was on vacation, so I interviewed with a postdoc and the person I will be replacing. It was pretty short, but I had fun and they were super nice.", "Interview Questions": "Q: where do you see yourself in the future?"}, {"date": "26 May 2021", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "The interviewer made me comfortable. He took time to introduce his work and why it will be a good reason to join his lab. The interviewer went on to ask my about my work and research experience.", "Interview Questions": "Tell me about your research experience"}, {"date": "10 May 2021", "title": "Data Processor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "The wave crashed and hit the sandcastle head-on. The sandcastle began to melt under the waves force and as the wave receded, half the sandcastle was gone. The next wave hit, not quite as strong, but still managed to cover the remains of the sandcastle and take more of it away. The third wave, a big one, crashed over the sandcastle completely covering and engulfing it. When it receded, there was no trace the sandcastle ever existed and hours of hard work disappeared forever.", "Interview Questions": "Do you like animals? Do you want to succeed?"}, {"date": "9 May 2021", "title": "Early Careers Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "30 minute interview with only the hiring manager, no other interviews. They asked an estimated10 questions, mostly regarding previous experiences, as well as asking you how you would respond in specific case studies.", "Interview Questions": "Describe your experiences listed in your resume"}, {"date": "29 Oct 2021", "title": "Administration Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University in May 2021", "Interview Descriptions": "Zoom interview after a week of applying and then an in-person 2-3 hour interview with a panel. It felt more like an interrogation than an interview, not very welcoming and stand-offish, barely asked any questions that were asked for me to prepare to respond to. They also pay pretty low salaries compared to other schools. I recommend taking time to closely analyze the interviewers and you will be able to tell what type of working environment it is, this one felt toxic. They ended up GHOSTING me but I ended up with a better offer a few months later at another university with better benefits, salary, and a great positive work environment that really care about their employees.", "Interview Questions": "Tell us about your experiences and why you want to work here"}, {"date": "6 Apr 2021", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "Submit an online application and sign up for an online zoom interview (during the COVID time). During the interview, one RA and one officer from ORLL will interview you, and ask basic questions like why are you interested in this position, what makes you the best fit. The challenging part is that they give you a scenario that you need to decide what to do if you were a RA.", "Interview Questions": "What character do you think it's the best fit for an RA"}, {"date": "3 Apr 2021", "title": "Academic Subject Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Tufts University", "Interview Descriptions": "In person interview, where you teach a lesson. Very straightforward and supportive. They sit down with you ask ask you to go over your subject area in some detail. You interview with 2 current tutors.", "Interview Questions": "Explain a topic in your subject area as a mini lesson"}, {"date": "1 Apr 2021", "title": "Assistant Coach- Athletics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "Interviewer called my current employer after the interview without my consent despite the fact I had listed 3 other references. He then ghosted me end ignored my follow up emails.", "Interview Questions": "How would you describe yourself as a leader?"}], [{"date": "30 Apr 2021", "title": "Capital Projects Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University in Apr 2021", "Interview Descriptions": "The interview process was formal and to the point. The interviewers were detailed/clear in describing the role and future projects. Their questions closely aligned with the job post qualifications, so there weren't any surprise questions.", "Interview Questions": "What about Tufts has drawn you to apply? "}, {"date": "22 Feb 2021", "title": "PhD Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Tufts University", "Interview Descriptions": "Got invitation one week ago. Had a 30 mins online interview via zoom with one professor from ECE department. The meeting is great and the questions are very regular. I got an unofficial offer on spot.", "Interview Questions": "Introduce yourself.\r\nIntroduce your previous research works."}, {"date": "26 Oct 2021", "title": "Associate Portfolio Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tufts University (Boston, MA) in Feb 2021", "Interview Descriptions": "Super laid back. Was initially contacted directly by the department manager and had an interview before HR was brought into the loop. One of my better on boarding experiences.\r\n\r\nMultiple interviews over zoom, each with at least 2 people and then phone interviews with hiring manager to follow up on each and check it. Very thorough.", "Interview Questions": "Describe your ideal work environment? What motivates you? What are specific things you are looking for in your next job?"}, {"date": "30 Oct 2020", "title": "MakerSpace Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "No Interview. I simply emailed the manager of the new makerspace before it opens, and then I got back from him that I can start working. There's no absolute requirements, although experiences with rapid prototyping is prefered", "Interview Questions": "What are your previous experiences in using a 3d printer?"}, {"date": "4 Sept 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "Applied online through a portal. Fill out which course you prefer to TA for. The form also asks you to fill out your availability and grade for the class.  I would recommend speaking with current TA that you are interested in the role.", "Interview Questions": "What previous teaching experience do you have?"}, {"date": "6 Feb 2022", "title": "Department Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Tufts University (Medford, MA) in Mar 2020", "Interview Descriptions": "Underwent a phone interview with HR, then a Zoom interview with department representatives. It was a pleasant and straightforward experience. Questions were the type of thing you would expect, Got a chance to ask questions about what the position would be like, department culture, etc.", "Interview Questions": "I was asked about organizational skills, experience with budgeting and how I would work with student employees."}, {"date": "14 Apr 2021", "title": "Marketing Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University in Mar 2020", "Interview Descriptions": "It went well. Fairly brief, with standard interview questions pertaining to my experience, goals, and interest in the school. I had a pleasant experience with each of the interviewers. They were respectful of my time and were very communicative (via email) throughout the entire interviewing process, which spanned two months total.", "Interview Questions": "Describe your interest in working at Tufts University? "}, {"date": "15 Oct 2019", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University", "Interview Descriptions": "One brief in-person interview and two telephone interviews. It really just seemed like they wanted to get to know me a little better, I did not feel tested or quizzed at all.", "Interview Questions": "A lot of questions about previous experience and the reason for wanting to go into research. "}, {"date": "26 Jul 2021", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University in Oct 2019", "Interview Descriptions": "Swift, thorough and professional but not intimidating. Began with inquiries about myself followed by a segment in which I could also inquire about the position, department and current faculty. There was a phone session with HR, a video conference with the department administrators and then a follow up with HR to negotiate pay/benefits. Very well organized.", "Interview Questions": "How might you handle conflict in the workplace? "}, {"date": "23 Jul 2019", "title": "Staff Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University (Medford, MA) in May 2019", "Interview Descriptions": "About a month after applying, I received an email from the administrative coordinator of the department to schedule a phone screening. During the phone screening, details regarding the position were discussed and I was asked 5 questions regarding my qualifications.  A week later I was scheduled for an in-person  interview with 3 people from the department, which lasted about 45 minutes. That same week HR reached out through email for 3 references, background check, and scheduled a phone conversation.", "Interview Questions": "How would you prioritize situations confronted at the same time? (interviewer gave list of encounters that could happen on the job)"}], [{"date": "4 Apr 2019", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "I went in for an interview in the office.  They asked about my commitments outside of the Admissions Office, which roles I hoped to hold as an Intern.  There was just the one interview process.", "Interview Questions": "What positions of leadership do you hold on campus?"}, {"date": "21 Mar 2019", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tufts University (Boston, MA) in Mar 2019", "Interview Descriptions": "Applied online through HR but having a personal connection helped get an interview. Interview process was simple and quick, received an answer the same day. Met with PI of the lab first and then each of the members of the lab.", "Interview Questions": "What's your research experience like?"}, {"date": "4 Feb 2019", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Tufts University (Medford, MA)", "Interview Descriptions": "Phone screening with HR. Basic computer test in HR building (no more than 30 mins). In person interview with HR (no more than 30 mins). In person interview with Managers (30 mins to an hour depending on the conversation). Offer --> Negotiate. Background check.", "Interview Questions": "How do you prioritize things?"}, {"date": "11 Feb 2022", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Tufts University in Feb 2019", "Interview Descriptions": "I initially cold-emailed biology professors to suggest a meeting, was ignored by many but got replies from some. I then went to the PI's office in the lab and talked with them there for a brief informal interview.", "Interview Questions": "Overview of my previous lab experience and skills,  reasoning for my interest in the given lab, and specific projects/papers I care about from the lab"}, {"date": "6 Jan 2019", "title": "Senior Technical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "It was rather long, a little bit over a month. The questions were pretty good, I don't remember them at all but I know they were challenging. I was interviewed by two groups of two managers in the department.", "Interview Questions": "How are you doing?"}, {"date": "6 Nov 2018", "title": "Time Management and Study Strategies Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "Very smooth process, the interview was thorough and the interviewee was extremely polite and helpful through the interview. A very positive experience overall, and I love working here now. I would recommend working for this center as a student definitely.", "Interview Questions": "What are your strengths?"}, {"date": "24 May 2022", "title": "Director of Administration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tufts University (Boston, MA) in Oct 2018", "Interview Descriptions": "The first round of interviews included not only my potential manager, but also those person who I would be managing. My second interview was just with my potential manager. It was a great experience, and definitely weighed in my decision to take the position when it was offered.", "Interview Questions": "How familiar are you with Drug Development? \r\n "}, {"date": "6 Aug 2019", "title": "Multimedia Production Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Tufts University in Jul 2018", "Interview Descriptions": "30-minute phone call with the supervisor to walk through my resume, a handful of behavioral questions, and what I hope to gain from the internship. Nothing rigorous or stressful. Nothing too interrogative, just a friendly chat with the supervisor to ensure I was competent enough to do the job and easy enough to work with.", "Interview Questions": "Do you have any experience using video editing software?"}, {"date": "5 Jun 2018", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Tufts University", "Interview Descriptions": "Email application, phone call. skype and onsite interview with the presentation, gave a talk, routine questions after the presentation, conversation with everyone in the lab, lunch with members, lab visit,", "Interview Questions": "gave a talk, routine questions after the speech, interview with everyone in the lab, specific to the presentation"}, {"date": "14 Dec 2020", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University (Boston, MA) in Jun 2018", "Interview Descriptions": "Basic application to start. If you pass the screen, you get a basic phone interview that questions you about your major, personality, and why this will be a good fit for you. If you pass this interview, there will be a in person interview that asks basically the same things as the phone interview but will ask some more technical questions regarding whether or not you can do something.", "Interview Questions": "What are your opinions on working on a small team?"}], [{"date": "8 Jun 2018", "title": "Student Success Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tufts University (Boston, MA) in May 2018", "Interview Descriptions": "I had a phone interview with an on campus visit one week after. The phone interview consisted of 7 people on the other line. The on campus interview had 4 different stages of interviews and a lunch with current students.", "Interview Questions": "How does your privilege influence your work?"}, {"date": "23 Sept 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Tufts University (Boston, MA) in Apr 2018", "Interview Descriptions": "The process was pretty smooth and straightforward. The position is ideal for someone who is interested in learning and explaining different economic concepts to students. A good background in economics is helpful.", "Interview Questions": "How do you explain difficult economic questions?"}, {"date": "6 Feb 2018", "title": "Role In TTS Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Tufts University (Medford, MA)", "Interview Descriptions": "This was, hands-down, the most disorganized interview process I can remember being part of.  The schedule for my interview visit changed at least three times, which was problematic as I was employed at the time.  This did not inspire confidence, but I was interested in the job, so I stuck with it.   I was told very different things about the interview schedule and process from the HR rep compared to the employees on the hiring committee, which again did not inspire confidence.  But overall, the first interview went fine, and we quickly scheduled a time for the next round a couple of weeks later.  After 5 pm on the evening before my second round interview I received a voice message from HR that my interview *for the following morning* would need to be 2 hours longer than previously planned, and that if all went well, a third round interview would likely follow in several weeks' time.  Very little explanation and certainly no apologies were offered as part of this message.  I withdrew my candidacy that night.   \r\nI'm now happily employed at a company that values the time of its employees, and treats job-seekers with respect.   This experience has left me with a less than favorable impression of Tufts.", "Interview Questions": "N/A"}, {"date": "31 May 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Tufts University (Medford, MA) in Jan 2018", "Interview Descriptions": "it is based on the ph.d. application. Most likely, you get either TA or RA position. For TA positions, there is always need. They expect a good background in programming for sure.", "Interview Questions": "Do you have an experience being as a TA?"}, {"date": "6 Dec 2017", "title": "Senior Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tufts University", "Interview Descriptions": "Applied online, heard back fairly quickly with a phone interview. Had an on on site where I met with my immediate supervisor, briefly interacted with the rest of the lab, mostly just wanted to make sure I knew how to do what I had claimed on resume/phone and was a good fit for the lab culture", "Interview Questions": "Asked to elaborate on my skills,"}, {"date": "9 Oct 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "I found out through a friend, and then applied online through their portal. It went okay, but I didn't end up getting a job. I would apply again though because I think it's a cool school", "Interview Questions": "What's one time you overcame adversity?"}, {"date": "15 Jun 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tufts University (Medford, MA) in Oct 2017", "Interview Descriptions": "Pretty Straight Forward interview process, met with a few members on the team.  including director and senior director. Seemed very nice and friendly, went in for one whole day of interviews.", "Interview Questions": "How would you improve this role"}, {"date": "18 Oct 2017", "title": "Office of Advancement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tufts University (Boston, MA) in Aug 2017", "Interview Descriptions": "One interview with my direct boss, past experience questions, goals for school, and strategies. We did an office tour, met a few people, and then had a one on one for 20 minutes before other candidates had to be interviewed.", "Interview Questions": "What is a time that you led a team? How would you change messaging?"}, {"date": "6 Jul 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University (Medford, MA)", "Interview Descriptions": "Lots of people, round table questioning. Seemed disorganized and messy. Some inappropriate questions asked, regarding disabilities. People seemed confused about who was talking when. The room we met in had broken equipment, which I found odd.", "Interview Questions": "Why do you want this job?"}, {"date": "6 Jul 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Tufts University", "Interview Descriptions": "I just sent an email along with my resume and waited for the feedback. Talked to a bunch of people and got the job. they asked for my interests and the why questions, also about the time commitment and expectations. i think it depends on the timing, especially when they need undergrad ra for help. there are always ongoing projects and they need students working for them. largely it depends on how many undergrads they need at the time. if you are a decent undergrad studying cs and they need assistance the time you apply, it's not hard to get in the lab. the people are really nice and easy going and the projects are interesting. i'd highly recommend it if you want to get a phd. if you want to enter the industry instead, it's still not a bad experience.", "Interview Questions": "they asked for my interests and the why questions, also about the time commitment and expectations. "}], [{"date": "9 Nov 2018", "title": "Senior Technical Training Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Tufts University (Medford, MA) in Jul 2017", "Interview Descriptions": "Exhaustive. 2 days, 4 hours each. Large room. Behaviorial interviews where people not related to your job tried to figure out who you were...without smiling. Very smug. There was also a full-on presentation with addendees to see how you perform with a classroom with varying questions and abilities. I came prepared with my own material, equipment and script.", "Interview Questions": "How would you react to professors who think they know everything but don't and need help with technology"}, {"date": "21 May 2018", "title": "Senior Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Tufts University (Medford, MA) in Jul 2017", "Interview Descriptions": "I applied online and heard back a few days after for an interview. The interview lasted 30 minutes at most and it mostly just tests your ability to be a decent human being. The job focuses on more on customer service than technology", "Interview Questions": "Give an example of when you had a rude or angry customer"}, {"date": "29 Apr 2017", "title": "Staff Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tufts University (Boston, MA)", "Interview Descriptions": "Human Resources emailed first to plan a phone screening. They scheduled it quickly and called on time. The phone screening lasted about 20 minutes. They didn't ask too much just a couple of questions about my background that's relevant for the job. They sent the answers on to the department that needed the Staff Assistant.", "Interview Questions": "Why do you want to work part time?"}, {"date": "10 Apr 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "Phone interview - initial interview process with the Director of the program. More interviews are expected to follow in person at campus with the director and other staff. Interview was average, about 30 minutes and expectations were that they would be hiring in the next few weeks.", "Interview Questions": "Tell me about your history and how you came to your current position?"}, {"date": "6 Mar 2017", "title": "Circulation Desk Student Assistant, Tisch Library Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Tufts University", "Interview Descriptions": "Very easy interview, basically the supervisor was just making sure I seemed at least moderately competent, knew what the job entailed, and had the availability each week to commit to working there. Makes sense since there is high turnover among student workers at the library and few responsibilities required of them.", "Interview Questions": "Do you have any previous customer service experience or experience working in a library (it's okay if you don't though, just wondering)?"}, {"date": "3 Dec 2019", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Tufts University (Medford, MA) in Mar 2017", "Interview Descriptions": "Standard interview.  Job talk, vision, teaching, research, student engagement, etc etc.  Overall it was a standard academic interview.  Fun stuff too - got to meet lots of faculty and students and had meals etc.", "Interview Questions": "What do you enjoy most about teaching?"}, {"date": "10 Aug 2018", "title": "Research Scholar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Tufts University (Medford, MA) in Dec 2016", "Interview Descriptions": "It was very simple. The only concern of the professor was not to spend money. Thats it. After he was sure that he wont pay for my research, then he directly hired me. Lets say free member for his group.", "Interview Questions": "How will support your salary "}, {"date": "30 Aug 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tufts University (New York, NY)", "Interview Descriptions": "Most of the initial contact was made through HR.  I met once with an HR business partner then with the hiring manager.  Both were very cordial, warm and friendly.", "Interview Questions": "My experience in the particular area of higher ed financial analytics was the main topic of conversation.  Some detailed processes were discussed."}, {"date": "20 Aug 2016", "title": "Research Technician I Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Tufts University", "Interview Descriptions": "Easy interview. Met with the entire lab and discussed what would be expected of me, what research I've done, what their lab is all about, where I see myself in the future, etc.", "Interview Questions": "Where do you see yourself in the near future and the distant future?"}, {"date": "1 Jul 2016", "title": "Office Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University (Boston, MA) in Jun 2016", "Interview Descriptions": "I spoke with the hiring manager who was very friendly. I also met with the director of the position I was applying for. Both were very friendly. They asked me all normal questions I would expect for the position.", "Interview Questions": "A big question I got was where I saw myself in a year, 2 years, 5 years?"}], [{"date": "19 Feb 2020", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Tufts University (Boston, MA) in May 2016", "Interview Descriptions": "1. Email for a job offer\r\n2. Schedule a meeting\r\n3. Personal meeting with the advisor\r\n4. Submit relative documents\r\n5. The final meeting in Boston\r\n6. Persona chat with an adviser\r\n7. Have lunch\r\n8. All done", "Interview Questions": "Are you affordable for living cost in Boston "}, {"date": "28 Aug 2019", "title": "Copy Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Tufts University (Boston, MA) in Apr 2016", "Interview Descriptions": "five senior marketing executives in a conference room asking me questions about my background, not only in marketing and advertising, but in life. What did I do for hobbies, where have I travelled, where did I go to school, where did I grow up, why I thought I was qualified for this specific job.", "Interview Questions": "What is your greatest strength?"}, {"date": "9 Feb 2016", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tufts University (Boston, MA)", "Interview Descriptions": "Sit in front of a panel of current researchers on the project consisting of potential superiors, colleagues, and subordinates. Each has a list of questions and they take turns asking. \r\nIf that goes well there is a one on one interview with the PI.", "Interview Questions": "Q: Describe your background.\r\nQ: How would you handle workplace disagreements?\r\nQ: How do you handle multiple competing deadlines?\r\nQ: How do you manage deadline stress?\r\nQ: Tell us about an experience were you needed to organize a project."}, {"date": "7 Mar 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University (Boston, MA) in Jan 2016", "Interview Descriptions": "The interviewer was friendly and didn't ask any unsuspecting questions. It took about a week for her to get back with me after the initial phone interview. I am still waiting for a final decision.", "Interview Questions": "What are your long term goal?\r\nWhat was attracted you to this position?"}, {"date": "25 Jul 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University (Boston, MA) in Nov 2015", "Interview Descriptions": "I submited my application via email. As I had the skills which the employer was looking for, I was interviewed over Skype.  After successful interview, I was hired right away.", "Interview Questions": "Things which I am expert on."}, {"date": "4 Oct 2017", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Tufts University (Medford, MA) in Nov 2015", "Interview Descriptions": "The interview process was quite relaxed and involved a discussion of required skills for the position. We discussed data analysis skills, the process of obtaining informed consent, and reports to be created.", "Interview Questions": "Do you have familiarity with statistical computing softwares?"}, {"date": "20 Oct 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University (Medford, MA) in Sept 2015", "Interview Descriptions": "HR called to schedule an interview soon after I applied online. 1 hour interview with HR went fine, no questions you wouldn't expect. Interview with hiring manager same day went ok, but chemistry wasn't perfect and when I asked what they liked about their job they said the benefits. Everyone I interacted with was nice though.", "Interview Questions": "Tell me about yourself and why you want this job specifically?"}, {"date": "21 Jun 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Tufts University (Medford, MA) in May 2015", "Interview Descriptions": "Learned about the job through internal listserve, submitted resume and a coverletter. About a week later, I had one interview with the program manager. They took a while to get back to me, then conducted a reference check with two people", "Interview Questions": "Experience with stakeholder management"}, {"date": "13 Apr 2015", "title": "Public Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "Wonderful- friendly team, easy to schedule. I would absolutely recommend this internship to any Tufts students looking to stay on campus over the summer or for part time work during the year. It's a great first internship for students and helped me to realize my interest in communications/PR. Everyone in the office is incredibly friendly, and also understands that you're a student and schoolwork comes first.", "Interview Questions": "How would you handle a difficult PR situation for the school - what if you were the first person to hear breaking news?"}, {"date": "16 May 2016", "title": "Client Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tufts University (Worcester, MA) in Apr 2015", "Interview Descriptions": "I initially had an in-person interview on campus. I first met with the Human Resources department for a computer test and a few questions by the Hiring Manager. Then, I had a meeting with the two supervisors at the time. I spent about twenty to thirty minutes with each supervisor. They asked me a few questions and then showed me the computer program the hospital uses. The interview overall was good, I left feeling as though I knew exactly what the position would entail. It was about two hours long. I did not meet with any client services managers. I would have liked to, so I would have expectations of how the entire client service team was run and what was expected of me from a managerial perspective.", "Interview Questions": "What made you want to apply for a position and work at Tufts University?"}], [{"date": "14 Mar 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Tufts University (Medford, MA) in Jan 2015", "Interview Descriptions": "Very laid back interview with three senior customer service representatives. Got asked basic interview questions, as well as some questions relevant to the position (\"if a client does x or y, how would you proceed?\").", "Interview Questions": "If a client asks you a question you don't have the answer to, or brings you a problem that you are not sure about, how would you proceed?"}, {"date": "5 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Tufts University (Medford, MA) in Dec 2014", "Interview Descriptions": "It was fast and easy, mostly because all the RAs that work here are tufts students so the interview was low pressure. They invite you into the lab and ask you a few questions about research interests, data managing experiences, statistical program familiarity, etc.", "Interview Questions": "a few questions about research interests, data managing experiences, statistical program familiarity, etc"}, {"date": "24 Sept 2014", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tufts University", "Interview Descriptions": "I've had two different positions within this company and each time there was a long lag time between submitting my resume and being contacted for an interview; but once I was interviewed the offers were swift.  I was interviewed by someone from human resources and then the primary investigator.  The person from human resources was great and the interview process went smoothly.", "Interview Questions": "There were no difficult or unexpected interview questions."}, {"date": "15 Nov 2014", "title": "Senior Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tufts University in Aug 2014", "Interview Descriptions": "I applied through their website. Received a phone call about a week later and completed an in-person interview with human resources and with the two principal investigators of the study. I received a call  a few hours after I left with an offer. I decided not to take the job because of the money they were offering. Overall very positive experience, great questions, very prepared.", "Interview Questions": "They presented me with all the challenges they were having on their research study and asked me how I would solve them."}, {"date": "5 Jan 2016", "title": "Security Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Tufts University (Medford, MA) in Aug 2014", "Interview Descriptions": "A lady who was the head administrative assistant interviewed me and just asked me questions like if I had any administrative experience and she was very nice but no longer works there. She was, however, extremely disorganized and didn't get back to me about the job until I asked her a couple times about it. Other applicants who weren't as persistent didn't even hear back about whether or not they were hired.", "Interview Questions": "Do you have any administrative experience and what are your hours like?"}, {"date": "25 Sept 2016", "title": "Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Tufts University (Medford, MA) in May 2014", "Interview Descriptions": "Chris is a great guy, really chill. Interview process is laid back, seems like if you're a good student and are passionate about tech he will hire you. To get the interview I literally just emailed him, he's a pretty busy guy, but he will make time to talk to you and get you going on the project he wants done.", "Interview Questions": "My background in regards to programming, whether I thought the job he was proposing was interesting and whether I liked to play frisbee."}, {"date": "30 Apr 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Tufts University", "Interview Descriptions": "People were very nice, no difficult/unexpected questions", "Interview Questions": "N/A"}, {"date": "15 Mar 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Tufts University (Medford, MA) in Apr 2014", "Interview Descriptions": "The occupational therapy graduate department sent out an email and you were able to submit your top 3 choices in classes   you wanted to be a graduate teaching assistant for the following year. There was no actual interview process since the department is quite small and staff and professors know how the students performed in the courses.", "Interview Questions": "Why do you want to be a graduate teaching assistant?"}, {"date": "24 Feb 2014", "title": "Staff Psychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University", "Interview Descriptions": "Very thorough and detailed interview process with multiple staff and upper management. Required to demonstrate broad-based knowledge of psychology, standards of treatment, and issues related to higher education and college life.", "Interview Questions": "Clinical: dealing with an emergent situation that is clinically ambiguous regarding student risk."}, {"date": "18 Feb 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "Apply PhD program, and is offered TA", "Interview Questions": "N/A"}], [{"date": "4 Feb 2014", "title": "Project Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tufts University", "Interview Descriptions": "I submitted a resume online and 2 weeks later had an in-person 30 minute interview. This interview was with one of the supervisors to which the position reported. Interview was as expected, lots of questions about how my past work experience matched the job description. I was given plenty of time to ask questions as well. From there HR asked for my references within 24 hours and I met with an HR rep to do paperwork. They do confirm your educational record and request transcripts. I had a verbal offer about 1 week after the initial interview.", "Interview Questions": "All were about past work experiences and my background, nothing tricky. There were a few \"tell me about a time when..\""}, {"date": "21 Jan 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "Meet with professor in person, and discuss some fundamentals.", "Interview Questions": "N/A"}, {"date": "12 Sept 2014", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tufts University (Medford, MA) in Jan 2014", "Interview Descriptions": "Very fast interview process, interviewed by phone and then shortly thereafter asked for a in-person interview. Nice office, sort of friendly staff, neutral interviewers. Did not really describe job tasks, just asked me questions. Said they would get back to me either way-- never did. Will not be applying to this particular office of Tufts again. Thought the office was very monotone, which concerned me. Nice campus, close to Davis Sq. and cultural activities. Nice area.", "Interview Questions": "Name your strengths and weaknesses"}, {"date": "30 Dec 2013", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tufts University", "Interview Descriptions": "Application through the job opportunities website at Tufts. Interview seemed a little rushed, like interviewer was less prepared than I was. Communication of the details of the interview was not great so I ended up having an interview with the lab director right after my interview with HR. I would recommend asking who you will be speaking with. Only one day of interviews was required and they called me the following Friday offering the job. They told me I only had 1 day to decide whether I wanted the job or not, and being a recent college grad I accepted even though I had other interviews lined up. I suggest you ask about a timeline for potential hires in case something like this happens and you are unsure whether you want to take the job.", "Interview Questions": "All very typical, but probably the most difficult: What do you have to offer that no one other candidate can offer? "}, {"date": "29 Sept 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "There was almost no interview.  They are very open to enthusiastic students.  They did great work all summer and have a very fun and open work environment. Interns also have 10% time on friday afternoons.", "Interview Questions": "N/A"}, {"date": "20 Apr 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Tufts University (Boston, MA) in Sept 2013", "Interview Descriptions": "After placing a phone call inquiring if they knew when they would be contacting candidates, it was a very smooth and speedy process. They did a good job of having me meet several members of the team.", "Interview Questions": "What are you strengths/weaknesses?"}, {"date": "21 Aug 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tufts University (Boston, MA) in May 2013", "Interview Descriptions": "In person interview. Started with Fit question then into technical expertise. Then spoke with each lab member to go over the current projects. Finished off with a lab tour and asked if I had any clarifying questions.", "Interview Questions": "What lab techniques have you performed?"}, {"date": "18 Mar 2013", "title": "Standard Interview Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Tufts University", "Interview Descriptions": "very bright and involved students", "Interview Questions": "lots of teaching that goes unappreciated, no actual mentoring and tenure support "}, {"date": "8 Jan 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Tufts University (Boston, MA) in Mar 2013", "Interview Descriptions": "HR Team Interviewers were super prepared. The department I interviewed with was more casual but smart and asked great questions.  During the months of this process, I met with my peers, my project team, my boss and one level above that.", "Interview Questions": "Basics of why was I leaving, but then asked specific questions about managing service levels with VIPs.  It was great to know how important this would be."}, {"date": "4 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Tufts University (Boston, MA) in Oct 2012", "Interview Descriptions": "Very smoothly, contact my by email days before and dail in my number for about half an hour for interview. In the end of interview, promised the offer and will send out the official one the coming monday", "Interview Questions": "What tech. did you use before"}], [{"date": "4 Nov 2012", "title": "Senior Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tufts University (Boston, MA) in Sept 2012", "Interview Descriptions": "I found the people to be incredibly friendly and helpful. A guy from HR contacted me to schedule an interview, and made me feel really relaxed and comfortable (I'm usually much more nervous). I thought the interview with the PI also went well, he was really approachable and you could tell he cared about his research.", "Interview Questions": "The PI asked me what I could bring to the table beyond my laboratory experience, which I hadn't given much thought to beforehand. "}, {"date": "17 Sept 2015", "title": "Practice Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tufts University (Boston, MA) in Aug 2011", "Interview Descriptions": "Easy, I met with the hiring manager and she asked a few questions, then hired me. I worked internally and was promoted to this position, so I already knew the hiring manager and a little bit about what I'd be doing. I also had 1 year dental school experience so I knew terminology and the staff/faculty/students.", "Interview Questions": "Asked if I was ready to put my hard hat on"}, {"date": "15 Dec 2011", "title": "DENTISTRY Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tufts University (Boston, MA) in Jul 2011", "Interview Descriptions": "we had to interview different professors from the department, each of them specialized in even: research, clinical training or education. On top of it,", "Interview Questions": "what is your weakest point"}, {"date": "19 Jul 2010", "title": "Adjunct Faculty (Instructor) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Tufts University (Medford, MA) in Jun 2010", "Interview Descriptions": "Department chair contacted me by email and invited me to visit the department. I spend several hours getting a tour of the facilities and meeting with several faculty members in a small group setting. We discussed a provisional syllabus I had brought and I asked questions about the student body and department instructional priorities.", "Interview Questions": "What material will your course emphasize?"}, {"date": "10 Jan 2012", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Tufts University (Boston, MA) in Feb 2010", "Interview Descriptions": "I applied through the website, requiring an essay and three reference letters, transcripts, and a fee.  I was called after two months, and they screen approximately 20 applicants for 5 positions in the program.  Interviewed with three professors, and a group interview.", "Interview Questions": "n/a "}, {"date": "11 Jul 2010", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Tufts University (Medford, MA) in Feb 2010", "Interview Descriptions": "Spoke with 2 professors about my educational and research background and their research.", "Interview Questions": "Detailed knowledge the department's rather than just the professor's work."}, {"date": "2 Sept 2011", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tufts University (Medford, MA) in Jan 2010", "Interview Descriptions": "They were very nice, understanding and helpful", "Interview Questions": "What is your experience with teaching and programming in C++?"}, {"date": "14 Dec 2012", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Tufts University (Boston, MA) in May 2009", "Interview Descriptions": "I e-mailed the lab PI requesting to know if he has an opening for a postdoc in his lab and he would consider me for the position.  I included my CV and the latest published paper.  I got a positive response the following day.  A date was agreed upon for a in person interview.  I traveled to Boston (plane ticket and hotel paid for by the lab) and had an interview with the PI and all members of his lab. I also presented my PhD thesis work in an hour long talk to the lab.  Everybody was frank with their answers regarding what they liked an disliked about Boston, Tufts and the PI.", "Interview Questions": "I wasn't expecting to be asked about my research experience prior to my graduate school years"}, {"date": "2 May 2013", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Tufts University (Medford, MA) in Jan 2009", "Interview Descriptions": "Online, can take up to six months for an interview", "Interview Questions": "What do you like least of all duties"}, {"date": "9 Jul 2012", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Tufts University (Boston, MA) in May 2008", "Interview Descriptions": "Very rigorous; I met with HR and three potential supervisors.", "Interview Questions": "Describe a time you had an issue with a coworker and how you resolved it"}]]