[[{"date": "19 Mar 2023", "title": "ES Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Healthlink", "Interview Descriptions": "The interview was easy. Met with the clinical director(at that time) who went over the requirements and the expectations for the role. Explained the salary as it's an hourly position.", "Interview Questions": "What do you like about your current position?"}, {"date": "29 Jan 2023", "title": "Crisis Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Healthlink", "Interview Descriptions": "Via zoom. Very casual. The program director was very nice and was very good at communicating what she needed out of the worker. This is a great position for new bachelor level social workers interested in the mental health field.", "Interview Questions": "Work Experience How are you in a crisis"}, {"date": "19 Oct 2022", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Healthlink", "Interview Descriptions": "It was clear the company was disorganized. They lost my paperwork and I needed to redo it more than once. When I arrived at the schedule time for my first interview. It seemed like nobody knew I was coming and had to wait for the interview. I later got a call to schedule a second interview with the program director.", "Interview Questions": "What is a challenge you have faced at a past job and how did you handle it?"}, {"date": "28 Aug 2020", "title": "Insurance Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Community Healthlink (Worcester, MA) in Apr 2020", "Interview Descriptions": "Had several phone calls I thought were productive, and references were asked for.  Then I heard nothing for at least a month.  Then they called back and said a VP will be contacting me shortly.  That was in May.  Completely unprofessional.", "Interview Questions": "I dont recall"}, {"date": "25 Dec 2019", "title": "In Home Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Healthlink (Leominster, MA)", "Interview Descriptions": "Human Resources called to schedule an interview.  Then I was able to meet with the supervisor.  The process was easy and appreciated that.  I found human resources to be very helpful and nice.", "Interview Questions": "The questions centered around my experience with children and families.  "}, {"date": "18 Jul 2018", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Community Healthlink (Worcester, MA)", "Interview Descriptions": "Got a phone call, interviewed over the phone, came in for an in-person interview, got a form notarized from my bank for a DCF check, sent them my car insurance proof and a picture of my inspection sticker, had to send proof that my vaccines were up to date and had to get a TB test, they looked up my driving record and my record with DCF and the standard background check, had another brief interview, was hired, waited for my letter to come in, went to orientation about a week later for 2 days then started the job. the whole process from application to my first day of work was 2.5 months. very long and very thorough.", "Interview Questions": "Have you ever worked with people who have co-occuring disorders?"}, {"date": "22 Aug 2017", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Community Healthlink (Worcester, MA) in Jul 2017", "Interview Descriptions": "Internal, swift connection after receipt of resume.  Initial interview, time was given to really listen, and consider.  Second interview call back much shorter,  blatantly questioning my qualifications.  Rude.  Different individuals in interview.", "Interview Questions": "What is your experience with this population?"}, {"date": "30 Dec 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Community Healthlink (Worcester, MA) in Mar 2015", "Interview Descriptions": "Once you fill out the application online be prepared to wait a few weeks to hear back. Some people have said they heard right away , then you have to go through a telephone interview. after wards a formal interview is set up .I met with the department supervisor and the Operations director. This was actually a second interview,as I had interviewed for a different floor a month previously.", "Interview Questions": "What qualities do you have that will be beneficial to assist our clients?"}, {"date": "12 Feb 2015", "title": "Relief Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Healthlink (Worcester, MA)", "Interview Descriptions": "After applying online, I was contacted by the supervisor for a basic phone interview.  The in-person interview was scheduled within a week of initial phone call.  I met with two supervisors.  The interview itself was very casual and educational. The questions were pretty basic, not a lengthy interview.  Overall the interview was very informative, and the supervisors displayed positivity and passion.", "Interview Questions": "Interview questions included past experience, quality traits, and knowledge of basic skills required for the position."}, {"date": "1 Aug 2016", "title": "Director of Adult Outpatient Services - Worcester Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Healthlink (Worcester, MA) in May 2013", "Interview Descriptions": "Met with the Vice President of the Outpatient Services for the agency and one other employee. Met with staff from HR and reviewed the benefits of the position. Had to correct some information from my online application. Was given a tour of some of the department and was given information about the many other departments and program at Community Healthlink.", "Interview Questions": "Why I was interested in working with adults with major mental illnesses?"}]]