[[{"date": "17 May 2023", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Good. Very attentive and was polite. I was comfortable and at ease. Just research the company before going to your interview or know the job description very well. Also go early and find the place.", "Interview Questions": "Why this job and experience you have prior"}, {"date": "10 Nov 2022", "title": "Technical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Phone interview with HR, followed by an in person interview with the PI. Follow up email after to update me on the process. Was very smooth and clear. I did accept the offer.", "Interview Questions": "What was a mistake that I made and what did I learn from it?"}, {"date": "1 Sept 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Long and exhausting as an introverted person.  But it was better than some other grad school interviews. University of Rochester med center gave more breaks through out the course of the interview weekend.", "Interview Questions": "Tell me about your research"}, {"date": "31 Jan 2022", "title": "Lab Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Took too long of a time to hear anything back from interviewer or HR. No updates on anything or even if you are being considered. Interview itself was fairly easy.", "Interview Questions": "Why are you interested in that position "}, {"date": "14 Jul 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "30min remote online interview.  basic questions regarding cv and past research experience, and talk about details on technique terms. People here are very nice. In all, it's a n outstanding place to work.", "Interview Questions": "tell us about your past research."}, {"date": "9 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Mostly asked to describe myself and everything about my background and how it would help me to be a successful nurse there. This was as a new grad, for the critical care residency program on the medical track.", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "4 Jun 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "The interview process was quite smooth.  It includes the following steps: application screening, round 1 interview, and round 2 interview. Everyone I spoke to was very friendly and outspoken along the process.", "Interview Questions": "Why do you want to join us?"}, {"date": "11 May 2021", "title": "Imaging Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Interview with questions and meet department staff while getting a tour of the work area. Also learned the shift hours and what's expected for the shift. All questions get answered and put at ease", "Interview Questions": "Why do you think you're perfect for this position?"}, {"date": "18 Mar 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center (New York, NY) in Feb 2021", "Interview Descriptions": "I met with the person who would be my supervisor along with two other people from the group. The overall process was them asking me how I would solve different technical problems, my experiences with different programming languages, and how familiar I was with different file formats.\nThen I had two other interviews with other people asking more questions about my experience\n It has been over a month since the interview and they still have not made a decision on whether or not to hire me(I have been following up through several weeks but I did not receive any response)\nsuch a negative experience", "Interview Questions": "1.work culture\n\n2. salary requirements\n\n3.Health care experience"}, {"date": "9 Jan 2021", "title": "Interface Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Consisted of an interview with the team director . \r\nMostly a discussion about qualifications initially. Programming experience and concepts . \r\nFollowed up with a team interview with the existing team fielding any questions they had", "Interview Questions": "How would you plan to thwart DB injection in code "}], [{"date": "4 Mar 2021", "title": "Ambulatory Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center (Rochester, NY) in Nov 2020", "Interview Descriptions": "Phone screen, and then in person interview and shadowing of the role and team (this was in November 2020). The in person interview was 20 minutes and the shadow was ~2.5 hrs long.", "Interview Questions": "What would you do if a doctor yelled at you?"}, {"date": "29 Oct 2020", "title": "Cardiologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "The staff was very friendly and very open. Met with several doctors who explained program and pros and cons. It seemed like a place on the rise. It has everything one would want.", "Interview Questions": "Please describe a difficult experience you had in residency "}, {"date": "6 May 2021", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center (Rochester, NY) in Mar 2020", "Interview Descriptions": "The interview process was very professional. but also relaxed. First, the job was explained to me in further detail. Then we discussed my resume and other research experiences I have had. The interviewer had clearly only glanced over my resume. The interview lasted an hour.", "Interview Questions": "Future career goals?  Where do I see myself in 5 years or 10 years? "}, {"date": "23 Jan 2021", "title": "Postdoc Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Rochester Medical Center (Rochester, NY) in Feb 2020", "Interview Descriptions": "I talked to the PI over the phone first and then I was invited for an onsite interview. I talked to the PI, 3 collaborators who work with the PI and all the members from the lab.", "Interview Questions": "Why did you choose our group?"}, {"date": "27 Oct 2021", "title": "Doctor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center in Jan 2020", "Interview Descriptions": "very smooth and enjoyable as it went really well and  great. Was flexible and relatable more every other ones in the past.Was flexible and relatable more every other ones in the past.", "Interview Questions": "Tell me about yourself and life"}, {"date": "10 Sept 2019", "title": "Laboratory Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Aug 2019", "Interview Descriptions": "Very in-depth tour of the lab that was very helpful and informative. However, actual interview questions were very short and no notes were taken.  I felt like a few questions were asked that were surface level and didn't need more than a sentence or two to answer, and then I was hurried out the door.", "Interview Questions": "What is the most important thing to remember when operating a centrifuge? "}, {"date": "15 Aug 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester Medical Center in May 2019", "Interview Descriptions": "I followed the researchers to their office. They described the position, asked if I had any questions and then asked me questions based on my resume. They told me they had more hiring to do but would let me know in a month.", "Interview Questions": "This position requires a 2 year time commitment, can you do that?"}, {"date": "19 Jan 2019", "title": "Junior Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY)", "Interview Descriptions": "Straight forward. Started with a phone interview that looked mainly at how you processed information and the steps you would take in various situations. Second interview was in person and was similar in that it looked at how you think about various issues however it was a bit more technical than the phone screening.", "Interview Questions": "How do you handle a situation with an anger customer with a computer issue?"}, {"date": "8 Jan 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Rochester Medical Center (Rochester, NY)", "Interview Descriptions": "The school paid for hotel, flights, and transportation. Interviewed with 5 faculty of my choice. The interviews themselves felt fairly informal were mostly spent discussing previous research experience and any questions I had about the program or specific faculty's research. Was escorted by current graduate students and given a tour of Rochester, including a housing tour. Went to dinner with just the students one night and a faculty/student dinner the next.", "Interview Questions": "Is there anything that is not on your resume that you would like us to know?"}, {"date": "16 Mar 2019", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester Medical Center (Rochester, NY) in Jan 2019", "Interview Descriptions": "It was a very quick process, I completed a phone screen and one in person interview with a group of individuals on the team. They were understanding of my background and asked good questions relating to the position.", "Interview Questions": "Give me a scenario in how you had two different managers and how you approached the situation?"}], [{"date": "30 Nov 2021", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester Medical Center in Oct 2018", "Interview Descriptions": "I had an in person interview, the waited 4 weeks to hear if I got the job. I ended up playing a little phone tag with the hiring manager but in the end i got the job.", "Interview Questions": "Tell me one of your strengths "}, {"date": "20 Sept 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Sept 2018", "Interview Descriptions": "I had found the job on monster and applied I was called by a recruiter the next day for a phone interview with the recruiter in HR, applied online through their website,then Interviewed with nurse manager and did a shadow(about 30 minutes).", "Interview Questions": "Discribe a time when you had to work together as a team and succeeded? "}, {"date": "27 Nov 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "The interview process was light and positive. It included a phone interview then an in person interview with a call back. It was also a panel/group interview for the second round. Asked to describe myself, why I would be a good fit, etc.", "Interview Questions": "Describe a time when you had a conflict with a coworker"}, {"date": "9 Oct 2017", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Rochester Medical Center (Rochester, NY) in Sept 2017", "Interview Descriptions": "I met with the person who would be my supervisor along with two other people from the group.  The overall process was them asking me how I would solve different technical problems, my experiences with different programming languages, and how familiar I was with different file formats.\r\n\r\nIn typical University of Rochester fashion, it took months from application to getting an interview.  It has been several more months since the interview and they still have not made a decision on whether or not to hire me.  \r\n\r\nIf this is any indication of how long anything takes to get done at U of R I will probably decline the position if offered.", "Interview Questions": "How would you replace all occurrences of a string in a large text document?"}, {"date": "16 Apr 2017", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY)", "Interview Descriptions": "I applied online in January and got a reply to schedule an interview the next day for the following week.  Second interview was after 2 weeks. I was supprised to get to the final level because I had applied to four department with the same tittle and never gead anything back.", "Interview Questions": "What is a vlookup?"}, {"date": "28 Apr 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center (Rochester, NY) in Apr 2017", "Interview Descriptions": "Great interview. Both interal and external applicants have the opportunity to shadow in their area of interest. This typically lasts four hours. This employer offers great benefits. Opportunities for growth and education are unparalled. Nurse manager very approachable and involved in unit daily activities.", "Interview Questions": "Describe one situation where you were able to turn a bad event into a good outcome"}, {"date": "27 Feb 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Feb 2017", "Interview Descriptions": "I applied online and was emailed about a first round video interview. After the first round I had a final round video interview with the head PI. The first round included three individuals interviewing me. The final was a 1 on 1.", "Interview Questions": "Tell us about your experience working in groups."}, {"date": "28 Jan 2017", "title": "IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Rochester Medical Center (Rochester, NY)", "Interview Descriptions": "Pretty simple had a one-on-one interview first gave the sort of elevator speech then I was able to get a more formal interview the following day. we emailed back and forth and I applied for the position from their website and we discussed my hourly wage and start time and time things of that nature", "Interview Questions": "If you had to describe and IP address to your grandmother how would you do that?"}, {"date": "1 Aug 2016", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "I was sent away for being four minutes late. The hiring manager could not even get up out of her chair to tell me she couldn't see me. She yelled from inside her office that I was late so she is no longer available. Four minutes! Mind you, I was in the main lobby waiting to ask for directions to this woman's office because you are forced to navigate the building on your own. She wouldn't even give me the time to explain or option to reschedule. I have never been treated so poorly by an interviewer/potential employer. I have turned down several interviews at URMC because this ridiculously rude individual has made such a terrible impression on me.", "Interview Questions": "There were no questions asked."}, {"date": "14 Jun 2016", "title": "Manager, Administrative Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Rochester Medical Center (Rochester, NY) in Jun 2016", "Interview Descriptions": "Good interview although the hiring administrator only spent about 15 minutes with me and was running late.  Then two other staff were brought in.  Seemed to be hurried and then due to the administrator running late, the next meeting participants were knocking on the conference room door.  I guess that I may have been too relaxed as they did not offer me the position.", "Interview Questions": "What behavior to find it most difficult to manage?"}], [{"date": "29 Jul 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center (Rochester, NY) in Jun 2016", "Interview Descriptions": "The company brings you in to a panel of the pharmacy technician supervisors and they go over your experience. Then they take you on a tour of the pharmacy to show you what you would be learning within the pharmacy to gauge your response on if you are overwhelmed.", "Interview Questions": "Why would you like to work for the University of Rochester?"}, {"date": "20 Jan 2017", "title": "IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Rochester Medical Center (Rochester, NY) in May 2016", "Interview Descriptions": "The process was really straight forward and comfortable. The Medical Center was open a new center and had an opening for a IT Technician. This was an opportunity to have someone pioneer the position roles and tasks. They appreciated my flexibility and skill sets.", "Interview Questions": "What is your experience with Story Line?"}, {"date": "27 May 2015", "title": "X-Ray Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "The interview is an opportunity to demonstrate to an employer why you are the best fit for the\r\nposition. Essentially, it is your marketing pitch. It is important to use this opportunity to stress\r\nhow you will contribute to the company while highlighting your skills and accomplishments. The\r\nemployer also uses interviews to get a sense of your personality and how you will fit in the\r\nworkplace. However, the interview is also your opportunity to evaluate the company, the people\r\nyou would be working for and with, and get a sense of whether or not you are interested and\r\ncomfortable with the job expectations. Make sure that you take advantage of the opportunity\r\nto learn more about the position", "Interview Questions": "Tell me about a time you had difficulty working with a co-worker?"}, {"date": "24 Dec 2017", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester Medical Center (Rochester, NY) in Feb 2015", "Interview Descriptions": "Questions were straightforward, honest interview process. Asked me questions both individually and with a panel. Gave me tour of facility. Met some other therapists and doctors. Whole process was very easy.", "Interview Questions": "Goals to become further certified (OCS, SCS). Background before hiring. School experiences. Ability to work weekends. Overall philosophy on treatment methods. Ability to work on other projects besides physical therapy. How I worked within a team, how I worked with doctors. "}, {"date": "21 Oct 2015", "title": "Health Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center (Rochester, NY) in Feb 2015", "Interview Descriptions": "The interview was stiff and I felt unwelcomed to ask questions about the position. I prefer to understand a position from a wide lens and when I asked questions to understand the interviewer was noticeably annoyed and appeared offended.", "Interview Questions": "Can you tell me of a time you dealt with a difficult issue in the work place?"}, {"date": "26 Aug 2018", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Rochester Medical Center (Rochester, NY) in Dec 2014", "Interview Descriptions": "Interview was over the phone only, no in person interview. It took approximately 1 hour on the phone with a bunch of questions. The entire team was in a room giving questions on SQL coding and personal questions to get to know me better.", "Interview Questions": "Describe a time where you had a problem at a past job and how you overcame that problem?"}, {"date": "3 Aug 2017", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Rochester Medical Center (Rochester, NY) in Dec 2014", "Interview Descriptions": "Interviewed with two people and had a phone screening. It was pretty quick. I met with the hiring manager first and also with a Director that I would be working very closely with. The process took about a month in total.", "Interview Questions": "What prior experience can be related to the position"}, {"date": "21 Oct 2015", "title": "Analyst/Programmer Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Oct 2014", "Interview Descriptions": "1) E-mail was sent regarding job application. Asked to come in for interview within 1 week from e-mail.\r\n2) During interview process, met with group of people the trainee will be working: 2 lead HIM (Health Information Management Department ) Data Integrity Analysts with Data Integrity Director as the main manager giving the interview. \r\n3) HRMS displays different information under Careers tab for analyst/programmer trainee position than is presented for the actual position since HR has a generic position summary for it. This might to be the case for all jobs within the University of Rochester.\r\n4) Director of department gives you an overview of the position and what it entails. Then proceeds to ask the applicant about their resume or more so \"Tell me about your work experiences\".", "Interview Questions": "What are your strengths and weakness working in a group setting?\r\nHow easily do you adapt to changing environments and settings?\r\nHow you  go about producing accurate results?"}, {"date": "11 May 2016", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center (Rochester, NY) in Oct 2014", "Interview Descriptions": "First you have to fill out application online. Then you have to interview with a nurse recruiter. Then finally with a nurse manager to the unit they need to assign you.", "Interview Questions": "why do you work in nursing?"}, {"date": "23 Sept 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "The process was an easy one. I  did not have an interview per say. The then nurse manager was already monitoring me as a student on the unit during my clinical rotation. A few days before the end of my rotation she approached me and offered me the position which I accepted.", "Interview Questions": "The job offering was mostly based on my clinical  performance as a student on the unit during an emergency situation. No definite interview questions were asked."}], [{"date": "7 Jul 2014", "title": "Mid Level Provider Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Initial contact with recruiter, 1st interview with department Provider, 2nd interview with Chair, takes a couple weeks to 1.5 months to get final offer depending on department and number of interviews yet to be done", "Interview Questions": "I don't recall a terribly difficult or unexpected question.  I don't mind interviews, they're not anxiety provoking for me. "}, {"date": "5 Jun 2014", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Recruiter was positive, detailed, asked smart questions. Subsequent managers in the interview process were less attentive, cut meetings short or started late. Managers kept changing job requirements without communicating them to candidates, and I had to pry these out of the recruiter. The net result was a feeling of evasion that suggests they  re-wrote the job description to favor younger candidates. Ageism is hard to hide.", "Interview Questions": "No brain teasers, no complicated scenarios. Interviewers couldn't stay on schedule, so they were abbreviating their list of questions."}, {"date": "3 Oct 2016", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Jun 2014", "Interview Descriptions": "Asked situational questions. Asked why looking for another job. What experiences I have. Where you see yourself in a certain number of years. I met with two senior coordinators at the same time after communicating through email to set the interview up.", "Interview Questions": "How would you handle or prioritize helping your PI vs helping a subject."}, {"date": "16 May 2014", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Applications submitted online and responded to by either the hospital or a doctor's office that is part of the hospital's Primary Care network. Interview generally conducted by the Office Manager. Occasionally, two interviews are requested, one by the hospital and one by the office manager of the specific primary care office. Usually, the doctors themselves will want to speak to any candidate, as well.", "Interview Questions": "Describe a conflict you had with a previous coworker or manager, how you responded and how/if the conflict was resolved. "}, {"date": "7 May 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Based on prior school experience, visit different people you're interested in -- if they like you they recommend you. Questions are based on what you know and what they do; generally speaking, it wasn't difficult.", "Interview Questions": "N/A"}, {"date": "5 May 2014", "title": "Information Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "Apply online via HRMS Job Opportunities Website. Afterwards you will be contacted via email or phone for an in- person interview. Once that is completed, you maybe have 1-2 more in- person interviews with other higher ranking officials within the department. If you make it through those steps, you will be offered a position by HR.", "Interview Questions": "Explain an experience where you had a challenge(s) and how you overcame it? \r\nWhat is your greatest weakness and how will this position aid in your ability to improve on this weakness. "}, {"date": "7 Feb 2016", "title": "Med Tech Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Rochester Medical Center in Mar 2014", "Interview Descriptions": "i have met with several leaders ,and section heads,  I toured lab and  facility and got an overview of job functions tests and work load  discussed hours shifts and salary", "Interview Questions": "where i wanted to be in the future"}, {"date": "17 Apr 2017", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Aug 2013", "Interview Descriptions": "I met the supply chain manager by the elevators and we talked about my experience and then I changed into scrubs in order to take a tour. I was shown around the OR and spent the day with them meeting the OR staff and other future peer employees go to tour the OA seeing all of the services. the whole experience was a good interview even if I did not get the job", "Interview Questions": "N/A"}, {"date": "5 Jun 2015", "title": "Document Control Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at University of Rochester Medical Center (Westlake Village, Los Angeles, CA) in Jun 2013", "Interview Descriptions": "Phone Interview, standard interview questions and really appreciated that I was an undergraduate studying the life sciences; skills that were desired included using Microsoft Word and being able to type at proficient speeds; additionally being able to organize a multitude of documents and create a system for documents as the organizational system was going from paper to digitial", "Interview Questions": "How would you deal with multiple tasks given to you at a time?"}, {"date": "11 Mar 2016", "title": "Office Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Rochester Medical Center (Rochester, NY) in May 2013", "Interview Descriptions": "The interview is pretty much straight forward.  You meet with the person who put up the job position.  She would tell you the break down of the job.  Then ask you a couple of follow up questions.  Are you good under pressure?  What is your schedule (if you are a student) like?  Then you will shadow the past worker to see if the amount of work is doable.  Once you've had bout an hour of shadowing, you will come back to the office and the interviewer will ask you questions. Be sure to ask questions when on the hour shadow time because the person who you are shadowing will deliberate on how you did, and whether you asked questions for clarification or not.", "Interview Questions": "Do you think you will be able to manage multiple things at once?"}], [{"date": "23 Jan 2013", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Rochester Medical Center", "Interview Descriptions": "very friendly and got the chance to talk to people at all levels", "Interview Questions": "there was not any difficult or unexpected questions."}, {"date": "30 Jan 2013", "title": "Staff Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Dec 2012", "Interview Descriptions": "Was fast and very smooth.  HR recruiter and manager were knowledgable, freindly, and gave a lot of information about the orgaization, the mission and culture, and specific functions and duties I would be expected to perform.  The hiring process probably would have been quicker, but it occured over the holidays", "Interview Questions": "If I had a problem with another staff member, how I would handle it"}, {"date": "4 Apr 2016", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Rochester Medical Center in Nov 2012", "Interview Descriptions": "My interview was a very long time ago but from what I can remember it was easy. You do a phone interview and then a an in person interview. I believe it took about 2 weeks to actually hear back. The people who interviewed me were fabulous, they did not make me feel uncomfortable at all.", "Interview Questions": "Tell me about yourself?"}, {"date": "29 Dec 2012", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at University of Rochester Medical Center (Rochester, NY) in Aug 2012", "Interview Descriptions": "My interview for my current position I felt went very well, I felt very comfortable during the interview process.  One thing that I hate about interviews is that sometimes it feels more like an interrogation instead of interview; and I must say that this interview did not feel that way.", "Interview Questions": "Has there ever been a time that what you thought the customer wanted was in fact not what they wanted, meaning that you misunderstood the customer."}, {"date": "19 Nov 2015", "title": "Information Analyst I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Jun 2011", "Interview Descriptions": "Interviewed individually with a couple of analysts, then with supervisor, and finally with the lead investigator.  Process was fairly laid back with the initial interviews focusing on team dynamics.  I would not be too concerned just be yourself and be sure to enthusiastically mention what particular skills you can bring to the team.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 Jun 2011", "title": "Pharmacy Technician-Inpatient Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Rochester Medical Center (Rochester, NY) in Jun 2011", "Interview Descriptions": "Application, resume and cover letter were submitted online and I received a call several weeks later about setting up an interview. They were very flexible around my current work schedule and we set up an interview over the phone for about a week later. The interview was 1:1 with one of the supervisors. It consisted of discussing my resume, the expectations of the job, the department philosophy and changes that they had recently been making, and a tour of the department. The interviewer only asked me three standard interview questions. The interviewer was very personable and seemed more interested in learning about my interest, personality and standards than hearing the \"correct\" answers to a bunch of questions. Have questions prepared to ask, they seemed really impressed with preparedness. The pharmacy is a very busy place and quite noisy from what I perceived.", "Interview Questions": "If asked to describe you, what would your mast recent employer probably say?"}, {"date": "4 Jan 2014", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of Rochester Medical Center in Jun 2011", "Interview Descriptions": "Standard research job interview. Mostly based on publication history, interpersonal skills, relevant scientific knowledge and responsiveness to job posting. Depending on the department and level, you might meet with other people in the division or department. The actual contracts now for Postdocs are a mere one year. This really limits what can be done in terms of applying for grants.", "Interview Questions": "N/A"}, {"date": "27 Jun 2011", "title": "Health Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Rochester Medical Center (Rochester, NY) in May 2011", "Interview Descriptions": "I was contacted by email to meet with the woman who was leaving the position. We spoke for ~30 minutes. She reviewed my resume with me and asked some questions about my experience. It was a very relaxed interview. She told me that I would be scheduled for a 2nd interview with the researcher. I was notified by email the next day that the 2nd interview would be a week later. That interview was more formal. I think the researcher was not comfortable in the role of interviewer. We spoke for ~30 minutes, and I knew I would not be getting an offer for the position when I left.", "Interview Questions": "How would you communicate to team members that a deadline was approaching and they had to have their materials ready in time?"}, {"date": "9 Jul 2015", "title": "Data Control Clerk II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Rochester Medical Center (Rochester, NY) in Feb 2011", "Interview Descriptions": "Contacted by email, followed up with by phone. Set up an interview with department head. Then did another day of interviewing with the whole department. The first interview was fairly informal, the second one more formal.", "Interview Questions": "What can you bring to the team?"}, {"date": "12 Apr 2012", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Rochester Medical Center (Rochester, NY) in Aug 2010", "Interview Descriptions": "I contacted the principle investigator by email, and it turned out that he was looking for a postdoc with many of the technical skills I had. We scheduled a phone interview. We may have had one or more additional phone interviews. Eventually we set a time for me to come in and meet the other lab members, and present my graduate research.", "Interview Questions": "Most questions were scientific in nature, and/or related to how I would fit in with the other people in the lab. Nothing was really out of the ordinary."}], [{"date": "30 Jun 2010", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Rochester Medical Center (Rochester, NY) in Jun 2010", "Interview Descriptions": "I sent my resume and cover letter to the contact person for the position and was called within a couple of business days for an interview. Every team member from the research study interviewed me separately. The next day, I was called to complete an interview.", "Interview Questions": "What do you like least about your current position?"}, {"date": "30 Jun 2011", "title": "Medical Technologist - Cytogenetics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Rochester Medical Center (Rochester, NY) in Oct 2009", "Interview Descriptions": "I applied online and submitted my resume in person separately. I heard back within two weeks and had an interview that same week. The interview went well, it was very easy. There weren't any skill tests, intelligence test, personality tests, or group/panel interviews. The position was misrepresented as 'banker hours' and most aspects of the job were sugar-coated.", "Interview Questions": "There were not any unexpected interview questions asked for this interview. "}]]