[[{"date": "23 Apr 2023", "title": "Senior Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service", "Interview Descriptions": "The interview process was fair. The process involves taking an assessment after which one goes through two rounds of oral interviews. Once you pass the first round of interviews, you are invited for the second.", "Interview Questions": "How does your education and qualifications prepare you for this job?"}, {"date": "11 Apr 2023", "title": "Associate Director of Training and Engagement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Church World Service", "Interview Descriptions": "I was contacted by the hiring manager immediately after applying and was asked to schedule an initial interview. On the morning of the interview, I received an email from the hiring manager stating that she had an emergency and needed to reschedule. After not hearing back from her for over a week, I decided to reach out to her and was able to finally reschedule the interview. On the day of the interview, I was taken aback by her very dry and serious demeanor which gave the impression of someone either overly stressed or simply unhappy. In fact, during the start of the interview, she failed to provide a proper introduction about herself and went straight to asking questions. This abrupt start to the interview was very awkward and jarring. After I answered all her questions, I asked if she could tell a little bit about her role, and what her involvement was in the Refugee Welcome Collective project. By the end of the interview, I was told I should expect an invitation for a follow up interview. Unfortunately, that invitation never arrived even after I followed up twice. Based on the hiring manager’s awkward interview approach and her lack of commitment to setting up a follow-up interview as I was told to expect, I am no longer interested in pursuing this role.", "Interview Questions": "What attracted you to this role?"}, {"date": "6 Apr 2023", "title": "Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (Nairobi)", "Interview Descriptions": "Behavioral questions on planning and organization, team work (dealing with people), working under pressure and how you fit to the job requirements in terms of your qualifications and experience. Experience with USRAP is a bonus", "Interview Questions": "How does your qualifications qualify you for the position?"}, {"date": "23 Apr 2023", "title": "Caseworker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (Pretoria, Gauteng) in Apr 2023", "Interview Descriptions": "Typing test- 40wpm 96% accuracy\nWritten test(write an incident report based on the given scenario) (if you have passed the typing test)\nInterview (Competency based questions) (panel of two) \nBackground check(reference, criminal, education, financial)", "Interview Questions": "How do you handle a conflict between you and your supervisor?"}, {"date": "18 Mar 2023", "title": "Case Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Church World Service (Pretoria, Gauteng) in Mar 2023", "Interview Descriptions": "Started with a typing test and a written test (both straight forward). I applied in 2021 August and only heard from them in February 2022. The first two assessment were done in a month and a half. Only to find out their salary is super low for the position. R19000 per month. Would've loved the job but not for that salary. (in my opinion pay package should be included in the job ad) They said they wanted to discuss the salary before starting the interview process...I have a feeling I wasn't the first one who expected a higher salary.", "Interview Questions": "Interview never started as I wasn't happy with the salary."}, {"date": "9 Mar 2023", "title": "Caseworker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service in Mar 2023", "Interview Descriptions": "Typing 40 words per minute with 96% accuracy..test was three minutes..you have three trials to achieve the above.test takes 20min.they shall take the highest score amongst the three to go to the next stage", "Interview Questions": "Typing 40 words per minute with 96% accuracy..test"}, {"date": "28 Dec 2022", "title": "Policy Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Church World Service", "Interview Descriptions": "Very simple and efficient phone screening. They did a wonderful job of outlining team and expectations. The interview was 30 minutes and addressed various aspects of professional, operational, and personality components", "Interview Questions": "Examples of oversight and situational awareness"}, {"date": "3 Feb 2023", "title": "Social Worker/Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Church World Service (Johannesburg) in Dec 2022", "Interview Descriptions": "It was an assessment test and I didn't do well. I struggled to log in and to type due to signal. My typing accuracy was also low. I am planning to utilise typing assessment tests.", "Interview Questions": "Typing assessment test and I failed it."}, {"date": "21 Mar 2023", "title": "Caseworker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Church World Service in Nov 2022", "Interview Descriptions": "Typing test, written assessment, bbi interview..The process took long though after the interview and I had received an offer from another company They ask questions like tell us of a time", "Interview Questions": "Tell us of a time..."}, {"date": "15 Nov 2022", "title": "Case Processing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (Nairobi) in Oct 2022", "Interview Descriptions": "1.Online typing test. 2.face to face interview Was put on eligibility list for hire which is valid for one year. The one year is from 10November 2022- 19th Nov 2023", "Interview Questions": "Most difficult task you have ever handled."}], [{"date": "7 Nov 2022", "title": "Case Processing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (Nairobi) in Oct 2022", "Interview Descriptions": "I applied online. Two weeks later, I was invited for a typing test then a week later invited for a one on one interview with a panel. Most interview questions used the BBI approach.", "Interview Questions": "Tell me about a time you had to overcome major obstacles to achieve your objective. what was the result?"}, {"date": "22 Feb 2023", "title": "Case Processing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Church World Service (Nairobi) in Oct 2022", "Interview Descriptions": "i did typing assessment test October 2022. I passed the test according to the measures given. I followed up after a month asking for the progress. I later received a notification that i passed the test and one on one interview will be scheduled on a rolling base. around february 2023 i got another notification that the interview process has been put on hold till further notice", "Interview Questions": "Typing speed test of 5100 keystroke per hour with 95% accuracy"}, {"date": "16 Nov 2022", "title": "Resettlement Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Church World Service (Kampala) in Aug 2022", "Interview Descriptions": "The questions where behavioral based interview straight on point the answers should be short and precise the recruiting team pleasant the whole Process was online from August with first written then Orals all Online", "Interview Questions": "They were behavioral based and required a STAR techniques all through"}, {"date": "26 May 2022", "title": "Prospect Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Church World Service in Apr 2022", "Interview Descriptions": "I was interviewed by two people from the Business Development division and felt that it went well, including comments on my significant level of experience. I was then asked to do a two-part proofing/editing and research skills exercise that took about two hours. After I submitted that exercise, I checked in bi-weekly as a polite follow-up and was twice told that no decision had been made, but hoped to be coming soon. After several weeks, an HR representative sent an email to inform me that the position had been canceled, but it might be reconfigured and relisted in the future. A month later, I received CWS outreach to apply for a similar interim six-month contract position, but it included no information on the next steps or compensation. Overall, the entire experience left me feeling very disappointed and suggested that the organization is very disorganized.", "Interview Questions": "Can you tell us about how you organize and prioritize your prospect research within an organization that has many different programs?"}, {"date": "16 May 2022", "title": "Case Processing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (Nairobi) in Mar 2022", "Interview Descriptions": "Short and to the point. They ask behavioural based questions therefore you have to apply your experience to the question asked. They are very transparent in their interviews. Pleasant experience", "Interview Questions": "How do your experience and education relate to this position?"}, {"date": "14 Jun 2022", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Church World Service (Nairobi) in Mar 2022", "Interview Descriptions": "The whole process was so confusing. We were 84 candidates on the call doing the same interview. We were kept waiting for over 2 hours on 2 different days. Disorganized from the beginning to the end.", "Interview Questions": "How to handle an irate customer."}, {"date": "9 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Church World Service (Lancaster, PA)", "Interview Descriptions": "Lots of background about the company and what they do, lots of questions about why I was interested in this kind of work. Opportunity to ask questions about the company at the end. Very open ended and comfortable.", "Interview Questions": "Why are you interested in this kind of work?\r\nHow did you hear about CWS?\r\nTell me something that I wouldn’t know from your resume. \r\nWhat is your proficiency in other languages? "}, {"date": "1 Jan 2022", "title": "Finance Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (Mukono, Mukono) in Aug 2021", "Interview Descriptions": "Interviewed with CWS Kenya. Processes took almost a month. I was told to do a written assessment that I purposed followed by 2 oral interviews that I still passed. I got a system notification that I had passed the last oral interview and I was  I was eligible for hire. I never had back from any one although even I followed up with everyone with the HR, I still had no feedback and I was ghosted.", "Interview Questions": "Tell me about your professional background "}, {"date": "20 May 2022", "title": "Complementary Pathways Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Church World Service (Nairobi) in Jun 2021", "Interview Descriptions": "Passed the written test first, then had an interview. Shortest interview I've ever had, very intense questions. Was a video call, but only used audio since they were on the other side of the world.", "Interview Questions": "Gave mostly case study scenarios. And asked the same questions they asked on the forms that landed me the interview. "}, {"date": "28 Mar 2021", "title": "Co Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Church World Service", "Interview Descriptions": "There's an initial written remote test. This is followed by an interview that might include a training session. Interviewers allow you to take your time to reflect on your answer. Don't be concerned as they type away - as explained, they are recording responses.", "Interview Questions": "Connect your experience to the role."}], [{"date": "19 Feb 2022", "title": "Income Maintenance Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Church World Service (Nairobi) in Feb 2021", "Interview Descriptions": "The interview is basically two steps. Both are competency-based questions as well as the requirement of STAR method of interviewing. They also ask why you want the job, your education background and the exeprience suited for the job.", "Interview Questions": "Tell us a time when you worked with a difficult colleague"}, {"date": "3 Nov 2021", "title": "Health Programs Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Church World Service (Jersey City, NJ) in Feb 2021", "Interview Descriptions": "I sent an application to the hiring manager. They interviewed me in a week. The interview was online and had multiple questions. But they never contacted me after the interview.", "Interview Questions": "What is the priority topic among the immigrant group you work with at your current role?"}, {"date": "19 Jan 2021", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service", "Interview Descriptions": "In-person, one-on-one interview with program director. typical interview questions regarding motivation, skills, and such.  You'll be given chance to answer each question as the interviewer types in a score within their laptop, and then asks another. Once interview is over, you'll be escorted out and should receive a notice from HR regarding next steps or termination.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Nov 2020", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (Newark, NJ) in Oct 2020", "Interview Descriptions": "Phone call for about 30 minutes. they asked about your education and previous work history. You got a better understanding of what you would be doing in this position and what was required of you.", "Interview Questions": "Why you were looking to work with this population?"}, {"date": "30 Jun 2017", "title": "Case Manager - Americorps Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Church World Service (Durham, NC) in May 2017", "Interview Descriptions": "About an hour long and asked some tough questions about experiences and interest in the position. Got the sense that they are looking for efficient people who have interest and experience with Refugee work.", "Interview Questions": "Describe a time you've made a high risk decision. What did you choose?"}, {"date": "21 Mar 2017", "title": "Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Church World Service (Indianapolis, IN) in Nov 2016", "Interview Descriptions": "First interview was via Skype. Second interview was conducted in person and with a third person through Skype. In between interviews I was given scenarios to prep for the in person interview. Time from application to end of interview process was 5 weeks.", "Interview Questions": "I was given a number of scenarios to role play."}, {"date": "29 Oct 2016", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Church World Service", "Interview Descriptions": "Pretty straightforward. I was abroad at the time, so we had a Skype interview - it was only one interview. Was asked mostly standard questions, like things off of my resume, greatest strengths, greatest weaknesses, and then a number of questions related to my cultural competency. There were some behavioral questions as well.", "Interview Questions": "Tell us your experience in dealing with people who did not speak English?"}, {"date": "28 Mar 2017", "title": "Director for Annual Giving Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Church World Service (New York, NY) in Jan 2016", "Interview Descriptions": "I had a Skype interview scheduled early last year with whom would have been my direct report,  based out of Tanzania, I believe, and we had some difficulties with the connection, to no one's fault, however, I was disappointed to not receive any feedback from the interviewer or HR manager regarding status on my candidacy. I did follow up via email and also phone, with no response.", "Interview Questions": "What is the extent of my experience in client-facing roles as well as events management?"}, {"date": "1 Jan 2018", "title": "Refugee Resettlement Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Church World Service (Harrisonburg, VA) in Jul 2014", "Interview Descriptions": "A panel of 3 people and conducted 2 interviews and took 3 months to get the offer. The 1st interview was the ED and his 2 best friends who control the office for 25 years. the second interview was the ED and his favorite employee \" based on faith\". \r\nthe offer came after 3 months and after I called the HR 10 times and sending many emails asking about the result of the two interviews. \r\nI got the position because the in need of my 2nd language that I speak. otherwise, the selection will be based on faith.", "Interview Questions": "Do you have experience working with refugees?"}, {"date": "1 Jul 2012", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Church World Service (Islamabad, Islamabad) in Nov 2011", "Interview Descriptions": "I was reffered bby a friend. They call me for interview. Things went well and then I was given a offer. I accept and join the company", "Interview Questions": "When can you join"}], [{"date": "24 Jul 2015", "title": "Case Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Church World Service (New York, NY) in Jan 2011", "Interview Descriptions": "interview with program staff and human resources. there were 4 people interviewing me. then returned for 2nd interview. interview went well. ask you basic questions. if review website, able to do interview.", "Interview Questions": "tell us about yourself."}]]