[[{"date": "12 Jan 2023", "title": "Community Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vivent Health (Kansas City, MO)", "Interview Descriptions": "I applied on the company website, was contacted by a recruiter, submitted a video interview, the interviewed in person at Vivent in Kansas City. Way too many steps for a job only paying 40k. During my in person interview, I specifically asked about staffing levels and turnover. I was told they would be fully staffed once my position was filled and that they had stable staffing. That was absolutely not true. By the time I left, less than 6 months later, of the 14 case management positions, 4 were empty, and all but 3 of the filled positions had been there less than a year.", "Interview Questions": "Are you comfortable working with a diverse set of clients, including those in the LGBT community?"}, {"date": "12 Nov 2022", "title": "Prevention Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vivent Health", "Interview Descriptions": "I called multiple people in the month after submitting my online application and left voicemails that were never returned before finally hearing from the company about 6 weeks later. I interviewed twice, and the entire process including background and reference checks took about a month.", "Interview Questions": "What interests you in this position?"}, {"date": "24 May 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vivent Health", "Interview Descriptions": "Interview process was smooth and they got back to me quickly. The onboarding process/new employee planning could use a lot of work and, in my experience, was not consistent with the interview process. This is something that is starting to improve and is a topic of conversation throughout the company.", "Interview Questions": "Why I was interested in working at Vivent Health. "}, {"date": "6 May 2022", "title": "Business Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vivent Health", "Interview Descriptions": "I really appreciate the warm introduction and explanation of the rest of the interview process! It was clear they were just trying to understand who I am and if my goals, skills, and expectations were in alignment with the role.", "Interview Questions": "They asked my interest and background with the organization's mission and values."}, {"date": "23 May 2022", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at Vivent Health (Milwaukee, WI) in Apr 2022", "Interview Descriptions": "A recruiter contacted me to see if I was interested but would return my calls for 2 weeks. I interviewed but then experienced same thing. When I talked to the hiring manager she was told that I was no longer interested. Not sure if they mixed me up with another candidate or what!? 2 month later I got offered a job for $10k less than what I was originally told and remote work benefits that I was interested in only are available to HR and leadership staff. I should of been paid for my time wasted.", "Interview Questions": "Way too many around conflict. Got the impression that staff are not supported when dealing with dangerous clients. Also got the feeling that leadership creates barriers to serving clients. Icky feeling. “How do handle when a client does threatens to hurt you but you still have to work with them? “ "}, {"date": "17 Sept 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Vivent Health in Jan 2022", "Interview Descriptions": "Had multiple interviews, lack of communication between hiring manager and recruiter. Was given positive feedback multiple times but then was told they didn’t have the staff to help train me?", "Interview Questions": "What do you think this position entails?"}, {"date": "1 May 2021", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vivent Health", "Interview Descriptions": "Easy process with a great online platform! THey use spark video interview and it was a one way so I was provided iwth the quesitons and could retake my answers.", "Interview Questions": "They asked about my commitment to diverity and inclusion which was very inspiring!"}, {"date": "29 Apr 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vivent Health", "Interview Descriptions": "The interview was all done remotely due to covid. It was laid back, more of a conversation surrounding fit vs. skill level. The hiring manager was warm and friendly. There was an initial screening interview with HR, and two follow up interviews with the hiring manager", "Interview Questions": "Q: Talk about your work style and self-starting ability. "}, {"date": "18 Nov 2021", "title": "Loss Prevention Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vivent Health (Austin, TX) in Jan 2021", "Interview Descriptions": "really super incredibly great man love this website so much. Asking for something in return is always virtuous, I couldn't be happier to write these 30 words.  I hope everyone here finds my words helpful", "Interview Questions": "sir, where were you born?"}, {"date": "7 Jun 2018", "title": "Prevention Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vivent Health in Jun 2017", "Interview Descriptions": "Once I applied online (super lengthy application process-not a fan), I was called by the HR dept. over the phone. HR held a brief phone screening before I was contacted by the Manager of the Prevention Dept. The HR dept. is located in a different city than my face-to-face interview. It was a little confusing to learn the process at first due to ARCW merging with other agencies. The face-to-face interview was great. Fairly standard questions about my former prevention experience.", "Interview Questions": "Tell me about your former experience in HIV prevention..."}], [{"date": "4 Aug 2017", "title": "ARCW Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vivent Health (Milwaukee, WI) in Oct 2015", "Interview Descriptions": "The interview itself was seamless. There was about a month lag time between the interview and the job offer. Overall, it was fine. The interviewing process now for the agency happens at more of a rapid speed, which I'm proud of.", "Interview Questions": "What is your preferred management style?"}]]