[[{"date": "2 Jun 2023", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Upstream USA", "Interview Descriptions": "Had to go through multiple layers of review, show my work product, present, etc. Last interview was all about values and DEI (apparently) but they ended up asking a lot of technical questions in there too.", "Interview Questions": "Talk to me about the history of minorities being discriminated in healthcare? Give me an example of a time you didn't distribute DEI values in the workplace - what did you learn and what did you do from it?"}, {"date": "29 Apr 2023", "title": "Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Upstream USA in Mar 2023", "Interview Descriptions": "The entire interview process took about one month. Great communication with the recruiter throughout each stage. I had four interviews and met with six people total. Positive experience all around!", "Interview Questions": "Tell us about a challenge and an accomplishment in your past work and how did you handle it? How do you manage stress at work?"}, {"date": "30 Nov 2022", "title": "Contracts Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Upstream USA", "Interview Descriptions": "Received a quick response, HR was friendly. Ultimately I wasn't interested in the position, was a typical explain your resume situation. I asked for next steps, but ultimately accepted a different position before I heard back.", "Interview Questions": "Why did I want to work there."}, {"date": "15 Jan 2023", "title": "Monitoring, Evaluation and Learning Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Upstream USA in Nov 2022", "Interview Descriptions": "First interview was a screening interview with HR, followed by a second interview with the team's Director. The interviews were relaxed, informative, and generally very pleasant. A week after the second interview, I followed up with HR to inquire about the status of my application and was informed that I would hear by the next week. Unfortunately, they never followed up.", "Interview Questions": "Why Upstream USA / What about this role interested you to apply? What are your general career goals?"}, {"date": "26 Sept 2022", "title": "Partnership Success Specialist & External Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Upstream USA in Aug 2022", "Interview Descriptions": "I initially applied for the PSS role. I had a phone interview with the recruiter (who was excellent and I enjoyed my experience with them), was asked to complete a writing sample, had an interview with the hiring manager, then had an interview with a VP. Roughly 2 months went by and I was told they weren't sure what they were looking for so they stopped the hiring process for this role. I was then encouraged to apply for the External Affairs team where I interviewed with the team, completed another writing assignment, and interviewed with the hiring manager. This, too, resulted in me being told they decided not to hire anyone for this role until the new year. This entire process lasted roughly 3 months.", "Interview Questions": "How have you had to tailor your message to cater to a specific audience?\r\nTell me about a time you had to create a process for a project and discuss the details to get to the finish line."}, {"date": "4 Apr 2022", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Upstream USA in Mar 2022", "Interview Descriptions": "I had a quick screening call where the HR person went over the job description and asked basic questions about my qualifications. Then went through a series of three additional interviews, all with future managers. Lastly, I submitted a writing sample and heard back quickly about an offer.\r\n\r\nThe interview process was really quick and I was kept in the loop of my application status throughout the entire process. The interviews were very conversational and it really felt like the team was also making sure that my questions were answered also.", "Interview Questions": "Describe your experience with quantitative and qualitative data."}, {"date": "22 Feb 2021", "title": "Senior Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Upstream USA", "Interview Descriptions": "From the first point of contact, my interview process was great! My talent acquisition contact was fantastic and went above and beyond to help me along the way from clear communication to prep calls for my interview with the CFO and CEO.", "Interview Questions": "Why choose to work at Upstream?"}, {"date": "23 Jan 2021", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Upstream USA", "Interview Descriptions": "Multiple rounds with different leaders that become increasingly difficult each round. Very effective. Can be a long process that requires preparation and thought. Helps identify diverse individuals aligned with the mission", "Interview Questions": "What makes you want to work for Upstream?"}, {"date": "12 Jan 2021", "title": "Training Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Upstream USA", "Interview Descriptions": "Initially contacted by recruiter after submitting application. Thereafter had an interview with 2 folks in the office. Recruiter kept in contact throughout, which was nice. Met with Director and a member of the National (HQ) team, and a peer interview. Called back for one additional interview with Director of my department.", "Interview Questions": "How would you handle a technical issue during an in-person event?"}], [{"date": "14 Jan 2020", "title": "Implementation Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Upstream USA", "Interview Descriptions": "Overall, I had a very positive experience. The interview process is longer than I've experience in the past and consisted of multiple interviews over a long period of time (about 6-8 weeks). Everyone was very welcoming and took the time to explain the position more in depth. \r\n\r\nThe process started out with a phone screening from HR followed by three interviews. During the phone screening salary requirements and previous experience was reviewed.\r\n\r\nThen first interview was staged like a traditional interview. The interviewer asked me to tell them about myself, asked about my job experience, etc. Coaching questions were also asked. There was some confusion initially because the interviewer was unavailable. HR quickly communicated this. Afterwards, the HR team reached out to inform me that I was moved to the next round. \r\n\r\nDuring the second interview, the questions were framed around my prior job experience. We went line by line. I was asked what I was hired to do, what I ended up doing, and what my former supervisor would say about me. Following the interview, HR communicated that I would be moved again to the next round of interviews.\r\n\r\nFinally the third interview took place. This was a more brief interview which consisted of typical interview questions. The time spent with the interviewer was short.", "Interview Questions": "What were you hired to do? What did you end up doing?"}, {"date": "1 Apr 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Upstream USA in Jan 2020", "Interview Descriptions": "Numerous interviews with a variety of different team members. It was a fairly extensive process considering the level of the role. Questions were typical of a nonprofit, reproductive health organization.", "Interview Questions": "How comfortable are you in a fast-paced, start-up environment? "}, {"date": "11 Dec 2019", "title": "Quality Improvement Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Upstream USA", "Interview Descriptions": "The interview process was long: 30 minute phone screen, 45 minute video interview, 90 minute in-person interview, and another 90 minute interview. There are a few case questions, but mostly behavioral questions. The interviewers were friendly, but the process felt so prolonged for what they emphasized as an entry-level position. I was misinformed early on in the process about the number of required interviews and was surprised to see multiple people at the second interview despite my emails to clarify who I would be meeting with. Definitely a growing organization and that's reflected in the interviewing process.", "Interview Questions": "How do you stay organized?"}, {"date": "4 Dec 2019", "title": "Implementation Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Upstream USA", "Interview Descriptions": "I can only speak to the round 1 phone screening with the recruiter.  On the whole, it was a very pleasant and engaging conversation. There was equal opportunity for questions from both parties. The part that left a very bad taste in my mouth was the discussion of salary. \r\n\r\nFirst, I should say that I truly appreciate when salary is discussed early on in the interviewing process as this can save time for both the organization and the interviewee. However, I felt that the discussion was handled very poorly. When the recruiter asked me my salary expectation, I asked if she could share what the budgeted range was for this role as my expectations would require a better understanding of the job duties.\r\n\r\nThe recruiter stated that she would be happy to tell me the exact range but would not do so until I first gave her a figure and that failing to do so would mean that I would not advance to round 2.  After I finally stated a range, she gave me the 5,000 range for the position. I did not appreciate the mind game.  Though I was invited to continue, I had already lost faith in the process and declined the second interview.  I have tremendous respect for the incredible work of this organization but was disappointed by my personal experience.", "Interview Questions": "What do you know about the organization?"}, {"date": "5 Nov 2019", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Upstream USA", "Interview Descriptions": "Two interviews over zoom, then one in person with the executive director, a peer, and an exercise. The process took about a month and a half between interviewing and start date.", "Interview Questions": "Tell me about a time when you gave feedback. "}, {"date": "14 Feb 2021", "title": "Training Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Upstream USA (Charlotte, NC) in Oct 2019", "Interview Descriptions": "Lengthy and thorough. There are multiple interviews and they will do a background check and will contact your references. You will have two phone interviews and an in-person interview. They will ask you in-depth questions about the mission, so it's best that you do as much research as possible.", "Interview Questions": "I honestly can't remember the questions."}, {"date": "14 Aug 2019", "title": "Implementation Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Upstream USA", "Interview Descriptions": "I initially had a phone screen with a recruiter, then a video meet and greet with the position supervisor. Most of these questions were skill based. The final round included an in person panel regarding career background and coaching skills, in addition to case scenario questions.", "Interview Questions": "A lot of questions regarding direct health care experience and coaching experience. In the final round there were two case scenario questions."}, {"date": "21 Oct 2019", "title": "Quality Improvement Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Upstream USA (Winthrop, WA) in Aug 2019", "Interview Descriptions": "There was a phone screening followed by four Zoom interviews. Prior to one of the interviews I was given a brief case study and was asked to prepare a short presentation.  During this same interview, I was given a few other case studies and asked to respond to a few questions regarding each of them.  My recruiting specialist was in contact with me via email along the way to ensure that I was prepared for each of my interviews.  It was a long process, but it was a good experience and allowed me to obtain a solid understanding of Upstream and the role I was applying for.", "Interview Questions": "Give an example of a time you were able to overcome resistance. "}, {"date": "13 Sept 2019", "title": "Implementation Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Upstream USA (Boulder, CO) in Jul 2019", "Interview Descriptions": "Once I submitted my application and cover letter online, I was contacted by a recruiter within a couple days. She reached out to me to schedule a 30min phone conversation to discuss my background, the job description and some of the benefits the organization offers. After this preliminary phone call, I was contacted to schedule a video interview with one of the team members in Seattle. This interview was about 45min long and included some typical interview questions. I was told there would be two more rounds of interviews after this but it was reduced to 1 more video call after some scheduling constraints for the interviewers. My last interview was with the team member I spoke with in my second interview and an administrator for the organization. They asked more detailed questions about my background and I was offered an opportunity to ask more questions about the organization. Throughout the interview process, I was offered prompt responses from the recruiter and clear communication about next steps. The entire interview process took about 2 weeks.", "Interview Questions": "Why do you want to transition from nursing to a program implementation role?"}], [{"date": "11 Jul 2019", "title": "Part-time Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Upstream USA (Seattle, WA) in Jul 2019", "Interview Descriptions": "The process began with applying online. Then after passing that first level, I was asked to submit three written questions. The final stages was a 30-minute video interview with their lead trainer in which during that time I was asked to present a 5-minute demo of my training skills.  I had advanced notice about this demo. The demo was without notes or powerpoint etc. Simply talking.", "Interview Questions": "Why I was interested in Upstream?"}, {"date": "29 May 2019", "title": "Office Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Upstream USA", "Interview Descriptions": "Strung me along for nearly two months, recruiter would forget about me and then lie about having called and emailed me repeatedly (really? Both your phone and email don’t work? And then they immediately start working the moment I follow up?). All my references said the hiring  manager spoke as though I had the job—found this flattering, but super irresponsible and gave me false hope. Terrible, arduous  process for a very basic admin job.", "Interview Questions": "How do you stay organized?"}, {"date": "4 Sept 2019", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 weeks. I interviewed at Upstream USA (Charlotte, NC) in Jun 2019", "Interview Descriptions": "My initial interview with the Upstream recruiter was definitely a two way street. She wanted to make sure that she understood my skills and experience but also that I understood the mission of the organization and the position itself. From there, she kept me informed of next steps regularly and was easy to reach with questions. The interview process is comprehensive and there are several steps/interviews. This extensive process makes sure that you understand the role and how committed the organization is to building strong teams. At each step of the process, I met remarkable people that made interviews feel comfortable and welcoming. It felt more like developing a long term relationship than just a job interview. It’s a long process but worth it!", "Interview Questions": "Describe each position on your resume in detail and rate your team before working with them and after."}, {"date": "3 May 2019", "title": "Quality Improvement Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Upstream USA (New York, NY)", "Interview Descriptions": "The process started out well. I was contacted a couple weeks after submitting my application to set up a phone screen with HR. The recruiter I spoke with was very nice, througly went through my resume and career goals. But I was surprised the position wasn't going to start for 5-6 months after I applied and even that wasn't definite. A few weeks went by before I was notified that I would be moving to the second round- a zoom meeting with the hiring manager and his assistant would be in touch with me. I was told my interview would be the second week of February so the week prior I followed up when I hadn't been scheduled. The zoom meeting went alright but I felt that he had other things on his mind. He emphasized how much hiring he was doing and I was sure to stress how much I wanted this job. He said I would be contacted about 2-3 weeks later but I never heard back. I sent emails to everyone whose contact I had and got no response. I felt extremely disrespected and like all the time I spent prepping and accommodating their schedule was for nothing.", "Interview Questions": "why do you think you would be a good member for the team"}, {"date": "24 Jul 2019", "title": "Director of Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Upstream USA (Charlotte, NC) in Apr 2019", "Interview Descriptions": "Started with a phone interview with Laura, then face-to-face with Nicole, then focus interview with Siobhan.  Laura called to talk about an offer. Then Nicole closed the loop with a call making a verbal offer.", "Interview Questions": "Ability to manage high level relationships"}, {"date": "19 Jul 2019", "title": "State Impact Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Upstream USA (Raleigh, NC) in Apr 2019", "Interview Descriptions": "The interview process consisted of 4 interviews over the course of about 1.5 months (3 individual and 1 presentation to a group), along with an initial  phone screen and on-going communication between interviews. I felt very supported throughout the process.", "Interview Questions": "Tell me about a time you experienced a challenge with a coworker and how you resolved it?"}, {"date": "26 Jul 2019", "title": "Strategic Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Upstream USA (Raleigh, NC) in Mar 2019", "Interview Descriptions": "Several short rounds over zoom with various national and local staff, one in-person with Executive Director and a homework assignment presentation. Long process but they follow a specific process which was outlined to me at the beginning and there was communication from the human resources staff throughout it. I never felt in the dark, unsure of what was next or unprepared. Very kind and friendly staff and positive experience.", "Interview Questions": "Why do you want to work at Upstream"}, {"date": "19 Jul 2019", "title": "Strategic Policy Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Upstream USA (Raleigh, NC) in Mar 2019", "Interview Descriptions": "Laura was exceptional and found a role for me that I had not previously considered.  The overall process was arduous, but in the end gave me a better sense of my job and helped me gauge my interest in the role.  I didn't realize that the peer-based discussion was an interview, which ended up being okay but would have been nice to have a better sense of going in.", "Interview Questions": "Give a short elevator-speech describing Upstream and its mission."}, {"date": "3 Jul 2019", "title": "Part Time Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Upstream USA (Seattle, WA) in Mar 2019", "Interview Descriptions": "Contacted by a recruiter and received some basic information about the role, then I completed a zoom interview with two folks where I was asked to do a 5 minute presentation. The questions prior to the presentation were pretty standard. They made an offer on the spot.  Post interview communication was TERRIBLE.", "Interview Questions": "Discuss a time when you experienced difficulty providing a training. "}, {"date": "19 Jul 2019", "title": "Executive Assistant/Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Upstream USA (Charlotte, NC) in Feb 2019", "Interview Descriptions": "The Interview Process was very efficient and warm. Nowadays, most times when you apply for a position, you hear from an automated email, even if you have gone a few steps into the process.  Here, it is not like that.  The Talent Team is very hands on and keeps you informed every step of the way.  They even go so far as to  ask you to call them once you have completed a \"next step interview\" so they know how you felt about it  and they then touch base with you again to provide any feedback.", "Interview Questions": "Why are you interested in Upstream?"}], [{"date": "12 Apr 2019", "title": "Quality Improvement Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Upstream USA in Jan 2019", "Interview Descriptions": "The biggest red flag about this interview process was how long it took (4 months). There were three rounds: \r\n1. An initial phone interview\r\n2. Zoom interview\r\n3. In-person interview that consisted of a) case studies and questions with two individuals and b) a separate peer interview.\r\n\r\nBefore I get into the interview questions, I want to discuss how shady the entire process was. Contact with professionals at Upstream was extremely spaced out, with no receipt of email confirmation or really any correspondence after following up. I did not even know the salary or location of the position until 3.5 months after being involved in their process. \r\n\r\nThe recruiter told me up front that this position would not be starting for 5 months, but could make exceptions if someone needed to be employed sooner. I let them know that this was the case for me, but the process did not move any quicker. I came to find out from LinkedIn that someone with less experience had been hired into this role much sooner than the originally planned start date (they had four openings for the same position).\r\n\r\nI was made aware that I would be prepped by a recruiter for my in-person interview, which never happened. \r\n\r\nThe Zoom interview was great - no complaints there. This was a typical “tell me about your experience” interview, very straightforward. \r\n\r\nThe in-person interview was a disaster. It started off with two case studies that were meant to show what someone in this position would typically experience on the job. Then there was a third case study that was a literal printout of a PowerPoint slide, and without any writing utensils, I was asked to verbally explain how I would fix that slide. I found this absolutely ridiculous - if it were sent in an email and I had some time to show creativity, I would have been better than mumbling over my thought process in front of them. I was embarrassed, and I think this is a surefire way to make candidates look inferior (despite knowing how to optimally edit a PowerPoint after many years of formal education and work experience). The PowerPoint was out of line for an interview and there was no way anyone could have prepared for that. \r\n\r\nThen, the second individual who wasn’t in the original Zoom interview asked some questions, all of which were either repeated standard questions from the Zoom interview, or extremely negative and borderline condescending personality questions.\r\n\r\nThe peer interview seemed like filler, considering that person was not even in the role I was interviewing for. They mostly asked about background. \r\n\r\nOverall, it felt like Upstream was confused on what the position even is and what they were looking for. The questions felt as if they were designed to deliberately cut down a strong applicant with years of experience and education in the field, especially someone so excited and eager about their mission. The process was disorganized from start to finish, and I think they could benefit from a hiring structure that is much more clear and concise. Rather than feeling disappointed that I didn’t get the job, I am appalled and hurt after getting so excited about this interview and finding out that it would only be negative, demeaning, and a display of the exact place I would never want to work.", "Interview Questions": "Tell us about a time when you had a conflict with someone you worked with"}, {"date": "10 Dec 2018", "title": "State Director of Quality Improvement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Upstream USA (Seattle, WA) in Oct 2018", "Interview Descriptions": "Initial screening interviews with recruiter, then with the Director of QI.  The process overall was very clear and efficient. Interviewers want candidate to succeed. Would recommend Upstream to candidates considering a position.", "Interview Questions": "Can you provide an example when you had multiple stakeholders with competing or differing priorities?  How did you handle it and maintain solid relationships?"}, {"date": "10 Jan 2018", "title": "People Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Upstream USA (Oakland, CA) in Dec 2017", "Interview Descriptions": "Phone Interview with recruiting, phone interview with hiring manager. Very professional and timely. Both interviewers were experienced interviewers and asked good questions and allowed me to ask questions too.  I was disappointed that I didn't go further in the interview process but they were professional and didn't string me along.", "Interview Questions": "What are you really good at professionally?"}, {"date": "26 Oct 2017", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Upstream USA", "Interview Descriptions": "I had a general Skype interview followed by a 5 minute presentation on any topic (also via webcam) and brief post-presentation interview. I was given the rates without having to ask.", "Interview Questions": "What do you know about us/our model? How have others described your training style?"}]]