[[{"date": "18 Aug 2022", "title": "Service Provider Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Dominic's", "Interview Descriptions": "Extremely informal and unorganized; it felt more of an inconvenience because of the disruption of the day. There was no leadership evident within the interview. Office workers were loud and unprofessional and rude.", "Interview Questions": "Do you work well with others."}, {"date": "19 Jul 2021", "title": "Office Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Dominic's", "Interview Descriptions": "Overall it was really good , it was scarier in my head. They basically went over the expectations of what I would be doing in the job position Im applying for.", "Interview Questions": "So can you Tell me about yourself "}, {"date": "17 Oct 2018", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in Oct 2018", "Interview Descriptions": "Very professional interview. Manager greeted me told me about the job and introduced me to the other workers.  The interview took about 35 to 40 mins in all. She said hr will get back to me in a week. It has been longer and haven't heard anything.", "Interview Questions": "Tell me about yourself. Whats your strong and weak points."}, {"date": "31 Mar 2019", "title": "Emergency Room Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Dominic's (Jackson, MS) in Apr 2018", "Interview Descriptions": "The interview process was brief and easy  because I’ve worked in a hospital before. Actually I was transferring from another department so that made it a little better because they seen my hard work and dedication to the other department.", "Interview Questions": "Have you ever worked in a hospital before "}, {"date": "24 Jan 2018", "title": "Gift Shop Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in Jan 2018", "Interview Descriptions": "It was smooth but she was asking me questions over in over trying to to confuse me and most of the interview quetsions had anything to do with what I was applying for I was applying for a customer service role not a RN OR LPN ROLE I should've intervierwed her back but she gave me no chance to do that need to be replace in HR she already kbow who she wanted to hire just tried to play it smoothly like she didn't I was answering my questions I asumsed to good to the point she asked was I reading off a paper If I was in your face you would've known I never had a phone inteview before but thany you Yvette poor inteview you need to be trained right in pick wisely in not by choice cause who you pick might not even stay pass a week,", "Interview Questions": "something that wasn't sealing with customer service"}, {"date": "16 Apr 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Dominic's (Jackson, MS) in Nov 2017", "Interview Descriptions": "It was laid back and personable. It felt more conversational than strict questions and answers only. My interviewer was not only learning about my skills and certifications, but the kind of person I was and my personality.", "Interview Questions": "Where do I see myself in 5 years?"}, {"date": "13 Sept 2017", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in Sept 2017", "Interview Descriptions": "Straightforward! Took about 15 min. Interviewed with two people. Friendly. Interviewed over phone first with hr. If you pass that step they forward app to manager. Next call was from manager for interview. After interview hr reached out and offered job.", "Interview Questions": "What tube do you use for CBC??"}, {"date": "24 Aug 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in May 2017", "Interview Descriptions": "After passing the human resource phase you get to interview with the nurse managers. The nurse managers can not offer you the job but some will let you know you are welcomed to work for them.", "Interview Questions": "they asked about skill level and experience"}, {"date": "23 Mar 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Dominic's (Jackson, MS) in Mar 2017", "Interview Descriptions": "Interested first over the phone with HR.  Then a phone interview with a supervisor.  Then a physical face to face interview with the supervisor.  A tour of the lab facility and I got to meet with the lab manager.  It was about a month before I started this process from submitted application to the phone calls.", "Interview Questions": "What is your greatest accomplishments,  what area do you like the most, what machinery are you familiar with, why do you want to work here, name your strengthsite and weaknesses. "}, {"date": "27 May 2016", "title": "Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Dominic's (Jackson, MS)", "Interview Descriptions": "Interview was easy and simple I was offer the job the same day. Orientation was the next week 8-3 or 8-4 for two days then had on the Job training for a week", "Interview Questions": "Tell me about your last job experience"}], [{"date": "17 Nov 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Dominic's (Jack, MS) in Nov 2015", "Interview Descriptions": "love human resources Ms. veronica she is so nice. I have a another interview Wednesday, can't wait !. It was an overall easy going interview . I'm currently waiting on my next interview I going to nail, I absolutely love the healthcare field", "Interview Questions": "tell me more about your experience? what happened at your last job?"}, {"date": "8 Oct 2015", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in Sept 2015", "Interview Descriptions": "The interview lasted about an hour and was very thorough in my opinion. The questions were not hard, and the interviewer was personable and easy to talk to. Overall good process.", "Interview Questions": "Why would you be a good fit for this job."}, {"date": "12 Oct 2015", "title": "Lab Assistant, Phlebotomy Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at St. Dominic's (Jackson, MS) in Sept 2015", "Interview Descriptions": "Process was great. 3 individuals to evaluate the potential candidate is a great idea. I also was very excited that i received offers for other positions after my interview. That makes me feel like i was wanted and that they saw a lot of potential in me and that i will be a valuable asset with this company.", "Interview Questions": "How do i feel about staff being late for work?"}, {"date": "1 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Dominic's (Jackson, MS) in Aug 2015", "Interview Descriptions": "I first spoke with the recruiter and was asked about why I wanted to work at St. Dominic's, as well as other interview questions, including work experience and strengths that I could bring with me to work.  I was then sent to the hospital to meet with the hiring manager. I answered more questions about work experience, strengths, weakness, etc. I was also given a summary of what the position entails and what is expected from an employee.", "Interview Questions": "What is one positive thing you could bring to St. Dominic?"}, {"date": "31 Aug 2015", "title": "Claims Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at St. Dominic's (Jackson, MS) in Aug 2015", "Interview Descriptions": "The HR lady was very helpful and prompt on getting me the information needed. She worked with me over 4 months in interviewing for different positions until the right one was found. The interview prior to the last one was great interview and helped me get the 2nd interview that got me the job. The ladies I have talked with over this process have been very nice and helpful.", "Interview Questions": "What experience do you have in a hospital billing atmosphere?"}, {"date": "8 Jul 2015", "title": "Cardiovascular Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jul 2015", "Interview Descriptions": "I submitted my resume online. I then interviewed at the hospital. After interviewing with the department, I interviewed at Human Resources. Next will be the drug screening and from there I will go to orientation and meet with the department before I can begin working.", "Interview Questions": "How do you stay on task?"}, {"date": "6 Aug 2015", "title": "Student Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jul 2015", "Interview Descriptions": "Initial interview performed along with employee survey filled out by myself in order to compile list of top candidates. Top candidates' then turned in references and proof of enrollment in a school of nursing. Interviewer was very fair and deliberative in the interview process and interviewers were informed of employment within 2 weeks of initial interview.", "Interview Questions": "Have you ever had to deal with a coworker/supervisor who was not agreeable?"}, {"date": "12 Aug 2015", "title": "RN Operating Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jul 2015", "Interview Descriptions": "It was very efficient and a positive experience for me.  I really appreciated the opportunity to shadow a current employee in my job area to be sure that I would be happy there.", "Interview Questions": "How to you go about multitasking multiple activities."}, {"date": "26 Aug 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jul 2015", "Interview Descriptions": "I applied online at the St. Dominic's career website.  I was contacted roughly two weeks later to set up an interview. I interviewed and was contacted again about a week later to complete the reference part of the interview. Roughly a week after my reference surveys were submitted, I was contacted again with an offer for the pharmacy technician position I had applied for.", "Interview Questions": "I was asked what I thought my greatest strengths are in the workplace."}, {"date": "6 Aug 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at St. Dominic's (Jackson, MS) in Jul 2015", "Interview Descriptions": "It was very through and detailed.  The interview process did not take long at all.  I was told HR would get back with and what to expect when they called.  HR called and offered me the job.   The next day HR  requested 4 reference.  The overall outcome of the interview was good.   The interview went well the supervisor did not make me feel nervous and thoroughly explained the details of the job and what was expected of me.", "Interview Questions": "I was asked if I would have any problems working every other weekend from 1pm until 10:30pm?"}], [{"date": "3 Aug 2015", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Dominic's (Vidalia, LA) in Jul 2015", "Interview Descriptions": "Very nice, not tense as other interviews I have been on before. I felt very comfortable talking with the director. Made me feel right at home as if I had been there for years. Human Resources personnel extremely kind very informative.", "Interview Questions": "What could I offer St Dominics?"}, {"date": "12 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at St. Dominic's (Jackson, MS) in Jun 2015", "Interview Descriptions": "A very nice person in Human Resources contacted me after applying and set up a phone interview. During the phone interview I was asked several questions and discussed my goals with working at the hospital. Possible positions were also discussed as to which position would fit me best. After the phone interview I received a call to schedule a 1 on 1 interview with a nurse manager.", "Interview Questions": "What can you do to provide the best customer service?"}, {"date": "9 Jun 2015", "title": "Registar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Madison, MS) in Jun 2015", "Interview Descriptions": "Interview process was good and did not take as long as I first thought. The people I interviewed with were very helpful and sweet. They answered all questions I had detailed and made sure I understood.", "Interview Questions": "If you woke up with 100 emails and only had time to read 50 what 50 would you read?"}, {"date": "17 Jun 2015", "title": "Student Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jun 2015", "Interview Descriptions": "I submitted my application online.  I was contacted via email to schedule an in-person interview. During the interview, Lea Young was very explanatory and made me feel comfortable.  I learned a lot about St. Dominic that I didn't know throughout the process, which made me want to be a part of the organization anymore.", "Interview Questions": "How would you contribute to the customer service aspect of St. Dominic?"}, {"date": "14 Aug 2015", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jun 2015", "Interview Descriptions": "Quick and to the point interview that asked why I was hoping to join the St. D team as well as my qualifications. Met with HR to discuss self, career goals, etc. Moved to speak with managers/supervisors and discussed what the job entailed and discussed my goals and how I work with teams.", "Interview Questions": "How would you establish credibility in your work?"}, {"date": "25 Aug 2015", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jun 2015", "Interview Descriptions": "My interview was a little over an hour long. First I talked to an HR Recruiter and she was very friendly. She asked basic interview questions like, \"Why did you pick St. Dominic?\" and \"What qualities do you have that will help you succeed in this job?\" I then spoke with physical therapy management. They asked me several questions, one being about my previous experience, but mainly described hospital policies, hours, parking, etc. Everyone I spoke to was very friendly and well spoken.", "Interview Questions": "Why did you pick St. Dominic?\r\nWhat qualities do you have that will help you succeed in this job?"}, {"date": "26 May 2015", "title": "Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "Overall the process was handled professionally. I was impressed with the amount of speed information I needed was relayed to me and the smooth transitions through phases during the process.", "Interview Questions": "What was a time in your life that you felt like you accomplished something?"}, {"date": "26 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "I submitted an application, and a few days later, I was contacted by Human Resources. After a brief phone screening, face-to-face interviews were scheduled and then conducted with managers in my areas of interest that had openings. I interviewed with two managers, and both seemed interested in hiring me; though, I could only choose one of them. I accepted via phone and the manager escalated my acceptance to the powers that be. HR contacted me with a formal job offer and started the employment process, include W-4, I-9, Employee Handbook Acknowledgement, etc.", "Interview Questions": "Do you have plans to further your education?"}, {"date": "9 Jun 2015", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "After I applied online, I had a scheduled phone interview through the HR department. Then the HR department scheduled a meeting with the manager of Volunteer services. I had an interview with her and met the other members of the team. Then, shadowed for several hours on another day.", "Interview Questions": "What are some of your career goals?"}, {"date": "28 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "The interview process at St Dominic was easy. The staff at the hospital was very friendly and made me feel very welcomed to the facility. The manager was very knowledgeable and gave me a lot of insight about the hospital and the community that it serves.  I felt very positive leaving the interview and even more interested in a position at St Dominic's than before I came.  I'm excited about an employee of such an amazing place that offers so much to it's employee's", "Interview Questions": "How much nursing experience I had"}], [{"date": "5 May 2015", "title": "Student Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "The interview was very efficient and professional; however I liked that the interviewer was interested in me on a personal level. She was very personable and made me feel immediately comfortable. She asked difficult questions that challenged me and made sure that the questions made the interviewee answer transparently.", "Interview Questions": "How would you assert your credibility among the hospital staff?"}, {"date": "19 May 2015", "title": "Organizational Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "The process began with a phone interview with a recruiter.  I was told that a new Director of Organizational Development and Education would be starting work near the end of May.  The recruiter wasn't sure how they wanted to handle the interviewing process with that transition occurring and she said that she would let me know the next day.  The recruiter contacted me and arranged an interview with the current Director of Education.  I met with the Director of Education about a week after the initial phone interview.  At that time, the Director of Education told me that the next step was a presentation in front of a panel and the VP of Human Resources.  She followed up via e-mail that afternoon to arrange a time for the presentation.  The presentation that took place about a week later was given to a panel of approximately 12 people.  The panel asked questions about my presentation, my background and my resume.  After the panel interview ended, I met with the VP of Human Resources, Director of Education and the incoming Director of Organizational Development.  At the end of that meeting, I arranged to meet with the incoming Director of Organizational Development and Education for coffee the next morning.  The end of the next week, I was called by a recruiter and offered the position.", "Interview Questions": "Tell me about your experience with organizational development."}, {"date": "26 May 2015", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "The interview process went very smoothly. From the initial application to my phone interview things moved very quickly. Questions were appropriate for the PRN position available. The HR manager was very kind and personable. Their offer was in a timely manner. I felt the entire process was very professional.", "Interview Questions": "Scheduling availability"}, {"date": "28 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS) in May 2015", "Interview Descriptions": "I submitted an application online. St. D followed up with a phone interview, then scheduled me to interview with 3 different departments the following week.  These were set up in 30 minute increments, back to back.  After these interviews, human resources contacted me with any offers received by the managers I had interviewed with.", "Interview Questions": "What was I looking for from St. D as an employer?"}, {"date": "9 Mar 2015", "title": "Student Nurse Externship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at St. Dominic's", "Interview Descriptions": "The interview process was a relaxed and conversational environment. The interview only lasted about ten minutes which I thought was the perfect time.  I was able to ask questions if I had any. The interview began with \"tell me about yourself\", which makes you feel they are interested on a personal level.", "Interview Questions": "Why are you interested in St. Dominic's?"}, {"date": "3 Mar 2015", "title": "Student Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Dominic's", "Interview Descriptions": "Process was streamlined with great people working in HR.  Didn't have any trouble getting in and I really like the interviewer.  The questions asked were appropriate for the job I applied for and I had answers I thought were sufficient for the questions.  Once I had the job the further orientation was very straight and to the point with plenty of printed information to help me know what else was required of me before starting work.", "Interview Questions": "Why would you like to work at Saint Dominic's?"}, {"date": "15 Mar 2015", "title": "PRN RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Dominic's (Jackson, MS) in Mar 2015", "Interview Descriptions": "I first had a phone interview with a representative from human resources.  I then scheduled a one on one interview with the nurse manager on the floor that I was applying for employment with.  After that I was contacted and offered the position, which I accepted.", "Interview Questions": "How can I contribute to customer service expectations of the company?"}, {"date": "11 May 2015", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at St. Dominic's (Madison, MS) in Mar 2015", "Interview Descriptions": "I had a telephone interview and then a panel interview. The interview itself was pretty straight forward and the questions focused on skills related to the job. The interview panel made me feel comfortable and the entire process was efficient.", "Interview Questions": "Why should we hire you? What would make you different than other candidates we are interviewing."}, {"date": "17 Feb 2015", "title": "Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in Feb 2015", "Interview Descriptions": "After I completed the application on line. I received an e-mail letting me know I was cleared for an interview if I was still interested in the job. After I agreed to invitation, I was notified about a over the telephone interview. And after being cleared I was advised of an in person interview. Once all the interviews were done I was advised of the drug and physical test that needed to be completed, also an online application. There were appointment dates that were given to me, that I would have to be present for to complete the process. As of now I am at that point of the employment process.", "Interview Questions": "1. There is a lot of walking in the position I have applied for, how do I fell about that?\r\n2. How are my customer service skills?\r\n3. What days will I be free to work?\r\nThat is all that comes to mind at this time."}, {"date": "27 Feb 2015", "title": "MLT Core Lab Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in Feb 2015", "Interview Descriptions": "The interview was very professional and organized.  The people were just as friendly.  I really felt like they wanted to know more about me, and what I had to offer if hired for this positions.  It didn't feel like they were just going through the motions.  The questions asked were appropriate, but also opened the door to let me tell more about my abilities.   The process also reassured me that if hired, I would be proud to be working there, and would enjoy the job.", "Interview Questions": "If hired, what qualities would I bring to my position and the facility?"}], [{"date": "9 Jan 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at St. Dominic's in Jan 2015", "Interview Descriptions": "The hiring process was pretty simple. Once you went into their careers you were able to see what they had to offer. You were also able to go back at anytime to see if your application had been submitted and if it was under review.", "Interview Questions": "There were none. All the questions seemed straight forward. There were no hidden agendas in seeking employment with this company"}, {"date": "26 Jan 2015", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at St. Dominic's in Jan 2015", "Interview Descriptions": "I called the nurse recruiter, she arranged interviews, I interviewed, and she stayed in contact with me to tell me what managers were interested in me, salary and shift differences, explained certifications and the orientation process, as well as set up all physicals and informed me of all of the documents I needed in order to make the process go smoothly.", "Interview Questions": "What would I do in the case of a female patient no longer desiring medical treatment however her husband is still demanding it. "}, {"date": "26 Jan 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's in Jan 2015", "Interview Descriptions": "Initially submitted application with resume to hospital's web page. Did not receive contact, so called the recruiter & initiated interview. Spoke to Lea & she was very knowledgeable, friendly & helpful.", "Interview Questions": "N/A"}, {"date": "16 Feb 2015", "title": "Student Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at St. Dominic's (Jackson, MS) in Dec 2014", "Interview Descriptions": "Lea Young interviewed me over the phone, since I was in Georgia at the time. She was very friendly and thorough. She informed me what the interview and hiring process would look like, and then she asked me great questions about myself and my work preferences to determine if I would be a good fit for St. Dominic's.", "Interview Questions": "What are some strengths that you have noticed in yourself during your clinical experiences?"}, {"date": "1 Sept 2016", "title": "Case Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at St. Dominic's (Bronx, NY) in Dec 2014", "Interview Descriptions": "It was a group interview and afterwards was told that I got the job and proceeded to the hiring process. I filled out paperwork with Hr and submitted to all the screenings needed including medical and fingerprinting. The reference check and started within 3 to 4 week of the interview date.", "Interview Questions": "How would you manage working with a parent with mental illness?"}, {"date": "10 Dec 2014", "title": "Nurse, RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's in Nov 2014", "Interview Descriptions": "HR contacted me and did a phone interview.  They were very pleasant and easy to talk with.  The set up a personal interview with the Nurse Manager.  She was extremely nice and knowledgeable about her employees and floor.  HR stayed in constant communication throughout the process which was very comforting.  All in all, the interview process went smoothly and quickly.", "Interview Questions": "I felt all the questions were fair.  I can't think of one question being a challange to me."}, {"date": "30 Oct 2014", "title": "Dietitian, Ornish Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in Oct 2014", "Interview Descriptions": "The Human Resources Director was enthusiastic, engaging, and presented St. Dominic's as a wonderful place to work.  She made me feel at ease and asked thought provoking questions during our interview.  The Director of the Cardiac Line exhibited characteristics of a strong and capable leader.  He clearly described all aspects of the position in detail.  Anyone who has a basic understanding of how important it is to have excellent leaders would immediately want to have him as his or her boss.  I was given a tour of the facility by the Nurse Manager who was caring and kind.  She took me to the medical offices and introduced me to the Physician with whom I would be working.  The physician took time out of his busy schedule to review my resume and ask questions.  It was clear from start to finish that the St. Dominic's team is well organized and extremely professional.  I was thoroughly impressed and am excited to be joining such a dynamic team.", "Interview Questions": "If it were the case, would you be willing to accept an offer that is below your current salary?  What are your salary expectations?"}, {"date": "19 Sept 2014", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at St. Dominic's", "Interview Descriptions": "It was a pretty good interview I was nervous but they where very friendly very easy going all in all I felt very good bout the interview and hiring process.", "Interview Questions": "How do you go about stripping and waxing a floor"}, {"date": "29 Sept 2014", "title": "Part-Time Accounts Payable Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in Sept 2014", "Interview Descriptions": "Interview process was smooth, thorough and efficient with several differing points of contact.  Applied online, took personality test, submitted videos responding to questions sent to me via email, had phone interview, 1:1 interview, group interview with 7 current employees, submitted 4 references, negotiated pay rate, accepted position, orientation, physical, drug test, etc. Everyone was professional, friendly and positive.", "Interview Questions": "Don't recall any question being difficult or unexpected."}, {"date": "12 Sept 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS) in Sept 2014", "Interview Descriptions": "I was able to interview over the phone, which was perfect for me since I am not currently living in Jackson. Jodi was great throughout the entire process! Very helpful, very informative, and always available if I had any questions. The entire process was very quick and I can't complain about anything!", "Interview Questions": "Most of the questions I was asked were typical interview questions, non unexpected. \"Where do you see yourself in 5 years\" and \"what are your strengths and weaknesses\" are usually the most difficult ones to answer, but not unexpected. "}], [{"date": "21 Aug 2014", "title": "Registrar- IMG Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Dominic's (Jackson, MS) in Aug 2014", "Interview Descriptions": "I loved the questions that were asked. I was able to answer with ease. It was a very warming atmosphere, people we're great to along with. The duties involved were explained very well. Workstations were kept clean and nice.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "16 Aug 2014", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at St. Dominic's (Jackson, MS) in Aug 2014", "Interview Descriptions": "Applied online and HR called within a month for an interview.  Interviewed the next week with HR and then the rehab team, found out within a week that I was hired.  I had a good experience!", "Interview Questions": "Give an example of a time recently at your job when you went above & beyond to meet a patient's/your facility's needs"}, {"date": "19 Aug 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Dominic's in Aug 2014", "Interview Descriptions": "Interviewed with nurse recruiter at HR building with basic interview-type questions related the the position.  Then, interviewed with the DON of the department at the hospital, more-so by being given an overview of the position, a couple of get-to-know-you questions, and the opportunity to ask questions. Was shown the unit and introduced to several employees of that unit. Shadowed the unit the following day to ensure I would be interested in the job prior to potential job offer.", "Interview Questions": "How will you prove your credibility to the other staff"}, {"date": "26 Jul 2014", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Jackson, MS)", "Interview Descriptions": "Hiring and interview process was very smooth and quick.Applied for the job online and received a call about a week later. Person interviewing me was very nice and laid back.", "Interview Questions": "How would you handle employees that you necessarily don't get along with?"}, {"date": "13 Jul 2014", "title": "Department Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at St. Dominic's (Jackson, MS) in Jul 2014", "Interview Descriptions": "Phone call for interview.  Interviewed with HR & Dept. Manager.  Needed 4 business references.  Once references were contacted received another call from HR and was offered the job and was scheduled a day to come in for the 1-1/2 hour hiring process.", "Interview Questions": "There were none.  It was a thorough interview, I have been in the workforce for over 30 years, I've been asked them all, nothing surprises me."}, {"date": "21 Jul 2014", "title": "ASSDCIATE CHAPLAIN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at St. Dominic's (Jackson, MS) in Jul 2014", "Interview Descriptions": "I had 3 interviews after my initial phone call to the Department Manager. My initial interview was with the Department Manager. After a couple of weeks, I was contacted by someone in HR to schedule another interview--first, with the person in HR, and, then, with the Department. There were 7 people who greeted me and conducted a TEAM interview with me. They were all garcious and asked thought-provoking questions. I was given ample time to think and respond.  I was given feedback re: some of my answers. Near the end of the interview, I felt good about the interview because of their affirmations. I was told by the Department Director that she would  contact me by the end of the week and let me know their decision.  The same lady from HR called me 3 days later and offered me the job.", "Interview Questions": "How do you handle rejection?  "}, {"date": "11 Jun 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's", "Interview Descriptions": "I applied online and also had help from the Nurse Recruiter at the time. I was a brand new nurse with 3 months experience and they were very accepting and willing to train. They agreed to all my terms to be employed which included me working no Sundays. I was required to do a 2 step TB skin test.", "Interview Questions": "What is you greatest weakness."}, {"date": "17 Jun 2014", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Dominic's (Jackson, MS) in Jun 2014", "Interview Descriptions": "Applying for a position at St. Dominic was a smooth and efficient process.  After applying for the position the human resource department called and scheduled an appointment for an interview.  The interviews were in two seperate locations and they were easy to find locations. The interview with the Human Resource Manager was encouraging and thorough in understanding the entire process.  I was given the ability to ask questions and I was pleased and satisfied with the answers recieved. The interview with the social services supervisor was very helpful. Having the opportunity to tour the facility help ease the anxiety level.", "Interview Questions": "The most unexpected question was related to, \"How would I establish my creditability among my colleagues.\""}, {"date": "3 Jun 2014", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Dominic's", "Interview Descriptions": "The interview process was conducted easily, professionally, and all involved were cordial and willing to work with me.  Getting back in touch with the human resources department was easy and convenient.", "Interview Questions": "N/A"}, {"date": "7 Jul 2014", "title": "Nurse's Aid/Skills Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Dominic's (Madison, MS) in Jun 2014", "Interview Descriptions": "I was called soon after I applied for the job position. The scheduler made a appointment that worked on my time and gave me good directions to the office. The office staff were friendly and polite. My interviewer was informative on the job I applied for and very courteous. After discussing the position I was offered I decided it was not the best position for me. My interviewer was willing to discuss other job positions avaliable. I had also applied for a position that the company had not started interviews for yet. She kept my information from the interview and passed it on to the manager over the other position I applied for. I was called shortly after and interviewed for that job. Thanks to her my interviewing process went faster. I got the job position I wanted and higher pay.", "Interview Questions": "There were no difficult questions. Every question asked pertained to the job position. Anyone applying for that position should be able answer the questions asked with certainty. "}], [{"date": "2 Jun 2014", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Dominic's", "Interview Descriptions": "The HR department is easy to get in contact with and scheduleing was easy and flexible. The staff was very friendly and made the interview process as smooth as possible", "Interview Questions": "One difficult question they asked was how would i rate the importance of tasks given to me, which kind of threw me off."}, {"date": "29 Jun 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Dominic's in Jun 2014", "Interview Descriptions": "I Filled out the online application in the a.m. I received a phone call from the recruiter the same afternoon. The process was very fast and efficient. The staff was very courteous and helpful at all times. I was able to fill out required work forms online.", "Interview Questions": "No part was difficult and there were no unexpected questions."}, {"date": "9 Jun 2014", "title": "RN Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Dominic's (Jackson, MS) in Jun 2014", "Interview Descriptions": "I filled out an application online. Filled out a survey I received via email then I was called in for an interview with HR. A little while later I interviewed with a floor nurse and was offered the job.", "Interview Questions": "How can we make you a better nurse through hiring you to work for us ?"}, {"date": "15 Jun 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at St. Dominic's in Jun 2014", "Interview Descriptions": "My nurse recruiter Lea was very professional and gave me all the details from an HR stance on what to expect. My first interview with Lea was comfortable but professional. I was able to ask questions, and she had answers for most of them. I had a second interview with a nurse manager within two weeks, and was offered the job a few days later.", "Interview Questions": "The questions in the interview process were reasonable, and I was able to answer them with out much trouble. "}, {"date": "3 Jul 2014", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Dominic's (Jackson, MS) in Jun 2014", "Interview Descriptions": "I was contacted toward the end of last week to set up a phone interview for this Monday. The interviewer called within 5 minutes of set time. At the end of phone interview, I was asked to come in for in-person interview the following day. At the end of in-person interview, I was told I would know either way by the end of the week. The next day I was asked for my references and was told I had the position by mid-day yesterday as soon as my last reference was submitted. Everyone was very polite and professional, very comfortable atmosphere.", "Interview Questions": "Name a time you went above and beyond the expectations. It was difficult to think back to one specific time and provide a thorough answer. "}, {"date": "15 Jun 2014", "title": "Environmental Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Dominic's (Jackson, MS) in Jun 2014", "Interview Descriptions": "The Interview Process was very professional. The questions and job descriptions were clear and precise. The interviewer made me feel very comfortable during the process. She was very friendly and she made sure to respond back to me with professionalism and assurance. The hiring process did not take long at all.", "Interview Questions": "N/A"}, {"date": "28 May 2014", "title": "Patient Access Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at St. Dominic's", "Interview Descriptions": "1.Review all materials presented by the applicant. Often a resume provides more detail than an application and may highlight or contradict what is contained in the formal employment application.\r\n2.Check the internal consistency of the information.\r\n3.Be careful not to make unwarranted inferences. For example, a high school diploma is not necessarily evidence of satisfactory business writing skills.\r\n4.Sort candidates. Remember that it is almost impossible to make fine distinction between applicants on the basis of application/resume information alone, since the data on the form is limited and may be subject to distortion. At this stage of the selection process, it is best to group applicants into only a few categories such as Group A (qualified), Group B (meets minimum qualifications), and Group C does not meet qualifications. This determination is based on an evaluation of the job requirements and each applicant’s qualifications. Applicant pools are generally reviewed and interviews are scheduled\r\nThorough telephone interviewing is a speedy and effective way of screening candidates\r\nTo minimize their liability for acts of discrimination in the pre-employment selection process, employers must ensure that all questions asked of prospective employees are strictly job-related", "Interview Questions": "N/A"}, {"date": "7 Nov 2014", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at St. Dominic's (Madison, MS) in Mar 2013", "Interview Descriptions": "Interiew and hiring process was very smooth. I was interviewed and then I was given a tour of the facility. At the end of the tour, I was offered the job and then taken to be fingerprinted and drug tested.", "Interview Questions": "N/A"}, {"date": "12 Dec 2015", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at St. Dominic's (Rockland, NY) in Sept 2012", "Interview Descriptions": "You are given a sheet with scenarios on what you would do on several cases. One example is if the consider acts up before a schedule trip out, would you still allow them to go our would they stay back. The right answer is let them go. That's the weirdest strategy ever as I've learn if they just had a crisis the possibility of them acting up is more elevated, but no they are still allowed to go as the concept of rewards and consequences eludes them. This should not be the case in my opinion regardless of the severity of their intellectual disability. Anyhow, my two cents", "Interview Questions": "N/A"}]]