[[{"date": "7 Nov 2021", "title": "Clinical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellnest in Sept 2021", "Interview Descriptions": "Thorough, engaging interview process. I was interviewed by three employees. their questions were thoughtful, they truly seem to care about what they do as clinical therapists. I really enjoyed the interview process.", "Interview Questions": "Asked questions about my process as a therapist, challenging experiences as a therapist, etc. "}, {"date": "27 Feb 2021", "title": "Clinical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellnest (Los Angeles, CA) in Feb 2021", "Interview Descriptions": "Very informal! Interviewer asked straight forward questions and made best efforts to get to know me! I’d take the job if offered! Manager was professional and down to earth. Good agency!", "Interview Questions": "Reason for desiring work in employment area."}, {"date": "22 Dec 2018", "title": "Home Visitor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wellnest (Los Angeles, CA)", "Interview Descriptions": "Panel interview of two. The interview took an hour. I had to email application and degree. I also signed a application so they view my driving record. They also check where you have pervious work.  They sent me an email letting me know I didn’t get the job.", "Interview Questions": "What are your strengths?"}, {"date": "26 Dec 2018", "title": "Clinical Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellnest (Los Angeles, CA) in Jun 2018", "Interview Descriptions": "I was referred to apply to this position by a former colleague. I was interviewed by the division director and the coordinator of the division I applied for. I was notified within a week that I didn't get the position.", "Interview Questions": "What are 4 phases of treatment?"}, {"date": "28 Aug 2018", "title": "Parent Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellnest (Los Angeles, CA) in May 2018", "Interview Descriptions": "Great interview by two people. Asked me about my background and open ended questions. I was told about the benefits and what the clinic offered as an employee. They asked about my background and if I was ready to work  in a mental health agency. They informed me about the position", "Interview Questions": "What would you do in a crisis call?"}, {"date": "5 Sept 2018", "title": "Outpatient Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Wellnest in May 2017", "Interview Descriptions": "Interview lasted less than 30 minutes, and was with 2 clinical supervisors and the program manager. Questions were pretty straightforward (experience working in the community, how I felt about home visits, EBPs I’ve used).", "Interview Questions": "How comfortable are you making home visits in this community? "}, {"date": "28 Feb 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellnest in Jul 2015", "Interview Descriptions": "Telephone interview, in person interview, and on-site quiz. If you are applying for a higher level position they will also request you to take a personality quiz. All employees must submit their fingerprints for a Livescan, release driving records, and turn in TB test results.", "Interview Questions": "As though you are a fly on the wall, describe how you work in a group situation."}, {"date": "25 Jul 2015", "title": "Clinical Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellnest (South Los Angeles, CA) in May 2015", "Interview Descriptions": "Only required one in-person interview.  Interview was with a panel of 3 managers/supervisors.  Interview was somewhat informal and not too long.  They review your resume and ask questions based on what you've presented.  They discuss at length their 6 month probationary period, if you can't keep up with productivity targets during this time, there will be gloom and doom.", "Interview Questions": "What do you to manage your time when you have a lot to do?"}, {"date": "4 May 2016", "title": "Clinical Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Wellnest in Jul 2014", "Interview Descriptions": "The interview process was fairly easy. I was referred by a current employee; it seems to be the best way to get your foot in the door. The questions were fairly simple- asking about DMH experience, electronic documentation, and ability to work on call. They did not describe the details of the different departments but its fair to say there is no difference in clients just the pool they were put in. As well as the Spanish test- I was asked to speak in Spanish and then a second person called to re-test me. I am fluent speaker.", "Interview Questions": "How comfortable are you going into client homes in South Central area; low SES, maybe roach infested, etc?"}, {"date": "17 Aug 2015", "title": "Family Advocate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellnest (Los Angeles, CA) in Jun 2014", "Interview Descriptions": "met with director of the program, within 2 weeks of submitting application online. it was a one to one face to face interview. interview was \"how would you respond in this situation\" and \"how do you manage stress\". overall easily interview.", "Interview Questions": "why do you want to work here"}]]