[[{"date": "30 Dec 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Phoneton, OH) in Dec 2021", "Interview Descriptions": "it was easy and simple they were just asking abt ur expierence and they were also asking questions about pt care and what would you do in a specific situation", "Interview Questions": "what are ur stregth and weakness"}, {"date": "20 May 2021", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ascension Seton", "Interview Descriptions": "Initial phone interview with the recruiter and then an additional or second interview with the hiring manager a few days after the initial interview, it did take a few days to schedule the second interview.", "Interview Questions": "Trauma level of hospitals I’ve worked at prior."}, {"date": "6 Oct 2020", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Ascension Seton (Austin, TX) in Aug 2020", "Interview Descriptions": "30 minute phone screen with Talent Specialist. We reviewed my history and determined together that this was a job I was overqualified for, but she said she would look for other positions, talk with the hiring manager, and let me know.", "Interview Questions": "Why did you apply to this position?"}, {"date": "26 Mar 2020", "title": "Physician, Family Practice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Ascension Seton (Austin, TX) in Mar 2020", "Interview Descriptions": "Great process very welcoming. Took care of my hotel and travel. Easy going conversations, just to get to know faculty and staff.  Toured the new hospital, and clinic. Variety of different individuals came to talk to me. Gave me a great idea of the future outlook of the department.", "Interview Questions": "Relationships with current staff"}, {"date": "28 Feb 2020", "title": "RN Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton", "Interview Descriptions": "30 minutes brief conversation. Super nice and easy going. Just asked several questions about interests and why I want to go into a specific specialty.Asked about background information. Didn't take long at all. She followed up within a few days.", "Interview Questions": "Tell me about yourself?"}, {"date": "1 Mar 2020", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Ascension Seton (Austin, TX) in Feb 2020", "Interview Descriptions": "I applied to jobs online as well as attended the open house. Got called to schedule an interview a few hours after the open house. I never received a email confirmation of the interview and I did not know where to go. Contacted recruiter about this, but he was not able to help. Had to end up hunting down my interviewer at the hospital. The interview itself was good, I enjoyed the nurse manager and nurse supervisor I spoke too and really felt a connection. Unfortunately, after the interview I never heard back not even an email. Overall disheartening experience.", "Interview Questions": "What is something your old employer might say you could improve on?"}, {"date": "24 Jul 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton (Kyle, TX) in Jul 2019", "Interview Descriptions": "I was out of state so it was conducted over the phone with 2 different hiring managers. They seemed nice and asked standard questions. I then was in town so they offered a tour of the hospital and units I’d possibly work at. I was offered a position within 2 weeks. It was a fairly good process.", "Interview Questions": "When was a time everything seemed to go wrong at work? How did you handle it?"}, {"date": "27 Mar 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Ascension Seton", "Interview Descriptions": "First, I applied online. Then, I got a call from a recruiter, went to open house and then received a call about three weeks later for a panel interview. Did the panel interview at the hospital and a week later got the offer.  Over all the process has taken roughly 5 weeks.", "Interview Questions": "Name a difficult situation you have dealt with and how did you handle it with compassion?"}, {"date": "16 Mar 2019", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Austin, TX) in Mar 2019", "Interview Descriptions": "Applied online, got an email within one week asking for a phone interview, scheduled it for next day. Very straightforward interview with standard questions about my experience and plans for future. Salary expectation and what would they offer.", "Interview Questions": "Where do you see yourself in few years."}, {"date": "18 Aug 2019", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ascension Seton (Austin, TX) in Jul 2018", "Interview Descriptions": "It’s was short. They ask me about my education. They were nice and professional.  They told me about what I will be doing and the expectations of the job.", "Interview Questions": "Where do you see yourself in 10 years"}], [{"date": "15 May 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton in Mar 2018", "Interview Descriptions": "Open interview with multiple people to ask questions. Administration was involved to help guide the staff through their questioning. Interview took roughly two hours with all parties involved. The management was very engaged, and seemed eager to find the right new member for their team.", "Interview Questions": "What are your goals and aspirations?"}, {"date": "8 Feb 2018", "title": "Certified Nursing Assistant I & II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton", "Interview Descriptions": "Received an email asking me to set up an interview after uploading resume,  cl and references and applying through company site. Set up an initial phone interview, pre-screen, and was contacted the day/time of. It lasted about 30 minutes total and the recruiter was pleasant. I asked a bevy of questions (be wary of asking about pay rate) and ultimately realized it didn't have favorable hours or pay.", "Interview Questions": "Describe an experience that was difficult within a team environment?"}, {"date": "7 Aug 2018", "title": "Registered Nurse IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ascension Seton (Austin, TX) in Feb 2018", "Interview Descriptions": "Met one on one with the nursing supervisor. Interview was laid back and casual, we almost forgot to do the actual interview questions! After the questions we walked around the department while the nursing supervisor went over what a typical day looked like. I met with the department manager and the other nurses, the got a tour of the hospital.", "Interview Questions": "What separates you from other candidates in your field? "}, {"date": "14 Feb 2018", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton (Austin, TX) in Feb 2018", "Interview Descriptions": "A phone interview followed by a group interview. They asked a few questions as a get to know you better. Then asked situational questions to know skills and abilities.", "Interview Questions": "Behavioral Questions that detailed how one responds to certain situations. "}, {"date": "9 Jan 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Ascension Seton (Round Rock, TX) in Nov 2017", "Interview Descriptions": "This was a phone interview after i attended their in person open house in Austin for new graduates. I was contacted by human resources that a manager wanted to set up an interview with me. I accepted and then had a phone interview ten days later.", "Interview Questions": "Why do you want to work for Seton?"}, {"date": "29 Oct 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton in Oct 2017", "Interview Descriptions": "Upon arrival I was greeted by the manager awesome person. Very open and friendly, asked a few questions. She explained the hiring process, gave examples of work days. Was done within 20 minutes got a great vibe from the manager.", "Interview Questions": "If I call your previous employer what would they say about you?"}, {"date": "12 Sept 2017", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ascension Seton", "Interview Descriptions": "30 min phone screening from recruiter \n60 min in person/ tour of facility interview \nOffer that day from one floor and still haven't received Decision from another floor one week later\n\nInterviewed for 2 floors", "Interview Questions": "Tell me about a time poor communication effected your job"}, {"date": "10 Sept 2017", "title": "Staff Sonographer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Austin, TX) in Aug 2017", "Interview Descriptions": "The only interview I did with them was for screening.  It was obvious that the person conducting the interview was reading from a script.  When I asked questions, most were answered saying that if I were selected for a site interview I could ask them then.", "Interview Questions": "What are your qualifications for the job you are applying for?"}, {"date": "17 Jun 2017", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton", "Interview Descriptions": "I had a good interview toured the hospital.... my nurse manager was great and very personable.... the negative about working for Seton is being made to feel inferior to nurses... if it were not for techs nurses would be lost", "Interview Questions": "N/A"}, {"date": "5 Jun 2017", "title": "OR Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "There was a phone interview approximately 1 week after I submitted the application and an in person interview approximately 2 weeks after the phone interview. The phone screen was focused on the mission and values of Seton with some personality questions, while the in person was more job description related questions.", "Interview Questions": "What do you value in an employer?"}], [{"date": "10 Apr 2017", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton", "Interview Descriptions": "Taken a long time to get back to me. Initial phone interview, interview with a recruiter, then interview with hiring managers. Still have yet to hear back from the managers as they have explained \"they have a lot of applicants\"", "Interview Questions": "Where I would like to be in 5 years"}, {"date": "21 Jun 2017", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Telephone, TX) in Apr 2017", "Interview Descriptions": "It was a brief introduction session to know about my qualifications and what all i knew about the company. it was a telephonic interview. The interviewer was very cooperative and understanding.", "Interview Questions": "Tell me about yourself"}, {"date": "15 Mar 2017", "title": "Internal Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Ascension Seton", "Interview Descriptions": "I was emailed by a recruiter to click on a link to set up a time for a phone interview.  I set up a time, and waited for the call.  The recruiter called me about 20 minutes after the time we set saying she would not be able to make it that day and wanted to reschedule.  We decided on another time a few days later.  Again, I waited (30 minutes this time), and never received a call.  Very unprofessional as a recruiter.  Disappointed that they do not value applicants time.", "Interview Questions": "The recruiter never called me after two attempts at setting up a time to interview."}, {"date": "16 Mar 2017", "title": "CA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Ascension Seton", "Interview Descriptions": "Process took 2 wks from talking to recruiter to offer. The interview was panel style with 3 people. They were very friendly and willing to answer my questions. The recruiter did like a first interview.", "Interview Questions": "Can you tell us about a time that you had to deal with a difficult situation?"}, {"date": "8 Mar 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ascension Seton", "Interview Descriptions": "It was a phone interview, the girl was very friendly and laid-back. After applying to a position online I received an email to schedule a phone interview. I have not received a call back and its been about two weeks, however, when I view my job submission online it states that my application is still under review.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "23 May 2017", "title": "Clinical Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton (Austin, TX) in Mar 2017", "Interview Descriptions": "I applied online. I was e-mailed and asked to set up a phone interview with a recruiter. The recruiter called the second the clock hit 2:00. After that, I was e-mailed by three or four department managers/hiring managers about interviews since I applied to numerous jobs and was being 'actively considered' on my application page for more than a few of them. I am in a different state and asked to be interviewed via Skype which they had no issue with. I was extended an offer the next day.", "Interview Questions": "As a faith based hospital, we put a lot of emphasis on helping the underserved population and taking care of patients regardless of their ability to pay. How do you feel about this core value?"}, {"date": "4 Feb 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Ascension Seton", "Interview Descriptions": "Easy. but you had to continue to call or email because the process is already really long and if you don't follow up its almost like they forget about you", "Interview Questions": "Why do you want to work here? how long have you been working as an MA"}, {"date": "28 Sept 2017", "title": "Registered Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Ascension Seton in Dec 2016", "Interview Descriptions": "Group interview with nursing leadership, direct questions about nursing specialty knowledge. Relaxed atmosphere, staff was eager to come across as pleasant to work with. Toured the unit, wear comfortable shoes.", "Interview Questions": "Why do you want to work in this specialty?"}, {"date": "26 Oct 2016", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Ascension Seton in Oct 2016", "Interview Descriptions": "First you apply for the residency where you pick 3 top areas you're interested in and the facilities you're interested in. Then you can register for the career fair where you meet with hiring managers, clinical managers of several units throughout the system. Then you get a phone interview which asked 3 situational questions (difficult patient or colleague how did you deal?, safety issue, how did you deal?, communication issue with a colleague how did you deal). Then you get to apply to specific units, and get contacted by hiring managers to schedule in person interviews. I am in the process of applying to specific units.", "Interview Questions": "Describe a situation with a person, patient, colleague who was different than you were? How did you deal with the situation?"}, {"date": "19 Sept 2016", "title": "Documentation Capture Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "The interview was very professional.  I didn't feel rushed, I was given the opportunity to ask any questions or state any concerns, in which were professionally and honestly answered. Overall, it went very well.", "Interview Questions": "Do you like or need to receive feedback from supervisor or manager and if so, how often? "}], [{"date": "26 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ascension Seton (Austin, TX) in Sept 2016", "Interview Descriptions": "After introductions, staff from hiring area asked questions were related to specific specialty experience.  DON present for a short time.  Very casual and friendly. Staff were focused on fit for their unit culture.", "Interview Questions": "Normal questions about why applying, describe a time when you had to handle a conflict in your area, what was a challenging day like, what are you most proud of when looking back at your care given to your patients"}, {"date": "25 Apr 2018", "title": "Biospecimen Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ascension Seton (Austin, TX) in Sept 2016", "Interview Descriptions": "Concise and friendly, I was involved in showing the lab and the intricate process of preparing the tissue  for processing.  I was shown embedding and microtomy, staining the tissue and preparing the microscope slide for the pathologist.", "Interview Questions": "What hours  I could work,"}, {"date": "24 Aug 2016", "title": "Language Assistance Interpreter Senior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "Online application. Phone call from depth. manager; we spoke about interest in position, our mutual interest in the field, mutual expectations about the role. Scheduled formal interview.\r\n\r\nInterview long and in depth. 2 hours+. Extensive testing of both languages in Healthcare setting. Vocabulary testing of both languages. Testing of role of interpreter, ethics, standards, laws.\r\n\r\nHeard back with offer quickly. Negotiation with HR took much longer. Background check also took time. Definitely want to have job lined up before moving on from somewhere else.", "Interview Questions": "How would you deal with a coworker telling you that you did your job incorrectly?"}, {"date": "31 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ascension Seton", "Interview Descriptions": "Friendly supervisor but slow and cumbersome application process had to talk to parent company to get help with site . Took a while to get a call back. Had several interviews with multiple people. Very slow process.", "Interview Questions": "tell me about yourself"}, {"date": "4 Oct 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Ascension Seton (Austin, TX) in Aug 2016", "Interview Descriptions": "I applied online, and was called in for an interview about two weeks later. My interview was a panel style interview with my future supervisor and her assistant. They asked me several questions about my education and previous work experience and skill level. I described my goals and reasons for wanting to hold a job with the organization, as well as my thoughts on the mission statement and the importance it holds. We finished the interview with a brief tour of the facility.", "Interview Questions": "When was a time you had a conflict during a past work experience and how did you resolve it?"}, {"date": "9 Jul 2016", "title": "Patient Access Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "Submitted an application via their online portal which was extremely use me friendly. Two weeks later I received a call from the department supervisor requesting a phone interview. A second interview followed a week after the phone interview. A verbal offer was made a few days after the second interview.", "Interview Questions": "What sets you apart from other candidates?"}, {"date": "9 Jun 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "2 interviews.  Friendly, but research your job responsibilities and know what you are applying for.  Answer the questions.  The process was one that I found challenging, but I felt prepared for.  Since then I have been in on the interview process and am surprised at how many people are not prepared.  Always as questions also.  Do your homework!", "Interview Questions": "What are my strengths"}, {"date": "4 Aug 2016", "title": "PRN Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ascension Seton (Austin, TX) in May 2016", "Interview Descriptions": "Interview was smooth and went great. I was interviewed one on one and was asked about 10 questions before learning about the position. Staff greeted me and was very friendly throughout the entire process. Flexible work hours (as with PRN) and the interviewer made sure to clear any clarifications needed.", "Interview Questions": "Describe a situation in which you had a difficult problem and had to navigate it thinking of all possible options"}, {"date": "23 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Ascension Seton", "Interview Descriptions": "Why do you want to work in healthcare? What drew you to nursing? Where do you see yourself in 5 years? Why did you leave your last job? Explain a difficult experience with a coworker and how did you solve it?", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "9 Mar 2016", "title": "MLS II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ascension Seton", "Interview Descriptions": "Took 2 months from the time I applied to getting a call to interview.  Interview was in person and more of a casual conversation with technical questions thrown in.  The offer came about 1 week later.", "Interview Questions": "Mostly we just discussed how we did things at a previous job and how they do things here, and about the importance of this team being a family."}], [{"date": "27 Oct 2017", "title": "Clinical Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Ascension Seton (Austin, TX) in Mar 2016", "Interview Descriptions": "Went smoothly, interview manager made you feel at home. They are definitely willing to work with you if you're still going to school. They explain the pros and the cons of working there.", "Interview Questions": "What would you do in a stressful situation?"}, {"date": "30 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Ascension Seton (Austin, TX) in Mar 2016", "Interview Descriptions": "Most of the intern interview pfocess was for my preceptor to get to know me. I was longer than necessary, I guess to ensure I was placed somewhere I was happy and would not wish to transition out of later.", "Interview Questions": "What are your top thre interests in healthcare admin?\r\nDo you have in quality improvmnet or project managment experience?"}, {"date": "8 Jan 2016", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton", "Interview Descriptions": "5 minute telephone interview with Director and hopefully leads to a panel interview with your future coworkers. I chat up the department assistant you will be surprised Directors trust and talk to there assistants a lot on there opinion of the interviewers.", "Interview Questions": "Mine was non-clinical so question were more my experience level with MS Office and data gathering experience."}, {"date": "22 Feb 2016", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ascension Seton (Austin, TX) in Nov 2015", "Interview Descriptions": "HR and the manager of the unit interviewed me for 30min about 2 weeks after I applied online. I got an email saying I got the job and I had to send lots of info through email and take a certain cpr class. Then I had to go to a presentation then an orientation for about a month. After that I trained with someone on my floor various hours for another month.", "Interview Questions": "Why do you want to work here"}, {"date": "24 Aug 2017", "title": "Language Assistant Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Austin, TX) in Oct 2015", "Interview Descriptions": "Phone interview followed by formal 2+ hour interview which included language assesment. Hiring manager was courteous and professional. Honest about scope of job responsibilities and expectations. Wanted to know what my expectations were as an individual and as a team. Seemed genuinely interested in my wants, needs, expectations.", "Interview Questions": "What would you do if a physician demanded you do something outside the role of a medical interpreter?"}, {"date": "15 Sept 2015", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton in Sept 2015", "Interview Descriptions": "I filled out an application and 2weeks later I followed up with the hospital and they set me up to come in and do an interview. I was also given another interview", "Interview Questions": "Why do you want to work for Seton?"}, {"date": "24 Nov 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ascension Seton (Austin, TX) in Sept 2015", "Interview Descriptions": "Asked me why I wanted to be a nurse, what I saw myself doing in a few years, critical thinking questions, prioritization question, they asked me about myself, offered me a tour, and told me about the hospital.", "Interview Questions": "Tell me about yourself?"}, {"date": "17 Aug 2015", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton in Aug 2015", "Interview Descriptions": "I applied June 30th for numerous positions online. Their application process is pretty easy since you can apply for more than one position at a time. I receive emails for positions I didn't get. I'm currently waiting to hear back from the 2nd interview I've had with Seton.", "Interview Questions": "What is one of the most stressful situations you&#039;ve been in at work and what did you do?"}, {"date": "21 Jul 2015", "title": "Physical Therapist Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton", "Interview Descriptions": "Began with a phone interview to discuss what you are looking for, then had an in person interview with the manager, the senior PTA, and the supervising PT, and a walk through of the hospital. I wouldn't call it laid back, I felt they were drilling me in a way of convincing me not to work there. They kept saying how stressful the job was.", "Interview Questions": "Strengths, weaknesses, experience, why I wanted to work there, etc..."}, {"date": "6 Nov 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ascension Seton (Austin, TX) in Jul 2015", "Interview Descriptions": "Sat down with 3 nurse managers. Very friendly. Very laidback. Showed me the unit before. Allowed me to talk to nurses on the floor if I wanted to. Gave me an offer shortly after the interview.", "Interview Questions": "What is an example of when you had difficulty with a co-worker and what did you do?"}], [{"date": "11 Aug 2015", "title": "Project Manager I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ascension Seton (Austin, TX) in Jul 2015", "Interview Descriptions": "Apply online via job portal.  Contacted next day by hiring manager.  Interviewed following day - 30 minutes with hiring director and project team lead.  It was a brief discussion regarding previous work at Seton and connections within the system.  It was very pleasant.  I replied with a thank you email to the hiring manager.  Received notice that I was not selected for the position.  Requested and received feedback for future interviews.", "Interview Questions": "Tell me about a time where you were wrong and how you dealt with the situation."}, {"date": "2 Dec 2015", "title": "Account Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ascension Seton (Austin, TX) in Jun 2015", "Interview Descriptions": "Applied online through portal. Initial phone interview with the hiring manager - basic resume questions. Group panel interview with department managers - easy flow of conversation. Interviewed with the VP of department - overview of expanding department and role. Final interview was with the President/ CEO of a service line - no basic interview questions, needed to describe past strategies and business development. \n\nNegotiated salary. \n\n2 week wait for extensive background check and health screening. \n\nOverall process took 1 1/2 months", "Interview Questions": "Why are you looking for a change? And, what contributions do you think you could make to the team and department?"}, {"date": "9 Aug 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Ascension Seton (Austin, TX) in Jun 2015", "Interview Descriptions": "Went for first interview, it was short and sweet. Got called for second interview with a panel of 3 people, a lead, superiorvisor, and manager, it was simple, same questions.", "Interview Questions": "Name a time when. . ."}, {"date": "6 May 2015", "title": "RN L Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton", "Interview Descriptions": "Interviewed by 4 nurse managers in conference room. I was asked multiple questions on Seton Healthcare's core values: Dedication, Reverence, Wisdom, Integrity, Service to the poor, Creativity. Very professional and welcoming", "Interview Questions": "Which core value of Seton's sticks out to you, and why?"}, {"date": "11 Jun 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ascension Seton (Austin, TX) in May 2015", "Interview Descriptions": "Its not too hard, but there are over 100 applicants for 5 positions. The people that interview you are generally very nice. Specific directors look applicants that would fit well in their department and then recruit them through HR. So your first interview will be with HR and the second (hopefully) will be with the department director.", "Interview Questions": "Experiences in which you were in a tough situation and how you resolved the issue?"}, {"date": "17 Apr 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ascension Seton (Round Rock, TX) in Apr 2015", "Interview Descriptions": "Online process delays hiring.  After you apply online they do update your status frequently so you know if you weren't selected for the position. You can apply for multiple positions at once. Recruiter contacts you for the interview which is conducted by the department manager. Then human resources makes the offer.", "Interview Questions": "When was the last time you were criticized?"}, {"date": "25 Nov 2015", "title": "RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ascension Seton in Apr 2015", "Interview Descriptions": "Interview was done over Skype. Heard back from both positions within a few days of interview. The HR representative was very helpful throughout the process with relocation questions and when I needed to adjust my start date.", "Interview Questions": "What qualities do you want in a manager?"}, {"date": "21 Jun 2015", "title": "Program Manager II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Ascension Seton (Austin, TX) in Mar 2015", "Interview Descriptions": "Had phone screen and then came in for an interview.  Had second interview about 2 months later.  The first interview was pretty standard review of experience and skills but I liked that they were not overly tied to the interview form and let the conversation naturally evolved rather than just fire question after another with no regard to what had previously been said.", "Interview Questions": "What do you know about Seton's mission?"}, {"date": "21 Oct 2015", "title": "Case Management Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ascension Seton in Mar 2015", "Interview Descriptions": "Applied online, scheduled interview a day later. Interviewed at Seton Healthcare Network. Room was difficult to find, and parking was quite scarce. Bring money to feed the meter or pay the garage fee.", "Interview Questions": "How do you prioritize your time?"}, {"date": "30 Jan 2017", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Ascension Seton (Austin, TX) in Mar 2015", "Interview Descriptions": "Brief, professional, to the point, non-discriminatory, genuine, convenient, accommodating, friendly, day time hours, no weekends, no frills, competitive benefits and wages, here are some more words for your quota on the interview process", "Interview Questions": "generic"}], [{"date": "28 Dec 2014", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton", "Interview Descriptions": "I was initially contacted for a phone interview in which the department supervisor \"filled me in\" on what the job entailed. If the supervisor believes you are a good fit for the department, he/she will schedule an in-person interview. The interview will then consist of a set of questions:\r\n1. How do you communicate with your supervisor?\r\n2. How do you handle stress?\r\n3. How do you handle conflict?\r\n4. Tell me about an example of when you did not agree with department policy?\r\n5. Describe an incident in which you went above and beyond of what was required.\r\nI interviewed at different sites and found the questions to be the same.", "Interview Questions": "Tell me about a time you made a mistake and what did you do to fix it."}, {"date": "7 Nov 2016", "title": "Par Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ascension Seton in Jan 2015", "Interview Descriptions": "Interview with Supervisor and Manager of the Department. A couple of days later i received a call extending the job offer with salary from Human Resources. Once accepted I then set up my health screen with the Health department.", "Interview Questions": "Why would this be a good fit for you?"}, {"date": "24 Dec 2014", "title": "Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Ascension Seton", "Interview Descriptions": "I applied online and the hiring manager contacted me directly. the phone interview takes around 30 mins.They value candidate's healthcare background very much.I got the result from hiring manager 5 days later.", "Interview Questions": "very easy interview, straight forward questions. "}, {"date": "5 Dec 2014", "title": "Graduate Nurse/OR RN I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ascension Seton (Austin, TX) in Nov 2014", "Interview Descriptions": "Systemic questions were asked from a paper. These made every applicant equal and made the playing field fair. They asked about where I saw myself in 5 years, a difficult situation that I had in the clinical setting and how I handled it.", "Interview Questions": "Please list 3 words that describe yourself."}, {"date": "24 Nov 2014", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Austin, TX) in Oct 2014", "Interview Descriptions": "I recently interviewed one on one with the Department head. The interview was very casual, asked the normal expected interview questions. I was in the interview for about 10 minutes and was told they have two more weeks of interviews, then they would be back in touch.", "Interview Questions": "Weaknesses"}, {"date": "12 Sept 2014", "title": "Residency Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "I applied and was given an initial phone interview within about 2 weeks.  That went well and was followed up with a one-on-one interview which also went great and was told their would be a third round with a group of doctors.  Within about another week that interview was set up and again went great.  Each time nobody offered or gave business cards so I was at the mercy of the admin who attempted (poorly at that) to help.  No communication from anyone after that third interview.  Here I am have wasted a crap load of hours for their THREE interviews and they don't even have the courtesy to call or at least email me to say thanks but no thanks.  Seriously unprofessional residency program.", "Interview Questions": "None really, they were all pretty typical. "}, {"date": "1 Feb 2016", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ascension Seton in Sept 2014", "Interview Descriptions": "Had an interview over the phone that lasted about 30 mins. pretty standard questions nothing too difficult. about a week later I had the in person interview, was asked a lot of questions about myself and my career aspirations. There were technical questions and the basic have you ever type questions. Overall very easy interview process.", "Interview Questions": "Have you ever worked with a team member that was not doing their job. "}, {"date": "11 Jun 2014", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ascension Seton", "Interview Descriptions": "Went to a job fair. They were pretty cool and direct. Got a call within a week and scheduled an onsite interview.  Received an offer shortly thereafter.  It took close to 2 weeks total.", "Interview Questions": "None really. Just want to see if you have what it takes to deal with various types of personalities."}, {"date": "28 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ascension Seton", "Interview Descriptions": "call, interview offer", "Interview Questions": "application on line- system is slow"}, {"date": "25 Mar 2014", "title": "Customer Service Representative Senior/Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "I met with three managers for my initial interview.  I thought it went pretty well.  They asked me a lot of questions, and I asked plenty, too.  They were easy to talk to, and my experience impressed them.  I got a phone call about four hours later with the job offer.", "Interview Questions": "This was on a questionnaire they gave me: \"What is the least amount of money (per hour) you are willing to accept?\""}], [{"date": "8 May 2018", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Ascension Seton (Austin, TX) in Mar 2014", "Interview Descriptions": "Panel interview and two followup one-on-one interviews. Excel test and technical questions. Minimal structure in non-technical questions. Slow process from application to hire. It is important to align resume wording with the job posting descriptions.", "Interview Questions": "I completed an excel test. "}, {"date": "24 Feb 2014", "title": "Pharmacy Technician I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ascension Seton", "Interview Descriptions": "Very easy interview process in that they help put you at ease and you aren't tensed about the actual interview. I received an e-mail asking when I wanted to schedule a phone interview. The phone interview in itself was very short and I wasn't asked too many questions. It was mainly a phone to ask if we can have a sit down interview with two other individuals. I had the option of another phone interview because I lived out of town; however, I chose to go in and see them. This step also did not feel like an actual interview. They asked me questions and I was able to ask them questions. However, it just felt like a couple people getting together and chatting. All in all, the interview process was very easy. I received a call that week saying that I had the job and will be called soon by someone in HR. The process was very slow after that, I think it was like two weeks before I received an official offer. That was probably the most stressful part of the recruitment process.", "Interview Questions": "N/A"}, {"date": "4 Jan 2014", "title": "Md Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ascension Seton", "Interview Descriptions": "-Friendly; very relaxed interview", "Interview Questions": "-What are some of the weaknesses you have?"}, {"date": "5 Dec 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ascension Seton (Austin, TX) in Jan 2014", "Interview Descriptions": "Panel interview with many situational questions that start with \"tell me about a time when...\" Everyone asked a different question. There were about 8 people in the room, managers and staff memebers alike.", "Interview Questions": "Tell me about a conflict you had with someone at work. How did you handle it?"}, {"date": "9 Dec 2013", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton", "Interview Descriptions": "Phone interview then in person interview with nurse manager also joined in interview by one of the floor charge nurses", "Interview Questions": "No unexpected questions, very typical, examples of how you deal with difficult co-worker, most difficult patient, what good or bad things to you bring"}, {"date": "5 Dec 2013", "title": "Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "I have gone on two interviews with Seton for a social worker position. Both times I applied online and was contacted about 2-4 weeks later. In the first interview it was very informal. I really enjoyed the supervisor and felt it would be a great position for me. I wasn't offered that position which was disappointing but overall it was ok as it wasn't the perfect fit for me. The second time I interviewed was with two women and it was more formal with formal questions. This job was definitely not the right fit for me and I think everyone in the room knew it. I was not surprised or disappointed that I wasn't offered that position. Overall, the interviews were ok and the questions were normal, especially with the second interview. The first interview was just asking me about myself and then it felt like it was turning it over to me to ask questions. \r\n\r\nI emailed after the first interview to give a thank you and heard back stating I wasn't picked. After the 2nd interview for a different position I didn't email or get business cards and never heard back.", "Interview Questions": "N/A"}, {"date": "10 Oct 2013", "title": "Monitor Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ascension Seton (Austin, TX) in Jul 2013", "Interview Descriptions": "My intial interview communicaions are very good, I am comfortable with the interview invironment as well as the interview environment, I am gifted with  the talent for \"disernment\" as I am able to sense the types of personality and culture of people right off the bat.", "Interview Questions": "When have you ever been faced with a confrontational experience with another employee; how did you handle this and what was the outcome?"}, {"date": "4 Nov 2017", "title": "Senior LVN II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton (Moss Beach, CA) in Jun 2013", "Interview Descriptions": "It was a very easy process. I applied online, then received a call from an HR recruiter a few days later. I was called to interview with the Director of Nursing. Actually, it was too easy, which should have been a red flag for me. The Director of Nursing interviewed me. She looked over my accomplishments, job experience, and the skills I had which would benefit the position. She asked a few questions about myself, and my willingness to work overtime (another red flag). After the DON offered me the job I received a letter in writing from the HR recruiter, then started offsite New Employee Orientation.\r\nThe overall experience was very easy and the company was very transparent about the process (until they screwed up my pay, see below).", "Interview Questions": "Are you willing to work some overtime?"}, {"date": "7 May 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Ascension Seton (Austin, TX) in Apr 2013", "Interview Descriptions": "Was years ago but it was a panel interview process, met with manager and then sat before a panel of 4 people, 3 staff people and 1 manager from a different unit. They now just have the unit manager and a stff supervisor do it", "Interview Questions": "Why do you want to work at this specific facility"}, {"date": "2 Oct 2017", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at Ascension Seton (Austin, TX) in Feb 2013", "Interview Descriptions": "This interview was done long ago, so I do not remember many details. From what I remember the people were very friendly and interested in not so much all my qualifications but my desire to grow and ability for development.", "Interview Questions": "Tell me about yourself?"}], [{"date": "30 Aug 2017", "title": "Lcsw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Ascension Seton (Austin, TX) in Feb 2013", "Interview Descriptions": "sitting down with manager and being asked questions.  They mainly care about post liscensure experience.  Also previous hospital exerpience helps.  There are a lot of seton clinics and being familiar with them helps as well.", "Interview Questions": "what is your POST license experience?  "}, {"date": "17 Oct 2012", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Ascension Seton (Austin, TX)", "Interview Descriptions": "Initial communication was via email.  Face to face was a group interview.  Escorted into a room with 4 or 5 other Social Workers or Managers and responded to questions ranging from previous work experience to situation that might come up in the work place and how I would respond to them.", "Interview Questions": "If a client you were working with became violent or aggressive, how would you respond and what would be the first thing you would do?"}, {"date": "25 Aug 2016", "title": "PNP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ascension Seton (Austin, TX) in Apr 2012", "Interview Descriptions": "Very casual sit down with MD and NP; easy questions, non situational, non behavioral - asked personal questions; asked about prior experience; asked where I saw myself in 5 years by one surgeon; the other surgeon detailed their vision of healthcare and their role in it; a third surgeon told me i should ask why others left; toured hospital; manager very scatter brained and disorganized, poor leadership", "Interview Questions": "N/A"}, {"date": "10 Apr 2013", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Ascension Seton (Austin, TX) in Apr 2012", "Interview Descriptions": "The hiring and interview process were fantastic.  Simple panel interview ranging from peer to Senior Management.  All of the scheduling arrangements, employment negotiations, and job offer is managed wonderfully by a single recruitment specialist.", "Interview Questions": "\"Tell us why you want to work for Seton Medical Center?\"\r\nThis was quite an unexpected question, I thought because I was being recruited from a competing hospital and not actively seeking a change in employment.  Outside of this, the questions were SO VERY BASIC that someone with zero interview experience could have made a fantastic impression and sold themselves"}, {"date": "19 Jul 2016", "title": "RN-BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ascension Seton (Austin, TX) in Mar 2012", "Interview Descriptions": "Very nice and professional, asked what my goals were & what I could contribute to Dell. I was able to interview with the director, manager and a staff nurse who were very honest in their answers describing the reasons it was a great place to work along with the challenges working in a pediatric population.", "Interview Questions": "Reason why I would like to work at DELL"}, {"date": "31 May 2012", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Ascension Seton (Austin, TX) in Sept 2011", "Interview Descriptions": "The interview process was crisp and to the point. I was asked about my experience in the medical field, long term goals, and how this position fit into my long-term goals.", "Interview Questions": "Why do you feel that you are a good fit for this position?"}, {"date": "13 Nov 2015", "title": "Patient Access Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ascension Seton (Austin, TX) in Aug 2011", "Interview Descriptions": "I was granted an interview through an employee referral. I received an initial call to set up the interview. At the interview there were two managers. One manager did most of the speaking while the other chimed in at times. After the interview I received a call the next day offering the position.", "Interview Questions": "How did you deal with a difficult patient/customer?"}, {"date": "5 Jul 2015", "title": "Charge Capture Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Ascension Seton (Austin, TX) in May 2011", "Interview Descriptions": "Manager introduced herself and Trainer introduced himself and his job responsibilities. Explanation on job duties and what was expected of the applicant if hired.  Then they asked me about  my experience pertaining to this charge captured analyst job.", "Interview Questions": "What would you do if you were finished with with your duties at the end of the day and a nurse brought you charges that needed to be entered right now. That is my job to enter the charges."}, {"date": "15 Apr 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Ascension Seton (Austin, TX) in Oct 2010", "Interview Descriptions": "The interview itself was straightforward; what was difficult was obtaining an interview. I applied many times through the online process and went to a meet and greet (with many, many others) and never received any calls or feedback. I was finally successful in obtaining an interview by getting to know an employee who worked in the department I wanted to be in and who was willing to refer me to the department manager.\r\n\r\nShort answer: You best chance to get an interview may be by obtaining and/or leveraging personal contacts.", "Interview Questions": "Why would you like to work in this department?"}, {"date": "20 Sept 2011", "title": "Healthcare Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Ascension Seton (Austin, TX) in May 2010", "Interview Descriptions": "I had applied to the Seton hospital a number of time because there were many jobs posted on the website that were of interest to me and that fit my skill set.  I never received a call back or rejection letter.", "Interview Questions": "Why do you want to work with us? "}], [{"date": "28 Feb 2010", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton (Austin, TX) in Feb 2010", "Interview Descriptions": "Applied online via company's website for employment.  Within 24 hours, contacted by hiring manager for brief phone interview, set an interview 1:1 with hiring manager.  Met with hiring manager and was asked fairly detailed questions on compliance, utilization review, discharge planning and status determination.  Hiring manager invited me back for an interview with the team and suggested I have more detailed answers before meeting.  Research online and team meeting/interview is within 48 hours.", "Interview Questions": "What can you tell me about your knowledge of case management?"}, {"date": "13 Jul 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ascension Seton in Sept 2009", "Interview Descriptions": "Relaxed interview with hiring manager. Easy to engage in conversation. Did not ask the awkward questions of \"tell me about your strengths and weaknesses.\" Need to come prepared with why you want the job, what you can offer the company.", "Interview Questions": "Are you more of a leader or a follower?"}, {"date": "3 Jun 2009", "title": "File Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Ascension Seton (Daly City, CA) in Apr 2009", "Interview Descriptions": "they called asked for a phone interview and then if you passed that you are called in for a face to face interview then after they call you back in a week to let you know if you receive the job", "Interview Questions": "what were your previous responsibilities "}]]