[[{"date": "9 Oct 2019", "title": "Bookstore Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maine System", "Interview Descriptions": "I normally don't give feedback to places I have applied for but this process was so slow. They posted the job in August of 2019. I applied and it took over a month before I heard anything back. I was scheduled an interview and then they didn't let me know until a month later if I was hired or not. I understand it takes time but people can't wait for little over two months for hiring. The process was too slow and not very professional for a college.", "Interview Questions": "The interview was great and professional. Just not a fan of how long it took for them to get back to me. "}, {"date": "6 Feb 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Maine System", "Interview Descriptions": "GSBSE interview spans five campuses, allowing you to see and meet a number of different types of environments. Mentally exhausting but fun to see the state that way. Some of the sites do one on one interviews with prospective PIs while others do group or 2:1.", "Interview Questions": "Why did you choose the GSBSE program?"}, {"date": "17 Sept 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maine System (Orono, ME) in Sept 2015", "Interview Descriptions": "Very casual - went in and talked with people in management to quickly go over job details and my experiences. Interview ended with an offer. This is pretty typical of low-level student positions; people are just happy to get the help, and as long as your pleasant and flexible, you'll do fine.", "Interview Questions": "What is your schedule? What is your availability to work? What can you do?"}, {"date": "23 Feb 2017", "title": "IT Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Maine System in Jan 2014", "Interview Descriptions": "Mostly just asked questions to get to know my people skills along with some technical questions pertaining to the job requirements. They are quick with getting back to you, but only if they are interested.", "Interview Questions": "What type of server experience do you have?"}, {"date": "22 Jun 2017", "title": "Administrative Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Maine System (Orono, ME) in Oct 2013", "Interview Descriptions": "It was a group interview, asked us questions about work environment, dress-code, previous experience, etc. I was able to be hired right on the spot. Was not intimidating, everyone was very nice and friendly.", "Interview Questions": "Have you had any previous experience working with Microsoft Office products? "}, {"date": "24 Apr 2015", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Maine System (Orono, ME) in Apr 2012", "Interview Descriptions": "The interview takes place before you're enrolled in the semester-long training class. The interview requires a writing sample (fiction or non-fiction), a standing of sophomore or higher and a recommendation from a previous professor.", "Interview Questions": "Why do you think you will do well in this role?"}, {"date": "5 Nov 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maine System (Orono, ME) in Mar 2012", "Interview Descriptions": "Spoke with company representatives at college career fair, was told to apply online.  Applied online.  Shortly after received invitation for an interview.  Was told one name who I would be interviewing with, but actually had panel interview.   Received offer about a month and a half later.", "Interview Questions": "In what way do you think your skills could be used to solve specific engineering problems."}, {"date": "26 Oct 2015", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maine System (Orono, ME) in Aug 2011", "Interview Descriptions": "Very brief, they checked to see if I had a pulse, asked if I understood how to turn on  a computer, any knowledge of Windows,  extremely basic but that's the role for a student.", "Interview Questions": "What would you do if the computer could boot?"}, {"date": "14 Apr 2014", "title": "Cluster Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Maine System (Orono, ME) in Apr 2011", "Interview Descriptions": "I was a student at UMO at the time, so I was actually good friends with the person who was conducting interviews. Even though I had this connection, he still interviewed me like everyone else. This illustrates the fairness in UMO's IT hiring process. They got back to me relatively quickly, which is always a plus.", "Interview Questions": "N/A"}, {"date": "27 Apr 2013", "title": "Structural Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Maine System (Orono, ME) in Feb 2011", "Interview Descriptions": "A phone screening and then a final interview with the hiring manager. He explained about the research projects carried out at the composites center and mostly briefed the responsibilities the job requires.", "Interview Questions": "How do you deal with stress? "}], [{"date": "18 May 2012", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maine System (Orono, ME) in Jan 2010", "Interview Descriptions": "pretty well . great", "Interview Questions": "how old are you"}]]