[[{"date": "8 Feb 2023", "title": "Service Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of La Verne", "Interview Descriptions": "Professional and comforting. The staff and bosses would ask questions that were not only about the title and service but about character. It was still daunting but not impossible in terms of answering.", "Interview Questions": "When was there a time when you used the principles of your work in action?"}, {"date": "14 Sept 2022", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of La Verne", "Interview Descriptions": "Four rounds of interviews, including one panel interview, for the position I was eventually offered. The process took over a month. Two rounds of interviews for other positions for which I was not selected. ", "Interview Questions": "“Why the University of La Verne?” was asked in three of the four rounds of interviews for this position and in every other interview I had for other jobs at the University as well. "}, {"date": "13 May 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of La Verne", "Interview Descriptions": "Very smooth and the team made me feel very comfortable. The interview panel seemed knowledgeable about my resume, which I appreciated because I felt they already had a basic overview of my previous experience.", "Interview Questions": "They asked quite a few questions about my background and work history - I found the questions normal and did not feel as if they were trying to fit in trick questions."}, {"date": "13 Nov 2021", "title": "Retail Sales Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of La Verne", "Interview Descriptions": "Great very understanding questions was clear and tone was great very easy to hear and stay focus learned a lot about the company and why it would be a great opportunity for me", "Interview Questions": "What are my strengths and weaknesses "}, {"date": "27 Nov 2019", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of La Verne", "Interview Descriptions": "standard interview with about 45 minutes Q and A and a tour of the facilty.  Presented my portfolio an talked about what I had done and my education.  Reviewed job requirements and presented an offer and negotiated duties.", "Interview Questions": "What are your strenghts?"}, {"date": "30 Apr 2019", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of La Verne (La Verne, CA) in Mar 2019", "Interview Descriptions": "The first step was a phone call with an HR representative that felt more like a, \"Let me tell you about all the great reasons you should come to work for us!\" versus an actual interview. Following that, I was called in for a first-round 1+ hour panel interview on-campus.\r\n\r\nWhen I arrived, there seemed to be some confusion as to my application materials and the interviewers seemed to have trouble getting organized. The interview started 25 minutes late and hence ran over the hour slot by about 30 minutes. After a week, I was contacted by phone by the hiring manager who proceeded to point out various gaps and perceived flaws in my resume as it related to the position I interviewed for and then asked if I would be interested in applying for a position in the same office that was of a lesser status and would pay 10k+ less than the position I had applied for. I expressed that it would be hard for me to rationalize taking a role that was so beneath my target salary.\r\n\r\nDespite being told multiple times that I would hear back in the coming weeks regarding my candidacy, I never received a follow-up message to let me know that I wasn't actually being considered or that the position closed and they went with someone else. I finally wrote to the original HR representative that I spoke with for an update, and over a week and a half since that email, still have heard nothing.\r\n\r\nThis was one of the most unprofessional hiring processes I've ever been subjected to, but considering the comments that I heard during the interview implying that the institution is going through a lot of big changes and that not everyone is happy about the changes, I suppose I probably dodged a bullet in coming to work for this university.", "Interview Questions": "Why are you interested in working for the University of La Verne?\r\nTell us about your background and why your experience relates to this position?"}, {"date": "10 Mar 2021", "title": "Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of La Verne (La Verne, CA) in Jan 2019", "Interview Descriptions": "Easy, was interviewed by the head Supervisor as well as several of the students leads. Was a relaxed and non-judgmental space. I felt comfortable around them and communicated each one of my answers clear and concise.", "Interview Questions": "Pick something out of the room and explain why it significant to you?"}, {"date": "17 Mar 2022", "title": "Career Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of La Verne in Oct 2018", "Interview Descriptions": "There were two rounds of interviews. The first was with members of the selection committee and then with the Dean. No presentation required. Questions were focused on previous and current experience.", "Interview Questions": "Tell me about yourself? Why La Verne?"}, {"date": "12 Sept 2018", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of La Verne", "Interview Descriptions": "Two interviews. Mostly scenario questions by a small panel. I had questions ready for the panel and they liked that. Second interview was also a panel but I got the feeling not all the people needed to be there.", "Interview Questions": "Why did you select La Verne?"}, {"date": "7 Jul 2021", "title": "Undergraduate Admissions Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of La Verne in Jun 2018", "Interview Descriptions": "It was an interview with 4 interviewees and they asked about 10 questions and it lasted 30 minutes.  It was fairly normal interview questions and they were very friendly. You get interviewed by the Exectuive assistant, student ambassador manager, and 2 others. Very tedious at first but after you get the hang of it not too bad.", "Interview Questions": "What is your biggest strength?"}], [{"date": "21 Jun 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of La Verne", "Interview Descriptions": "I saw the job posting online applied in person. I was emailed an interview offer by the supervisor soon after. The interview was short, informal  and consisted of simple questions.", "Interview Questions": "What is your major?"}, {"date": "30 Jun 2016", "title": "Student Job With Housing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of La Verne", "Interview Descriptions": "Initial online application. If they like you, then they'll bring you in for an interview. It is fairly straight forward with around ten questions. The best thing to do is show that you are enthusiastic to learn, positive, and detailed with your answers. They like to see that you are consistent with your answers in your application and in person. They get back to you very quickly (no more than a few business days).", "Interview Questions": "What skills can you get from this position?"}, {"date": "6 Aug 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of La Verne (La Verne, CA) in Jan 2015", "Interview Descriptions": "Face-to-face with the director and other faculty; approval process was relatively quick and pleasant.  Friendly, but bring your \"A Game.\"  Your practical experience in the field can help, as many of the students attend with an eye for jobs outside of the institution.  It helps to have connections with the faculty already employed, or some referral from someone connected to the school.", "Interview Questions": "Experience with the field, level of degrees. "}, {"date": "5 Jun 2016", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of La Verne (La Verne, CA) in Feb 2014", "Interview Descriptions": "The manager set up ads throughout the campus encouraging students to apply. Students interested emailed the manager, sent in a resume, and if qualified would set up a phone interview. If hired, students would be contacted relatively soon and would meet with HR to be cleared. After being cleared students went through job training", "Interview Questions": "Describe a time you had to ask someone for money"}, {"date": "24 Apr 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of La Verne (La Verne, CA) in Jan 2014", "Interview Descriptions": "Two in person interviews. First was with a group panel, approx. 5 current employees. The second was with the department head and the VP. Each about 45 mins - 1 hour.", "Interview Questions": "Why should we hire you?"}, {"date": "17 Oct 2015", "title": "Campus Safety Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of La Verne (La Verne, CA) in Aug 2013", "Interview Descriptions": "I applied online and was called a few days later to come in for an interview. The interview was very short and easy- less of an interview and more of an informative meeting", "Interview Questions": "Do you have any experience working in public safety?"}, {"date": "3 Oct 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of La Verne (La Verne, CA) in Mar 2013", "Interview Descriptions": "I was referred by a friend. I have good track-record of teaching.\r\nInterview process is friendly and concentrated on behavioral questions.\r\nNeed to be prepared to offer your availability date\r\nNeed to show your interest and tell your long term career goal\r\nNeed to prove your teaching ability: experience of being a teaching assistant, tutor, etc.\r\nBring or email the interviewer your past teaching evaluations if possible.", "Interview Questions": "N/A"}, {"date": "10 Feb 2014", "title": "Office/Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of La Verne in Aug 2012", "Interview Descriptions": "Hiring process was not difficult, was kind and understanding throughout interview.", "Interview Questions": "How did you overcome adversity"}, {"date": "12 Jan 2010", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of La Verne (La Verne, CA) in Jul 2008", "Interview Descriptions": "Initial phone interview screened for interest and fit with organization.  This was followed by a panel interview for which I was asked to prepare a presentation about the University and its programs to deliver to the interview team.  I was then interviewed by a senior manager who was looking again principally at fit.  The offer came shortly after the final interview.", "Interview Questions": "What is your philosophy of teaching?"}]]