[[{"date": "19 Jun 2023", "title": "Behavioral Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Turning Point Community Programs (Sacramento, CA) in May 2023", "Interview Descriptions": "The Interview process went great! The Job fair was family oriented and well organized. I went into the interview really nervous, however the person interviewing me was friendly and welcoming", "Interview Questions": "What is your experience working in the mental health field?"}, {"date": "19 Apr 2023", "title": "Behavioral Health Specialist (BHS) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Turning Point Community Programs (Sacramento, CA)", "Interview Descriptions": "It was in person and very easy, if you’ve worked in the field you won’t have any difficulty with the interview. I interviewed with two employees and it felt more like a conversation.", "Interview Questions": "Why do you think you would be a good fit for the company?"}, {"date": "21 Jun 2022", "title": "Family Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Turning Point Community Programs in Jun 2022", "Interview Descriptions": "It included the program manager and the family engagement coordinator along with me in a zoom interview. There were 14 structured questions.  They were very respectful and kind. Interview took around almost an hour.", "Interview Questions": "What does strengths based mean to you?"}, {"date": "5 Apr 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Turning Point Community Programs", "Interview Descriptions": "Engaging interview. As intern they ask questions regarding theory, have a foundational theory in mind. The process was comfortable and professional. Lengthly interview that lasted about two hours. Typical questions involved previous experience.", "Interview Questions": "What theory do you most identify with? How to handle a crisis?"}, {"date": "3 Mar 2021", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Turning Point Community Programs", "Interview Descriptions": "Very respectful, short and straightforward. Virtual during the pandemic. Make sure to know a little bit about the program and what mentors do beforehand. Be polite and answer honestly! The employers are understanding and it will better your fit for the job.", "Interview Questions": "How did you find out about Turning Point?"}, {"date": "24 Jul 2020", "title": "Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Turning Point Community Programs", "Interview Descriptions": "The interview process took a little over a month. Interview questions were relevant and thoughtful. The interview itself was one of the longest ones that I have ever had, and it was pretty tricky. It was roughly one hour.", "Interview Questions": "-What is a dual diagnosis?\r\n- What is a psychedelic drug?\r\n- Two characteristics of a specific  mental illness\r\n- How your previous work experience is relevant to the job\r\n- What is your definition of respect? "}, {"date": "12 Dec 2020", "title": "PSC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Turning Point Community Programs in Feb 2020", "Interview Descriptions": "Applied on line with no difficulties. Interviewed several weeks later after applying on line for the job.  Job description was general at interview and when hired .it took several weeks for response .", "Interview Questions": "General questions were asked during interview."}, {"date": "16 Nov 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Turning Point Community Programs (Sacramento, CA)", "Interview Descriptions": "Call from manager/supervisor of site. Panel Interview 2-3 supervisor, nurses, and/or clinician.  Interviewers will introduce themselves, and ask the interviewee to share about themselves. Each interviewer will ask a question. Some questions are complex. It is good to say you will seek out someone who knows the answer instead of making up an answer", "Interview Questions": "How would you assess a suicidal client"}, {"date": "15 Sept 2018", "title": "Turning Point Community Programs Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Turning Point Community Programs (Sacramento, CA) in Mar 2018", "Interview Descriptions": "They told me the atmosphere was going to be good but they lied during the initial interview. Once I was working there it was like misery loves company. Not only that,  I injured my hand and told my supervisor but my supervisor(Chee Lor) lied and said I never told her that I was injured. Ditry Rotten Scoundrels TPCP employees aree.", "Interview Questions": "What is your experience?"}, {"date": "7 May 2018", "title": "Housing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Turning Point Community Programs (Chico, CA) in Nov 2017", "Interview Descriptions": "I was called by the manager of my program and came to the office which is in a residential setting. I arrived and came to the office which is located in one of the units and was greeted by the manager and informed that they were working with a client and would be a few minutes. I sat and waited and conversed with one of the clients and then after a few minutes interviewed.  They asked me about my experience with the mental health community, and what type of therapeutic style I believe in and it was a very straight forward interview.", "Interview Questions": "What are symptoms of Bi-Polar disorder."}], [{"date": "20 May 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Turning Point Community Programs in Apr 2017", "Interview Descriptions": "The interview panel consisted of the program manager and team leader. Very professional. Questions were thoughtful and relevant. Atmosphere was promoting free expression and facilitated comfortablenesss. Felt as if the panel really wanted me to succeed. Was one of the best interviews I have ever had.", "Interview Questions": "How to resolve conflict."}, {"date": "28 May 2018", "title": "Quality Improvement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Turning Point Community Programs (Sacramento, CA) in Aug 2015", "Interview Descriptions": "Nerve-wracking because there were three interviewers, but they were all very nice! I submitted my internal job application bid, and received a call from HR about the interview request. Due to the position I was applying for, some questions focused on administrative duties, such as my experience level with Excel.", "Interview Questions": "They asked about how I self-care outside of work."}, {"date": "10 Apr 2015", "title": "Administrative Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Turning Point Community Programs (Sacramento, CA) in Apr 2011", "Interview Descriptions": "Panel of 3 managers. Very comfortable and friendly. The questions were very easy and standards. They also ask about handling office emergencies or issues with angry families. They asked if I had any problems with working around low income culturally diverse families. They asked what my strengths and weaknesses were. The experience was fine.", "Interview Questions": "How would you handle a lobby altercation?"}]]