[[{"date": "6 Jul 2023", "title": "DCP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "There is a phone interview then an in person interview. They ask a series of questions to understand if you are trustworthy to work with children. The process was very smooth and I was introduced to people that would be my direct managers. Very in-depth process that allowed for an understanding what the job would entail.", "Interview Questions": "What would you do if a child punched you."}, {"date": "26 May 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health (Phoenix, AZ)", "Interview Descriptions": "Very well organized and they were engaged. They were open to my own questions. They responded with professional responses. Interviewers were on time and allowed me to speak as long as necessary.", "Interview Questions": "What are your strengths in the field."}, {"date": "7 Mar 2023", "title": "Medical Transportation Driver Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "The interview consists of them trying to convince you to take a dayhab position. When I asked them what about the position that I actually applied for, the response was well this is what we need.", "Interview Questions": "No questions the lady literally just talks the whole time."}, {"date": "24 Jan 2023", "title": "Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "After sending my resume and cover letter, the company communicated that they would be in touch to schedule an interview. However, later I received an email that the position was filled. I would have liked to know why I was overlooked but I guess most companies do not take effort to be honest and do that.", "Interview Questions": "Was misled that did not get an interview."}, {"date": "13 Jan 2023", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "Was digital with about three people to four people. Ask basic questions but mostly about safety and therapy and how I planned to keep my sessions interesting when the kids get bored.", "Interview Questions": "How do you plan to include play or games into therapy."}, {"date": "1 Feb 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (West Chester, PA) in Jan 2023", "Interview Descriptions": "They asked me about my experience in behavioral health and had me write 6 short essay responses to 6 question scenarios related to case management. I had a first interview via phone screen, a second interview via zoom, 6 essay questions, and a 3 rd interview.", "Interview Questions": "How would you handle a difficult client or their family?"}, {"date": "6 Nov 2022", "title": "Direct Support Professional 2nd Year Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "They call you after they review your resume. They screen you for drugs and experience and you relate that to them. Then you receive reference and background checks and then you hope to clear them so you can start working right away.", "Interview Questions": "What are your previous experiences?"}, {"date": "27 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "Phone interview that was concentrated on gaining knowledge of your experience. There was a comfortable conversation that allowed the exchange of information to be natural without the obvious list of questions.", "Interview Questions": "Why did you become a nurse?"}, {"date": "13 Oct 2022", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "Initial call with company recruiter, then a 1-on-1 interview with the program manager I'd be working for. Laid-back and pretty informal, with typical interview questions. Afterwards had to submit references and information online, then do the Diana Screening.", "Interview Questions": "Types of evidence-based practices I was used to using, familiarity with electronic health records"}, {"date": "23 Aug 2022", "title": "UR Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (League City, TX)", "Interview Descriptions": "I was required to fill out a packet with short answer questions prior to my interview. After that, I sat in an interview with 2 individuals for approximately 45 minutes before having to complete a writing sample.", "Interview Questions": "What are your greatest weaknesses? Tell us about yourself. How do you handle multiple/conflicting priorities and deadlines? "}], [{"date": "6 Jan 2021", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health in Jan 2021", "Interview Descriptions": "Easy and awesome interview process everyone was helpful and nice and everyone seemed to be helpful in the process. I enjoyed the interview process they also were quick to get back to me", "Interview Questions": "How I could contribute to company "}, {"date": "4 Jan 2022", "title": "Youth Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Denver, CO) in Dec 2020", "Interview Descriptions": "The interview was simple, fast, direct. They were really interested in hiring immediately, so questions were directed towards availability and current ability. After the initial interview, I received a verbal offer, and continued through the process by taking different assessments and trainings.", "Interview Questions": "What do you know about de-escalation and grounding techniques?"}, {"date": "23 Feb 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Devereux Advanced Behavioral Health (Denver, CO) in Dec 2020", "Interview Descriptions": "The interviewers asked a lot of tough questions and really got to the bottom of your knowledge and experience. I'd say this one needs some preparations.  Make sure that you have research done about the agency.", "Interview Questions": "What are your professional experiences? "}, {"date": "30 Oct 2020", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "This interview was very laid back and calm. I felt like i was given a fair chance. They asked me questions about myself and my job history and about what in life do I think will help me perform this job.", "Interview Questions": "Why I was interested in working at Devereux. What makes me feel like this job is right for me."}, {"date": "17 Dec 2020", "title": "Revenue Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health in Oct 2020", "Interview Descriptions": "Phone screening with HR, formal interview director, second round of interviews one month later with hiring managers. All interviews were conducted over phone. After another month of follow ups I received a phone call from HR.", "Interview Questions": "What interests you in working here? Describe your past experience?"}, {"date": "24 Sept 2020", "title": "Direct Support Personnel Level II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Devereux Advanced Behavioral Health (Upper Red Hook, NY) in Sept 2020", "Interview Descriptions": "Via Zoom, lasted about an hour and a half. With the community Residence director and the ICF Manager.  Getting to know each other questions, the 15 very pointed questions to do directly with the job. Interview lasted an hour and half.", "Interview Questions": "Majority of questions were \"what would you do, if this situation, or that situation occurred, what could I bring to the table  as far as group programming, crisis resolution, etc."}, {"date": "31 Mar 2023", "title": "Quality Management Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health in May 2020", "Interview Descriptions": "The interview process was smooth. It included an HR phone screen and a 2nd interview with the hiring manager. The whole process took less than a month. A drug screen is reguired.", "Interview Questions": "Tell me about a time you worked on a team and not all members were on the same page."}, {"date": "14 Aug 2021", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Devereux Advanced Behavioral Health (Viera, FL) in Apr 2020", "Interview Descriptions": "The interview was a piece of cake. No tough questions at all. Very simple questions requiring no intense thought. Interview was done over the phone due to Covid-19. Devereux is always needing people so you should pass the interview like it was nothing as long as you say something.", "Interview Questions": "Have you worked with kids before?"}, {"date": "10 Jun 2022", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Somerset, NJ) in Feb 2020", "Interview Descriptions": "Mostly behavioral questions. A lot of time too, took me about an hour or so. Great recruiters. You will hear back in a weeks time. May have to check on them for an update.", "Interview Questions": "Time when you were pressured "}, {"date": "31 Jan 2023", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Devereux Advanced Behavioral Health in Jan 2020", "Interview Descriptions": "It was a phone screen. She asked me a lot of questions regarding my previous experience. She didn't leave me with any next steps but was very nice. After listening in, I read reviews and decided that the company was not a good fit for me.", "Interview Questions": "Tell me about your experience with working in a behavioral health environment"}], [{"date": "15 Oct 2019", "title": "Mental Health Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Viera, FL)", "Interview Descriptions": "Applied online, phone interview was scheduled 2 weeks after. Interview was easy and interviewer was pleasant but I did not get the job though. Weekend shifts are necessary which was something I was unaware of when applying.", "Interview Questions": "What three characteristics make you a good role model for children? "}, {"date": "4 Nov 2019", "title": "Case Worker Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Saint Augustine, FL) in Oct 2019", "Interview Descriptions": "Easily set up an in person interview after phone interview with HR. Very friendly staff. A little confusing on where exactly to meet for interview but place was small enough to find my way. Overall very good experience.", "Interview Questions": "What are signs of a child at risk?"}, {"date": "12 Aug 2019", "title": "Employment Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health (Berwyn, PA)", "Interview Descriptions": "I was interviewed by four people. They were all friendly, and made me feel comfortable. I was asked about myself and then asked questions that were pretty standard interview questions and not very difficult. I was then then told that the second part of the interview was a written portion. I was emailed questions to send back to the hiring manager by Monday (I was interviewed on Friday). The questions were all scenarios.", "Interview Questions": "where do you see yourself in the future?"}, {"date": "2 Mar 2021", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Kennesaw, GA) in Aug 2019", "Interview Descriptions": "The interview process is in a group. I did not have time to stay for the interview so I had a conversation with the woman that would be my direct boss and was given an offer.", "Interview Questions": "They mostly ask about prior experience."}, {"date": "18 Jun 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Tampa, FL) in Aug 2019", "Interview Descriptions": "The interview was conducted with the director. They asked about my current job position, why I was leaving. You will be asked to write a documentation based on a prompt of a parent's visitation.", "Interview Questions": "What's an area you struggle with?"}, {"date": "24 Jun 2020", "title": "DCP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health (Viera, FL) in Apr 2019", "Interview Descriptions": "The interview process was honestly very quick and easy. You have to go to Orlando to do a drug test and fingerprints but other then that everything was easy", "Interview Questions": "Have you ever had experience caring for other individuals "}, {"date": "9 Apr 2020", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health (Philadelphia, PA) in Mar 2019", "Interview Descriptions": "It was quite straight forward and not too difficult.  Very easy hiring process and very friendly and helpful people. Did not stress too much about this interview and it went very well.", "Interview Questions": "What would you do inn a situation where an individual was asking somethign outside the job description?"}, {"date": "18 Feb 2019", "title": "Special Education Teacher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health (Rutland, MA)", "Interview Descriptions": "Apply via school spring.\r\n I got a phone call and I was invited for an on-site interview. \r\nA week after the onsite interview, I was asked to do a sample lesson.", "Interview Questions": "How will you utilize paraprofessionals? What do you know about Devereux?"}, {"date": "1 Feb 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health (Phoenix, AZ)", "Interview Descriptions": "Straight forward; usual interview questions. Begins with a phone screen and then depending on the position may require several interviews.  Because Devereux is a behavioral health organization, you are required to take a drug test and have a background check.  It is helpful if you have a fingerprint card prior to your interview, otherwise, you will need to get one when you are hired.  Interviewing tip--do your homework and find out more about Devereux;   it will be helpful in your interview.", "Interview Questions": "Why I wanted to work for the organization."}, {"date": "1 Dec 2018", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Denver, CO)", "Interview Descriptions": "I applied and they got back to me within a week. I did have to fly out for an interview and they did not compensate. The interview was really straight forward, it took 30 mins and then I did an observation. The observation was REALLY helpful in seeing what the position actually entailed, it was helpful talking to people working in the position I’d applied for. I accepted the position, I’m not expecting glitz and glory but I think this will be an awesome stepping stone after graduating undergrad to get hands on work with patients and to gain tons of experience. They’re not offering me a lot in terms of pay so i don’t plan on staying for more than 2 years.", "Interview Questions": "A lot of hypothetical questions about patient care and how I’d react in certain scenarios"}], [{"date": "9 Jun 2021", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health (Berwyn, PA) in Oct 2018", "Interview Descriptions": "it was breif straight to the point. Interviewer asked a few behavioral scenario questions.  Interviewer also asked a few questions about my resume. The interview did not last no more than 30 minutes.", "Interview Questions": "Tell me about a time you handled a conflict."}, {"date": "31 Mar 2022", "title": "Outpatient Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health (Tampa, FL) in Jul 2018", "Interview Descriptions": "What are your strengths?\r\nWhat are your weaknesses?\r\nWhere do you see yourself in five years? Ten years?\r\nWhy do you want to leave your current company?\r\n\r\nWhat can you offer us that someone else can not?\r\nWhat are three things your former manager would like you to improve on?\r\nAre you willing to relocate?", "Interview Questions": "How do you manage multiple responsibilities?"}, {"date": "2 Jun 2018", "title": "Behavior Coach Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Tucson, AZ) in May 2018", "Interview Descriptions": "I first applied online, got a call a week later for an interview. If you have worked behavioral health before, the questions they ask are easy. The only problem I had is I applied full time and they called and offered me the job a week later but said they only had an on call available. If so then why have me submit an application saying full time but offer me on call?", "Interview Questions": "Describe a time you used boundaries with clients?"}, {"date": "26 Apr 2018", "title": "Assistant Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health (Goleta, CA) in Apr 2018", "Interview Descriptions": "I was contacted two days after they received my application, my interview was the following Friday and it's been two weeks (they said they would get back to me by now) and I haven't heard anything. I have emailed them and haven't received a response.", "Interview Questions": "What are your experiences with working with people with disabilities? "}, {"date": "2 Apr 2018", "title": "Clinician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Scottsdale, AZ)", "Interview Descriptions": "I applied online. I called a few days later to inquire about the progress of my application and was immediately given a phone interview. Two hours later, I was asked for come in the following week for an in-person interview. I had my interview with a coordinator and lead clinician. They took turns asking me questions about my education and experience as a clinician.", "Interview Questions": "What's your therapeutic orientation?"}, {"date": "26 Mar 2018", "title": "Assistant Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "The interviewers themselves we're really great and seemed like they loved their jobs. The job was very mosrepresented. It was presented as a management position but was really just direct care with very little organization for the program itself. it seemed more like they were selling me the position.", "Interview Questions": "The questions were nondescript."}, {"date": "3 Feb 2021", "title": "THS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Phoenix, AZ) in Jan 2018", "Interview Descriptions": "I only had 1 interview; easy ; quick response with hiring offer; 2 people present during interview; The company was moving offices. The HR was quick with checking my reference.", "Interview Questions": "work experience; Case load; why I left my pervious job; foster care experience "}, {"date": "7 Dec 2017", "title": "Many Roles Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health (Pittsburgh, PA)", "Interview Descriptions": "I applied online for several different jobs at this company. One supervisor called me a month later to interview me for one of the jobs that I applied for. After that it took several weeks before I heard back from the supervisor. I didn't get the job and I don't know why. I have lots of experience working with individuals with disabilities. I was offered one job at a low low pay. I declined the job offer because of the low pay.\r\nI gave up applying to jobs in this company because I lost hope that they won't hire me. I kept getting rejection from this company", "Interview Questions": "How do you handle stress?"}, {"date": "9 Feb 2018", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Devereux Advanced Behavioral Health (Westminster, CO) in Dec 2017", "Interview Descriptions": "Asks what you would do in different situations.  Explain that restraints will be used on kiddos.  Drug test is a mouth swab (believe thats a 24-hour check).  Tell you about their campus and include an observation with you observing a unit before deciding to accept job offer.  Does not show the culture of working longer than your shift time.", "Interview Questions": "What are my strengths and weaknesses."}, {"date": "4 Dec 2020", "title": "Mental Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health in Dec 2017", "Interview Descriptions": "Very quick response to job application, quick phone screen to assure this is a job you are interested and booked an immediate zoom interview call the next day! Interview questions are as expected, reasoning behind wanting this specific job, great skills you believe you possess that will benefit you in this field etc.", "Interview Questions": "3 Best skills you possess that will benefit you in this specific job?"}], [{"date": "3 Nov 2017", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "fast quick and in a hurry. I didn't even finish my application online (I completed half of it) before someone called to schedule an interview.  I came in twice before starting training. overall, pretty quick process because they are in need of more employees since that job has such a high turnover rate", "Interview Questions": "What experience do you have?"}, {"date": "16 Sept 2017", "title": "Residential Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Broomfield, CO) in Sept 2017", "Interview Descriptions": "I submitted my resume online and was contacted for an interview within a few days. The first interview is one on one. Then you are invited back for a one hour observation and peer interview (unpaid). Afternoon and evening shifts for full time is 36 hours. Overnights are 40 hours. I received a call within a couple of days with an offer. It's 14.50 per hour whether you have a college degree or not. The person I was shadowing told me she had her nose broken by a client a few weeks ago. $14.50 is not enough for all the residential counselors have to deal with.", "Interview Questions": "Why do you want to work with children?"}, {"date": "28 Mar 2018", "title": "DCP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Phoenix, AZ) in Aug 2017", "Interview Descriptions": "around 1.2 hrs, two or three interviewers will pull up a packet that is filled with questions and scenarios. Some are ranking most valued qualities to a child's treatment, how would you handle emergency situations, how would you communicate with team members, etc. Pretty much they would write notes as you answer", "Interview Questions": "how would you handle emergency scenarios "}, {"date": "14 Aug 2017", "title": "Direct Support Professional Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Hillsborough, NJ) in Jul 2017", "Interview Descriptions": "Lots of back and forth calling and emailing to set up interviews. Starts with a phone interview which is just a basic screening. If the hiring recruiter sees you fit for the job they will schedule you for an in person interview at one of the group homes (depending on the location you applied for). If the in person interview goes well, the paper work you fill out will be sent to the hiring office. They will do a back ground check and call references. If all checks out they call with an offer.", "Interview Questions": "\"describe a time where you witnessed something illegal or unethical and what did you do?\""}, {"date": "26 Jul 2017", "title": "Mental Health Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Westminster, CO) in Jul 2017", "Interview Descriptions": "Applied online through Devereux Careers page on their website.  Was promptly notified of the acceptance of my application and received a follow-up email a few days later to schedule a phone conversation.  After completing the conversation I was invited in for an interview that day.", "Interview Questions": "The interviewer asked a lot of scenario questions. What would you do in this situation? "}, {"date": "20 Jul 2017", "title": "Program Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Devereux Advanced Behavioral Health (Glenmoore, PA) in Jul 2017", "Interview Descriptions": "The interview was great and extremely beneficial. I see a lot of possibilities with this company. They provided an excellent insight into the company structure, how they service the children and more.", "Interview Questions": "What are my strong suits"}, {"date": "28 Dec 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Devereux Advanced Behavioral Health (Glassboro, NJ) in Jun 2017", "Interview Descriptions": "The interviewing process consisted of me being interviewed by one woman in an office at a desk. The interview lasted for 10-15 minutes before they hired me right on the spot.", "Interview Questions": "Describe a scenario where you had to work under pressure."}, {"date": "21 Jul 2017", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Westminster, CO) in May 2017", "Interview Descriptions": "I applied online and received an email back a couple of days later asking me a few questions about why I was interested in the position.  After this, I had a 10-minute phone screening that mostly involved HR telling me more about the position and giving me an opportunity to ask questions. I was called back for an in-person interview the following week, which lasted about 20 minutes and was a typical one-on-one interview. After this interview, they had me complete a 2-hour observation on one of the units to see how I interacted with the kids and to give me a preview of what the job would be like. They then completed a reference check, a background check, and a drug test and offered me the position the following week.", "Interview Questions": "Situational question about how you would deal with a difficult client"}, {"date": "14 Apr 2017", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Devereux Advanced Behavioral Health (Scottsdale, AZ) in Apr 2017", "Interview Descriptions": "The interview was straight forward and casual, the questions came from a prewritten packet. Neither of the interviewers were overly formal or serious, and explained their agency in depth when I asked questions about it. They directly talked to me about pay afterwards, so I had a pretty good idea they would offer me the position. There were a few different interruptions during the process.", "Interview Questions": "What have you done in a crisis situation?"}, {"date": "16 Mar 2017", "title": "Program Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "The hiring process seemed a little over the top. I had two interviews that lasted over 30 minutes each and I'm still not sure if I got the job.", "Interview Questions": "They asked numerous situational questions about how I would handle certain situations and  what kind of management style I thought I had."}], [{"date": "15 Mar 2017", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health (Westminster, CO)", "Interview Descriptions": "First, there was a phone interview that lasted 20 minutes. Second, was an in person interview that last around 40 minutes. Mine was with the director of the department, but some individuals interviewed with supervisors. Lastly, you have to complete an hour and 45 minute observation.", "Interview Questions": "A client had a fight with their boyfriend/girlfriend and, as they were discussing the argument, they asked if you had a boyfriend/girlfriend. How would you respond?"}, {"date": "28 Mar 2019", "title": "Child Welfare Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Tampa, FL) in Mar 2017", "Interview Descriptions": "It's the same as any other behavoiral health interview. Same questions, they just want to know about your previous experience or education. How you deal with external and internal conflict? The job requires heavy time management and they notified me up front what the job would consist of.", "Interview Questions": "They want to know how well you work with others. "}, {"date": "22 Feb 2017", "title": "Direct Support Professional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Devereux Advanced Behavioral Health (Goleta, CA)", "Interview Descriptions": "I went during one of their open house interviews.  I filled out a questionnaire, and when I was interviewed, they briefly read my answers and asked me a few questions based on my answers.", "Interview Questions": "There are many parts of this job that aren't so pretty (eg, cleaning up bodily excrement, being hit by clients).  Would you be able to deal with this? How?"}, {"date": "30 Jun 2019", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Orlando, FL) in Feb 2017", "Interview Descriptions": "The interview was very long. It felt like if you was going to be hired for an FBI position.\r\nAlso the new staff participated on an online interactive conference where you got to meet some of the staff from other states and a welcoming team once you was hired. A very expensive set up for just a direct care job. The job tasks were never described properly during the interview", "Interview Questions": "Have you ever taking finger prints before for a job?"}, {"date": "26 Jan 2017", "title": "Information Systems Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "They sent me an email to setup a phone interview and then never called at the appointed time, never heard from them.  Not a good way to win over potential candidates.", "Interview Questions": "N/A"}, {"date": "17 Sept 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "HR director called to set up the interview and I met with the hiring manager. Not a lot of questions for me. Mostly trying to sell me on the agency.", "Interview Questions": "What is the structure of your company’s leadership?"}, {"date": "6 Sept 2016", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "The first interview is with the clinical manager. The second interview is with the clinical manager, the lead clinician, and therapists from the clinical department. During the second interview everyone gets to question to you. If you are called in for a second interview, you are either one of 2 or one of 3 candidates.", "Interview Questions": "Numerous therapeutic questions."}, {"date": "2 Sept 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Devereux Advanced Behavioral Health (Denver, CO)", "Interview Descriptions": "I was first contacted by HR for a phone interview, which lasted about 30 minutes.  They then emailed me a few days later asking me to come in for a second, formal interview. The second interview lasted 2-3 hours with the time split between the interview and shadowing. The questions were mostly behavioral/situational questions. Explaining how you would handle a potential situation, etc. The shadowing involved me going to a unit (they ask what group you are most interested in, I said behavioral disorders) and spending some time there with the residents and their counselors. The shadowing itself was very beneficial, it gave great insight to what I would be doing every day. Things were very hectic. My largest complaint was that the counselors (my potential coworkers) were unfriendly and unwelcoming. Only one of them acknowledged my presence. That, along with the very unsafe environment, is why I did not take the job.", "Interview Questions": "What would you do if a resident started yelling and throwing things?"}, {"date": "23 Jun 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Berwyn, PA) in Sept 2016", "Interview Descriptions": "Very quick, they seem to hire anyone who has a high school diploma and driver's license. It took them only twenty minutes to tell me I was hired. Which is both good and bad.", "Interview Questions": "Basic questions like can you cook, do you have a driver's license, what would you do if an individual is aggressive with you"}, {"date": "29 Aug 2016", "title": "Behavior Health Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Malvern, PA)", "Interview Descriptions": "Long drawn out process. Phone interview then in person  interview. Person who was supposed to interview me didn't even show up so a random person had to do the interview. I waited almost am hour before I was interviewed.", "Interview Questions": "Situational questions"}], [{"date": "16 Jul 2016", "title": "Human Resources Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Orlando, FL) in Jul 2016", "Interview Descriptions": "I was contacted by a Mgr. and he asked me a couple of questions and scheduled me for an interview. When I came in for this interview, the first thing I noticed was how miserable the receptionist looked. Then she told me to use the phone and dial the HR Mgr. myself. I thought this was the receptionist's job? During the interview, the a Mgr. and some other woman (she did not even tell me what her role was) interviewed me by asking canned questions from a list and writing down my responses. This interview did not last long. The whole thing felt impersonal. And I was told I would be working in a cubicle with no windows and constant noise and distractions all around. Sorry, but not my type of work environment. The office was hot as hell too. Hope someone else enjoys working in that environment for $13 an hour.", "Interview Questions": "How would you handle working in a cubicle with distractions all around? Tell us about a time you used initiative."}, {"date": "12 May 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "I applied online and recieved a phone call about a totally different position. I needed another job so I decided to try. I Came in , took drug test and just got asked about my morals and ethics.What would I do in different scenarios. They ask for references and will not offer until atleast three respond. Inerview isin an ioen roomwith windows so everyone can see you and distract you. People were walking through room aswell during the interview. Very unprofessional. The interviewer however was sweet, Ms.MR.", "Interview Questions": "If I had any experience."}, {"date": "11 Apr 2016", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Westminster, CO)", "Interview Descriptions": "first there was a basic phone screening with a member of human resources department. Then the manager called for an in person interview with the department manager and another manager within  the company. Both took turns asking questions.", "Interview Questions": "how I handle stressful situations"}, {"date": "11 Nov 2020", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health (Berwyn, PA) in Apr 2016", "Interview Descriptions": "the interview process went by fast, i met with the manager, i believe. she was positive and understanding. the location was at hankin. the questions were practical too and she told me how i did instantly", "Interview Questions": "tell me about a time you had to work without a supervisor and what did you do?"}, {"date": "10 Jan 2016", "title": "Intensive Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "applied through the internal website. HR contacted me to let me know they received my application. Regional manager of the office i applied to contacted me within a week asking me to come in for an interview.", "Interview Questions": "what previous experience do you have with mental health"}, {"date": "17 Jan 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Devereux Advanced Behavioral Health in Jan 2016", "Interview Descriptions": "Same questions as the ones over the phone interview, and situational questions. Process is long so far. I applied online, got a phone call in 4 days. Then i got a call back to come in and get a interview. After that they call you to tell you yes or no if their interested", "Interview Questions": "have you ever had to take care of someone?"}, {"date": "23 Dec 2015", "title": "Therapeutic Family Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health in Dec 2015", "Interview Descriptions": "I applied online and was contacted by the HR  person the next day to schedule an interview. The interview was a little different than usual, as I was only asked situational questions. None of the questions asked about my past experience and the person interviewing seemed to be in a rush.", "Interview Questions": "I see that you are getting your degree soon, wat are you planning to do with your Masters in the future as we are looking for employees that stay with us a long time?"}, {"date": "18 Feb 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health (Chester Township, PA) in Oct 2015", "Interview Descriptions": "First you meet with Human Resources. If they like you, they tell you that someone will be in contact with you. Next you get another call from human resources setting up an interview with a site supervisor. After the site supervisor meets with you and likes you, they usually take you around the unit to meet the other managers", "Interview Questions": "Describe what you would do if you were with clients on a trip and one client decided to go AWOL"}, {"date": "2 Nov 2015", "title": "Behavioral Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Millwood, NY) in Oct 2015", "Interview Descriptions": "Interview was pretty simple and to the point. The questions they ask are not necessary challenging but they do ask extensively about your experience and how you can use that experience in the job you are applying for. The interviewers were enthusiastic about the interview process and make you feel at ease, but they do inform you of your job position as well as answering all the specifics detail pertaining to that job.", "Interview Questions": "what do you know about Devereux?"}, {"date": "21 Sept 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "First I applied for the job online, a few days later I relieved a phone call from someone in the human resources department. They asked me a few questions about why I wanted the job, my salary requirements and my previous work history. They then scheduled me for an in person interview. I was interviewed by the supervisor of the unit I would be working in. He asked some of the usual interview questions and then went through a list of situational questions. He then gave me a small your of the unit.", "Interview Questions": "Why do you want this job?"}], [{"date": "25 Sept 2015", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Devereux Advanced Behavioral Health (Atlanta, GA) in Aug 2015", "Interview Descriptions": "Was called or an interview. Had in-depth convo about job position and what it takes to make it there. There was A LOT of security measures for entering the campus. It is a small residential treatment facility for troubled youth. The staff members I encountered seemed happier than the average public school teacher.", "Interview Questions": "What would your former supervisors say about you?"}, {"date": "26 Jul 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Devereux Advanced Behavioral Health (Santa Barbara, CA)", "Interview Descriptions": "I applied online and received a call from HR in about a week. The interview format was a panel (2 supervisors, HR, and one other person) and group interview with 4 other people. The interview lasted about an hour. Questions weren't difficult. HR followed up a week later and was offered the position.", "Interview Questions": "What&#039;s your experience like working in a team?"}, {"date": "3 Aug 2015", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health in Jul 2015", "Interview Descriptions": "Very friendly upbeat place! Very informative interview. Hiring process is a little long but every person I have encountered has been so nice and helpful. A lot of communication is done through email so ensure that you check your spam to make sure you aren't missing any emails.", "Interview Questions": "What was your previous experience?"}, {"date": "30 Nov 2016", "title": "Behavioral Health Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health (Phila, PA) in Jul 2015", "Interview Descriptions": "The interview process was fairly easy. I applied online for one position and was recommended by HR for another position that suited my experience best. The interview was held by the Director of the new program and he wasn't very knowledgeable in the new program, so I believe he hired first come first served after evaluating each resume presented.", "Interview Questions": "How I like working in a school based program?"}, {"date": "29 Jun 2015", "title": "Direct Care Professional Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "Very informal. Questions were mostly about client health and well-being. A lot of situational questions, i.e. if this happened how would you react/what would you do. No follow up since interview. Overall an average, but not impressive interview.", "Interview Questions": "Describe a time you went above and beyond your job duties?"}, {"date": "20 Jun 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health (Wayne, NJ) in Jun 2015", "Interview Descriptions": "Was a very friendly and comfortable environment. Program Director was very professional and clear with the expectations and goals of the position. PD allowed me the opportunity to share my experiences and education in the field. It was a very pleasant and knowledgeable interview.", "Interview Questions": "Questions were in regards to leadership skills, consumers, and life threatening situations."}, {"date": "21 Jul 2018", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health (Melbourne, FL) in Jun 2015", "Interview Descriptions": "It was easy and upbeat. The person who interviewed me was very friendly and informative on what is required. They always have hiring events and they make the job easy for everyone", "Interview Questions": "What are your qualifications?"}, {"date": "12 Mar 2016", "title": "BSC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Devereux Advanced Behavioral Health (Philadelphia, PA) in May 2015", "Interview Descriptions": "very easy, group interview, easy questions, seat in a common room each person talk, and go to the room with a clinician for further interview. It is about talking about yourself and your experience. The experience was easy and the job was offered easily. It is a great placew to work if you are looking for a place where you can make additional cash", "Interview Questions": "what can you bring to the company and team?"}, {"date": "7 May 2015", "title": "Residential Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health (Newfoundland, PA) in Apr 2015", "Interview Descriptions": "Interview went well. I was able to clearly relay my experience to the interviewer so they could better understand why I can do the job and why I want the job.", "Interview Questions": "Why do you want this job?"}, {"date": "7 May 2015", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health (Bryn Mawr, PA) in Mar 2015", "Interview Descriptions": "Went to one of their open houses. It was a lot of people and a VERY LONG wait. Anyhow, I decided PRN since their f/t location and hours we're suitable for me. The people there were nice and Come to find out They actually are the ones who do the hiring in. Anyhow, interview went well. Answered basic questions pertaining to the position and my background. Also, writing sample and questions.", "Interview Questions": "How would you handle a nonverbal consumer?"}], [{"date": "9 Jan 2018", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Devereux Advanced Behavioral Health (Westminster, CO) in Mar 2015", "Interview Descriptions": "Interview with Unit manager followed by a brief session on a unit with staff and clients.   This was done on two separate days . The in person interview lasted approximately 1 hour and then the process of being on the unit was another hour of observing and talking to unit staff.", "Interview Questions": "What would you do if a client tried to add you to facebook? "}, {"date": "3 Feb 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "Well, I applied online on Monday and I got an email responding that they were holding open interviews the next day ( Tuesday). I attended the open interview. My interviewer was nice. She asked me questions in regards to my experience and behavior. After the interview she gave me a packet to fill out for background checks. She said they have to check references and I should hear from someone within a week. (Fingers-Crossed) I'll write another review if I get the job.", "Interview Questions": "Nothing really difficult....Questions like: Do you think it's important to work with team members? Explain a time you had to handle a crisis. Have you ever not gotten along with a co-worker  and how did you handle it? If you seen a co-worker doing something inappropriate what would you do? and Explain time you had to solve a problem."}, {"date": "26 Jul 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (West Chester, PA) in Feb 2015", "Interview Descriptions": "There were several interviews- The first being a \"job fair\" that they invite all who apply online to as well as accepting walk-ins to fill out applications. The second part is interviewing with one supervisor and then waiting on the gymnasium benches with the other applicants to see if you make it to the \"next round\" to interview with another supervisor. Then after all state and federal background/child abuse clearances have been received you must go in for another interview (usually about two weeks later) and they do not communicate with you to update you on that last interview. Then at the last interview they do an oral swab drug test and give you papers to go get fingerprinted and get a physical and get your clearances again. Finally about 1-2 weeks after that then they offer you the job.", "Interview Questions": "\"How do you think of yourself when it comes to your problem-solving skills?\""}, {"date": "7 Jan 2015", "title": "I: I Aide Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "I received a phone call from the recruiter. She asked me some basic questions and said she would like for me to go meet with the group home manager. After setting up the second interview after the phone interview she said that my hours would be Tuesday-Saturday from 3-11 with it being very likely I would be staying much later. I told her this was not the position I applied for. She agreed and said age would call me back if a day position opened. She did call back the next day but I ended up taking another job offer that evening.", "Interview Questions": "Do you have experience working with special needs children? "}, {"date": "19 May 2015", "title": "Program Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Devereux Advanced Behavioral Health (Atlanta, GA) in Nov 2014", "Interview Descriptions": "Panel interview with senior management. Most questions were situational, in the format of \" what would you do if,\" or \" tell me about a situation when\". Each panel member asked a question relative to their area of expertise with regards to leadership, supervision, program creation, child welfare, and qualitative analysis.", "Interview Questions": "Tell me about a situation when you were faced with a disgruntled teammate. How did you resolve the situation?"}, {"date": "25 Sept 2014", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Red Hook, NY) in Sept 2014", "Interview Descriptions": "Put application in online on a Thursday was called a week to the day for an interview. Set interview up for a Tuesday, was called day after interview and offered Job.", "Interview Questions": "If two individuals were disagreeing what would you do? "}, {"date": "23 Jan 2018", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Devereux Advanced Behavioral Health (West Chester, PA) in Sept 2014", "Interview Descriptions": "easy.  Anyone could pass this.  They do not ask anything that would require any knowledge of psychology. Honestly this was the easiest interview I ever under went. They will literally hire anyone with a pulse.  They often hire foreign individuals who cannot speak very good english and then create issues when the kids are trying to understand what they are talking about.", "Interview Questions": "Why do you want to work for devereux?"}, {"date": "4 Aug 2014", "title": "Personal Attendant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "I was interviewed by a supervisor of one of the programs at Devereux.  She asked me a series of questions about my experience with people who have mental disabilities.", "Interview Questions": "\"Explain your knowledge of mental disabilities\" "}, {"date": "26 Jul 2017", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Devereux Advanced Behavioral Health (Victoria, TX) in Jun 2014", "Interview Descriptions": "The Interview process was easy and brief. I feel that the interview process should be more lengthy especially since the job requires that you work with kids who have behavior issues. It is important to evaluate the ability of the person to be able to handle the behavioral issues.", "Interview Questions": "Why do I want to work at Devereux?"}, {"date": "24 Apr 2014", "title": "Direct Care Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Westminster, CO) in Mar 2014", "Interview Descriptions": "The hiring process is very thorough - this company is very focused on recruiting and retaining excellent staff. After filling out an online application and submitting a resume, there is a phone interview, an in-person interview, and then an observation session to see if the organization will be a good match for you and vice versa.", "Interview Questions": "The questions were not noticeably difficult or unexpected; the interviewer was very personable and forthcoming about what the organization is seeking in its staff. A thoughtful question was \" tell me about a time when you did not agree with a coworker, and how you handled it\" - there are many of these example type questions. "}], [{"date": "10 Jul 2016", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health (Philadelphia, PA) in Feb 2014", "Interview Descriptions": "It was fairly simple. When you arrive you fill out some paperwork. You also wait a long tim.e Then you interview with the supervisor of the location that you'll be working at. They call you back for preemployment. This is when they drug test etc.", "Interview Questions": "How would you handle a conflict between residents"}, {"date": "11 Jan 2014", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Devereux Advanced Behavioral Health", "Interview Descriptions": "I went on an interview with HR and then a program director on the same day. I was called back for a larger interview with 4 or 5 people in the room asking me questions.", "Interview Questions": "Questions were about experience and scenarios. No real difficult questions just several people asking them. "}, {"date": "14 Dec 2016", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health in Jan 2014", "Interview Descriptions": "Easy interview process. Received a call right away. Interviewer was flexible and relaxed.They asked what model I am most comfortable with and experience. It was a light and easy interview. Very relaxed", "Interview Questions": "What model are you familiar with?"}, {"date": "29 May 2014", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Devereux Advanced Behavioral Health in May 2012", "Interview Descriptions": "I applied in person and they gave me a tour of the campus the same day to see if i was comfortable working with that particular population. A week after i submitted my application they called me in for an interview, and within the next two weeks i was in orientation.", "Interview Questions": "N/A"}, {"date": "3 Feb 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Devereux Advanced Behavioral Health (Mays Landing, NJ) in Mar 2012", "Interview Descriptions": "It was fast and easy the manager was really nice and made it even easier. Getting the job was really easy and the position is even easier. Interview really allowed me to express my experience and knowledge of the job", "Interview Questions": "your experience"}, {"date": "14 Sept 2012", "title": "I: I Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Devereux Advanced Behavioral Health (Millwood, NY) in Oct 2011", "Interview Descriptions": "Interviews are quick and it was 2-3 people from administration interviewing.", "Interview Questions": "Nothing was really too difficult"}, {"date": "17 Jul 2011", "title": "Direct Care Profesional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Devereux Advanced Behavioral Health (Viera, FL) in Jul 2011", "Interview Descriptions": "Overall, the interview process was well organized. There were 15 scripted questions. Many of which were scenarios. Initially, there were about 8-10 applicants in one room and we filled out apps. Afterwards, each applicant is assigned to a unit manager whcih consisted of 1:2. I felt that I did really great in the interview, but got declined for a job offer. They did call from HR, but it was 2 days later than what they said it would be. If you are new to this area of work, the interview questions might be difficult for you.", "Interview Questions": "If you saw a co-worker not doing his/her part in the workplace, how would you feel? What would you do about it? "}, {"date": "28 Apr 2011", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Devereux Advanced Behavioral Health (Kennesaw, GA) in Apr 2011", "Interview Descriptions": "After faxing my resume, I was called in for an interview. There were interviewing a lot of people so there was a small wait time. Overall it was pretty easy, I was asked questions regarding my previous experience in a behavioral health setting.", "Interview Questions": "If I saw an employee treating the clients in an unfair manner, what would I do?"}, {"date": "9 Jul 2013", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Devereux Advanced Behavioral Health (Malvern, PA) in Feb 2011", "Interview Descriptions": "The hiring and interview process was rushed and I felt like they just needed to fill an opening instead of look for the best fitting candidate. A Human Resources Representative called me and asked if I could interview as soon as possible. Then I met with a manager, in the cafeteria, with clients wandering all about screaming and staff running around them. The manager said, \"Fine, your hired.\" She then ran out of the room and left me there.", "Interview Questions": "Can you handle getting physically assaulted by clients on a regular basis?"}, {"date": "1 Dec 2015", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health (Scottsdale, AZ) in Jan 2011", "Interview Descriptions": "Fantastic interview\r\nBoth interviewers were  enthusiastic, positive, supportive and eager to find someone of quality\r\nThey gave me a campus tour which was very fun\r\nThey asked plenty of typical interview questions, but also very  specific questions to the behavior health environment\r\nThey also provided me with different scenarios that I needed to demonstrate how our why I chose to handle in the manner I did", "Interview Questions": "If aq student hit you,, how would you respond?"}], [{"date": "10 Jul 2015", "title": "Direct Care Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Devereux Advanced Behavioral Health (Rutland, MA) in Jan 2011", "Interview Descriptions": "Very relaxed and straight forward questions more describing the aspects of the role and what happens on a daily basis for someone in this role. Met with campus coordinator who asked not too challenging of questions. Very quick with follow up after the interview and started the job soon after drug screening and background check.", "Interview Questions": "What experiences in the past make you believe you can work with this challenging population"}, {"date": "15 Nov 2013", "title": "Medical Records Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Devereux Advanced Behavioral Health (Devon, PA) in Nov 2010", "Interview Descriptions": "I found the position listed on a job search website on the internet. I sent my application through online on the Devereux website. An HR representative called me a few days later and  conducted a telephone initial screening interview. She said she would pass my information to the hiring manager. If he wanted to interview me, the HR rep would call me back. The following day (Friday), HR called me and set up and interview with the hiring manager for Monday.\r\n\r\nI arrived on time to the location and needed to fill out a bunch of paperwork before the interview. Then I was led to the manager's office. I was nervous but after a few minutes I was comfortable with my interviewer. He seemed like a pleasant, upbeat type of personality and very bright. The interview progressed more like a conversation than stiff, pointed questions being thrown at me. I didn't feel as if he wanted to trip me up as other interviews I've had. I felt  that I had discussed and brought up everything I had wanted to address and he didn't seem to have anything left unasked. I was told that I was the last candidate being interviewed and I would hear something within a week.\r\n\r\nTwo days later on Wednesday I received a call from HR offering me the job which of course I accepted.", "Interview Questions": "I think the most difficult question that I got was to describe an incident where I had a conflict with a previous boss, where I was right and they were wrong and then how I handled it."}, {"date": "14 Nov 2014", "title": "Quality Management Coordinator/Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health in Aug 2010", "Interview Descriptions": "I applied for the position online and was contacted by HR for a pre-employment screening within 48 hours.  I had an interview scheduled within a week.  I met with the Recruiter and HR Director.  Both were very pleasant and the interview went smoothly. Both had extensive knowledge on the program within the organization,", "Interview Questions": "How do you see this position effecting the treatment of the individuals we serve?"}, {"date": "8 Aug 2010", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Somerset, NJ) in Jul 2010", "Interview Descriptions": "I applied online, and was called the next morning to shadow a current employee. Afterwards, I was redirected to fill out a paper application at one of the home offices. This was a bit of an unorganized process, (as the original location had moved, but the website was not updated) but the staff was very helpful. Afterwards, I began doing all the pre-hiring procedures.", "Interview Questions": "All of the questions were straight forward, but there was a laundry list of simple phone interview questions."}, {"date": "10 Jun 2014", "title": "Program Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Devereux Advanced Behavioral Health (Berwyn, PA) in Feb 2010", "Interview Descriptions": "HR communication was a bit confusing, but you interview with leadership and directors. Interview is fairly standard. What are your strengths and weaknesses, how would you benefit this company. What brought you to Devereux. (Mention it's resources! there are a ton here.)", "Interview Questions": "Be prepared to answer questions on how you would respond in a crisis situation, both with clients and with employees."}, {"date": "28 Jul 2010", "title": "DCP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Devereux Advanced Behavioral Health (Kennesaw, GA) in Jun 2009", "Interview Descriptions": "They seemed organized at first, but then later reviled that they were not very good with communication amongst HR and the hiring supervisor. Much of the process was scripted and had a feeling during the hiring process that you were just another number and not a person.  I came to this company to make a difference in the clients lives but am learning that the clients funding and retention is their only priority.  The process was as if you were applying for a gov't job. They have justed increased the base rate for DCP-I form $9.50 to $11 in hopes to lower the very high turnover rate(avg life of new hire 4-6 months)", "Interview Questions": "What would you do in a certain ( scenario with client)?"}, {"date": "13 Nov 2012", "title": "Primary Instructional Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Devereux Advanced Behavioral Health (Downingtown, PA) in Feb 2008", "Interview Descriptions": "Fairly easy. They wanted to make sure I had a compassionate, interesting personality, was organized and professional, asked about my background in mental health. When I was first interviewed, it was for the inpatient teen residential program. Since I had work with autistic kids on my resume, the interviewer asked if I'd like to switch to the school, which paid more. It'll help to know they have an autism program just in case they don't ask.", "Interview Questions": "Least skilled area"}]]