[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The ideal place to work at in Danbury, CT", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Jan 2009", "job_title": "C. . . in Danbury, CT", "duration": "N/A", "pros": "You can get as much overtime as you want. You can get whatever days off you need. A raise is given every couple of months. If you have a problem you can go to your superior and know that the problem will be taken care of. The staff is very friendly and helpful. Health Insurance wasn't too expensive, and you would only pay for what you needed. They also offered life insurance at no extra cost to you. Working at the hospital gives you a good feeling about your job. I actually looked foward to going to work, and when I left I felt like I accomplished something good in my life. If I hadn't moved to another state I would still be working at the hospital. They also have a tuition pay back program. If you want to go back to school or you are in school the hospital will pay back your tuition. The only thing that they ask back is that you work for the hospital for at least a year after you are done with school.", "cons": "There weren't many downsides. Some nurses didn't help with patient care, and that was aggrivating especially when we were short staffed. The down side to the tuition program was that you had to pay the tuition yourself first and then the hospital would pay you back. You also have to keep good grades. Another downside was dealing with certain patients. Some people were just really needy, but there wasn't anything that anyone could do because we try to offer the best care there is no matter to who it is. One of the downsides, especially for those working the day shift, was parking. The last couple of months that I worked there parking was always full and was very hard to find a spot. The hospital started having employees park at the PAL parking lot and have shuttles go back and forth to and from the hospital."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Used to seemingly care about employees. Now, not so much. (EMS)", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "29 Jul 2021", "job_title": "Paramedic in Danbury, CT", "duration": "N/A", "pros": "The insurance benefits, 401k is better than the standard EMS service, You can earn lots of time for PTO and there are opportunities to transfer out of the department. \r\nThe experience to work in Danbury on the ambulance is great and working with the fire department is excellent.\r\nThere are many coworkers who wish to support your growth and help you grow.\r\nAdequate equipment.", "cons": "The current ambulance leadership team is out of touch with staff . Get used to the \"It's always how we have done it\" mentality. \r\nWhen asked for feedback, they just do what they want anyway. \r\nLots of pressure to pick up more shifts and when they are told no, you get treated poorly for \"not pulling your weight\". \r\nThe amount of PTO/Time off earned is great but the scheduling holds they key to approvals and the rules change as they sees fit. \r\nPromises are made to suck you in and sell you on an idea then when it doesn't follow through, blames HR.\r\nThe pay is baseline poor and they will again, blame HR or upper management. \r\nLeadership team receive little guidance or leadership training, or just don't care. The people that do care end up realizing how bad it is and leave. (Making more holes in the schedule to fill.)\r\nDispatch is told to accept all the calls they can and when someone with a brain speaks up and says no, the decision gets overridden and takes the calls anyway causing a huge work load for a small amount of staff on duty. \r\nStaff are resigning almost weekly to get away from the huge burden of long hours, no meal breaks and poor treatment by supervisory staff & dispatchers. \r\n\r\nSupport is extremely lacking and the egos are toxic at best."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Behind the Scenes at DH\r\nBehind the Scenes at DH", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Nov 2008", "job_title": "ER PCT in Danbury, CT", "duration": "N/A", "pros": "Experience and good people to work with overall.  It is the best community based hospital in the area.", "cons": "Not sufficient recognition.  Management has obvious favorites and it shows in unfair treatment and promotions."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Corporate corrupt", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Jan 2018", "job_title": "Nurse in Danbury, CT", "duration": "N/A", "pros": "Self imploding company.  Parking is not enough. There are no pros.", "cons": "HR is scandalous.  They change their version of rules and requirements when convenient for them.  They also black ball and seek out the worst in people believing lies and rumors.  HR doesn't do their job with background checks forcing the applicant to do their job.2"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Ass kiss driven", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Feb 2011", "job_title": "Desktop Support in Danbury, CT", "duration": "N/A", "pros": "Insurance is great from day one.", "cons": "Management needs to show respect to employees"}], []]