[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place for growth", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Feb 2022", "job_title": "Substance Use Counselor in Aloha, OR", "duration": "N/A", "pros": "Great place to get your education hours and find which route you want to take in the industry because they offer many options", "cons": "Lower salary scale but they make up for it in other ways like career development and loan forgiveness"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "HIGH turnover NOT trauma informed", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Jul 2023", "job_title": "Case Manager in Aloha, OR", "duration": "N/A", "pros": "It was a job, they have high turnover", "cons": "I was let go because my report of an escalation incident with an SPMI cloent known for violent outbursts differed from what was reported by client. I was given no opportunity to review video (with no sound) used for determining my status"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Don't walk away....RUN!!!!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 May 2023", "job_title": "Residential Counselor in Portland, OR", "duration": "N/A", "pros": "Good to learn. Decent pay. Gr8 benefits.", "cons": "Simply just a horrible place to work!! Not valued as an employee. Your input or concerns do not matter!! They seem to enjoy firing you in front of the clients & your peers sadly enough. Your expected to make meals from the daily menu but won't buy what you need to do so or put on the shopping list!! The list goes on & on."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Stressful experience under current Director", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 May 2023", "job_title": "Clinical Care Coordinator II, Team Lead in Aloha, OR", "duration": "N/A", "pros": "Great team support; very rewarding work; opportunities to earn CEUs are strong", "cons": "The Director (hired in 2022 and still there currently) has very negative application; non-supportive and manipulative. The supervisors are inefficient to say the least. Sexual harrassment is dismissed and inappropriate/biased regulations are aimed toward LGBTQ employees regularly by supervisors, the Director, HR & Exec. Director. People are not hired/promoted based on ability, but based upon willingness to comply. Director takes credit for work of others."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great Place to Work and Learn.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Mar 2023", "job_title": "Mental Health Clinician in Portland, OR", "duration": "N/A", "pros": "Clients, colleagues, flexibility, supportive environment. Improving on many fronts.", "cons": "Caseloads are unrealistically huge which affects morale."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid this place", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Sept 2022", "job_title": "Residential Counselor in Aloha, OR", "duration": "N/A", "pros": "There are none. Trust me.", "cons": "Management, residents, leadership, transphobic coworkers, everything."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Good internship site, Unfairly Micromanages Professionals", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Mar 2021", "job_title": "Clinical Care Coordinator in Aloha, OR", "duration": "N/A", "pros": "Fellow clinicians were the best people on earth & good varied client workload, great learning for interns & can gain fasttrack of clinical hours. Some good benefits.", "cons": "It is unfair & unsafe to employees to force them into the office during the pandemic to perform by telehealth; production pressure gives no time to handle high level of case management or to finish clinical paperwork; in NO way should salaried employees be expected to complete work on their own time; professional-level clinicians are micromanaged & treated like low level employees; policies like not allowing pre-schedule of clients are stupid & harmful; clinicians should not be expected to clear their client schedule for constant new intakes, hire enough intake staff for that. A lot of decisions that make no sense & a lack of self-care support for employees. Pay is way too low for the demands."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Bad management", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Dec 2021", "job_title": "Group Home Manager in Beaverton, OR", "duration": "N/A", "pros": "100 covered medical and dental", "cons": "Policies are not followed by upper management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Company, Great Work Environment, Great People", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Mar 2021", "job_title": "Therapist in Beaverton, OR", "duration": "N/A", "pros": "Just in this past year with COVID, I believe they handled the situation as best they could as anyone did. They allowed those who had underlying medical issues to immediately work from home. Also, those jobs that could do work from home they allowed it. The managers have been great in supporting us. I have worked here for a little over a year and have enjoyed it.", "cons": "The pay could be better, other than that a great work environment"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DANGER!!!!DANGER WILL ROBINSON!!!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Mar 2021", "job_title": "Clinical Care Coordinator in Portland, OR", "duration": "N/A", "pros": "good place to get your supervision hours, in order to get your license", "cons": "Very Toxic environment, Management with the new clinical director and new and old managers has become extremely suspicious of their employees and is micromanaging every worker, which has caused a very toxic, unhealthy and suspect environment,the LGBTQ+ and other minorities are being forced to quit, resign, or are getting fired.they lack equity and inclusion."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The structure is there (sort of). The support and empathy are not.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jul 2017", "job_title": "Substance Use Counselor in Aloha, OR", "duration": "N/A", "pros": "Excellent, diverse population of participants, with some very dedicated and competent clinicians. Medical benefits are generous. Training funds available to staff.", "cons": "There is a VERY high turnover rate, even for a human services agency. Upper management is fractured and understaffed at best, and flippant at worst, with very little time or energy given to address real concerns that clinicians have. There is no proper outlet for these concerns to be addressed. It's bureaucracy without the tools in place to navigate it. Be careful bringing up anything that may point to larger institutional problems or ethical concerns, or they have no qualms with making you disappear without regard to continuity of care for the ones we serve. \r\n\r\nThe lack of recognition and engagement leads many to finish their licensure or other credentials and find somewhere else to work (that is, when there is actually enough management to provide proper clinical supervision). Don't expect to be here for the long term, and those receiving services will ultimately be the ones who suffer from being shuttled around to different therapists and case managers.\r\n\r\nI downplayed the other reviews on this site and accepted the job anyway. What they say is very real."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company with great work incentives and support.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Jan 2019", "job_title": "Anonymous Employee in Aloha, OR", "duration": "N/A", "pros": "Sequoia Mental Health Services is a great company to work for. You get ample time off for vacation, sick days, and Holidays. They are flexible with allowing you to use PTO because they understand work/life balance is important in preventing burnout.  You get PTO for acquiring continued education in addition to reimbursement for continuing education (even if you're not licensed). Professional development is supported and encouraged by management.  Dress code is business casual and as long as you're modest you can dress modern/unique (including having colorful hair).  Colleagues are supportive and collaborative. There is no bullying that I have witnessed or retaliative behavior. The work environment is friendly and caring. It is also fast paced, which I enjoy because it is never boring. The health insurance, dental insurance, and vision insurance is great coverage if you are single. They are supportive of colleagues using FMLA should any illness arise, from what I have seen. Each month they provide all staff training to keep staff up to date with therapy modalities or changes occurring on state/county level that may effect clients. Overall I love working for this company. I appreciate the support from management, the work incentives, and how it doesn't feel like some large corporation.", "cons": "Too much concentration on the business model, from supervisors to line workers and not enough focus on providing treatment."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Best agency I have ever worked for - Very committed to client care", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jun 2015", "job_title": "Therapist in Aloha, OR", "duration": "N/A", "pros": "Sequoia Mental Health is a very positive, supportive and appreciative environment to work in. Everyone, from management to direct care staff, are deeply committed to our clients and providing the best possible care. Staff have the ability to directly communicate their ideas and struggles to their Supervisor, the Clinical Director and the Executive Director. Community Mental Health is stressful and hard work and Sequoia has found a way to make it as supportive and positive as possible. I recommend Sequoia to anyone who wants to learn and grow as a clinician!", "cons": "There have been a lot of changes in the past year due to payment methodology that have been challenging for everyone. It is such a shame that a few people who have likely left or were let go say such inflammatory things against the agency that simply are not true. We have wonderful dedicated staff, many of whom have been here for years, as well as new clinicians bringing energy and enthusiasm to the teams at Sequoia. This site shows the old adage that most of the people who complain are people who have a beef or got in trouble because of poor performance."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "counselor/case manager", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 May 2015", "job_title": "Counselor/Case Manager in Aloha, OR", "duration": "N/A", "pros": "Nice building. Seems professional. Counselors and case managers are awesome hardworking caring people.", "cons": "High turnover in staff. Some leave voluntarily. Others fired. Staff turnover is more then 60%. Even if firings were for \"cause\" it causes extreme stress in employeea to have cubicle matea \"just disappear\" and not be able to find out why. Staff is told the employee knows it is coming and they can't discuss it due to confidentiality. But firings  and \"disappearances\" happen on a weekly basis on average.  Those who stay are told not to discuss \"disappearances\" or anything else. The clinical supervisor and most supervisors don't even say good morning. Doubt they are shamed. Probably more that they have personality disorders. There reactions might be truthful since you may be firing  you by y afternoon.  Very dehumanizing environment. . I'd think it it is a sign of the times, but the rate of turnover is extremely high. I wish there was some oversight by the board of directors, but they are invisible. I hope someone who is fired files a lawsuit. That is probably the only way to make change, unfortunately.  Clients and counselors/ case managers are just awesome but management is not."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Feeling stresses? Rumors becoming overwhelming?", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Jun 2015", "job_title": "Anonymous Employee in Aloha, OR", "duration": "N/A", "pros": "Speaking open minded with management when work bullying and rumors don't seem to stop even when confronted and you feel that this environment is not conducive to the work we do. Informing of discontent will hopefully have a positive end result.", "cons": "Feeling empowered after expressing concern, worried about impact on employment status? Morale is at an all time low, difficult to hear negative all day long from every direction, and leave each day feeling rejuvenated, excited to start the next day. Feeling that any moment you might be terminated or that your only option is to constantly look for other work because of the history of employee turnover being so high and often out of the blue."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "They pretend to care about you as an employee", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jun 2014", "job_title": "Residential Counselor in Aloha, OR", "duration": "N/A", "pros": "Co-workers who really care, clients are great.  In fact, the turnover rate is so high, clients were crushed to lose great people they grew to trust.", "cons": "You're not appreciated.  Supervisors and executives don't care about your well being.   Just as long as there is a body present, they don't give two you-know-whats about you.  On occasion they will SAY you're appreciated but actions speak louder than words, and I haven't seen any action taken.  You work way too hard physically and mentally for so little pay and no opportunities for raises."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Laid back residential treatment Counselor job", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Jan 2019", "job_title": "Anonymous Employee in Beaverton, OR", "duration": "N/A", "pros": "I had a health issue come up right before my probationary period was up after starting. I ended up in the ER. They sent the flowers, and since it was uncertain how long i would be gone, and i hadn't been there long enough for a LOA, they told me if I wanted to come back I'd have to do training again but that I'm welcomed and encouraged to. This company seemed to care and go out of their way to show it in the short 3 months of me working there more than other companies I had worked at for years had, ever! There's a lot of autonomy, easy job with great co workers and supervisors. I didn't work for or with anyone that I dreaded which usually doesn't happen. There's usually at least one person who has to ruin it", "cons": "It can get boring, especially the NOC shift. But that's also where u could spend nearly your entire shift studying or something else as long as you're in the building and making hourly bed checks"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "an agency run very poorly", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Sept 2016", "job_title": "Residential Staff in Aloha, OR", "duration": "N/A", "pros": "None other than the incredible staff", "cons": "DO NOT WORK FOR THIS AGENCY. The agency is at best neglectful and abusive to its clients. While still an employee with this agency, they were under investigation following multiple abuse and neglect allegations in addition to county and state response after a number of employees came forward to describe extremely unsafe, sketchy working conditions.  Administration has an unusual habit of perceiving state and federal law as open to interpretation. Clients requiring the most help are left without the appropriate level - if any - of care. The agency cannot keep staff members for more than a couple of months. Be very careful if you are considering involvement with this company but do yourself a favor and DONT GET INVOLVED."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Mental health DECOMPENSATION services.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Sept 2015", "job_title": "QMHP in Beaverton, OR", "duration": "N/A", "pros": "Colleagues are very supportive. I'm talking about regular colleagues, not superior colleagues.", "cons": "Superior colleagues are not supportive at all. They \"hear\" your concerns and then just go on with life as though it's all sugar and rainbows. Well, here's the thing: Client's should be the priority, not shoving them all in the door like sardines and then not seeing them for a month. \r\nCase loads are WAY too high, which means more mental health DECOMPENSATION while they all have to wait 3-4 weeks between sessions. Nobody can progress with that time frame. \r\nAll the managers have a different answer for anything you have a question about. None of them are on the same page. EVER.\r\nYou get hired and are all excited to have a job, meanwhile 5 people are on their way out the door because they can't stand the place anymore - or they simply can't take the horrid way they're treated.\r\nThree words describe the agency: Walking HIPAA Violation.\r\nDon't make the same mistake I did by applying here. You won't be glad you did."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "if you want to fall ill from stress, apply", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Jun 2015", "job_title": "Case Management in Aloha, OR", "duration": "N/A", "pros": "The staff is amazing and compassionate.", "cons": "Management is terrible. Never have I worked at such a hostile environmentand let me say I'm use to strict work environments. Very unethical, people quit or get fired. There is at least 3 firings if not more a month. I'm not exaggerating.  Management makes fun of staff. We can hear them. I'm just glad I don't work there anymore. I got sick physically and know other people have. The nice comments were most likely written from management. I always felt like I could be liable for some fraudulent billing. That's how much anxiety I was under.  Just very difficult when we are being led blindly."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Case Manager/QMHP", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Sept 2015", "job_title": "Case Manager/QMHP in Aloha, OR", "duration": "N/A", "pros": "Clients are great. Many of the case managers and therapist care about their work. New office building in Aloha.", "cons": "Although the new office building in Aloha is nice, the money may have been better spent for better homes and a facility for the residential clients. The bottom line is that the residential facility and homes are disgusting with mold problems, roof leaking issues and just a general foul odor at all sites. Residential management is awful and people are played against one another. Unprofessional, unethical and toxic atmosphere."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Invaluable opportunity for mental health experience with irreplaceable coworkers cheering you on", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Mar 2018", "job_title": "Case Manager in Aloha, OR", "duration": "N/A", "pros": "I absolutely love working for Sequoia. The work is challenging and may be overwhelming at first. But if you’re able to stick through the first three months of navigating systems, policies, and personalities, you’re set to continue developing irreplaceable experience in a fun, fast-paced work environment. \n\n- Management has improved significantly since I’ve started working here. There are changes constantly being implemented to improve the structure of the agency. \n\n- Coworkers are awesome. With new management, Sequoia is doing a fantastic job at fizzling out lazier, unethical employees, and you’re left with a friendly, diverse coworkers who are always willing to help out as needed, and who really care about the work they do and the clients they serve.\n\n- Relaxed atmosphere. You’ll find people from all breeds of life working here and you’re free to be yourself. It’s not a suit and tie, heavily micromanaged organization. \n\n- Bonus incentives for meeting productivity\n\n- Allowed use of agency vehicles for community appointments - a lot of similar agencies don’t have this! \n\n- Generous PTO accrual and free healthcare \n\n- Flexible scheduling. Need to go to a doctor’s appointment? You can without the crippling anxieties of requesting PTO - go on your lunch break or at the start or at the end of your day. You have the freedom to flex your hours here, as long as you’re working at least an 8-hour day. Set your own schedule. \n\n- Supervision towards licensure \n\n- Monthly yoga \n\n- Team outings and company potlucks\n\n- Excellent opportunity to learn about social service systems and community resources. \n\n- Upper management works hard to put the agency in a constant state of improvement \n\n- Of course, the clients are absolutely amazing. I feel so fortunate to be serving the people that I do, and the work is personally fulfilling.", "cons": "- Training is disorganized and poorly structured, but this is being revamped\n\n- Pay is less than other agencies \n\n- Salaried positions mean you can easily find yourself wrapped up in tasks and stay late, meaning there’s no overtime opportunities. \n\n- Forced to take PTO during agency closures (snow days). \n\n- Occasional lack of follow-up / follow through with upper management, but I attribute this to simple business or forgetfulness. This has improved vastly since I’ve started working here. \n\n- The work can be very emotionally taxing if you don’t implement enough self care into your life. \n\n- No room to advance within the agency"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst place I've ever worked!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jan 2017", "job_title": "Anonymous Employee in Aloha, OR", "duration": "N/A", "pros": "The clients you work with and co-workers", "cons": "Management is awful,  sets an environment that makes people constantly fearful of getting fired. They talks bad about people in meetings and is unusually cruel. Supervision consists of them talking rather than you actually getting supervision. Expectations are often unclear. Workload is incredibly high. If you are good st your job they will pile work and respondibolities and tasks on until you break and improperly train you. It's a toxic environment unless you are in the inner circle and even then watch your back.do not work here it will bleed you dry."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "From horrible to amazing in 2 years of needed change", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Jan 2015", "job_title": "Clinician in Aloha, OR", "duration": "N/A", "pros": "Whole new management with focus on recovery based principles, building new training for staff and supporting growth opportunities for staff and clients. With new leadership it is a whole different place than it was . A lot of laughter and hope", "cons": "a need for more employees high caseloads and growing faster than they are hiring"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Agency doing Great Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jan 2018", "job_title": "Anonymous Employee in Aloha, OR", "duration": "N/A", "pros": "I had the pleasure of working for Sequoia for a little over a year and a half.  Sequoia's employees are a great bunch of people dedicated to helping others while remembering to have fun when you can.    Everyone has busy caseloads, but are always willing to help a co-worker in need.  I enjoyed going to work each day as I felt valued as an employee.", "cons": "I don't have any at this time."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Caregiver", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Nov 2017", "job_title": "Caregiver in Aloha, OR", "duration": "N/A", "pros": "Sequoia is a good place to work. The staff is caring and in my opinion go above and beyond sometimes to help their clients. I was let go because of lack of work. Not true, but still no hard feelings. I will recommend Sequoia to anyone who is looking for employment or needs their help. They do great work!", "cons": "Rare but sometimes not so fair with employees."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Literally THE WORST!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Apr 2017", "job_title": "Anonymous Employee in Aloha, OR", "duration": "N/A", "pros": "There are wonderful clients at this agency, and staff care very much for their clients.", "cons": "Oh my gosh where do I even start?  Hands down, Sequoia is the absolute worst company to work for.  I was offered a position and accepted, despite the terrible reviews on this site.  I thought, \"well that won't happen to me.\"  I was wrong!  \r\n\r\n1- Absolutely no training provided.  You are thrown to the wolves from day one.  Managers MIGHT introduce new employees around the office,  but usually do not.  This leaves new employees to blindly figure out who to talk to.\r\n\r\n2- There is no consistency in management.  At all.  You can speak to three different managers in one day and get three entirely different answers to the same question.  They do not talk to each other and basically expect the employees to deliver messages to other managers.  \r\n\r\n3- Snide remarks, rude behavior, talking badly about employees is a daily occurrence by management.  You will overhear conversations between management and employees that should be left behind closed doors.  Managers will literally come to your desk and ask what you think about other employees, while making fun of them.  If you think it hasn't happened to you personally, you're most likely wrong.  \r\n\r\n4- Management DOES NOT have your back.  EVER.  They put up a good front, and say they will back you.   But the moment your back is turned they will strike, and make you look like the worst employee they've ever had.  \r\n\r\n5- HR does NOT have your back either.  They are in cahoots with managers and will do anything they can to sabotage you, and destroy your work and reputation.  \r\n\r\n6- Expect meetings about you to happen without you being there.  Several people will hold meetings about employees and won't invite the employee to explain anything.  \r\n\r\n7- Extremely high turnover.  In my time there I can't even count how many employees quit or mysteriously disappeared from the office one day.  Even the Doctor's at Sequoia leave!  \r\n\r\n8- Different expectations for people on the same team.  You will find yourself resenting coworkers because they will be treated much differently than you are.  \r\n\r\n9- They will fire you at the drop of a hat.  You will not see it coming.  You will not have verbal or written warnings.  Nothing. \r\n\r\n10- If you are let go, and try to collect unemployment, expect them to fight you tooth and nail.  They will lie like mad to make it appear that you were an awful employee.  Keep records of EVERYTHING.  Every conversation you have with management get it in writing.  This will come in handy later when you try to defend yourself.  \r\n\r\nI could go on, as there are many more negative things that happen in that agency. If I could give them zero stars, I would have.  I loved my job, I loved the clients, but I have nothing good to say about management.  \r\n\r\n\r\nIf you are thinking about working at Sequoia my advice is RUN!  RUN FAR FAR AWAY!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worse place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jan 2017", "job_title": "Residential Counselor in Aloha, OR", "duration": "N/A", "pros": "The only good thing about this place is getting to know and help clients through their recovery", "cons": "Horrible to staff and clients \r\nNo respect for staff and clients \r\nNo pay differential for graveyard \r\nTreats staff differently after on job injuries or pregnancy. \r\nStaff talks behind back\r\nDoes not drug test staff who are working with clients in treatment. \r\nDON'T WORK HERE"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "ACT Clinician", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jun 2015", "job_title": "Clincian in Aloha, OR", "duration": "N/A", "pros": "Clients are awesome to work with, broad range of duties, some awesome clinicians that really care.", "cons": "Horrible organizational issues, no training of any purpose, steep learning curve, largest turnover rate I have ever encountered, management cares little for employees as employees quit or let go constantly, was asked to do things I find unethical when came to charting and billing."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Listen to the bad reviews- they are all right!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Apr 2019", "job_title": "Front Desk Receptionist in Aloha, OR", "duration": "N/A", "pros": "24 days off\r\nNice, friendly people at the top", "cons": "Unpredictable and at times, dangerous, clientele, weird shift patterns, employees talk about people suffering from mental illness in a disrespectful manner (e.g. complaining about having a crisis line and almost boasting about how many previous patients they have had commit suicide)"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "QMHA", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Sept 2015", "job_title": "Community Integration Specialist in Beaverton, OR", "duration": "N/A", "pros": "Sequoia is the best team player organization I have had the pleasure of being part of. There are collaborations between all the employees that keep the organization running smoothly. Clients are our number one priority.", "cons": "There are no cons to working with this organization"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Once a good place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Jun 2014", "job_title": "Supervisor in Aloha, OR", "duration": "N/A", "pros": "There are a lot of good people who work there, and who do their jobs for the right reasons.", "cons": "The executive team has become corrupt. Some members violate the rules of the organization and agency code of ethics in the pursuit if their own personal agendas."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible place!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jun 2017", "job_title": "Case Manager in Beaverton, OR", "duration": "N/A", "pros": "Opportunity to help some very wonderful and vulnerable people", "cons": "Terrible management. Employees allowed to bully one another. Ridiculous standards for client care - moving clients precipitously from one case manager to another. Complete \"gotcha\" attitude on the part of superiors."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not the greatest", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Mar 2016", "job_title": " in Beaverton, OR", "duration": "N/A", "pros": "The agency's mission and the hard working case managers.", "cons": "Wages are low for the amount of work employees do. Management is not very friendly and approachable."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "great company", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Sept 2020", "job_title": "Medical Assistant in Beaverton, OR", "duration": "N/A", "pros": "I gained lots of knowledge in the mental health field working with Sequoia", "cons": "There is definitely room for improvement. The RN/LVN is a joke"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst job ever", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Jan 2019", "job_title": "Case Manager in Beaverton, OR", "duration": "N/A", "pros": "Opportunity to help some vulnerable people", "cons": "Inconsistent management, staff backbiting, no respect from supervisors, employees allowed to bully coworkers"}]]