[[{"date": "15 Jun 2023", "title": "Graduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Elon University (Hatton, KY)", "Interview Descriptions": "Very good people. Felt welcome in the interview. Basically asked if the task would be research or study. My focus was study. Very happy to accept. Mana mana, but that's how the world works", "Interview Questions": "How many years experience do you have"}, {"date": "9 Mar 2023", "title": "Campus Recreation Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Elon University", "Interview Descriptions": "Great interview, very friendly. Questions about leadership and how I would be an asset to the team. They did have some fun personality questions like \"what song would you play when you walk across the stage to get your diploma?\"", "Interview Questions": "Tell us about yourself Do you have customer service experience"}, {"date": "15 Apr 2021", "title": "SPDC Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elon University", "Interview Descriptions": "The interviewers were formal but approachable/welcoming. The office itself seems friendly and like there is a good work community.\nAct very professional and knowledgeable. \nAround 30 minutes, wanted to know  extracurriculars, hobbies, fields of interest, etc. \nAsk questions, they seemed to like that!", "Interview Questions": "Explain a time when you exemplified grit in response to a hardship."}, {"date": "7 Jun 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Elon University in Mar 2021", "Interview Descriptions": "The process was virtual and a very organized and open process.  Met with multiple members of the hiring board and went through both a group and individual interview.  More of an open discussion.", "Interview Questions": "How will this role benefit your personal and professional development."}, {"date": "5 Feb 2021", "title": "Faculty Member Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elon University", "Interview Descriptions": "Faculty interview is multiple step. An online interview with all members of the search committee focuses on teaching experience and describing a trajectory for research. It's important to show an understanding of Elon's context as an undergraduate-focused, teaching-heavy institution.", "Interview Questions": "What is your main goal as an instructor?"}, {"date": "1 Oct 2020", "title": "Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elon University", "Interview Descriptions": "I met with both two senior leaders and the team of colleagues I might be working with.  I was not given a test, and I did not meet with HR.", "Interview Questions": "Do you think print media will cease to exist?"}, {"date": "27 Aug 2020", "title": "Assistant Director of Donor Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elon University", "Interview Descriptions": "Lengthy process interviewing with several small groups. Took approximately 6-7 hours. Very kind team members committed to university success. Second time interviewing with this department and the process was similar to my first experience.", "Interview Questions": "Questions about job experience relating to skills needed for job,"}, {"date": "28 Jun 2020", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elon University", "Interview Descriptions": "Very professional and committed staff.  welcoming environment. Small institution, and very connected campus, which is a plus. I was interviewed by a team of people. Definitely recommend applying  if you would like to go for it. I thoroughly enjoyed.", "Interview Questions": "Previous experience advising students"}, {"date": "2 Feb 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elon University (Elon, NC) in Feb 2020", "Interview Descriptions": "First was a phone interview, followed by zoom interview, followed by an all day in person interview. The job offer was made about one week after the final interview had ended.", "Interview Questions": "How are you able to juggle multiple projects at once?"}, {"date": "12 Nov 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Elon University", "Interview Descriptions": "Very good. Very professionally run. Analytics is a very good field to be in. I deeply enjoyed the conversations that I had with people at Elon university and the time that I spent there developing deep connections.", "Interview Questions": "Why do you want this job?"}], [{"date": "10 Oct 2019", "title": "Chinese Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Elon University", "Interview Descriptions": "Got a phone interview first about half an hour, then did a second round interview in the university.  They gave me a knowledge point before the second round interview, and asked me  to deliver it to the class.", "Interview Questions": "Go through the resume, tell me about yourself. "}, {"date": "3 May 2022", "title": "Campus Recruiting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Elon University (Elon, NC) in Jan 2019", "Interview Descriptions": "Excellent, It was a great process and a great job I would recommend highly. Be prepared clear eyes full hearts can't loose. Elon Campus Rec is great! A lot of great experiences and a lot of great work", "Interview Questions": "Are you a good fit"}, {"date": "4 Jan 2022", "title": "Student Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Elon University (Elon, NC) in Oct 2018", "Interview Descriptions": "3 one-on-one interviews with 3 different professors. The rest of the interview day consisted of tours and lunch with other candidates and current students. There is also a financal meeting to discuss projected tuition.", "Interview Questions": "Tell me about the biggest challenge you have faced. "}, {"date": "30 Mar 2018", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Elon University", "Interview Descriptions": "Group interviews and individual interviews. There is a lot of hype surrounding the interviews which causes many applicants to be completely stressed in the group interview. In all honesty, the questions are not difficult if you have prepared before. The key would be to stay calm, show your personality and know as much as possible about Elon and the experiences it offers students. I suggest talking about your own personal experiences and not your friends.", "Interview Questions": "What accommodations and services are available to students with disabilities?"}, {"date": "26 Nov 2019", "title": "Process Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Elon University (Elon, NC) in Jun 2017", "Interview Descriptions": "It was solid. The employers did a great job of making me feel comfortable and enjoy the process. I got to test out the job which was exciting. My boss ended up being the person who interviewed me which was a good experience.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Jun 2019", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Elon University (Burlington, NC) in Mar 2017", "Interview Descriptions": "Resume review, personal referral, onsite interview with two department leaders for 45 minutes each in their respective offices, highly conversational including a series of questions about myself, relevant experiences and aspirations. They also spent time talking about the department and expectations.", "Interview Questions": "Why do you want this position?"}, {"date": "19 Feb 2018", "title": "Service Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Elon University (Elon, NC) in Jan 2017", "Interview Descriptions": "I initially applied online via the on campus job network. Then, I scheduled a Skype interview as I was not on campus for an in person one. A few days after that I got the job offer.", "Interview Questions": "How well do you work with computers?"}, {"date": "26 Jul 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elon University", "Interview Descriptions": "I applied through LinkedIn, then got a message about a phone interview. I then had an interview with three professors in the same department. Last I had to do a teaching demonstration.", "Interview Questions": "What is your teaching philosophy? What textbook are you planning on using?"}, {"date": "4 May 2016", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Elon University", "Interview Descriptions": "Phone call to set up interview with group. \r\n\r\nInterview went smoothly, some probing questions, made comments they were moving quickly. \r\n\r\nGot a call a few days later informing me I was not moving forward. Disappointed due to my experience in this level in admissions. Oh well.", "Interview Questions": "N/A"}, {"date": "30 Mar 2018", "title": "Service Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Elon University (Elon, NC) in Mar 2016", "Interview Descriptions": "A very positive experience during the interview. Hiring managers were encouraging and helped me through the process by providing me feedback. The rest of the employees also supported me through the process and told me about the positive environment that I could be part of.", "Interview Questions": "how will you contribute to the job? "}], [{"date": "10 Nov 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Elon University (Elon, NC)", "Interview Descriptions": "Good--1 long day. Teaching and research presentation. Coffee with students. Meeting with the dean came last. Car rental, dinner, lunch provided. Reimbursement was fast. Met with faculty and associate provost. The campus is beautiful, but can be tough to navigate. Be sure to leave early to find the buildings.", "Interview Questions": "They asked about my philosophy of teaching, books I'd use. There was a lot of comfortable conversation. No one was adversarial. Just trying to get a feel for fit with culture."}, {"date": "9 Apr 2019", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Elon University (Elon, NC) in Jan 2015", "Interview Descriptions": "Full-day interview in which I was asked to teach a class, offer a research presentation and meet with a variety of administrators. Tiring. Asked to do the research presentation at the same time as lunch.", "Interview Questions": "What is your philosophy of teaching?"}, {"date": "3 Jun 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Elon University (Elon, NC) in May 2014", "Interview Descriptions": "Began with phone interview round, followed by an in-person presentation and question round. Presentation was in front of about 20 people. Knowing people in the office is valuable to make it to the phone round. Phone round focuses on content of answers, whereas presentation focuses on interpersonal skills. After group presentation, expect to sit down with several deans, apart from the larger group.", "Interview Questions": "Why are you interested in being an admissions counselor? How would you recruit a diverse student to Elon? Where do you plan to be in 5 years?"}, {"date": "17 Sept 2015", "title": "Career Advising Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Elon University (Elon, NC) in Mar 2014", "Interview Descriptions": "Apply via HR website (also found posting on higheredjobs.com); first round: Skype; second round: on-campus. Found out about offer, just a few days after second round interview. Met with current career advising fellows, director of career services, hall director (for programming collaboration), career advisor. Enjoyed group and individual conversations, and gave a presentation (was provided prompts) to career services staff.", "Interview Questions": "How would you handle the situation where you send an email two times to a professional group on campus and haven't received a response back? "}, {"date": "29 Aug 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Elon University", "Interview Descriptions": "Go to the student employment website and check for openings, specifically before the school year starts. Once the semester has already started, many jobs will already be occupied. The exception is Campus Rec, which holds a job fair shortly after school starts. If their is a opening, you can either submit an application online, or you would have to pick up a copy at the job site. You will normally have at least one interview, you will at least two or three if you apply for Campus Rec.", "Interview Questions": "Where do you see yourself in five years? It is not a hard question now since I am out of school. But very difficult when I was a freshman."}, {"date": "24 Jun 2013", "title": "Instructional Technology/AV Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Elon University (Greensboro, NC)", "Interview Descriptions": "This position was within Elon Law School. From the date that the position stopped accepting applications to the date they gave me my final disposition took 3 months. It took a month to receive an invitation for an initial Skype interview. The interview was with their \"hiring committee\" and consisted of the standard interview questions. After the Skype interview was completed I was asked to come for a face-to-face interview the following week. This interview took 4 hours and included talking with faculty, staff and students. I was also asked to prepare and give a 30 minute presentation on some type of educational technology (very little instructions were provided for this part). \r\n\r\nEveryone seemed very professional and experienced. The staff and faculty were friendly and seemed vested in the person who was going to be taking this position. I was given the opportunity, at the end of the interview, to ask questions about the job and details. The benefits seemed competitive with other similar institutions but answers to question of pay were confusing. When asked about the pay compensation, the reply was \"Well, we pay lower than most other higher education institutions. You are hourly, so it will be low 20s.\" It was not specified if this was low $20k/year or low $20/hour... I tend to think low $20k/year, somewhere in the range of $12/hour.\r\n\r\nAfter the face-to-face interview my references were all contacted within 3 weeks. After my last reference was contacted, I emailed the position contact (that I had been in contact with since the first interview) and reiterated my interest in the job and inquired whether they had an updated time table for the rest of the interview process. I received no reply after two weeks. So I emailed the contact again, thanking them for being a possible candidate for their position and letting them know that anything additional they need from me I would provide. Another week and a half went by without a reply from the interview contact. I finally got an HR automated email saying that I was no longer being considered for the position. \r\n\r\nOverall the process seemed entirely too drawn out for the position and requirements. The staff and faculty were very professional when I met them face-to-face but I would have liked to get a reply to the multiple emails that I sent to the job contact (almost a month with no replies). I feel that the lack of reply displayed a fair amount of unprofessionalism for a person tasked with hiring and welcoming applicants and new hires into a position.", "Interview Questions": "How would you interact with faculty members in order for them to understand that integrating technology into their lessons could be beneficial?"}, {"date": "9 Mar 2013", "title": "Technology Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Elon University", "Interview Descriptions": "Needlessly long and complicated given the fact that Elon hires based on degree and the ability to manipulate.", "Interview Questions": "What color is your brain?"}, {"date": "21 Jul 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Elon University in Aug 2012", "Interview Descriptions": "Very laid back; asked more questions about personal life than work skills. They understood that I was only beginning my college career and that I would not know much. Helped me to learn more about Elon and get acquainted to the school because the office exposed me to more aspects of Elon than a normal freshman would be exposed to.", "Interview Questions": "What are you planning on majoring in at Elon?"}, {"date": "11 Aug 2015", "title": "Assistant/Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Elon University (Elon, NC) in Jun 2012", "Interview Descriptions": "Thorough\r\nMultiple steps: phone interview, and on campus visit for two day interview. \r\nMultiple interviewers - faculty, staff, administration and  students.  Also received an extensive tour of facilities and surrounding area", "Interview Questions": "Career trajectory"}, {"date": "17 Sept 2013", "title": "Studio Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Elon University (Elon College, NC) in Feb 2012", "Interview Descriptions": "No interview. If there is an opening, supervisor will ask potential candidates if they are interested", "Interview Questions": "There wasn't an interview and the supervisor is very nice"}], [{"date": "16 Jun 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Elon University (Burlington, NC) in Sept 2010", "Interview Descriptions": "Hiring was a breeze. There is a lot of turnover and it seems that they are always looking to fill positions for adjuncts", "Interview Questions": "There was nothing difficult about the questions"}, {"date": "29 Apr 2009", "title": "Assistant Director, Career Services Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Elon University (Elon, NC) in May 2008", "Interview Descriptions": "The job was posted online on the employer's website and on NACEWeb. About 1 month after applying, I received a phone call for a quick 15 minute phone interview with one of the assistant deans at the school who was on the hiring committee. A short few days later, an invitation to come down to the school for a day-long interview was received via email. Upon acceptance, arrangements were made within a few days for an interview date. The interview was a full day from 9:00 am to 5:00 pm. It started off with coffee with one of the hiring committee members -- this was just an informal chat about how I got to be interested in career counseling and what the position entailed and what to expect for the rest of the day. This was followed by about 3 more 1-on-1 interviews with the dean, the supervisor I would be working directly under, and the supervisor's direct supervisor. The interviews all went extremely well except for the supervisor I would have been working for -- considering that he was the director of career services, he did a very poor job of interviewing me and I tried to give him the benefit of the doubt as he himself had only joined the school 3 weeks prior. However, I also took his behavior as red flag. He hadn't read my resume, and had to ask me 2-3 times what my name was in the interview. He asked me where I was working...which obviously is also on my resume. Then his cell phone rang and he answered it and proceeded to have a 30-45 second conversation with his wife. Extremely poor etiquette for an apparent \"professional\" who does career development for a living! Then he kept bragging about what a great director he is and said all these catch phrases like \"i don't abdicate, I advocate!\" After my interview with him, I interviewed with his supervisor, who was very nice but she ended up saying, verbatim, all the same catch phrases that described her supervising style...exact same wording! I don't know who's words were who's, but my gut feeling is telling me that the director of career services copied them from her. So I left that interview feeling like my prospective direct supervisor was a fraud. These interviews were followed by a group lunch interview with other career services staff and a few professors...this was more easy-going and relaxed, but still there were a lot of questions on what my ideas were for the career services office, how outreach to students could be done better, marketing ideas, etc. After lunch was a campus tour led by one of their students. Then there was a short break to relax, freshen up for a bit. Then a final interview with the chair of the hiring committee. Everything went extremely well and was very easy, it was just unfortunate the the director of career services was such a poor representative for the school and was seemingly problematic in his behavior. But otherwise, the folks at Elon are gracious and pleasant, very easy-going. I would have felt extremely comfortable working their. There was such great hospitality displayed. The director of career services is not from North Carolina...he's from Ohio or somewhere...so he obviously didn't have the hospitable nature like the other southerners that worked there. Elon's campus is also gorgeous and an ideal work environment. It's just too bad that the director of career services doesn't fit the culture and work ethic of Elon. But for anyone looking for better quality of life, keep an eye on this employer...and maybe look for something outside career services, until this director leaves.", "Interview Questions": "The position was focused on the career counseling for students in the college of arts and sciences...a pretty broad field. How would you cater your career counseling and programming efforts to students in the drama or other arts departments? (From the drama professor)"}]]