[[{"date": "1 Nov 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Health Organization (Geneva) in Aug 2022", "Interview Descriptions": "I applied for a consultant position (remote work) that had been advertised. I was selected for the first step of selection/elimination through a written test after about one month. The written test was for three hours with three questions related to the topic and to be submitted via email. They were essay type of questions with 40, 30 and 30 points respectively. I received a regret response on my written test after two months.", "Interview Questions": "There were three essay questions"}, {"date": "27 Sept 2021", "title": "External Relations Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at World Health Organization (Geneva) in Apr 2021", "Interview Descriptions": "The interview was online and anonymous. This meant that the camera had to be off. The questions were as to be expected: Open questions about yourself as well as situational questions. They asked for examples of previous times when certain things happened, like conflict etc. There was also a specific question related to a hypothetical situation. One additional question was also asked in French.", "Interview Questions": "The most important question was the hypothetical question. It was really set to examine how i would react in a real life situation that may be exceptional but possible in that position."}, {"date": "8 Jun 2023", "title": "Risk Communication Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at World Health Organization (Geneva) in Feb 2020", "Interview Descriptions": "the process takes a way too long, at first you need to wait for the invitation for something like 2 months at its best, then for the test - other 2 months, and then (if you are unlucky one) - silence. no point to even try and contact hr, they don't bother to reply. anyway, I had this interview 3 years ago, and it seems they still trying to find since the vacancy always gets back relisted every 1 - 3 months.", "Interview Questions": "basic questions about yourself, strengths, weaknesses, conflict situation etc"}, {"date": "24 May 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Health Organization (Geneva)", "Interview Descriptions": "Interview process was relatively easy. Many questions involved the specifics of the internship I was applying for.  First interview was over the phone with two of the people I ended up working with.", "Interview Questions": "How familiar are you with web based research and integrating that into your work?"}, {"date": "16 Nov 2018", "title": "Technical Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at World Health Organization", "Interview Descriptions": "1st stage video, 2nd stage face to face. Seemed to be very corporate, not too much room for personal development but with good training nonetheless. Managerial style they described sounded like there would not be room for much autonomy.", "Interview Questions": "What are your greatest professional strengths?"}, {"date": "21 Oct 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at World Health Organization (Geneva) in Aug 2018", "Interview Descriptions": "Panel conversation with a direct report manager and the person from the business with whom you will interact mainly on the future project. After the presentation there were questions oriented toward possible synergies between the past experience and the current proposed role", "Interview Questions": "Question around the World Health Organisation and the context around its activities"}, {"date": "11 Feb 2018", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4+ months. I interviewed at World Health Organization (Geneva) in Jan 2018", "Interview Descriptions": "You usually have to take a written test which is quite similar to the ToR. You should have stories to demonstrate your competencies (again from the ToR) at the ready.", "Interview Questions": "Competency based. review the WHO competency document"}, {"date": "23 Jan 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Health Organization (Geneva) in Jan 2018", "Interview Descriptions": "The process was simple: they asked me about my background, told me about the job and then we looked at fit. We scheduled a call after we discussing times over the email. The interviewer expressed great interest.", "Interview Questions": "Tell me about yourself"}, {"date": "28 Feb 2018", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Health Organization (Geneva) in Jun 2017", "Interview Descriptions": "First, an email came from HR. informing me that I have been short listed. They sent about 10 questions that I had to answer within 2 hours. Time sensitive. After I passed the test. I had a panel interview within 1 week.  4 interviewers, each person had about 5-7 technical questions related to the position. \r\n1 hour in total for the interview.", "Interview Questions": "What challenges did you face? How did you overcome those?\r\nWhy do you think we have to hire you? \r\nWhat do you do at your current job?\r\nThe most difficult situation at your job.\r\n"}, {"date": "2 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at World Health Organization (Geneva) in Apr 2017", "Interview Descriptions": "My CV was screened and I was selected. Further,I had a one step video call with my supervisor who wanted to know more about my background,and my goals . We had a very interactive discussion ,where we debated on what kind of reserach project would be best suited to my skills and experiene.", "Interview Questions": "How can you contribute to this organisation."}], [{"date": "8 May 2017", "title": "Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Health Organization (Geneva) in Aug 2016", "Interview Descriptions": "There was an initial and a follow-up interview, both conducted by my direct supervisor.  The interview was relatively informal, but I had already worked with some other members of my supervisor's team.", "Interview Questions": "Tell me about your ability to work with a research team."}, {"date": "17 Jul 2016", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Health Organization (Geneva) in Mar 2016", "Interview Descriptions": "First a 2 hour written test, followed by a four person panel videoconference interview. The written test was scenario-based and looked at your technical abilities and public health knowledge relevant to the job. It involved 3 essay-type questions. The panel interview was very structured, they give you a booklet beforehand to help you prepare for the questions. The questions are competency-based, meaning they test your past experience dealing with situations you would be dealing with in the job (e.g. if you are meant to be writing papers, experience writing papers in the past, pretty straightforward). You are also expected to give answers in a specific format so that you can better outline your skills (e.g. explain the situation, define the problem or task at hand, explain your thoughts and actions during the task, describe the results).", "Interview Questions": "Why do you want the job?"}, {"date": "1 May 2016", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Health Organization (Geneva) in Oct 2015", "Interview Descriptions": "It was specific to the performance as Finance Assistant.The interviewer was testing on Personalty and skills on this Job.It was through a panel of HR assistant and Hiring manager.The question were clear enough and specific on prior performance.", "Interview Questions": "What was your achievement as a Finance Assistant"}, {"date": "13 Apr 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Health Organization (Geneva)", "Interview Descriptions": "I applied online through the web application portal, and then was contacted by email about a month and a half later from the specific department for a 1-1 phone interview. It lasted about 20 minutes, and had standard interview questions-- why you want to intern at WHO, why you're interested in health issues, etc.", "Interview Questions": "Describe your ability to work independently without supervision."}, {"date": "18 Jan 2017", "title": "Mid Level Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 12 months. I interviewed at World Health Organization (Geneva) in Feb 2014", "Interview Descriptions": "There were multiple written tests over several months. The job was cancelled and reposted several times. The actual interview also started with a written two hour test that was then brought to the interview for discussion.", "Interview Questions": "Questions were about various situations related to the organization, not as much about the position."}, {"date": "25 Feb 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at World Health Organization (Geneva) in Jun 2013", "Interview Descriptions": "Getting hired as an intern at the WHO came by pure coincidence. I met my adviser while on a study trip. The topic of my thesis was of interest to my adviser who offered me an internship after a short interview. After exchanging a few emails, the start date was set. After completing my thesis I moved to Geneva where my internship was taking place. The process was very simple.", "Interview Questions": "What are your expectations regarding this internship?"}, {"date": "4 Jan 2014", "title": "Directeur de projet Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Health Organization (Geneva) in Dec 2012", "Interview Descriptions": "Candidature et un tour d'entretiens via Skype. Le procès d'accueil est compliqué et trouver des réponses simples à des questions simples est prenant parce que personne ne prend la responsabilité de communiquer les faits.", "Interview Questions": "Il n'y a pas eu de questions difficiles ou inattendues. "}, {"date": "20 Jun 2014", "title": "Employé Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at World Health Organization (Geneva) in Feb 2012", "Interview Descriptions": "J'ai soumis ma candidature en ligne pour un poste vacant non publié, que j'ai appris l'existence par des contacts personnels. J'ai été informé de façon non officielle que j'étais présélectionné et que j'avais juste à rencontrer mon possible supérieur. Il m'a rencontré, nous avons discuté de choses générales pendant 30 minutes et quelques mois plus tard, on m'a informé par e-mail que j'étais sélectionné et une offre d'emploi était jointe.", "Interview Questions": "N/A"}, {"date": "10 Feb 2011", "title": "Media & Advocacy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Health Organization (Geneva) in Jan 2011", "Interview Descriptions": "There was a written test after having been selected. Then the phone interview lasting an hour\r\nWhy are you the best candidate, tell me of a time when you had to deal with a difficult team member, what is yor greatest weakness, how would you deal with a difficult boss and what steps do you follow to solve any given problem.....I tried my best but did not get the job", "Interview Questions": "Why are you the best candidate?"}]]