[[{"date": "23 Oct 2022", "title": "Nursing Student Externship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Regional Medical Center of San Jose (San Jose, CA) in Jul 2022", "Interview Descriptions": "Upon completion of application online, you will receive a call from a recruiter who will ask you how do you see yourself as a nurse in the future, and will then schedule you an interview from a manager. My interview was held during a job fair in a public space with multiple managers.", "Interview Questions": "Q: Tell me about yourself Q: How do you see yourself in 10 years? Q: Situational question- what would you do if you have a conflict with a staff? Q: What makes you a better candidate?"}, {"date": "18 Jan 2022", "title": "Ultrasound Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Regional Medical Center of San Jose", "Interview Descriptions": "The department is tough to find especially during the shut down. I Interview went smooth and the staff involved in the interview explained their expectations clearly. The staff involved in the interviews was attentive and answered any questions asked.", "Interview Questions": "What is your passion?\r\nWhat are you looking for in an employer?"}, {"date": "23 Aug 2021", "title": "New Grad StaRN Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Regional Medical Center of San Jose", "Interview Descriptions": "Did the video was self-paced and there were 4-5 questions. It was fairly easy and they give you unlimited tries to do the interview online. Overall, it was a good experience with them.", "Interview Questions": "Tell me about yourself\nWhere do you see yourself in 5 years"}, {"date": "12 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Regional Medical Center of San Jose", "Interview Descriptions": "I applied via an online application  process and was contacted by the hiring manager. I went to the interview, and I was asked questions in a panel interview with 4 staff members. it lasted about 30 minutes.", "Interview Questions": "How would you handle conflict in the work place?"}, {"date": "8 Dec 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Regional Medical Center of San Jose", "Interview Descriptions": "The interview process went pretty well. I was asked one personal question and the rest are situational questions.  i was also given the chance at the end to ask a question.", "Interview Questions": "How do you handle difficult patient?"}, {"date": "6 Oct 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Regional Medical Center of San Jose", "Interview Descriptions": "I was contacted by a recruiter, he asked a few questions before he helped me to set up an interview time that worked for me. After the interview  I got a position offer a few days later.", "Interview Questions": "How do you deal with calling Doctors for your patients, especially after hours?"}, {"date": "16 Jun 2016", "title": "Medical Scribe Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regional Medical Center of San Jose (San Jose, CA) in Apr 2016", "Interview Descriptions": "applied online and waited a week for a phone interview with CEP america, a person asked basic general questions about availability and how you handle stress and keep organized. then got emailed by the lead ER scribe a few weeks later for an interview on site in the ED. he recorded my answers on a packet that would be read by the doctor that could potentially hire you.", "Interview Questions": "what would you do if you saw another fellow scribe going on his/her phone on the shift?"}, {"date": "4 Jan 2016", "title": "RN ICU Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Regional Medical Center of San Jose in Sept 2015", "Interview Descriptions": "There was only 1 interview and it was done with the unit manager. After that, I met with HR and basically to ask them if you have any question about the pay and benefits. The process takes about 5 days", "Interview Questions": "Tell me a time when your patient deteriorated and what you did."}, {"date": "25 Dec 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Regional Medical Center of San Jose (San Jose, CA) in Jun 2014", "Interview Descriptions": "You are interview by director and staff. You were asked question by one by one.  They left room for questions in the end.  They were all very professional and nice.   The process was long but very efficient.", "Interview Questions": "Situational questions "}, {"date": "8 Oct 2013", "title": "Lab Assistant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regional Medical Center of San Jose (San Jose, CA) in Oct 2013", "Interview Descriptions": "Recruiter called me to have a in person interview with hiring manager. Turned out to be a two person interview.", "Interview Questions": "Phlebotomy tech questions:\r\nWhat is a blue top tube used for?\r\nWhat is a PKU?\r\nWhat is the lavender top used for?\r\nTell me about yourself?\r\nDo you have any hospital experience? (They want phlebotomy experience) "}], [{"date": "8 Sept 2011", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Regional Medical Center of San Jose (San Jose, CA) in Nov 2009", "Interview Descriptions": "The initial interview was made difficult by playing phone tag for a couple of weeks, but as soon as contact was made, the interview took off.  I had to do some drug calculations by phone and answer a few questions about my Critical Care experiences.  I was then brought to California for the personal interview and ICU testing.  After the tests were completed and graded, I received an invitation to join the ICU team.  Salary and moving allowance was negotiated and I've been there since 2004", "Interview Questions": "Are you racially prejudice"}]]