[[{"date": "3 Jun 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chase Brexton Health Care (New York, NY) in Jan 2023", "Interview Descriptions": "Great and very nice manager who made me comfortable and valued. Even was offered nice coffee and bagel. They even had a toaster to toast the bagel. Free peanut butter, cream cheese 👍", "Interview Questions": "Technical skills word excel PowerPoint figma Google SEO and speaking sills."}, {"date": "24 Nov 2021", "title": "Population Health Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chase Brexton Health Care", "Interview Descriptions": "A lot of questions and nice managers. Felt very welcomed and already apart of the team. Questions were easy to answer and based off experience and knowledge. Explained job description in details and described you daily tasks.", "Interview Questions": "Tell me about yourself ?"}, {"date": "22 Jan 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Chase Brexton Health Care (Baltimore, MD) in Jan 2020", "Interview Descriptions": "Simple very down to earth make you feel comfortable gives you a chance to ask questions and tell how you want to grow and what you can bring jot the company", "Interview Questions": "What can u bring to the company"}, {"date": "24 Feb 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Chase Brexton Health Care", "Interview Descriptions": "multiple interviews - great on boarding process. I am not sure what else you might want to know so I will just keep typing until I hit the minimum amount of words needed.", "Interview Questions": "Do you think you can work with LGBTQ patients"}, {"date": "1 Sept 2016", "title": "Nurse Care Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Chase Brexton Health Care (Baltimore, MD)", "Interview Descriptions": "I went to a job fair. It was overcrowded and inefficient. I sat for nearly 4 hours waiting for an interview. Once interviewed, the recruiter said he was very excited to work with me etc... And that he would schedule my 2nd interview...nothing for a week. I reached out and then he scheduled me with the hiring manager. I met Catherine and she was very personable. She stated at the end of the interview that she really felt I was a good fit for the position and exactly the kind of person she was looking for. She then said I would be scheduled for a share day to decide if I liked the position.....never heard a word for another 1.5 weeks. Then the recruiter finally tells me, after I reached out, they went with another candidate. What a waste of time.", "Interview Questions": "How do you feel about LGBT community?"}, {"date": "26 Jun 2016", "title": "Substance Abuse Consultant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chase Brexton Health Care (Baltimore, MD) in May 2016", "Interview Descriptions": "One interview.  Wasn't told until the interview that the position did not start for 3 months.  I was not in a position to be able to afford to remain unemployed for 3 months.  Interviewer went so far as to ask me if I could just get unemployment until the position started.  Very unprofessional on every level.  Job posting should have indicated the position did not start for three months to avoid wasting everyone's time.", "Interview Questions": "They asked me why I was leaving my current job."}, {"date": "29 Oct 2016", "title": "Behavioral Health Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chase Brexton Health Care (Baltimore, MD) in Oct 2014", "Interview Descriptions": "I wa quickly contacted after I submitted my application to come in for an interview. I met with two interviewers, my potential supervisor and her boss, both of whom were very friendly. They gave me background information about the agency, and then asked me questions about my past work experience. There were no questions that were out of the ordinary.", "Interview Questions": "I was asked to review a case."}, {"date": "23 May 2016", "title": "Director of Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Chase Brexton Health Care (Baltimore, MD) in Jan 2014", "Interview Descriptions": "Very well organized process. Met all of the key members of leadership team and was given a tour of the facility. They explained the history of the organization and how it has changed and evolved into the organization it is today. The organization has an interesting history in Baltimore and has grown from a small space on Maryland Avenue to the current structure in the old Metropolitan Life building. Their staff has grown as well adding additional sites throughout Baltimore and Easton,Maryland.\r\nThe devices they provided have expanded as well.", "Interview Questions": "From your background what can you bring to this position ?"}, {"date": "22 Oct 2016", "title": "Case Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Chase Brexton Health Care (Baltimore, MD) in Jul 2013", "Interview Descriptions": "Hiring Managers were efficient and communicative with what the process entailed. HR was exceptionally slow in processing employment due to HR staff turnover. \r\n\r\nThe process entailed meeting with Director and 2 managers. Each of them had questions regarding knowledge about the nature of the job, and any pertinent experience. I was notified by this group that I got the job within a week of thr interview. At that point it took nearly 2 months for HR to process the hiring. Hiring Managers maintained consistent communication about where we were in the process, and we're empathetic about the length of time it took to process through HR.", "Interview Questions": "What experience did I have with insurance"}, {"date": "20 Jun 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Chase Brexton Health Care (Baltimore, MD) in Apr 2012", "Interview Descriptions": "easy going, better management at the time. Warm, friendly. Information exchanged so we both walked away with some gained knowledge. Appreciative of each others time. Was one on one interview then did the usual paperwork with HR. Was given a tour and history of the company was explained. Everything was better at the old building.", "Interview Questions": "why do you want to work here"}], [{"date": "28 Nov 2012", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Chase Brexton Health Care (Baltimore, MD) in Jul 2011", "Interview Descriptions": "The process was simple and easy to navigate, but those interviewing did not understand the competencies needed to do the job.", "Interview Questions": "I was asked about my thoughts on diversity in the workplace."}]]