[[{"date": "6 Nov 2022", "title": "Lab Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Saint Francis Health System", "Interview Descriptions": "Effective and within a reasonable timeframe. I was able to communicate questions to the hiring team and hear back regarding the position I wanted to be in. Overall, enjoyed my experience.", "Interview Questions": "Situational question regarding phone calls to the department."}, {"date": "4 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Francis Health System", "Interview Descriptions": "HR contacts you to set up an interview with them. Once that interview is complete and HR believes you’re a fit for the company, they arrange an interview with your potential future manager. They are very quick to tell you if you got the job or not and when your orientation is to start.", "Interview Questions": "What are five of your weaknesses?"}, {"date": "4 Nov 2021", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Saint Francis Health System (Muskogee, OK) in Nov 2021", "Interview Descriptions": "Interview was very laid back and friendly. The interviewer simply asked me a few questions and asked what questions I had. Then told me I would be called with an offer tomorrow.", "Interview Questions": "Why do you want to work for saint francis? "}, {"date": "18 Oct 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Saint Francis Health System", "Interview Descriptions": "Usual questions were asked, such as strengths and weaknesses, what would you do in stressful situations, and all that. The interviewer was kind and straightforward. Interview went very smooth and quick.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "12 Sept 2021", "title": "Mental Health Clinician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Francis Health System (Tulsa, OK) in Feb 2021", "Interview Descriptions": "Easy. Friendly. Not too challenging.  Wanted to know why I want to work in a medical system given that I never have.  Wanted to know if I preferred Team Work or if I preferred solo work or a combination.", "Interview Questions": "How would your experience be an asset to a health system?"}, {"date": "3 Dec 2020", "title": "Certified Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Francis Health System", "Interview Descriptions": "Quick and easy, informative and you should have questions ready to ask them to receive more information. Friendly, nice, and willing to listen. Don’t have much else to say but the 30 word minimum is annoying", "Interview Questions": "What intrigued you about Surgical Technology "}, {"date": "22 Jul 2022", "title": "Recreational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Health System in Nov 2019", "Interview Descriptions": "Challenging questions, but overall fun interview. Was interviewed by 3 managers and then 2 people in peer interview. Interview process was smooth and was offered the job as soon as walking out the door.", "Interview Questions": "Challenging scenario questions that I hadn't had before"}, {"date": "5 Aug 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Francis Health System", "Interview Descriptions": "It was easy and straight forward I also had to do some demonstrations on my skills to prove I could do them like bp injections spell stuff like that", "Interview Questions": "How well do you work under pressure "}, {"date": "15 Jun 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Francis Health System (Tulsa, OK) in Jan 2019", "Interview Descriptions": "It was okay i wish I got to put myself out there a bit more, the staff was not the nicest  to begin with, i ended up not getting the job which I am grateful for", "Interview Questions": "Tell us something about yourself "}, {"date": "18 Dec 2018", "title": "Nurse Tech Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Francis Health System (Tulsa, OK) in Nov 2018", "Interview Descriptions": "The hiring and interviewing process were a bit difficult. First it start off with a live interview video. Than if selected they call you for  a second interview.", "Interview Questions": "What would make you a great nurse tech?"}], [{"date": "7 Sept 2018", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Sept 2018", "Interview Descriptions": "It was a 2-week wait. I received an email explaining that I had to submit a video interview. The process was through Spark. It was easy and there are videos to help guide you through it. I was obviously nervous but I quickly got over it.", "Interview Questions": "Describe yourself and why you want this position and what experience you have."}, {"date": "4 Oct 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Jul 2018", "Interview Descriptions": "The first step in the process after completing their application is they send you instructions for submitting a one-way video interview.  The next process was a skills test; old-school typing and 10-key test (keyboards don't even have 10-key's anymore).  Then their recruiter reaches out to you to see how little you are willing to accept.  Mentioned that no one wants to accept this type of position for less than $40k (they wanted to pay $15/hrly).  I would think it would be part of their job to be aware of market value.  The entire process was cold and disconnected.  You couldn't pay me enough to work for an organization whose culture,  in just the interview process, is already unapproachable.  HARD PASS!", "Interview Questions": "Tell me about your goals."}, {"date": "4 Sept 2018", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Saint Francis Health System in May 2018", "Interview Descriptions": "My interview was done via one way recorded video with the basic standard interview questions. It seemed a bit impersonal.  I would have preferred an actual in person interview.  The on-line job status was helpful to alert to application changes.", "Interview Questions": "What are your qualifications for the position?"}, {"date": "14 Oct 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Saint Francis Health System in Mar 2018", "Interview Descriptions": "I applied online,  and had a telephone interview. I was then asked to come in to see the recruitment manager , A few days later I was called in to see  nurse manager, very friendly and professional. a lot of behavior questions", "Interview Questions": "what are  your strengths?"}, {"date": "25 Jun 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Saint Francis Health System (Tulsa, OK) in Feb 2018", "Interview Descriptions": "There was a phone interview, a video interview, and a face to face interview.  It was a long process to go through, but I felt comfortable the whole time.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "13 Jan 2018", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Saint Francis Health System (Tulsa, OK) in Dec 2017", "Interview Descriptions": "There are a few steps in the interview process. First, you have to apply and get an email saying they are interested in hiring you. Next, you will have to submit a video interview through a website that they set up for you. It is basically 9 typical interview questions that you read and then film yourself answering. HR will review the video, then contact you about setting up an in-person interview with managers that might like you. The in-person is usually one-on-one with the manager of the floor you might be working on. Be prepared to answer questions about what made you want to work on that floor. Good luck!", "Interview Questions": "In a situation where a parent is upset about not receiving something they requested for their child patient, how would you handle the incident?"}, {"date": "2 Feb 2018", "title": "Telemetry RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Health System (Roslyn, NY) in Dec 2017", "Interview Descriptions": "Met with the Nurse Recruiter. Felt more like a conversation then a interview. 2nd interview I met with the Manager and Nurse Educator. They asked some med questions and kind of drilled me. At first was not offered a position. Then received a call a month later asking to meet with Director and had an interview. Next day, I was offered a position.", "Interview Questions": "What is a positive characteristic that your peers would say about you?"}, {"date": "22 Oct 2020", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Francis Health System (Tulsa, OK) in May 2017", "Interview Descriptions": "HR directed my resume and application to the unit manager and scheduled an interview. I met the manager on interview day. The job position was described to me and then I was asked a series of questions regarding my interest in the position and my qualifications. I received a tour of the facility and met other employees as well as supervisors. The manager said that they would get in contact with me soon and I got a call later that week.", "Interview Questions": "What is your interest in the position and field of interest."}, {"date": "27 Nov 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Feb 2017", "Interview Descriptions": "I did a video interview which was one way,  and then after that I was selected to meet with the with the manager and the charge nurse, the manager had a few more interviews after mine so it was another week before I was hired on to Saint Francis and I love it!", "Interview Questions": "What are your future goals?"}, {"date": "2 Nov 2016", "title": "Human Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Saint Francis Health System (Tulsa, OK)", "Interview Descriptions": "I submitted an online application, spoke to a recruiter, interviewed with recruiter, then interviewed with direct supervisor and director. I was then made an offer contingent upon passing background check and drug test. I had a physical and they did a TB test and checked to make sure I was current on all of my immunizations. Once all of that was cleared, I was able to begin work.", "Interview Questions": "What are your strengths and weaknesses? Tell me about your past experience and how it would relate to your position here. "}], [{"date": "13 Oct 2016", "title": "Medical Coder I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Saint Francis Health System", "Interview Descriptions": "The application for the coding position was online. It was very detailed and took quite a long time to finish. Be prepared to list your last seven addresses (I looked on one of my recent credit reports to find mine).  Once I completed the online application I waited to receive word that they had received my resume. It took took about 2 days and I received an email from the Coding Manager to set up a day for an interview. She was very friendly and open. As far as the interview itself went, we just talked about what I had been doing in my last position as a coder, and what was expected of me. She told me about the position and some of the educational opportunities provided.  She then had me take a coding test that was about 30 questions I believe and just to see what my knowledge was but I did have to pass it with an 80% or higher in order to get the job. I received a call from the manager a couple days later to let me know that I passed and that she would be communicating with HR and they would be either calling or emailing me with the formal job offer and set up time to come in for a drug test and fill out paperwork, things like that and so that's what I'm waiting on now.", "Interview Questions": "N/A"}, {"date": "5 Feb 2016", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Jun 2015", "Interview Descriptions": "The nurse recruiter first interviews you and asks a few questions. Then, you are sent up to meet with the nurse manager who asks you questions and shows you around the unit. If you are selected for the job, the nurse recruiter will contact you to talk about the pay and start date.", "Interview Questions": "Describe a time when you made an impact in someone's care."}, {"date": "17 Apr 2015", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Mar 2015", "Interview Descriptions": "The interview process is extensive and slow moving. 4 weeks to get a response to submitted resume, and 2 weeks to get a start date after the job was offered.", "Interview Questions": "What do you like most about working as a CNA"}, {"date": "12 Nov 2014", "title": "ECB Exercise Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Sept 2014", "Interview Descriptions": "Was referred by a friend to apply for an upcoming opening. I emailed the lead supervisor at the Health Zone to schedule a time to attend an existing class and then also audition, so they could see what I can expect and then show my teaching skills.\r\n\r\nThe audition was with the supervisor and another yoga instructor. I demo'd teaching the supervisor for 15-20 minutes in a yoga routine typical of my style. They approved thereafter and sent me to HR to fill out the paperwork online (once the position formally opened up) and go through the HR process. It took a couple weeks to get everything finalized.", "Interview Questions": "I didn't expect to audition with a fellow yoga instructor watching, but it worked well."}, {"date": "3 Aug 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Francis Health System (Tulsa, OK) in Aug 2014", "Interview Descriptions": "The interview was Easy. We Talked about goals  the interview was focused more on the personality of the Registered nurse . Talked with the manager, shown the floor and then met coworkers. It was an easy interview", "Interview Questions": "What are your interests?"}, {"date": "28 Nov 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Saint Francis Health System (Tulsa, OK) in Jul 2014", "Interview Descriptions": "relaxed and easy enviroment, nothing difficult. talk about schedule and skills needed for work. Make sure to smile and wear appropriate outfit. Keep a binder of all your information so that you can show require materials.", "Interview Questions": "why do you choose nursing"}, {"date": "3 Mar 2014", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Francis Health System", "Interview Descriptions": "Go to the interview, then if selected go to a class that last 3 weeks with one day on the floor that they choose for you to be on then the last week of class you are on that floor for half of the day so you can learn to do your skills.", "Interview Questions": "How will you feel about cleaning someone up that has messed all over themselves."}, {"date": "2 Jan 2014", "title": "Human Resources Specialist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Saint Francis Health System", "Interview Descriptions": "They know how to move quickly.  There was one interview with the Director, one group interview and one interview with the VP.", "Interview Questions": "N/A"}, {"date": "17 Mar 2016", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Sept 2013", "Interview Descriptions": "Was called to come in for interview with human resources, had to wait 3 weeks. Met with human resources and was asked basic questions and then met with manager from the floor I applied to.", "Interview Questions": "Describe a stressful situation and how you resolved it?"}, {"date": "20 Aug 2013", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Health System", "Interview Descriptions": "Long. They move at a snail's pace in their hiring process. I applied for an in-house transfer 3 weeks ago & have not received any confirmation or information other than they received my request.", "Interview Questions": "Have not yet interviewed for transfer position."}], [{"date": "6 Nov 2014", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Apr 2013", "Interview Descriptions": "Applied online and got the call for initial interview 2 weeks later. The first interview is with the HR manager, the  first interview is very easy, she told me about the job responsibilities and asked if I was ok with cleaning patients and other stuff, she also made me described the work I had before. Then she told me that they will call me for another interview if I passed the first one.  got the call 3 days later and had an interview with the nurse manager of the unit where I applied. I was offered the job on the spot and we discussed my hourly rate and other paperworks to do.", "Interview Questions": "How do you respond to changes?"}, {"date": "24 Oct 2015", "title": "Phlebotomy Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Oct 2012", "Interview Descriptions": "I applied for phlebotomy, but received a job as a PSR II.\r\nI was first given a tour of the laboratory and what each processor was doing. Then we went back to her office and she asked me some questions. It went very smoothy and she was extremely nice.", "Interview Questions": "Name a time when you faced a work related conflict... How did you overcome this conflict?"}, {"date": "14 Sept 2012", "title": "Medical Records Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Health System (Tulsa, OK)", "Interview Descriptions": "Interviewed with human resources and also with department manager.  Had to pass a coding exam, and background check.  Everything went very smoothly, and everyone was very friendly and helpful.", "Interview Questions": "What are your worst work habits and why."}, {"date": "19 Oct 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Saint Francis Health System (Tulsa, OK) in Sept 2012", "Interview Descriptions": "an employee approached me about a job.  She set up an interview with the Executive Director. I met with the Executive Director and then got a call afterwards that I would meet with the CEO and one Senior Vice President.  After that, the offer was made 3 months later", "Interview Questions": "For the most part it was very personal. I was told it was more important to like the person than to be qualified. Overall it felt like talking to friends at a dinner and having expectations lined out. Personal questions were asked, but in an offhand way. The clothing/look was very important. They don't allow tattoos, prefer women in dresses or skirts, closed toe shoes, etc.  Very Catholic and conservative."}, {"date": "30 Nov 2014", "title": "Medical Transcriptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Saint Francis Health System (Tulsa, OK) in Dec 2010", "Interview Descriptions": "Very smooth.  Filled out application with HR, had interview with Supervisor, working within 1 week. I took a typing test and a spelling test; that was all.  I left knowing I was hired.", "Interview Questions": "N/A"}]]