[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Getting serious about second-stage growth", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 May 2023", "job_title": "Management Team in Bogotá, Bogota", "duration": "N/A", "pros": "- Really exciting mission to transform development effectiveness, and going after the hardest problems of government and aid effectiveness. - Punches way about its belt, transforming some of the largest funders out there, like the Global Fund. - Really collaborative and supportive, mission-driven teams all across - Management has really taken the feedback from team regarding growth pains seriously, and has made important progress and investments in improving the operations' leadership, and putting forward an important transformation plan.", "cons": "- The expected challenges of a big ambition: there can be peak times with some periods of long hours (but nowhere near big 4 consulting) - Still refining internal communications approach to ensure intentions behind decisions are clearly communicated. - Insufficient investment in knowledge management systems but working on it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to learn!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Dec 2022", "job_title": "Associate in Bogotá, Bogota", "duration": "N/A", "pros": "- Highly motivated group of people - Broad portfolio of projects across sectors - Many opportunities to learn and grow", "cons": "- Not much in terms of cons"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great value proposition for junior staff", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Dec 2021", "job_title": "Associate in Bogotá, Bogota", "duration": "N/A", "pros": "The organization has a great value proposition for junior staff. With little or no experience, you have the possibility of making significant contributions to projects with major payers in the development space and have exposure to said clients. The projects are challenging and with healthy variety, pushing you to constantly learn. People are interested in helping you grow and see you as more than just a pair of hands; there is little hierarchy and power dynamics. In addition, the salaries and benefits for junior staff are very competitive.", "cons": "The organization's operations area is underdeveloped and understaffed, although it has improved in the past couple of years. In addition, part of the leadership wants to do everything and work with everyone, lacking intentionality in the organization's strategy.\r\nHours can be long sometimes, but that is due to the consulting nature of the work."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good salary / Lack of Management Leadership", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Dec 2021", "job_title": "Associate in Bogotá, Bogota", "duration": "N/A", "pros": "Salaries are competitive\r\nCooperative junior and senior staff\r\nGood opportunities to grow for junior staff", "cons": "- Pretty few Growing opportunities for senior staff to become managers.\r\n- Working experience years for Instiglio is less important than a master.\r\n- The leading Partners are too self-centred, and they diminish the work of junior and senior staff. If you don't do the things they will do, they will make you feel terrible, they will change all the work but won't teach you anything from the errors.\r\n- Performance is not evaluated under goals but from subjective thoughts of the people you work with. Therefore, you will receive good or bad reviews depending on whether you choose your friends to evaluate you or not."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Truly service-oriented on high growth curve", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Dec 2021", "job_title": "Consultant in Bogota, Cundinamarca", "duration": "N/A", "pros": "- Instiglio is a uniquely impact/service oriented organization. The org regularly over-delivers on its projects and impact is the number one priority of the leaders. This is refreshing to see in a sector that is often more concerned about itself than the vulnerable people it serves. It punches above its weight and its clients recognize that across the board. Solid client track-record with tons of repeat clients. \n- Instiglio is a change-making/field building organization. A difficult act to pull when you are trying to change very bureaucratic funding institutions. It’s made outstanding progress doing some pretty amazing multi-year reforms in the last years. \n- I also appreciate Instiglio’s care for cost-effectiveness. Unlike many peers, it does not spend on cheap thrills, or expensive HQ in high cost cities. They walk the talk and try to maximize the impact of every dollar it spends. It is also driven by its clients’ fees rather than major grants, which is a testament to its ability to drive true demand for its work.  \n- The culture is fantastic and anchored on drive for the mission, collaboration, and growth (of the org and the people) . People around you are smart and hyper collaborative. \n- despite what some reviews seem to imply on this platform, Instiglio truly cares and listens to its people. It has a line management system to ensure everyone has a mentor. The leaders spend a large amount of time in one on ones and listening to and making space for individual requests (relocations, sabbaticals, transfers and other ‘off-policy’ situations), company-wide surveys to take in anonymous input and feedback, townhalls based on anonymous questions directed to the leadership. Of course, the organization, as many others, has taken a real hit in the last two years with COVID and remote work, which when combined with significant growth (40%+) and launching a new and big office in Morocco, has really strained everyone and undermined the core strengths of instiglio’s culture which is the community. It will take time to rebuild these connections, bring new folks into the culture and shape the Morocco office to feel part of the Instiglio family. It’s encouraging to see the recently created people committee led by the COO and two partners to lead on people matters with greater proximity, and also the company is currently hiring a very senior people director to provide greater expertise. \n- Instiglio is in constant evolution (has grown super fast around 30-40% annually for past 4 years) and growing its type of work (more complex over time) and its geographical presence. This is all very ambitious for a small org and explains some of the cons that I describe below but the leadership is evolving accordingly to tackle bigger challenges. For example, it has proactively worked to strengthen the board’s role into a proper and diverse governing board that reviews the managing partner, evaluates his and the org’s performance through staff interviews, and approves strategy and critical hires or promotions. It has brought onboard a people-oriented partner, a senior COO, senior people director and looking to do the same on the project side.", "cons": "The core challenge of Instiglio is a mismatch between resources/capabilities and ambition at this point in time. While the impact ambitions have followed a very steep curve over the last 5 years, the operational platform (team/systems, etc) has not followed the pace. This leads to multiple issues that currently affect the employee experience and productively. \n- sometimes the response from the operations team can be delayed, which can frustrate teammates. \n- on the people side, management needs to bring in greater expertise to guide the evolution of Instiglio policies and practices in a post-COVID world. The organization is currently struggling to translate its culture of care across offices and across a growing organizations because of the lacks of systems and processes that help do that. As a result, sometimes people feel that management does not care. Having grown in our consolidated Bogotá office, I know that is not true but I am disappointed to see that some colleagues elsewhere have not felt it yet. Luckily, this is not rocket science and something that the growing people team will be able to fix. \n- Instiglio has many important investments to make on its operational platform but it is trying to do so with little resources and through the margins its projects generate. While it’s admirable that the org is truly sustainable in its business model, it would relax some of the stress on the project teams to get funding from philanthropic sources to support more healthy investments. \n- in the last year of covid madnesss, the team has been really stretched across the board while not seeing each other and building those bonds. Instiglio needs to find ways to communicate more with teams and foster greater connection to rebuild back better. \n\nWhile we are definitely in the middle of some growing pains, I’m sure that the current investments in the operational platforms will start bearing fruit in the coming year."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Organisation", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Dec 2021", "job_title": "Consultant in Bogotá, Bogota", "duration": "N/A", "pros": "Has a few good employees.", "cons": "Some of the manager have there own agendas and this affects the growth of junior employees. The policies are one sided and are always hiring because of high rate of employees leaving because of toxic environment."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "is it a start up or a non-profit?", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Apr 2021", "job_title": "Associate in Bogota, Cundinamarca", "duration": "N/A", "pros": "Salary is above market value considering the region. Most of people who work here have very interesting backgrounds, and you will be able to experience an international office atmosphere", "cons": "Management bend their own rules for personal benefit. It is run as a family business, though they pride themselves to be a non-profit and to have a mission.\r\nThe working hours are very long, and if you disagree with management, then you will have a very hard time."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Instiglio changed my life", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Mar 2021", "job_title": "Analyst in Bogotá, Bogota", "duration": "N/A", "pros": "It is a great place to work, people are great, there are lots of opportunities to grow at work and you work with a international team. My main motivation is that we work for a greater cause: to be able to help those who need it most.", "cons": "Very hard work, super fast-passed projects"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jan 2021", "job_title": "Intern in Bogotá, Bogota", "duration": "N/A", "pros": "Challenging and interesting. You learn a lot.", "cons": "A lot of work load and pressure"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Cutting edge of its practice", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Aug 2020", "job_title": "Anonymous Employee in Bogotá, Bogota", "duration": "N/A", "pros": "Innovative, rigorous and super impact-driven organization, that has led some of the major milestones of its niche area. Has positioned itself for growth and a leadership role in terms of results-based financing and is increasing getting into the exciting area of improving government's delivery capabilities. Offers great opportunities for personal growth and intellectual challenge. Very open, friendly and collaborative culture.", "cons": "Its fast-paced and ambitious nature can stretch people and is not for those looking for a calm 9-5. Hours are reasonable but the intellectual challenge is constant, and sometimes it feels we are growing too fast."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Amazing team and mission", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Apr 2018", "job_title": "Operations Manager in Bogotá, Bogota", "duration": "N/A", "pros": "You work with talented and commited people who push you to learn and explore how to change the world. Your work and role has a deeper meaning, something not common in consultancy. You get the chance to travel and work directly with service providers.", "cons": "You will be pushed out of your comfort zone in many ways. If you are ready to handle that, you will learn, grow and enjoy your day-to-day work."}]]