[[{"date": "22 May 2023", "title": "Sr BI Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado (Denver, CO)", "Interview Descriptions": "The first interview is a 30-minute screening/phone interview. Once a candidate is selected from the screening there is a panel interview. Candidate must answer Tableau Server & Cognos analytics tools related specific questions", "Interview Questions": "Tell us why are you interested in this position."}, {"date": "28 Apr 2023", "title": "HR Professional Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado (Aurora, CO)", "Interview Descriptions": "Great until the end, refused to talk to me about salary and then offered me a number less than the bottom of the range included in the job description. When I tried to negotiate, they rescinded the offer.", "Interview Questions": "Average HR questions - need experience to know how to answer"}, {"date": "26 Apr 2023", "title": "Cancer Center Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado in Apr 2023", "Interview Descriptions": "I had a phone screening interview for Cancer Center Data Analyst role at the University of Colorado. The interview was carried out by the Senior Data Analyst. It went pretty well.", "Interview Questions": "Tell me about your background. What statistical techniques do you know? What statistical software do you use?"}, {"date": "17 Oct 2022", "title": "Payroll Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Colorado", "Interview Descriptions": "Long interview process. At least 3 or 4 different interviews, one of them a video response which isn't pleasant. It's a phone screen, then ask and answer on , then two face-to-face interviews. The process takes about a month in all, maybe a bit less.", "Interview Questions": "N/A"}, {"date": "14 Mar 2023", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at University of Colorado in Jul 2022", "Interview Descriptions": "3 interviews- basic questions you would expect! Easy process and nice people. I really loved working here and just wanted something different. I would go back again if I didn’t have to move!", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "22 Apr 2022", "title": "Research Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado in Mar 2022", "Interview Descriptions": "Fully remote, but very well organized. Met with five people individually on different days. Everyone was on time and asked good questions. Very impressed with level of responsiveness and quality of resources from HR.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "18 May 2022", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Colorado (Denver, CO) in Mar 2022", "Interview Descriptions": "Interview process was great. The decision was confusing when the feedback was about something I did not say. Sometimes I wonder if they got the interview notes mixed up. I dont have any other words to add.", "Interview Questions": "I cant recall exactly what the questions were but they were appropriate"}, {"date": "15 Feb 2022", "title": "Applications Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado (Denver, CO) in Feb 2022", "Interview Descriptions": "One interview with would be coworkers and supervisor. Seem to be great people, excellent interview but don't get your hopes up. I felt like I aced the interview but unfortunately wasn't offered the position.", "Interview Questions": "Very refreshing, actual technical questions. \"If X happened, how would you troubleshoot?\", etc."}, {"date": "21 Feb 2022", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Muscle Shoals, AL) in Feb 2022", "Interview Descriptions": "First step is a interview with a hiring manager then you’ll have a video interview with three other managers . Then you will get an email for five references three have to be previous managers and they must respond to the reference email within 24 hours .", "Interview Questions": "What was your most difficult job and why ?"}, {"date": "23 Aug 2021", "title": "APP Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado", "Interview Descriptions": "4 interviews. 2 by phone, 2 on zoom. All different roles on the APP fellow selection team. Scheduling was a little stressful because you have to sign up at a specific time along with all the other interviewees which made it competitive", "Interview Questions": "How do you deal with your stress?"}], [{"date": "23 Mar 2022", "title": "Peer Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at University of Colorado (Boulder, CO) in Jul 2021", "Interview Descriptions": "Interview process was fairly easy. You get the questions ahead of time so you can practice.  Very low stress interview. The staff is very friendly and they just want to get to know you.  They’re just looking to see if your personality is a good fit.", "Interview Questions": "How can we improve wellness within the student body?"}, {"date": "16 Feb 2021", "title": "Laboratory Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado", "Interview Descriptions": "The interview process has been via zoom so far. I have had 2 interviews with 3 people present each time. The staff seems very down to earth and personable yet professional. I hope to get a call back with some good news.", "Interview Questions": "What is one thing you believe would be your biggest contribution to the company? "}, {"date": "20 Jan 2021", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado", "Interview Descriptions": "Video-recorded interview (no person on the other end, just a program recording my responses) then a virtual interview. Second interview seemed like a formality and I was going to be offered the job, but didn't end up with an offer. Very strange process.", "Interview Questions": "Are you familiar with the profession of research administration? "}, {"date": "17 Jul 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado (Denver, CO) in Jul 2020", "Interview Descriptions": "There is another interview on here for a manager in the Denver systems administration office that was pretty much exactly what I went through, except I am local and the other interviewee was flown in.\n\nThat other interviewee got the job but left a bad review of CU on here. The review complained about upper management and I also got that vibe from the director-level hiring manager when I was going through the final panel interview. So, while I didn't get the job, I suppose I dodged a bullet in that I wouldn't have to deal with the negative work environment. I kept reading about the great benefits though, so I would have been willing to tough it out even with the below-market salary.", "Interview Questions": "I swear it was THE EXACT SAME QUESTIONS that the other Denver manager interviewee on here had"}, {"date": "22 May 2020", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado", "Interview Descriptions": "I met with many researchers from different departments and teams and everyone was very communicative and collaborative. Most of the interviews felt more like discussions among colleagues instead of interviews and questioning. Most questions concerned work listed on my CV that related to their work.", "Interview Questions": "Present an hour long seminar of current research "}, {"date": "22 Apr 2020", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado", "Interview Descriptions": "Full day of meeting faculty and learning about various projects. I held a seminar about my previous research (dissertation). Toured the labs and had dinner with selected faculty. Overall it was a great experience.", "Interview Questions": "Tell me why you want to be a postdoctoral fellow"}, {"date": "20 Dec 2019", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado (Denver, CO)", "Interview Descriptions": "Got contacted about a phone interview.  I sent back a bunch of dates and times.  They never contacted me again.  Got ghosted. Find that to be super unprofessional for a university.", "Interview Questions": "When are you free for a call?"}, {"date": "28 Jun 2021", "title": "Accommodations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado (Denver, CO) in Jul 2019", "Interview Descriptions": "The interview process is very structured. It is a 4 hour process but a great time to meet a lot of individuals you will be working with. The questions are very in depth and some scenario questions are asked. You are given breaks in between each group you interview with and an itinerary is provided to you prior to the interview.", "Interview Questions": "Please provide an example of a time you had to address a personal bias you held or an incorrect assumption you made about someone who you were serving. "}, {"date": "21 Apr 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Aurora, CO) in Jun 2019", "Interview Descriptions": "Interviews with the entire admin team, all were friendly and pleasant to talk to. Asked questions about my experience and why I wanted the role. Was a relaxed environment and was offered the job later in the day.", "Interview Questions": "What skills could you bring to this role?"}, {"date": "28 Aug 2021", "title": "Service Desk Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado (Denver, CO) in May 2019", "Interview Descriptions": "It was very welcoming and everyone involved made me feel comfortable during the process. Questions were split between personality and technical. This made the entire process seem balanced. The system they have in place is a good one.", "Interview Questions": "How would you troubleshoot someone's Outlook not pulling in new email? "}], [{"date": "3 Oct 2019", "title": "Sustainability Procurement Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Colorado (Denver, CO) in Apr 2019", "Interview Descriptions": "I applied initially on LinkedIn, then was offered to do the first round of virtual interviews using HireVue within about two weeks. I had to answer multiple questions and record my answers into the app. Then about a week later I received an invite to do a Skype interview with a committee of about four people from across the university. After about another week, I was asked to fly into Denver for an in-person interview (I was living out of state at the time). For the in-person interview, it took about four hours and I had around four sets of individuals with groups of people in the office I was applying to. The day after the in-person interview I got a call offering me the job. In total, the entire application on LinkedIn to offer took about 6 weeks.", "Interview Questions": "1. Explain why your background and experience would be a good fit for the job?\r\n2. Tell us what has been your best work achievement to this point in your career. What made this achievement important?\r\n3. Describe a difficult task you were faced with and how you addressed it. "}, {"date": "7 Mar 2019", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado", "Interview Descriptions": "Two interviews- one with the manager and another with the Director. Pretty easy. Interview with the director was pretty weird as he didn't ask anything about the job-just general questions.  Just be confident and be prepared to say why you deserve the position.", "Interview Questions": "What do you know about clinical research?"}, {"date": "30 May 2019", "title": "Travel Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Denver, CO) in Mar 2019", "Interview Descriptions": "It was pretty quick with very clear next steps. Once the first interview took place you knew exactly the next steps. Each interview was with a minimum of 2 people.", "Interview Questions": "Describe a time when you made an error and how you handled it"}, {"date": "11 Jan 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at University of Colorado", "Interview Descriptions": "I applied for the job online and heard back via email about a month later. I was contacted by the hiring manager for an in-person interview. The interview was with the hiring manager and the direct supervisor I would be working with. There were about 10 questions that were mostly scenario based that lasted about 20 mins.", "Interview Questions": "Tell me about yourself\r\nTell me about a time you solved a problem\r\nTell me about a time you were a leader\r\nWhat does our motto mean to you? \r\nWhy did you choose this company?"}, {"date": "9 May 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Colorado (Aurora, CO) in Jan 2019", "Interview Descriptions": "There were two rounds of interviews. The first was with most of the team and the second was with the project manager and PI. The interviews were both very pleasant and straightforward.", "Interview Questions": "Describe a time when you had to deal with a conflict in the workplace, describe your worst/best attributes, describe your experience with research thus far. "}, {"date": "18 Dec 2018", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado", "Interview Descriptions": "Good processs - big group interview, student interview, then director interview. Felt very good and there were no filler interviews.  It seemed like the folks there really cared about the school, students, and wanted someone who was also invested in the school and students.", "Interview Questions": "Mostly about the population at CU and how to market the school. "}, {"date": "10 Nov 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado", "Interview Descriptions": "Typical interview process. The first interview seemed very formulaic, but the second interview was more laid back. They are great about following up with you quickly. I never had to wait more than a day to hear back.", "Interview Questions": "What interested you in this position?"}, {"date": "23 Dec 2018", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Denver, CO) in Nov 2018", "Interview Descriptions": "The interview process was informal. I met with several staff who described the projects and the position that I would be working on. They were all very supportive.", "Interview Questions": "How did you hear about the position? "}, {"date": "27 Mar 2019", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado (Aurora, CO) in Nov 2018", "Interview Descriptions": "Long, drawn out, frustrating process. Communication was lacking and extremely slow. The first step was a Skype interview with a recruiter, where she asked me basic questions about my work experience. It was unorganized because she decided to have a couple of other recruiters/HR reps join the interview. However, she didn’t mention this in any of the emails or put anyone else on the invite, so I was kind of blindsided. The next day, the hiring manager reached out to me and set up a 30 minute 1:1 phone screen. The day after, I had another 30 minute 1:1 phone interview with one of the physicians from the department. The hiring manager emailed me again after that, and a week later I was brought in for an in-person interview with him and one of his teams. Over the course of the next 3 weeks, I was brought in for 3 separate group and individual interviews with various teams from the department. A couple days after my last round of in person interviews, an HR rep emailed me and asked me to fill out a SkillSurvey with my references. Received a voicemail 2 weeks later telling me they had gone with another candidate.", "Interview Questions": "Why do you want to work for CU?"}, {"date": "22 Sept 2018", "title": "Professional Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado in Aug 2018", "Interview Descriptions": "I applied for positions at Anschutz for public health research. Unfortunately, this place seems unwilling to mess up their status quo by hiring people that didn't go to U Colorado. I had one person tell me I was overqualified, which was a theme in other interviews. Kind of hard to want to work for a place that ADMITTEDLY won't hire you because you went to top tier schools.", "Interview Questions": "Describe a situation where you had a conflict with a co-worker, how did you resolve it?"}], [{"date": "9 Aug 2019", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado (Aurora, CO) in Aug 2018", "Interview Descriptions": "Professional, smooth, a great intro to the lab as well as the overall summary of its goals. In addition, the process also introduced me to the people I am working with now.", "Interview Questions": "What experiments would you propose to further our research?"}, {"date": "18 Sept 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado (Aurora, CO) in May 2018", "Interview Descriptions": "Initially it took several weeks to hear back of my application.  After the interview, I was immediately contacted but unfortunately informed that I was not selected.  Everyone was friendly and selection process seemed fair.", "Interview Questions": "Why do you want to work as a research assistant?"}, {"date": "19 Apr 2018", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado (Denver, CO)", "Interview Descriptions": "It was pretty informal. He asked me about myself, my past experiences, if I would be comfortable doing the research, had me meet the team and  gave me a tour of the lab.", "Interview Questions": "What experience do you have?"}, {"date": "13 Feb 2018", "title": "Professional Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado (Denver, CO) in Feb 2018", "Interview Descriptions": "Conducted 30 min phone interview as the first step of the process and asked about prior research experience and then asked for meeting in person. Interviewer was very nice and professional.", "Interview Questions": "What did you not like about your last job?"}, {"date": "4 Mar 2018", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado (Denver, CO) in Dec 2017", "Interview Descriptions": "The interview was a three step process. The first step was a phone interview, then a Skype interview (I was living out of state at the time), and the third step was an in-person interview and tour. Everyone I met with was very nice, however the whole process took 2 months and HR seemed unorganized (e.g. forgot to call me at our scheduled phone interview time, kept pushing back the date of when I would hear back, etc.)", "Interview Questions": "Tell me about yourself? What can you bring to this position? Tell a time when you were faced with an ethical accounting issue and how you handled it. Where do you see yourself in 5-10 years? How do you prioritize? What would your former employer say are your biggest strengths and weaknesses? etc."}, {"date": "22 Oct 2017", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado", "Interview Descriptions": "Very brief and casual phone interview. The lady interviewing me was very nice and friendly. It lasted for about 10 minutes. I was offered the job about a week after the interview.", "Interview Questions": "Describe a time you failed"}, {"date": "1 Jul 2020", "title": "Financial Aid Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado (Boulder, CO) in Sept 2017", "Interview Descriptions": "Easy interview process. I applied and was called for an interview the next week. Employers asked basic interview questions and asked about strengths, weaknesses, and other common questions. After the interview I waited about a week until I was contacted saying I got the job.", "Interview Questions": "What is a strength and weakness of yours?"}, {"date": "4 Feb 2020", "title": "Student Technology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Colorado (Boulder, CO) in Aug 2017", "Interview Descriptions": "I applied in person to the supervisor at the technology desk and had an interview within a week or two. I applied with prior knowledge of an opening in the department.", "Interview Questions": "What's the difference between DVI and VGA"}, {"date": "8 Aug 2017", "title": "Engineering Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Boulder, CO) in Jun 2017", "Interview Descriptions": "Two people that are managers of the job of interest interviewed me. They asked a large series of questions for 30 minutes. Questions mostly pertained to the job and skillset required. Not many questions were with regard to personal or emotional subjects.", "Interview Questions": "Do you really want to leave academia for industry?"}, {"date": "17 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado in May 2017", "Interview Descriptions": "Very basic interview with personality questions. The PI was very kind and accommodating. They also asked the entire lab to interview me and every member was inviting and kind.  They also gave me a small tour of the lab and showed me the areas I would be spending more time in.", "Interview Questions": "1) describe yourself. 2) name a time where you had to make a difficult decision. 3) technical questions about a cell biology lab technique. "}], [{"date": "25 Mar 2018", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado (Aurora, CO) in Apr 2017", "Interview Descriptions": "I was interviewed by seven different employees. They took turns asking questions and they were all typical interview questions. It was a very good interview. The second interview was basically a recap of the first I spent a lot of time practicing interview questions and researching the company which paid off.", "Interview Questions": "There were not any unexpected questions. "}, {"date": "13 Mar 2017", "title": "Animal Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Boulder, CO)", "Interview Descriptions": "Met with the department Manager after my resume was reviewed and was determined to meet eligibility for position. Then met with facility Supervisor and toured facility to get an idea of daily operations. Additionally met with facility veterinarian who over saw animal animal health services", "Interview Questions": "As an individual with a history of caring for animals and promoting animal welfare how would I approach a situation where a research technician maybe in violation of research protocols involving the care and use of the animals involved in the research study."}, {"date": "4 Apr 2017", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado (Denver, CO) in Mar 2017", "Interview Descriptions": "Pretty standard. You apply via their website and they contact you for a meeting if they're interested. They usually explain the work they're doing and then ask you questions about your experience.", "Interview Questions": "What is one thing you disliked about one of your previous jobs?"}, {"date": "15 Dec 2020", "title": "Dental Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Colorado (Aurora, CO) in Jan 2017", "Interview Descriptions": "Start the day with a tour of the school and the campus and interview with two faculty dentists. At lunch you will have time to talk to current students and gain some of their perspective.", "Interview Questions": "What made you want to become a dentist?"}, {"date": "10 Nov 2016", "title": "Senior Grant Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Boulder, CO) in Nov 2016", "Interview Descriptions": "video interview with the opportunity to do a few test questions.  The interview itself has the question posed to you.  You have one minute to review the question and then three minutes to respond.", "Interview Questions": "Describe a time you had to make a decision without all the information."}, {"date": "29 Aug 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado", "Interview Descriptions": "The first part was an interview through HireVue - digital on-demand interview.  Basically you are given 10 questions and you have to record yourself answering them.  It was kind of awkward, but I see the benefit of having it.  Then I moved into an in person interview with the team.", "Interview Questions": "Tell us why you want to work for the University of Colorado."}, {"date": "10 May 2020", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Colorado (Aurora, CO) in Feb 2016", "Interview Descriptions": "Easy, not that difficult and simple questions. Have been interviewed in the first round by phone and then full day interview at on-site. During on-site met with lot of great scientists and  have been interviewed", "Interview Questions": "How did you solve technical problems?"}, {"date": "30 Apr 2017", "title": "Operations Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Colorado Springs, CO) in Jan 2016", "Interview Descriptions": "Applied online and received an in-person interview a week later.  Had my first interview with one of my direct supervisors that took 25 minutes and after that, they had me immediately interview with senior management that took 15 minutes and I was offered.", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "21 Feb 2017", "title": "Accounting Technician II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Boulder, CO) in Dec 2015", "Interview Descriptions": "Round table interview where department employees ask the standard interview questions regarding multi-tasking and previous learning experiences at work.  The department did not properly explain how and who I was to meet.  \r\nI was told I was the number one candidate.  Asked if I could start immediately.  Was told I would hear back within a day.  The department head, who was my main contact, never called or contacted me to let me know that they decided to hire someone younger.", "Interview Questions": "How do you prioritize important tasks?"}, {"date": "6 Nov 2016", "title": "Accounting Technician II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado (Denver, CO) in Sept 2015", "Interview Descriptions": "The interview is pretty formal and they asked very general technique questions. The people are very nice and very friendly. They are trying to make connection with you and answer you questions very detailed. Love the people there!", "Interview Questions": "What kind of specific skills you have for the software？"}], [{"date": "23 Dec 2015", "title": "Digital Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Colorado (Boulder, CO) in Aug 2015", "Interview Descriptions": "Email turnaround after applying was very quick. An interview was schedule for a few days later and follow up/offer no more than 2 days after that. Overall very quick and efficient.", "Interview Questions": "Why are you interested in corporate social responsibility, ethics, sustainability, corporate governance?"}, {"date": "25 May 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Aurora, CO) in Jul 2015", "Interview Descriptions": "Phone screen where 3 interviewers participated.  This was followed by a panel interview face to face on campus.  Questions were created and each member of the interview committee asked a question in a round robin fashion.  The job was offered approximately a week after the campus interview.  References were called from Human Resources Department.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Apr 2015", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado", "Interview Descriptions": "Phone interview followed by interview by committee. The panel consisted of peers and managers. It was clear not only did they want someone with technical skills but also someone who wanted to work for the university.", "Interview Questions": "Gave a scenario problem to solve. "}, {"date": "24 Aug 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Colorado in Jan 2015", "Interview Descriptions": "The interview involved pretty standard interview questions. Met with quite a few different people on three different occasions, as well as a doctor who asked some tougher questions. Think of some good teamwork and customer service experiences before interviewing.", "Interview Questions": "How do you handle stress? What would you do if a patient asked you XXX? Biggest flaw?"}, {"date": "21 Jan 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Colorado (Aurora, CO) in Jan 2015", "Interview Descriptions": "Employers are increasingly taking advantage of the convenience and low cost of technology during the hiring process. Where hiring managers in past decades may have used in-person conference or first-round interviews, today’s job hunt is likely to involve an online interview to narrow down the field of candidates for just a handful of in-person interviews.", "Interview Questions": "When can you start?"}, {"date": "6 Oct 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Colorado (Boulder, CO) in Sept 2014", "Interview Descriptions": "I had to submit a resume and a cover letter. I went in for an interview and they just asked me questions about myself. They asked what my degree was in. They also asked me how much money I wanted to make. They also asked me why I wanted the position.", "Interview Questions": "How much money do you want to make?"}, {"date": "11 Jun 2015", "title": "Grants and Contracts Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Aurora, CO) in Jul 2014", "Interview Descriptions": "Apply at job board with resume, cover letter and references. Selected for interview with panel including faculty and members of HR. Second interview with Administrator of the department. The whole process took over a month. I was offered the job but I asked for a higher salary since what was offered was below what I had been making. When that was not forthcoming, I accepted the lower salary but the job was rescinded. Not a good experience.", "Interview Questions": "Ability to handle coordination of multi center grants"}, {"date": "25 Apr 2014", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado (Denver, CO) in Mar 2014", "Interview Descriptions": "Long process. Panel and full day interviews.", "Interview Questions": "What was you biggest failure?"}, {"date": "23 Apr 2014", "title": "Professional Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado (University of Colorado, CO) in Feb 2014", "Interview Descriptions": "Applied online through career site.  Invited to interview with PI within 2 weeks.  Interview was 30 minutes and covered previous research experience and education.", "Interview Questions": "Discuss previous research."}, {"date": "5 Jun 2017", "title": "Groundskeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Colorado (Boulder, CO) in Aug 2013", "Interview Descriptions": "Went and talked to the supervisor and he asked what my school schedule was.  Then he offered  me the job and asked when I could start.  I said as soon as possible and I was able to start working within a week or so.", "Interview Questions": "When are your classes?\r\nCan you come in early for snow removal?"}], [{"date": "7 May 2013", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Colorado (Aurora, CO)", "Interview Descriptions": "Typically there is a three step process to the interview and hiring process but when I was hired it was a one step process. The woman hiring me did not fully understand the process for hiring of state employees. She asked me one or two questions I was in and out of there with my job in less then 10 minutes.", "Interview Questions": "I was not asked any difficult or unexpected questions. All I was asked is if I had any food service experience? I said no. Do you have any customer service experience? I said yes. When would you like to start? "}, {"date": "23 Apr 2013", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado (Boulder, CO)", "Interview Descriptions": "I applied online and received an email for the initial interview after about 30 days.  I had 2 group interviews and 2 one-on-one interviews (with different members of the team).  The entire process took about 90 days and there lots of different steps  Throughout my process, I met with 12 different people.  I was offered the position and then my references were checked and background check completed.", "Interview Questions": "With regards to co-workers in your current position, what are they doing that you wouldn't enjoy doing?  "}, {"date": "7 Dec 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Colorado Springs, CO) in Jan 2013", "Interview Descriptions": "I met with faculty members in the department, give a lecture on a topic provided a few days before the interview.   following the interview I meet individually with members of the department.", "Interview Questions": "What was my teaching philosophy"}, {"date": "5 Oct 2015", "title": "Intellectual Property Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Colorado (Boulder, CO) in Jul 2012", "Interview Descriptions": "The process was very easy going and typical. I waited in the office before my interview and was greeted pleasantly by the Office Assistant. Everyone was very welcoming and friendly. The interview was conducted by two of the employees who were very relatable and professional. The interview was short and sweet. They were able to ask fair questions.", "Interview Questions": "Do you know what intellectual property is?"}, {"date": "10 Dec 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado (Denver, CO) in Jul 2012", "Interview Descriptions": "Straightforward but intense. First apply online, followed by a phone screening, first interview with a panel of 6 and then a final 1:1 interview. Good feedback and communication at all points. Also requested to submit a written sample for review.", "Interview Questions": "Where do you see yourself in five years?\r\nWhat motivates you?\r\nWhy do you want this job?"}, {"date": "28 Apr 2016", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Colorado (Aurora, CO) in Mar 2012", "Interview Descriptions": "Two group interviews with each person in the group asking me questions.  They focused on my ability to deal with a difficult boss. I gave them some examples of actual events in which I had to deal with difficult people.", "Interview Questions": "Tell us about yourself."}, {"date": "22 Jul 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado (Boulder, CO) in Feb 2012", "Interview Descriptions": "It was a one on one interview where the supervisor described all of the activities that would be associated with my post. She also asked about myself and what I aspired to become. She wanted to establish a connection with the future employee and wanted to make sure they had the right set of skills and the right attitude for the department.", "Interview Questions": "What I wanted to do with my career and how would my current skills help in the job I was seeking."}, {"date": "24 Jul 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Colorado (Boulder, CO) in Dec 2011", "Interview Descriptions": "I was required to submit a resume and cover letter with 4 references that were followed up on. During the interview we reviewed my resume. I was asked multiple questions and I was asked to go over different schemes. I was then required to show my knowledge on a white board to prove I knew what I was talking about. After that we watched game and practice film and broke down different players and schemes.", "Interview Questions": "Why are you interested in this position?"}, {"date": "7 Apr 2012", "title": "Student Affairs Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Colorado (Boulder, CO) in Sept 2011", "Interview Descriptions": "After finding out the position on a job listings website, I applied online.  It was a relatively easy process, which I uploaded both my cover letter and resume.  A month later, I received an email asking if I was still interested in the position but was reminded of the salary and how they would not offered relocation assistance (which I already knew/assumed).  Once I accepted that fact, I was invited for a 15 minute phone interview, where I asked questions by a committee about student development, event planning, and diversity.  It was really quick!  The following week, I was invited for an on campus interview.  I met with a variety of people, staff and students as well as individually and in groups.  Although I was not offered the job, it ultimately took them a month to let me know that decision.  It's a very homogenous campus, and I felt out of place as a person of color interviewing.  Sometimes I felt was only brought to campus for that fact.", "Interview Questions": "Describe an event that you organized and how did you incorporate diversity into it?"}, {"date": "1 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Colorado (Boulder, CO) in Jul 2011", "Interview Descriptions": "The interview process really depends on the research group you want to join in and the Professor you are working with. I would say the first few months of my RA employment were taken as a \"interview process\", as a long-term examination for my motivation on my research topics as well as my capability in solving scientific problems.", "Interview Questions": "How do you use your physics and math skills to solve geophysics problems"}], [{"date": "21 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Colorado (Boulder, CO) in Apr 2011", "Interview Descriptions": "The department I was applying for flew recruits out for a two-day recruitment event. They paid for both me and my spouse, including the hotel. One day was spent going over general department details, with an hour-long poster session. Then three hours of interviewing with whichever faculty you are interested in. They asked about my past research, and I asked questions about theirs.", "Interview Questions": "Describe your work as a researcher"}, {"date": "7 Mar 2013", "title": "Research Assistant and Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado (Aurora, CO) in Mar 2011", "Interview Descriptions": "It was important to be persistent of my admissions, by contacting many professors from the department, before, and after applying. It helped to contact one professor, who gave me an assignment in the meantime, while waiting on an interview call. He was impressed when I accomplished the task well.", "Interview Questions": "There were no unexpected questions, but I figured the most difficult question for me was to explain why I chose this University over the others."}, {"date": "28 Aug 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Colorado (Boulder, CO) in Jan 2011", "Interview Descriptions": "Graduate School. Submit the Required Online Materials and then Got a Skype Interview From a Department Professor. The Professor Asks Several Questions such as:1 Why do you choose us? 2 Why do you choose Boulder? 3 How is your plan for your graduate school? 4 What is your personal research plan and future plan?", "Interview Questions": "What is the difference between Science and Nature?"}, {"date": "18 Aug 2013", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado (Boulder, CO) in Oct 2009", "Interview Descriptions": "This was a straight forward and transparent hiring process.  I was contacted shortly after sending in a resume for an in-person interview.  The interview itself lasted 30 minutes, and was with the head of the department and the staffing manager.  They asked relevant questions about my work experience as it related to the position.", "Interview Questions": "What is the air speed velocity of swallow."}, {"date": "19 Oct 2009", "title": "IT Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado (Boulder, CO) in Sept 2009", "Interview Descriptions": "Met with two different groups for 30 minutes each.  The first part of the interview was with two directors, asst. dean and a representative from HR.  The questions were primarily geared toward management style.  The second half ot the interview was with three people from the IT staff.  One was from security, one from sys admin, and one developer.  The questions were very technical in nature.", "Interview Questions": "Have you ever managed an IDS system?"}, {"date": "12 Dec 2013", "title": "Postdoctoral Researcher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at University of Colorado in Apr 2009", "Interview Descriptions": "With a postdoctoral researcher, there are typically at least 2 interviews.  The first to meet the investigator and the second to present graduate studies to the lab or perhaps to the entire department- it varies by investigator.  You should be able to talk to members of the group to determine what they think of the work environment and how they like it.", "Interview Questions": "None of the questions were memorable or ridiculous.  Be prepared to discuss your career goals and plans. Be aware you are talking to an academic researcher who may or may not respect you if you plan not to go that route."}, {"date": "29 Jun 2011", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at University of Colorado (Aurora, CO) in Apr 2009", "Interview Descriptions": "was offered a position in the department .", "Interview Questions": "How would you describe yourself"}, {"date": "20 Jul 2011", "title": "Payroll & Benefits Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado (Boulder, CO) in Jan 2009", "Interview Descriptions": "The hiring porcess is a word is LONG (for a state employee position) Please be prepared and/or understand that getting hired with any state organization is both time consuming and takes quite a bit of patience.  Filling out app took about 4-6 hours and I needed to include my resume AND copies of my transcript to prove education.  I also needed to enter my reference info (be sure that you note it down as your refs that you email should match those that you submittted).  Then it took 6-8 weeks to get the initial phone call after the app was submitted, another 2-3 weeks to get the interview and then a few more weeks to get an offer.  All in all 3-4 months from start to finish.  Having hired a few people in that state system in my tenure there, that timeline is pretty accurate.  One phone, one panel (3-5 people from different units in the dept which took about 2-2.5 hrs), ref. check, negotiations with managers, offer, etc.  Work culture is live it, breathe it, do it and if you're part of management, there's not a lot of work life balance.  People are friendly and nice but work is key.", "Interview Questions": "How familiar are you with the benefit plans or what we offer?"}, {"date": "5 May 2009", "title": "Project Manager Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado (Boulder, CO) in Sept 2008", "Interview Descriptions": "The screening and interview rpcess was very time consuming.  The first step consited of a multiple choice questionaire.  I was told that this step narrowed the filed of applicants to about 30-50\r\n\r\nTwo weeks later I was required to wrtie an essay responding to five specific topics relative to project management theory, budget control & cost management, interpersonal and departmental communication, staff managment, and construction mangement.  This narrowed the field to about a dozen.\r\n\r\nThe final step that I participated in was group/panel interview that consisted of verbal situational problem solving / what if type scenario role playing.  The top three emerging from that process were the granted an interview with the actual department supervisor.  I was not in the top three and feel that I made the error in answering the questions by actually providing real solutions to the problems presented.  In retro spect, I believe they were looking for a more bureaucratic supervisory delegation or pass the buck type of answer.", "Interview Questions": "A contractor contacts you and indicates that his crews are having difficulty completeing their work because theyare being frequently interupted by university staff and students asking questions. "}, {"date": "10 Dec 2009", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of Colorado (Boulder, CO) in Apr 2008", "Interview Descriptions": "Met with professor, expressed interest in research, offered job... typical grad student scenario.  Nobody else wants to work for them so they're happy to have you.", "Interview Questions": "Are you sure you want to do this work?"}]]