[[{"date": "16 Sept 2022", "title": "New Student Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Central Connecticut State University", "Interview Descriptions": "Two rounds of interviews, first was individual and second was in group of 4-5 students, where we were asked questions separately and as a team. We were placed in challenging situations and were asked how to handle them while working with other members of the group. ", "Interview Questions": "Strengths and weaknesses. \nMost challenging situation i have ever faced. "}, {"date": "30 May 2022", "title": "Communications Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Central Connecticut State University in Dec 2021", "Interview Descriptions": "Three interviews, group then individual with director and third with offer which ultimately was much lower than we verbally agreed upon, so I ended up declining. There was a disconnect between HR and director and a need to match salary levels based on union protocol.", "Interview Questions": "How do you handle conflict with coworkers? This was like the second question so a red flag"}, {"date": "28 Jul 2021", "title": "Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Central Connecticut State University", "Interview Descriptions": "Excellent communication from the search committee throughout (prior to both the first and second interview- there was an initial Zoom interview followed by a campus interview). Everyone gave ample time for me to ask questions and took time to answer them in depth.", "Interview Questions": "What strengths would I bring to the position."}, {"date": "6 Oct 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Central Connecticut State University (New Britain, CT) in Jun 2020", "Interview Descriptions": "The interview process was long and lacked communication. Applications were due by 12/31. The search committee did not contact me until late February, and due to COVID I did not hear from them again until June. After the final interview it took another 10 weeks to find out the outcome.", "Interview Questions": "How will you be able to balance teaching with the other core pillars (creativity, service to community)?"}, {"date": "5 Dec 2019", "title": "GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Central Connecticut State University", "Interview Descriptions": "Had to submit several letters of recommendation for the position I applied for. I also had to write an essay and fill out a lot of paperwork for the position. It was fairly simple to accomplish. Working out the hours for watching the lab was the only difficult part for me in addition to gaining card access with my blue chip account to the GIS labs and the building itself.", "Interview Questions": "no formal interview questions as there was not formal interview. Had to submit several letters of recommendation for the position I applied for. I also had to write an essay and fill out a lot of paperwork for the position. It was fairly simple to accomplish. Working out the hours for watching the lab was the only difficult part for me in addition to gaining card access with my blue chip account to the GIS labs and the building itself. "}, {"date": "20 Jan 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Central Connecticut State University in Aug 2019", "Interview Descriptions": "They asked who wanted the position. I had to write a cover letter and have a letter of recommendation which was actually a few teachers being able to say I was able to do the work.", "Interview Questions": "Why do you want this position? How will you help students? What is your availability?"}, {"date": "26 Jun 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Central Connecticut State University (New Britain, CT) in Jan 2018", "Interview Descriptions": "The interview panel was very professional and informative about the role required for the internship. Ph.D. mentorship was offered when conducting surveys of students in their integration with the university.", "Interview Questions": "How will you apply your coursework material learned to the position"}, {"date": "25 Oct 2019", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Central Connecticut State University (New Britain, CT) in Apr 2016", "Interview Descriptions": "Long interview process began in early April ended in August. Different stages: in person and over the phone. Typically meet with a panel of individuals several times throughout the process, little follow-up", "Interview Questions": "What motivates me "}, {"date": "8 Sept 2017", "title": "University Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Central Connecticut State University (New Britain, CT) in Dec 2015", "Interview Descriptions": "Applied online, received a call to come in for an interview within the next couple of days, they already had an interview date set and there were no negotiations with the interview date, they deliberated for a week or 2 and then offered me the job.", "Interview Questions": "Can you tell me about a time when you've had to deal with a difficult student or a student who was in crisis?"}, {"date": "21 Apr 2016", "title": "Tresurer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Central Connecticut State University (New Britain, CT) in Jan 2015", "Interview Descriptions": "Easy interview that requires election from students. the election was easy. you talk to the president to get his approval. you run a campaign among students and hope to be elected. wonderful experience.", "Interview Questions": "Why do you want this position"}], [{"date": "20 Dec 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Central Connecticut State University (New Britain, CT) in May 2012", "Interview Descriptions": "Very confused chain of command with power seeking chair with right-wing tendencies. Walked in on very poor faculty/admin relationship - just hateful. Committee each asked questions and none were too challenging. Obviously friendly people and others without a publication or hour after hours just living out their tenure. The chair turned out to be an incompetent boob.", "Interview Questions": "How do you use technology in the classroom."}]]