[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Staff and Working Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 May 2023", "job_title": "Clinical Informatics Specialist in Orangeville, ON", "duration": "N/A", "pros": "- Small hospital setting where you can meet and be familiar with the executive team, directors, etc. - Opportunity to effect change in the organization - Opportunities for personal and professional growth - Pay is within appropriate range of industry standard - Collaboration with regional hospitals to ensure best practice and consistency - Great community involvement - Affordable meals in the cafeteria", "cons": "- No Tim Horton's or other franchises on-site"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Work Plave", "rating": "4.0", "reviewer_affiliation": "Former Contractor, more than 1 year", "job_date": "6 Jun 2022", "job_title": "Anonymous Contractor in Orangeville, ON", "duration": "N/A", "pros": "- very positive environment in the department I worked in", "cons": "- negative interactions with visitors"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "All Around Good Place", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 May 2022", "job_title": "Dietary Aide in Orangeville, ON", "duration": "N/A", "pros": "Good Wages/ Salaries\r\nNice People\r\nProfessional Staff\r\nAmazing Benefits \r\nOvertime Available", "cons": "Takes a while to move up but worth it once you do."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great team, poor management", "rating": "4.0", "reviewer_affiliation": "Current Temporary Employee", "job_date": "16 Mar 2022", "job_title": "RPN in Orangeville, ON", "duration": "N/A", "pros": "Great team to work with, caring atmosphere.", "cons": "Lots of temporary positions, difficult to get a permanent FT position, needs better management."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Disorganized.", "rating": "1.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "1 Mar 2021", "job_title": "Human Resources Assistant in Orangeville, ON", "duration": "N/A", "pros": "One of the team members was nice and took an hour to show me briefly what she did in a day because she noticed I wasn’t given anything to work on", "cons": "On my first day my reporting manager did not come in due to the roads being too bad to drive on. My commute was just as far but no one told me I could come in the next day. They told me they were urgently hiring for my position of HR Assistant but on my first day they had nothing for me to do. I assumed it was due to my manager not being in the office and thought the next day would be better. It was not, the next day I still was given nothing to do. On my third shift they gave me nonsense jobs just to keep me busy for part of my shift. They also told me they wanted to improve their onboarding program and really, they didn’t need to improve on it they needed to actually create one. No one could tell me what my actual job was so it resulted in me sitting alone in a back office twiddling my thumbs. I would ask people if they had anything for me to do and they would tell me “oh you need something to do... I don’t have anything for you.” \r\nWhen I was told to do tasks, I was told to do them without being given adequate resources to complete them successfully. I truly feel I was set up for failure while being employed with this company. No one ever sat down and explained anything thoroughly to me and when I would ask questions I often felt as though I was irritating my co-workers. \r\nI obviously resigned as I was clearly not a valued member of the team and it didn’t matter if I showed up to work or not. This became abundantly clear as when I sent my resignation in, I had to send it to one of my team members and not the manager, as I was not given anyone's contact information. The team member did not start their day until 9 am, my shift started at 8:30 am. No one called to see why I wasn’t in for my shift. No one wrote back to me regarding my resignation despite them knowing they had a retention problem. The manager never sat down to talk to me about my role and there was little to no training either. Overall the team was somewhat nice but so incredibly disorganized and discouraging. I would not recommend anyone take this position as the company doesn’t know what the position they’re hiring for entails. Big waste of my time."}], [], []]