[[{"date": "24 Feb 2023", "title": "Quality Improvement Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TMF Health Quality Institute", "Interview Descriptions": "I interviewed with someone who was on an entirely different project than I was placed on. The information conveyed to me didn’t line up with the project I was placed on.", "Interview Questions": "To rank my knowledge of different subject matter areas, 1-5."}, {"date": "8 Sept 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TMF Health Quality Institute", "Interview Descriptions": "They called me and it was a phone screen trying to figure out your experience with different programming languages and large data sets. Next call they said would be more in depth about projects but weren't interested in details on phone screening.", "Interview Questions": "What was the biggest data set you have worked with?"}, {"date": "20 Oct 2019", "title": "Prefer Not To Say Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TMF Health Quality Institute (Austin, TX)", "Interview Descriptions": "It took a month to receive an interview email. It was taking about half hour, asked a lot of questions related to the reason for applying for this position, your career expectation, etc", "Interview Questions": "Your career expectation"}, {"date": "23 May 2018", "title": "Quality Improvement Coordinator I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at TMF Health Quality Institute (Austin, TX) in May 2018", "Interview Descriptions": "I applied online and I was called by a recruiter on the same day that I applied.  We played phone tag for a few days before we scheduled a phone screen.  The phone screen was a little more in-depth than a regular phone screening, but I was overqualified for this position in regards to the initial selection criteria and I was able to easily answer the questions.  I found the recruiter to be cold and rude.  She kept cutting me off and was very short with me.  By the end of the screening, I felt like I had to be concise because she was disinterested in hearing my answers.  It's hard to sell yourself if the recruiter is trying to push you off the phone.", "Interview Questions": "How have you used research in your work life to investigate an issue for management?"}, {"date": "25 May 2017", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TMF Health Quality Institute (Austin, TX) in Mar 2017", "Interview Descriptions": "Phone interview with HR recruiter, I then was invited to an in-person interview with hiring manager and a few team members. All went fine. I was told that I would hear back within a week. I did not her back. I sent an email inquiry, I then was told that decision will be made next week. I did not hear anything next week. I waited two weeks, I received nothing. Very unprofessional and lousy HR handling of communication, which indicates this is a lousy place to work for.", "Interview Questions": "Typical Project management questions about managing scope, time and budget"}, {"date": "29 Mar 2018", "title": "Health Quality Consultant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TMF Health Quality Institute (Austin, TX) in Jan 2017", "Interview Descriptions": "My first interview was with a recruiter.  The recruiter then scheduled a second interview with the project manager. All interviews were done via phone due to the remote position I applied for.  I researched the company and role of HQI consultant prior to the phone interview.", "Interview Questions": "What makes you a great fit for this position? "}, {"date": "3 Jul 2017", "title": "Quality Improvent Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at TMF Health Quality Institute (Austin, TX) in Jun 2016", "Interview Descriptions": "There is a two to three step process for hiring.  I was very impressed by the original recruiters knowledge about the position to which I was applying.  The recruiter will contact you and ask general knowledge question about the task area to which you have applied.  If you have the experience or knowledge they will pass you to the second phase which is the project lead.  Instead of the project lead, I was interviewed by peers because that position was not filled.  In my experience I had a third interview with the Project Director because our team was in the process of hiring new staff.", "Interview Questions": "How comfortable am I educating physicians as a non-clinician."}, {"date": "9 Jan 2016", "title": "Quality Improvement Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at TMF Health Quality Institute (San Marcos, TX)", "Interview Descriptions": "Initial phone interview was professional, and a very detailed questioning of terminology and my knowledge regarding the industry and position.  \n\nIn person interview was located at the office.  The interviewer gave me great instructions/directions to the office.  Questions were great and based on experience and skill set for the position.  Everyone was professional and polite.  \n\nGood experience overall.", "Interview Questions": "Please share your experience working with providers or community partners."}, {"date": "22 Apr 2016", "title": "Information Technology Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at TMF Health Quality Institute (Austin, TX) in Jan 2016", "Interview Descriptions": "HR uses contractors because they can't get people through the regular process. It takes a long time to process interview and very inconsistent. It is different for every candidate. Some people will interview faster than another. I felt like there was a discrimination per individual. Sadly, some employers feel they have the right (or even the need) to behave badly in the workplace, hurting and demoralizing the very people whose best thinking and assistance they need. Employees aren’t off the hook, either—many of the things that escape their lips in a moment of frustration damage their value to the company and their own career growth over time.", "Interview Questions": "How do you work under different supervisors?"}, {"date": "1 Aug 2018", "title": "QIC-I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TMF Health Quality Institute (Austin, TX) in Jan 2015", "Interview Descriptions": "Video interview. Not many questions. They wanted to know about my previous work with CMS and if i had experience with contract writing and if I was willing to learn about contract writing in this position.", "Interview Questions": "Simple questions about my resume and work experience. "}], [{"date": "25 Feb 2014", "title": "Medical Policy Nurse Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at TMF Health Quality Institute", "Interview Descriptions": "It was very personable.", "Interview Questions": "Difficulty finding office.  "}]]