[[{"date": "14 Dec 2022", "title": "Assistant Director of Advising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Northern Kentucky University", "Interview Descriptions": "Six interviews. One with a committee of six people. One with the Director. One with the Assist. Dean of the division. Two separate interviews with Program Directors. One with the Director of Career Services and Diversity & Inclusion. One with the Associate Dean over student services.", "Interview Questions": "What is your Advising Philosophy?"}, {"date": "3 Mar 2022", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Kentucky University", "Interview Descriptions": "It was very straight forward. Had a phone interview and an in-person interview. They described the position well and answered every question I had. They were also very responsive and flexible.", "Interview Questions": "What experience makes you a good fit for this position?"}, {"date": "8 Jul 2021", "title": "Digital Marketing Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Kentucky University", "Interview Descriptions": "It was a good experience! Asked a lot of great questions and answered mine thoroughly. The interview was about four hours and I got to meet with a lot of different people in the team.   I was offered the job and have worked there for years now.  A wonderful place to work!", "Interview Questions": "What is your experience in marketing?"}, {"date": "1 May 2023", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northern Kentucky University (Newport, KY) in May 2021", "Interview Descriptions": "1 phone 1 zoom 1 on campus all staff members meeting. Moderately intense and you meet everyone you’ll work with daily. AVP makes decision on employment at end of process", "Interview Questions": "What is your process in bringing in a major gift"}, {"date": "14 Nov 2022", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Kentucky University in Apr 2021", "Interview Descriptions": "Very easy and laid back. Made me feel comfortable and I got to meet everyone I'd be working with. The interview lasted about 45 minutes and they were up front with pay and benefits and the duties that the job would entail.", "Interview Questions": "How did you fix a situation at your last job?"}, {"date": "10 May 2023", "title": "Facility Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northern Kentucky University (Highland Heights, KY) in Feb 2021", "Interview Descriptions": "Easy questions. Sell yourself. A lot of hypothetical situations that you will have to work through. Easy to get an interview they are always hiring. Strength and weaknesses questions. Will work around your school schedule", "Interview Questions": "How would you handle a situation with an angry patron talking to one of your employees"}, {"date": "9 Aug 2019", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Northern Kentucky University", "Interview Descriptions": "I applied for this job on NKU job board. There was no interview process. They just reviewed my resume and sent me an offer. I received my job offer after a week.", "Interview Questions": "N/A"}, {"date": "24 Jul 2020", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Northern Kentucky University (Highland Heights, Campbell, KY) in Aug 2019", "Interview Descriptions": "The interview was fairly easy. I was sent an email few days after applying and scheduled for an interview. It was 1:1 with the head of public service access. I was offered the job few days later.", "Interview Questions": "Your strengths/weakness and why should they hire me?"}, {"date": "6 Jun 2019", "title": "Inventory Control Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Kentucky University", "Interview Descriptions": "I have been asked about my strengthens and weaknesses. Also, I was asked about my major and how I can benefit the team at Northern Kentucky University. I took a tour with the manager to see the workplace and to be familiar with the employees afterwards.", "Interview Questions": "What are your weaknesses?"}, {"date": "18 Aug 2017", "title": "Student Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Northern Kentucky University", "Interview Descriptions": "Simple questions mostly getting to know you and your education and goals.\r\nJust be confident and know that you could be hired in a future semester as well.\r\nHe can be intimidating but just be brave!", "Interview Questions": "Why do you want to work here?"}], [{"date": "16 Feb 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northern Kentucky University (Highland Heights, Campbell, KY) in Jun 2017", "Interview Descriptions": "I applied online for a Student Assistant position through the NKU HR site. It was a simple application process. I only needed to upload a cover letter and a resume. It also had references listed as optional.", "Interview Questions": "Can you describe a time when you had to work with others to solve a customer problem?"}, {"date": "19 Oct 2020", "title": "IT Support Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Kentucky University (Highland Heights, Campbell, KY) in May 2017", "Interview Descriptions": "I did one 20 minute phone call interview, in which they asked technical support questions.  It seemed they were mainly looking for buzz/keywords and experience stories during this time.\r\n\r\nAbout 2 weeks later I went in for an in-person and met a board of 4 interviewers.  Here there were slightly high level technical questions, as well as some personality/behavioral questions.\r\n\r\nI received an offer almost 5 weeks later.  The offer time was a little slow, but that's how they run.", "Interview Questions": "Explain a time you've dealt with a user who is frustrated with their issue, and is being aggressive with you."}, {"date": "11 Feb 2017", "title": "Assistant Professor, Music Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northern Kentucky University (Highland Heights, KY) in Feb 2017", "Interview Descriptions": "The interview process was very intense with a few short breaks in between. I could tell that everyone enjoyed what they do and got a long well. The department seems healthy and friendly.", "Interview Questions": "What would I bring to contribute to the growth of the program?"}, {"date": "4 Aug 2016", "title": "Mobile Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Kentucky University", "Interview Descriptions": "It was a 1-on-1 interview. We just talked about iPhone app development. I asked several questions about how they developed iPhone apps. We also talked about Objective C and how it compares to C++. It was an easy interview. I didn't know anything about Objective C or iPhone app development beforehand.", "Interview Questions": "If you allocate an object with new, what must you do?"}, {"date": "16 Jun 2016", "title": "Assistant Professor - Tenure Track Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Northern Kentucky University (Highland Heights, KY)", "Interview Descriptions": "Interview with program faculty, who primarily asked about my areas of research interest and teaching experience.\r\nInterview with department faculty (approx. 25 people).\r\nDemonstration of my teaching.  Involved teaching a class on a topic already chosen by the instructor of record and fielding questions from both students and faculty.\r\nResearch presentation to program faculty, including responding to objections and arguments.\r\nInterview with the dean of the college.\r\nInformal tour of campus with a program member.", "Interview Questions": "Which courses I would be prepared to teach.\r\nVarious subject matter questions dip urging research and classroom presentations.\r\nWhy I left a previous tenure-track position."}, {"date": "17 May 2016", "title": "Assistant to the Vice Provost Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northern Kentucky University", "Interview Descriptions": "I applied online, then a month later I got an email invitation for an interview.\n\nThe interview was a three-hour process with three different groups. Everyone was friendly and one thing they all told me was that the application process is SLOW and to not get discouraged.\n\nThe next week, all my professional references told me that the university called them about me, so things were looking pretty good.\n\nExcept the next day, I got an email starting that I was not chosen because I didn't have the skill sets they were looking for. Um, what? Why go through the entire process to include checking my references if I didn't have the skills they needed??", "Interview Questions": "Prioritize three urgent matters in the order that you'll handle."}, {"date": "9 Sept 2019", "title": "Facilities Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Kentucky University (Highland Heights, KY) in May 2016", "Interview Descriptions": "phone interview, on campus interview and dinner with department. There was a campus tour, a facility tour, a one on one with the director, my supervisor, and a panel with the department. overall it was a stressful day but not the worst", "Interview Questions": "what is your background, why do you want to work here, what are your strengths "}, {"date": "18 Feb 2016", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northern Kentucky University", "Interview Descriptions": "I applied online and a few months later they reached out to set up a phone screen. After that, they called to set up an in-person interview. We set one up, and they cancelled it due to a snowstorm, so we had to reschedule. The interview was three hours long and consisted of a couple of smaller interviews, a large panel interview and a writing and editing test. They called to reject me really fast (about 24 business hours). I had to take two full days off of work for them and go through a pretty grueling interview process and I felt like I wasn't really considered in the end.", "Interview Questions": "What type of writing experience do you have?"}, {"date": "29 Jan 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Northern Kentucky University (Highland Heights, Campbell, KY)", "Interview Descriptions": "Skype Interview, On campus interview with search committee, Open forum with hiring department, open forum for Campus (they can ask you any question they want, there were about 30 people) and a  one on one interview with hiring manager.", "Interview Questions": "What do you know about working in academia?"}, {"date": "25 Feb 2019", "title": "Transfer Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Northern Kentucky University (Highland Heights, Campbell, KY) in Nov 2015", "Interview Descriptions": "I was brought into a room to speak with a committee of people. They took turns asking questions and then allowed me to ask questions. It took a while to get a response because they have a chain of command who has to approve the committee's decision. Overall, I think it took about 3-4 months to finally start.", "Interview Questions": "What experience do you have that you could bring to this position?"}], [{"date": "6 Oct 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Northern Kentucky University", "Interview Descriptions": "The hiring process is sometimes lengthy. Usually positions post for 3-4 weeks. Once the application window closes, a committee reviews all of the applications and select 4-8 applicants to interview by phone or call references. Using the references or phone interview 3 applicants are usually selected for a panel interview. After the panel interview the job is offered to the top candidate. If accepted, the candidate submits to a background check (2-3 days). Then they are cleared to start.", "Interview Questions": "Describe a work-place conflict and how you handled the situation."}, {"date": "31 Oct 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Northern Kentucky University (Highland Heights, Campbell, KY) in Aug 2015", "Interview Descriptions": "Questions were juvenile for the level of the position.  Interviewers did not seem to be prepared.  I was prepared for a professional interview, and it seemed like the committee was going through the motions.", "Interview Questions": "What do you want to do in the future?"}, {"date": "22 Apr 2015", "title": "Mobile Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Northern Kentucky University", "Interview Descriptions": "Both technical and experience questions were provided. Covered all parts of the position to ensure a wide breadth of knowledge was possessed. \r\n\r\nThe interview covered topics about web and mobile technologies as they are often used in tangent.", "Interview Questions": "What is informatics?"}, {"date": "5 Apr 2017", "title": "Bookseller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Northern Kentucky University (Northern, KY) in Jul 2014", "Interview Descriptions": "Large groups, sat in circle (maybe 7?) and answered questions as we wanted, but each person had to answer each question. Super easy, time to think and listen to others.", "Interview Questions": "N/A"}, {"date": "7 Mar 2014", "title": "Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northern Kentucky University", "Interview Descriptions": "All day interview process, including panel interview with potential co-workers, one-on-one interviews with direct supervisor and department head, presentation on topic of choice, campus tour, etc. Reimbursed for travel expenses.", "Interview Questions": "\"How do you know ____?\" (who I didn't know) "}, {"date": "28 Nov 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Northern Kentucky University (Highland Heights, Campbell, KY) in Oct 2013", "Interview Descriptions": "Face to face interview with my boss. It was in his office and he was very easy to talk to.  Best interviewer I have experienced to date and wish all future interviews were like this one.", "Interview Questions": "Where do you see your self in a year? "}, {"date": "8 Apr 2013", "title": "Audio Video Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Northern Kentucky University", "Interview Descriptions": "I was called in to interview for the Athletic AV specialist position.  I was verified as a full time student with a major in media of some sort. Then I was hired on after a background check", "Interview Questions": "I was asked about my media experience"}, {"date": "21 Nov 2013", "title": "Software Engineering Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Northern Kentucky University (Highland Heights, KY) in Nov 2012", "Interview Descriptions": "One interview with the managers. Pretty easy.", "Interview Questions": "They just asked very simple programming questions."}, {"date": "15 Nov 2016", "title": "Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northern Kentucky University (Florence, KY) in Jun 2012", "Interview Descriptions": "It was done in a group format.  Multiple interviewers on the committee interviewing one candidate. It gives you a good understanding of the department and position you will be working in.", "Interview Questions": "They were appropriate"}, {"date": "8 Apr 2013", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Northern Kentucky University (Highland Heights, KY) in Sept 2011", "Interview Descriptions": "It is a great for students in the college of informatics at Northern Kentucky University. You can apply on the schools jobs website and see open positions.", "Interview Questions": "N/A"}]]