[[{"date": "2 Aug 2019", "title": "Direct Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crotched Mountain Foundation", "Interview Descriptions": "It was a friendly conversation. Many questions were asked from both sides. They seem to have great organization and fully understand their scope of need. It lasted about an hour, and I really enjoyed speaking with the employees of the company.", "Interview Questions": "I was asked to elaborate on some of my work experience."}, {"date": "13 Feb 2017", "title": "Client Services Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Crotched Mountain Foundation (Clearwater, FL) in Feb 2017", "Interview Descriptions": "I had to submit a resume, an application, and took testing.  Then I had a personal (hour long) interview, and took a typing test.  I submitted a resume after seeing an ad on a job website.  I got\r\na call from the person that hires there, and did some testing online before the interview.  I then\r\nwent in for the interview which was about an hour and went well.  I then did some in person testing\r\non the computer there to demonstrate typing and software program proficiency.  It was a very\r\nthorough job application process!", "Interview Questions": "About my work background on my resume, and specifically about the type of related work I have done."}, {"date": "16 Apr 2018", "title": "PARA II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in Nov 2016", "Interview Descriptions": "Very brief. Ask you some general questions. They're not trying to trick you. You get interviewed by different people. It could be the teacher, it could be the program manager, it could be the staff supervisor, it could be the principle.", "Interview Questions": "What do you know about Crotched Mountain? How did you hear of us? Do you know what we do?"}, {"date": "7 Oct 2016", "title": "Residential Counselor II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in Jul 2016", "Interview Descriptions": "Quick and easy if English-proficient and motivated to work with clients. Did a quick language proficiency written assessment then spoke with staff members to determine fit. Outlined educational background, past experience, basis for potential fit and what I could contribute to the institution. Met with program managers and then with the manager of the specific program I was assigned to to outline specific nuances of the clients place there.", "Interview Questions": "Why do you want to be here?"}, {"date": "13 Apr 2017", "title": "Residential Counselor II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Crotched Mountain Foundation in Jun 2016", "Interview Descriptions": "They just ask regular questions nothing serious or too brain tasking. Bottom line is they wanna know if you have the physical strength to deal with clients and can also communicate effectively .", "Interview Questions": "What is effective communication \nDo you have any experience with physically challenged individuals\nDo you have cpr training"}, {"date": "3 Dec 2016", "title": "Paraeducator II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in Jul 2015", "Interview Descriptions": "Met with a man and a woman at the school. They asked questions that I was way too prepared for. Just throwing it out there. They take anybody when they need people, even people who don't speak english well.", "Interview Questions": "N/A"}, {"date": "1 Dec 2017", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in Oct 2013", "Interview Descriptions": "You go on fridays wait around until your interviewed by one or two people. They ask questions about your work experience , then education. They go on to explain the hours and duties. If they accept you go to the HR for paper work and an official offer and pay rate. Finally they give you a date to return for orientation.", "Interview Questions": "How would you describe your experience with working with children?"}, {"date": "8 Nov 2015", "title": "Paraeducator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in Sept 2013", "Interview Descriptions": "Spoke with HR about coming in for an interview. Met with Former Operations Manager of Education and discussed job, spoke with HR about wages, took job and attended 1 week of classroom training before meeting any client or seeing what they were like. Directed to group home to observe, and determine how comfortable I was with clients and who I'd want to work with.", "Interview Questions": "Are you comfortable working with clients with disabilities or with this line of work? Are you okay with swimming with your client? Are you okay changing soiled briefs and soiled sheets? Are you okay with showering/cleaning some clients if needed? Are you okay with loud noises? What experience do you have with people with disabilities?  Where would you like to be in a few years?"}, {"date": "7 Oct 2013", "title": "Counselor III (Lead Counselor) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in Jun 2013", "Interview Descriptions": "I had one interview with the head of residential.  He was in charge of all the group homes at the rehabiliation center.  I feel he was thorough to a point in describing the job but left out some important information such as how dangerous some the residents are.", "Interview Questions": "He asked me to tell about a challenging incident at privious job(s) that made me feel I was qualified for the job there."}, {"date": "6 Aug 2016", "title": "Licensed Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in May 2012", "Interview Descriptions": "They called and asked me to come in the same week. I met with an HR person and a nurse manager. They asked me basic interview questions and some on why I had left my last job. The NM was pleasant the HR person not so much.", "Interview Questions": "What do you like about crotched mountain?... Why are you applying here?"}], [{"date": "25 May 2012", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Crotched Mountain Foundation (Greenfield, NH) in Mar 2012", "Interview Descriptions": "I met with HR and the nurse manager for 15 minutes. It felt informal, they were polite and asked standard Qs like \"Why do you want to work here,\" and \"What are your strengths?\"  They were receptive to my many questions about their facility. They gave me a tour on a second interview (no questions) and offered me the job.", "Interview Questions": "Why do you want to work here?"}]]