[[{"date": "6 Apr 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Seton Hall University (South Orange, NJ)", "Interview Descriptions": "All day interview process involving cohort of around 20 applicants. Consisted of multiple individual interviews conducting individual and group discussions. Questions focused on past experience, motivation and response to scenarios", "Interview Questions": "What makes you prepared to handle an intense graduate level workload"}, {"date": "23 Nov 2022", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seton Hall University", "Interview Descriptions": "It was an all-day interview with questioning and the candidate doing a presentation. You also get lunch which is a nice perk. Overall, the day goes pretty fast as you have a working schedule throughout the interview.", "Interview Questions": "One thing to know is why you want that specific job!"}, {"date": "18 Oct 2022", "title": "National Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Seton Hall University", "Interview Descriptions": "Very easy process, that was well ran and very professional. Questions were reasonable, and the interviewer really wanted you to talk about your experience. If you are confident you will succeed. Good luck!", "Interview Questions": "Tell me about a time you dealt with turmoil?"}, {"date": "15 Dec 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Seton Hall University (South Orange, NJ) in Jul 2022", "Interview Descriptions": "The interview process was fairly simple. At first, as a recent graduate, I received a recommendation for the job opening, applied through a link, and shortly after received a calendar invite to schedule a virtual interview. I sat with three individuals, who all asked me questions. All in all, I thought the interview went very well. I never heard back about the interview ever again. No feedback, no answer. Ghosted.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "19 Mar 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seton Hall University", "Interview Descriptions": "The  process was your basic interview questions, tell me about yourself, why are you interested in this position, what are your strengths/weaknesses. Research mission of university and how you can add value it", "Interview Questions": "The  process was your basic interview questions, tell me about yourself, why are you interested in this position,  etc"}, {"date": "21 Dec 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seton Hall University", "Interview Descriptions": "phone call interview regarding former experience and future plans. this job is a summer internship so it was mainly the employer talking about the job requirements and briefing the projects.", "Interview Questions": "have you had any experience with foreclosure litigation?"}, {"date": "30 Nov 2021", "title": "Nursing Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seton Hall University", "Interview Descriptions": "It was really easy they just asked about me and why I wanted to be a nurse. The process was really quick. They just want to get to know the real you.", "Interview Questions": "Tell me about yourself\nWhy do you want to be a nurse? "}, {"date": "12 Sept 2021", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seton Hall University", "Interview Descriptions": "The interview process consisted of 2 interviews. 1st interview was a zoom interview with 2 directors, and the 2nd interview was with the VP & Dean of the dept. \n\nThe 1st interview was a series of questions and then you asked questions at the end. \nThe 2nd interview was more of a conversation. We just spoke about experiences and digging into topics that pertain to the job.", "Interview Questions": "Tell me about yourself\n\nWhat attracted you to the position and seton\n\nComputer skills/ software's that you are skilled in. What type of reports/ documents you have created? \n\nProvide an experience when you effectively done by someone else and how you ensure minute details. \n\nShare an experience when you successful coordinated with others and conversely about a coordination effort that wasnt as successful and what you learned from that experience? \n\nCan you tell us about a problem that you had at work and what were the biggest lessons learned from that problem? \n\nCan you talk about an experience working on teams or across multiple teams and what kind of teams do you find yourself thriving the most? \n\nHow do you handle having multiple pressing assignment due at the same time? \n\nHow do you schedule and track meetings for an executive? \n\nCan you describe your experience with monitoring and tracking budgets for a dept and what software you have used to support those supports in tracking? \n\nCan you tell us about a time when you had to say no on behalf of your supervisor? \n\nHow do you go about providing difficult/challenging news to clients/ students? "}, {"date": "3 Jan 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Seton Hall University (South Orange, NJ) in Mar 2021", "Interview Descriptions": "The process was excellent in that I had ample opportunity to learn about the position, meet a variety of people including students, and get a full understanding of the culture. Every person I met asked insightful questions and provided answers to all of my questions.", "Interview Questions": "How will you ensure that you provide equal opportunity for all students?"}, {"date": "31 Aug 2021", "title": "Nursing School Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seton Hall University (New Brunswick, NJ) in Mar 2020", "Interview Descriptions": "Face to face, very professional and they were very easy to talk to. They wanted to know about more than just my transcript and resume, they really wanted to get to know me.", "Interview Questions": "why do you want to come tot his school"}], [{"date": "22 Nov 2020", "title": "Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seton Hall University (Newark, NJ) in May 2019", "Interview Descriptions": "Zoom call. Meeting the manager and the colleagues. I had to spend a day with them at at the end of the day I had a presentation . After the presentation ia had a two hour face to face interview with the search committee", "Interview Questions": "What are  your reasearch objectives "}, {"date": "28 May 2019", "title": "Information Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seton Hall University (South Orange, NJ) in May 2019", "Interview Descriptions": "I applied online with a cover letter and was quickly ushered into a phone interview.  Upon undertaking the phone interview with Keith in the I.T. Department, he scheduled me for an in-person interview at the start of the next week.  That interview was held in Corrigan Hall with Keith and Eric.\r\n\r\nThe interviews themselves went well; there were no specific technical questions and mostly they centered around discussions of past experience, skills, and how I've handled similar events/incidents.  I found the interviewers to be cynical and negative often mentioning the difficulty they have progressing security initiatives, policies, and projects in the Academic environment or with the type of staff and faculty they work with; in essence, the politics of the place (which is conceivably better to know about prior to accepting a position). \r\n\r\nUpon completion of the in-person interview, as we were shaking hands, I was informed that I was one of two candidates for consideration who, in the interviewers' words, \"actually knew what he was talking about\" in the realm of Cybersecurity.  I was further informed that I would get a response either that day (Monday) or the next day (Tuesday) at the latest.\r\n\r\nOn Wednesday I sent both interviewers a \"thank you\" email.  I received no reply to that email and no feedback was given about the hiring progress.  A week later (the next Monday) I sent a follow-up email politely requesting feedback.  I went back to the Seton Hall application website and was able to log into an account and check the status of my application which stated \"under review.\"  I did not receive any reply to my second email either.  Over 2 weeks later without any replies or updates, I called the I.T. Services Helpdesk and left a message on Keith's voicemail.  I left a polite message with my name and contact information, stated I had not received any replies, and inquired about the progress of their hiring process.  I received no reply via email or phone, however upon checking the status of my application on Seton Hall's website again, my status was changed to \"not selected\" by the close of the same day that I called.\r\n\r\nMy experience above is indicative of an uncommunicative, inconsiderate, and unprofessional environment.  Over two weeks of complete silence despite polite inquiries, gratitude, and offers to furnish any additional needed information were a large red flag for me that likely would have resulted in my declining an offer if it were made at this point.  I have had positive experiences with other organizations where I did not receive an offer(Hubspot comes to mind), but I have never encountered this level of lack of consideration for the candidate.\r\n\r\nThe position, over two weeks after my in-person interview, is still posted both on Glassdoor and the Seton Hall website.  I would be curious as to what became of the other qualified candidate and if he had a similar experience.\r\n\r\nSeton Hall is well reviewed one Glassdoor and came with a recommendation from a past employee who worked in Career Services, hence my original application to the role.", "Interview Questions": "Standard questions about how I would handle a situation, how I have handled a situation, and about my experience, skills, and previous employers.  For instance \"If you received a security alert for an endpoint, how would you handle the process to verify and rectify the issue?\""}, {"date": "5 Jun 2019", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seton Hall University (Nutley, NJ) in Apr 2019", "Interview Descriptions": "Was called in for an in-person interview, which consisted of three people in a conference room: one advisor, one dean, one faculty person.  Interview lasted for about 30 mins.  They didn't have any pre-set questions.  They did not follow-up afterwards to let me know the outcome of the search.", "Interview Questions": "What do you know about Seton Hall?"}, {"date": "13 Jul 2021", "title": "TEACHERS ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Seton Hall University in Mar 2019", "Interview Descriptions": "Apply, then if you get passed the first round you get interviewed. Afterwards they’ll let you know in a few weeks about selection. The interviewers were very  nice and friendly. The questions were simple, about your previous experiences, fun fact about yourself, things of that nature. The interviewers were fellow students so it was not an intimidating process.", "Interview Questions": "If you were a kitchen appliance, what would you be and why? "}, {"date": "19 Aug 2021", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Seton Hall University (South Orange, NJ) in Jul 2018", "Interview Descriptions": "very informal, met with prior professor to discuss the responsibilities of the position. I would aid in research for papers he planned to publish, or different market research projects he had planned.", "Interview Questions": "what do you look to get out of this position?"}, {"date": "24 Nov 2017", "title": "Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Seton Hall University", "Interview Descriptions": "You go through two interviews, first one with coordinators who are also students. Then you interview with one or two supervisors, and present a project that talks about who you are as a person and what the role means to you.", "Interview Questions": "What makes you a better hire than the next, what makes you stand out"}, {"date": "24 Aug 2017", "title": "Resident Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seton Hall University (South Orange, NJ)", "Interview Descriptions": "There was one phone interview with the director and assistant director, then a resident director and they asked a few questions. The next round was the final round of interviewing, which was an on campus interview consisting of meeting with the resident director you would be working with, then interviewing with a panel of 7-8 live in professionals, then interviewing with a panel of 4-5 executive professionals in res life.", "Interview Questions": "Do you have experience with budgeting and supervision of students?"}, {"date": "26 Apr 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Seton Hall University (South Orange, NJ) in Jul 2017", "Interview Descriptions": "I had to take a pretty strenuous writing exam for my position. It took about an hour to finish and I got a call back two weeks later.  The writing exam involved a few articles that I had to edit and then a writing test after. I was able to use a computer.", "Interview Questions": "There wasn't an actual interview as I was hired from inside. "}, {"date": "16 Mar 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Seton Hall University (South Orange, NJ)", "Interview Descriptions": "2 rounds of interviews, one with a group of fellow candidates and another with one to two professional staff members. In the group, you will participate in several activities which will accurately display your skills. In the one on one interview, you will be asked a set list of questions which you must answer fully.", "Interview Questions": "If there were a widely unpopular housing policy put in place, how would you present it to your residents?"}, {"date": "7 Aug 2016", "title": "Teaching Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seton Hall University (South Orange, NJ) in Jun 2016", "Interview Descriptions": "The interview went well friendly department in biology. Was asked to do a power point presentation on a selected topic. The department was under paid where the professors expressed this sentiment.", "Interview Questions": "Did ask long term goals and experience teaching."}], [{"date": "18 Nov 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seton Hall University (South Orange, NJ) in Mar 2016", "Interview Descriptions": "Intense. Great questions. Grading test. A group of full time professors discussed in class ideas and ideals. Submission of lesson plan. Prepared story to dissect. Very upfront about what the job entails.", "Interview Questions": "How would you handle a unruly student."}, {"date": "30 Apr 2017", "title": "Electrician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seton Hall University in Mar 2015", "Interview Descriptions": "The interview and hiring process were standard procedure. Interview was with all management personnel in a conference room setting. Management asked me questions about my experience and where can I see myself in the future.", "Interview Questions": "Can you work overtime?"}, {"date": "14 Jul 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seton Hall University", "Interview Descriptions": "Very amicable employer. I enjoyed the discussion and found the boss very personable. I saw an immediate fit with the organization. They did negotiate with me and I was able to obtain a salary that worked for me. They also responded pretty quickly and I was hired within a timely", "Interview Questions": "The usual 'what was your greatest challenge at your last position.'"}, {"date": "13 Aug 2017", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seton Hall University (South Orange, NJ) in Jun 2014", "Interview Descriptions": "everything is good and there are  there round for the interviewing, first you need to get a apply from the university website and then you will get cal  for the second or further interview. if they like you you will have a final interview with professor.", "Interview Questions": "tell me about yourself?"}, {"date": "16 May 2014", "title": "Student Worker Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seton Hall University", "Interview Descriptions": "in person interview was very informational and easy going. I really enjoyed the entire process. I had a great conversation about what I wanted out of the position and what they were looking for in a Student worker.", "Interview Questions": "No unexpected questions were asked. Overall process was simple and easy. "}, {"date": "7 Feb 2014", "title": "Mentor Freshman Studies Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seton Hall University", "Interview Descriptions": "I applied through the online process then received an email invite to an interview. There were two rounds of interviews, first round was with 5-6 current mentors plus the Dean of the department. I was invited to the last round which was teaching a class as I would teach it normally. Then more questions from the mentors", "Interview Questions": "In what magazine would you like to be featured and why"}, {"date": "7 Dec 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seton Hall University (South Orange, NJ) in Jan 2014", "Interview Descriptions": "It is a simple process. Once you submit your information online, you need to wait for your to-be supervisor to answer you back. If you just be yourself, and use common sense, you should get the job. You also need good grades.", "Interview Questions": "N/A"}, {"date": "4 Apr 2014", "title": "Student Technology Assistant (STA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Seton Hall University (South Orange, NJ) in Aug 2011", "Interview Descriptions": "Interview at Seton Hall University", "Interview Questions": "Computer related questions"}, {"date": "27 Jan 2015", "title": "Director of Career Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seton Hall University (Newark, NJ) in May 2011", "Interview Descriptions": "Applied to and met with a search committee of administrators and faculty. They asked me a couple of generic questions about my background, then asked me if I had any questions. I asked one and had a few more prepared but one man abruptly thanked me for coming and stood up, as did the other members of the search committee. I got the sense that they were just going through the motions, and already had a candidate in mind for the position, so I exited the room.", "Interview Questions": "What is your current salary?"}, {"date": "3 Oct 2015", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Seton Hall University (South Orange, NJ) in May 2011", "Interview Descriptions": "There was one interview meeting with a manager in a very casual non stressful setting. Downside was that I had to follow up on my application without hearing back for a couple weeks to make sure they received it so that I did not miss out on an opportunity", "Interview Questions": "Tell me about a challenging experience"}], [{"date": "27 May 2010", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Seton Hall University (South Orange, NJ) in May 2008", "Interview Descriptions": "After application on the employee website, you will receive an email for an interview within a one week to two weeks period. The interview is one on one and usually conducted by a Grad assistant. Interview questions consist of your ability to handle different situations and availability, which is usually the deciding factor.", "Interview Questions": "What days/hrs are you available to work?"}]]