[[{"date": "18 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "I had a phone interview with a recruiter, then a scheduled Teams meeting with the unit manager, but the recruiter never sent the unit manager the invitation so it had to be rescheduled. Then for the rescheduled Teams Meeting, the unit manager was late because they had to deal with a situation in the unit, so it ended up being a phone interview with the unit manager.", "Interview Questions": "How do you deal with a difficult family member?"}, {"date": "6 Feb 2023", "title": "Ultrasound Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "Very well put together. They are very accommodating and flexible for anyone's schedule. Contacting them was pretty easy and responses were made in a timely manner. I would definitely recommend applying here for your specialized medical interest career.", "Interview Questions": "What would make you the best selection for the position with Einstein?"}, {"date": "24 Jan 2023", "title": "Residency Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Dec 2022", "Interview Descriptions": "Very easy. Virtual interview Great information. Manager was personable Program director was very nice. Hyrbrid schedule. Huge team to help with onboarding and orientation. Room for professional growth and training", "Interview Questions": "Give a time when you missed a deadline."}, {"date": "10 Jul 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Albert Einstein Healthcare Network in Apr 2022", "Interview Descriptions": "Applied online, Received an email maybe 1 1/2 months later, Had an interview a few days after that, received a call back in about 3 days, Sent for my references and started onboarding the next week.", "Interview Questions": "Name a time you had a conflict and how did you handle it ?"}, {"date": "13 Mar 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "Took a long time to get through the process even though I had been a previous employee. It took almost three months to go through the process and I was only hired on as pre diem", "Interview Questions": "Most of the information that had on file but I needed to rehash everything from start to finish"}, {"date": "22 Dec 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "Was fast and easy. I heard from them after 2 weeks only\r\nThe process was very flexible.the HR team were very helpful when I called and ask for questions .it was online because of the COVID.the manager was so nice and easy.it was short not a long interview", "Interview Questions": "About my previous experience .how your day at the floor look like at your previous job at the hospital"}, {"date": "8 Oct 2021", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA)", "Interview Descriptions": "Very odd interview. After every question  I was asked if I thought I was a good fit and what I thought so far. Interviewer's tone was condescending. Ultimately, I decided not to move forward.", "Interview Questions": "The role will require lots of writing and fundraising for prevention initiatives.  How does that make you feel?"}, {"date": "5 May 2021", "title": "Interpreter/Translator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "Met with the director of interpreting services. Very straight forward interview and was semi-informal. Questions were not to difficult and they wanted to see if it would be a good fit for both parties.", "Interview Questions": "How long do you see yourself in the role?"}, {"date": "11 Mar 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "It was like a typical interview. They asked you the usual questions. Just be prepared and be positive, and don't show that you're nervous. Do your best and smile. blah blah blah blah blah", "Interview Questions": "Why do you want to work for us? "}, {"date": "28 Mar 2021", "title": "ICU Trauma RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Mar 2021", "Interview Descriptions": "I filled out a application  a week ago and received call from HR . The representative from HR asks you a few questions to see if you would be a great fit then they scheduled you for an interview with a Unit manger. HR then sends you a  zoom  link via email .", "Interview Questions": "What mistake have you make working as a Nurse?"}], [{"date": "7 Jan 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "Manager was super nice as well as well as the  recruiter. The interview went smoothly but I feel like they wanted more experienced nurses. The pandemic definitely took its toll on new nurses trying to get a position at a hospital setting.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "4 Mar 2021", "title": "Human Resource Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jan 2021", "Interview Descriptions": "- Applied on January 4th\r\n- Phone screen on January 26th\r\n- Hiring manager interview on January 28th\r\n- Round 2 of interviews on February 4th; two separate interviews, one with 2 HR specialists, one with a current HR assistant\r\n- Reference check requested on February 24th\r\n- Verbal offer on February 26th\r\n\r\nOverall, it was a long process with radio silence after the second round of interviews, but the interviewers did inform me that the process does take weeks. Interviewers mainly asked questions related to your resume and a couple of behavioral questions that you should expect.", "Interview Questions": "Why do you want to work at Einstein?"}, {"date": "5 Feb 2021", "title": "Registered Nurse-PCU Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Albert Einstein Healthcare Network (Phila, PA) in Jan 2021", "Interview Descriptions": "HR contacted me via email to set an appointment for a phone call. When HR called, she quickly went through the position description. I asked if she could repeat the description about the floor being a temporary covid-19 floor. She then asked “why” and proceeded to tell\r\nme to apply for a different position. Any step down unit will all have covid patients. Then she told me to have a nice day and hung up. I was baffled because I only asked to have her repeat the description..", "Interview Questions": "Did not get to interview. Just talked to HR "}, {"date": "15 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network in Jan 2021", "Interview Descriptions": "The first interview was a phone interview. Very pleasant HR representative and called on time. Asked appropriate leading questions and gave enough time to answer. Very knowledgeable in answering questions and engaging with responses.", "Interview Questions": "How would your previous coworkers describe you?"}, {"date": "2 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "First interview with the recruiter who called me and then a facetime interview with the nurse manager. Both were on time and nice to talk to. It took a little while to hear back but for the most part it was a very responsive process.", "Interview Questions": "Tell me about a time when you had to work as a team?"}, {"date": "28 Aug 2020", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jul 2020", "Interview Descriptions": "apply \nRecruiter call (pre interview)\nRecruiter  set up interview with  Corporal, lieutenant, sergeant.\nIf like by the  Elite, offer letter will be sent with in 3-4 Days.\nThen you must pass drug, Criminal back check as well as about 3 child background checks and screening.\nOnce those are done you will be given a start date.", "Interview Questions": "what make you think you are a good team player\n\nNames some faults that you have doing your experience \n\nName a time when you went above and beyond your job."}, {"date": "6 May 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "Nurse manager and clinical nurse manager asked several questions about how I would deal with patients in certain situations. They also asked about my goals as a nurse for the future.", "Interview Questions": "Describe a time there was an issue with a patient and how did you deal with it"}, {"date": "28 May 2021", "title": "Former Interviewee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jan 2020", "Interview Descriptions": "Redundant but friendly. You will be contacted by the \"middle man\" to schedule the interview from the department. But don't plan on hearing back from them unless you got the job.", "Interview Questions": "Different scenarios that might occur "}, {"date": "22 Sept 2020", "title": "Health Unit Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Sept 2019", "Interview Descriptions": "phone call with a recruiter, then an interview with nurse manager. the recruiter interview is longer and tougher than the nurse manager interview. Big on experience and customer service. after you interview with the nurse manager, you will not hear from company for a while.", "Interview Questions": "how did you keep customers happy in your customer service job?"}, {"date": "14 Jul 2019", "title": "Inpatient Coder Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Albert Einstein Healthcare Network (New York, NY)", "Interview Descriptions": "This process was extremely long and drawn out (in my case, it was nearly 3 months). After a phone screen and in-person interview, I waited 2 months before hearing anything. When I finally received a phone call from HR, I was told the position I applied for had been reworked to a new position and I would need to come in again and do another in-person interview for THIS position. \n\nThe interview went well and I was called 2 days later and told they wanted to move forward with the hiring process. Then I was told about their ridiculous reference check, which is an online survey that they expected \"at least 3\" of my former managers to complete. I was expected to call and email my former managers and ask them to take this survey. The last job I held had a strict no-references policy (they use an automated system for potential employers to call). I had no idea what the email addresses or phone numbers were for my other two former managers, one of which I had not spoken to in 15 years, and I knew she no longer even worked at that hospital anymore. Since I was not able to get 3 managers to complete the survey, HR told me the hiring process had to stop there and I lost the position over this reason, AFTER 3 interviews and waiting almost 3 months. What a complete waste of my time and energy.", "Interview Questions": "Questions about my coding experience , typical things."}], [{"date": "23 May 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Apr 2019", "Interview Descriptions": "Applied - March 2019\r\nContacted via email for phone interview with HR rep. - April 2019 (exactly a month after applying)\r\nInterview with manager - A week after phone interview\r\nHR sent SkillSurvey (references link) - April 25th (all references completed April 26th)\r\nJob Offer- First week of May\r\nPhysical/Drug Test/ RN Pre-hire (Pharmacology) Exam - Third week of May\r\n\r\nI did have to contact the HR rep. and manager multiple times to follow -up on position/application before getting the job offer.", "Interview Questions": "Tell me about your previous job experience."}, {"date": "29 Mar 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "It was proffessional, quick and easy.  My interviewer was not intimidating and made the interview very casual.   The interviewer had a lot of good information about the job.", "Interview Questions": "Why do you want to be a nurse"}, {"date": "5 Feb 2019", "title": "Training Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA)", "Interview Descriptions": "I was called back promptly for a phone interview and then asked to come to Philadelphia (I didn't live in the area) for an in-person interview that week. I was called back immediately for a second (and final) interview, which I had to travel to Philadelphia for. In the first interview I was told they wanted to make a decision in the next two weeks. In the second interview, I was told they would call me back by the end of the week with a decision. The (internal) recruiter did not follow up as promised. After repeated follow ups on my part, I finally heard back from them only to be told they didn't have an update because they were still interviewing candidates. I never heard back from them since then.", "Interview Questions": "Name a time the learners showed disinterest in what I was teaching. "}, {"date": "11 Feb 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Albert Einstein Healthcare Network (Elkins Park, PA) in Jan 2019", "Interview Descriptions": "long process.\r\nApplied: Nov 2018\r\n•\tEmail/phone interview with HR early January- said she wasn’t sure how soon they would be bringing people in for interviews\r\n•\tCall 2 weeks later to schedule interview\r\n•\tInterview one week later \r\n•\tOffer 2 weeks later\r\n•\tMet with Clinical Manager and Team Leads (5 interviews +observation on various units)\r\n•\t2 hour break to get lunch and travel between locations\r\nasked a lot of clinical questions", "Interview Questions": "•\tTell me a time when you feel like your treatment made a difference"}, {"date": "28 Nov 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (East Norriton, PA)", "Interview Descriptions": "I received a phone call from a recruiter after applying for the position online. Afterwards, I was scheduled for a face to face interview and met with two different managers.  They are discriminatory towards applicants of color at Einstein Medical Center Montgomery.  The manager barely asked me any questions during the interview.", "Interview Questions": "Tell me about yourself? "}, {"date": "18 Jan 2019", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Albert Einstein Healthcare Network (Phila, PA) in Sept 2018", "Interview Descriptions": "Got a call and they did a phone screen,  Then I was asked to  come in for an in person interview at their facility. I was kept waiting 10 minutes pass my appointment time. I was interviewed in a very small office by 3 people from HR. I was there for an entire hour in the interview.", "Interview Questions": "Asked me to tell them about my previous experience."}, {"date": "23 May 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jan 2018", "Interview Descriptions": "Easy interview. Very friendly staff. Beautiful place to work. Tour of unit and they really make you feel at home before you start working there. Very open discussion and more like a friendly conversation to get to know each other and the job.", "Interview Questions": "What are your strengths? "}, {"date": "16 Mar 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jan 2018", "Interview Descriptions": "Long and drawn out.  I interviewed with the day shift manager though I was interviewing for a night shift position. It felt like she was uninterested our interview as she kept excusing herself. I didn't hear anything after a while and then I received a call from the nurse recruiter to check references and they would follow up with me, but I never heard anything after that.", "Interview Questions": "What would your clinical instructors say about you?\r\nWhat was your GPA in nursing school?"}, {"date": "29 Apr 2021", "title": "Sr Technical Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network in Aug 2017", "Interview Descriptions": "interview with the team manager who I had worked with many years ago so it was really not a true technical interview more of a chat about what I had been doing", "Interview Questions": "wanted to know how much interface experience i had"}, {"date": "15 Jul 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (King of Prussia, PA)", "Interview Descriptions": "Phone interview first, then interview with manager.  Walk through of the potential work space.  I followed  up with phone calls to Human Resources then the  Position was offered to me.", "Interview Questions": "Why I would be a good candidate for the position."}], [{"date": "28 Jul 2017", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in May 2017", "Interview Descriptions": "Great process. The supervisory asked relevant questions and wanted good feedback as well. Notes were taken throughout the process and she did follow up with me. I would definitely recommend  this employer to anyone looking for employment. . They do care about their employees", "Interview Questions": "Explain a time you were in an ethically challenged situation "}, {"date": "13 Apr 2017", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Mar 2017", "Interview Descriptions": "I applied online and it took about 2 weeks to get a phone call back. I spoke with the recruiter on the phone, then set up an in person interview a few days later. I was interview by three nurse managers (not hiring managers or anyone that worked in HR), which I liked because it shows that the company cares about the opinions of their current employees. About a week went by before I contacted the recruiter, who told me they will have a decision in a few days.", "Interview Questions": "Tell me about your previous experience. "}, {"date": "29 Oct 2016", "title": "Follow Up Accounts Receivable Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Oct 2016", "Interview Descriptions": "Phone Interview with Recruiter lasted maybe 10 minutes total. She was very nice and informative. She wasted no time with small talk, but was eager to get right to the interview process.", "Interview Questions": "What is your highest level of education?\r\nWhat is you view on open door policies?\r\nWhat is you pet peeve?\r\nWhat are your strengths?\r\nwhy do you want to work here?"}, {"date": "23 Aug 2016", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Phila, PA)", "Interview Descriptions": "Initial phone screen by recruiter. This was followed by a phone and in-person interview with hiring team. It was a very long in-person interview over 3 hours. Hiring process was straight forward.", "Interview Questions": "Where do you see yourself in 5 years? \r\nTell me about your work experience."}, {"date": "2 Aug 2016", "title": "Speech Pathologist, PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "Panel phone interview (2 of their therapists and the DOR), general clinical questions, no personal questions. \r\n\r\nSecond interview in person, very similar to the phone interview. All clinical  no personal questions.", "Interview Questions": "Experience dealing with physicians"}, {"date": "5 Aug 2016", "title": "Follow Up Representative (Patient Accounting) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Aug 2016", "Interview Descriptions": "I had a interview scheduled for 9am, showed up at 8am. I was kind of lost entering the building a nice lady brought me to the hiring supervisor office. She was very nice and pleasant. Apologized for being early she told me no worries they were ready to interview. She called the second supervisor in the office, we shook hands and begin the process. All in all we started at 8:11am & i walked out the office around 9:15am", "Interview Questions": "Tell me about yourself"}, {"date": "28 Dec 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Albert Einstein Healthcare Network (Norristown, PA) in Jul 2016", "Interview Descriptions": "the management met me in a conference room and talked about my past work experience as well as my goals for future.  Since i was only applying part time they were asking my goals for staying with the company", "Interview Questions": "what is your best asset"}, {"date": "6 Feb 2018", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jun 2016", "Interview Descriptions": "Easy interview process. Provide references and then face to face with manager. Pleasant experience overall. Did not wait long for response from human resources. Had to provide over 5 references.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "1 Dec 2016", "title": "Desktop Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jun 2016", "Interview Descriptions": "Quick 10 min interview. There were two people that came and interviewed me. It was a really short process since this was for an intern position at the hospital. You come into the lobby and they will bring you to the back where you will be interviewed. Everything was really casual.", "Interview Questions": "Why do you want to work here?"}, {"date": "2 Dec 2017", "title": "Asset Protection Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Albert Einstein Healthcare Network (Phila, PA) in May 2016", "Interview Descriptions": "The interview process was great. It is a panel interview. They wall aske you your background and experience with secuity. Asked you different question to see if you can answer them.", "Interview Questions": "Do you have Security experience."}], [{"date": "21 Apr 2016", "title": "Medical Assistant Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Albert Einstein Healthcare Network (Norristown, PA) in Apr 2016", "Interview Descriptions": "I applied online.  I had a phone interview the day I applied which was the day the job was posted.  I had an in-person interview the next week.  The Regional Practice Manager was very pleasant and optimistic about the new position for the system.  I didn't get an offer that day, but you hardly ever get an offer after your first one on one.  It's only been a day since my interview, my fingers are crossed.", "Interview Questions": "Tell me about a time while working with an individual that you noticed they didn't follow a policy or procedure correctly and what did you do?"}, {"date": "25 Mar 2016", "title": "Implementation Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA)", "Interview Descriptions": "A whole day of interviews with all the people on the project.  They had the entire day planned for me and I met with a variety of people on the project.  Each person was allowed to ask their own questions.  The problem was that most of the people asked the same questions.  I ended up repeating myself through most of the day.", "Interview Questions": "All the questions were the same for each interview"}, {"date": "2 Mar 2016", "title": "Clinical Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Albert Einstein Healthcare Network (East Norriton, PA) in Feb 2016", "Interview Descriptions": "Two interviews thus far, the first with the director who was very pleasant and very passionate about education- it made me enthusiastic about the position!  The second interview was with the educational team who all have something to bring to the table in collaboration and planning the education of the nursing staff.  \r\nI was immediately called several hours after the second interview with a request for references, which I take as a good sign?  we shall see!", "Interview Questions": "What is your teaching philosophy?"}, {"date": "2 Feb 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Albert Einstein Healthcare Network (Norristown, PA) in Jan 2016", "Interview Descriptions": "Got a phone interview by HR and then scheduled an in person interview with a nurse manager. After that, I was contacted to submit a list of references to check. The process was pretty quick and the whole interview lasted a little over thirty minutes. The overall experience was pleasant, however if you do not get the job they will not follow up with you.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "20 Mar 2017", "title": "Desktop Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Albert Einstein Healthcare Network in Dec 2015", "Interview Descriptions": "It was a phone screen interview of 15 min and then face to face interview with the leads. Standard hr interview questions and then they talked about the job and the team . It took 3 days after the interview.", "Interview Questions": "Windows 7 questions"}, {"date": "21 Jan 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Sept 2015", "Interview Descriptions": "Good interview with HR staff.HR Staff had giving me an overview of the Healthcare Network goals where for patients and employees.  Also encouraged me to set up profile and apply for job an on website. Believed with my experience, I would be a great candidate.  Great enterview with office management what the practice required from you and ask if there were any questions I have. Training support staff is outstanding.", "Interview Questions": "What type of person am I. When working with Public."}, {"date": "7 Dec 2015", "title": "Director of Student Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Sept 2015", "Interview Descriptions": "My initial conversation with the recruiter was a pleasant experience. She was very responsive, polite and informative. The process however after speaking with the recruiter became very unorganized and less than professional. There was a clear disconnect between the hiring department and HR. I was not sure who the decision maker was even though it was clear who was supposed to be the head of the department. It seemed as if they were too distracted with other concerns rather than fairly and diligently evaluating my experience and qualifications. I felt as if I was only part of the candidate pool because of a necessary standard and I do not feel as if I was taken seriously. It seemed as if they had a favorite or candidate already selected and they did not do a good job being discreet about it. When I arrived for my final interview only 2 out of the 6 people scheduled to meet with me showed up and was asked to meet with someone else who was not originally scheduled to meet with me as part of an obvious stall tactic while they tried to give the rest of the people time to arrive who never did. It also seemed very clear that the expectations of the role had not been explained to all stakeholders and it caused for a very awkward interview. I did not receive specific feedback after being told I was not selected. The best part about this experience was that I was able to see early on that this department within this company was dysfunctional and consistently overwhelmed and understaffed which makes me ok with not being offered the position.", "Interview Questions": "What is my Leadership style?"}, {"date": "17 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Norristown, PA) in Aug 2015", "Interview Descriptions": "first a telephone interview with a nurse recruiter, asking simple questions about my experience. Then an in person with the unit manager followed by a tour of the unit(s). pretty standard interview process", "Interview Questions": "where did i see myself in 5 years"}, {"date": "15 Aug 2015", "title": "Health Unit Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jul 2015", "Interview Descriptions": "Applied online. Within two weeks, had a phone interview with recruiter and in person interview. They were very nice! It does take a lot of time to reach them..if you didn't get a call back for a position, by that time you'll know they didn't go with you.", "Interview Questions": "Typical interview questions."}, {"date": "6 Jan 2016", "title": "IS Desktop Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Mar 2015", "Interview Descriptions": "You can easily obtain an internship at Einstein. Even if you have minimal experience in IT. They hire people without degrees as well. The interview process was pretty basic and asked VERY BASIC IT related questions. It started with a call from the recruiter, which then in turn set up the initial meeting. The interview was with the manager and two leads at the same time. Within 3 days I received a call saying I was offered the job.", "Interview Questions": "What are your strengths"}], [{"date": "6 Jul 2015", "title": "Staff RN NICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Albert Einstein Healthcare Network (Norristown, PA) in Feb 2015", "Interview Descriptions": "Screening phone interview with situational questioning. Once through that process went onto the one on one interview. More conversational interview. The one on one was also information, getting to know one another, discussing our backgrounds and also getting to know to know the fit with the rest of the staff.", "Interview Questions": "How I would resolve a conflict between staff members"}, {"date": "21 Sept 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Albert Einstein Healthcare Network (Phila, PA) in Nov 2014", "Interview Descriptions": "I applied online and it took a few weeks for someone to get back to me for a quick phone interview. Afterwards, we set up a date for an in-person interview at the main Philadelphia campus and had an interview with the HR manager and pharmacy staff. It was a pleasant experience and I was not too stressed.", "Interview Questions": "Why did you choose to apply at Einstein?"}, {"date": "12 Sept 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Albert Einstein Healthcare Network", "Interview Descriptions": "initia linterview was over the phone with human resources personnel ,then a ninterview was set up with the nurse manager,the nurse manager asked questions about my experience and education,reviewed my resume ,explained the qualifications andrequirements for theposition", "Interview Questions": "was asked a question about  a possible difficult situation arising with a patient sfamily regarding refusal to leave during visiting hours"}, {"date": "25 Apr 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Apr 2014", "Interview Descriptions": "Laid back and non intense.  The nurse managers were very friendly and walked me around the unit after the interview.  I felt at ease and the interview was very conversational in style.", "Interview Questions": "How do I practice, what are my biggest strengths, how do I handle difficult patients."}, {"date": "13 Nov 2015", "title": "Clinical Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Mar 2014", "Interview Descriptions": "Screening interview with recruiter asked basic questions regarding background. Phone interview a week later with Director of department.  A week after that in person interview with Director, included a tour of department and some introductions to future co-workers. After a few weeks of emailing with the Director an offer was made.", "Interview Questions": "What makes you the best candidate for this position? Why do you want to work for Einstein?"}, {"date": "22 Jun 2014", "title": "Deskto Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Oct 2013", "Interview Descriptions": "I received a call after filling out the application. I told them about my current situation and how I'd be willing to work there and why. Days went by and I interviewed with the at the time Desktop Lead. He asked me did I have a car and about my IT background. I told him I didn't have much background besides what I did at home for family and friends. He said that was okay and he asked me a series of rather easy questions and I answered. We then talked about the company and what to do to stay afloat. I left and then they called me back a few days later and I accepted the offer. Then a few days after that I went to the orientation", "Interview Questions": "Did I have a car?\r\nAre you here for the experience or to actually get a job?"}, {"date": "28 Feb 2014", "title": "Desktop Services Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Albert Einstein Healthcare Network (Phila, PA) in Sept 2013", "Interview Descriptions": "I got a call from the hiring person, a few days later I came in for an interview. It was very straightforward with what was expected of me and my job description, and length of the project.", "Interview Questions": "None that I can remember"}, {"date": "17 Oct 2013", "title": "Training Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jun 2013", "Interview Descriptions": "Phone screening.\r\nFirst interview with director, manager and potential team member.\r\nSecond teaching interview. Requirements 30-60 min. soft skill presentation.", "Interview Questions": "How would you work with someone that you found difficult to work with, someone who wasn't a team player?"}, {"date": "30 Apr 2016", "title": "Telemetry Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Albert Einstein Healthcare Network (East Norriton, PA) in Apr 2013", "Interview Descriptions": "I met the unit manager, educator and floor supervisor, I was shown the tele floor and given a basic tour of the unit then given EKG Rhythm test. It seems newer employees, have failed this test and been given the chance to retake it multiple times and have still been offered a position.", "Interview Questions": "Standard questions."}, {"date": "17 May 2013", "title": "Network Emergency Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Oct 2012", "Interview Descriptions": "Called by HR person asking questions about background. Be ready to give salary requirements. Process was pretty fast. Met 1 to 1 with hiring manager. Process was fairly easy. Hiring manager asked about background and what I could do to make program better.", "Interview Questions": "No difficult questions. "}], [{"date": "10 Jul 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Albert Einstein Healthcare Network (East Norriton, PA) in Aug 2012", "Interview Descriptions": "with manager and educator.....they looked through my resume...asked me why I liked the ED and showed me around the ed to meet other people.  Some people had to go to a panel of staff nurses who asks questions of them...", "Interview Questions": "What do you like about nursing?"}, {"date": "26 Sept 2012", "title": "Compensation Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Aug 2012", "Interview Descriptions": "Initial contact through LinkedIn, phone screen by recruiter went well & led to first face to face interview. Scheduled as a mix of 1:1 and 2:1/panel interviews - planned for 1 hour but interviewers were done with questions at 30 minutes. Format was direct question/answer - not much dialogue. Did have opportunity to ask questions, did not feel like my questions were being answered.  Between interviews I was given a basic excel test (online). Follow up interviews were expected with additional members of the team.", "Interview Questions": "Tell us what a day in life looks like for your most recent role."}, {"date": "20 Nov 2012", "title": "Help Desk/Hybrid Support Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jul 2012", "Interview Descriptions": "Call from recruiter--he was practically begging me to come work for $10/hr.\r\nInterview with Manager--She was nice and very focused.\r\nCall from Recruiter to tell me I got the job.\r\nOrientation\r\nThe whole process took about 3-4 weeks.", "Interview Questions": "Will you be able to travel to Montgomery?"}, {"date": "28 Aug 2012", "title": "Ophthalmic Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Nov 2011", "Interview Descriptions": "First communication was through email, then telephone. After two weeks of communication the in-person interview was scheduled. Two weeks after the interview I heard a decision", "Interview Questions": "I don't remember the specific interview questions although there were some technical questions and personality questions. "}, {"date": "7 Feb 2014", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Feb 2011", "Interview Descriptions": "Will be contacted by HR, be on time, there will be a math calculation test.", "Interview Questions": "What is your weakness?"}, {"date": "8 Feb 2011", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Albert Einstein Healthcare Network (Elkins Park, PA) in Jan 2011", "Interview Descriptions": "Initial communication began via email. There was a phone interview that lasted 30 minutes. Then there was an in-person interview to meet all of the staff members of the lab. It was a laid back and friendly environment. Everyone seemed happy to work there and happy to be participating in their research", "Interview Questions": "Can you explain what your previous employer meant by saying you respond well to extensive criticism."}, {"date": "15 Jun 2015", "title": "Pbt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jan 2011", "Interview Descriptions": "Several manager meet with you it was informal remain professional and make sure you understand the job description. Remain positive and be able to complete competency. It may take a while for them to issue an offer remain patient but be smart and continue your job search while waiting.", "Interview Questions": "What is your greatest weakness"}, {"date": "12 Apr 2011", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jan 2010", "Interview Descriptions": "I had two seperate interviews for about a half hour each. They were easy interviews asking a little about yourself. They mostly talked about the job and what they like about the company and how they got into this kind of business. It was not a very formal interview. In a back little old meeting room. They hired me on the spot.", "Interview Questions": "Tell me about yourself."}, {"date": "21 May 2009", "title": "Registered Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Albert Einstein Healthcare Network (Philadelphia, PA) in Jul 2008", "Interview Descriptions": "Very brief process. Consisted of a phone interview then an interview with the department manager. The work environment is intense, the people are very pleasant however it is extremely hard work with added responsibilities due to the economic crisis.", "Interview Questions": "Why did you leave your last employer?"}]]