[[{"date": "13 Jun 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at ICL (New York, NY)", "Interview Descriptions": "This was for a position that my school identified as a internship placement for the academic-year. After they identified the placement I had one interview with the program director who would also be my supervisor.", "Interview Questions": "How do your experiences relate to this internship opportunity?"}, {"date": "14 Jan 2023", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ICL", "Interview Descriptions": "It was smooth and the staff were friendly. The Hub is very nice and well run. Everyone was professional. Most important the supervisor seems well adjusted and not too tightly wound or anxious.", "Interview Questions": "Why should we hire you?"}, {"date": "5 Oct 2022", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at ICL (New York, NY) in Feb 2022", "Interview Descriptions": "It’s a background check, and you need to take a shot at a doctor. There is a lot of paperwork but the actual interview is pretty easy. You have to be available and show empathy.", "Interview Questions": "I really just had a conversation"}, {"date": "8 Feb 2021", "title": "Temporary Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ICL in Dec 2020", "Interview Descriptions": "I applied online through LinkedIn. The position was advertised as a 6 month temp admin assistant role for COVID community support of some kind. And that's about all the interviewer knew about the position as well. When I asked what would be involved on a day-to-day basis, he couldn't answer that.\r\n\r\nThe interviewer was late, didn't know anything about the position, didn't care about what was on my CV (or ask me anything about it), asked me why on Earth would I want this job (in those words), outright said the pay was terrible... Weirdest interview experience I have ever had. I felt like I was actively talked out of wanting that role.\r\n\r\nI have not been contacted about the position since (it's been over a month). I've just assumed that I didn't get it.", "Interview Questions": "Tell me about yourself.\r\n\r\nWhy on Earth would you want this job?"}, {"date": "3 Sept 2020", "title": "Peer Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ICL (New York, NY) in May 2020", "Interview Descriptions": "The interview process was completely over the internet via Zoom.  There was an initial interview with the Director of the program followed by an interview with the supervisor of the organization.  Overall, the interview was comfortable, professional, and detailed.", "Interview Questions": "Some of the interview questions were, one why did I choose this company?  If hired as a peer specialist, how can contribute to the rest of the team?  Do I feel comfortable working with the population or clientele in the agency?"}, {"date": "3 Jul 2019", "title": "Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ICL (Brooklyn, NY) in Jul 2019", "Interview Descriptions": "Came in, waited about 5 mins, than was interviewed for about 3 mins. I was told there were no more daytime positions even though that was the position I applied for and currently waiting to hear back due to them currently still doing interviews.", "Interview Questions": "Tell me about yourself"}, {"date": "22 Feb 2018", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ICL (New York, NY)", "Interview Descriptions": "This organization doesn't contact you if you're unsuccessful.\r\n I attended 2 interviews. One at their head office in lower Manhattan and the other w/two workers at a project in Brooklyn. \r\nVery unprofessional and rude not informing an appilcant that they were unsuccessful, especially after taking the time and expense of attending 2 interviews. No reply to my email either.\r\nAfter reading the awful reviews, I'm very glad I wasn't successful.", "Interview Questions": "Tell me about your experience. \r\nWhy do you want to work for us?"}, {"date": "18 Oct 2017", "title": "Senior Level Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ICL", "Interview Descriptions": "After application and initial phone interview I was invited for an in person with executive and director.  The meeting went well and I was asked to share strategy, approach and concepts related to the position.  I followed up after two weeks and nothing .. and again after another week.. nothing.  No acknowledgement or rejection.  Nothing.  Incredibly disappointed at how unprofessional this was.", "Interview Questions": "Provide ideas on how I would approach the position and strategy on execution to achieve goals."}, {"date": "16 Nov 2017", "title": "Housekeeping Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at ICL (Brooklyn, NY) in Apr 2017", "Interview Descriptions": "waited to speak to a panel of ppl. one in particular looked ghetto with her red and black crazy looking weave but sweet the others looked like they all had bad attitudes. I felt like running away. But the one with the red hair was more welcoming so i stayed.", "Interview Questions": "how long have i been doing house keeping"}, {"date": "9 Aug 2019", "title": "Case Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ICL (New York, NY) in Aug 2016", "Interview Descriptions": "met one on one face to face with hiring manager after being screened on phone.  Interviewer was professional and coutreous and timely.  They also had me meet with other team members.", "Interview Questions": "Tell me what trauma informed care means to you"}], [{"date": "9 Aug 2016", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ICL (Brooklyn, NY) in Jul 2016", "Interview Descriptions": "Applied online the online application process as a bit long but it has to be complete in order to be considered for interview.  I received a phone call a week after applying  about the position and the salary   I  had the  interview two weeks  after applying online.", "Interview Questions": "basics question about past work experience.  a lot of Q and A about what you have done that would make you the best person for the job."}, {"date": "19 May 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ICL (Brooklyn, NY) in May 2016", "Interview Descriptions": "the interview process was group panel almost or should i say 2 prospect employees and one staff member.thorough with explaining what is expected as well as duties to be carried out.", "Interview Questions": "basic questioning of ones background and abilities you bring to the table.cause and effect reaction to client activity and arising situations."}, {"date": "24 Nov 2015", "title": "Unit Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ICL in Jul 2015", "Interview Descriptions": "Interview process was direct due to high need for employees. Job description was direct and similar to duties performed in work environment. Everything was as advertised in the process, felt comfortable and welcoming.", "Interview Questions": "Do you see yourself committing to working here for more than 6 months?"}, {"date": "5 Mar 2016", "title": "Skillbuilder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ICL (Brooklyn, NY) in May 2015", "Interview Descriptions": "I interviewed with the director. I also met with the hiring manager. They were both very friendly, which made the interviewing process very smooth. They smiled throughout the entire interview. I also had a chance to meet some of the staff I would be working alongside. Everyone greeted me in a respectful and inviting manner.The interview was a breeze and very pleasant. I didn't feel nervous at all because everyone was so friendly.", "Interview Questions": "Do I have experience working with the ID/DD population?"}, {"date": "22 Jan 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ICL", "Interview Descriptions": "When I first heard about this job, I was ecstatic and applied immediately. The hiring process was very tedious and long. They did not only a 10 years background check, but also checked to make sure all information that was presented was true and accurate. The questions were precise and to the point.", "Interview Questions": "The most difficult question was: What was my 5-10 years plan. That question was not expected one bit."}, {"date": "7 Feb 2017", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at ICL in Sept 2014", "Interview Descriptions": "laid back, non intense. They were very considerate in regards to traveling to interview location, and if I had any problems working in an industry where there may be a level of disrespect towards you, and possibly contemptuous behavior.", "Interview Questions": "about my prior experience"}, {"date": "9 Aug 2016", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at ICL (Brooklyn, NY) in Jul 2014", "Interview Descriptions": "Easy, straight to the point. Basic knowledge needed about social services and how to cope with stress and the fast paced environment of a pros program. I met with the director and assistant director both nice individuals- very welcomming environment. It didnt feel like an interview it felt like a conversation between colleagues. I was at ease and relaxed. Would definitely recommend to a friend", "Interview Questions": "How do I handle stress"}, {"date": "2 Apr 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ICL (New York, NY) in Nov 2013", "Interview Descriptions": "What should take a two week process is dragged out over two and half months. I was asked for my HS diploma by the HR Dept even though I clearly went to college after graduation. The red tape and amount of paper work is incredibly long and should be done online to save time and staffing. It was my worse experience being recruited and hired into ICL. I hear they are working to improve the process", "Interview Questions": "Tell me about your last job?"}, {"date": "28 Oct 2013", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at ICL (Brooklyn, NY)", "Interview Descriptions": "Got referred to them by a friend who worked there... they were DESPERATE for a social worker (because of the dangerous area the agency was located in and high turnover rate from the dangers of the \"hood\" and the clients they service\"   Went in for interview and the Director decided not to go to work that day... so I interviewed with two other management people.   They apparently liked me, so I had to go in for a second interview with the Director the following week.   She hired me on the spot.", "Interview Questions": "What's wrong with you?  (I think they asked it in a better way, like what are you not good at or would like to learn to be better at)"}, {"date": "2 Mar 2016", "title": "QA/I Billing and Internal Controls Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ICL (New York, NY) in Sept 2013", "Interview Descriptions": "I was already working for ICL at the time.  I applied as an internal applicant.\r\nI was interviewed by my immediate supervisor, an executive officer, and my future colleagues.  The process wasn't stressful, and everyone was very pleasant. I first met with two managers who asked me questions related to my skills and professional abilities.  Then, I met with my future co-workers, where they sort of assessed if I would be a good match for their team.  After it was determined that I would be a good fit for the department I met with the CCO a week after my first interview.  Shortly after that second meeting I was called back into the manager's office and offered the position.", "Interview Questions": "Do you have experience auditing?"}], [{"date": "28 May 2013", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ICL", "Interview Descriptions": "The review proccess was seemless and rather easy. Met with a junior office recruiter who was very nice", "Interview Questions": "none"}, {"date": "7 Jul 2014", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at ICL (New York, NY) in Jun 2012", "Interview Descriptions": "Only 1 round interview, call you back after careful selection for a second round, which would most likely lead to an immediate hire.  Very lenient working staff that are open to assist you even without any particular capability or skill at the moment.", "Interview Questions": "What are three words that personifies yourself as the best candidate for this position? Why?"}]]