[[{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Beware of the shiny exterior", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "11 May 2023", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "A strong sense of mission.", "cons": "While generally the organization has a very strong sense of mission of helping people, internally it can be quite the opposite. Externally, the impression is \"oh we're all so happy, everything is great.\" Unfortunately it's not. A good number of very good and highly skilled employees have left, mostly due to very poor internal people and resource management. Project HOPE has developed a habit of not addressing bullying and intimidation of employees by senior management, no matter how many times certain managers' misbehavior (and this is at the leadership level) is reported to HR. While other organizations would've terminated such bad managers a long time ago, Project HOPE continues to employ them."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The senior leadership team is invested in both its programs and employees - and I’ve seen this first hand by the way our CDCO, CEO and EVP carry themselves and foster trust and transparency. The work being done to help others on their teams doesn’t go unnoticed.", "cons": "Cons are also found in advice below."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great organization!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "15 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Growth, forward thinking leadership, committed employees", "cons": "systems/processes out dated, but updates in progress"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Growing and Improving Every Day", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jan 2023", "job_title": "Director in Washington, DC", "duration": "N/A", "pros": "Organization is growing and is enthusiastic and forward leaning. Esciting place to be right now.", "cons": "With rapid growth come some growing pains, but leadership is working to address them."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Culture is infused with anxiety", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Feb 2022", "job_title": "Digital Marketing Manager", "duration": "N/A", "pros": "If you care about global health the organization really is doing a lot of meaningful work around the world. The global health team is truly talented and is making lives better for women and the underserved.", "cons": "The development and communications department is toxic. The turnover is the highest I’ve seen at a company both because of out-of-the-blue firings for no apparent reason and people quitting because they can’t take the stress anymore. There’s a culture of distrust and fear on DevCom. Team leads are either pushed out of the org or pushed to verbally berating their coworkers for fear of losing their jobs. Many people have pleaded with the CEO time and again to please address the toxicity — but the response was near radio silence. Sadly all of the most talented, creative, enthusiastic employees have already left or are on their way out. If you are a communications professional please look elsewhere. The saddest part of this all is that at one point, PH had a wealth of talent and passion on the DevComm team -- and now it's gone."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Oct 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very nice work environment, Leadership has great vision of the future of the organization.", "cons": "Low salaries with too much manual work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Average Work Experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Sept 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible working\r\nGood exposure\r\nConducive environment to work\r\nGreat opportunity to get funds from donors, establish linkages and networking", "cons": "Contractual in nature\r\nSmall organization with small grants so no job security\r\nAverage salaries with hardly any increments"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "DevComm, A Revolving-Door Department", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Feb 2022", "job_title": "Development and Communications Manager", "duration": "N/A", "pros": "The organization is growing in size and responding to critical needs in global health and post-natural disaster emergencies in the US and around the world. During the COVID-19 pandemic, the organization has expanded its existing programs and launched new ones. The global health department is filled with motivated, dedicated, and talented staff. As the organization is growing, its budget is also increasing.", "cons": "High turnover within the Development and Communications department, with several employees having resigned or being dismissed on short notices. A clanique culture, which permeates throughout the department, makes work difficult, leads to unnecessary stress, and affects the morale of staff. No actions to address the issues plaguing the DevComm department have been taken.\r\n\r\nUnfortunately, the organization offers​ basic benefits with barely 12 days of paid leave annually and poor parental leave policies."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "4 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Leadership team is committed to employees. Great advancement opportunities. Supportive of work/life balance and family.", "cons": "Growth of staffing infrastructure is behind the overall growth of the company, but leadership is taking steps to correct this."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Humanitarian Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Aug 2022", "job_title": "Project Coordinator in Washington, DC", "duration": "N/A", "pros": "Managers in leadership positions are the best, very supportive, result driven and always searching on helping the most in need.", "cons": "No one to mention at the moment."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great benefits, impactful organization", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Feb 2022", "job_title": "Senior Director", "duration": "N/A", "pros": "For many reasons, this is the best place I have worked during my career. My colleagues are smart, dedicated, and hard-working, and I genuinely like them as people, in addition to appreciating their steady commitment to advancing Project HOPE's work around the world. For HQ staff, we have a surprising amount of interaction with our colleagues in the field, compared to other organizations, and that really helps stay inspired to do our best.\n\nThe organization has undergone a transformation in the past few year, from one heavily reliant on GIK to increasingly impressive development programming, and the senior leadership team in constantly focused on growing our impact, funding, and recognition. As our development programming has increased, it has been exciting to see our footprint expand into more areas, whether mental health, or innovative health worker trainings in Covid prevention and treatment.\n\nOur benefits a few years ago were ok, but in the past couple of years, they have expanded and become very competitive. We have excellent paid time off (starting with 13 days vacation, 5 personal days, 3 floating holidays, 12 standard holidays, COVID leave, and last year, paid family leave was introduced, varying from 8-12 weeks depending on tenure.)\n\nI work in DevComms. While we are frequently under intense pressure between high revenue goals and various emergency responses that can impact our work a great deal, it is also a team that has been steadily growing as part of a 4-year strategic plan, contributing additional funding and raising more awareness for the organization with every passing year. Our leader is strongly supportive of work life balance, while also challenging us to do our best for the organization. And the team is full of people who are smart, creative, and who bring their best to work every day.", "cons": "The organization has undergone rapid growth in the past several years, and sometimes processes and infrastructure haven't yet caught up. This is a known issue and is being addressed over time. But someone who expects to come into a position with everything laid out and ready for them, every process fully baked, will be disappointed. On the other hand, people who love to build things and solve problems can really thrive.\n\nLike working at other international orgs that respond to emergencies, it can be stressful to have work disrupted, sometimes multiple times a year, to pivot to an emergency response. It means other projects and efforts can go off track, and important but less urgent work gets delayed. It just goes with the territory.\n\nSeveral reviewers, particularly on 2/3/22, make demeaning and untrue comments about DevComms team members in their reviews. I am glad that they are now former colleagues, as their behaviors and attitudes are indeed toxic. Where I think the organization can improve on this front is to take action more quickly and forcefully when team members are underperforming or showing a pattern of working to maliciously undermine their colleagues. If you're considering joining the team, you can feel confident that our best days are yet to come."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Project Hope review", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Jul 2022", "job_title": "Crisis Counselor", "duration": "N/A", "pros": "Decent working people with goals", "cons": "Being a team player was not always major stance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Feb 2022", "job_title": "Administrative Assistant in Washington, DC", "duration": "N/A", "pros": "It is great to be a work for an organization that believes everyone deserves access to the health care they need to reach their full potential.", "cons": "There is no downside to the work HOPE does."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great experience!!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Feb 2022", "job_title": "Staff Accountant in Bethesda, MD", "duration": "N/A", "pros": "Flexible work schedule.\r\nGreat communication channel with my bosses.\r\nSmall team (which was perfect for me)", "cons": "Benefits\r\nPay\r\nPlease note that the cons I noted are based on my experience. So someone else might see them as something good."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good company but without its shortcomings..", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission and overall making great impact in many parts of the world. The field staff are also very passionate about the work.", "cons": "Very top management heavy, salaries are no equitable across the board and upward mobility is limited."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Toxic DevComm Culture is Opposite of Code of Ethics, but Condoned", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Feb 2022", "job_title": "Director", "duration": "N/A", "pros": "- Many talented, passionate colleagues across Global Health & Emergency Response teams are improving lives and serving communities worldwide. They work tirelessly to advance the organization's mission. EVP, Directors and Managers are supportive and great to engage with, always pleased to collaborate, educate and advance good work together. The strong leaders and cohesive teams are driving growth. New Domestic program is but one example of excellence here.\n- World-class global health leader serves as Chief Health Officer, a 21-year CDC veteran. An expert and compassionate leader. Great teacher and true humanitarian.", "cons": "As accurate 1-star reviews posted in 2020 describe, steer clear of the revolving door that is Project HOPE's Development & Communications (\"DevComm\") department. Especially if you're a Communications expert or strategist who believes in best practices.\n\nThere is a serious problem causing toxic conditions, negative staff experiences and the highest turnover rates I've ever seen. Rather than fostering a spirit of solidarity, trust and collaboration, the team is managed in a dated, negative top-down manner. This culture favors a stunning degree of back-stabbing, pitting teams and good people against one another, weaving an \"us vs. them\" mentality toward colleagues (including toward Global Health, Health Affairs, others) rather than a unified, healthy fabric. Disrespectful behaviors and attitudes are the norm and condoned (don't be fooled by cheery group calls and emails that are performative, acting as though everything is fine when others are watching). In this culture, disparaging and misrepresenting people, their ideas, work and character are common, including existing staff (leadership team included) and people who left the organization. If you are accustomed to a professional workplace and normal standards of professionalism, prepare for culture shock.\n\nThis DevComm pattern began long before I joined Project HOPE. I was assured during interview stages that \"the old PH\" had some bad seeds who had to go, and that \"the new PH\" was cleaned up and full-speed-ahead. Unfortunately, the truth is that many talented, expert and mission-driven professionals leave because serious DevComm management and culture problems do not get addressed. \n\nAs 2020 reviews note, HR, Legal and the Senior Leadership Team, including the CEO, are well aware of the DevComm problems. Many concerns have been raised over recent years, prior to and during my tenure. Leadership did not respond to staff concerns, including from some highest performers. Many talented employees thus left over a relatively short time. This included: three media personnel in three weeks, four in four months (i.e. the entire media department). Other losses in 2021 included two great fundraising professionals on the Development team, beloved by colleagues. Other staff left in 2020. I understood a series of sudden, startling firings occurred before my arrival. It became hard to count how many people left DevComm.\n\nImportantly, there **are** several good, talented, positive professionals on Project HOPE's DevComm team. The toxic workplace issue is limited to an influential small few but has ripple effects that harm the entire organization. Staff can't understand why such problematic behavior is condoned, despite repeatedly flashing red on Senior Leadership's radar. Based on what one Senior Leader told me, the issue reached Board-level awareness before I joined the organization."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Amazing opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Apr 2022", "job_title": "Crisis Counselor", "duration": "N/A", "pros": "Learn a lot\nMulti-faceted position\nTeam effort", "cons": "The only downfall is that this is a temporary program"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great organization, needs to improve in a few things, but is good!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Apr 2022", "job_title": "Finance Administration Manager", "duration": "N/A", "pros": "Good HQ enviroment, good benefits and salaries.", "cons": "Improve in proposal risk assesments and the impact on that for the project."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Global health department is super strong", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Sept 2021", "job_title": "Manager", "duration": "N/A", "pros": "-Global health department is stronger than ever\r\n-Work is intense, but personal time is respected and encouraged\r\n-Organizational strategic planning, DEI council, other initiatives are growing\r\n-Rapid growth is allowing for new processes\r\n-New CEO is aware of issues and is extremely open to solutions\r\n-EVP and CEO are experienced humanitarians and are not just fundraisers\r\n-Historically bad business model has completely changed under new leadership and org finances are looking good", "cons": "-Other departments need more leadership and investment\r\n-HR department is tragically small for an organization this size\r\n-Org lacks many structural elements for its size, including personal development, formal (and enforced) performance reviews, etc"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Polite", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Mar 2022", "job_title": "Field Officer", "duration": "N/A", "pros": "Health and private insurance, and development for work", "cons": "System not well established yet"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Organization and Great Mission", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jan 2022", "job_title": "Program Manager", "duration": "N/A", "pros": "Mission; flexibility; culture; focus on people", "cons": "Going through a transition from the old ways of doing business to new and innovative ways. Some growing pains in that change."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Reviews", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "14 Jan 2022", "job_title": "Office Manager/Case Manager in Denver, CO", "duration": "N/A", "pros": "Love the people and staff was great", "cons": "No cons at all great place"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place learn and work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "3 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Best place to work and serve the people in need", "cons": "I don’t find any downsides for working here"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good intentions but did not manage sub contactors well.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2022", "job_title": "Project Hope Manager in Los Angeles, CA", "duration": "N/A", "pros": "Great intentions with great people", "cons": "Sub contractors took advantage of situation and did not provide good services for children"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Organization  |  Great People  |  Great Mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Jul 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Project HOPE's mission is focused on helping create a better tomorrow for people in resource limited areas. The employees around the globe make the work possible and I've never met a more dedicated, passionate and kind group of people in my life.", "cons": "Staffing resources have not equally kept up with the program growth, but this is an area the organization is working on."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Small but driven to respond to global health needs", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Oct 2021", "job_title": "AVP- Corporate Communications in Washington, DC", "duration": "N/A", "pros": "Great Dev/Com team and leadership.", "cons": "Lack of strategic priorities for development programs."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Anonymous honesty", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Nov 2020", "job_title": "Data Entry Clerk", "duration": "N/A", "pros": "Very caring and Passionate towards the community", "cons": "Does not reward employees for their hardworking and effort"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Good but a lot of room for improvement", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Apr 2014", "job_title": "Development in Millwood, VA", "duration": "N/A", "pros": "There is are great opportunities to blaze your own path if you have the drive and can articulate a vision. Along the same lines, the organization has a lot of resources that you can work to obtain and propel yourself and others forward. Once you connect with a colleague in-person, they are very easy to get along with and work with. It has a great family feeling and the organization is loyal to its employees. A very strong board of directors provides many resources and insight.", "cons": "Many employees are simply comfortable working there and dont seemed motivated to propel the company - this can be explained by the fact that most employees are interested in doing the bare minimum. The CEO is very hard to work with and seems to micro-manage everyone when he doesnt even have the time. There is no COO and many managers are left to scrap with the CEO. There is too much telecommuting and this makes it very hard to get things done. The work/life balance is \"life\" heavy for all employees. The brand seems to be diluted by the many different facets of the organization - I would greatly suggest a re-alignment so that employees and donors alike can better understand the breadth and depth of the organization."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Buyer Beware", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Project HOPE has an important mission and wonderful people working hard every day. They are passionate about what they do.  There are some new people there who have brought new energy to their programming.", "cons": "PH operates like a family-run business. There are few rules and policies, no code of conduct, and decisions are made based on who you like and who likes you. There is no job security because they can't raise the money they need.  Nowhere is this more obvious than on the Development team, which is a horror movie on a good day and the scariest place I've ever worked. The leadership works from home on the other side of the country so they have no relationship with their staff and no idea what's happening. They are constantly \"reorganizing\" so that the team is \"fit for purpose\" - you can see the evidence by the number of people who've been shoved out in the past 18 months. They are mean and vindictive. It is without question one of the most toxic, venomous work environments in town. People are in constant fear of being berated or screamed at, and of losing their jobs."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A positive work environment.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Aug 2020", "job_title": "Associate Vice President", "duration": "N/A", "pros": "Project HOPE is a positive work environment. The organization encourages participation at all levels of the organization and supports thinking out of the box. It welcomes those individuals who are willing to work hard for the betterment of supporting global health care. The Senior leadership is new, smart and aggressive. The Board of Directors is very supportive of the staff and the organization and willing to make introductions and participate at all levels. Project HOPE is looking for employees who want to move the mission forward and welcome ideas and strategies to support this action. This is a fast paced environment and is well suited to those who are passionate about health and willing to give it their all.", "cons": "If you want a 9-5 job that is rote, this is not the place for you. Like all organizations that are growing, there are \"growing pains.\" But it allows all to be creative and provide ideas to move the organization forward."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Potential to be good", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Jan 2020", "job_title": "Manager", "duration": "N/A", "pros": "Some of the projects around the world are seeing real impact - it's great to feel apart of something good.", "cons": "HQ is a 2 hour drive from Bethesda with only a small staff in the Bethesda office. We were \"encouraged\" to make the drive out to HQ on a semi-regular basis as the folks in Millwood were unwilling to come to the Bethesda office. Therefore, we never got face time with management. HOPE is going through a transitional period and there's potential for a strong organization after that, but until then, they operate an international NGO like a local, family-run foundation."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Unique non profit.  Lots of potential.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jun 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Friendly environment\r\n- Great work/life balance for support/admin positions", "cons": "- CEO is dull, inept, misguided and grossly overpaid (three times as much as industry standard)\r\n- Not enough public health people at the leadership level \r\n- No presence in DC.  Technical specialists out of touch with industry standards, news, & best practices\r\n- Not enough rigor in procedures and technical approaches"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Project HOPE needs to decide what it wants to do when it grows up", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Mar 2015", "job_title": "Manager in Millwood, VA", "duration": "N/A", "pros": "friendly staff\r\nlovely grounds\r\n(lack of) skill not a barrier to entry", "cons": "few public health people (particularly problematic when the upper management doesn't understand public health (or development)\r\ngeographically isolated from the development world in DC\r\nremoved from all trends in public health\r\ndemotivated staff\r\nNo depth to programming.  Nothing done to scale\r\nDeskilled field staff"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Micromanagement, distrust, and incompetence", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Mar 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Project HOPE has a good mission - they want to support health for people all over the world. Who doesn't like that? And they have a few very good child survival projects.  They are very Republican and conservative, if that's something you care about.", "cons": "Their finances are badly run, the corporate culture focuses on obedience to the hierarchy, and people are just plain mean at times."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Lack of Humanity", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jul 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Most of the staff i.e. not the leadership are kind, generous and hard-working colleagues", "cons": "I wouldn’t recommend this organization to anyone for any purpose. Do not go work there, and more importantly do not donate your time or money to them. They have a complete and total lack of respect for their donors and employees. Employees are seen as disposable and treated with total disrespect.\r\n\r\nThe senior leadership team is without morals or ethics, they lack leadership and will buckle to the whims of a board who also seem to want to drive this organization into the ground. They're a group of misguided leaders who are unwilling to do the right thing this is particuarly true on the development team. The development team is always chasing a dollar without any real business strategy or plans of any kind and it’s usually at the expense of their employees who are terminated, pushed out, laid off due to “fit for purpose” or other reasons that are generally without merit and are at the impulses of a reactive leader. Some of the “leaders” regularly ask for loyalty pledges from staff and balk when the staff won't commit themselves to the leader personally. This is the case most often on the development team. \r\n\r\nIn addition to their lack of morals, every one of these senior leaders of the organization are underqualified and not even welcome in the leadership circles of the Humanitarian Aid community. Some of the leaders spend most days playing a political game with each other usually focused on undermining their colleagues and creating drama aimed at getting direct reports to infight. HR is not comprised or lead by certified SHRM professionals and don't seem to understand basic HR principles, not the least of which include establishing a code of conduct, or, more importantly, confidentiality.  HR regularly shares private conversations with each of the aformentioned \"leaders\" when staff who - often in seeking solutions - rightfully believe they should be able to go to their HR department with concerns about the actions and behaviors of their peers and leaders. The nicest thing I can say about the general counsel is that she’s overworked but without political capital and therefore bends to the urges of these other leaders and is often left to clean up their messes. \r\n\r\nEmployees are regularly berated, shouted and cursed at by the some of these so called \"leaders\" particularly in development and by other development staff who view themselves as “above the law”. The organization does not hold its leaders accountable for their actions, which in turn has led to an “every man for himself” cutthroat environment.  The development team is constantly jockeying to get in front of the board while also bad mouthing and fighting with peers and the CEO. The Global Health team is the only one in the organization with a leader who has any sense of morals and willingness to do good on behalf of the organization. \r\n\r\nBe sure to check Project HOPE’s 990s carefully as they are grossly inflated and a completely inaccurate picture of the dire financial straits this organization is in. In-kind gifts do not equal cash!\r\n\r\nIn short, this organization will be run into the ground by an egocentric board and the reactive and chaotic nature of these incompetent leaders who are too busy worrying about themselves to worry about the well-being of a 61-year-old organization or its employees and the people they are trying to serve."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Pros & Cons", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Feb 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Excellent opportunities for people to get experience beyond what they would get in a larger non-profit organization. Great colleagues in global health and overseas.", "cons": "Unfortunately those opportunities exist because the global health department is severely understaffed and senior management does not prioritize global health, which is the core of what the organization does. Work/life balance is not supported at the top levels. Lack of mobility as there are few positions available."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "An NGO that seems to be struggling with its footing", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "One of the greatest attributes of Project HOPE is the mission it strives to serve; Health Opportunities for People Everywhere. Whether you are on the ground directly supporting an initiative or working in the Millwood Headquarters, you feel like you are part of something big. While I worked at HOPE, it responded to several disasters bringing supplies, education, and comfort to the areas it served. Project HOPE's long, rich history of missions and initiatives that began when it was formed in 1958 is something to be proud of and often sparks conversation about its history and what it is doing now.", "cons": "HOPE has this unique ability to attract talent, squeeze them for everything the foundation can get out of them,  and then send them on their way.  A prime example of this is the Development Department,  as it's often referred to as the \"revolving door\" of HOPE, as it saw the most turnover of any dpeartment within the foundation.  A second example of this is the Information Technology team. During my time at HOPE, we saw the departure of  over over 75% of the IT staff leave in the past six months. that seemingly drove just about everyone out of his department.  Lastly, the organization seems to lack a finanical steward. \r\n\r\nIn my view, HOPE's staff,  particularly in the Millwood and Bethesda offices seem to have trouble staying motivated, which is likely related to the dark looming cloud of monetary trouble the foundation has continued to deal with. While working for HOPE, there were some layoffs and there was a constant fear of furlough.  While it's understandable that monetary challenges will lead to tough decisions, HOPE doesn't invest in its employees, it doesn't foster their growth, and it rarely promotes from within. If you are looking to grow yourself as an individual with an NGO and make a career out of, HOPE should only be considered as a stepping stone, not a long term employer."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great organization and mission, leadership challenges", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 May 2015", "job_title": " in Winchester, VA", "duration": "N/A", "pros": "Most employees are good hard working people that believe they are making an impact on the lives of others around the world.  Salary is okay for this area.", "cons": "Too many people in leadership positions earning too much money.  Very hard to move up even if you are qualified."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Mission, CEO is Great", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jul 2020", "job_title": "Coordinator in Bethesda, MD", "duration": "N/A", "pros": "Great mission, lots to look forward to, potential to be a leader in global health in the future", "cons": "Historical legacy gets in the way of progress, management is disorganized (lots of hiring and firing), little positive reinforcement, terrible work life balance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A wonderful, supportive place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Dec 2012", "job_title": "Editor in Bethesda, MD", "duration": "N/A", "pros": "Autonomy, challenging work, great pay and benefits, supportive atmosphere, strong leadership.", "cons": "very sedentary job where you can go a long time without interaction with other co-workers"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best company to work for.  Have worked for the company for 24 years.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Close to home.  Look after their employees", "cons": "Company is relocating. Beautiful company and lovely people"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Efficiency, economy, effectiveness", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Sept 2019", "job_title": "Finance Manager/Regional Finance Specialist in Almaty", "duration": "N/A", "pros": "Project HOPE addresses health challenges affecting people around the globe", "cons": "less opportunity for professional growth -"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Program", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Aug 2019", "job_title": "Programming in Dushanbe", "duration": "N/A", "pros": "The Project HOPE is The best organization.", "cons": "It was pleasure for me to work 14 years."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great organization", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Apr 2018", "job_title": "Assistant to the President in Washington, DC", "duration": "N/A", "pros": "Worthy cause, smart people, interesting projects", "cons": "Not all get to travel overseas."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Oct 2019", "job_title": "Financial Controller in Tashkent", "duration": "N/A", "pros": "Internal work procedures were very accurately processed", "cons": "Many documents had to be approved with Government Authorities"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "capacity building, documentation", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "flexible, provides platform for exposure", "cons": "delayed management and weak finance and HR"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Jul 2020", "job_title": "Specialist", "duration": "N/A", "pros": "Professional and dedicated field staff", "cons": "Lack of support from HQ, no opportunities for prof. development"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "warm culture but strapped for cash", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "- warm culture\r\n- great campus", "cons": "- layoffs\r\n- little room for promotions"}]]