[[{"date": "14 Dec 2022", "title": "Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alaska Native Tribal Health Consortium (Remote) in Nov 2022", "Interview Descriptions": "I should have listened to the reviews here, because they are spot on. This company is truly disorganized and unprofessional. I initially interviewed with the hiring manager who admitted they use a combination of proprietary and outdated tech. He also mentioned that his subordinates would entirely be making the hiring decision, not him. (Not a wise choice, as mangers tend to hire for talent and team members seem to filter out anyone they perceive as competition.) Against my better judgment, I decided to move forward to the next round because the manager and I got along well despite the red flags. His team...yikes. They were not on the same page as their manager at all. They contradicted most of what he told me about the position and badmouthed him several times during the interview. When asked why they were hiring for this role, they gave a very defensive non-explanation claiming they didn't actually need another data engineer because they were so good at their jobs. Sure... They also seemed to not be keeping up with current tech in the data sector and were threatened by my experience. When I was talking about basic cloud data warehousing concepts like file staging, one of the interviewers cut me off to falsely assert that I was making the whole thing up because he had never heard of it. The most concerning thing about this team is that they don't even seem to care about the non-profit they're working for. When asked what his favorite thing about working for ANTHC was, one interviewer actually said \"the health insurance\" and nothing else. Wow. Naturally, they ghosted me after the interview. Huge bullet dodged, and a newfound appreciation for my current job.", "Interview Questions": "There aren't many questions, strangely. They abruptly told me to share my screen for a poorly organized coding test. They admitted that everyone they interview is confused by the instructions, but still have not bothered to fix it. If you try to jot down any notes or organize your thoughts on a different screen, they will accuse you of cheating (with raised voices)."}, {"date": "18 Oct 2022", "title": "Health Facilities Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alaska Native Tribal Health Consortium", "Interview Descriptions": "This company is very disorganized and unprofessional. I received an email about a month after applying that I had been selected to interview for the position. The interview was simple, and took about an hour. After the interview I received no correspondence from either the company or the interviewers. A week after the interview I inquired if I was still under consideration and received no response. I waited 45 days with no response whatsoever when I sent another email inquiring if the position was still available. I shortly after received a very condescending and unprofessional message implying that I should have taken the company's radio silence as meaning that I was no longer a candidate (despite the company website that I applied through still listing me as \"under consideration\"). I understand sometimes the interview process can take a bit of time but everything about this process was incredibly disorganized, even setting up a time for the interview was unnecessarily difficult. Ironically the fastest response I ever received was for them to insult me.", "Interview Questions": "Basic questions, mostly about your background and if you are comfortable working in an Alaskan environment."}, {"date": "13 Oct 2021", "title": "Community Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Alaska Native Tribal Health Consortium", "Interview Descriptions": "Panel interview, 3-4 people in person and a person over zoom. Very stressful but they were nice and took turns asking me questions. They were all taking notes on everything I said and I felt like I was being quoted word for word.", "Interview Questions": "How has your past experience made you an ideal candidate for this position?"}, {"date": "25 Jun 2021", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Alaska Native Tribal Health Consortium in Jun 2021", "Interview Descriptions": "Review Panel. Zoom meeting with 4 pharmacy professionals, all had over 14 years experience. Interview lasted approximately 35 minutes with 10 questions.  4 women asked questions. They were polite and professional .", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "26 May 2021", "title": "Grant Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alaska Native Tribal Health Consortium", "Interview Descriptions": "First interview was with a panel of people over zoom. Second interview was in-person with three people. Lead interview seemed to have a chip on their shoulder and asked questions in a confrontational manner. Most aggressive interviewer I’ve ever met.", "Interview Questions": "What is your experience working with rural communities?"}, {"date": "7 Feb 2022", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Alaska Native Tribal Health Consortium (Anchorage, AK) in Feb 2021", "Interview Descriptions": "It was really easy because I had worked with my team as a contractor prior. Through being a contractor, I was able to build this relationship and attain a job at ANTHC. This was within DEHE.", "Interview Questions": "They wanted to know my future plans, etc. "}, {"date": "10 Apr 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Alaska Native Tribal Health Consortium", "Interview Descriptions": "Telephone interview then face to face. Process took about three to four months. It was a meet and greet. Then they give you a 5 question quiz that an oxy moron can fill out. Its more of a vibe thing and see if you are able to handle stress and gossip which is good because you are basically going to have to deal with that alot since they hire alot of immature adolescent behavior defective nurses and staff there", "Interview Questions": "Stupid easy questions"}, {"date": "17 Dec 2020", "title": "Sr Systems Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Alaska Native Tribal Health Consortium (Anchorage, AK) in Feb 2019", "Interview Descriptions": "This company is incredibly disorganized.  I was contacted multiple times by different people, and then when I attended my first interview, no one showed up.  I was eventually offered the position, but I turned it down because of the bad impression I received overall.", "Interview Questions": "What are some past cases where you have worked with Alaska Natives?"}, {"date": "4 Dec 2018", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Alaska Native Tribal Health Consortium (Anchorage, AK)", "Interview Descriptions": "The hiring process required that I called to check up. It helped to have an inside person to help me. The interview was casual. Staff from several related/overlapping areas were there. I was asked to bring several examples of technical writing.", "Interview Questions": "What are your qualifications for this job?"}, {"date": "29 Jun 2019", "title": "Reporting Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Alaska Native Tribal Health Consortium (Anchorage, AK) in May 2018", "Interview Descriptions": "I applied for this position in late April. Within days of my application, I received a computer-generated notification that I would not be selected for the interview process. Imagine my surprise when I was contacted on May 3 for an interview. A member of the data team (Analytics Architect) contacted me via email to request a phone screen, which took place a few days later. Following the phone screen, the same individual contacted me for an interview with the rest of the team  (which took place a few days later -- I liked the team). About a week later, I interviewed with the same individual and the director of the department. The interview proceeded as one would expect, until I was asked about availability. As I am relocating from the lower 48, I mentioned that while I could be available within two weeks, I would appreciate the ability to work remotely for a brief period of time while selling my home. I was told that it takes CEO approval for anyone at the company to work remotely, and that I would need to be there within two weeks. Following the interview, I wrote a 'thank you' email to the folks that I interviewed with (as I had done every step of the way). The following day, I was surprised to see that one of the people that received the 'thank you' had inadvertently replied to my email with a negative comment about another applicant (to his credit, he caught the blunder and attempted to recall the email). After not hearing anything for about a week, I followed up and was told that they were still in process. I next heard from them after 42 days of silence, where they asked for references -- indicating that they wished to proceed further. Upon providing references as requested, I asked to speak with someone about benefits. I was told that he would send my request to the recruiting department -- and I never heard back. After both of my references gave glowing reviews of my past and present performance, I received a system-generated email stating that I had not made the cut. \r\n\r\nRed Flags:\r\n1 - Why did I received a system-generated rejection email before I was contacted by them?\r\n2 - This was advertised as a \"Relocate to Alaska\" position. Do they really think that it's reasonable to expect someone moving cross country to be there in two weeks? \r\n3 - Ghosting an applicant for 42 days isn't okay.  \r\n4 - Calling an applicant's references without the intent of offering a position isn't okay. \r\n5 - Sending a system-generated rejection email after having invested two months and going so far through the process is unprofessional. \r\n6 - Why not allow an applicant to speak with a member of HR for benefits questions? Seems suspicious to me. \r\n\r\nAt the end of the day, I found this process to be alarmingly amateur and unprofessional. I never spoke with any recruiter or HR member -- my only contact was with the team. The process was the slowest I've ever experienced -- as a matter of fact, another recruiter in the area commented about how slowly ANTHC's recruiting efforts drudge along. Fortunately, I am accepting a position that pays $35k more, and will allow me a period of remote time while my family relocates.", "Interview Questions": "Basic questions about reporting, ETL, etc., as well as a question about the various uses for a paper clip. "}]]