[[{"date": "2 Nov 2022", "title": "HR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland Community College (Portland, OR)", "Interview Descriptions": "I believe it was a pretty standard 2 round process with the Hiring Manager and the Hiring Team. I really appreciated how they provided the questions in advance of the interview so I could better prepare.", "Interview Questions": "Tell us about your experience."}, {"date": "7 Dec 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Portland Community College (Portland, OR) in Sept 2022", "Interview Descriptions": "Virtual, with questions sent one hour before scheduled time. Panel interview, they were all kind and made me feel very comfortable. Follow-up was prompt afterwards. Look forward to applying to more jobs at this organization due to my positive interview experience.", "Interview Questions": "Describe your experience with grant writing."}, {"date": "9 Nov 2021", "title": "IT Lead Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Portland Community College", "Interview Descriptions": "Very thorough, slow but great process to meet the team and understand exactly what they were looking for. I highly recommend it. Now I'm typing to make the 30 word limit.", "Interview Questions": "Most questions were for problem solving, critical thinking skills."}, {"date": "15 Jan 2023", "title": "Food Service Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Portland Community College (Portland, OR) in Sept 2021", "Interview Descriptions": "I applied via the job pool available on the PCC website. Then I received an email saying that I was selected for an interview for the position. After a few months, I had a single interview over Zoom and was notified within a day that I had gotten the job.", "Interview Questions": "What previous experience did you have in the Food Industry?"}, {"date": "24 Apr 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Portland Community College", "Interview Descriptions": "Straightforward interview with basic questions like why do you want to work at PCC, questions about psychology. The interview panel was generous and very friendly. They went over my work history  and my references and also how I can contribute to PCC", "Interview Questions": "How did you hear about PCC"}, {"date": "15 Apr 2021", "title": "Portland Office Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Portland Community College", "Interview Descriptions": "The interview process consisted of turning in my resume and having a phone interview. I then had an in person interview and spoke with the people I would be working with.", "Interview Questions": "How many limbs do you have?"}, {"date": "9 Jun 2022", "title": "Adjunct Faculty Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Portland Community College (Portland, OR) in Mar 2020", "Interview Descriptions": "The interview was 40 minutes long, including 15 minutes for a teaching demo, 20 minutes for questions, and 5 minutes for me to ask questions. I was asked to prepare and bring a lesson plan for a favorite lesson on a topic of my choice.\r\n\r\nThey sent me a parking permit in advance. I was asked if I wanted a tour of campus after the interview, which I said yes to. I was offered the position on site during the tour.", "Interview Questions": "Describe specific ways that you facilitate an inclusive and equitable learning environment. "}, {"date": "24 Jul 2019", "title": "New Student Orientation Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Portland Community College", "Interview Descriptions": "It was an panel interview over google hangouts, the panel was in one room together so I could see them and I imagine I was on a screen in their room. I muted google hangouts and used the phone for sound.", "Interview Questions": "Experience serving First Generation and low-income students."}, {"date": "24 Jan 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Portland Community College (Portland, OR) in Sept 2018", "Interview Descriptions": "Applied online, much later received an email to schedule a phone interview via google hangout, followed up with an in person interview.  The phone interview was with a group panel.  Questions sent beforehand by about 30 minutes.  Follow up was a small group with the next level director, again with prepared questions.  Questions were standard interview questions and college/position specific.", "Interview Questions": "Experience with Diversity, Equity, and Inclusion and Accessibility "}, {"date": "17 Oct 2018", "title": "Foundation Events Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Portland Community College (Portland, OR) in Aug 2018", "Interview Descriptions": "I had a phone interview with a panel of 5 people. The questions required detailed and specific examples of my work with events. This was followed by an in-person interview that lasted two hours. I was asked to prepare a 10-minute presentation for the first part of the interview. This was given to the same 5 people as the phone interview. I was given the information four days in advance about an event that was coming up in the spring and then asked to prepare a presentation. The presentation was followed by questions from the panel. Next I met with the Foundation president for 15 minutes, then the Advancement team which was about 15 people. They had a list of questions to ask me. Then finally I met with the hiring manager at the end. Every part of the interview process worked like clockwork down to the minute. The staff are highly organized.", "Interview Questions": "How do you keep  yourself organized?"}], [{"date": "25 Apr 2018", "title": "Community Relations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland Community College", "Interview Descriptions": "I was supposed to have a phone screen with the Recruiter for the Rock Creek Campus but after not hearing from him the first scheduled time, I reached out to ask if we were still on and he said he \"scheduled another meeting at the same time\", without apology. Then we rescheduled for 2 days later and he didn't call, and again no apology. At this point it's clear that I'm not a valued candidate. Very mishandled though.", "Interview Questions": "NA"}, {"date": "9 Aug 2021", "title": "Food Beverage Attendent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Portland Community College in Apr 2018", "Interview Descriptions": "Very well and comfortable process. The people were very nice and polite. I liked that they let me be comfortable with my class schedules and always helped me when I need an extra day to study.", "Interview Questions": "School schedule, the best work time  "}, {"date": "2 Jun 2017", "title": "Student Account Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Portland Community College", "Interview Descriptions": "Participated in an in-person interview.  I found the interviewer friendly and engaging.  The interviewer took the time to explain fully many aspects of the department and the organization.", "Interview Questions": "What experience do you have with accounts?"}, {"date": "31 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland Community College (New York, NY)", "Interview Descriptions": "I was a part of a float pool and was contacted by email for clerical work, we then set-up a phone interview since I was applying from out of state.", "Interview Questions": "How are you able to stay organized? "}, {"date": "16 Sept 2016", "title": "Equity Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Portland Community College in Sept 2016", "Interview Descriptions": "Online application. Contacted for telephone interview. Participated in telephone interview. Ran for the hills.  The hiring manager rattled off questions and sounded bored. My questions were not answered, like tell me about the culture.  She told me it needed to be experienced and she couldn't describe it in words.", "Interview Questions": "Explain your experience at your current employer with diverse communities."}, {"date": "25 Aug 2016", "title": "IT Web Library Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Portland Community College (Portland, OR) in Jun 2016", "Interview Descriptions": "Applied online. Completed the questionnaire and submitted resume and cover letter for the job in April 2016. Got email about the  interview in May 2016 and interview was scheduled for June 2016 .", "Interview Questions": "What are the skills from Job description you need to learn and what will be your strategy?"}, {"date": "26 Sept 2015", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Portland Community College (Portland, OR)", "Interview Descriptions": "Application includes all college transcripts and degrees conferred.  Interviews are determined after application deadlines OR after sufficient applications have been received.  That process can take weeks or months.  My interview was arranged in front of a panel, then another with the campus president to make a final decision on hiring.", "Interview Questions": "I was asked to teach a 5-minute lecture about my subject matter in front of a panel of reviewers.  Then I was asked questions regarding how I would handle student situations in the classroom and my experiences teaching."}, {"date": "1 Jun 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Portland Community College (Portland, OR)", "Interview Descriptions": "Any hiring process at PCC is lengthy and involves a number of questions in the application process as well as a pre-interview and finally interview by committee. A number of things can effect your hiring that are out of your control, such as there already being a pre-selected internal candidate who is forced to compete in an open hiring process.", "Interview Questions": "The questions vary by committee and the position you are applying for. Be ready to speak to your experience of working with diverse communities."}, {"date": "17 May 2015", "title": "Student Leadership Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Portland Community College (Portland, OR) in Jun 2014", "Interview Descriptions": "Group Interview.  Multiple people applying for multiple positions.  There was little competition and the positions were poorly advertised and defined.  Student interviewers seemed to be running off a script rather then having an understanding of the questions they were asking.  They seemed to be looking for specific answers.  In fact, after taking the job I came to discover that they were indeed looking for responses along the lines of a predefined playbook.", "Interview Questions": "If your entire team chooses an opposing solution to the one you feel is correct, what do you do?"}, {"date": "14 Nov 2013", "title": "Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Portland Community College", "Interview Descriptions": "Panel interview with staff members and manager, then interview with manager and director.", "Interview Questions": "How would you deal with allegations that a member of your staff was racist?"}], [{"date": "3 Apr 2013", "title": "Career Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Portland Community College (Portland, OR)", "Interview Descriptions": "large panels, multiple interviews", "Interview Questions": "Most candidates do not correctly or fully answer the question re: diversity and culture"}, {"date": "27 Aug 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Portland Community College (Portland, OR) in May 2012", "Interview Descriptions": "gave a 20 minute lecture over a topic of my choice (related to the class which I was applying to teach) followed by a panel of 3 department heads asking questions related to my previous experience plus the typical interview questions (which I don't remember). My experience was very benign and the interview process was very cordial and friendly.", "Interview Questions": "How has your previous teaching experience prepared you to teach at this school?"}]]