[[{"date": "1 Jun 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Macomb Community College in Apr 2022", "Interview Descriptions": "Set up interview through email. interview was on Zoom with two office managers. About 30 mins. Asked various questions and allowed me to ask questions. Described job requirements and asked about scheduling.", "Interview Questions": "Tell us about your experience. "}, {"date": "8 Nov 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Macomb Community College (Clinton Township, MI) in Jul 2018", "Interview Descriptions": "Met with Dean and Supervisor in a conference room.  Very informal and to the point.  They explained the hiring and job qualification process. I was contacted soon thereafter and advised there was an opening for me if I was interested.", "Interview Questions": "What is your level of experience?"}, {"date": "13 Apr 2022", "title": "Full Time Science Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Macomb Community College (Clinton Township, MI) in Jun 2018", "Interview Descriptions": "The interview included a set of predetermined questions that I had 30 minutes to review before beginning, a lesson demonstration (topic was sent a few days before the interview), and a content exam.  The second interview involved a new question set and the dean.", "Interview Questions": "Many had to do with teaching successes and challenges, several directed specifically toward teaching diverse student populations\r\n"}, {"date": "3 Sept 2017", "title": "Building Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Macomb Community College (Warren, MI) in Oct 2016", "Interview Descriptions": "It was fairly easy going in tone.  But it was pretty tough on questions, esp. for such a basic position, but they probably get some hardcore duds applying that they need to weed out as well as possible.", "Interview Questions": "How did you deal with a difficult situation?"}, {"date": "7 Feb 2016", "title": "P/T Roles and Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Macomb Community College", "Interview Descriptions": "Fairly smooth interview process. For many positions they will schedule you in ahead of time to review questions prior to the interview. For technical positions (even part time), a presentation is sometimes required.", "Interview Questions": "Describe a project that you managed and the outcome of the project."}, {"date": "3 Dec 2015", "title": "Computer Lab Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Macomb Community College (Macomb, MI)", "Interview Descriptions": "Very laid back. The whole interview took about ten minutes. I was asked if I knew Microsoft Office and to show up on Monday. The interviewer was very nice and kind. On Monday, I was shown how everything worked and started my training.", "Interview Questions": "Did I know MS Office?"}, {"date": "6 Sept 2015", "title": "Student Activities Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Macomb Community College (Warren, MI) in Aug 2013", "Interview Descriptions": "Relatively laid back interview that still covered all the important things. Questions involved ascertaining that the individual in question is a good fit for helping others in higher education. They want to know that you will work well with others and respect the chain of command. Come prepared with background information about what the department doors and what your individual position is for and you will do well.", "Interview Questions": "Working here involves working with people of different backgrounds and cultures, how well can you work with others of different backgrounds than yourself? "}, {"date": "28 Apr 2015", "title": "Lab Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Macomb Community College (Warren, MI) in Aug 2013", "Interview Descriptions": "I applied in person and had the interview with the Associate Dean of the Department I'm working for the same day. As part of the interview I had to watch a 20 minute video about the college and how to work in team environment and how to act when there's an emergency in the college.", "Interview Questions": "General Questions such as; Education, Address, and Experience."}, {"date": "21 Jan 2018", "title": "Staff Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Macomb Community College (Warren, MI) in Jul 2013", "Interview Descriptions": "Met with the dean and his assistant. They used standard questions, which I had 15 minutes to look over prior to the interview. There were three other candidates. There was no second interview.", "Interview Questions": "How do you organize your work day?"}, {"date": "8 Nov 2011", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Macomb Community College (Warren, MI) in May 2009", "Interview Descriptions": "Informal interview with a panel and one on one.", "Interview Questions": "N/A"}]]