[[{"date": "28 Jun 2023", "title": "IT ASSISTANT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ClientEarth in Jun 2023", "Interview Descriptions": "The interview process was very interesting. I was interviewed by the head of IT and 2 other guys and they were very nice. A lot of questions were asked in relation to the role including scenario based questions. It was an amazing experience overall.", "Interview Questions": "Introduce yourself and what do you know about Client Earth? Why do you want this role? How would you handle if there is a downtime and no one can work and your MD comes to you with an issue?"}, {"date": "17 Apr 2023", "title": "Grants Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ClientEarth", "Interview Descriptions": "The whole interview process was very clear from the start and I had good communication with HR. I did two interview rounds with different people at each stage and two written assessments before the interviews. They made a decision pretty quickly and gave me specific feedback on my interview.", "Interview Questions": "Tell me about a time you had to convince someone senior; tell me about your experience in report writing; how do you work under pressure; what do you expect to learn from the role."}, {"date": "25 Feb 2023", "title": "Senior Information Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ClientEarth (London, England) in Dec 2022", "Interview Descriptions": "I Had two Stages of Interviews. Two people panel at each stages. It was am amazing experience overall. The interviewers were very friendly and open-minded. I even got commended after the seconded stage interview.", "Interview Questions": "A lot was asked in relation to the role. I also did a presentation at the final stage."}, {"date": "20 Feb 2022", "title": "Events Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at ClientEarth (London, England) in Jan 2022", "Interview Descriptions": "The interview was conducted as a zoom call with a two member panel asking competency based questions. There was a friendly atmosphere but demanding questions were asked and a high standard expected. Some of the questions overlapped somewhat The interview lasted around 50 minutes.", "Interview Questions": "Can you describe a time you worked collaboratively with co-workers to achieve a goal?"}, {"date": "25 Nov 2021", "title": "Legal and Policy Research Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at ClientEarth", "Interview Descriptions": "The interview comprised two rounds spaced a couple of weeks apart, each with a panel of two interviewers. There was a written task to complete in advance of second interview.", "Interview Questions": "Why do you want to do this specific role?"}], [{"date": "9 Jan 2023", "title": "Grants Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at ClientEarth (London, England) in Nov 2020", "Interview Descriptions": "The interview process was very nice and relaxed. The panel took time to explain about the company and the role. I was asked about 10 questions which were aimed at the role and my experience", "Interview Questions": "Why do you want to work for Client Earth"}, {"date": "31 Oct 2020", "title": "IT Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ClientEarth (London, England) in Oct 2020", "Interview Descriptions": "I was invited by email to an interview with the Head of Operations, IT Manager and Senior IT Administrator.  I also had to sit a Technical test with Testdome. The interview was conducted over MS Teams and went very well in my opinion.  The panel each took turns to ask questions which was a mix of managerial and technical questions.  Following the meeting the Head of Operations stayed on the call to discuss renumeration, availability and next stage would be to create a presentation with Q&A fir the Director.", "Interview Questions": "How would I implement network security?"}, {"date": "30 Jun 2020", "title": "Head of Grants Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ClientEarth (London, England) in May 2020", "Interview Descriptions": "After submitting my application I had a screening interview with the hiring manager via zoom. I was only asked one or two general questions,  the interview was really informal and lasted approx 30 mins. Due to the nature of the questions, I had the impression they had already identified/recruited someone internally but had to conduct external interviews nonetheless.", "Interview Questions": "Why do you want to join ClientEarth?   "}, {"date": "20 Mar 2019", "title": "IT Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at ClientEarth (Hackney, England) in Sept 2018", "Interview Descriptions": "Was a basic two stage interview, the first stage is a written test and a few questions. The second interview was a two to one interview with the management of the team with some basic questions relevant to the nature of the role.", "Interview Questions": "Some arranged IT questions but different each time"}, {"date": "14 Mar 2018", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ClientEarth (Hackney, England) in Jan 2018", "Interview Descriptions": "Received a phone call from HR discussing the next steps of the process. The first round included a written task. The second round was a standard interview discussing in more depth about my skills for the role. Overall, the experience was efficient and the interviewers were really friendly.", "Interview Questions": "Why ClientEarth?"}]]