[[{"date": "8 Feb 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SE Health", "Interview Descriptions": "Human Resources initial screening. Interview with panel including coworkers, supervisor consisting of round Robin questions. Interview took approximately 30 minutes. Very friendly. I would highly recommend applying to the company.", "Interview Questions": "Why did you apply for this job?"}, {"date": "23 Feb 2023", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at SE Health in Dec 2022", "Interview Descriptions": "Interview with recruiter for phone screener was straightforward, who then set up a call with the hiring manager a few days later. Hiring manager interview was okay, some technical q's but mostly behavioral. No response after one week, so followed up with recruiter who informed they were still conducting interviews two weeks before Christmas. After Christmas and new year, did not hear after another email follow up. Messaged recruiter directly on LinkedIn who informed they transitioned to a different team and project and would follow up with their replacement. Another two weeks pass, and no response. Would not recommend on sole basis that their response time on follow ups is non-existent. Not a pleasant experience at all.", "Interview Questions": "Describe a time where you had to come up with a creative solution to a problem you faced."}, {"date": "23 Nov 2022", "title": "PSw Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SE Health", "Interview Descriptions": "Easy two interviews, same questions start off with many hours than they hire new people and you barely get any, drive all over the place, lots of kms and wear and tear on your car", "Interview Questions": "What would you do if you couldn’t get in to clients home"}, {"date": "12 Sept 2022", "title": "Program/Project Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at SE Health", "Interview Descriptions": "HR emailed me asking for time to schedule the interview.  I emailed here back 2 times. She ghosted me.  Have the decency to tell the candidate they are moving to the next person.", "Interview Questions": "Ghosted me for interview. Horrible experience"}, {"date": "10 Sept 2022", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SE Health", "Interview Descriptions": "The interview process is swift and intense. Relevant questions about how you will time manage and react in busy circumstances. Asked about your experience doing research and what research means to you.", "Interview Questions": "How do you time manage when you have multiple tasks to do?"}, {"date": "22 Sept 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at SE Health (Toronto, ON) in Sept 2022", "Interview Descriptions": "Screening phone call followed by clinical interview over MS teams . Very easy going, learn about your experience with scenario questions in the mix. Recruiter very responsive and easy to communicate with schedule changes.", "Interview Questions": "Over all experience as a registered nyrse"}, {"date": "24 Feb 2023", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SE Health in Jun 2022", "Interview Descriptions": "Two rounds-first was a phone screening interview with HR, the next was directly with research lead the next day (June 2022). Once through the interview process, a reference check followed.", "Interview Questions": "What abilities/skills you have that will help you succeed in the role of RA? What are your experiences with data collection, data analysis?"}, {"date": "22 Mar 2022", "title": "RN - Telehealth Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at SE Health", "Interview Descriptions": "Recruiter interview was first basic questions and job specifics if all goes well then move on to next round with  manager.  Interview was set up by recruiter and done virtually \r\nStraight forward \r\nAnd timely", "Interview Questions": "Clinical Assessment questions which includes Various age ranges \r\n"}, {"date": "3 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SE Health", "Interview Descriptions": "Met with supervisor and coordinator, went over prior experience and what the job would be. Talked about examples of nursing problems and how I'd solve them. Was offered the position several days later.", "Interview Questions": "Talk about a conflict that you encountered and how did you resolve it"}, {"date": "2 Apr 2023", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SE Health (Toronto, ON) in Feb 2022", "Interview Descriptions": "Screening phone call interview with Human resource professional, second set of interview live on zoom with a panel of individuals. Great experience very friendly and nice. Email communication was consistent and efficient.", "Interview Questions": "Previous experience and why I want the job."}], [{"date": "30 Dec 2021", "title": "Rehab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SE Health", "Interview Descriptions": "The interview process was easy and straight forward. Telephone interview first followed up with an in person interview. Interviewers we’re friendly.  There was a quick turn around after the interview if an offer was provided.", "Interview Questions": "Questions related to team dynamics, managing conflict, experience with OT/PT interventions."}, {"date": "27 Apr 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at SE Health (Toronto, ON) in Sept 2021", "Interview Descriptions": "The interviewer was quite unfriendly.\n\n She seemed dissatisfied that I previously had a part time role, and didn't understand that this was in the context of an 80-120 work week during my degree program where I had multiple jobs, and responsibilities at the same time.\n\nI worry they may be overlooking many qualified applicants.\n\nI was over qualified for the position. I was willing to speak to that but the interviewer so very obviously felt the opposite I was a bit thrown off. It seemed that there was a disconnect on both sides. There was a reoccurring theme where the interviewer did not understand my experience but seemed uninterested in hearing me talk about it and relate it to the role.\n\nThis was a screening but there were several situation, task, action, result applicable questions. Definitely prepare a bit for this interview.\n\nI would have declined a job offer if I had received one as I was able to secure a better position with another company. \n\nI'm not sure why out of all the interviews I've done in my life, this stands out as negatively. The interview made me feel like I wouldn't have enjoyed the role", "Interview Questions": "Do you have experience working with a Union"}, {"date": "29 Aug 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health", "Interview Descriptions": "The whole process was good. I got my first interview with HR for half an hour. All behavioral questions. Then I was invited to have a panel interview later, talking to two managers for 1 hour.", "Interview Questions": "Why are you interested in our company? Can you please tell me about problems you solved for your clients?"}, {"date": "12 Jul 2021", "title": "Project Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at SE Health", "Interview Descriptions": "Great interview with behavioural based questions. Great description of projects I would be supporting and I was given the opportunity to ask any clarification questions. I went to the office and got to see the work environment and meet some team members before accepting a position.", "Interview Questions": "Why do you want to work for SE Health?"}, {"date": "4 Jun 2021", "title": "Service Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at SE Health", "Interview Descriptions": "1 phone interview for screening and 1 in person interview. Super easy! The phone interview was with their HR department and the in person interview is with the manager you will be reporting to.", "Interview Questions": "How do you deal with conflict in the workplace"}, {"date": "18 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at SE Health", "Interview Descriptions": "Few years ago, I applied online and received an invitation for an interview during a recruitment site. I met with the hiring recruiter and interview was formal and easy.", "Interview Questions": "Tell me about a time you were in a difficult situation with a co-worker and how did you resolve it?  "}, {"date": "11 Feb 2021", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SE Health in Dec 2020", "Interview Descriptions": "30 mins with mostly scenario questions. First step was phone interview with a recruiter/ talent seeker followed by interview with supervisor.  Both were half an hour in length and I was hired the next day. Background checks and two references were required. Overall process was quick and more time was spent waiting for my references to send their referral. Orientation was a week long with most of it being online.", "Interview Questions": "Have you ever had to change a care plan and why? How did it turn out?"}, {"date": "5 Mar 2020", "title": "Personal Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health (Barrie, ON) in Feb 2020", "Interview Descriptions": "Group interview with role play and skill set questions.\r\n\r\nA quiz on PPE requirements was given where you would be given a scenario I.E ( someone is on droplet isolation what PPE is required, and how would you put the PPE on and remove the PPE).", "Interview Questions": "What is your weakness?"}, {"date": "10 Feb 2020", "title": "RPN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SE Health in Jan 2020", "Interview Descriptions": "There was first a phone interview -- ver generic questions. Then an in person one where they questioned mostly my experience as a nurse (or student nurse). It was somewhat difficuly because the interviewer insisted on telling me my experiences as a nurse, instead of a student nurse.", "Interview Questions": "Describe a conflict that you had as a nurse with a coworker and how did you solve it?"}, {"date": "4 Jul 2019", "title": "Recreation Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at SE Health (Toronto, ON) in Jun 2019", "Interview Descriptions": "A recruiter reached out to me based on my resume, I did not personally apply to this position. I completed a phone interview and was asked for an interview in person. The interviewer (program coordinator) was an hour late for my interview because she \"thought it was at 3:15\", although I saw her walk by, while I was sitting with my portfolio multiple times. The interview was awkward. She said she would let me know the following Monday. However, I did not hear anything for almost 3 weeks, until I emailed back. Super unprofessional.", "Interview Questions": "What challenging situations I have come across with a resident/client/patient\r\n"}], [{"date": "30 May 2019", "title": "Proposal Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at SE Health (Markham, ON)", "Interview Descriptions": "There were 3 interviews:\r\n1. HR\r\n2. Manager\r\n3. Higher Management\r\n4. Security Check-up\r\n5. Reference Check-up \r\n\r\nThey changed their mind about the job description and the process was delayed a couple of months - one interview was redone.", "Interview Questions": "Usual questions as related to the this type of job - writing/ editing/ project management "}, {"date": "30 Apr 2019", "title": "Service Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at SE Health", "Interview Descriptions": "Basic interview questions direct not tricky\r\nBe calm and just answer from past job experiences \r\nIt took more then one week from phone interview to personal interview and 2 weeks for final response", "Interview Questions": "How you handled a difficult client ?"}, {"date": "16 Jan 2019", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at SE Health (Hamilton, ON) in Jan 2019", "Interview Descriptions": "The entire interview/hiring process took about 5 days. I applied online Friday (Jan 16), was emailed Saturday for a phone interview to be had on the Monday. This was done by an hr representative. Then had an in-person interview on Tuesday with a supervisor at the location I interviewed for. The questions asked were fairly basic and mainly behavioral questions, relating to previous work experience and giving examples. Very very basic interview, straight forward and to the point. I had a great supervisor interviewing me who made me feel comfortable and welcome! I think that made all the difference.", "Interview Questions": "1. Give an example of a time you were under stress and how did you manage that?\r\n2. Give an example of a time a client/customer requested something odd/out of the ordinary of you\r\n3. Past relative experience\r\n4. Why do you want to work here\r\n5. Tell me about yourself\r\n6. Strengths and weakesses\r\n7. Tell me about a time you had to deal with an irate customer/client and how did you manage the situation "}, {"date": "27 Aug 2019", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at SE Health (Markham, ON) in Jan 2019", "Interview Descriptions": "there was a phone interview - very basic (average) - inquired about about general experience with respect to business analysis, health care setting as well as reviewed resume. Next step was an interview with manager and director", "Interview Questions": "interest for health care, business analysis specifically - also asked to describe some challenges I have experienced when working with a team"}, {"date": "5 Feb 2019", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SE Health (Toronto, ON) in Jan 2019", "Interview Descriptions": "it was a 4 week process. got a call back from HR and completed a 25 minute intreview.  Once I passed the phone interview, I got called in for a one on one interview with a supervisor/coordinator. It was a 30-minute interview and asked about the skills stated on my resume.", "Interview Questions": "Why did you apply to this rpn position?"}, {"date": "13 Jun 2019", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at SE Health (Toronto, ON) in Jan 2019", "Interview Descriptions": "I initially applied for Nutrition aid position, But during interview the Director of operations kindly described the job responsibilities till I found out I am not interested in the role! Then she offered Receptionist job there since my communication skills are very good and I took it\r\nI am very happy now with my position", "Interview Questions": "Tell me a bit about yourself"}, {"date": "5 Nov 2018", "title": "RPN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SE Health (Toronto, ON) in Oct 2018", "Interview Descriptions": "I applied online. The company requires a phone interview before an actual face to face interview. The phone interview was quite long. Took about 45mins. I thought it would have been a short interview with basic question. But they wanted more in depth, scenario/experience questions. \r\n\r\nAlso - they required a skills/personality/math/English test before the phone interview.", "Interview Questions": "Tell me about a time you went above and beyond for a client "}, {"date": "23 Aug 2018", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at SE Health", "Interview Descriptions": "Phone interview followed by in-person interview.\r\nBoth phone interview and in-person interview were taken by the Acquired Brain Injury manager. Phone interview spoke about my qualification, past experiences, current employment status, class 5 driving license and access to a reliable vehicle. In-person interview had a questionnaire regarding patient with ABI and the subsequent difficulties that they face like aphasia, hemi plegia, etc.", "Interview Questions": "What is Acquired Brain Injury"}, {"date": "31 May 2018", "title": "Human Resources Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at SE Health (Markham, ON) in Apr 2018", "Interview Descriptions": "The in person interview was very professional, but not too up tight. It was very easy going, and it felt like talking to a good friend more than anything. The questions were very relevant to the job and the expectations were laid out very accurately. I got a chance to ask any questions I had in mind and the answers were very helpful", "Interview Questions": "Why am I interested in Saint Elizabeth"}, {"date": "24 May 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health (Markham, ON) in Apr 2018", "Interview Descriptions": "HR took phone interview first. Then on-site interview with HR and hiring manager the next day. reference check required and . got offer a week letter after reference check. Then negotiate a bit with them,", "Interview Questions": "introduce yourself and why interested in Saint Elizabeth"}], [{"date": "8 Feb 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health (Mississauga, ON) in Dec 2017", "Interview Descriptions": "Single meeting with admin supervisor. pre-screening with an hr girl. questions with about what you would do, that experience have with computers, availablity on weekends. seemed like very busy disorganized office. waited at reception for someone", "Interview Questions": "experience, procedural, star "}, {"date": "25 Oct 2017", "title": "Regional Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at SE Health", "Interview Descriptions": "HR is very positive and provided regular updates during the process.  the in person interview was also thorough and allowed opportunities for discussion and questions.  The hiring process was also online and easy to navigate.", "Interview Questions": "Leadership style"}, {"date": "14 Aug 2019", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SE Health in Aug 2017", "Interview Descriptions": "I applied online on SE's website and heard back from HR the following week. A phone interview was set up and I was asked about 10 situational questions. After that was the in person interview, which was just more situational questions.", "Interview Questions": "What is an example of a time when you dealt with a difficult customer, and how did you handle the situation?"}, {"date": "14 Jul 2017", "title": "PSw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SE Health (Barrie, ON) in Jul 2017", "Interview Descriptions": "Started out with an on line application and resume submission. Followed by a Very brief telephone interview with questions asked to see if they felt you were a good fit for a face to face interview.  If they felt that you could be a good candidate they would schedule you for a face to face interview.", "Interview Questions": "What mistake did you make and how did you correct this? you could use any job or situation."}, {"date": "24 Feb 2017", "title": "Community Visiting RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at SE Health", "Interview Descriptions": "Job fair advertised on the website and interviewed multiple people for RNs, RPNs and PSWs positions. Asked to come in for a one week orientation following week. Hired on spot", "Interview Questions": "How many years of experience do you have in nursing?\r\nHave you ever worked as a home health nurse? \r\nWhat would you do if a client talks to you inappropriately?\r\nTell me about your past experiences?"}, {"date": "5 Dec 2016", "title": "Registered Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at SE Health", "Interview Descriptions": "I was interviewed by one supervisor. The supervisor told me of everything that I needed to expect in the job that I was offered to. There were a lot of situational questions.", "Interview Questions": "Strengths and Weaknesses"}, {"date": "8 Dec 2016", "title": "Customer Service Representitve Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health (Cambridge, ON) in Dec 2016", "Interview Descriptions": "General interview questions. What was a difficult situation for you to overcome. asked about wage expectation and availability. Asked if being on call was okay. asked about drivers license.", "Interview Questions": "How was your proficiency with word and excel"}, {"date": "8 Dec 2016", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SE Health in Nov 2016", "Interview Descriptions": "I applied online, and after few days I received an email with some questions regarding the previous experience, working hours and availability. Again after 2-3 days they send me the invitation for a telephone interview. It was around 20 minutes interview with HR. It was standard procedure and standard questions.", "Interview Questions": "Past relevant experience and few standard behavioral questions"}, {"date": "23 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at SE Health", "Interview Descriptions": "It was a one on one interview involving the standard questions an applicant would encounter during an interview for a Registered Nurse position. I was essentially hired on the spot.", "Interview Questions": "Describe your previous experience."}, {"date": "1 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SE Health (London, ON) in Sept 2016", "Interview Descriptions": "Face to face interview with a supervisor at the job location. Standard interview questions, review of the job requirements and skills, salary, benefits etc. The interview took about an hour to complete. The supervisor was very pleasant and helpful.  There was only one person doing the interview and it was quite casual.  In other interviews that I have had, there were often two or more people doing the interview.", "Interview Questions": "Did I have any hobbies or interests"}], [{"date": "4 Aug 2016", "title": "Client Information Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at SE Health (Cambridge, ON)", "Interview Descriptions": "The interview was as a regular interview. it was started at phone by HR, face to face by hiring manager, and then panel hiring manager plus some senior colleagues.\r\nThey were fast and efficient. they asked the salary range, your strength and weaknesses. tell me about yourself. as far as i'very remembered. I got more or less 10 questions. \r\nInterview was organized and professional in a way. they have dress code to follow during that like business attire.", "Interview Questions": "what do you think you ate fit in this job?"}, {"date": "29 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SE Health (Ottawa, ON) in Aug 2016", "Interview Descriptions": "Very casual. Did phone interview first, then met in person. Be honest with what you are looking for because they are always hiring and always have positions open. If you don't want to do visit nursing - don't offer. Wait for shift nursing if that's what you want. They understand - visit is hard and can be stressful. Be prepared to have lots of documents to bring in for orientation if you get an offer - drivers license, insurance coverage on vehicle, police record check, prior nursing hours to justify salary, etc.", "Interview Questions": "Previous nursing experience"}, {"date": "1 Jun 2016", "title": "Client Information Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at SE Health (Cambridge, ON)", "Interview Descriptions": "The interviewer was lively and engaging. Happy and enthusiastic. It was a good interview. The questions were clear and pertinent. The interviewerror was not at all intimidating. Quite friendly and open.", "Interview Questions": "Strengths and weaknesses"}, {"date": "30 May 2017", "title": "Administrative Staff Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SE Health (Markham, ON) in Nov 2015", "Interview Descriptions": "Screened by phone by an HR representative. After this, the entire process felt very disorganized and informal. That can be good or bad, but in this case, it felt bad. I was interviewed by a consultant who then informed me that she wasn't even supposed to be interviewing me. During that very same face-to-face interview, she called a director and had her interview me over the telephone. The process felt odd and disorganized.", "Interview Questions": "How would you measure the performance of a call centre?"}, {"date": "18 Oct 2018", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at SE Health (Toronto, ON) in Oct 2015", "Interview Descriptions": "First there was a telephone interview general questions were asked, and once you pass that process they moved forward to a in person interview. The interview was an average of about 35 mins in length.", "Interview Questions": "Describe an incident that occcured where you had to report to a supervisor?"}, {"date": "13 May 2019", "title": "Inbound Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at SE Health (Hamilton, ON) in Sept 2015", "Interview Descriptions": "The interview was long and the scenios were not real life. ALL i can remember is the two women were smug and they thought they were Queen Sheby.  All I can  remember that I was uncomfortable about the whole interview.", "Interview Questions": "N/A"}, {"date": "1 Jul 2015", "title": "Benefits Human Resources Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health (Toronto, ON)", "Interview Descriptions": "Applied online through company website, was emailed to set up a pre-screen, was scheduled for an in person interview with the 2 interviews; a director and a manager, had to do a data entry test. This organization requires 4 references for their background/reference check process.", "Interview Questions": "Why should we pick you?"}, {"date": "28 Apr 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at SE Health (Toronto, ON)", "Interview Descriptions": "Was extremely simple, at the time the company desperately need to fill nursing vacancy. They continue to need more people as turnover rate is very high. I applied online and was immediately contacted through e-mail within 24hrs. The interview was scheduled quickly within the same week. I was hired on the spot by the supervisor/manager and orientation began 2 weeks after.", "Interview Questions": "Why do you want to work for Saint Elizabeth?"}, {"date": "27 Jun 2017", "title": "Personal Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at SE Health (Kingston, ON) in Mar 2015", "Interview Descriptions": "I had the best interview experience in my life. I sat down with my (potential) Supervisor, and I ended up taking over the interview. I started asked her questions about the company, the job role, and even herself. I then apologized at that point that, I tend to talk a lot when I am excited, and take over the interview. She said \"That's great! Go ahead!\", through down her clipboard on the table, and I continued to interview HER and the company. We laughed, discussed pertinent topics, and I was then hired on the spot. (Note: I have another excellent Supervisor now). I remain to be very happy with this company.", "Interview Questions": "What methods do you practice to handle your clients?"}, {"date": "9 Apr 2014", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at SE Health", "Interview Descriptions": "The whole process was 3 days with 2 round of interview. Interviewed by manager and HR", "Interview Questions": "When can you start if we offer a position to you"}], [{"date": "13 Feb 2014", "title": "Senior Business Operations Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SE Health", "Interview Descriptions": "Telephone interview process took about a week.", "Interview Questions": "Mostly behavioral questions. I feel that the interviewer I got seems a little over board, not very friendly, asking what were I were doing during your free time? and also, How do you know about the company when you don't even know anyone in the company? something like that... of course... It's standard, you research the company before applying. "}, {"date": "13 Feb 2014", "title": "Senioer Business Operations Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SE Health", "Interview Descriptions": "Application and telephone interview took a week.", "Interview Questions": "I think the interviewer is a little over board, not too professional. She asked what you do during my free time and how did know about the company when you don't know anyone there? it's a little odd questions to ask when of course you do research about the company before you apply. "}, {"date": "10 Sept 2015", "title": "Community Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health (Vancouver, BC) in Jan 2014", "Interview Descriptions": "I applied online and was called in for an interview in a few weeks. I got the job immediately after the interview and filled out the paperwork in the office.", "Interview Questions": "How would you react if you saw a client had a very red and itchy rash on their legs?"}, {"date": "30 Nov 2016", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at SE Health (Ottawa, ON) in Oct 2013", "Interview Descriptions": "Very relaxed interview process. There will be a supervisor and the HR rep. Common questions that require examples from previous experiences. Straightforward questions. There were no trick questions. Couple pages of true/false questions like is there anything that would cause you to not pass the securities check. At the end they ask for 2 references but they did not call my references due to I was referred by a current employee there.", "Interview Questions": "Explain a situation that caused you to make a decision on the spot and how did it turn out?"}, {"date": "12 Aug 2016", "title": "Personal Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SE Health (Ottawa, ON) in Sept 2013", "Interview Descriptions": "You fill out an application online, and then someone calls you on the phone, even though I specified I am extremely hard of hearing and prefer in person or by email, they still called.\r\nThen you go into the office if you pass that one and they ask you to bring all of your documentation and ask you questions about the job and how much you know about the company.\r\nThey call you back within a week.", "Interview Questions": "How would you handle an aggressive client?"}, {"date": "1 Nov 2016", "title": "Client Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at SE Health (Vancouver, BC) in Jul 2013", "Interview Descriptions": "I was asked the standard interviewing questions. The HR manager was very nice and asked me about my previous work experiences in hospitality management. It seems that they are looking for candidates that are good with people.", "Interview Questions": "Did I have previous experiences working in similar settings?"}, {"date": "8 Aug 2016", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at SE Health (Toronto, ON) in Mar 2013", "Interview Descriptions": "The selection interview process was professional. The Recruiter was very informative about the organization.There was a pre-screening phone interview and then an interview with two individuals from management. My references were checked and I had to complete a criminal background check.  I was offered the position and received an Agreement which I needed to have signed and witnessed.  The Agreement was not very welcoming as it was about 7 pages in length with a large section of termination content.", "Interview Questions": "The interview questions were typical."}, {"date": "23 Nov 2016", "title": "Health & Safety Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at SE Health (Markham, ON) in Mar 2013", "Interview Descriptions": "Very professional and the interviewers were very friendly and approachable. They gave very specific examples during the interview process. As well, the interviewers gave enough time for me to reply the answers.", "Interview Questions": "My Health & Safety background and experience."}, {"date": "24 Feb 2013", "title": "RN/Visiting Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SE Health (Mississauga, ON) in Sept 2012", "Interview Descriptions": "HR personnel from corporate office sets ups interview.  Interview with Supervior and if hired show up for orientation with appropriate paperwork. HR will set up back ground checks", "Interview Questions": "None"}, {"date": "1 Jun 2015", "title": "Community Health Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at SE Health (Toronto, ON) in Jan 2012", "Interview Descriptions": "Interviewed with manager and senior coworker. Informal interview. Was asked about previous experience with respect to position-specific education, skills, education and personal experience. Found that certifications and registrations with professional organizations held considerable weight during this interview. The interviewers did not provide very good information regarding the culture of the department or team and were primarily focused on how quickly the position could be filled with the shortest amount of time for training and orientation.", "Interview Questions": "Why do you want this position?"}]]