[[{"date": "13 Jun 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "It began great and then the last person to interview was extremely short and borderline rude. It was so pleasant going in, but one could tell she was trying to get out of even interviewing me. Odd overall experience.", "Interview Questions": "Tell me more about yourself - the typical generic one."}, {"date": "25 May 2023", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Quick turnaround between interviews, spoke with four people individually and one group of four, was asked scenario questions, be prepared to share career trajectory ambitions, read about interviewers ahead of interviews - because it's an academic institution, interviewer may have publications or other pieces of their work that is public", "Interview Questions": "What is your goal in your career over the next 5 years"}, {"date": "14 Mar 2023", "title": "LSRP 1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "It was a casual interview with people who were easy to speak to. They did ask some technical questions and about certain areas of expertise, but with prep time, those aren't too hard to answer.", "Interview Questions": "If a teammate was slacking behind on a joint project, how would you go about handling the situation?"}, {"date": "13 Mar 2023", "title": "Crca Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "interview process varies between different labs, but generally one interview with hiring manager, one interview with CRC panel, and one interview with faculty. hear back quickly after apply (1-2 weeks), and interviews were scheduled 2 weeks apart", "Interview Questions": "The interview with hiring manager was basic behavioral questions. CRC panel was more friendly and was more of a chat. Final interview with faculty is more on the lab."}, {"date": "20 Feb 2023", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Very standard interview process. Asked about my previous research experiences and why I was interested in the role and lab in particular. Questions were mostly technical, but also a few personality questions.", "Interview Questions": "Describe a challenge you've faced during your research and how you solved it."}, {"date": "30 Nov 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Stanford School of Medicine", "Interview Descriptions": "It was a long process. There were around four rounds of interviews, virtual and in-person. I met with the hiring manager and other members of the department. There were delays in follow-up.", "Interview Questions": "Why would this job be a good fit?"}, {"date": "5 Jul 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine", "Interview Descriptions": "2 rounds of interviews, one with HR and one with the hiring manager. Both of them were onsite. Very quick decision after a few days. Very quick background check and processing of the documentation.", "Interview Questions": "Why do you want to work for us?\nWhat will you bring to the team\n?"}, {"date": "23 Oct 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Jul 2022", "Interview Descriptions": "Pretty simple interview process, but asked a lot about leadership style, work style, and what your future plans. Also be prepared to let them know how many years you are looking to commit to.", "Interview Questions": "Q: Describe a challenge you have faced and how did you overcome it."}, {"date": "18 Aug 2022", "title": "Clinical Data Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine (San Juan, PR) in Jun 2022", "Interview Descriptions": "Interviewing process went great. The team was very outgoing and it seemed like a very casual conversation. The only bad thing is the response time. The questions were very general.", "Interview Questions": "How do you cope with stress?"}, {"date": "5 Apr 2022", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine", "Interview Descriptions": "First, I received an email from a recruiter asking for my availability for a phone call. Next, I received the phone call where my resume and experience was discussed as well as the position.  For the next part of the process, I completed a one-way interview, where I recorded myself answering several questions.", "Interview Questions": "Do you have any experience in data analysis?"}], [{"date": "27 Apr 2022", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Mar 2022", "Interview Descriptions": "There were four one-on-one interviews with individuals. The first interview was a telephone call with the HR rep for the School of Medicine, then I met with the HR rep for the department on Zoom. Then I met with administrator who I would have reported to on Zoom, and finally I met on Zoom with the faculty member who seemed to have the most influence on who would be hired. The first three interviews focused on my resume and why I wanted the job, and the final interview with the faculty member was focused on my plan for tackling issues in the department. It turns out that there was an inside candidate who was offered the job.", "Interview Questions": "Why did you leave your previous job? "}, {"date": "8 Feb 2022", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Easy straightforward. Behavioral questions. One phone screen then panel interview. Offered position next day. Know your team and study interviewers well, should not be too tricky. Overall a fine experience and not too bad.", "Interview Questions": "How do you prioritize tasks"}, {"date": "2 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Feb 2022", "Interview Descriptions": "Smooth and simple interview process. Usually a phone screen or virtual interview with the clinical research manager, then the principal investigators along with potentially the rest of the team. Very transparent about the role and responsibilities.", "Interview Questions": "What do you find the most difficult about your current job? \r\nWhat are your future plans? \r\nAre you comfortable working with little to no guidance? "}, {"date": "8 Feb 2022", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine in Jan 2022", "Interview Descriptions": "Video interview submission, spoke with sourcer, phone screening, interview with hiring manager, department head, and then two other team members. The most time consuming part was definitely the video interview.", "Interview Questions": "Why do you want to work at Stanford?"}, {"date": "26 Oct 2021", "title": "Administrative Associate II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford School of Medicine in Oct 2021", "Interview Descriptions": "Super friendly and down to earth interviewers. Two rounds of interviews: one phone and one over Zoom. The interviews were supposed to be about 30 minutes but lasted about 45 minutes to an hour.", "Interview Questions": "What would you say is one of your shortcomings?"}, {"date": "30 Jun 2021", "title": "Life Science Research Professional I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Researchers were very attentive and did not pressure me to dictate their research back to them. Recruiters in general are very responsive and dedicated to assisting in the job search.", "Interview Questions": "How did your undergraduate research prepare you for this position? \r\n"}, {"date": "11 Jun 2021", "title": "Basic Life Science Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine in Jun 2021", "Interview Descriptions": "I applied online and got an email to the Zoom interview. I was interviewd by the Principal Investigator of the lab. After 2 weeks they call me for an in person interview. where I had an interview with other researchers from the group", "Interview Questions": "About me visa type\r\nmy employment authorization\r\nand other topic related questions"}, {"date": "13 May 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Sat down with three separate interviewers, individually. Was walked through the job scope, and daily responsibilities, expectations, etc. Good interview questions. Overall a good, straightforward experience, with fair interview questions.", "Interview Questions": "Where do you see yourself in 5 years?\r\n\r\nWhat is a time where you were faced with a challenge at work and how did you overcome that challenge?"}, {"date": "28 Apr 2022", "title": "Life Science Research Professional I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in May 2021", "Interview Descriptions": "Multiple rounds with different staff. Basic questions about my background. Looking for a long term commitment, interest in the girl, and commitment to work. Asked about my five year plan.", "Interview Questions": "Do you have experience in a lab? "}, {"date": "25 Jun 2021", "title": "Clinical Research Coordinator Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in May 2021", "Interview Descriptions": "Relatively easy, they asked about my past experiences working with vulnerable populations (the population I would be working with in the position) and asked me whether I had lived experience  or research experience with the research area. Also, they asked me how my remote working style was.", "Interview Questions": "Describe your working style during the pandemic."}], [{"date": "14 Apr 2021", "title": "Associate Administrator III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Two calls to start, one with just 1 person to screen onto next step, one call with three members of the team, including support staff and those you would be supporting, and  one in person. Everyone was extremely welcoming and honest about expectations and role.", "Interview Questions": "There were typical questions regarding support of staff, scheduling and what-ifs. "}, {"date": "13 Apr 2021", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Well-coordinated process overall - seamless communication and responsiveness. Compared with an interview process at another institution (at which I also received an offer), my experiences during the interview here were top-notch and were a contributing factor to my deciding to take this offer.", "Interview Questions": "What are the biggest challenges you foresee in the role for which you are applying?"}, {"date": "29 Mar 2021", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Excellent. Stanford really takes care of you through the interview process including setting you up with students to stay with, giving you scheduled events to see the campus/hospital, and ordering delicious catering. And their medical school takes care of you the same when you come for school.", "Interview Questions": "MMI questions focused on ethics, healthcare/medicine for non-practitioner, and personal experience."}, {"date": "6 May 2021", "title": "Creative Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Menlo Park, CA) in Mar 2021", "Interview Descriptions": "Efficient,  clear,  well-organized. First, an online self-recording of prewritten questions. straight-forward although a bit intimidating to do for the first time. Next zoom interviews, first with hiring manager and team.", "Interview Questions": "Do you prefer working alone or in a team?"}, {"date": "23 Nov 2021", "title": "Clinical Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Feb 2021", "Interview Descriptions": "I applied online and received an email for a zoom screening with the department's recruiter. She was very charming and allowed me to ask questions about the role.\nThe next part of the process was a bit chaotic. Instead of having a paneled interview, I received separate interview invites with the clinical research manager and each PI. They ask similar questions: your relevant experience and what you want to gain from the role and future plans.", "Interview Questions": "Situational:\nWhat to do when you have a conflict with a colleague and have you used their online data base system.\n"}, {"date": "27 Oct 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Dec 2020", "Interview Descriptions": "Interview was first with the HR recruiter and then I did a video with question prompts. The video was sent to hiring managers and they would contact me individually to set up their own interviews. Overall, I had a great response but be prepared to do a lot of interviews. Not only with the different departments, but with different entities within those departments.", "Interview Questions": "1) Name a time where you went against your supervisors request? \n2) Why do you want to work here?\n3) What experience do you have in clinical research? \n4) Are you familiar with EPIC?"}, {"date": "24 Nov 2020", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Was a super quick interview and covered basic questions. Reviewed my resume and discussed all my relevant technical skills and how my prior experience will help me with the job that I was applying for.", "Interview Questions": "How do you see yourself working with a group?"}, {"date": "28 Oct 2020", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine (San Jose, CA)", "Interview Descriptions": "1. Applied and received an email 2 weeks later to set up an initial phone call. \n2. After initial phone call I was asked to video chat with a current admin assistant in the department (the next week)\n3. 4 more video interviews on separate days with faculty members. \n4. Received a generic “we won’t be able to move forward with your application” \n\nIt would be nice if an explanation was offered. The process took a little over 5 weeks from date of application.", "Interview Questions": "Talk about a time where you faced conflict in your role and how you solved it"}, {"date": "11 Oct 2020", "title": "Administrative Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine", "Interview Descriptions": "Took a few weeks to get back to me. Started off with a SparkHire interview, which took about a week until I heard back. Then moved on to a Zoom interview for the second round.", "Interview Questions": "Briefly describe your experience as an administrative assistant?"}, {"date": "1 Oct 2020", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine in Sept 2020", "Interview Descriptions": "I applied through the Stanford Careers Website and two weeks later I was invited to interview via Spark Hire, a one-way video interview  process. After I submitted, I was told by HR if the Hiring Team wanted to speak to me, they would reach out.\n\nSix weeks later I learned through the website that I was \"No longer under consideration.\" I left very unimpressed with the impersonal handling of the interview process.  A simple \"No thank you\" rejection email would have something at least.  Given the all the hours and energy in prepping for the Hire Spark process,  a canned rejection email could have been the minimum the did, but no.", "Interview Questions": "What’s the most challenging initiative you’ve completed? Why was it challenging and how did you manage it? What was the result?\n\nWhat are you most proud of in your career?\n\nHow would  your staff describe your leadership style?\n\nDescribe how you’ve dealt with a difficult client or employee?\n\nDescribe your experience working multiple collaborators/institutions and stakeholder organizations. \nInclude any details on particular techniques or skills to keep engaged and accountable.\n\nHow do you go about building relationships with team members, faculty, and other stakeholders?\n"}], [{"date": "14 Dec 2019", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA)", "Interview Descriptions": "Let me start this review by stating I have applied for 15+ clinical research positions since the summer that primarily resulted in no follow up. This review is specifically for a Clinical Research Assistant position in the Department of Neonatal Medicine. \r\n\r\nIn early October, the research manager emailed asking me to submit a cover letter and resume, which I did the same day. I had a phone interview about a week or two later, where she asked me about my background. She said she would follow up early next week regarding the next steps, but she called me a few hours later inviting me to an in person interview. The in person interview was a few days later, which consisted of her and two other staff members with whom I'd be working (one was there virtually). Some of the initial questions the research manager asked during the phone interview were asked by the other staff as it was their first time meeting me, but again pretty straightforward questions about my work experiences and skills. \r\n\r\nI received an email from the manager two days later letting me know they went with a candidate who has direct research experience. As disappointed as I was not to receive an offer, I wasn't too surprised since I was told they interviewed a lot of candidates. Interestingly enough, the manager told me during our phone interview that she liked my non-traditional background (I'm starting a post-bacc in January as I have a non-science degree and prior work in education) when I asked what stood out to her about my application. Also, she said this position was \"entry level.\" My guess is that while my non-traditional background was impressive to her and the other interviewers, when it came down to actually choosing a candidate, they wanted someone with research experience so they could spend less time training someone.", "Interview Questions": "Tell me about yourself?"}, {"date": "10 Dec 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine", "Interview Descriptions": "There was a 30 min Phone or Zoom Interview followed by an innperson interview. The initial interview is informal as in it is mainly a getting to know you interview. There are no technical questions", "Interview Questions": "How would you build a long term relationship with a patient?"}, {"date": "15 Oct 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine", "Interview Descriptions": "I believe I heard from the interviewer for an interview invite after a couple of weeks. It was very short and concise, but the interviewer was friendly and warm.", "Interview Questions": "Tell me more about your experience in _. "}, {"date": "6 Aug 2019", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine", "Interview Descriptions": "Took 1-2 months for my application status to be updated/reviewed. Interview happened immediately after review (within same week). I interviewed with two administrative staff and two doctors in one day. They reviewed my references the following week, received off at the end of that week.", "Interview Questions": "Career goals/outlook"}, {"date": "27 Jul 2022", "title": "Clinical Research Coordinator Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stanford School of Medicine (Palo Alto, CA) in Aug 2019", "Interview Descriptions": "A lot of phases ( HR, Manager, PI, and team.)\nNothing special, just interested in how much the candidate knows about the job, how the candidate handles conflicts.  For a CRCA, most of the questions are behavioral questions.", "Interview Questions": "How did I organize my work day? How did I pick up the priorities? How did I handle conflicts among the team? What was my previous experience? If I was able to learn and work independently?"}, {"date": "14 Sept 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Stanford, CA) in Jul 2019", "Interview Descriptions": "To be able to clearly convey the process I was led through after 11 interviews and 11 round trip Uber rides that exceeded $220.  Plus the 4 hours I missed of work ($260)..grand total =$ 580\r\n1. first interview was a video interview\r\n2. video interview\r\n3. 2 in-person interviews - chief of staff and operations mgr\r\n4. panel interview at another location\r\n5. Chief of staff relayed that a panelist provided feedback that included a false accusation that is so far from the truth, I withdrew my candidacy\r\n6. phone call with HR Team that knew i withdrew and asked me to move forward at another dept\r\n7. In-person interview with HR Team and Assoc Dean\r\n8.  another in-person interview different day with HR and a panel\r\n9. interview during lunch break with assoc dean of facilities\r\n10. circled back again with the first office I initially interviewed with as she seemed to be in charge of the entire process since she seemed to have blocked my path into securing a job\r\n\r\nInterviews were held from June through August and took place on 3 campuses - stanford, redwood city and palo alto", "Interview Questions": "why Stanford"}, {"date": "10 Jul 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Stanford School of Medicine (Fresno, CA) in Jul 2019", "Interview Descriptions": "The recruiters send a one way video interview link through sparkhire and ask a multitude of questions ranging between 1 minute long to as long as you need to answer.", "Interview Questions": "Provide a brief description about yourself."}, {"date": "1 Jul 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Redwood City, CA) in Jun 2019", "Interview Descriptions": "First step was a general phone screening, followed by 2 team meetings one over skype and the other in-person. Lastly I met with the PI and was offered the position.", "Interview Questions": "How do you deal with Conflict "}, {"date": "20 Aug 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford School of Medicine (San Francisco, CA) in Apr 2019", "Interview Descriptions": "I applied for the position online. About three weeks later, I received an email to schedule a prescreen phone interview to talk about my experiences and see if they aligned with the position. As they did, the prescreening interview went well. The next day, I received an email to set up an in person interview. Since I was not available to fly out there for an in person interview, I did a video conference call with a few faculty members. I felt that everything went well. The hiring manager emailed me to let me know that I would receive an email to set up an in person interview when my schedule cleared up, but I never received one. After checking up with a follow up email to gauge how the process was going, I never got any responses or updates. I found out online that the position had been filled two months later.", "Interview Questions": "Describe your previous experiences and how it relates to this position."}, {"date": "6 Mar 2023", "title": "Patient Flow Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine in Mar 2019", "Interview Descriptions": "Quick phone interview - \"tell me about yourself\", \"why are you looking for a job\" In person interview - strengths, weaknesses, best characteristic about self, any schedule preferences / limitations", "Interview Questions": "Quick phone interview - \"tell me about yourself\", \"why are you looking for a job\" In person interview - strengths, weaknesses, best characteristic about self, any schedule preferences / limitations"}], [{"date": "14 May 2019", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine in Feb 2019", "Interview Descriptions": "It was a good experience. I had 2 times phone interview and one face to face interview.They asked me to provide a 15 min presentation about what I did before. They asked several question about my publication and my thesis.", "Interview Questions": "what is your background?"}, {"date": "2 Mar 2019", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine in Feb 2019", "Interview Descriptions": "Online one way interview through spark hire following application online and short phone interview. Video interview was to secure invitation to a hiring event in late May. Job not yet secured.", "Interview Questions": "What do you love about research "}, {"date": "27 Jan 2019", "title": "Senior Storage Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Stanford School of Medicine", "Interview Descriptions": "Met with hiring manager first. He liked our conversation and scheduled a on-site with extended team (DBA, Systems engineer). Finally had to meet the Director at the end of the interview.", "Interview Questions": "How do you troubleshoot a performance issue? "}, {"date": "11 Sept 2018", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine", "Interview Descriptions": "I interviewed with two different professors. \r\n\r\nWith the first one, I went in for a lab tour and they covered my travel costs. I thought the interview process went smoothly and they asked for letters of recs and said we'd be in touch soon. They were very nice and professional, however, they strongly hinted I'd get the position. They never contacted me to say I didn't get the position until I asked. When I asked for feedback, they said I was far too casual during the interview and my behavior was only appropriate for getting to know a person, not for an interview. \r\n\r\nDuring another interview for a different professor, I was asked to come in for an interview. They never communicated with me I was expected to give a presentation. I wasn't ready and gave a chalk talk instead. They changed my interview time the day before at 10PM and even though I showed up on time, the professor who requested the time change didn't even show up. I never heard from them again, even after I reached out to ask for feedback. Although they were also very nice in person, changing an interview time and then not showing up is extremely unprofessional.", "Interview Questions": "I don't believe there were any interview questions that stood out to me"}, {"date": "14 Oct 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Stanford, CA) in Sept 2018", "Interview Descriptions": "I found the research assistant job opportunity at Glassdoor website, and applied through Stanford career website.  After 1-2 weeks from application submission, I was contacted by lab coordinator to set up the interview schedule. I have the phone interview with the PI.", "Interview Questions": "What is the biggest mistake you have ever made and how did you overcome it?"}, {"date": "24 Sept 2018", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine in Aug 2018", "Interview Descriptions": "I had a 15 minute chat with the recruiter and the next process was for a hiring manager to take a look and contact me if they'd like to proceed or not. \r\n\r\ni was ghosted. \r\n\r\n3 to 4 weeks later i assumed they have definitely moved on decided to ask for feedback so that i can improve my self moving forward and the response i got was \"we decided to move on with other candidates\"\r\n\r\nSeems people have forgotten that a candidate weak or strong is a human being on the other side", "Interview Questions": "basic HR questions about experience, reason for leaving, location , etc"}, {"date": "30 Jul 2018", "title": "Administrative Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine", "Interview Descriptions": "Got a call for brief who are you and why does this position fit with your background. Then sometimes get an in person interview in a panel or 1 to 1. The experience itself is never bad, but a lot of times you wonder why if they're looking for a an experienced admin who they cannot pay (thereby posting a job for the level below) that they seeing my resume still decide to interview me?", "Interview Questions": "why do you want to specifically work in this department?"}, {"date": "31 May 2018", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in May 2018", "Interview Descriptions": "Conducted a phone interview with Dr. Cheng at Stanford School of Medicine. The interview consisted of describing my prior research experiences , my background knowledge in MRI , and discussing current projects in the lab.", "Interview Questions": "Do you have experience in programming (Python , Matlab, etc.)"}, {"date": "4 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Apr 2018", "Interview Descriptions": "Emailed the professor about my research interest. I got an interview to present my work in front of the research group for about 1 hour. Got an offer a week after. I accepted the offec about 2 weeks after.", "Interview Questions": "Tell me more about you? Why you are interested in my lab? Why Stanford? "}, {"date": "9 Aug 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Stanford School of Medicine in Apr 2018", "Interview Descriptions": "First interview with a post-doctoral scholar. Mine was over lunch.  Followed up by a callback for an interview with the principle investigator.  This followed by an email or phone call of acceptance and possibly another in person meeting with the principle investigator or post-doctoral scholar.", "Interview Questions": "How can your lab experience be of use to what we are studying?"}], [{"date": "2 Apr 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Mar 2018", "Interview Descriptions": "Initial Basic Screening Phone Interview with the HR rep within the Department.  Then an interview with the PI you'll be working with.  Fairly extensive interview questions with your PI, and will vary from field to field.", "Interview Questions": "Why do you want to get into this field?  How can you contribute to this field? "}, {"date": "18 Jan 2018", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Stanford School of Medicine (Sacramento, CA)", "Interview Descriptions": "super good enjoyed it there are three interviews first one is pretty easy they talked about what you expect from them. Second one they take you to a event to see how it is in person", "Interview Questions": "are you willing to take on management role?"}, {"date": "16 Feb 2018", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Jan 2018", "Interview Descriptions": "I applied through the careers portal, got a call in for an in-person interview 2 weeks later. The interviewer was very nice and professional despite his status. I was given the in-depth responsibility of the role I was applying for, as well as the whole interview process. I was informed that final candidates will have to go through another round of interview and will be keep in contact within a week or two. I was called back in for another interview with the Regional manager, and a phone interview with a faculty member, and again, the interviewers were very nice and professional. Over all,  it was a very decent experience. Every person I came in contact with was very friendly.", "Interview Questions": "How would you deal with a difficult personality?"}, {"date": "29 Jan 2021", "title": "Regulatory Affairs Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Jan 2018", "Interview Descriptions": "One interview with the recruiter and a video recording with questions. \nThe video was sent back to the recruiter and used to evaluate my experience.\nAfter that the recruiter got back to me with the results of the interview.", "Interview Questions": "Tell about yourself and your work experience?\n"}, {"date": "18 Dec 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine", "Interview Descriptions": "It is long very long and boring, and they do not make you comfortable. I do not know what to say. They make you think that you are going to be in the world greatest organization. But it is all false.", "Interview Questions": "N/A"}, {"date": "6 Apr 2018", "title": "Assistant Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Stanford School of Medicine (Stanford, CA) in Dec 2017", "Interview Descriptions": "3 Step Process: One with the HR Coordinator, one with a group of ACRC, and one with the actual professor. The first interview is a phone interview, which was professional. The second interview with the existing employees was very unprofessional. They did not seem like they knew what they were doing and acted like socially awkward college students. The third interview with the professor was decent.", "Interview Questions": "Do you have any experience working with patients"}, {"date": "14 Sept 2018", "title": "Administrative Associate III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Stanford School of Medicine in Oct 2017", "Interview Descriptions": "Fast interview process.  I only interviewed with my boss.  The whole process was less than 45 minutes. Worked with an external recruiter to get the interview. They preppwd me.", "Interview Questions": "What compensation are you looking for?"}, {"date": "21 Aug 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Aug 2017", "Interview Descriptions": "Conversational. Laid-back and pretty general questions. They really just want to know how you would work in a team and if you fit in with the culture of the workplace. Doing your research on the position before the interview is a must.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "20 Sept 2017", "title": "Quality Assurance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Aug 2017", "Interview Descriptions": "I first had a phone interview then heard back around a week after that that they wanted to schedule an in-person interview. A few weeks after that I had a half-day interview with 7 different people (my manager/project managers/directors) they asked pretty normal interview questions and asked about my skills and were all quite friendly and it didn't feel overly stressful.", "Interview Questions": "How would you handle conflict at work, like a coordinator or PI that was upset about a finding you made on their study?"}, {"date": "11 Jul 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine", "Interview Descriptions": "I applied through the online career portal, and received an interview request after 2 weeks. There was a group interview with the entire clinical research coordinator team, and then interview with potential PIs.", "Interview Questions": "What would you do if a patient is uncomfortable?"}], [{"date": "4 Aug 2017", "title": "Assistant Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Stanford, CA) in Jun 2017", "Interview Descriptions": "I received a phone call from the doctor within a few days of applying online.  After a few minutes she said she will email me with options to come in for an interview with the team.   On interview day, it was a 2 step process.  First with the doctor for about 15 minutes and then with the research team.   The doctor was lovely and engaged.  I felt it went well and that she was interested.  I was a little nervous and chatty but she seemed to enjoy our conversation and explained the hiring process.  Then I went to another room with 2 other team members, an assistant and tech person.   The assistant was very nice and asked appropriate questions.  The tech person was very unfriendly and asked me off the wall annoying irrelevant questions and kept rolling her eyes.  Only at that point did I feel this probably won't work out.  I'm glad it didn't as I wouldn't want to work with such a rude person.  She was rude from beginning to end, so I am assuming she had an issue with my cultural background as that is the only explanation for her behavior.  She had an uneasy rigid vibe to her.  The assistant was super kind and wanted to join her to walk me out and she rudely told her stay.  Even the assistant was confused by her tone.  I then went and shook the assistant's hand and said thank you.   Otherwise it was a great experience and I look forward to applying to more positions.   I'll add the helpful questions asked by the doctor and assistant below and not the ones asked by the rude tech person.", "Interview Questions": "What experience did you have with dealing with IRB?"}, {"date": "27 Apr 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Redwood City, CA)", "Interview Descriptions": "Did a 30-minute phone screen with a recruiter. The recruiter called me back within one day to schedule an in-person interview for the next week. I went in once to interview with the manager and a couple of my direct supervisors which took about 3 hours total. The next day, the manager called me to ask if I would interview with a few more people on a different campus which took another 3 hours. I received an offer within that week. Total time from recruiter to job offer = About 2 weeks.", "Interview Questions": "I see your CV and clearly you have experience. I would like to know more about you. What are your hobbies?"}, {"date": "20 Apr 2017", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Stanford, CA) in Apr 2017", "Interview Descriptions": "Was emailed to do an initial interview over Skype. Interview lasted for 30 minutes and was done with three of the study research members, who asked me about hypothetical situations and other experiences.", "Interview Questions": "Have you ever worked with a population of people with mental health disorders?"}, {"date": "10 Jan 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stanford School of Medicine (New York, NY)", "Interview Descriptions": "I had a phone interview with group leader, he asked about my research interests, and where do I see myself in 5 years, what projects I was interested in and why.", "Interview Questions": "What projects are you most interested in?"}, {"date": "31 Aug 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Jan 2017", "Interview Descriptions": "The process took around 1 month. I started sending email directly to the PI, and after sending out my recommendation letters, I got the response very quickly. I then did a one-day interview basically talking to labmates, and a presentation.", "Interview Questions": "Why I want to join the lab and what's the motivation for the move?"}, {"date": "5 Aug 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Dec 2016", "Interview Descriptions": "Phone Panel interview with three people for 30 minutes.  General skills and reason for why I chose this position.  Next level in person interview.  Half a day.  Three one on one interviews lasting 45 minutes to 1 hour. One was on strategy, one was on skills and the other was on interpersonal, and team aptitude.", "Interview Questions": "Situations and how you would respond to it"}, {"date": "13 Nov 2016", "title": "Life Sciences Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Oct 2016", "Interview Descriptions": "Applied online and got an email about an interview about a week and a half later. Interviewed by two postdocs in the lab via skype for about 20 minutes. Most of the discussion was about what their lab does and my prior research work. Received an offer at the end of the interview.", "Interview Questions": "Describe what you did in the previous lab you worked in?"}, {"date": "16 Mar 2017", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Stanford School of Medicine in Sept 2016", "Interview Descriptions": "Overall, a positive experience. In-person Interview. One on One. I was asked the question: \"Where do you see yourself in 5 years?\" and \"What are your greatest strengths and weaknesses?\"", "Interview Questions": "\"Where do you see yourself in 5 years?\" and \"What are your greatest strengths and weaknesses?\""}, {"date": "20 Mar 2017", "title": "Administrative Associate II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Sept 2016", "Interview Descriptions": "This position was specifically for the Urology Department. The interview lasted about 30 minutes and I met with a panel of four administrative employees. They began with basic interview questions, a brief overview of the position, and ended with my own questions and inquiry on the job position.", "Interview Questions": "How do you handle working with others who have strong or curt personalities?"}, {"date": "10 Jun 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stanford School of Medicine", "Interview Descriptions": "A standard postdoc interview - a talk plus a day of meeting with people in the lab or department. Most of it is more about sharing information rather then a quiz. People were really informative about Stanford and what it's like to live/work here. \r\n\r\nThe only unusual thing is I was asked to prepare a short research proposal as part of my presentation (slides only). This is becoming more and more common, and we've interviewed several people that were doing fine until they hit the proposal section. If you're asked to do it, give yourself plenty of time. It's deceptively hard.", "Interview Questions": "Most questions were related to my presentation."}], [{"date": "8 Jun 2016", "title": "IT Infrastructure Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Stanford School of Medicine (Stanford, CA)", "Interview Descriptions": "Interviews via phone and in-person, with immediate manager, colleagues, and extended colleagues. Code review, and extensive discussion of my past work as well as the work I would be doing at Stanford.", "Interview Questions": "I was asked to give an example of code that I'd written for an IT infrastructure task."}, {"date": "7 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Stanford School of Medicine in Apr 2016", "Interview Descriptions": "Skype interview (three of them), meeting with future colleagues, site visit, practical examination (techniques etc). Follow up interview (in person), more meetings with future colleagues. After that, more paperwork, questions, follow ups.", "Interview Questions": "Describe something that didn't work and how you dealt with that"}, {"date": "3 May 2016", "title": "Assistant Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Mar 2016", "Interview Descriptions": "Applied online. Contacted about in-person panel interview 3 weeks later. Panel interview with current ACRCs asking about resume, interests, and background, with a few situational questions at the end. Predictably, I didn't proceed to the second round interview (which would've been an interview with doctors you would've been working with). Really make sure you take time to answer situational questions well.", "Interview Questions": "Describe what you would do if someone who didn't know how to speak English came in, but you had to perform a procedure on them, and they weren't cooperating. "}, {"date": "1 Feb 2018", "title": "Health Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Stanford School of Medicine in Jan 2016", "Interview Descriptions": "three panel interview. it was about 30 minutes long and they each took their turn to ask and note down your answers. many of the questions were situational and what would you do in certain situations", "Interview Questions": "mostly about my college background and some personal questions about your character."}, {"date": "19 Feb 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Dec 2015", "Interview Descriptions": "I applied the position through online application system (October 2015). After four weeks, I got a phone interview invitation (November 2015). During the phone interview, the hiring manager ask basic questions and collect more information about candidate's background and experience. After I passed the phone screening, I received an email for the on-site interview. This is one-on-one type of interview with two hiring managers (December 2015). They asked more clinical research technical questions to determine whether the candidate qualify for the position and would be a fit for the position. The total interview time is 1 hour. You need to do a great job matching your professional experience with the position. Be calm and confident is the key. At the beginning of 2016, I received an invitation for the final stage of interview. For this interview, I am one of the two final candidates. I have the opportunity to meet with the entire clinical research group members as well as the medical director for the department. The total interview time is 1.5 hour. At this point, you need to show them your personality fits their group. After one week, I received a call from the hiring manager with oral offer for the position.", "Interview Questions": "Why are you interested in clinical research?\r\n"}, {"date": "21 Oct 2015", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Stanford School of Medicine", "Interview Descriptions": "Quick process. I met with the person I was to support and the interview was more like chit chat about our working styles and their projects. Prior to that Stanford has a very involved online job application tool. It's not very user friendly and does take a long time. Stanford uses salary and level codes that aren't very transparent.", "Interview Questions": "What is your background?\r\nWhat is your experience working in a fast paced environment.\r\nVarious scenarios based on the person's workload."}, {"date": "6 Apr 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Stanford School of Medicine (Stanford, CA) in Sept 2015", "Interview Descriptions": "Emails discussed background/availability\r\nFollowup interview in person at the lab, several behavorial but also required some conversation in basic science background which helped gauge my ability and understanding of their research as well as topics regarding research protocols and experiences with wet lab work.", "Interview Questions": "What are you hoping to contribute to the lab?"}, {"date": "11 Aug 2015", "title": "Assistant Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Jun 2015", "Interview Descriptions": "Randomly Got an email to schedule from my hiring manager to set up an interview. Surprised there was No phone screening. Came in for the interview and was interviewed by 2 (current) coworkers, basically about my background and how I am prepared for the role described. I was offered a job  a week later. I think I beat 5 other candidates. I Did a background check which took a week to process [hireright is total garbage], after that was offered a official offer letter and welcome package, and also scheduled my first day to work.", "Interview Questions": "What in your past can prepare you for this particular job?\r\nHow long can you commit to work here?"}, {"date": "21 May 2015", "title": "Research RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Stanford School of Medicine (Palo Alto, CA)", "Interview Descriptions": "I was interviewed by the manager and other co workers who all had a copy of my resume.  The interview was fairly informal. I was asked to give a more detailed description of my roles and responsibilities of my last job.  I was also asked about special projects that I participated in at my last job.", "Interview Questions": "Describe a situation that occurred in my last job that I was involved in that created a positive change for the work place."}, {"date": "19 Mar 2017", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Stanford School of Medicine (Stanford, CA) in May 2015", "Interview Descriptions": "it was straightforward. Wrote to the PI, got a phone/skype call, was invited to visit Stanford, gave a talk, had a long day of group interviews and presentations and eventually got an offer.", "Interview Questions": "N/A"}], [{"date": "27 Jun 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Feb 2015", "Interview Descriptions": "phone call, in-person interview, background questions around skills set, asked to speak with previous co-workers/managers.  was told HR would follow-up.  they did in 1 week, asked for references, did background check, made me an offer", "Interview Questions": "why do you want to work here"}, {"date": "1 May 2016", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Feb 2015", "Interview Descriptions": "Lengthy wait betw application and actual interview. A few folks called and a few wanted one on one meeting. Seemed a little disorganized in that several folks were unaware of who was meeting with me", "Interview Questions": "What are your weaknesses"}, {"date": "12 Jul 2016", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Stanford School of Medicine (Stanford, CA) in Jan 2015", "Interview Descriptions": "Interviews are fairly straightforward. They are looking for people willing to learn and will always ask you why you are interested in the specific position you are doing. As a student, they'll also want to know what you want to do with that position (e.g. - shadow physicians, work on your own projects, etc.).", "Interview Questions": "How will research help you with your future aspirations?"}, {"date": "4 Jul 2016", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine in Nov 2014", "Interview Descriptions": "Phone interview, in-person meeting. Fairly quick. Some confusion on their end of understanding the difference between graduation and doctoral defense dates. Overall, very responsive team, eager to get in a hire. \r\n\r\nPhone interview, in-person meeting. Fairly quick. Some confusion on their end of understanding the difference between graduation and doctoral defense dates. Overall, very responsive team, eager to get in a hire.", "Interview Questions": "What if you discovered an error in a manuscript after it had been accepted"}, {"date": "21 Sept 2016", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Stanford School of Medicine (Stanford, CA) in Jul 2014", "Interview Descriptions": "I had an interview with the Office Manager through an employment service company that was contracted through Stanford Univ. Then I was called back 2 hours later to interview with the head Research Doctor who talked to me for 5 minutes. I was called back that night and was offered the job.", "Interview Questions": "Can I work independently? Am I good at scheduling meetings between departments? Did I have any experience making travel arrangements for business travel?"}, {"date": "9 Aug 2016", "title": "Bio Statistician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stanford School of Medicine (Palo Alto, CA) in May 2014", "Interview Descriptions": "Ridiculously lengthy for such a low paying position. I had a phone screen and 3 separate in-person interviews. I got offered the job, but the salary was shockingly low and was in no way a living wage for the Bay Area (which has the most highest cost of living in the United States.)", "Interview Questions": "Are you comfortable working with wide data sets?"}, {"date": "26 Jun 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Apr 2014", "Interview Descriptions": "Phone interview and then got invited to in-person interview where I met the entire team. Phone interview was just an informal, 30 minute chat with lead project manager. She asked some background questions and interest on healthcare. In-person interview had me meeting several members of the team in 30-40 minute slots.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "26 Mar 2014", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine", "Interview Descriptions": "Applied directly to the PI with my resume and cover letter, stating my interest in the current research and several potential projects. Got a reply through email and several phone interviews later, I was accepted to join the research group. I got just about a year to get my own funding, which was successful in month 8.", "Interview Questions": "No difficult questions. Just about fit and capability to work."}, {"date": "3 Dec 2013", "title": "Office Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Stanford School of Medicine in Oct 2013", "Interview Descriptions": "The job was advertised internally at Stanford; a friend forwarded the email to me. I emailed the recruiter my resume and cover letter. After playing email tag for a bit, I had a phone interview with the recruiter. Then there was an in-person interview with both the recruiter and the hiring manager.", "Interview Questions": "What negative feedback have you received? "}, {"date": "22 Aug 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stanford School of Medicine (Stanford, CA) in Mar 2013", "Interview Descriptions": "First you have to take the GREs, and if they select you then they fly you over for interviews. Normally you meet with 5-8 professors over the course of 3 days.", "Interview Questions": "Tell me about your previous research."}], [{"date": "26 Apr 2017", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Mar 2013", "Interview Descriptions": "Lab pays for travel to interview.  A one hour scientific talk is given. 45 minute interviews with lab members and the principal investigator. Had a very nice lunch with all lab members.", "Interview Questions": "What are your career objectives after the postdoc?"}, {"date": "24 Oct 2017", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stanford School of Medicine (Stanford, CA) in Jan 2013", "Interview Descriptions": "I applied online and a couple of weeks later I got an email asking me to do a phone screen. From there, I was asked to come in for an interview. The interview was pretty casual and relaxed. It was a group interview so there were three interviewers present. It took about a week to hear back from them that they were offering me the job.", "Interview Questions": "They asked about my background and my experience, had I ever worked in academia before, why I wanted to work at Stanford, etc."}, {"date": "13 Nov 2015", "title": "Life Science Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Oct 2012", "Interview Descriptions": "Pretty straightforward, typical questions. It really depends on whether the interviewer can envision working with you. Every PI looks for different things so you just gotta be yourself. My boss was looking for someone who would do anything at lightning speed and accuracy... so that's what I delivered. \r\nStarted out with phone interview -- he missed the appointment twice and I had to email and phone to remind him, which foretold his management style... maybe I should've taken that as a hint. With PI's, you just gotta listen and say yes to everything basically. Not too hard.", "Interview Questions": "What is your ideal work environment?"}, {"date": "7 Aug 2015", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Stanford School of Medicine (Palo Alto, CA) in Sept 2012", "Interview Descriptions": "This is a highly individualistic process where you email your professors of interest. This also depends on your PhD mentors connection. The process varies from prrson to person but in general you have to do a presentation and spend the day with the lab of interest if you're invited for an interview.", "Interview Questions": "What are your lab skills. What are your career goals. Why this lab. How can you contribute. Do you have your own funding."}, {"date": "20 Jul 2014", "title": "Post Doc Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stanford School of Medicine in Aug 2011", "Interview Descriptions": "I met my supervisor throughout previous conferences (in the similar field). So he already knew who I was, and what to expect. That's the easiest way in to get into the lab - go to conferences, meetings, build collaborations.", "Interview Questions": "N/A"}, {"date": "14 Aug 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Stanford School of Medicine (Palo Alto, CA) in May 2009", "Interview Descriptions": "It was through an employee referral. No difficult questions were asked. Entire interview process took less than an hour.", "Interview Questions": "N/A"}]]