[[{"date": "23 Jun 2023", "title": "Part-time Student Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Easy! Very smooth for any job that you can find on campus. More-so looking for labor than they are for people qualified for most jobs. I have enjoyed every job I've held here!", "Interview Questions": "\"What are your expectations for this role?\""}, {"date": "26 Apr 2023", "title": "SQL Data Enginner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Apr 2023", "Interview Descriptions": "There were a total of 3 interviews. First was a hour long HR, technical background call with the hiring manager. Second was an in person hour interview with a panel of 5 to discuss your background and the position. I would consider this interview a behavioral one. Third interview was 2.5 hours in person. The hiring team provided case questions to bring and present to two different panels. Panel 1 was the technical team (one hour long), panel 2 was the business/stakeholders (one hour long), and lastly there was a quick 15 min chat with the overall director of the dept. Overall a really long but fun and easy interview process.", "Interview Questions": "There was an Oracle SP they provided and asked you how you would go about refactoring it."}, {"date": "26 Jan 2023", "title": "Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "It was just a simple Q and A process. Mainly to list what you've done in past and what you can serve the community to make the group better. What skill set you have is the more important part of it.", "Interview Questions": "What would be your spirit animal"}, {"date": "12 Apr 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Dec 2022", "Interview Descriptions": "The interview process was lengthy. I received a call from the recruiter first, then did a zoom interview, and then did a half a day of in person interviews. It took 4 months from application to the in-person round of interviews. The in-person interviews involved nine different people. After interviewing, I was told that I would hear something within 2 weeks. FIVE weeks later, I reached out to inquire if they had filled the position, and then I finally received an automated message back, stating they had selected a different candidate. Four months later, I received an invite \"encouraging\" me to apply for essentially the same job in another part of the University. I did apply, and quickly received an automated message back saying that my application was not selected for advancement. I was confused why I was encouraged to take the time to apply again, when my application was so swiftly rejected. I guess this is just how their automated system works? After preparing for and spending half a day interviewing in the final round, it would have been nice to have received at least a personal note of some kind saying I was not selected. I was not expecting this impersonal approach from an institution of this caliber, especially when many of the interview questions were centered around building relationships. If the university is seeking candidates with a high level of engagement, they should return the courtesy of providing human interaction during the selection and interview process instead of relying on automated systems.", "Interview Questions": "Coming from Industry, how would you handle the slower pace of academia? How would you go about building trust and relationships with students?"}, {"date": "3 Oct 2022", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Zoom meeting in which you meet with the search committee. In this you have to do an 5 minute presentation as if you was working in admissions already. Then the final round is meeting with the Dean.", "Interview Questions": "What is one of your biggest pet-peeves? "}, {"date": "7 Mar 2023", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at RIT (Rochester Institute of Technology) in Sept 2022", "Interview Descriptions": "The interview went well. The person I spoke to was very nice and it was a pleasant conversation. The only downside was that it took months for them to get back to me for an update. I had already gotten a different job by the time I heard back.", "Interview Questions": "Q: Asked about school experience"}, {"date": "23 Aug 2022", "title": "Janitor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "It was okay and straightforward. Ask a simple question and detailed expectations \nIt was okay and straightforward. Ask a simple question and detailed expectations \nIt was okay and straightforward. Ask a simple question and detailed expectations", "Interview Questions": "Are you punctual and trustworthy "}, {"date": "6 Mar 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at RIT (Rochester Institute of Technology) in Aug 2022", "Interview Descriptions": "It was a simple interview to get to know their students better and offer them a relevant field of work. Talking with professor's and understanding their research was the main objective of this interview process.", "Interview Questions": "What are your interested working in?"}, {"date": "22 May 2022", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Phone call screening with talent acquisition was first. He didn’t move me on. Was never told I didn’t get the job or that I wasn’t moving on. I never even had a chance to speak with a hiring manager. Ghosted. So unprofessional.", "Interview Questions": "Why do you want this job?"}, {"date": "22 May 2023", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2022", "Interview Descriptions": "I received an invite for a Zoom interview and met with the Director and another professor in the school. After the interview, I waited about a week and I was given an offer to sign.", "Interview Questions": "Q. What made you want to become a professor?"}], [{"date": "15 Aug 2022", "title": "Sign Language Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Apr 2022", "Interview Descriptions": "Very nice, friendly, welcoming; care about passion and work ethic. Some interviews are signed, some are spoken- it depends on the manager and their wants. An assessment is done prior to the interview with prompts A-E and E-A.", "Interview Questions": "Why do you want to work for that specific team"}, {"date": "7 May 2022", "title": "Office Assistant - Student Employment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2022", "Interview Descriptions": "I got considered for an interview after a colleague recommended me and also submitted my resume.  I received an email from the hiring manager of the department requesting that I come in for an interview.  I came into the office and was asked a series of questions relating to my personal qualities and abilities designated on the application.", "Interview Questions": "What experiences do you have that make you qualified for this position?"}, {"date": "29 Mar 2022", "title": "Food Service Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Feb 2022", "Interview Descriptions": "It wasn't bad. They just ask you about your past work experience, and this can be anything, ranging from normal minimum wage jobs to full time jobs. They respond back to you fairly quickly as well.", "Interview Questions": "What past jobs did you have?"}, {"date": "7 Sept 2021", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "The experience of the interview is bad, the guy didnt seem to care and did not ask a lot of questions. The interview is below 30 mins and questions are boring.", "Interview Questions": "Describe what is Ldap and how does it function"}, {"date": "28 Oct 2022", "title": "Financial Analyst (Co-op) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2021", "Interview Descriptions": "The interview process was simple and had only 1 round. I had an interview with the manager and a director. The interview was held on Zoom and was very chill.", "Interview Questions": "Q: Are you good in Excel because we use VBA and Power Query on a daily basis?"}, {"date": "6 Jul 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Very straight forward. easy fill out, easy interview, got the offer within the same day. if able everyone should work for RIT. just trying to get through this to see content on this site.", "Interview Questions": "what was your most complicated project?"}, {"date": "16 Feb 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at RIT (Rochester Institute of Technology) in Jul 2021", "Interview Descriptions": "It was not bad, just like a friendly conversation. They asked very standard questions, and facilitated the discussion. We probably just chatted for about 30 minutes, it could've been shorter but everyone liked to talk.", "Interview Questions": "What are some skills you have from previous work experiences"}, {"date": "17 Oct 2021", "title": "Career Services Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) in Jun 2021", "Interview Descriptions": "First it was a phone screen with a recruiter, then a panel interview, a presentation, and a couple subsequent phone calls with who would have been my supervisor. The job seemed great but I ultimately declined. The job was fully remote when I applied and during the interview process I was told that taking remote days would probably be their policy moving forward, post covid. But then the university opened up and wanted everyone in person and they couldn’t guarantee any remote days. So I declined.", "Interview Questions": "Create a presentation and pitch to us as though we are perspective clients"}, {"date": "6 May 2021", "title": "Assistant Manager - Tech Crew Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Three stage interview: HR phone screen, Zoom interview with search committee, and then on-site interview with 4 groups of individuals plus hiring manager and also a tour of campus and specific spaces. \n\nOverall the process was nice and streamlined, but responses were delayed even after a timeline was established.\n\nReceived a phone call to tell me they went with another candidate, a nice gesture but was expecting the phone call to be good news not bad.", "Interview Questions": "Why are you interested in working at RIT"}, {"date": "8 Apr 2021", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "It is fairly simple they just asked to make sure I knew what my responsibilities were and what the job would entail. Also asked me about my availability and I told them I would be available anytime which I think helped", "Interview Questions": "What do you thin your responsibilities are at this job?"}], [{"date": "5 Apr 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Very thorough and thoughtful interview process. Expected candidates to demonstrate comprehension of the role and asked excellent questions to test the candidates agility and understanding of responsibilities. Perhaps a bit long for some people's preferences, as there were 3 interviews and the last one took an hour plus.", "Interview Questions": "Why are you interested in RIT specifically?"}, {"date": "24 Oct 2022", "title": "Recreation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Apr 2021", "Interview Descriptions": "There were 2 rounds to the process. The first round is an elevator pitch where you sit in front of a panel of judges. the second you have a one-on-one behavioral interview directly with the manager.", "Interview Questions": "What would you say is your biggest flaw?"}, {"date": "17 Jan 2021", "title": "Senior Staff Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Interview was structured, fair, multi layered, and thorough. The process gave me a thorough understanding of the role. I was offered the role within a few hours of final interview and accepted.", "Interview Questions": "Why did I want to work there? "}, {"date": "23 Jan 2023", "title": "GTA Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2021", "Interview Descriptions": "My interview process was great! The faculty I spoke with very professional and friendly. We talked primarily about the position and the area around the school, and other faculty members roles.", "Interview Questions": "Why I would like to work at RIT, specifically"}, {"date": "4 Oct 2021", "title": "Purchasing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2020", "Interview Descriptions": "Interviewed with more than 10 people. Was told that i didnt get the position because i mentioned that I would like to advance within the company. They were looking for someone that would stay in that position for the rest of their career.", "Interview Questions": "Why a chose to apply to the position"}, {"date": "15 May 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "The phone interview was a half hour with a group of academic advisors, faculty members, and leadership (assistant dean). \r\n\r\nThe next and final step is an on campus interview. I participated in a half day interview meeting with other academic advisors, department chairs, assistant deans, and other faculty members. It was mostly Q&A, no presentations.", "Interview Questions": "They asked many questions about working with students and student development theory. "}, {"date": "2 Mar 2020", "title": "Dashboard Developer/Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Apr 2019", "Interview Descriptions": "The interview was conducted into three stages - Telephonic, 1:1 and behavioral. First two stages discussed my previous work in dashboard developing and last focused on work ethics. After the response it took 2 weeks to start working.", "Interview Questions": "Will you be able to work throughout the summer?\r\nWhat is the main reason to apply?\r\nWhat benefits will the skills provide you in future?"}, {"date": "27 Mar 2019", "title": "Intramural Referee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY)", "Interview Descriptions": "It was quick and got the job on the spot. The guy is very nice and engaged on what I had to say. I recommend everyone to try to be a referee. It is alot of fun.", "Interview Questions": "Have you referee"}, {"date": "25 Mar 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Being a graduate student at RIT and the position being from the same department, the interview process was very lean. The recruitment official, in this case the teaching professor asked general questions.", "Interview Questions": "The programming experience in the past"}, {"date": "15 Oct 2019", "title": "Telecommunications Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2019", "Interview Descriptions": "good. there were 3 rounds. One on phone and two  were in person. 1st round was easy they just asked questions related to my resume. 2nd was coding and last was technical related to my filed.", "Interview Questions": "about my background"}], [{"date": "27 Feb 2020", "title": "Cashier/Stocker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Dec 2018", "Interview Descriptions": "I walked in and asked if they had availability, and was offered the job. They then gave me a sheet of paper telling me what times were available. I let them know my availability and then took some health and safety online tests and was given a shirt and name tag.", "Interview Questions": "What shifts do you want?"}, {"date": "7 Oct 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "This process began with an email regarding the need to fill he Teaching assistant role, i responded and the process following was very simple. I met with the professor  in charge of the class, we discussed my experience and the position was offered", "Interview Questions": "did you have esperience with allen bradley PLCs"}, {"date": "3 Oct 2018", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "There was not exactly an interview process. Usually the professor asks you what do you do, what you are good at, and what you want to get from this research.", "Interview Questions": "What is your strongest programming language?"}, {"date": "1 Oct 2018", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2018", "Interview Descriptions": "Typical interview process. Applied online, then had a first round interview with typical interview questions. Then a second round interview which was much more informal, more of a best fit style questionnaire.", "Interview Questions": "Describe a difficult challenge and how you overcame that challenge."}, {"date": "20 Dec 2018", "title": "Senior Staff Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2018", "Interview Descriptions": "Phone screen interview with HR first, then an in-person interview with department. Then, building tour with department to meet others in larger group. Sat with manager and department head for interview. Walked around building. Overall, very good experience.", "Interview Questions": "Why do you want to work here? Where do you see yourself in 5 years? What could you bring to the position?\r\n"}, {"date": "17 Apr 2018", "title": "Lab Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "The interview process is pretty simple. You have a face to face meet up with the manager and talk about what the job will entail and if it'll be a good fit for you. They go over what classes you can tutor in and assign labs  and times you can work from there.", "Interview Questions": "what's your biggest flaw?"}, {"date": "11 Nov 2022", "title": "Assistant Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at RIT (Rochester Institute of Technology) in Apr 2018", "Interview Descriptions": "A 90 minute interview with small committee. Included a short presentation. Plenty of time for questions and answers at the end. The entire process was fairly laid back and friendly.", "Interview Questions": "What do you feel the most important aspect of student development is and how do you incorporate that into advising sessions?"}, {"date": "5 Apr 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2018", "Interview Descriptions": "Just a good grade in one of the course. The screening is quite easy. No questions asked. Pretty fair process and got an offer just after the job. I would strongly recommend applying over here.", "Interview Questions": "Grade"}, {"date": "4 Oct 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Oct 2017", "Interview Descriptions": "I first applied online on the department website. Then I asked the professor for a meeting. Spoke to the professor and expressed interest. Later Got recommended by the professor to the department and Got the job", "Interview Questions": "Do you have experience with similar type of course?"}, {"date": "30 Apr 2018", "title": "Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2017", "Interview Descriptions": "Basic questions regarding the subject and regarding the documents I had to work on campus.\r\nNot any other unrelated questions. It went smooth. No much difficulties. Nothing outside the subject. Professor was calm and so did not feel much stress during the inteview.", "Interview Questions": "Questions about the subject"}], [{"date": "10 Jun 2018", "title": "Intramural Referee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2017", "Interview Descriptions": "There was a lot of questions regarding people skills. How well you interact with people and how you would manage various situations. There were additional questions towards the end regarding prior experience. It was very a comfortable and relaxed environment.", "Interview Questions": "How many years of experience do you have?"}, {"date": "9 Sept 2020", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2017", "Interview Descriptions": "very low key and laid back because its not a tenure track position and I knew my hiring managers. I am also an alumni of the program so I was very familiar with the facilities and the expectations", "Interview Questions": "What is your teaching philosophy"}, {"date": "25 Jun 2021", "title": "Assistant PC Systems Administrator Co-op Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2017", "Interview Descriptions": "Seven interviewers, questions ranged from technical to \"how much time has passed since the start of the interview - without looking at your watch\". Straightforward, not difficult, reasonably personable. I got along well with the interviewer who would become my manager, and I had the needed experience from classes for the position.", "Interview Questions": "What time is it, without looking at your watch?"}, {"date": "14 Mar 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2017", "Interview Descriptions": "Professor asked me about my background and interests, gave me a paper to read and then I went back to discuss the paper with him. In academia it is very important to show research interest.", "Interview Questions": "What are your career interests?"}, {"date": "30 Mar 2017", "title": "Grader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (New York, NY) in Jan 2017", "Interview Descriptions": "The interview process was not difficult . it is just one on one interview with professor. it just went for 15 minutes. ther were no formal questions since I took the course under the same professor before an year. The main category of selection was based on who approaches the professor first.", "Interview Questions": "did you take the coursework and what is your grade"}, {"date": "13 Sept 2016", "title": "ITS- Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "A panel of 5 people interviewed me for about an hour. Some tricky technical questions along with few behavioral questions. Active Directory, SCCM, Linux, Power Shell scripting, experience with GPO were main topics. Few questions involving MAC support. The interviewers were all senior system administrators and made sure that I was comfortable all through the interview process. Was a very positive experience.", "Interview Questions": "Few linux commands for automation"}, {"date": "11 Jul 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2016", "Interview Descriptions": "Talked with the supervisor, he asked me a few questions about my qualifications and my previous experiences tutoring. Nothing technical, but mostly just questions to see if I would be able to work with students.", "Interview Questions": "Have you had any tutoring experiences before?"}, {"date": "16 Jul 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (New York, NY) in Aug 2016", "Interview Descriptions": "Smooth and creative process. Meeting in person with some professor and discussed my background experiences and the reasons that made me  interested in a specific research area. Friendly interview process", "Interview Questions": "What is your graduate capstone project?"}, {"date": "4 Mar 2017", "title": "Data Analysis Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2016", "Interview Descriptions": "About the past work experience. What is join, how to handle future queries. Tell me about yourself. How you handle the difficult situation. Difference between left join and right join . How you find the no of employees in a department.", "Interview Questions": "N/A"}, {"date": "5 Apr 2018", "title": "GRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology) (New York, NY) in Aug 2016", "Interview Descriptions": "The interview was brief, took like 5 minutes. Was asked what role I would like to take, GRA or GTA. What subjects I am good at. What my research interest is and under which professor I would like to work.", "Interview Questions": "What my research interest is."}], [{"date": "26 Sept 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2016", "Interview Descriptions": "The interview was very easy. The professor asked me to enter the room after which he asked about my experience in networking. He gave a printout of the labs that has to be done in class and asked me whether I know about them. A few networking and trouble shooting questions were asked. He said the result right away.", "Interview Questions": "List some trouble shooting techniques."}, {"date": "2 Mar 2017", "title": "Senior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at RIT (Rochester Institute of Technology) in Aug 2016", "Interview Descriptions": "You have to already be qualified as a technician and spent at least 3 months in that role before you can apply. Once your application passing the initial look through, you will be called for an interview.", "Interview Questions": "An example of dealing with a peer in a leadership role and balancing that relationship."}, {"date": "17 Oct 2017", "title": "Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2016", "Interview Descriptions": "The initial requirement is an A in the course for which you would like to apply as a grader and a simple interview with the professor has how you would grade multiple answers to a question.", "Interview Questions": "How would you grade multiple answers to a question from the coursework? "}, {"date": "6 Jul 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "In a few years, if there is global cut in funding in your specific \r\nresearch field, how do you deal with that? \r\n2. How does our school compare to other engineering schools? What can our \r\nschool bring you if you come here?\r\n3. How do you motivate different types of students/people?\r\n4. In your teaching experience, what went well and what did not go well? Why?\r\n5. How do you contribute to a supportive and inclusive environment at our \r\nuniversity", "Interview Questions": "In a few years, if there is global cut in funding in your specific \r\nresearch field, how do you deal with that? \r\n2. How does our school compare to other engineering schools? What can our \r\nschool bring you if you come here?\r\n3. How do you motivate different types of students/people?\r\n4. In your teaching experience, what went well and what did not go well? Why?\r\n5. How do you contribute to a supportive and inclusive environment at our \r\nuniversity"}, {"date": "24 Nov 2016", "title": "Graduate Technical Assistantship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2016", "Interview Descriptions": "It was short and precise. They had thoroughly read my resume prior to the interview and were totally prepared to ask what they were looking for. I was interviewed by a panel of 3 most skilled people in the CS department.", "Interview Questions": "1. Describe one of the projects from your resume(Mostly it would shell/perl scripting project). So be prepared.\r\n2. Which platform you are most comfortable with(They use ubuntu and solaris) so be prepared to give reasonable answers\r\n3. Which IDE do you like and why?\r\n4. Which changes would you like to bring if you get selected for this job role? (you may say something like what technologies computer science department is lacking and how you will implement that?)"}, {"date": "6 Feb 2018", "title": "Junior Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Apr 2016", "Interview Descriptions": "I worked at CIASTech department at RIT for almost 2 years. Interview process was excellent and all bosses were super chill. They know what they are doing and it was a great experience being a part of such great team.", "Interview Questions": "How important do you think customer service is for this role?"}, {"date": "19 Nov 2017", "title": "Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Feb 2016", "Interview Descriptions": "Applied online and I was scheduled for an interview with the system administrator. The interview was a one-to-one interview.  I found the interview to be straightforward.  I totally enjoyed my interview and found it interesting.", "Interview Questions": "Questions about computer science skills and also about configuring lab systems for students. "}, {"date": "13 Feb 2020", "title": "Content Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at RIT (Rochester Institute of Technology) in Jan 2016", "Interview Descriptions": "Overall, I had a very positive experience. I applied online through the student portal, interviewed in person, and received an email stating that I'd got the job! The 1:1 interview was more of a \"get to know you\" meeting.", "Interview Questions": "What is your greatest area of growth?"}, {"date": "3 Aug 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2016", "Interview Descriptions": "submit a CV. If interests and qualifications align. You will be called. Also, make sure to keep the prof informed about how you found them.  Look at the university website and applied and got a call", "Interview Questions": "mostly based on the resume you submit and interests."}, {"date": "19 Mar 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2016", "Interview Descriptions": "Graduate Teaching Assitant position application process starts with approaching the graduate advisor to ask if any GTA positions are currently open at that time. If the appropriate position is open and if your skill sets match the job description, you will be called for an interview. The interview process is not so hard. However, a short talk with the people who are currently working as GTA would really help a lot.", "Interview Questions": "How would you contribute to the professor if you are hired?"}], [{"date": "5 Apr 2017", "title": "Senior Audit Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (New York, NY) in Sept 2015", "Interview Descriptions": "Interview process is very simple, a manager and a supervisor interviewed me. The interview questions are typical behavior questions and they asked about past experience related with the position.", "Interview Questions": "Past job experience related with database"}, {"date": "7 Dec 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2015", "Interview Descriptions": "First we have to be recommended, then we will have an interview face to face with the professor who we are going to work with. And we have to show them either web or paper portfolio. We talk about my work experiences and who I work for in the past. Talk about personal opinion about this job.", "Interview Questions": "What's your major and background. Are you currently working on any project? Who did you work for?"}, {"date": "29 Jan 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2015", "Interview Descriptions": "General questions regarding interests and goals and knowledge in Electrical & Telecom Engineering from prior course work and/or projects completed with questions on availability and also introduced me to the research area I will working in.", "Interview Questions": "What research topics in Telecom Engineering"}, {"date": "27 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (New York, NY) in Aug 2015", "Interview Descriptions": "I have been interviewed by 4 people from computer science department, questions was easy and general. It was online. I dont know why this site force us to put lots of information and take our time to just give people some information. thats not fair at all.", "Interview Questions": "how you find our university\r\nhow you find your advisor\r\nwhat area you have done research "}, {"date": "4 Nov 2017", "title": "Inventory Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2015", "Interview Descriptions": "You access the university website first. They have postings that get updated daily. The supervisor's email is found there as well. Submit an updated resume. Also, attaching a cover letter helps. I received a reply the next day, and scheduled an interview for the day after. The interview was very straightforward.", "Interview Questions": "Why would you want to work here?\r\n"}, {"date": "3 Jan 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2015", "Interview Descriptions": "In 2010 I had an initial phone interview with the manager of operations. The phone interview went well and I got asked to come in for an in-person interview with the manager, assistant manager and supervisor.", "Interview Questions": "What is your management style like? How well do you manage conflict? Do you have any scheduling experience and if so please describe."}, {"date": "26 Jan 2017", "title": "IT Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2015", "Interview Descriptions": "Pretty basic behavioral questions.  First, phone interview, and set up with two of the employee for resume review, and ask my skills and experience. Then, I got hired, then they gave 2 weeks of training for the tools that they were using.", "Interview Questions": "- Have you done any SQL? How would you implement this design?"}, {"date": "16 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2015", "Interview Descriptions": "It was a great experience. I was asked lot of questions about my course work and projects i worked previously. The questions were straight forward ,basically i had to talk about  image processing projects. Professor made me very comfortable by asking questions about things i do apart school work and the place i am from.", "Interview Questions": "About my courses and projects"}, {"date": "25 Sept 2015", "title": "Graduate Research Assistant and Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2015", "Interview Descriptions": "I am a PhD student (5th Year) in the Golisano College of Computing and Information and Sciences. I am really interested in teaching and looking forward to a career in academia. I requested my adviser for teaching as an adjunct for Fall 2015 semester. After discussion with the Program chair, I was given the opportunity to teach the undergraduate and graduate section for Introduction to Computer Vision.", "Interview Questions": "Discussed about my research and my plan for teaching. Also discussed about my teaching interest and previous experience."}, {"date": "28 Aug 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2015", "Interview Descriptions": "Technical interview was conducted and find it intruiging. Interview went well and I got the result on next day. Got some technical questions about CAD and CFD, as the role is related to modelling and simulational analysis. Interview is somewhat difficult but the interviewer made it easy with his hospitality", "Interview Questions": "What s your experience with CAD and CFD"}], [{"date": "2 Dec 2016", "title": "Technical Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2015", "Interview Descriptions": "I found the job on Rochester Institute of Technology website. So I sent an email with my resume to an email which is on that website. Then I got email after several days. It lets me take to the interview after around 2 weeks. At that day, there are three people in a room. They asked me my experience and didn't ask me tech questions.", "Interview Questions": "There are three people in a room, they asked me what have I done before. And tell them some recent projects. They didn't ask me some specific tech questions."}, {"date": "28 Feb 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "There was only one interview. The interview was on site. I got a tour of the whole facility as well as the campus. It was very casual and easy going. They were really trying to make you at ease.", "Interview Questions": "Tells us about some of your past relevant experiences."}, {"date": "31 Dec 2015", "title": "Executive MBA Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Henrietta, NY) in Feb 2015", "Interview Descriptions": "It was conversational, just going through my work experience. I was asked if I had experience with printers, office work, etc and I expressed that I did. Three days later I received an email that I was the best fit and to come down to start the process. Overall the interview process was simple and did not require great lengths of preparation.", "Interview Questions": "Do you have any background knowledge with clerical duties?"}, {"date": "31 Jan 2015", "title": "Prospect Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Interview process was good. I was kept well informed during the process. The interview team was timely and courteous. Ithey seemed to genuinely care about whether the position was the right fit for me.  I did not have to wait long for a decision.", "Interview Questions": "How were you able to help guide a junior staff member who was very shy?"}, {"date": "24 Aug 2017", "title": "Photo Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2015", "Interview Descriptions": "2 person interview that took around 30 minutes.  Easy back and forth conversation.  Knew a few days later that I got the job.  Overall an easy and enjoyable process.", "Interview Questions": "Whats one thing you would change?"}, {"date": "7 Jan 2015", "title": "Student Experience Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Dec 2014", "Interview Descriptions": "First call to interview came in abut a month after my application was submitted.  Interview came in 3 phases: 1 phone interview with a group of staff (20 mins), 1 in person interview with the same group (40 mins) / interview with the dept chair (20 mins) and a final phone interview with an HR rep (10 minutes).", "Interview Questions": "Why do you want to work for RIT?"}, {"date": "20 Nov 2014", "title": "Rochester Institute of Technology Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Becoming a Grad Research Assistant is easy; you want to do research in a particular field? Find a faculty member that has the same area of research interests as you do. Go talk to him or her. Profit", "Interview Questions": "N/A"}, {"date": "5 Nov 2014", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "talked about how's your English ability and computer experience. and you just talked very freely with the interviewers. The most important part is that you are and animation graduate student of RIT.", "Interview Questions": "N/A"}, {"date": "7 Oct 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Related to the subjects, asked for examples for each question asked, application oriented. It was more on how would you use the knowledge in the real world. It was difficult as there were some examples that were to be used in day to day life", "Interview Questions": "0R example"}, {"date": "29 Sept 2016", "title": "Promotions and ZSocial Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Oct 2014", "Interview Descriptions": "Casual discussion of role and my competencies and ability to complete necessary tasks. I was recommended by another employer in the company so I had additional help and someone vouching for me in addition to the interview.", "Interview Questions": "Will you be able to work on weekend nights"}], [{"date": "7 Nov 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2014", "Interview Descriptions": "There was no huge process. It was just talking about my goals from the given project and discussion of my experiences with working on similar things. Once the professor heard out my ideas and my personal goals from the project, he was very impressed and helped me understand his project more. After that, I worked as a volunteer for a little bit and looking at my commitment, I started getting paid.", "Interview Questions": "Experience with technologies used in developing a game."}, {"date": "8 Aug 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY)", "Interview Descriptions": "This was the strangest interview I ever had. The director gave an hour and a half monologue about his history and what he wants to do in the department. He literally only asked me one question: \"Do you have a Master's?\" There was no congratulations, no checking up on my references, no asking for transcripts. I only received a date and time I needed to show up. No contract until a week after I had already been working there.", "Interview Questions": "There was only one question- \"Do you have a Masters?\" Not hard."}, {"date": "5 Aug 2014", "title": "Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "I was contacted by email by the director of the department and agreed to have an interview the following week (I had applied on the last day). The majority of the interview was spent describing the office and the position, I was asked only a few questions: the usual tell me about yourself, where do you see yourself in 5 years, have you taken classes with prof. X (used as screener), tell me about what you did in your previous jobs, do you see yourself staying in Rochester, and that type of stuff, nothing hard.", "Interview Questions": "questions weren't difficult or unexpected"}, {"date": "28 Dec 2015", "title": "Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2014", "Interview Descriptions": "The questions are not hard, as the job itself doesn't require any huge qualifications but to have done well in the class you wanna be a leader for. You won't be tested on your knowledge, but in your leadership and willingness to work with others. You usually just meet one on one with the supervisor and discuss why you want this position and why you feel you can grow out of this work experience.", "Interview Questions": "SI is one of the many great resources available to students here at RIT.  Based on your understanding of the SI model, what unique differences do you see between the role of an SI Leader as opposed to the equally important role of a Tutor or TA?"}, {"date": "10 Mar 2016", "title": "Mitgründer / Produktleiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2014", "Interview Descriptions": "very easy hiring process. I worked at Gracie's as a part time job on campus. Basic questions asked about yourself and how you would benefit them. The reply was spontaneous and was asked to join the next day.", "Interview Questions": "why do you want to work at gracies?"}, {"date": "14 Sept 2015", "title": "Global Front Desk Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Henrietta, NY) in Jul 2014", "Interview Descriptions": "Very casual, funny, upbeat and real. \r\nYou get a very accurate view of how management work in the department and they get a very accurate depiction of you.\r\nThe interview gives you an understanding of the office environment, you will be introduced to all of the staff and they will have the opportunity to get to know you a little bit. Once everyone is comfortable with you, then you will be offered a position.", "Interview Questions": "How do you react to dark humor, sarcasm and practical jokes?"}, {"date": "27 Jun 2014", "title": "Donor Stewardship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Had an initial phone screening with hiring manager and was very disappointed by her tone and style. Very unprofessional and appeared to be distracted.  I had to keep repeating myself and was asked virtually the same question several times. Did not leave me with a positive impression", "Interview Questions": "Nothing too difficult "}, {"date": "12 Nov 2016", "title": "Office Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2014", "Interview Descriptions": "Originally, it was a job interview for a part-time office job during the summer between school. A friend, referred by an employee, recommended me to work there and placed a good word for me with their employer. It was a quick interview, about a week long process for the background check from Human Resources, then accepted and started immediately. Great experience.", "Interview Questions": "How many hours are you able to commit to this part time job?"}, {"date": "28 May 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2014", "Interview Descriptions": "Submit resume and wait and wait and wait.  Finally, three months later you get an e-mail saying that you are being considered and that you can attend an in-person interview.", "Interview Questions": "What is your relevant experience?"}, {"date": "24 Apr 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY)", "Interview Descriptions": "I saw a post on the RIT Student Employment Office website and I applied by email. I received a response within two days and I had my interview scheduled for the following week. After the interview I was given a offer the next day and I started working the week after.", "Interview Questions": "Nothing unexpected was asked. Very standard interviewing process."}], [{"date": "31 Mar 2014", "title": "Computer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY)", "Interview Descriptions": "They asked a lot of behavior questions and there are 5 or 6 people in the interview process. But it felt pretty casual conversation.", "Interview Questions": "No Technical Question"}, {"date": "26 Mar 2014", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "i actually just had to track down and hound this professor until he finally gave me the job", "Interview Questions": "do you have funding?"}, {"date": "9 Mar 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at RIT (Rochester Institute of Technology) in Mar 2014", "Interview Descriptions": "Normal basic questions about the projects. Question related to work experience, material knowledge, subject knowledge. Since, the position was related to Lab Instructor, I was asked question regarding equipment's, various standards, equipment usage etc.", "Interview Questions": "What work related problems did you encounter?"}, {"date": "20 Feb 2014", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "Skyped, met and was offered a position", "Interview Questions": "Discussing research goals"}, {"date": "24 Jan 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at RIT (Rochester Institute of Technology)", "Interview Descriptions": "One interview with the professor. Filling application form for phD program. It was not real interview.", "Interview Questions": "No unexpected question."}, {"date": "17 Mar 2016", "title": "Box Office Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Oct 2013", "Interview Descriptions": "The interview process was really straightforward. I scheduled my interview via email, came in for a one on one and was offered the job by the end of the week.", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Nov 2016", "title": "Student Parking Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2013", "Interview Descriptions": "I was alerted of an interview last minute, and showed up in a T-shirt and Leggings. I was not sure what would be asked, and I was not exactly sure what I applied for until I arrived in the office. I was set on saying no as I'd already had another job, but the amount of flexibility won me over.\r\n\r\nVery easy interview. Be honest. Applied online.", "Interview Questions": "Why do you want to work in parking?"}, {"date": "11 Aug 2014", "title": "Junior Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2013", "Interview Descriptions": "They go around campus in a party tractor and invite everyone to apply. Once you have applied, some people get called in for interviews. The interview is very casual. you talk to around 3 of the higher level employees and they ask you questions and basically figure out if you arent a dingus who is going to break or steal equipment. They asked a lot about me but never gave me any problems to solve.", "Interview Questions": "What prior experience have you had with tech crew related work?"}, {"date": "5 Oct 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2013", "Interview Descriptions": "The interview process 7 years ago is much different now. So my interview then was very easy. My direct manager interviewed me and then I had an interview with HR and other management", "Interview Questions": "How long do you plan on staying at RIT"}, {"date": "7 Apr 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY)", "Interview Descriptions": "Students are required to submit their resume to Graduate student adviser. When there is an opening for the student assistants, they may be called in for an informal interview or formal one depending on which faculty or professor they are going to work with. Its is mostly an informal process of hiring and not much is expected of student workers.", "Interview Questions": "No difficult questions asked. You should know what you have mentioned in your resume."}], [{"date": "29 Feb 2016", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2013", "Interview Descriptions": "Did a day of monitored group activities with other applicants to test how we handled a variety of problem solving and social situations. After that on a different day there was a separate singular interview between you and two others who were employed at RIT student life. If you did favorably well in both you were hired. My interviewer was awkward and not very helpful at clarifying complex, multilayered questions, and I found having two interviewers in the room taking turns asking you questions made tensions high, as opposed to a friendly back and forth between two people would have been. I felt like I was being overly analyzed and observed, making the mood uncomfortable. I think as long as your a smooth talker though you can get the job. They ask a lot of questions about leadership roles, team work/building and dorm floor inclusion so be prepared.", "Interview Questions": "How would you make sure everyone on your RA floor felt comfortable and engaged in floor events. "}, {"date": "8 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2013", "Interview Descriptions": "Selective. They mainly go over reference. Although sometimes they look at the applications too. The main thing to look at is how you fit in the job and if you have enough time to work there.", "Interview Questions": "How did you here about us"}, {"date": "21 Apr 2017", "title": "Student Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2013", "Interview Descriptions": "Meet with supervisor face to face or set up appointment first. Then tell availability. Supervisor then will contact upper level management to set up interview with you. Very simple process", "Interview Questions": "Do you have experience in janitorial task before?"}, {"date": "20 Oct 2015", "title": "IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Nov 2012", "Interview Descriptions": "Brought me into the office and asked me mostly questions about what I enjoyed doing. Luckily I had a lot in common with the interviewers. They played a good cop bad cop style interview with one person trying to take my side and the other was questioning and asking all of the tough professional questions. I later learned that both of these people were awesome and they were gauging my professional reactions.", "Interview Questions": "What have you done to diffuse a distraught customer at your past employers?"}, {"date": "4 Oct 2012", "title": "Staff Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY)", "Interview Descriptions": "Usually  2 interviews and always with multiple people - 3 to 7 people all at once -- too many!! Many tell you how LUCKY you are to be there and just how hard it is to get an interview and wait to hear you say how grateful you are.", "Interview Questions": "If you could describe yourself in X number of words, what would they be? This is asked at most RIT interviews."}, {"date": "12 Sept 2015", "title": "Undergraduate Admissions Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Oct 2012", "Interview Descriptions": "Group process day led by the admissions captains, followed by an interview with the supervisors. Interview was not difficult but you should be clear on your people skills and marketing ability as you are selling the school.", "Interview Questions": "What is the worst thing about RIT?"}, {"date": "17 Nov 2015", "title": "Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at RIT (Rochester Institute of Technology) in Sept 2012", "Interview Descriptions": "The job was with tech crew. It was the most informal interview you will ever experience. They weren't looking for right or wrong answers but more of if you were a personality match with the rest of the crew. They let you know fairly quickly if you are in or not. You can only apply the first week or so, so make sure you go early", "Interview Questions": "What do you do if something is falling on stage"}, {"date": "8 Jan 2016", "title": "Saunders Student Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2012", "Interview Descriptions": "If they don't know you, they will normally meet with you to see what kind of professional you are and intend to be as well as get a feeling for whether or not you would be a good fit to work on their consulting arm. They will then proceed to interview you.", "Interview Questions": "How do you deal with difficult work situations?"}, {"date": "25 Sept 2013", "title": "Financial Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at RIT (Rochester Institute of Technology) in Aug 2012", "Interview Descriptions": "Two interviews, one with the assistant, one with director", "Interview Questions": "how would you plan a annual report for a research center?"}, {"date": "17 Aug 2012", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jul 2012", "Interview Descriptions": "First was the email notification to potential candidates on-campus that there were positions open, and if we were interested to send an email back with your resume and portfolio. \r\nAfter this, there was another email informing the candidates that responded back of future dates and times for interview appointments, either by phone, Skype, or in person (I chose to have my appointment in person). The candidates were required to bring a physical copy of their resume and portfolio with them.\r\nI arrived to my appointment on time, with my resume, portfolio, and digital disk of both. I was greeted by my Interviewer, as well as the Student Government President, who would be sitting in on my interview.\r\nRight after introductions, I handed over my physical copy of my resume and digital disk of my portfolio for my interviewer to keep. Then, we jumped into the questions. Before the session was over I was given a very short tour of my potential workplace, then we returned back to the office so then I could present my portfolio. After I asked my final questions, the interviewer informed me of when I would be notified of getting the offer or not, in a week from that day.\r\nWe exchanged final handshakes, and that was that. A few hours later I wrote my thank-you letter to my interviewer and waited eagerly and patiently for a response, and as promised I got an email response back a week later.", "Interview Questions": "If you only had 90 days to live, how would you spend them and why?"}], [{"date": "21 Apr 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2012", "Interview Descriptions": "Resume was submitted to the professor who is the head of the research lab by email. He set up an interview date, and with in a day he send me an offer.", "Interview Questions": "N/A"}, {"date": "5 Apr 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2012", "Interview Descriptions": "Applied online. Got an email and phone call from the manager after applying 6 months back. We scheduled for an interview. Had an interview with the manager.One to one  interview.", "Interview Questions": "About the softwares I know"}, {"date": "3 May 2013", "title": "Student Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2012", "Interview Descriptions": "The interview process was pretty easy. They asked me a couple of questions about my projects, PHP, JavaScript and Drupal", "Interview Questions": "There wasn't anything like difficult. They asked me questions like, how do I cope up in team work, under pressurized situations"}, {"date": "17 Nov 2012", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2012", "Interview Descriptions": "through interviews", "Interview Questions": "algorithms"}, {"date": "2 Jan 2013", "title": "Computer Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2012", "Interview Descriptions": "Positions at RIT are largely based on who you know and your ability to learn. This is because they tend to hire current students and graduates of Rochester Institute of Technology. So, they do not only focus on what you know, but if you seem intelligent and can communicate effectively. They offer free tuition to employees so they are not too concerned with current degree, but rather your ability to learn.", "Interview Questions": "NONE, have a great personality and communicate well, there are no trick questions here."}, {"date": "27 Apr 2012", "title": "Student Asset Management Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2011", "Interview Descriptions": "I Applied online on the job zone for the university. Got a call from the employer for a personal interview. Got an appointment after 2 days. Interview went smoothly. Employer asked about my skills and explained me the nature of the job. Rest was just some paper work after 3 days.", "Interview Questions": "What are your skills?"}, {"date": "20 Sept 2012", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2011", "Interview Descriptions": "It is easier to get the job if you just go to DSS office and ask them than applying online.", "Interview Questions": "are you familiar with mac?"}, {"date": "6 Oct 2012", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Jan 2011", "Interview Descriptions": "I first had to attend an information session, which then led into an online application.  After submitting that, I was chosen among many other candidates to participate in a day of activities to determine our capabilities as potential Resident Advisors, or RA's.  After completing this, I was called in for an interview with the RIT ResLife Director and an experienced RA.", "Interview Questions": "Having to explain a time when I'd faced conflict and dealt with it in a wise and effective manner."}, {"date": "3 Jun 2011", "title": "Student Lab Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2010", "Interview Descriptions": "You don't have to interview for this position. All this position requires is a recommendation from a professor within the Computer Science department.", "Interview Questions": "Who is your faculty recommendation?"}, {"date": "27 Mar 2011", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2010", "Interview Descriptions": "Went through my resume and asked questions related to past experience. Looked at willingness to learn more than skills acquired.", "Interview Questions": "Are you willing to learn new stuff"}], [{"date": "16 Nov 2010", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2010", "Interview Descriptions": "I had an initial phone interview with a panel, and was called back to interview with the group a second time on campus.  I studied their job description and developed q/a responses based on what they were looking for. The first interview was about 30 minutes, it was challenging being only on the phone as I like to connect with people and body language.  The second interview was in person with a panel of individuals.", "Interview Questions": "Why would you like to work here."}, {"date": "3 Oct 2011", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in May 2010", "Interview Descriptions": "I was asked to submit a proposal for my work, and expected to have both a timeline and budget ready by the time of the interview.  I completed each before my proposal was requested, but I doubt any of the material was read.  While I can't deny the amazing opportunity working with such a world class institution as RIT, I did expect the caliber of respect to be a little higher.", "Interview Questions": "What would you like to do?"}, {"date": "23 Mar 2010", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2010", "Interview Descriptions": "As long as you get a recommendation from a current professor, you should be good.", "Interview Questions": "How many hours per week do you want to work?"}, {"date": "26 Jul 2012", "title": "Visiting Assistant Photography Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Mar 2010", "Interview Descriptions": "Steps: email contact; phone call to schedule a campus interview, cmapus interview (with research presentation).", "Interview Questions": "what specific textbook would I use for certain course (one of many offered in the dept.)"}, {"date": "25 Sept 2012", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Feb 2010", "Interview Descriptions": "It was a very easy interview. And it was several years ago, so I don't really remember it.", "Interview Questions": "It was a simple assessment of my technical knowledge."}, {"date": "11 Oct 2009", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Sept 2009", "Interview Descriptions": "I sat down and told the manager my availability and she hired me instantly.", "Interview Questions": "When are you available to work?"}, {"date": "22 Mar 2013", "title": "Senior Staff Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Aug 2009", "Interview Descriptions": "Long process waiting for response / offers - checked my references - a full day of interviews, some one-one, some group, very friendly atmosphere, needed to replace an engineer with my field of expertise who had left.  Was told that it was a 9-5 kind of job with occasional rushes of work... ended up being more rushes than expected.", "Interview Questions": "Nothing memorable"}, {"date": "28 Nov 2013", "title": "Tenure Track Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at RIT (Rochester Institute of Technology) (Rochester, NY) in Feb 2009", "Interview Descriptions": "Very straightforward, phone interview and on site interview.", "Interview Questions": "Diversity is a topic that is emphasized but not comprehended internally so the interviewers want to listen a staged question."}]]