[[{"date": "27 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Eskenazi Health (Indianapolis, IN)", "Interview Descriptions": "It was an easy and quick interviews and application process. Usually two steps: an interview with the hiring manager and shadow time with another nurse. Great shadowing opportunities to ensure it is a good fit for you.", "Interview Questions": "Make sure you have specific real life examples to backup answers to their questions"}, {"date": "16 May 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Eskenazi Health in Apr 2023", "Interview Descriptions": "The interview process was very easy and pretty straight forward. It was not long at all and the questions asked were very easy. It took about a week to get an interview after applying.", "Interview Questions": "What is something you can bring to this company?"}, {"date": "12 Dec 2022", "title": "Community Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Eskenazi Health in Dec 2022", "Interview Descriptions": "It was an online interview, and the interviewers were very kind and encouraging. I enjoyed getting to speak with them, and they gave lot of information about the position as well as answering all my questions.", "Interview Questions": "How did your past experience help prepare you for this position?"}, {"date": "30 Aug 2022", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Eskenazi Health", "Interview Descriptions": "It was a very easy very standard very forward interview. There is not much to say about the interview process, it was a typical job interview with typical questions. Very straightforward and direct.", "Interview Questions": "What times do you want to work?"}, {"date": "16 Aug 2022", "title": "RN-BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Eskenazi Health", "Interview Descriptions": "Interview process at Eskenazi is not bad. \nKnow the reasons why you want to work there.\nWhat you will bring to the company and why you become a nurse.\nKnow your basic interview questions.", "Interview Questions": "Why do you want to work at Eskenazi?"}, {"date": "2 Sept 2022", "title": "Transport EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Eskenazi Health (Indianapolis, IN) in Aug 2022", "Interview Descriptions": "The process was quick and easy. They received my application from Indeed, and called and scheduled my interview quickly. I met with the manager and she asked the basic interview questions. I received a tour. She explained the next steps and by the end of the week I was contacted by HR with an offer.", "Interview Questions": "Why I wanted to work for Eskenazi over another hospital? What did I think made them stand out among everyone else? "}, {"date": "25 Mar 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Eskenazi Health", "Interview Descriptions": "Pretty easy! Ask your experience, interests and what you are looking for internship. They tell you about the position and how you would be impactful in it. Also asks your interests about how this will benefit your future.", "Interview Questions": "What is your major what how will will translate to the internship?"}, {"date": "24 Feb 2022", "title": "Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health", "Interview Descriptions": "It was a single video interview with two people. I was told I was a top candidate and went through background and fingerprints then they never followed up. They gave the job to someone else.", "Interview Questions": "How will you manage self care in a position like this"}, {"date": "24 Jan 2022", "title": "Therapy Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN) in Nov 2021", "Interview Descriptions": "It was a very easy process. The job was very well explained and the interviewers were positive  and friendly. They will ask about past jobs and how you solved conflict in the past", "Interview Questions": "How did you resolve a conflict with another co worker"}, {"date": "10 Sept 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Eskenazi Health", "Interview Descriptions": "Quick and efficient get straight to the point. Very detailed and organized. Three people watching the only bad thinks. It’s a two part interview for entry level. Not bad at all", "Interview Questions": "How can you make company better"}], [{"date": "4 Dec 2020", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Eskenazi Health", "Interview Descriptions": "I had to do a test before I could interview. I passed with a 100%. So I did the interview. During the interview the pharmacist stated per Indiana law I’d need to have my tech license even before I stepped foot into the pharmacy. The communication I had, along with the ad description for the job, did NOT state this. Because of the misleading and totally inaccurate/inappropriate information in the ad, during the interview it was clear I would not be selected as I was not credentialed yet. So either Eskenazi is either providing false info in job descriptions or the pharmacist was lying. Pick one. Considering I’ve heard this company routinely lies and discriminates, I can’t say I’m surprised.", "Interview Questions": "All questions were ‘tell me about a time’ scenario"}, {"date": "5 Nov 2020", "title": "Patient Access Services Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN) in Nov 2020", "Interview Descriptions": "First stage is a one way video recording interview. The questions pop up on the side and you have time to think and record yourself answering. Three attempts available for most questions.", "Interview Questions": "Tell me about yourself, why do you want to work for eskenazi and in this position specifically? "}, {"date": "8 Nov 2019", "title": "Patient Access Service Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN)", "Interview Descriptions": "I was first offered to do a video interview, and after this was reviewed, the next step was to come in for an interview in person. Here I met with three different people to learn about the role and my background in order to determine if it would be a good fit.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "12 Dec 2019", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Sept 2019", "Interview Descriptions": "Started with a phone screen and then continued to two different panel interviews. Moved all the way to a 4th interview with manager and they completely ghosted after weeks of going through this process. Very unprofessional.", "Interview Questions": "Difficult scenarios "}, {"date": "13 May 2019", "title": "Quality Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Eskenazi Health (Indianapolis, IN) in May 2019", "Interview Descriptions": "The 1st round of interviews contain a one-way video interview through an app. It would ask the question and I would have record myself answering said questions. You are allow 2 retakes for each question.", "Interview Questions": "Describe a time when you had to be very persistent to overcome an obstacle or shift demands of the business."}, {"date": "5 Jun 2019", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Eskenazi Health (Indianapolis, IN) in Apr 2019", "Interview Descriptions": "The interview process was very relaxed and personal. There were no complex questions such as, “Tell me a time where you overcame a difficult situation.” Eskenazi cares about their employees and wants to get to know them personally. In my interview we talked about my experience in the nursing field and talked about various clinical setting I’ve been in.", "Interview Questions": "Tell me about yourself "}, {"date": "8 Mar 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN)", "Interview Descriptions": "Interesting interview that didn’t really ask me questions she had me ask her questions then st the end gave two NCLEX style questions. Very nice but I was just thrown off that I felt like I was interviewing them more. I left feeling like they didn’t have a good understanding of who I was.", "Interview Questions": "Tell me about sepsis what is it? "}, {"date": "1 Nov 2018", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Eskenazi Health (Indianapolis, IN) in Nov 2018", "Interview Descriptions": "I interviewed for 2 positions with the same manager. I felt the process was very quick however, I did have an inside contact  that I felt made the process much easier.", "Interview Questions": "What I was looking for.. Hours, commitment and call."}, {"date": "14 Sept 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health", "Interview Descriptions": "The interview process was great.    They were very easy to work with and accommodating to my busy schedule.     They were professional and realistic about the demands of life.", "Interview Questions": "What my needs were to fit my life.  "}, {"date": "27 Sept 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Eskenazi Health (Indianapolis, IN) in Sept 2018", "Interview Descriptions": "Received a call from Michele (nurse recruiter) within one day of applying and we set up a phone screen followed by an interview 2 days later. I shadowed on the unit and then met with the nurse manager. Michele has to be the best nurse recruiter I have ever worked with. She answered all my questions and was able to explain why I should join Eskenazi. I can’t wait for October 8th!", "Interview Questions": "Behavioral based questions"}], [{"date": "5 Nov 2018", "title": "Injury Prevention Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Eskenazi Health in Sept 2018", "Interview Descriptions": "The interview process was efficient and convenient. My recruiter was great at keeping in touch, even texting and talking with me outside her normal business hours. It took only 2 weeks from my first interview to my offer letter. Great working with Eskenazi HR!", "Interview Questions": "Primarily discussed my relevant experience."}, {"date": "24 Jun 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Eskenazi Health", "Interview Descriptions": "This was my first (and only - because I accepted the job!) interview as a registered nurse. Everyone I met during my interview was super sweet. They made the interview go smoothly because I felt like I could talk to them about anything. I also got to shadow the unit I applied for beforehand, so this definitely helped to solidify my decision and make me want the job even more.", "Interview Questions": "What made me get into nursing?"}, {"date": "14 Jun 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in May 2018", "Interview Descriptions": "The process was great! They do a wonderful job on keeping in contact with you and updating you on everything. Very welcoming at the interview as well. HR does a wonderful job on making you comfortable and they are very flexible.", "Interview Questions": "Why do you want to work in the ER?"}, {"date": "27 Apr 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Apr 2018", "Interview Descriptions": "Had a job shadow before the interview. Both went amazingly. It has a very welcoming vibe and so many beautiful views. The person I shadowed was very kind and the interview itself felt so easy", "Interview Questions": "As a nurse, how have my boundaries been pushed and how did I handle it"}, {"date": "18 Dec 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Mar 2018", "Interview Descriptions": "Two separate interviews.  First was with the 2 pharmacy technician supervisors, and second was with 3 pharmacists.    It may seem a bit daunting at first, but it isn't too bad.", "Interview Questions": "Typical STAR questions - just be able to give specific examples"}, {"date": "12 Jun 2019", "title": "Talent Acquisition Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Jan 2018", "Interview Descriptions": "Received a call to schedule a phone interview with a recruiter. The initial phone interview was good. The recruiter was very nice and she explained to me next steps. After passing the first phone interview, I received another call to schedule another phone interview with two associates. They were very rude and I actually heard one of them sigh over the phone like she didn't want to be there. Surprisingly, I received a call back to schedule an on-site interview. After completing the interview process, I did not hear back for almost 3 weeks despite multiple follow-up emails. Finally, I received a response about a month later saying they have already finished with the candidate.", "Interview Questions": "How well do you work in fast-paced environments?"}, {"date": "8 Feb 2018", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Eskenazi Health (New York, NY) in Dec 2017", "Interview Descriptions": "Two interviews and an on the job ride along for half a day. I interviewed with the outpatient intensive case management team at the midtown location. Very nice people and good mix of workers. Management seemed very disorganized and took almost 3-4 months for the entire interview process up until I received a call about the offer. I had a phone interview on the spot and was invited in for the first interview and then had my second 2 weeks after. I was told I was the top candidate and they were in desperate need of new employees. I kept in touch with HR and finally heard back almost 2 later for the job-offer, and declined due to accepting employment elsewhere. Pay is much less than competing companies in the city, considerably by $2-4 for hourly amount. This hospital is notorious for having horrendous wait times and just sitting outside one of the managers doors for 37 min waiting to follow up and tell him about my in person ride along with a fellow case manger I truly understand why. Not one person would help me and kept saying he’s coming soon. Our appointment was at 12, I waited 40 min to see him, and we only talked for 5 min about how diverse their clientele is, the weather, and the hiring process moving on as a candidate. A true waste of my time while he sat in his office, door open, doing who knows, it was silent with random coughing.", "Interview Questions": "What’s your biggest weakness as an employee"}, {"date": "19 Oct 2017", "title": "Prior Authorization Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN) in Oct 2017", "Interview Descriptions": "It was such a relief and breath of fresh air.  The staff I interviewed with were very welcoming, informative, and direct when it came to the interview.  The environment was extremely welcoming as well.  I enjoyed it throughly and would definantly refer someone here.", "Interview Questions": "There weren't any."}, {"date": "31 Oct 2017", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Eskenazi Health in Sept 2017", "Interview Descriptions": "3 Interviews over the course of the month. Each interview was with 4 people that varied from directors, managers, and supervisors from other areas.  After the interviews, a follow up would be the next week to schedule for another interview. HR front desk wasn't too professional with HGTV always playing.", "Interview Questions": "What are your top 3 weaknesses and top 3 strengths? "}, {"date": "1 Nov 2017", "title": "Business Intelligence Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Jul 2017", "Interview Descriptions": "There was an initial phone screen with the hiring director and AVP. After the phone screen I interviewed with all three directors and the AVP. Questions were all experiential in nature.", "Interview Questions": "What experience I had developing reports. "}], [{"date": "2 Nov 2017", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Eskenazi Health (Indianapolis, IN) in May 2017", "Interview Descriptions": "I was called in for a first interview that was just with the director of the program and two team members.  I was then called back for a second interview with the whole team.  Both felt relatively welcoming and the team seemed excited to meet me. The biggest downside was how long it took after that second interview to get the job offer.", "Interview Questions": "How would you handle an upset patient?"}, {"date": "20 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in May 2017", "Interview Descriptions": "Wasn't much of an interview. Got told which shifts were available. No pressure, no nursing role questions. Gave me the pay. Gave me the pros and cons to working night shift as a new nurse. etc", "Interview Questions": "what shift would you prefer to work"}, {"date": "25 May 2017", "title": "Operations Manager- Patient Access Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN) in Apr 2017", "Interview Descriptions": "I Applied the beginning of March. I had my first interview the end of April and my second one the beginning of May.  I waited three weeks after my interview just to find out they chose someone else. This is the second time I've gone through this process. They will make you WAIT.", "Interview Questions": "How do you handle change and report it positively to your team?"}, {"date": "16 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Eskenazi Health in Feb 2017", "Interview Descriptions": "Applied online, was called by a clinical manager on the unit to which I was applying, and then schedule an interview for one week later. Upon arrival to the interview I was interviewed by 4 clinical managers all at once, and then taken to another floor where 4 charge nurses interviewed me all at once as well. It was formal/informal and relaxed. Most questions asked were standard nursing position interview questions. Everyone was really professional and very friendly.", "Interview Questions": "Why did you apply to Eskenazi?"}, {"date": "3 Feb 2017", "title": "Senior Talent Acquisition Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Feb 2017", "Interview Descriptions": "Interview was very professional and helpful in determining this particular position was not a fit for me.  The interviewer Nicole and I had a great conversation and if a more suitable role were to arise I would welcome the possibility to speak again.", "Interview Questions": "What methods I had used to source candidates"}, {"date": "12 Dec 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Eskenazi Health (Indianapolis, IN) in Feb 2017", "Interview Descriptions": "They ask you really simple questions about how you think you can contribute to the team. They also explain the role an what is expected of you. At the end of the interview they give you a chance to ask questions. Once hired you are given an orientation date which lasted for about a week.", "Interview Questions": "How do you think you will contribute to the team?"}, {"date": "18 Feb 2017", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Nov 2016", "Interview Descriptions": "Applied online, got a call to come in for a group meeting- completed some online tests there at their office, listened to two people talk about what openings they have-- waited another three days to get a call back from that department-- then took time to interview with an actual person in the building of choice, following this interview I was asked to take 4 hours of my day and shadow and the  interview again. \r\nI never heard back after the shadowing if they wanted me or didn't, I simply had to move on and find something else.", "Interview Questions": "Why should we hire you?"}, {"date": "10 Aug 2016", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Eskenazi Health (Indianapolis, IN)", "Interview Descriptions": "Nice interview...seemed like a friendly management staff. Some try to intimidate during the interview.  The offer for start date was ASAP. The screening and background went fast. Interview was late in the week. Had an offer the following Tuesday.", "Interview Questions": "Experience, good and bad customer service issues and how were they resolved. Flexibility of work hours"}, {"date": "8 Aug 2016", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Aug 2016", "Interview Descriptions": "The interview took 20 minutes. And I received a call a few days after I applied online. The whole thing was very underwhelming. They ask you to shadow after the interview and let them know how it went. There were two managers interviewing me. My friend also interviewed with them and it took what seems like forever for them to get back to her. They have set scheduling so that's another thing to think about.", "Interview Questions": "What do you know about this unit?"}, {"date": "20 Apr 2016", "title": "Patient Account Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health in Apr 2016", "Interview Descriptions": "Very Easy, she was very professional and straight to the point.. Applied online and received a call 30  mins later. Overall experience I was made comfortable not nervous at all and the employees that noticed I was new were very helpful. I was not offered position but was todl that a decesion would be made within the next week", "Interview Questions": "Describe your current postion"}], [{"date": "26 Feb 2018", "title": "MA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN) in Feb 2016", "Interview Descriptions": "Very easy and short she told me what she thought i wanted to hear, I told  her what hours I could work she then hired me for totally different hours, I asked her time and time again to change my hours, instead she gac=ve them to other folks at the hospital that were new and just started", "Interview Questions": "What hours do I like"}, {"date": "12 Mar 2016", "title": "Environmental Services Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Eskenazi Health (Indianapolis, IN) in Nov 2015", "Interview Descriptions": "The first interview was good. However, the second interview was totally not for environmental services. I was asked more of clinical related questions. And one interviwer mentioned that \"...that is why we stay here long, because we understand, we do not need the money..\"", "Interview Questions": "How do you eliminate viruses?"}, {"date": "27 Sept 2015", "title": "Front Office Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Eskenazi Health (Indianapolis, IN)", "Interview Descriptions": "The process was very long.  After I had the second interview, they took two months to get back to me.  I feel like it is extremely difficult to get an interview. What I do like about Eskenazi is that they let you know almost right away if you get a call back or not.", "Interview Questions": "Why do you want this position?"}, {"date": "8 Jul 2016", "title": "Registration Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Eskenazi Health (Indianapolis, IN) in Aug 2015", "Interview Descriptions": "The hiring and interview process at Eskenazi takes a very long time. Be prepared to wait. I was called in to many different meetings and interviews before I was finally placed to a position. Just be patient and do not get discouraged. Eskenazi is a great place to work for.", "Interview Questions": "What is one of your greatest weaknesses?"}, {"date": "7 Aug 2016", "title": "IT Service Desk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Aug 2015", "Interview Descriptions": "the application process was weird and slow for HR to respond and get stuff together.\r\nsure there is a process HR has to do but they were slow to start then insistent you hurry up and complete your part and get the references you put down to hound them to get online and complete their part.\r\nthey low ball you on salary , I was only able to get a 1.00 more an hour for pay out of them.\r\nridiculous when you have experience and they refuse to pay accordingly.\r\n\r\nridiculous that employees are paying for the parking there , hello a perk should be FREE parking for employees not my problem you built new hospital and have to pay for the garages.", "Interview Questions": "basic questions"}, {"date": "29 Jun 2015", "title": "Food Service Ambassador Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Jun 2015", "Interview Descriptions": "First , of all the things I went through I didn't get hired and the experience I've had wasn't worth the wait . The person I supposed to interview came almost 4hrs late . After we was introduced ,I had to wait for 15 more minutes to get his papers ready .We finally sat down for the interview an all he talked about the job and he never ask me about my previous job or what I did..although he told me my resume was very  impressive but  still didn't get the job. I was very  disappointed", "Interview Questions": "Any questions for me about the job?"}, {"date": "3 Sept 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in May 2015", "Interview Descriptions": "Interviewed with 3 managers. They asked me about why I wanted to work there. Why I would be a good fit etc. I thought the interview was quite short. This may be because I was referred by another employee. Do not expect to get a call-back from just applying online, knowing people helps immensely.", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Dec 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Mar 2015", "Interview Descriptions": "Received prompt response after applying. Went through one in-person interview before being offered position. Interview was a peer panel interview. Whole process took about 30 days from application to offer.", "Interview Questions": "In previous history, what is a mistake you have made and how did you learn from this?"}, {"date": "16 Nov 2017", "title": "Revenue Integrity Auditor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Mar 2015", "Interview Descriptions": "It was obvious the Director and Supervisor were trying to sell the position pretty hard.  After I started working there I figured out why... If you knew how unprofessional and disrespectful they were, not many people would choose to work there.", "Interview Questions": "What is the most difficult environment you find it hard to work in?"}, {"date": "15 Jun 2017", "title": "Food Service Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Eskenazi Health (Indianapolis, IN) in Jan 2015", "Interview Descriptions": "Hiring process was easy but took a very very very long time. I had to go through  several different interviews as well as waiting for about three weeks to get the official job offer. ps I am writing bs to be able to look up salaries", "Interview Questions": "describe a time I experienced bad customer service"}], [{"date": "20 Jun 2014", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health", "Interview Descriptions": "I submitted my application online.  I received an email a week later to schedule a pre-screen interview. The phone pre-screen was with the recruiter. I was called a week after the pre-screen  to be scheduled for the first onsite interview.  The first onsite interview was with the hiring manager.  I was told that they would contact me back in a week to find out if I would be moving into the next round of interviews.  I was called 2 days later to be scheduled for the final interview.  The final onsite interview was with executive leadership and another employee at my same level.  I was called by the recruiter the next day to be extended an offer.", "Interview Questions": "Questions were in line of normal interview questions for position.  I did not feel that there were any difficult or unexpected questions. "}, {"date": "13 Sept 2015", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Jul 2013", "Interview Descriptions": "Went in for interview. Had to take a written test to see where i was at. Then i was talked to by 3 managers at once. They asked me if i had cooked in front of people before. I had. Then they asked me about availability, and a bunch of typical interview questions. Very easy.", "Interview Questions": "Have you cooked in front of people?"}, {"date": "23 Jun 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eskenazi Health (Indianapolis, IN) in Apr 2013", "Interview Descriptions": "Panel interview with various levels of leadership and front line staff .  No standard set of questions used although beginning to use Studer Group set.  My interview was 6 years ago and was pretty basic stuff.", "Interview Questions": "Tell me about your biggest success, biggest failure"}, {"date": "30 Apr 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Eskenazi Health (Indianapolis, IN) in Jun 2011", "Interview Descriptions": "Met with two staff members and director. Pretty easy interview. Asked about situations I had experienced and how I handled them. Wanted to know my work history and some personal information.", "Interview Questions": "Gave a scenario about a patient and what would I do to care for them"}, {"date": "23 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskenazi Health (Indianapolis, IN) in Feb 2011", "Interview Descriptions": "Face to face and was very friendly, not intimidating.  They were flexible with scheduling.  They created a welcoming environment.  The tour was thorough and informative.  Job requirements were described well and expectations understood easily.  They did want to make sure that you had the stamina for the clientele (who can be difficult).", "Interview Questions": "How would you handle a difficult employee situation?"}]]