[[{"date": "3 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aultman Health Foundation (Canton, OH) in Jan 2017", "Interview Descriptions": "Met with HR first, then headed up to interview with unit director. HR questions were basic, unit director questions were tough. Be well prepared to answer tough questions, especially if interviewing for a specialty unit.", "Interview Questions": "Why do you want to work for Aultman?"}, {"date": "20 Mar 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aultman Health Foundation (Canton, OH) in Jan 2017", "Interview Descriptions": "Simple questions, very cut and dry. A lot of questions about previous experiences. Everyone I interviewed with was very nice. It was overall a very pleasant experience. First interview was with HR, second interview with hiring manager.", "Interview Questions": "How have you dealt with difficult situations in the past?"}, {"date": "23 Nov 2016", "title": "Venipuncture Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Aultman Health Foundation (Canton, OH) in Oct 2016", "Interview Descriptions": "Interviewer was very pleasant and welcoming. Interview involved many questions. Was asked a lot of scenario questions. Didn't feel pressured at all. Was able to learn a lot about Aultman during my interview. Was given a packet that included a lot of information on the excellent bemefits Aultman provides.", "Interview Questions": "Name a time when you were criticized?"}, {"date": "18 May 2016", "title": "Radiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Aultman Health Foundation (Canton, OH)", "Interview Descriptions": "The interview process was nice and the people were easy to talk to. It felt more like a conversation and less like an interview. Asked very general interview questions that were easy to answer.", "Interview Questions": "Asked about a problem in a job and how you solved it"}, {"date": "29 Jul 2015", "title": "Radiology Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Aultman Health Foundation (Canton, OH) in Jul 2015", "Interview Descriptions": "First met with HR, Julie was very pleasant, she went over the overall benefits.  Then met with the department.  Very nice experience.  Only wish is they had hired me!", "Interview Questions": "A scenario:  You have a patient in front of you, a doctor on your shoulder, a tech needing a report right now and the phone is ringing.  What would you do first and why?"}, {"date": "11 May 2014", "title": "Pharmacy Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Aultman Health Foundation", "Interview Descriptions": "good but slow asked too much questions five people were there lengthy interview. they asked questions about work , education and also took a test which is surprise for me.", "Interview Questions": "you have strong accent how you recover it"}, {"date": "28 Jul 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Aultman Health Foundation (Canton, OH) in Jan 2014", "Interview Descriptions": "Applied and was interviewed by an assistant manager.  Human Resources was not involved at all in the interview/hiring process.  I was only interviewed by one person, which was unusual given the size of the department.  The interview was very informal, in a small office.  My résumé was not reviewed at all during the interview.", "Interview Questions": "Tell me about a time when you delivered superior customer service."}, {"date": "23 Apr 2016", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Aultman Health Foundation (Canton, OH) in Feb 2013", "Interview Descriptions": "It was very brief. They didn't ask me very many questions. I had previous experience and was an extremely qualified candidate for the position. They hired me on the spot. They asked me about my experience and schooling. Told me about the hours and what Would be expected of me. I had to negotiate wages , but it worked out in my favor.", "Interview Questions": "Tell us about yourself"}, {"date": "11 Jul 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Aultman Health Foundation (Canton, OH) in Jun 2012", "Interview Descriptions": "You are screened in HR, then taken to Unit Director of area you may be working in. It seems you have to know someone to get an interview. I personally walked my resume to the floors i was interested in. I also volunteered while in school to make some connections prior to seeking employment.", "Interview Questions": "Why do you want to work here?"}]]