[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Highly recommended! It was an honor to spend 4 years working with them as a team leader.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Jan 2020", "job_title": "Team Leader in Thies", "duration": "N/A", "pros": "- Working at Global Citizen Year was an absolutely fantastic experience, from which I learnt a lot and that provided me with a broad set of transferable skills as well as incredible life experience. \r\n- There are many different aspects of the job, which definitely keeps things interesting : working with local partners, organizing and leading trainings, 1:1 coaching and mentorship, emergency response and risk management. \r\n- The philosophy and approach to holistic and experiential education that Global Citizen Year has developed is one with which I strongly resonate. It was truly an honor to a part of, and have an effect on, a profoundly impactful experience for so many incredible young people from many different backgrounds. \r\n-  For me, the work was relatively flexible, having a large degree of control over my schedule and responsibilities, though also often working with a small team to organize events, and set up and run all aspects of the program. \r\n- The broader Global Citizen Year program, with teams spread across 5 countries, is also a pleasure to be a part of, to learn from and contribute to. It was so rewarding to have colleagues from so many different countries, based in vastly different locations around the world, yet to have a common set of values, experiences and values that bound us together.\r\n- There is a genuine sense that the organization as a whole is truly committed to the vision and mission that it espouses and the leadership at Global Citizen Year is incredible. Each year that I worked there felt very different from the last as there always seemed to be a willingness to improve and refine the program.", "cons": "- Being a team leader is not something that I could do forever. It can be very intense and at times frustrating (although equally there are slower periods in which to recover). \r\n- Given the nature of the work and the relatively small country teams, there is limited room for progression. However, the team leader role provides skills and experience that are highly valuable for other employers."}]]