[[{"date": "3 Mar 2023", "title": "Nurse Navigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare", "Interview Descriptions": "After an hour-long in-person interview, this potential employer ghosted me. I followed up with an email, but received no response. I was shocked that they did not show me the courtesy of a response.", "Interview Questions": "The interviewers were not prepared with questions"}, {"date": "22 Jun 2023", "title": "New Graduate RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare (Hartford, CT) in Mar 2023", "Interview Descriptions": "They set up an interview very quickly, the questions weren’t hard they asked about when I graduate and the specialties I’m interested in they then made me an offer. Pretty easy interview. I declined because they were only offering med-surge when initially on the job page they had all specialties available. I just did not like the vibe I got, they tried to tell me as a new grad I can only start in med -surg.", "Interview Questions": "What speciality are you interested in?"}, {"date": "21 Feb 2023", "title": "Clinical Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "interview with team members (lab manager and research assistants) then with PI. very straight foward questions about experiences on CV, questions about roles, followed by any questions the interviewee had for the team", "Interview Questions": "Elaborate your experience as a research assistant at xxx"}, {"date": "6 Apr 2023", "title": "Patient Access Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hartford HealthCare (Fairfield, CT) in Oct 2022", "Interview Descriptions": "A set of two interviews one with the director of Patient Access and another with the VP of Revenue Cycle. The biggest question they ask is What is your management style in one word.", "Interview Questions": "What is your management Style in one word."}, {"date": "25 Aug 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "The process took place over the phone. It lasted 10 minutes and was offered allowance to volunteer on the spot. Interviewer was professional, precise, and passionate about the work they do.", "Interview Questions": "What prior volunteer experience do you have?"}, {"date": "8 Jun 2022", "title": "Performance Improvement Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "HR are took a long time to reach out after I applied. Two rounds of interviews, first with the manager and then with the team. Offer extended by recruiter within a couple of weeks after the last interview.", "Interview Questions": "Questions related to the position: why leaving previous position, experience, strengths and weaknesses. Team shared their job description and experiences. Opportunity to ask questions. "}, {"date": "13 Jun 2022", "title": "Physician Assistant - Surgical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hartford HealthCare (Litchfield, CT) in Jun 2022", "Interview Descriptions": "It was an excellent process.  I met with the head of the department, the other surgical PAs working that day and one of the general surgeons. I was able to ask a multitude of questions and got a tour of the facility.", "Interview Questions": "They had asked if I was interested in the position. "}, {"date": "5 May 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare (Hartford, CT) in May 2022", "Interview Descriptions": "Interviewer was professional but also kind.  interviewer was very welcoming. Thanked me for considering application . Was told be contacted  within a week. Interview took place via zoom very convenient. Hopefully I will get hired soon.", "Interview Questions": "N/A"}, {"date": "30 Apr 2022", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "You apply and you forget about that you applied than suddenly you receive a call and you are like what I got an interview lol that was my reaction anyways interview process was very quick", "Interview Questions": "Simple questions that are in interviews "}, {"date": "8 Mar 2022", "title": "Philanthropic Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hartford HealthCare (Hartford, CT) in Mar 2022", "Interview Descriptions": "Applied online with quick follow up from hiring manager. Extended phone screen followed by invitation to meet in person. Met with 3 members of the office. Not a particularly structured interview process. More of a conversational meeting. Was told I would receive update on search within 2 weeks. At 6 week mark, I reached out to check on status. Told hiring process was completed and offer made to another individual. Lack of timely followup and closure was unprofessional and disrespectful. Expected more.", "Interview Questions": "You did not go out to eat (at all) during the pandemic?"}], [{"date": "23 Jan 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "Easy & efficient- they knew what questions they were going to ask and were clear about job expectations. They were transparent about day to day duties as well as what to expect in terms of office volume", "Interview Questions": "Tell us a little about yourself"}, {"date": "5 Jan 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "Interview team of five persons back to back questions- Enough time to answer, no rush. Real-world questions, past work experience, past work conflicts, the future goal in five years. Great experience", "Interview Questions": "Tell me a conflict experience between you and your manager"}, {"date": "2 Jan 2022", "title": "Paramedic Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare (Torrington, CT)", "Interview Descriptions": "Started off with written test, followed by a panel interview. Written test had a large focus on drug dosages (including pediatric) and EKG interpretation.  Panel consisted of current manager, field employee, and EMS coordinator", "Interview Questions": "Pediatric dose of versed for status epilepticus. They provided patients weight in kg. "}, {"date": "27 Jan 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Jan 2022", "Interview Descriptions": "Easy going, comfortable, honest, realistic. The process made me feel good about the position I was applying for. Very welcoming environment. Good team work seen and effective communication between all types of providers.", "Interview Questions": "Experience in the position applying for"}, {"date": "3 Feb 2022", "title": "Policy Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Jan 2022", "Interview Descriptions": "The interview process was easy, but I had to call in multiple favors and I was asked for five references. I asked for a salary between 60-65k. I was offered 45k. It was very upsetting to be offered a full 20k below my asking and not being told upfront in the three week process that the salary was so low. Bear in mind, I've worked in research for half a decade. Please be very careful and upfront about your salary expectations when interviewing with this company.", "Interview Questions": "How would you handle process improvement for specific sections of a research projects?"}, {"date": "6 Dec 2021", "title": "Phlebotomy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "It was a zoom interview by the supervisor. She asked what was my weakness and what motivated me to select that career. So I told her I feel confidence taking care patients.", "Interview Questions": "What are your weakness? I really don’t have any weakness because I’m sure I’m the work that I bring to my patients."}, {"date": "15 Sept 2021", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Hartford HealthCare (Glastonbury, CT) in Sept 2021", "Interview Descriptions": "The initial interview was via Zoom. It was relatively brief and cursory. The second interview was more like a 30 minute job shadow, and I am not sure how they gathered feedback as the supervisor was not present for this period of time....", "Interview Questions": "Tell me something about you that I would not be aware of from your application and resume."}, {"date": "31 Aug 2021", "title": "Manager of Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Hartford HealthCare (Southington, CT) in Aug 2021", "Interview Descriptions": "Terrible experience, I was referred to the position by an internal resource and waited over a month before I could even apply. I waited another 2 weeks before I even had an interview, then waited another 2 weeks before being rejected. A 2 month waste of time.", "Interview Questions": "No job specific questions just straight forward personality questions "}, {"date": "25 Aug 2021", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Hartford HealthCare (Norwich, CT) in Aug 2021", "Interview Descriptions": "I received a phone call to schedule a time to interview and a follow up email confirming the time and date. The phone interview lasted about 15 minutes, where had a chance to share my story. The interview process was pleasant...it was the person who initially called me and another supervisor. It was a good experience.", "Interview Questions": "It was the \"tell me about a bad work situation and how you dealt with it\" question. "}, {"date": "30 Dec 2022", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hartford HealthCare (Westport, CT) in Jul 2021", "Interview Descriptions": "The interviewer asks several questions about salary expectation and previous experience working in a medical setting. The interview is fairly quick. The interviewer also asks about medical terminology and familiarity with the EMR system.", "Interview Questions": "What is your prior experience?"}], [{"date": "28 Mar 2022", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Hartford HealthCare (Westport, CT) in Jun 2021", "Interview Descriptions": "The interview process is fairly simple and the questions are straight forward. There are only a few questions asked and the staff was very friendly. Overall a good place to work if the offer is accepted.", "Interview Questions": "Do you have previous experience?"}, {"date": "1 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hartford HealthCare (Bridgeport, CT) in Jun 2021", "Interview Descriptions": "Received a phone call to set up interview, interview was in a private room with nurse manager and assistant nurse manager and the nurse educator. All three asked me questions during the interview.", "Interview Questions": "The biggest weakness I have"}, {"date": "16 Nov 2021", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hartford HealthCare in May 2021", "Interview Descriptions": "Applied online, received a phone call one week later, interview in person 2 days later, and received an offer about 3 weeks later. It was very straight forward and I was connected to HR very quickly.", "Interview Questions": "Why HHC?\r\nExperience with difficult patients?\r\nTalk about a time you had to work with someone who was challenging."}, {"date": "13 Jun 2021", "title": "Medical Staff Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare (New Britain, CT) in May 2021", "Interview Descriptions": "Interactive and down to earth. As long as you are personable the usual questions are bypassed. Management was very nice the only thing is the process is a bit different in regards to salary. Instead of speaking numbers at second interview the meeting consisted of meeting the team.", "Interview Questions": "Tell me about yourself?\r\nWhat dk you know about this position?"}, {"date": "28 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hartford HealthCare in Feb 2021", "Interview Descriptions": "-where do you see yourself in five years -how do you deal with challenging patients -what is the biggest challenge you face -why work here? -overall easy going interview and very nice interviewers. Good experience", "Interview Questions": "Where do you see yourself in five years"}, {"date": "23 Mar 2021", "title": "Contract Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare (Hartford, CT) in Feb 2021", "Interview Descriptions": "I was contacted by HR for a short phone interview.  Once completed, my resume was sent to the hiring manager for review.  I met with a total of six people over seven interviews, including members of the team and senior leadership.  After the final interview, I was not notified by anyone that I was not being offered the position, which seems to be typical for this employer.  I only found out by checking the tracking system.", "Interview Questions": "What experience do you have with drafting and negotiating contracts?"}, {"date": "3 Jan 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "approachable, easy to apply, they offered the interview the day before and that didn't give me time to prepare well enough but they were really nice and understanding even tho my nerves were in the sky.  The interview was with the charge nurse of the unit and the nurse manager. the both asked questions but they were approachable", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "8 Jul 2020", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "Fairly straight forward. The entire process consisted of a couple interviews varying from phone interviews to in-person interviews. Was essentially what you would expect from the typical lab technician interview processs.", "Interview Questions": "What's an experience that has helped you develop organizational and management skills"}, {"date": "2 Jul 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "HR called to set up an initial interview with the nursing manager. After the interview with the nursing manager, I shadowed a nurse for a day and was asked more behavioral and technical questions. I then spoke with HR about benefits/salary/etc.", "Interview Questions": "How do you deal with conflict with employees in higher positions?"}, {"date": "12 Aug 2020", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare (Plainville, CT) in Jul 2020", "Interview Descriptions": "The interview question were based on Situational questions . But the company is great to work for if you get a chance to get in to Hartford healthcare. They call first did my phone interview and then call me in for in person interview.", "Interview Questions": "How did you help your colleague Without them asking?"}], [{"date": "11 May 2020", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hartford HealthCare", "Interview Descriptions": "Shadow experience followed by manager interview.  Department director was present as well.  HR followed up to discuss compensation, benefits, etc.  Occupational health/drug screen prior to formal job offer.", "Interview Questions": "\"Some nurses find it challenging to transition to critical care in a tertiary care center, what are your thoughts regarding your own ability to adapt?\" "}, {"date": "11 May 2020", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Apr 2020", "Interview Descriptions": "I have had interviews for three different positions within Hartford Healthcare.  Each has started with a phone screen.  One of them I was brought in for face to face after phone screen.  One of them was during COVID-19 so after the phone screen I was given a panel interview with the team via phone.  Then for that one, I was brought in face to face to meet the Director of the department.  Everyone in all cases was pleasant and professional.  My only complaint is in the two cases where I had a face to face interview, when I was not chosen I was ghosted.  Being an HR professional myself, I have never not at least sent an email to a candidate who was met in person to let them know they were not chosen.  Since it has happened twice now, I have to assume this is a Company wide policy or procedure.  It is definitely a turn off on applying for future positions there.", "Interview Questions": "Behavioral interview questions (STAR)"}, {"date": "30 Aug 2022", "title": "Sales Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Feb 2020", "Interview Descriptions": "once initial recruitment screening on zoon, Two in person interviews, reference checks, drug screening \n\nThey did call references, you have to submit a form online and the reference you selected will get a questionnaire to fill out on your behalf", "Interview Questions": "Management experience, experience with corporate entities "}, {"date": "26 Feb 2020", "title": "Instructional Design Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hartford HealthCare (Farmington, CT) in Jan 2020", "Interview Descriptions": "Had a 30-min phone screen with the hiring manager. Was invited for an in-person interview with the team lead, hiring manager, and some ID peers which lasted 1 hour.  Then was invited back for a presentation (15 min on any topic-include a powerpoint and learning aid), one-on-one with the division head, and informal conversation with the hiring manager and team lead. It took 2 weeks start to finish. Ultimately, I wasn't selected because they found someone who was already certified in EPIC.", "Interview Questions": "Which of the HHC culture principles would be easiest/hardest for me to embody?"}, {"date": "5 Sept 2020", "title": "Administrative III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Jul 2019", "Interview Descriptions": "Received a call from the hiring manager and went in for an interview. The interview was with the manager and another admin. The whole process was very relaxed and informative. Received a tour after of where the office is, etc. Then had a second interview with the exec I would be supporting. All in all it was great! One of my favorite parts of the interview was that I wasn't asked generic questions about myself. It was more focused \"can you do the work\" type questions.", "Interview Questions": "Have you ever worked for a difficult physician or executive? If yes, how did you find a way to work well with them?"}, {"date": "17 Jul 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hartford HealthCare (Hartford, CT) in May 2019", "Interview Descriptions": "Phone Interview for about 1/2 hr and the questions were normal interview questions.  Then we found a personal connection which helped me have a rapport with the interviewer and I think that helped me get the job", "Interview Questions": "Why are you interested in working here"}, {"date": "8 Jun 2019", "title": "R N Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Hartford HealthCare (Waterbury, CT) in May 2019", "Interview Descriptions": "I initially met with the Clinical lead, then I met with the director of the floor. I was then emailed about what hours I would like to work, then once I responded I received an email asking for five references, two had to be previous supervisors", "Interview Questions": "What are your weaknesses "}, {"date": "27 Dec 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare (Hartford, CT) in Jan 2019", "Interview Descriptions": "In a room with 3 other people. Straightforward and simple questions based on character. It alternated who answered the question first. Overall really easy, and was designed to make you feel comfortable. Mostly it was a kids first ever interview, and they were super aware and accommodating for this fact.", "Interview Questions": "What was one time you failed and how did you overcome this?\nIf your best friend could describe you in one word, what would it be and why?\nWhy do you want to be a volunteer at HHC?"}, {"date": "4 Apr 2021", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare (Norwich, CT) in Dec 2018", "Interview Descriptions": "The process was very simple especially because there were multiple positions open. Applied online and had gotten an interview within a few days. Interview was quick and easy, management was great.", "Interview Questions": "They Asked me about myself"}, {"date": "29 Aug 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hartford HealthCare", "Interview Descriptions": "Had an initial phone screening and then a panel interview. The HR manager and research assistants started by talking about their research and then proceed to asking some typical interview questions.", "Interview Questions": "Give me an example of you overcoming a difficulty at work."}], [{"date": "4 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hartford HealthCare (Norwich, CT) in Aug 2018", "Interview Descriptions": "Overall  the interview process was very fair.  They were very open and friendly and did not make me feel intimidated.  It is very important to be a team player in this field and I like that this is important to Backus.", "Interview Questions": "Why did you choose Backus?"}, {"date": "20 Sept 2018", "title": "Revenue Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Hartford HealthCare (Newington, CT) in Aug 2018", "Interview Descriptions": "Met with the hiring director for 45 minutes, learned about the department and position. Spoke about my experience. However, when offered the job I asked for the offer in writing, and was flat out ignored.", "Interview Questions": "Where do you see your self in 5 years."}, {"date": "23 May 2019", "title": "Medical Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Hartford HealthCare (Hartford, CT) in Jun 2018", "Interview Descriptions": "applied online, was contacted for an initial phone interview, went in for one on one interview, recruiter called with offer. Had to attend an all day orientation and then one week worth of EPIC training", "Interview Questions": "Give an example where you provided exemplary customer service"}, {"date": "19 Apr 2018", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hartford HealthCare (New York, NY)", "Interview Descriptions": "Applied online and received a call the next day scheduled interview.   Straight forward interview, about my past experience and goals.  A week later second interview, and offer a week after that.  Then reference check, background check, pre employment physical and drug test.  Overall process took about a month.", "Interview Questions": "Why do you want to leave your current oosition"}, {"date": "7 Apr 2018", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hartford HealthCare", "Interview Descriptions": "Easy interview. Regular interview questions.  Not much to say. Nothing different. Dress nice, smile, tell them what they want to hear. Relax, have confidence, be prepared. They may cancel, but will reschedule. Very unorganized.", "Interview Questions": "They want to know about your experience. They don't care about nothing else. "}, {"date": "5 Dec 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hartford HealthCare", "Interview Descriptions": "I was interviewed by the practice manager, and admin 3 and a physician scheduler. They went over my resume asked me about previous history and then we got into details of this job.", "Interview Questions": "how many years experience do you have"}, {"date": "9 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Nov 2017", "Interview Descriptions": "Took about a week and a half. I visited twice in order to make a final decision on the floor I preferred to work on. I was called by a recruiter and matched to the area of the hospital that best matched my skill set, which was great because it actually matched where I wanted to work! Once hired, all paperwork was done online. This made everything so much easier and I hardly spent anytime driving to the site before my start date.", "Interview Questions": "Name a difficult situation in the past and how you solved it."}, {"date": "20 Oct 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare (Avon, CT)", "Interview Descriptions": "I was called for an interview 3 weeks after I applied. The interview lasted for about 30 minutes and i enjoyed the experience. He was more interested in my personality and how i handle situations and people. It was a pleasant interview", "Interview Questions": "What makes you think you can do this job?"}, {"date": "12 Oct 2017", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hartford HealthCare", "Interview Descriptions": "Spoke with HR first by phone. Then set up an in-person interview and met with head of clinical operations and area manager for 1-2 hours.  Then had a phone interview with direct supervisor (site director). It would have been an in-person meeting but I was applying from another state so a phone interview was offered.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "30 Mar 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare (Hartford, CT) in Aug 2017", "Interview Descriptions": "Easy process. Interviewed with the manager.  Manager asked about my previous work experience. Manager asked me how I would respond in a few different scenarios. Such as experience with Epic software, MicroSoft Office, multitasking, and customer service.", "Interview Questions": "How would you handle an upset patient?"}], [{"date": "4 Dec 2017", "title": "Registered Respiratory Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hartford HealthCare (Hartford, CT) in Jun 2017", "Interview Descriptions": "There is a group/panel interview including the manager and Senior Respiratory therapist, they ask General questions first and they ask about about the company’s vision and then clinical questions/scenarios.", "Interview Questions": "If you were the manager, what is one thing you can do to your subordinate that the current manager didn’t do yet?"}, {"date": "20 Feb 2018", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Hartford HealthCare (Danielson, CT) in May 2017", "Interview Descriptions": "Went in, met with director, shadowed a group session, left and returned to share my initial thoughts with the director. She answered any questions I had, which were none. It was very straightforward and informal.", "Interview Questions": "Why are you qualified, what is your background with this population, etc"}, {"date": "19 Jun 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare in May 2017", "Interview Descriptions": "Took two weeks to be contacted and a few more for an offer. Overall good experience.  Very easy to communicate with HR and Hiring Manager after interview.  Answered all of my questions and then some.", "Interview Questions": "Why did you apply for this position ?"}, {"date": "8 Oct 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Hartford HealthCare (Hartford, CT) in Apr 2017", "Interview Descriptions": "The interview was very casual and informative. It was more of an informational interview than an actual interview. They asked me what my hours would be and what days I would like to come in right off the bat.", "Interview Questions": "What do you want to get out of this experience?"}, {"date": "8 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hartford HealthCare", "Interview Descriptions": "I applied online. I was then called to interview. THen I went in for an interview. Then I was called for a decision within a couple of months. They have to do a background check and everything afterwards", "Interview Questions": "Why do you want this job"}, {"date": "8 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Feb 2017", "Interview Descriptions": "I applied nearly 2.5 years and they never called. the application status always stated not selected or under review and then all at once they would update their records and put not selected.", "Interview Questions": "What is one accomplishment you are most proud of?"}, {"date": "16 Sept 2016", "title": "CDS RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Hartford HealthCare (Hartford, CT)", "Interview Descriptions": "Interview was routine I had my questons answered I was shown the programs I would be using I asked questions and wanted to know how my work would be beneficial aND how outcomes was tracked", "Interview Questions": "How were my computer skills"}, {"date": "1 May 2017", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Hartford HealthCare (Hartford, CT) in Jul 2016", "Interview Descriptions": "Interviewed at one location, and my information was passed along to a better position, and the interview process was less about me and more about the prospective role in the company", "Interview Questions": "What are your interests"}, {"date": "24 Jun 2016", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Jun 2016", "Interview Descriptions": "The process took three weeks. I went through a phone interview and an in-person interview in the span of two weeks. I interviewed with the lead of the research and his lab supervisor. Afterwards, I received a tour from another research assistant. Everyone was very nice! I received an offer the week after.", "Interview Questions": "Why Connecticut?"}, {"date": "29 Sept 2016", "title": "Administration Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Hartford HealthCare (New Britain, CT) in May 2016", "Interview Descriptions": "Application was filled out, an interview was scheduled, and completed, at the finale of the process interviewer relayed the interviewee would be notified whether or NOT the potential employer would hire. Never heard back yes or no. Guess the potential employee was suppose to deduce on their own they were not going to be hired and to look elsewhere", "Interview Questions": "Name one word to describe yourself"}], [{"date": "23 Aug 2016", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Hartford HealthCare in May 2016", "Interview Descriptions": "Nothing they did wrong, I was awful in my interviewing.  They brought me back for a second interview and I felt I did terrible in that as well.  I did not prepare enough to know the business unit I would be working in. Usually I do much better in my preparation.", "Interview Questions": "Tell us about what we do here"}, {"date": "19 Aug 2016", "title": "Undergraduate Summer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Hartford HealthCare in Feb 2016", "Interview Descriptions": "Brief 20 minute phone call with the director of Medical Education. It is very informal and casual. Ask the director about the program to learn more - you do not need to know everything about it. Mention that you have talked to past interns. Have a list of potential departments you would like to work with. Try to bring up Hartford HealthCare, the parent company of Hartford Hospital.", "Interview Questions": "Why do you want to go into medicine?"}, {"date": "31 May 2016", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Sept 2015", "Interview Descriptions": "My interview went well. I met the manager in an office setting.  The interview was about 20-30 minutes long. I interviewed with two people. I didn't get a tour of the area I was potentially going to be working  in. So, I guess I can say the interview was short and simple. I can honestly say that after I left I could not tell how the interview went.  I left very curious.", "Interview Questions": "\"What's one thing your enemy would say about you?\""}, {"date": "9 Aug 2015", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Aug 2015", "Interview Descriptions": "I applied for the position and was contacted two weeks later by a hiring manager for a brief phone screen and an offer to come in for an interview the following day. It was a panel with the practice manager and two of the nurse supervisors. They were very nice, questions were very easy to answer. Great vibe. The following day, they called to confirm it was okay to check my references. The following day, I was offered the position.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "29 May 2015", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hartford HealthCare", "Interview Descriptions": "easy interview. Made great promises. basically just marketed their company, not many questions or screenings. Basically wanted to sell themself. They really try to impress you on the first day. basically they want to make sure you want the job, due to their inconsistent retention rate", "Interview Questions": "What are your interests in the field?"}, {"date": "7 Apr 2015", "title": "Anesthesia Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare (Hartford, CT)", "Interview Descriptions": "Easy interview questions. Reliability and team work is key for a potential employee. Interviewed by Nurse and unit leader, interview lasted about 35 minutes. Overall I hiring process took awhile though but it was so worth it.", "Interview Questions": "Can you give me about example of when you worked in a team?"}, {"date": "20 Jan 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hartford HealthCare (Norwich, CT) in Apr 2015", "Interview Descriptions": "Panel of interviewers ask questions from worksheet. Managers and maybe one floor employee. Most questions are posed as \"describe one time you were challenged by - - - and how did you respond\"? \"", "Interview Questions": "Most questions were generic nursing interview questions. I felt that they were likely out of a company manual. They looked to judge how the candidate would handle adverse situations. Not much stood out as particularly difficult. Have a few stories about tough patients and coworkers ready in your mind. "}, {"date": "1 Aug 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hartford HealthCare in Jan 2015", "Interview Descriptions": "straight forward.  just like any other interview.  the process can be long as HR is a bit slow with getting back to you.  Typically they will do a second interview.  they were professional and engaging", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "8 Jun 2015", "title": "MIS Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Hartford HealthCare (Norwich, CT) in Sept 2014", "Interview Descriptions": "My recruiter did most of the leg work. I was recommended for the position by a former coworker. The interview process was somewhat unorganized. My interview schedule constantly changes up all the way up to the time of the interview. My current boss was not even present and decided to interview me over the phone.", "Interview Questions": "Why I wanted to leave my current employer."}, {"date": "2 Dec 2016", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hartford HealthCare (New York, NY) in Aug 2014", "Interview Descriptions": "Long drawn out hiring process- took over two months. Completed a survery upon arrival followed by actual interview - first with rep  from HR then with management. Required to submit 3 references. Once all of these steps were completed I was drug tested in another facility a week or so later.", "Interview Questions": "Asked mostly about availability and willingness to perform what is a dirty job."}], [{"date": "10 Sept 2014", "title": "Consulting Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hartford HealthCare (Hartford, CT) in Jul 2014", "Interview Descriptions": "Some managers will talk at you giving you little time to portray yourself. Some managers will review a check list of HH behaviors and dive into your psych background.", "Interview Questions": "What would your colleagues say about you when I stop them in the parking lot on the way home today?"}, {"date": "11 May 2015", "title": "Vice President, Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Hartford HealthCare (Hartford, CT) in May 2014", "Interview Descriptions": "Phone interview followed by an in-person meeting with talent recruiters(2).  Mostly background and what could I bring to the job questions.  Questions were about skills and how they would tie into the job.  Also, questions about strategy, how would I create a creative working atmosphere, ...etc. It was a good learning experience for me.  Final candidates were all either PhD or MD..", "Interview Questions": "Describe a situation with a difficult employee and how you handled it."}, {"date": "16 May 2018", "title": "ER Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hartford HealthCare in Mar 2014", "Interview Descriptions": "After submitting application I was given a phone interview.  When I told them I had over 20 yrs experience as an EMT, the call pretty much ended by them telling me I didn't fit their requirements... ????", "Interview Questions": "What is your experience"}, {"date": "13 Apr 2014", "title": "PHLEBOTMIS Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hartford HealthCare in Feb 2014", "Interview Descriptions": "Application and interview", "Interview Questions": "AmI willing to work hard"}, {"date": "16 Aug 2015", "title": "PAA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hartford HealthCare (Hartford, CT) in Dec 2013", "Interview Descriptions": "applied online, short phone interview, met with HR who took me to the unit and from there interviewed in front of a panel of interviewers (4). Afterwards received a call a week later saying I got the job. Then I took a health screening plus drug test, and took a tb test, plus flu shot. I did paper work with HR, and went to a initial training with 300 people ( it was 8 hours). The next day that split us up with our peers and then we were in fulltime training for 5weeks. (in classroom and on the floor) p.s. they check all your references.", "Interview Questions": "Tell me a time you had to multi-task and how would you rate your multi-tasking skills?"}, {"date": "2 Nov 2013", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Hartford HealthCare", "Interview Descriptions": "Best Plan of Action is to ask someone who works in the hospital to recommend you. Nepotism is alive and well.", "Interview Questions": "How would you react to a patient verbally targeting you?"}, {"date": "27 Nov 2015", "title": "Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hartford HealthCare (Hartford, CT) in Nov 2013", "Interview Descriptions": "First submitted online application, then interview in person in the department I was applying for residency. The whole process was very laid back and easy going, not stressful at all.", "Interview Questions": "Why did you choose us?"}, {"date": "2 Jun 2014", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Hartford HealthCare (Hartford, CT) in Nov 2012", "Interview Descriptions": "I learned of an opening from a current employee, then I applied online and attended two in-person interviews.  I took time to prepare for the interviews and they went very well.  I learned a good deal about current research studies conducted on-site and was given opportunity to ask about their research.  It took a few months from the time I heard about the opening to the time I attended orientation after being hired.", "Interview Questions": "Flexibility in weekend/weeknight availability and study population were key points of discussion.  "}, {"date": "16 Oct 2015", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Hartford HealthCare in Oct 2012", "Interview Descriptions": "Phone interview followed by face-to-face.  There were a lot of questions about how much money I thought I could raise and where I would look, who I would cultivate and how I would go about organizing a strategy.", "Interview Questions": "I was asked to walk through my resume, discuss some of the challenges I'd faced and how I dealt with them, what some of my major successes were, and what specifically I could bring to the team."}, {"date": "14 May 2013", "title": "FNP Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Hartford HealthCare (Bensenville, IL) in Aug 2012", "Interview Descriptions": "Initially, I interviewed with a HR over the phone. About 1 mo later, on site interview was conducted with 4 leadership people from 12-4 pm. Interview was not stressful, and most part of it was including introduction, history and growth of VNA and only interview with a medical director was asked regarding clinical skill and experiences.  2-3 weeks after interview, I was notified of PT FNP job offer form HR over the phone.", "Interview Questions": "Questions with a HR was all expected ones. During the interview with the medical director, she provided case scenarios regarding uncontrolled DM and COPD exacerbation and asked what you would like to do."}], [{"date": "9 Dec 2015", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Hartford HealthCare (New Britain, CT) in Sept 2011", "Interview Descriptions": "You will have to meet with someone in HR before meeting with the manager/director of the department. The interview with the manager/director comes next and this one is more relevant to the position. You will also have to submit to a drug screening and physical. The interview with HR is pretty difficult and they will ask you many standard questions but give you a hard time if you miss anything.", "Interview Questions": "They questioned me about the dates of employment from my previous employers even though they had this listed right in front of them on my resume."}, {"date": "30 Dec 2012", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hartford HealthCare (Meriden, CT) in Jun 2011", "Interview Descriptions": "Tedious.\r\nComputer based application", "Interview Questions": "N/A"}, {"date": "28 May 2014", "title": "Project Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Hartford HealthCare (Windham, CT) in Feb 2010", "Interview Descriptions": "it was very family and community based when i joined bought by Hartford health care and lost its identity its now all cooperate apply online no response now your just a number no personal touch", "Interview Questions": "i did not get any unxepected questions"}, {"date": "28 Feb 2011", "title": "Nursing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at Hartford HealthCare (Omaha, NE) in Feb 2010", "Interview Descriptions": "Completely caught off guard with the number of people in the interview room - only 2 folks introduced themselves. When that group left - I went into another large room with another group of folks and a huge TV monitor with even more folks in a completely different state.", "Interview Questions": "tell me about a time when you were confronted by a colleague who disagreed with you. What was the SITUATION - ACTION TOOK AND RESULTS."}]]