[[{"date": "15 Jun 2023", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lesley University", "Interview Descriptions": "Phone screen followed by a prescriptive face-to-face interview with a panel, then a final meeting with the Center director. The panel interview questions were typical. Mostly to gauge experience level and cultural fit.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Jul 2023", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Lesley University in May 2023", "Interview Descriptions": "They do not respect candidates or their time. I was thrown through the ringer being told I had an offer pending for 3 weeks for them to decide out of the blue to have the offer withdrawn with a very vague excuse. They do not respect candidates, their time, and they lack honesty.", "Interview Questions": "Describe your previous experience and what interests you about Lesley?"}, {"date": "16 Mar 2023", "title": "Exceutive Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Lesley University (Cambridge, MA) in Nov 2022", "Interview Descriptions": "In November 2022, I began the interview process for the position of Executive Assistant to the Deans at Lesley College of Undergraduate studies. After a thorough and prolonged interviewing process, it concluded on March 9th, 2023. The interviewing process spanned several weeks: • Nov 15th- Initial 30-minute call with an associate dean • November 21st- 3-person panel zoom interview with a search committee, chairs, and another Executive Assistant. • December 9th- I met with a dozen staff members over the course of three hours who conducted rotating 30-minute interviews with me during an in-person panel interview, which concluded with an hour interview with both Deans. • December 15th- was then asked for information regarding my references and the references were contacted and provided details about my background and skill set. • From December 15th to January 3rd, no communication efforts were made to contact me. • I inquired about salary and scheduling expectations on December 22nd, but no information was shared with me. When I followed up, I was told that salary information would be provided when an offer was made. I also asked about my direct support but received no response. • On January 20th, I had a 45-minute zoom interview with the Provost and President. • The offer was extended on February 23rd. When the offer was made, the title and expectations of the role had changed. Due to the changes, I requested a follow-up call with HR. I was scheduled for two follow-up calls within a 3-week timeframe, but both were canceled. On March 9th, the offer was withdrawn, and the position, I was told, was put on hold, although the position was reposted on the careers page on the same day. This position remains posted on their careers page as of the date of this review. When I inquired about the role being “put on hold” and yet remaining on the careers page, I was not given a direct answer. Throughout this lengthy interview process, I maintained a professional and flexible attitude. However, I would like to offer feedback and suggestions to the recruitment team at Lesley University to ensure that their recruitment efforts respect candidates' time and are equitable to all candidates. It is essential to offer a streamlined interview process that allows candidates to meet with their direct team and supervisors to provide insights into the day-to-day expectations. Communication with candidates should be timely and clear, and a designated contact person should be available to answer questions and provide straightforward answers. Recruitment turnaround time should be shortened to avoid miscommunication, and the salary range should be posted in the requisition to attract qualified candidates. In conclusion, I was disappointed with the interview process and would hope that professionalism and clear communication for future candidates is made a priority.", "Interview Questions": "How do you manage your time?"}, {"date": "6 Jan 2023", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Lesley University in Sept 2022", "Interview Descriptions": "Extremely rigorous process and takes long time \nFirst received an email about wanting to interview me \n30 min Phone call from hiring manager \n1 hour interview with team \n3 hour interview with team, provost, community members, hiring manager.  Team and community members where all in the same interview (10+) people \nInterview with HR about salary \nInterview with President and HR and Vice President about who I am and why I want the job \n\nLots of questions about diversity and specific knowledge about the position.", "Interview Questions": "Tell me about yourself and your experience"}, {"date": "19 Jul 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lesley University", "Interview Descriptions": "The interview process was organized by the assistant to the president. He invited me for a phone screen with many people asking questions. Then, I had to do a presentation for the search committee. Then, I had to meet one-on-one with the Provost.", "Interview Questions": "1.) Why do you want this position?"}, {"date": "6 Jun 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Lesley University", "Interview Descriptions": "I got the email from the school one to two weeks after I applied for it. Then we had a phone interview first. It was about 30 minutes. Three committee members.", "Interview Questions": "Why do you want to come here?"}, {"date": "15 Nov 2018", "title": "Graduate Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lesley University", "Interview Descriptions": "All stakeholders that the position would interact with work Freson in the interview. They gave me a great picture of what the responsibilities of the role would be day today.  It is always helpful to meet the staff that you will be working for and working with  during the interview process .", "Interview Questions": " Describe your advising philosophy or approach."}, {"date": "1 May 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Lesley University", "Interview Descriptions": "I first had a telephone screening by a panel of faculty and the Department Chair. I was then invited in for a day of interviews and to teach a class lesson I designed and provide a slideshow of my work. The in-person interview lasted seven hours and included a one on one with the dean, one on one with Search Committee, class lesson, presentation of my work, Q&A, meeting students and a closing session.", "Interview Questions": "How does your work align with the social justice mission of the University?"}, {"date": "29 Jul 2017", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lesley University", "Interview Descriptions": "Had to teach for twenty minutes, then was given a syllabus I'd never seen for an English composition class and had to say how I would design instruction for it, got a tour of the libraries, and then search committee asked me questions, then I met with the dean of libraries for half an hour.", "Interview Questions": "What is your reference philosophy? What are some strategies for collaborating with faculty? "}, {"date": "29 Dec 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lesley University (Boston, MA) in Jan 2017", "Interview Descriptions": "The questions were what I expected. They mainly had to do with the basics of the position and what type of colleague I'd be and how my goals aligned with those of the university... Friendly staff", "Interview Questions": "Why Lesley"}], [{"date": "12 Aug 2016", "title": "Advancement Communication Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Lesley University (Boston, MA) in Aug 2016", "Interview Descriptions": "Phone interview with three people on the line. Asked basic questions about your last job position and writing skills. A lot of pauses in between questions. Follow up process is if they contact your references your basically off to the next round.", "Interview Questions": "When was the last time you wrote something comprehensive?"}, {"date": "18 Apr 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Lesley University (Cambridge, MA) in Dec 2015", "Interview Descriptions": "I was pretty much asked to work at the Career Resource Center because I had a friendly encounter with the Associate Dean of Career and Community Service - a friendly conversation can go a long way", "Interview Questions": "Why do you think you are qualified for this position?"}, {"date": "8 Feb 2017", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lesley University (Cambridge, MA) in Aug 2014", "Interview Descriptions": "I was in a room with five people.  It was no longer than 45 minutes.  I thought it was bit intimidating, but I found the process of having all of them in one room, made it quick and made it so that there were no redundant questions.", "Interview Questions": "Would I have a problem getting in at 8am?"}, {"date": "2 Jun 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Lesley University (Cambridge, MA)", "Interview Descriptions": "Very long application and interview process - which seems to be typical in higher education. Around 6 months. Absolutely no room for salary or benefit negotiation. Their were about 200 applicants for this position so higher education experience and a master's degree are necessary.", "Interview Questions": "N/A"}, {"date": "27 Sept 2015", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lesley University (Cambridge, MA) in Jan 2011", "Interview Descriptions": "Behavioral interview. Questions were typical.  Tell me about yourself, tell me your most significant contribution to date.  Took about 4 weeks from start to finish.xxxxxx xxxxxxxx xxxxxxxx xxx xxxxx", "Interview Questions": "Tell me about your strengths and weakness.  Why to you want to work at Lesley.  What do you know about the university.  What was the biggest mistake you ever made.  What is your background in education. xxxxxxxxx xxxxxxx xxxxxxxxxxx"}, {"date": "19 Oct 2011", "title": "Student Administrative Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lesley University (Cambridge, MA) in Aug 2010", "Interview Descriptions": "I could really tell that the office interviewing me wanted me to fit in with the other employees.  Everyone was extremely friendly, and I really felt that the position was laid out for me in an understandable way.  The questions were relevant and poignant.  Everyone was interested in what I had to say and how well I got along with everyone else.", "Interview Questions": "How do you deal with telling people no/conflict?"}]]