[[{"date": "21 Nov 2022", "title": "income legal assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Midland Heart in Nov 2022", "Interview Descriptions": "It was an interview with a three-member panel and a presentation on a rent arrears case. You were asked competency questions and given the chance to express yourself with examples. as usual using the STAR method works.", "Interview Questions": "What skills fo you need for this role?"}, {"date": "27 Sept 2021", "title": "Contracts Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Midland Heart (Birmingham, England) in Jul 2021", "Interview Descriptions": "As it was during lockdown, my interview was held over microsoft teams.  The interview itself was around 30 minutes, with my manager and a second manager from another team. Both were very welcoming. I was asked customer service type questions about how I would respond to situations, what I have done in previous role that was beyond my role to help someone etc.   I then had a 30 minute written activity where I had to prioritise different pieces of work and explain why I picked the order.", "Interview Questions": "An example of how I had gone out of my way to help a customer"}], [{"date": "28 Jan 2020", "title": "Customer Service Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midland Heart (Birmingham, England) in Jun 2018", "Interview Descriptions": "applied online, invited to interview. was offered role but had to start the monday after. told them i couldn't then they called me again a few weeks later with another start date", "Interview Questions": "what does equality and diversity mean to you?"}, {"date": "21 Dec 2017", "title": "Rent Adjustment Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Midland Heart (Birmingham, England) in Dec 2017", "Interview Descriptions": "I applied for the role online, quite a while later I get a text message to check my emails and when I did it said I have been shortlisted for an interview. I had to book in a slot which I did and then attended an interview at their head office in Birmingham a week later. I signed in at reception, waited for a while and as I was earlier than expected I was taken through to their busy office on the ground floor where people were chatting away amongst themselves and some of the women looked like they had lost the will to live. I was then given a few pieces of paper, a calculator and a scenario which I had 20 minutes to complete with all that noise going on around me.  Once completed I was taken upstairs for an interview where 2 people interviewed me, they asked me many questions and as I have worked in this field before I was able to give real examples and had some knowledge of what they do which seemed to have impressed them a little judging by the looks on their faces. I was then asked all the usual cliche questions that you get asked in interviews followed by an opportunity to ask some of my own questions, the bombshell was then dropped on me that its actually a part time role of 20 hours per week which to be totally honest is nowhere near enough hours to live and its cover for maternity until November 2018. What sickened me the most is that about roughly 7 people have had an interview for the one job which wasn't told to me until I got to the interview, the bloke from HR should have told me this and I wouldn't have bothered turning up. I gave a very good interview and its shocking that I didn't get the job but then again when there is only one job going its clear which ethnicity usually gets it.", "Interview Questions": "Give an example where you had to work under pressure"}, {"date": "25 Apr 2018", "title": "Resourcing Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midland Heart (Birmingham, England) in Oct 2017", "Interview Descriptions": "Around 1.5 hours long process consisting of 3 elements; role play scenario, preparing and presenting information based on the role play and finally a panel interview. \r\n\r\nIt was clear that the initial activity was designed to test key skills and behaviours for the role. Interviewers not trying to trip you up but genuinely challenging you to  show your capabilities and actually see you \"doing\" the job. \r\n\r\nFinal half hour was a fairly relaxed panel interview of 5/6 questions, which felt more like a 2 way conversation than a question and answer session.  \r\n\r\nThe team I would potentially be working with was present throughout the entire process which is fantastic if, like me, team fit is important to you!", "Interview Questions": "How do you ensure strong CRM?"}, {"date": "25 Jun 2017", "title": "Support Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Midland Heart (Stourbridge, England) in Mar 2017", "Interview Descriptions": "Quite a relaxed and friendly interview process. Provided refreshments as it was lengthy. \n15 applicants for one job. \nHad to plan a short presentation in a group then present to the rest of interviewees, residents and interview panel.\nAlso had to complete a team building exercise of making a tower.\nThen had basic English and Maths tests.\nDepending on these results you were called through to the next round, a one on one formal interview.", "Interview Questions": "Describe a time when you made a mistake?"}, {"date": "17 Jan 2019", "title": "Research and Data Insight Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Midland Heart (Birmingham, England) in Nov 2016", "Interview Descriptions": "I had a good experience on the interview, I found the questions well thought and relevant to the position. I had to prepare a presentation about the small data analysis we were asked to do in advance. The communication and instructions were clear.", "Interview Questions": "N/A"}], [{"date": "22 Jul 2016", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Midland Heart (Birmingham, England) in Jul 2016", "Interview Descriptions": "An hour spent being given the background on the company, the current set up, the challenges the new managers were having in building a team and selling the role (not a good sign), challenging me about my cv, and gaps, which are for valid reasons, before my presentation, then another hour on vaguely competence based questions. This was not a competence based interview in my view.\r\n\r\nAbsolutely no concern whatsoever for people who may have had childcare, caring or travel commitments, keeping candidates there for two hours whilst they endlessly chatted. I had to stop the interview as I had a return train booked and it was a Friday afternoon. This did not give me a good indication that I could count on these people to safeguard my health and welfare.\r\n\r\nNo adjustments made to the interview process despite me declaring a disability.\r\n\r\nExtremely concerned at how much the managers discussed being fairly new in post, and how they were working with people from other places they had worked at, it felt like I would be joining an old boys network of people who had brought their friends along. One of the panel discussed mainly his own issues which had nothing to do with why I was at interview. I also did not feel that he valued or could adjust to, a culture of flexible working, which I stated was important for me. I got the feel that diversity was paid lip service to and they were uncomfortable at questions I asked regarding the diversity mix within the team.\r\n\r\nI was told that feedback would be given the following week. It wasn't. I had to email their contact centre to get any response at all. I am still awaiting detailed feedback which I requested a week ago, and did not get the job, despite being told I would go down well working there.", "Interview Questions": "Give example of the type of analysis tools used in your role."}, {"date": "10 Feb 2016", "title": "Mental Health Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Midland Heart (Wolverhampton, England) in Nov 2015", "Interview Descriptions": "They called me in for an interview which I could not attend due to my job commitments at the time. They happily rearranged my interview date and were very understanding. My interview was held at the facility that I would later be working at. The manager and the senior support worker interviewed me. They asked me a few questions about what I knew about the role, my experience, what I knew about safeguarding etc. They then set me a couple of written exercises. These were basically scenarios to which I had to write what I would do in the situation. They were fairly easy to complete.", "Interview Questions": "Do you have experience supporting people with mental illness?"}, {"date": "20 Apr 2018", "title": "Surveyor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Midland Heart (Birmingham, England) in May 2014", "Interview Descriptions": "Was asked to do a presentation having been given a scenario with 30 minutes preparation. After presenting to a panel we went into the formal interview with the panel and discussed competancy based questions.", "Interview Questions": "How would you deal with an underperforming contractor?"}]]