[[{"date": "27 Feb 2023", "title": "Faculty Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rasmussen University in Feb 2023", "Interview Descriptions": "Was not difficult. went through 3 interviews. first with recruiter, then HR, then dean of nursing. everyone was very nice but I did not get the job because they said they wanted previous teaching in a school ...which was not in the required skills list.", "Interview Questions": "Show us your teaching style"}, {"date": "22 Mar 2022", "title": "Sr Manager, Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rasmussen University", "Interview Descriptions": "Initial phone interview with HR.  Following the first-round interview, additional interviews followed.  This included an interview with both the hiring manager and peer team.  Overall, the process was a multiple interview process over three separate interview dates and was a fairly rigorous process for a middle management level position.", "Interview Questions": "Typical interview questions related to past work experience.  "}, {"date": "5 May 2021", "title": "Adjunct Nursing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rasmussen University (Saint Cloud, MN) in Dec 2020", "Interview Descriptions": "Met with the full time faculty and answered the typical, \"where do you see yourself in five years,\" type of questions. They had me present a teaching point, approximately 10-15 minutes in length which I thought was great!", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "15 Feb 2020", "title": "Career Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Rasmussen University", "Interview Descriptions": "I applied online and a recruiter (from a different state) emailed me back quickly after I submitted my application. We set up a date and time for a phone interview a few days later. It was a very basic interview just to see my qualifications and talk about more details of the job that they did not list in the description, such as salary. The recruiter said she would pass my information on to a hiring manager in my state and I would hear back from her a week later. True to her word, a week passed and I received an email saying they narrowed down the candidate pool and I did not make it. The recruiter spoke to me in a respectful manner and was very professional which is why I rated this interview as positive. After reading other interview reviews from this organization, I think the phone interview is a standard part of their hiring process before actually getting a physical interview in person.", "Interview Questions": "Why do you want to work for Rasmussen?"}, {"date": "28 Apr 2019", "title": "Admissions Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rasmussen University", "Interview Descriptions": "Conversation based and easy going. Very direct questions and eye contact. Dove into resume and asked about experiences in depth. Come prepared to talk about your strengths. Didn't ask much about weaknesses. Know how to apply your previous skills to the job posting.", "Interview Questions": "Strengths"}, {"date": "9 Sept 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rasmussen University (Minneapolis, MN) in Apr 2019", "Interview Descriptions": "First, they will send you an email asking you to write a few paragraphs about why you are best suited for the position and why you think it is a great opportunity.", "Interview Questions": "What does tutoring mean to you and what does customer service mean to you?"}, {"date": "2 Feb 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rasmussen University", "Interview Descriptions": "You will have at least two interviews.  If you are seeking a director or executive level position you could have up to 15 interviews, personality profile, panel interview, presentation interview, etc.  Mid range employee interviews are average intensity but top level are screened like crazy from what I know.", "Interview Questions": "Behavioral questions like name a time you had to deal with a difficult person.  Name a time when you saw a project through to completion."}, {"date": "3 Dec 2019", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rasmussen University in Jan 2019", "Interview Descriptions": "The interview process was easy. The recruiter was very nice and focused on my teaching abilities. The process was only 30 minutes or less and then I was scheduled to speak with the Dean.", "Interview Questions": "How many years of experience do you has as an Instructor? "}, {"date": "5 Nov 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Rasmussen University (Saint Petersburg, FL) in Sept 2018", "Interview Descriptions": "The entire process took about 7 days. I had two phone interviews, one with recruiter and the other with department chair. The following week was the campus interview with the dean and campus director.", "Interview Questions": "My education philosophy, my overall experience teaching, programs I used to teach, and basic industry specific questions."}, {"date": "21 Feb 2018", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rasmussen University (Oak Brook, IL) in Feb 2018", "Interview Descriptions": "Screening interview with a recruiter. Phone interview with department head. Next step was a practical demonstration where I suggested two ways to present the same lesson and answered a discussion question about competency-based education. Then, I presented the demo to a panel of instructional designers via WebEx.\r\n\r\nI was unable to use my camera during the panel interview. It was addressed. One member of the panel said it wouldn't count against me. In retrospect, maybe it did. I felt it was a strong interview, but apparently someone else was a better fit.", "Interview Questions": "The questions were mostly in regard to the module that I planned and the approaches I used. At one point one panel member role played as a SME/professor to test if I could defend a position I held."}], [{"date": "16 Feb 2018", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rasmussen University (Blaine, MN) in Jan 2018", "Interview Descriptions": "I was required to go through five separate interviews.  It started with a phone interview with the HR recruiter.  Next, I had a phone interview with the Director of Admissions.  The third interview was an in-person interview on campus where I met with the Director of Admissions and then talked to the current admissions staff for a while also.  The next interview was a phone interview the a VP of Student Enrollment and Engagement (I'm not sure if that title is accurate).  Lastly, I met in-person with the Campus Director", "Interview Questions": "Are you competitive?"}, {"date": "7 Apr 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Rasmussen University (Brooklyn Park, MN) in Aug 2017", "Interview Descriptions": "Lengthy process with multiple steps in the process and several  phone interviews with many different people.  It seemed pretty extensive as compared to other job interviews for similar companies.  On site interview with presentation to a group who looked they wish they would’ve been any place else.  A lot of overselling the company and little transparency.  They are very proprietary.", "Interview Questions": "What do you know about Rasmussen?"}, {"date": "19 May 2017", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rasmussen University (New Port Richey, FL) in May 2017", "Interview Descriptions": "Lengthy and inefficient . They had me interview with a recruiter over the phone, then I interviewed with the director over the phone, then I interviewed with the manager over the phone. I get an email from the recruiter saying that they had \"great things to say about me\" and wanted to do in person interviews. I was also scheduled for another phone interview with the head of academic advising. \r\n I go for an in person interview. This interview is with the AA manager and other advisors. Many of the questions were repeated from interviews before. Afterwards,  I find out I have another in person interview with the director and the same AA manager so I head across the hallway to have an interview with them. A few hours later I received a call from the head of Academic Advising. After the last interview I felt the process to be inefficient. I was also thrown off by the amount of questions relating to how I would get along with someone not pulling their weight or hard to get along with (do they have a problem there?), and based on the questions that were asked by the director, I  have a suspicion that this school focuses more on numbers and retention than the students best interest at heart. It's a private school, so I wasn't too surprised. I ended up not completing my background check, as I had already decided that this was not the right fit for me. Nevertheless, I did receive an email saying that they had to narrow down the candidates and I was not part of the cut. If I had been part of that group I wonder how many more interviews would have been involved.", "Interview Questions": "They kept asking about how I deal with people I don't get along with,  in various ways"}, {"date": "19 Apr 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rasmussen University", "Interview Descriptions": "1. Phone interview with Recruiter (30 minutes)\r\n2. Phone interview with Hiring Manager (30 minutes)\r\n3. In-person interview with Hiring Manager and Campus Director (1 hour)\r\n3A. Fill out Another Employment Application for the background check before next interview. \r\n4. In-person interview with Director of Admissions at another campus (1 hour)", "Interview Questions": "What lead you to apply for this role?\r\nWhat is your sales experience?\r\nDo you have experience working on a phone?"}, {"date": "11 Dec 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Rasmussen University (New York, NY)", "Interview Descriptions": "It was a little tedious. Put you through the ringer as the PM's would do for the student. Got to be a little redundant but all in all was pretty easy.  Negotiate salary immediately, especially if you have previous sales experience as the wiggle room is not there after.", "Interview Questions": "Why would I hire someone with as little experience as you?"}, {"date": "16 Dec 2016", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Rasmussen University (Bloomington, MN) in Dec 2016", "Interview Descriptions": "Was scheduled an interview a little over a week in advance and was cancelled the day of due to making the pool smaller. The least that could've been done was send an email notification a day or two before the interview day. Disappointed and unprofessional.", "Interview Questions": "N/A"}, {"date": "21 Sept 2016", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rasmussen University (Oak Park, IL)", "Interview Descriptions": "Phone interview with an HR recruiter a week and a half ago that lasted about 25 minutes. Recruiter was pleasant until I asked about a time frame for hearing back from them. I was told I'd get a yes or no regarding an in person interview by the end of the week. Never heard back from them so I am assuming they decided to proceed with other candidates.", "Interview Questions": "Describe a project you managed in a previous role."}, {"date": "26 Oct 2016", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rasmussen University (Eagan, MN) in Jul 2016", "Interview Descriptions": "The interview was very informal and positive at the same time.  The interviewer made me feel relaxed and comfortable from the moment I walked in the door.  This was one of the most positive interviews that I have had.", "Interview Questions": "Tell me about yourself and who you are?"}, {"date": "6 May 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rasmussen University (Bloomington, MN) in Apr 2016", "Interview Descriptions": "I had a total of 4 interviews within a 2 week timeline. First one was over the phone with the recruiter who was very pleasant. The second one was with one of the supervisors over the phone. The next interview was in person and with the other supervisor. They asked the typical questions like walk me through your resume, what did you like about your last 2 jobs, what did you dislike about them, etc. The final interview was with the assistant vp of admissions, well the recruiter goofed up on the meeting. I came in the day before it was 'actually' scheduled so that was an inconvenience-- the recruiter apologized and told me it was actually set up for the next day and she told me the wrong date. So, I felt a little discouraged since I had to take time away from my current job. The last interview was pretty similar to the ones with the supervisors, except the VP was asking most of the questions. I really connected with all the supervisors, I was really bummed when I got an email from the recruiter saying they eliminated the position for another Program Manager and the requisition was closed. I invested a lot of time with them and didn't understand why they put me through such a lengthy interview process if they weren't going to hire anyone else.", "Interview Questions": "Which one describes you more: Hate to lose or love to win? Tell me about yourself. Describe a time you had a conflict with a supervisor, how did you resolve it? What was your favorite thing about your current job? Why are you leaving your current job? Why Rasmussen? "}, {"date": "19 Apr 2016", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rasmussen University in Feb 2016", "Interview Descriptions": "The phone interview was scheduled for 11am (I double checked the confirmation email), yet she called me at 10:30am.  The phone interview was fairly easy, conversational, and standard questions.  I proceeded to the next phone interview with the program manager.", "Interview Questions": "Tell me about your previous sales experiences."}], [{"date": "22 Jul 2017", "title": "IT Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rasmussen University (Ocala, FL) in Jan 2016", "Interview Descriptions": "Started with a phone call asking a few basic questions, like why did I apply, what am I studying etc. Then came in person. To be honest based on the job description I was way under qualified. But I went for it because it was a work study. My boss interviewed me knowing I didn't know jack diddly but what he really wanted was someone with strong customer service skills. Since I had those it was an easy win. In his words it is easy for him to teach tech but hard for to teach someone to be likable person to talk to the staff.  He made me feel at ease, unlike some tech interview that grill you.  In the end I would do it again. Sometimes being good with people and working hard nails you a job. 10/10 would recommend it.", "Interview Questions": "How much IT knowledge do you know? "}, {"date": "4 Mar 2017", "title": "Senior Admissions Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Rasmussen University (Minneapolis, MN) in Jan 2016", "Interview Descriptions": "Met with DoA, RVP, CD and had to present on Metrics, Goals, and show proven results granting this promotion. Also needed to demonstrate clearly my expectations for myself and the Team.", "Interview Questions": "Describe your Management Style? Why now? What do you plan to do after this Promotion? "}, {"date": "9 Oct 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rasmussen University", "Interview Descriptions": "It was a 3 week process, meeting with the directors and eventually the assistant vp. They asked typical interview questions.It was a little challenging since I do have a bubbly energetic personallity where everyone I talked to was not, so it was a little difficult to match their personalities.  After each interview I sent a thank you email and the HR person was always quick to respond to my questions. I eventually made it to the final round of interviews and of course sent my thank you email to the HR person since that was the only contact information I had and then never heard back from them. I even asked when they were looking to make a decision so I would have some kind of knowledge of their time line. Would of appreciated some kind of email letting me know I didn't get the position.", "Interview Questions": "They asked the typical questions, what are you strengths/weaknesses, where do you see yourself in 5 years, example of a difficult situation in a previous job and how did you overcome it, how did you overcome a conflict with a coworker and supervisor"}, {"date": "26 Sept 2018", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rasmussen University (Ocala, FL) in Oct 2015", "Interview Descriptions": "The interview process is incredibly relaxed. I received a phone call from the Learning Services Coordinator for my department. Questions were entirely behavioral, such as the classic 'Tell me about a time...'. It was mostly to get a feel for the person and determine if they were a good fit for the team.", "Interview Questions": "Why do you think you'd make a good tutor?"}, {"date": "2 Nov 2015", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rasmussen University in Aug 2015", "Interview Descriptions": "The recruiter contacted me to conduct the interview. I currently work in customer service so I take phone calls all day. Although, I tried to not be on the phone at the time we had scheduled to do the phone interview-- of course I was on the phone when she called. I called  maybe two minutes after she left a voice mail and her tone with me was irritated that I had to call her back. I apologized and said I would still like to proceed with the interview. Unfortunately, I felt rushed and I felt that she had already decided that she didn't want to hire me. At one point, I heard her giggling in the background at an answer to the question, \"Why did you pick to apply to Rasmussen College?\" She also asked how I heard about the position 3 different times. She had an nasty demeanor and I did not enjoy my time speaking with her. She rushed me off the phone and as soon as I hung up I knew I didn't want anything to do with the company anyway if I was treated that way. She was extremely rude and condescending and I hope Rasmussen is aware of who they have representing their brand.", "Interview Questions": "Why Rasmussen College?"}, {"date": "1 Jul 2015", "title": "Financial Analyst Phone Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Rasmussen University", "Interview Descriptions": "Interviewer was unprofessional and rude. Started interview late and asked unrelated and unusual behavior questions. She was forceful and demanding when it came down to salary requirements. It was like she would end the interview unless I stated my salary requirements.", "Interview Questions": "Why do you want to work for Rasmussen?"}, {"date": "11 Mar 2015", "title": "Online Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rasmussen University", "Interview Descriptions": "I had one phone interview that took approximately 45 minutes. It was conducted by another faculty member. It was very conversational in nature and low stress. The interviewer asked me about my work experience in the field I was applying for. She explained how online courses work and the hiring process. She was flexible with scheduling my interview, as I was traveling during the time she wanted to schedule.", "Interview Questions": "Tell me about your work in Corrections."}, {"date": "24 Apr 2015", "title": "Adjunct Online Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rasmussen University (Chicago, IL) in Jan 2015", "Interview Descriptions": "Overall, low stress interview through email and telephone. Once I made it past the recruiter, I was given an interview with a Dean who had no clue what about the curriculum of the class that I was assigned to teach. I declined offer when I discovered the work expected for the very low compensation, plus unpaid training. Not impressed.", "Interview Questions": "Professional experience, educational background, Student interaction scenarios "}, {"date": "3 Dec 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rasmussen University", "Interview Descriptions": "Very organized interview process. Phone calls by HR and college dean. This part of employment seemed very thorough, but now I know that's because they have such a high turn over.", "Interview Questions": "None. Questions were as expected for position. Did ask how I would handle a difficult student."}, {"date": "30 Sept 2015", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Rasmussen University in Jul 2014", "Interview Descriptions": "A phone screen with director, two onsite interviews with CFO and hiring mgr, then a happy hour with the team. Standard behavioral interview. Nothing difficult. Wanted examples of difficult situations and resolutions, how I build relationships, etc. Happy hour was to see how I interacted with the team and what questions I asked. They threw out another candidate for not asking enough questions.", "Interview Questions": "Describe a difficult situation in your current role and how you resolved it."}], [{"date": "10 Jun 2014", "title": "Student Finance Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Rasmussen University (Tampa, FL) in May 2014", "Interview Descriptions": "This review is mostly geared toward the experience I had while interviewing for the role of Student Finance Officer. I applied for the job on 4/15/2014 and had the initial face to face interview set up for two weeks later. After this initial interview, it took three more weeks for the HR rep (who is located in Minnesota) to set up the next round of interviews. Also, she apparently had a hard time understanding the difference between CST and EST. My current job does not offer me a lot of flexibility, so when I told her the days and times I was available for the phone interview, I expected her to be mostly accommodating. She failed to convert CST to EST (even though I made sure to specify my local time zone in my email) and therefore caused me to have to do the phone interview an hour earlier than what I had told her! I did not complete the second round of interviews until a month AFTER the initial interview. \r\n\r\nAll throughout the process, I was constantly chasing down the HR rep for a status update. She was absolutely horrible about staying in touch. It did not matter what method of communication I chose, she would often go a week or two without responding to me unless I called her office repeatedly. While I understand the stresses of the HR environment and the workload that many people are under, this is extremely unprofessional and uncalled for. Responding to an email takes literally, one minute. She was extremely unprofessional, unorganized, and even confused me with a different candidate at one point!\r\n\r\nNow it has been eight weeks after applying for the position and I am only just now receiving the generic 'Thanks, but no thanks' email. This experience left a dreadful taste in my mouth. You should never treat prospective employees this way. I don't care what state the economy is in, there is no excuse for utter incompetence and lack of follow through. If this is the type of culture this company perpetuates, I want no part in it.\r\n\r\nIt's a shame that the HR rep was so unprofessional. This experience has motivated me to never apply for a job with this company again.", "Interview Questions": "Nothing really. Average round of questioning: give an example of a time where you had to handle a very difficult customer, describe a time when you experienced an extremely stressful situation and how you dealt with it, what three words would best describe you?"}, {"date": "5 Jan 2017", "title": "IT Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Rasmussen University (New York, NY) in Mar 2014", "Interview Descriptions": "Went throught the proper student work-study program process. Notified the work-study program representative and inquired about the position and if I qualified. Once my qualification was determined I was contacted by the supervisor of the position for an on-site interview. After determination, it takes 2 weeks before actual start date. This gives IT the proper amount of time to get everything set up.", "Interview Questions": "What courses have you completed?"}, {"date": "3 Jan 2014", "title": "Admissions Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rasmussen University in Dec 2013", "Interview Descriptions": "There was a phone interview, they said it would last 30 minutes but only ended up being 10. They only asked about my job history (which was already written on my resume) and no personal questions. They said they'd call me back, but it's been a month so I guess I didn't get it. Very poor interviewing skills.", "Interview Questions": "Tell me about your last job? Why did you leave?"}, {"date": "16 Sept 2013", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rasmussen University (Tampa, FL) in Sept 2013", "Interview Descriptions": "Spoke with the hiring manager, and then had a phone interview again with another personnel.  Questions were pretty much basic in comparison with other interviews I had thus far.  I do need to say that the interview process, itself, was kind of long because you have to talk with so many different people.", "Interview Questions": "Basic ... traditional questions.  Tell me about yourself, what are your strengths and weaknesses, how would you handle \"this\" situation?  I think as long as you do your research on the company, in this case this college, and know exactly what your job duties are I thought the interview was pretty traditional."}, {"date": "1 May 2013", "title": "Account Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rasmussen University (Bloomington, MN)", "Interview Descriptions": "I had a total of 4 interviews (1 phone, 3 in person) and was asked to take a personality assessment. Each interview was with two new people (was under the impression it would only be with one each time). The third interview I shadowed another account manager for about 45 min.", "Interview Questions": "Walk us through your resume, how do you stay motivated, why Rasmussen, what do you like about the position, what did your last supervisor say in your last review, why did you leave your previous position, what can you bring to the table, how will you make sure you're successful in this position, etc."}, {"date": "26 Apr 2016", "title": "Student Records Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rasmussen University (Bloomington, MN) in May 2013", "Interview Descriptions": "Interviewed with a recruiter over the phone and it was very brief. Spoke about why I applied and my experience. I later got an in person interview with the Campus Director and we went more into dept about my experience and how it applied to higher education. I then came back for an interview with the management staff and the team, and had an additional interview over the phone with the VP. Very long process, drawn out for three months.", "Interview Questions": "When faced with a challenging student situation, such as it is time to withdraw them from their classes, how would you handle it?"}, {"date": "21 May 2013", "title": "Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rasmussen University (Oakbrook Terrace, IL) in Apr 2013", "Interview Descriptions": "I found the posting on career builder and submitted an application online. About three weeks later I initially spoke with corporate recruiter for a 20 minute phone interview. Was called in to meet with the VP, a member of HR, and an attorney for 3 30 minute interviews. The process was organized and all the people were nice. Seemed like a great place to work.", "Interview Questions": "There was no difficult question. One of the three in-person interviews was only focused on my background and college experience, while the other two seemed to be more traditional."}, {"date": "19 Mar 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at Rasmussen University", "Interview Descriptions": "Long but fair", "Interview Questions": "What did you not like about your old job"}, {"date": "30 Apr 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rasmussen University (Maitland, FL) in Mar 2013", "Interview Descriptions": "Two interviews, one with Assistant Director one with Director. Experience questions and what if questions. What would you do if.... In your passed how did you react when someone.... If you had to talk to someone who was rude with you what would you do?", "Interview Questions": "Sales Experience"}, {"date": "4 Nov 2015", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rasmussen University (Tampa, FL) in Feb 2013", "Interview Descriptions": "First by phone with HR. After this was complete, I was sent an email with a link to do an online skills assessment. This involved a call center simulator - listening to a phone message, then entering in the system, and placing an order for a customer. There was also a personality assessment that was sent online as well. Once this was complete, there was a phone interview with the department director (what would have been my boos). Then in person with department head and director of the campus. I think this is where the issue was with my not being chosen. She was a tough nut to crack, it was around 5:30 p.m. and she was clearly ready to get out of there, so I felt hurried. The department director communicated with me and expressed her disappointment that I wasn't chosen. No sour grapes - this really wouldn't have been a good move for me.", "Interview Questions": "How comfortable are you selling over the phone? How comfortable are you with meeting call volume expectations? How ill you work in an open office setting? "}], [{"date": "23 Feb 2013", "title": "Admissions Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rasmussen University (Tampa, FL) in Dec 2012", "Interview Descriptions": "I submitted a resume online, received a phone call 3 weeks later.  I had a 30 min phone call with the recruiter.  3 weeks later, I had a telephone interview with the Director, who would be my immediate supervisor. We talked for about 20 mins, it was conversational. She indicated that she wanted me to come to the campus for an onsite interview, job-shadow someone in the position, and meet the campus director. That happened quickly - in about 5 days. I went to the location, spent 4 hours there.  2 days later, I received a rejection email.  I was a little disappointed - I felt like the time I spent there warranted more than just a \"thanks but no thanks\" generic email.  It was a positive experience.", "Interview Questions": "Do you have specific experience meeting sales goals/quotas?  How did you meet those goals?  What is your ideal co-worker like? Why do you want to work here? How would your current supervisor describe you in 3 words?"}, {"date": "15 Feb 2016", "title": "Dean of Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rasmussen University in Sept 2012", "Interview Descriptions": "The process was lengthy with a lot of individual interviews. Several interviews had more than one interviewer. The interviewers were friendly and asked good questions that seemed to pertain to the position.", "Interview Questions": "What is your ultimate career goal?"}, {"date": "16 Mar 2014", "title": "Dean of Academics Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Rasmussen University (Chicago, IL) in May 2012", "Interview Descriptions": "7 rounds of interview starting with corporate recruiter and moving on to various executive from vice presidents of academics affairs to regional vice presidents", "Interview Questions": "Why would you leave your previous career to join academics"}, {"date": "24 May 2014", "title": "Associate Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Rasmussen University (Oak Brook, IL) in Feb 2012", "Interview Descriptions": "1. Got contacted by the hiring manager via social networking site\r\n2. Phone interview with the hiring manager. Asked to come for onsite.\r\n4. Onsite interview with multiple people. Asked about similar prior experience (work wise). A couple of phone interviews while onsite.", "Interview Questions": "What are your strength and weakness ? Where do you see yourself five years from now ?"}, {"date": "17 Oct 2016", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Rasmussen University (Lake Elmo, MN) in Jan 2012", "Interview Descriptions": "Very in-depth interview process -- multiple phone and in-person interviews. This is because the organization really tries to vet new hires -- it's a good thing. Most people that are employed at Rasmussen College stay there for a long time.", "Interview Questions": "How would you get a needle out of a haystack?"}, {"date": "10 Feb 2013", "title": "Student Records Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Rasmussen University (Bloomington, MN) in May 2011", "Interview Descriptions": "Phone interview was about 5 minutes. Interview with the director was interesting and fun. Then interviewed with supervisor of my soon to be department and manager. They made me the offer and I took it.", "Interview Questions": "N/A"}, {"date": "21 Feb 2015", "title": "Adjunct Instructor - Medical Assisting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rasmussen University (Ocala, FL) in Apr 2011", "Interview Descriptions": "Found the position on Craigslist, I believe.  Interviewed by phone with CP, very pleasant and personable.  Set up an in person meeting in Ocala, wherein we spoke about my prior experience, my desire for part time employment.  After that I met with the Program Director or CP's superior who was also very professional, easy to speak with, etc.\r\n\r\nAfter being offered the position, I was given the Syllabus, books, and other materials which I would be presenting.", "Interview Questions": "I believe it was about my experience in the medical profession."}, {"date": "22 Aug 2014", "title": "Online Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Rasmussen University (Tampa, FL) in Jul 2010", "Interview Descriptions": "A long hiring process that literally consisted of at least 5 interviews. There is a lot of vetting. The process took over 2 months to complete, with several phone and in-person interviews, with often silence in between. It was a bit nerve wracking, but I kept getting the call back, so that isn't a bad thing overall.", "Interview Questions": "They look for a lot of personality driven earmarks of an instructor. You must be credentialed, experienced, and have a passion for teaching. The overall process is difficult, as you have to impress a lot of people along the way. It's not that they are being rough, you just know that you are one of many interviewing for the same role, they are extremely thorough in the questioning, and the final answer is a group vote, so not just one person can be impressed, but everyone."}, {"date": "11 Sept 2012", "title": "Technical Support Center Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rasmussen University (Maitland, FL) in May 2010", "Interview Descriptions": "Phone interview then face to face.", "Interview Questions": "None"}, {"date": "23 Nov 2010", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Rasmussen University (Burr Ridge, IL) in Apr 2010", "Interview Descriptions": "The interview itself went just fine.  I spent about an hour with the two senior systems engineers and we went over my job history, projects, their environment, etc.  We got on great and I fully expected an offer.", "Interview Questions": "N/A"}], [{"date": "21 Mar 2010", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Rasmussen University (Green Bay, WI) in Mar 2010", "Interview Descriptions": "My entire interview experience with Rasmussen was very positive. They informed me up front that the process is 5-6 interviews, and a combination of both phone interviews and in-person interviews. \r\n\r\nMy first interview was at an employment fair, where I was general questions regarding my skills and abilities, with questions asking for past examples of times when I demonstrated these skills and abilities. My second interview was a phone interview with HR that mostly consisted of basic questions, such as my authorization to work in the US. My third interview was in-person, where I met with three people.\r\n\r\nAll interviews gave me the opportunity to ask questions about the company. The emphasis from the start has been on the fit for both parties. Overall a very positive experience.", "Interview Questions": "Are you goal oriented? "}, {"date": "5 Nov 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Rasmussen University (Eden Prairie, MN) in Feb 2010", "Interview Descriptions": "7 interviews, including one phone interview.", "Interview Questions": "Do you hate to loose or love to win?"}, {"date": "31 May 2012", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Rasmussen University (Brooklyn Park, MN) in Mar 2009", "Interview Descriptions": "It was your standard interview.  I first met with both Directors of Admissions.  One played good cop; the other played bad cop.  They didn't ask many behavioral questions.  It mostly consisted of \"Tell me about your experience at _____.\"  At the end of the interview, they had another Admissions Representative take me on a tour of the campus.  This is where you need to watch out.  Most people will feel as if the interview is over and therefore can say whatever they want to the person giving the tour.  THIS IS NOT THE CASE.  The person giving the tour will give their impressions of you to the Directors of Admissions, so make sure you continue to treat that portion of your visit as you would treat the actual sit-down interview.  Next, I met with the Campus Director.  It felt somewhat laid-back, so he was not intimidating at all. The same types of questions were asked.", "Interview Questions": "Nothing -- they asked very typical, straightforward questions about my past. No \"Why do you think you are qualified for this position?\" or behavioral questions.  "}, {"date": "25 Feb 2013", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Rasmussen University (Ocala, FL) in Feb 2009", "Interview Descriptions": "the interview process was simple and easy. The interviewing Dean at the time was friendly and helpfull and explained what the school was looking for. The paperwork was straightforward and done in an efficient manner. No surprises in the process at all. Process was quick and was accomlished in less than a week; this was probably due to the need for speed to fill a vacant position with the term starting within 2 weeks.", "Interview Questions": "what is your view on the education process and your role in it."}]]