[[{"date": "12 Apr 2023", "title": "LVN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Midland Memorial Hospital (Dallas-Fort Worth)", "Interview Descriptions": "friendly not too stressful. create a descent environment. not intimidating. relax and everybody feel like they can fit in within the organization. great culture and friendly . really nice there, you should come and have your interview if you are thinking about it. D not", "Interview Questions": "can you tell me about yourself?"}, {"date": "2 Aug 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Midland Memorial Hospital (Midland, TX) in Aug 2022", "Interview Descriptions": "friendly interview staff and the process was interactive throughout the period. it was tension free interactions and i was glad a conducive atmosphere was offered me to answer my questions with ease", "Interview Questions": "why i will like to work with them"}, {"date": "3 Sept 2020", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Sept 2020", "Interview Descriptions": "It was an online interview due to COVID. It was excellent and the process was seamless. It was slightly hard to hear but that was the only issue and it was a nice process otherwise.", "Interview Questions": "What motivates me? "}, {"date": "5 Aug 2019", "title": "Patient Registrar Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Midland Memorial Hospital (Midland, TX) in Aug 2019", "Interview Descriptions": "I was walked from HR to the Patient Registrar office and I was interviewed by two different departments.  Both individuals were very courteous and very informative. Both were very relaxed making for any jitters you might have to just float away.", "Interview Questions": "Did I prefer patient contact or to be behind the scene?"}, {"date": "28 Apr 2020", "title": "CT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Midland Memorial Hospital (Midland, TX) in Feb 2019", "Interview Descriptions": "The interview  was with the department manager and lead tech. Questions were asked about my previous experiences. Overall it was an expected experience and I was offered the position.", "Interview Questions": "Previous experience "}, {"date": "27 Feb 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Dec 2018", "Interview Descriptions": "My interview was very casual. I think the director was so desperate for nurses at the time that she was taking anyone and everyone. She met me at the elevators and we just sat and chatted in the lobby for about 15 minutes. She then walked me to HR where I filled out more paperwork.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Jul 2018", "title": "Valet Attendant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Midland Memorial Hospital (Midland, TX) in Jul 2018", "Interview Descriptions": "It was nice and i didn't feel uncomfortable at all. And they were very polite and had a smile with every question they asked i got a good vibes and i think it will be wonderful to work there", "Interview Questions": "How do i treat others "}, {"date": "4 Jul 2018", "title": "Plant Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Jun 2018", "Interview Descriptions": "Went to HR and then walked down and spoke with the Operations supervisor.  It was an informative interview.  All job descriptions were provided.  They were very informative and provided answers for any questions I had before I even had the chance to ask.", "Interview Questions": "My knowledge and preferences relating to the job. "}, {"date": "23 May 2018", "title": "Collector Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Midland Memorial Hospital (Midland, TX) in May 2018", "Interview Descriptions": "Interviewed with HR Department and then interviewed with Supervisor also took a small typing test that was kind of difficult had longer nails that I am used to and not used to typing with them did not do very well, for position had a very nice interview and did get a lot of information does sound like a company I would like to work with", "Interview Questions": "My job experience and why I would like to work with Midland Memorial Hospital."}, {"date": "23 Jan 2018", "title": "PCA Labor and Delivery Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Midland Memorial Hospital (Midland, TX) in Jan 2018", "Interview Descriptions": "After applying it only took a couple days for me to hear back from the HR rep and scheduled a interview immediately then after my interview it was only hours that I was contacted with a offer for the position", "Interview Questions": "What is your strength and weakness as a personal trait "}], [{"date": "29 Jan 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Midland Memorial Hospital (Midland, TX) in Jan 2018", "Interview Descriptions": "It was short but to the point and they were so kind and explained everything well. The questions were easy to understand and answer.  I was explained what was expected of me from the start.", "Interview Questions": "Are you a leader or follower? "}, {"date": "21 Dec 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Midland Memorial Hospital (Midland, TX) in Dec 2017", "Interview Descriptions": "Easy and time efficient and the human resource staff was very friendly and has a smile all through the process. She made me feel very comfortable and relax. The interview to me was like having a conversation with a friend. It is one of the best interviews I have had.", "Interview Questions": "Why I chose to work at midland memorial hospital"}, {"date": "5 Oct 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Oct 2017", "Interview Descriptions": "It was a great interview. I met with HR first. She explained the role and hours for the position also the benefits. Then I met with the team I would be working with. It was a positive experience and looks like a great place to work!", "Interview Questions": "Why did I choose Midland hospital to apply."}, {"date": "12 Mar 2017", "title": "LVN Medical Unit Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Mar 2017", "Interview Descriptions": "Interview process was excellent. The fact that was my 3rd time to apply and never received calls back even whenever I called for a follow up is ridiculous. I had heard nothing but great things about the hospital itself, but considering the fact no one returned emails or phone calls gave me a bad vibe.", "Interview Questions": "Why would I want to work at midland memorial?"}, {"date": "11 Feb 2017", "title": "Central Supply Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Feb 2017", "Interview Descriptions": "I applied online for the position, and received a phone call from HR within 3 weeks to set up the interview. Upon arrival, I was shown to the Human Resources office, where I was warmly greeted and taken to the Central Supply office where the interview was to take place. I spoke with the head of Central Supply and a member of management, as well as the representative from HR. The tone was conversational, and I was informed of many aspects of the job, as well as talking a bit about my background. I was given opportunity to ask any questions I might have, and then was given a tour of some of the areas involved in the position.", "Interview Questions": "I was asked about my comfort level with using a computer, and also my experience with automated inventory systems."}, {"date": "13 Mar 2017", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Midland Memorial Hospital in Feb 2017", "Interview Descriptions": "It was a wonderful experience. Working with Duarte, was not like any Recruiter I had worked with before. His openness, candidness, and knowledge of the company was amazing. We did a couple of Interviews that took a little longer than an hour. He was professional and friendly. Seems like a great company, however the area was not what I was looking for. Still one of the best candidate experiences I have ever had. Thanks Duarte.", "Interview Questions": "Tell me about yourself. Standard behavioral health indicator type questions. "}, {"date": "29 Nov 2016", "title": "Clinical Informatics Analyst Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Midland Memorial Hospital (Houston, TX) in Nov 2016", "Interview Descriptions": "I applied for the clinical informatics Analyst position  in Midland.  I was interviewed by 2 people. tThe interview  was for 20 minutes. Each took turns asking resume based questions.  I was given the opportunity to ask questions and explain my previous experiences. The two people  were nice and asked straight to the point questions.  The process went great. Also they kept to time.", "Interview Questions": "I was being asked what is my biggest challenge."}, {"date": "21 Sept 2016", "title": "House Keeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Midland Memorial Hospital (Midland, TX) in Sept 2016", "Interview Descriptions": "When I arrive for my interveiw the HR maneger introduced her self to me. she palitly explained to me the process of my duties of my position. As well as the company benifits and also the pay proces.", "Interview Questions": "How do you work best in groups or by myself"}, {"date": "19 Sept 2016", "title": "Server Support Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Midland Memorial Hospital (Midland, TX) in Sept 2016", "Interview Descriptions": "I met with the IT Operations manager and the two existing Server Support Analysts.  The total interview lasted about 90 minutes.  I believe it could have been much shorter, but I like to ask questions and the interviewers were very open about describing the current infrastructure, plans and culture of the organization.", "Interview Questions": "I was asked to describe my work history and to describe a typical work day at my current jobs.  I was asked about familiarity with VM Ware, group policies and a few other tech topics."}, {"date": "13 Nov 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Aug 2016", "Interview Descriptions": "Interview was 2 parts, first with HR, then with the nurse intern manager. They were friendly and welcoming, but they knew exactly what they wanted. Very informative and knowing of their duties as a manager.", "Interview Questions": "What is the goal for Midland Health?"}], [{"date": "2 Aug 2016", "title": "Policemen Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Midland Memorial Hospital (Midland, TX) in Aug 2016", "Interview Descriptions": "The interview process was very smooth and comfortable. The questions asked were pertinent to job and very fair assessment. The panel was very professional and knowledgeable. The interview was thoroughly done and I received information about the process.", "Interview Questions": "Scenarios about job."}, {"date": "15 Jul 2016", "title": "Food Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Midland Memorial Hospital (Midland, TX) in Jul 2016", "Interview Descriptions": "Overall it was good interview. The interviewer was very nice and polite. I just wish that would tell you if you got the job or not the same day,so that you can know if you should continue seeking employment or not.", "Interview Questions": "What was my previous exerience like when I worked there before?"}, {"date": "27 Jul 2016", "title": "Room Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Midland Memorial Hospital (Midland, TX) in Jul 2016", "Interview Descriptions": "The interview process was very thorough due to the heave customer service that is involved for the position. I really liked how the recruiter emphasized the importance of customer service and putting the patient first. I also liked how the recruiter asked the interview questions and we were able to talk more in depth. One of the best job interviews I ever had. The recruiter really does a great job to get to know you and how you could be a good fit for the position applied.", "Interview Questions": "Name a time you had to handle a difficult situation and how did you handle it?"}, {"date": "26 Jul 2016", "title": "Electrian III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Midland Memorial Hospital (Midland, TX) in Jul 2016", "Interview Descriptions": "Did a panel interview with three interviewers. Very relaxed and easy going atmosphere. Interviewers were very nice and personable. Did not make me feel uncomfortable or give me a question or scenario that I could not answer or describe my feelings or reactions to or how I would have handled a situation.", "Interview Questions": "Questions were easy and about my knowledge and skills and experience based."}, {"date": "22 Jul 2016", "title": "Room Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Midland Memorial Hospital (Midland, TX) in Jul 2016", "Interview Descriptions": "My interview was first with an HR recruiter. She was very people oriented. She made it easy to talk to. She was very professional. Then I interviewed with Iner, she was very people oriented as well. The environment was very energetic. I thought my interview went quiet well. Hope to hear something soon.....", "Interview Questions": "Why do I want to work for midland memorial hospital."}, {"date": "25 Jun 2016", "title": "Surveillance Operator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Midland Memorial Hospital (Midland, TX) in Jun 2016", "Interview Descriptions": "I was promptly contacted by the appropriate HR representative to ask me a few things over the phone. At the same time, we set a date and time for an interview. The day of the interview came and the HR rep was ready to interview me, no waiting. The interview was a very pleasant experience.", "Interview Questions": "One of the questions asked during the interview were...Since you'd be part of the team that would serve as the face of MMH, how would you handle a person (patient) who has become irate due to the fact that they just got diagnosed with a terminal illness?"}, {"date": "10 Aug 2016", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Midland Memorial Hospital (Midland, TX) in Jun 2016", "Interview Descriptions": "I had an initial phone interview with supervisor to discuss the position and the process.  A face to face interview with him, one with the leadership team, one with potential staff members, and one with HR.  The process was explained step-by-step as it went on.  When decisions were made to proceed to the next step, MMH was timely in scheduling.  I enjoyed getting a well-rounded look at the organization and interact with various people who would become my colleagues.  Everyone was pleasant and thorough.  I had an opportunity to ask questions throughout and had them fully answered.", "Interview Questions": "How have you influenced people to change when they were resistant to the process?"}, {"date": "17 Feb 2016", "title": "Human Resources Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Midland Memorial Hospital (Midland, TX) in Jan 2016", "Interview Descriptions": "My resume was sent to a recruiter in HR. I was phoned the next day by a recruiter to discuss my resume and what positions they had available currently. She was friendly, efficient and quick! I was contacted by the recruiter later on that day to set up an interview for that week. I met with the AVP of the department who was courteous and forthcoming. I was called that day with a job offer. I went in the next week to fill out paperwork and provide my ID (DL and SSN card required.) I was then scheduled for a 3-day orientation, which also included Culture of Ownership class ( creates a culture of positive attitudes and sets the tone for the culture of the workplace. It was great!)", "Interview Questions": "They asked about my previous work experience and how it fit into the position I was applying for. They asked me what other people's perception was of me when first meeting me."}, {"date": "21 Jun 2014", "title": "RN Contract Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Midland Memorial Hospital in Jan 2014", "Interview Descriptions": "I was submitted via computer by my recruiter. I received a call from interviewer on my cell  number and was interviewed by 2 supervisors at the same time.  I then was offered the contract by my recruiter.", "Interview Questions": "N/A"}]]