[[{"date": "28 Apr 2023", "title": "Student Tech Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Massachusetts (Lowell, MA)", "Interview Descriptions": "I applied online through Jobhawk. I got an email to schedule an interview with the manager. The interview was straightforward. Not much technical knowledge was required. The manager was great.", "Interview Questions": "Do you have any customer service experience?"}, {"date": "13 Mar 2023", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "Spoke to a man for 30 minutes. He had zero interest in what I had to say and seemed like he was only in the meeting because he had to be. Expressed very little interest in my candidacy.", "Interview Questions": "Please tell me about yourself"}, {"date": "10 Mar 2023", "title": "MakerSpace Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "I applied a couple weeks after the job being posted. Come to find out “it was already filled.” As if anyone could possibly interview and hire someone in a couple weeks, over Christmas no less. UMass is notorious for filling its staff with friends and family. The job postings are just bureaucratic and for show. My roommates are grad students at UMass and their departments are filled with this. Anyway, apply away, but be aware that your chances are rigged and you might be wasting your time.", "Interview Questions": "Mostly just standard, generic questions."}, {"date": "14 Oct 2022", "title": "Academic Program Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Massachusetts", "Interview Descriptions": "The entire team you will be potentially working with was involved in the interview process. This provided an opportunity to get to know the company culture and team dynamic. There was also plenty of time to ask your own questions.", "Interview Questions": "How do you handle conflict?"}, {"date": "28 Sept 2022", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "First, need to check any interview notifications published on the job market or university website. Then apply through the online channel to consider the application. Once you get the reply followed up with interview with multiple faculty.", "Interview Questions": "Why you are interested in this job?"}, {"date": "3 Apr 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "The interview was relatively easy.  I interviewed with two people, one person was a supervisor and another was the current person in the position. Both were friendly and it was a relaxed environment.", "Interview Questions": "How do you plan to engage with graduate students?"}, {"date": "16 Feb 2023", "title": "Campus Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Massachusetts in Apr 2022", "Interview Descriptions": "Much like most companies, the process was long. It took a few months for the entire process to be completed. The interview was via zoom and it consisted of all of the appropriate department heads.", "Interview Questions": "Why do you feel you would be a good fit for this position?"}, {"date": "14 Apr 2022", "title": "Senior Doctoral Program Support Specialist, School of Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Massachusetts (Los Angeles, CA) in Mar 2022", "Interview Descriptions": "This was a standard interview process except for some less than legal questions. \r\n\r\nThe interviewers noticed I had some historically Christian Universities I had worked for in the past and became preoccupied with asking me religious-stereotype questions for some reason. No other department did this.", "Interview Questions": "Here are a few gems that I doubt were on the official questions list:\r\n\r\n1. I know religious people go on missions trips. Are you going to be gone for months on end for a religious trip? \r\n2. I knew a religious person once that was offended by something she heard. Are you going to be offended by things you hear if we hire you? \r\n3. Our community is diverse, how do you see yourself given your background? \r\n4. A series of odd and unclear comparisons with other religious people of varying backgrounds that assumed we were the same. I was not sure what they were trying to ask. \r\n5. You do a lot of volunteer work, will you be able to work full time?\r\n6. In the very last question, I was asked in the final interview, they asked me for protected medical information and appeared short when I voiced some ethical concerns related to a potential religious accommodation. "}, {"date": "22 Jan 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "Starting out was friendly. Basic welcoming and ask info about my self. After that, they ask many questions about my goals, etc. The process took about 10 minutes. They tried their best to make me feel welcome", "Interview Questions": "Where do you see yourself 5 years from now?"}, {"date": "17 Jun 2020", "title": "Research Associate II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Massachusetts", "Interview Descriptions": "The phone & onsite interview  was great, except the VP, she was horribly rude to me & said how can I ask her what their expectations of an ideal candidate are while I should just tell them what I can offer. I had to follow up every week with the HR only to get an offer of level I position, because an internal employee (lesser qualification and experience) was given the position and they did not want to hire a level II.", "Interview Questions": "Why am I looking to change from Industry to Academia?"}], [{"date": "3 Dec 2019", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "Pretty good. Asked me about my work experience and stuff. THings like what I have done in the past and what my skills are, a bunch of coding questions.", "Interview Questions": "Javascript promise handling"}, {"date": "20 Sept 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Massachusetts", "Interview Descriptions": "No interview process. Accepted straight into program after submission of application. Application looked at prior experience, GPA, and GRE scores. After acceptance invited for onsite tour of campus and facilities.", "Interview Questions": "No interview process. "}, {"date": "9 Apr 2019", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "It was a day long process where I interiewed withthe director of the office, the departmental team, and division head. This was also done AFTER I got through the 1st round of interviewing with the hiring committee.  Presentation was also required on topic of my choosing.", "Interview Questions": "Tell us a time about when something did not go as planned?"}, {"date": "12 Jan 2019", "title": "PhD Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Massachusetts", "Interview Descriptions": "On the phone, no in person interview, offered to meet but wasn't required. Tried to match student's research interests with faculty who also worked in the field - small department meant that there weren't as many matching opportunities", "Interview Questions": "What type of work experience have you had?"}, {"date": "5 Sept 2022", "title": "Program Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Massachusetts (Amherst, MA) in May 2018", "Interview Descriptions": "3 interviews: one via Skype, one in-person with the whole team, and a final one with the Associate Dean. All interviews were very comprehensive and asked multiple questions about my work history and specifics about the job I was applying for.", "Interview Questions": "Describe your customer service experience."}, {"date": "25 Jan 2018", "title": "Research and Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Massachusetts in Jan 2018", "Interview Descriptions": "Smooth and quick. Set up a phone interview with the hiring manager after receiving a call from the recruiter. The hiring manager was very frank and open with me and provided a good overview on the process.", "Interview Questions": "Describe your weakness."}, {"date": "26 Mar 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Massachusetts (Mattapan, MA) in Jan 2018", "Interview Descriptions": "I applied via LinkedIn and heard back fairly quickly from HR. A phone interview with the hiring manager was set up followed by an on site interview with 4 people. Everyone was very nice and I was told I would hear back within a week or two. Instead, I never heard back at all. About 3 weeks after I sent an e-mail following up and was ignored. I understand if they went with another candidate, however, it would be nice to hear back after coming on site. It has now been 2 months and still nothing.", "Interview Questions": "Tell me about your experience, what is the ideal working environment for you, how do you like to be managed?"}, {"date": "10 Nov 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Massachusetts in Apr 2017", "Interview Descriptions": "Due to distance we had a phone call for the interview. They had multiple people working on the hiring process, so they were consulting with each other about the candidates. They provided more information about the company for the majority of the call, and it seemed as though the position was extremely flexible. Most of the questions were regarding logistics, such as if I would be able to travel to the location, and then there were a few about past experiences.", "Interview Questions": "They asked about reliable transportation and whether I would be able to drive myself to the site. "}, {"date": "8 Apr 2019", "title": "Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Massachusetts (Lowell, MA) in Jan 2017", "Interview Descriptions": "There was no interview for me. I had taken the class in a previous semester and had excelled. I was looking for part-time work at the school and asked the professor and was immediately given the position.", "Interview Questions": "N/A"}, {"date": "26 Jun 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Massachusetts (Amherst, MA)", "Interview Descriptions": "I looked at the professor's work and like it. It matched my interests thus applied. They asked me mostly from resume and machine learning questions. Interview process was informal. I received a call from professor and was asked questions about my experience and machine learning. Then I went for a 1:1 discussion.", "Interview Questions": "machine learning questions and questions based on my previous work"}], [{"date": "29 Apr 2017", "title": "Off Campus Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Massachusetts (Amherst, MA) in May 2016", "Interview Descriptions": "I had to create a video application and then was asked one on one some quick questions about myself and what I would do in certain situations. This was not very formal and led to a good relationship.", "Interview Questions": "Asked about some strengths and weaknesses "}, {"date": "3 Nov 2016", "title": "Co-Op Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Massachusetts (Lowell, MA) in Mar 2016", "Interview Descriptions": "Interview Process was fairly simple. Only had one interview with my current boss. It was the first job I had applied to as a Co-Op student and was pleasantly surprised when I was selected to work in the IT department from about 8 other students that were competing for the position.", "Interview Questions": "Why do you think you are a good fit for this job"}, {"date": "28 Jan 2016", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Massachusetts (Lowell, MA)", "Interview Descriptions": "General questions regarding the job skill were asked. It was site interview instead of phone interview. . Excellent organization and communication skills were required to prepare the report or SOP for the experiment. Software skill and database management also required for huge data set prepared from experiment daily/project basis. There was a question regarding the authorization status in working eligibility (visa support or green card/citizenship)", "Interview Questions": "eligible to work?"}, {"date": "30 Jan 2017", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Massachusetts in Dec 2015", "Interview Descriptions": "I was referred by a colleague from a previous job to work at the library, and I contacted the supervisor who asked me to come in to sign paperwork. The interview was a formality: as long as you can work the hours and are trainable, it is likely that you will get the job.", "Interview Questions": "Have you worked in customer service before?"}, {"date": "6 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Massachusetts (Amherst, NY)", "Interview Descriptions": "Questions about your interests regarding research and future plans. You can look up the professors online to see what types of research they do and then schedule a meeting with professors who's research interests you the most. Also make sure to check to see if the professors could offer you funding if that is important to you.", "Interview Questions": "No specific questions"}, {"date": "27 Dec 2015", "title": "Conference Housing Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Massachusetts (Amherst, MA) in Jun 2015", "Interview Descriptions": "Ten min meeting consisting of about three questions. Super easy, low stress environment. Interview was scheduled in a week after I submitted my application. Took a couple days to hear back.", "Interview Questions": "Why should I pick you for this job?"}, {"date": "30 Mar 2015", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Massachusetts (Amherst, MA)", "Interview Descriptions": "Interview questions based directly on qualifications, skills and experience listed on job description.  First interview was with the hiring committee which was a panel of 5.  After passing that round was invited back for a one on one interview with hiring authority, who would be the direct manager for the position. Both rounds were friendly and professional.", "Interview Questions": "Asked to tell about experience using the specific software listed on job description"}, {"date": "31 Oct 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Massachusetts (Boston, MA) in Feb 2015", "Interview Descriptions": "While we unfortunately can't read minds, we'll give you the next best thing: a list of the 31 most commonly asked interview questions and answers.\r\n\r\nWhile we don't recommend having a canned response for every interview question (in fact, please don't), we do recommend spending some time getting comfortable with what you might be asked, what hiring managers are really looking for in your responses, and what it takes to show that you're the right man or woman for the job.", "Interview Questions": "Wouldn't it be great if you knew exactly what a hiring manager would be asking you in your next interview?"}, {"date": "23 Mar 2016", "title": "Ra Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Massachusetts (Amherst, MA) in Jan 2015", "Interview Descriptions": "they h.ad two round - individual and group. the individual is a 1:1 with 2 to 3 current RAs and senior members of ResLife. The people are super friendly and ask questions pertaining to your resume and job expectations.", "Interview Questions": "Why do you want the job?"}, {"date": "2 Nov 2017", "title": "Department Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Massachusetts (Amherst, MA) in Nov 2014", "Interview Descriptions": "One 25 minute interview. At Supervisor's desk. Supervisor seemed distracted and tense, possibly because we had no privacy and the Group/Panel Interview was late getting started and truncated in length due to its late start. Panel's questions and follow-ups seemed canned and in many cases ignorant of the position's core function.", "Interview Questions": "What kind of experience do you have in an academic environment?"}], [{"date": "14 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Massachusetts (Amherst, MA) in Sept 2014", "Interview Descriptions": "I applied online, and got a phone interview a week later, then face to face interview with the primary investigator of the lab. I got the notice a week after that", "Interview Questions": "nothing special, very basic, focused more on the research experience"}, {"date": "11 Jun 2015", "title": "Communications and Marketing(Student Employment) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Massachusetts in Sept 2014", "Interview Descriptions": "Had an in-person interview after emailing directly regarding job listing. The 1-1 interview lasted about an hour and discussed all the relevant topics, including writing ability and familiarity with various software tools. As this was a somewhat technical position, knowing the tech side was very important to the role, in addition to attention to detail.", "Interview Questions": "How do you feel your previous experience(s) help you with this position?"}, {"date": "12 Aug 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Massachusetts (Boston, MA) in May 2014", "Interview Descriptions": "Brief Phone interview , asked so many questions about data warehousing and SQL.Then she asked about Hadoop Eco system and java programming .Brief Phone interview , asked so many questions about data warehousing and SQL.Then she asked about Hadoop Eco system and java programming .", "Interview Questions": "Joins and sql server 2012"}, {"date": "7 Jul 2015", "title": "Media Lab Consultant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Massachusetts (Dorchester, MA) in Jan 2014", "Interview Descriptions": "A bit weird since it was slightly, well honestly speaking, very informal. There was no set structure, no dress code, and the offices seemed to be very unorganized. Don't let that stop you honestly since it is normal to see that on a day to day basis, and it will not interfere with your work.", "Interview Questions": "Have you worked before?\r\ndo you have work study"}, {"date": "24 May 2017", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Massachusetts (Shrewsbury, MA) in Oct 2013", "Interview Descriptions": "I applied for the job and was contacted after about a month since they leave their job posting open for about 30 days to get a good pool of candidates. It was a 3 step interview process. All interviews were in person and with people I would be directly working with.", "Interview Questions": "Why was I best suited for this job?"}, {"date": "9 Sept 2013", "title": "Undergraduate Nano Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Massachusetts", "Interview Descriptions": "The application process varies from school and company, tedious to apply to many, but must be done, I applied to 11 and was only accepted at umass lowell. There was no interview process, I emailed them insuring I was still being considered and I was accepted. They strive for a 50/50 balance male to female, which is concerning considering the number of women compared to men in the field is much less than 50 percent. Ask for a travel stipend, demand, other schools give one.", "Interview Questions": "No questions were asked."}, {"date": "16 Jul 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at University of Massachusetts (Dartmouth, MA) in Sept 2013", "Interview Descriptions": "Meet with the Professor.\r\n\r\n1. Background info.\r\n2. Discuss common passions and interests.\r\n3. Convince that you are right for the research role based on your prior experience and interests in the field that the professor is in.", "Interview Questions": "Describe your favorite research project where the solution wasn't obvious."}, {"date": "9 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Massachusetts (Amherst, MA) in May 2013", "Interview Descriptions": "Nice and peace during an open house event. There are a lot of students in one room, and the students will describe them graduate life one by one. It is interesting experience. And Umass is a nice university.", "Interview Questions": "Describe the experiences in graduate school"}, {"date": "23 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Massachusetts (North Dartmouth, MA) in Dec 2012", "Interview Descriptions": "Wait months for a call. Sit with 5 panel committee.  Wait more.  Get job. Report. No orientation to speak of. Make connections and you'll get by.  If you don't get it you usually won't get a phone call. \r\n\r\n\r\n\r\n.....\r\n.....\r\n.....\r\n.....", "Interview Questions": "Prioritization mostly. Know your titles and who gets your attn first. Start with Chancellor then work your way down."}, {"date": "24 Jul 2015", "title": "Pot Washer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Massachusetts (Amherst, MA) in Sept 2012", "Interview Descriptions": "Its not much of an interview. You pretty much go in, meet with the manager and fill out an application. In order to be eligible for employment its necessary to provide two separate forms of identification (i.e. a Drivers License and a Passport, your student ID is not considered valid). From my experience and others that have worked in other UMass Dining Commons, unless you give them a reason not to employ you, you'll get the job.", "Interview Questions": "Do you have two forms of identification?\r\nWhat is your past experience?"}], [{"date": "26 Jul 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Massachusetts (Boston, MA) in Jan 2012", "Interview Descriptions": "Applied through the postings on the graduate blog. Then got in touch with the professor. 2 stage interview.", "Interview Questions": "Asked the best practices for the things that I will do during my assistantship."}, {"date": "14 Mar 2015", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Massachusetts in Jan 2012", "Interview Descriptions": "Quick and easy interview for the most part. Managers usually on the basis of connecting with them, not so much for experience. There should be a lengthier interview process with more in-depth questions due to the fact that there is students' personal information involved in the job. As a CSA you also have access to students' rooms, so there needs to be a better process of interviewing.", "Interview Questions": "Why should I hire you as a customer service associate?"}, {"date": "11 Jun 2012", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Massachusetts (North Amherst, MA) in Sept 2011", "Interview Descriptions": "Overview of skills and background", "Interview Questions": "What are your skills?"}, {"date": "18 Nov 2011", "title": "Digital Repository Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Massachusetts (Amherst, MA) in Jul 2011", "Interview Descriptions": "I found the job opening on the university's human resources website, and applied online following their procedures.  Almost exactly one month later, I received an e-mail from someone in the college library's HR department, asking me to call to set up a telephone interview.  I reached her by phone and found her to be very helpful and nice.  We set up a time and date for the interview.  She told me the names of a couple of the people who would be interviewing me.\r\n\r\nThe phone interview was with a panel of five librarians and other staff of the university.  They were using a speakerphone on their end, and it was difficult to hear them properly and, I suspect, for them to hear me.  They were all considerate, and responded with verbal feedback during the interview.  (I have had phone interviews where the people on the other end said nothing, making it hard to know if they could hear and understand me.)\r\n\r\nA couple of weeks later I received a letter informing me that someone else had been chosen for the position.", "Interview Questions": "Nothing unexpected was asked."}, {"date": "8 Jan 2012", "title": "Social Media/Advertising Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Massachusetts (North Dartmouth, MA) in Jul 2011", "Interview Descriptions": "Began with a very short phone interview. Then a 1:1 interview that asked about my strengths/weaknesses and why I was interested in the position.", "Interview Questions": "Why do you want this position?"}, {"date": "1 Aug 2015", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Massachusetts (Amherst, MA) in Apr 2011", "Interview Descriptions": "I walked in, asked the head custodian for a job and was called about a week later to start work. The process was very simple, which was good because I was a beleaguered college freshman who did not particularly want to be working in the first place. It was good that it was a simple process.", "Interview Questions": "There were no questions really, just whether I was willing to work weekends."}, {"date": "1 Dec 2011", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Massachusetts (North Dartmouth, MA) in Jul 2010", "Interview Descriptions": "Interviewed with the professor who I applied for. He's nice and asked few questions about my computer/office skill and how I know his previous assistant. He wanted to make sure is there any communication problem since I'm a foreign student. He wrote down my email address and mobile phone number and tell me the department committee will make the final decision.", "Interview Questions": "Do you know anything about credit bureaus?"}, {"date": "7 Jan 2012", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Massachusetts (Amherst, MA) in Jan 2010", "Interview Descriptions": "I was recruited by a colleague who knew my work. I interviewed with that colleague and the program director.", "Interview Questions": "Describe in detail a project in your most recent job."}, {"date": "27 May 2010", "title": "Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Massachusetts (Amherst, MA) in Dec 2009", "Interview Descriptions": "I had a phone interview, and told that there were 10 being interviewed. I was invited to campus and given about 5 days to prepare a presentation. I presented to a group of people and then met with the person I would be working for. I was told that due to the holidays i would hear in January. I did not hear until a letter came in march that I did not get the job, which I had figured out by then.", "Interview Questions": "What do you do to relieve stress"}, {"date": "27 Jun 2012", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Massachusetts (Amherst, MA) in Jan 2009", "Interview Descriptions": "As a student I walked into the cafe and talked with the manager. All I had to do was fill out an application and tell her how many hours I wanted to work. As long as you seem upbeat and not overly confident you'll get the job. I started the next day.", "Interview Questions": "Are you confident in your ability to handle drunk and sometimes violent customers?"}], [{"date": "3 Jan 2010", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at University of Massachusetts (Worcester, MA) in Feb 2008", "Interview Descriptions": "This was a typical graduate school application process. I Applied in December of 2007, and was asked to interview in February. The school paid for my flight, hotel, and food for the 3-day interview. The weekend consisted of dinner parties with faculty and students every night, followed by bar trips and/or parties. I interviewed with 4 professors for 30 minutes each on the actual interview day, and all interviews were conversational. They asked about my own undergraduate research, my interests, and why I wanted to go to graduate school. I asked about their research, and listened for the remaining time as they regaled me with their scientific knowledge.", "Interview Questions": "I was asked to design an experiment for a project I was unfamiliar with."}]]