[[{"date": "29 Jun 2023", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "As I recall, there was a relatively short phone interview, and then an in-person interview with the center director, which was rather formal in nature, along with a typing test.", "Interview Questions": "The interview questions were of the \"Tell me about a time when you.....\" sort of questions. Right along the STAR format."}, {"date": "7 Jun 2023", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Joplin, MO)", "Interview Descriptions": "Took weeks to hear back on application before interview was scheduled. On arrival was not even interviewed for position applied for, was told that spot was filled but that they figured I would be fine to interview for a different position. Process was very disorganized and when I asked questions they dodged or gave very vague answers.", "Interview Questions": "Why I wanted to work there"}, {"date": "18 May 2023", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy (Oklahoma City, OK)", "Interview Descriptions": "I had a self paced phone interview and was disconnected several times bc I have a T-Mobile phone. It was incredibly frustrating. You had 24 hours to do the interview and I didn’t have time to locate a different phone.", "Interview Questions": "Are you comfortable with prayer before meetings?"}, {"date": "15 Jun 2023", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy (Chesterfield, MO) in May 2023", "Interview Descriptions": "You have to take an assessment test, which takes a few hours, and to be told thanks for applying without an interview offer—a waste of time. Never will I apply to this organization.", "Interview Questions": "100 Question assessment and no interview offered. For just taking the test should automatically give you an interview. The test is toooooooooo long. 3 plus hours."}, {"date": "28 Apr 2023", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy (Chicago, IL)", "Interview Descriptions": "Phone screen, panel interview, video and video questions used to understand how you handle conflict resolved situations on a team of with clients. Second interview with director level staff. Shadow in program with team and clients.", "Interview Questions": "How would you handle…….? What would you do in this situation?"}, {"date": "1 Apr 2023", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy (Saint Louis, MO)", "Interview Descriptions": "Once you fill out the application and upload your resume you must complete a Talent assessment before you will receive an interview. The assessment may take 45 minutes to an hour. Make sure you have time to complete it.", "Interview Questions": "What does teamwork mean to you?"}, {"date": "19 May 2023", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Mercy (Rogers, AR) in Apr 2023", "Interview Descriptions": "Long but worth it. They are very good about sticking to their values. I made sure to study their values and core traits. I felt like it was laid back and easy.", "Interview Questions": "What makes you a great fit?"}, {"date": "24 Mar 2023", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Face to face interview asking me why I would like to work for Mercy. Also asked about the company values and how I fit with those values. Relaxed and straightforward interview.", "Interview Questions": "One of the challenging clients I have worked with."}, {"date": "20 Mar 2023", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "beginning took a lot of paperwork. the application obviously required pharm tech certification. they ask general interview questions that judge how you face conflict and your problem-solving. they are also judging your customer service traits as well", "Interview Questions": "N/A"}, {"date": "28 Feb 2023", "title": "VP-Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "The hiring manager was very friendly, and the peer leaders were welcoming and full of great information during the interview. HR was friendly and helpful as well through the process. Communication was appropriate both during interviews and before and after.", "Interview Questions": "Tell me about your experience and how it applies to this role. Share a time you worked with leaders through a time of change."}], [{"date": "27 Mar 2023", "title": "Operations Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Mar 2023", "Interview Descriptions": "The interview process was very smooth and the staff/nurses were so friendly and encouraging! I felt very welcomed and at ease the entire time! The person I interviewed with was also amazing! She made the interview feel more like a conversation and less like an interrogation!", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mercy in Mar 2023", "Interview Descriptions": "Interview process was pleasant and with personable managers. Managers were open and realistic about unit staffing and expectations, took me on a tour and also encouraged growth during interview. Recruiter kept me up to date and reached out in an appropriate time frame with offer.", "Interview Questions": "Discuss a mistake you made Discuss a time when you had to change your plan quickly and adapt"}, {"date": "21 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "Simple interview. The biggest issue is getting an interview in the first place. They use a system that evaluates applicants when they apply. If you don’t pass, you don’t get an interview.", "Interview Questions": "They wanted to know about my relevant work experience."}, {"date": "27 Mar 2023", "title": "Hospitalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy in Feb 2023", "Interview Descriptions": "Easy and quick interview. Very nice went over the job and toured the building. Seems like a nice place to work. Answered all my questions and gave me all the information I needed about the job", "Interview Questions": "How do you handle a busy schedule"}, {"date": "11 Jan 2023", "title": "CMA (AAMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "1st you get a phone interview from a recruiter and then if they like your response they will push your application forward for jobs it’s up to the job to review your application and if they think you will be a good fit they will set up an interview", "Interview Questions": "What do you think you would bring to the team"}, {"date": "9 Jan 2023", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Sequence is 30 min. interviews with behavioral based questions. Panel interview with several team members at the level above the positon and managers that would report to me. Interview didn’t leave much time to ask questions.", "Interview Questions": "Why I was considering mercy."}, {"date": "19 Apr 2023", "title": "Chaplain Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Saint Louis, MO) in Jan 2023", "Interview Descriptions": "You will have to complete a very detailed and reflective application AND a video interview. The application includes a complete biograph, a spiritual biography, and questions about how you respond a spiritual care giver. They provided a list of interview questions ahead of time.", "Interview Questions": "They will ask about your experience, spiritual life and emotions."}, {"date": "16 Jan 2023", "title": "Physical Therapist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Little Rock, AR) in Jan 2023", "Interview Descriptions": "My interview seemed backward. I applied on Monday and got a call on Thursday for an in-person interview the following Tuesday with the hiring manager. After that interview, I got an email for a self-paced phone interview. I got the job offer the following day.", "Interview Questions": "Tell me about a time where you worked for an organization where they did or did not have high standards how did you adapt?"}, {"date": "30 Dec 2022", "title": "Respiratory Equipment Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Very professional, but yet still easy going. I appreciate the willingness to work with my school schedule. Very supportive of school. There was significant talk of my future even at the interview stage.", "Interview Questions": "Tell me a little about yourself?"}, {"date": "15 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Very easy to interview and the questions were fairly standard. Department head-lead interview via Zoom call and each department head asked questions. Mercy prides themselves on their ministry so it would be helpful to know about their mission.", "Interview Questions": "If you were a fruit, which one would you be and why?"}], [{"date": "14 Nov 2022", "title": "HR Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "The interview process is long and tedious. Especially, with all the openings they have available in Human Resources. The TA department appears to be short staffed with a lot of inexperienced employees.", "Interview Questions": "Would I come down on my salary requirements."}, {"date": "24 Dec 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Chicago, IL) in Oct 2022", "Interview Descriptions": "Panel interview. Pre-selected questions. Skills and problem solving foundation to interview questions for fitness and skilled professionals. I also gave sone examples of daily situations that can impact individuals in the morning, afternoon or night.", "Interview Questions": "What is the most difficult part of the day for a youth with mental health issues and why?"}, {"date": "8 Sept 2022", "title": "Urgent Care Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Springfield, MO) in Sept 2022", "Interview Descriptions": "3 diffrent interviews, 2nd one was the most challenging. 1st interview was with gohealth and was badic screening/ information gathering. 3rd one was with HT about the organizational mission and values.", "Interview Questions": "What is a weakness that a patient has recognized in you"}, {"date": "31 Dec 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy in Sept 2022", "Interview Descriptions": "First interview is with recruiter, then lead of hospital department you applied for. Pretty basic interview questions. Weakness, strength and tell me about a time… etc. for me it took a few days to get and offer but I didn’t start till maybe a month later.", "Interview Questions": "Tell me about a time you had and angry patient and what you did."}, {"date": "24 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy", "Interview Descriptions": "Questions that represent your character and giving examples of how you responded in difficult situations.  Interview was with one manager. It was a professional atmosphere but was able to feel comfortable with the interviewer.", "Interview Questions": "Questions that represent your character and giving examples of how you responded in difficult situations.  Example: Tell me about a time when you made an error. How did you fix the error and what did the experience teach you. "}, {"date": "16 Aug 2022", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Interview process was standard with behavioral questions tied to company values where you had to describe a time you completed a task, project, or job while exemplifying one of their values.", "Interview Questions": "Tell me about a time you had to provide excellent service"}, {"date": "16 Sept 2022", "title": "Patient Service Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Joplin, MO) in Aug 2022", "Interview Descriptions": "It went amazing! They were very understand and helpful. Everyone there was also so so polite. They were so kind and fun. I loved every second of it!! I would definitely recommend working here. ", "Interview Questions": "Why do you want to work for us?"}, {"date": "25 Jul 2022", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "It was straight to the point and the interviewing supervisor gave proper incite about what would be expected of the worker each day. Answered every question I had to the best of their knowledge.", "Interview Questions": "The last time you had to handle a disgruntled individual"}, {"date": "26 Sept 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Mercy (Saint Louis, MO) in Jul 2022", "Interview Descriptions": "Thorough and thoughtful interview process that was clearly communicated from end-to-end and follow up was personable and insightful.  Mercy highly values ensuring the candidate is the right person for the job and culture. ", "Interview Questions": "The questions were both behavioral as well as related to skills, abilities and experience. "}, {"date": "10 May 2022", "title": "Cook Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "first part of my journey in the kitchen, mass hiring.   I was put in a room with so many people, I lost count.  The only thing they said is if you smoke, we can't hire you.", "Interview Questions": "can you cook and do you smoke."}], [{"date": "11 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in May 2022", "Interview Descriptions": "Smooth, pleasant, as expected.  They asked the typical nursing interview questions.  Name three strengths and two weaknessesThe supervisor discussed scheduling with meand said someone should be contacting me within a couple days.", "Interview Questions": "What can you bring to Mercy and this unit?"}, {"date": "9 Jun 2022", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy in May 2022", "Interview Descriptions": "I applied online. Got asked to fill out a personality test automatically (and passed). After that, recruiter reached out to do a recorded phone screen interview (1 day after quiz). The phone screening was somewhat weird. Already had questions lined up and you have under 1 minute to answer and it moves on. They asked about 6-7 pre-recorded questions (mainly situational-based). After I submitted, got asked to do a Teams interview with 2 managers (1 week after phone screen). Interview was pretty straight forward. The questions I was asked were mainly situational based. The managers told me to wait 2 weeks for an answer. They also told me I would be a great fit and they'll let me know the details later. However, 2 weeks on the dot passed and I got an email from the recruiter that the role was already filled.", "Interview Questions": "Tell me about a time where there was XYZ situation and how did you handle it. "}, {"date": "26 Apr 2022", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy", "Interview Descriptions": "Applied online. Recruiter reached out to set up interview. Interviewed with the unit manager and offered the job after answering a few general questions about my experience and personality and adaptability.", "Interview Questions": "Give examples of a time when you didn’t handle a situation the way you should have. "}, {"date": "1 Apr 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Very Easy - applied, interview, offer from HR, background check, and drug screen, and employee health\r\n\r\n3 weeks start to finish from my application to the start of my first day at the hospital", "Interview Questions": "Previous work experience and strengths and weaknessess"}, {"date": "2 May 2022", "title": "Therapy Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Mercy in Apr 2022", "Interview Descriptions": "I applied online. The next day I got a call and talked on the phone about the job. Then went in for an interview a few days later. They showed me around the department and then asked me interview questions then let me talk with other members of the team", "Interview Questions": "What was a time you felt you failed and what did you learn? "}, {"date": "30 Mar 2022", "title": "Medical Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "3 different interviews with 3 different managers \r\nIt was before COVID so it was on-site. I had to drive to 3 different locations and meet with three different interviewees. Each interview was three hours long", "Interview Questions": "It was behavioral-based questions and went over my experience. "}, {"date": "31 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Thorough, Recruitment to HR- Interviewed with direct supervisor, clinical supervisor was  also introduced to floor staff the same day.  Multiple handouts to explain exactly what to expect about the basics IE: clocking in, where to meet and accept assignments etc.", "Interview Questions": "How to react: code situation"}, {"date": "17 Mar 2022", "title": "Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "The interview process was very smooth and straightforward. There was an initial HR phone call followed up with an interview. Then there was an interview with the hiring manager. It was all very relaxed.", "Interview Questions": "Tell me about yourself\r\nHow do you align with merry values "}, {"date": "13 Jun 2022", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Rolla, MO) in Mar 2022", "Interview Descriptions": "Interview went very well, was led to believe I would be called in seven days or less, never received any calls or emails. Even reached out to person who interviewed me. My app had been duplicated and I wondered why, so I reached out. Still nothing. I had originally been asked for and interview and I responded yes, it then took two weeks to get a email back.", "Interview Questions": "If I had medical experience "}, {"date": "15 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Springfield, MO) in Feb 2022", "Interview Descriptions": "I applied and the interview consisted of a self-paced text interview, followed by a self-paced phone interview. After that it took about 3 days for them to contact me about an in-person interview.", "Interview Questions": "Tell me about a time when you had to do the best with limited resources"}], [{"date": "12 May 2022", "title": "Nuclear Medicine Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Mercy (Round Rock, TX) in Feb 2022", "Interview Descriptions": "Very good! I was very satisfied with their interview process. It was not too long and to the point. This was a great experience to see what all is out there as far as jobs go.", "Interview Questions": "What are your Very good! I was very satisfied with their interview process. It was not too long and to the point. This was a great experience to see what all is out there as far as jobs go.?"}, {"date": "19 Jan 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Very warm, nice interviewer. Not intimidating and just wanted to get to know you to see if you’re a good fit for the floor. Recruiter was great and such a pleasure to work with. Overall very positive experience.", "Interview Questions": "Staff who don’t listen to your request, how would you respond "}, {"date": "5 Jan 2022", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Had an in-person interview. They did not ask me about my skills, background, or experience. They spent 30 minutes talking to me about Christianity and then proceeded to ask me a bunch of religious question. They even asked if I ever have had a spiritual conflict of interest. What the actual hell?? I'm now scared to even be a patient here since their main priority is religious affiliation instead of skills and quality care.", "Interview Questions": "Have you ever had a spiritual conflict of interest?? "}, {"date": "4 Jul 2022", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Saint Louis, MO) in Dec 2021", "Interview Descriptions": "Applied online for ICU, call from recruiter, she acts like it's an interview for the ICU. It wasn't sets me up an interview & shadow for a step-down unit. Directions from Recruiter were not accurate on how to get to the unit I was shadowing on. Was placed on wrong unit. Manager forgot about me, then tried to push the actual interview to a different day/time. Recruiter called a few weeks later with an offer.", "Interview Questions": "How was your shadow experience?"}, {"date": "22 Dec 2021", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in Dec 2021", "Interview Descriptions": "Interview with a manager. then shadowing a nurse in the ER.  Seeing the process the nurses and staff and medics use to help the many and various patients that come in.  Then following up with the manager in case I had any questions.", "Interview Questions": "Do you have any questions?"}, {"date": "12 Jan 2022", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy in Dec 2021", "Interview Descriptions": "Phone interview . Basic questions and answers . It. Was very positive but, I haven’t heard anything back in over a month.  I did interview for 2 positions at the same time. I also had been referred by people working at Mercy currently.", "Interview Questions": "How did I handle a difficult situation?"}, {"date": "31 Dec 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Ardmore, OK) in Dec 2021", "Interview Descriptions": "Applied for 13 week contract RN. Ad stated new nurse and experienced nurses. Lower pay than contract through a recruiter but was excited for the opportunity to work locally and be home every day. Have been a travel nurse but not in a hospital. I didn't see this as a potential problem since the ad said new nurse or experienced nurse.  Interview lasted 15min. Answered questions from a script. Was asked how I felt about being on the floor with minimal training, which I felt fine being that I have been doing that with my current travel RN work. Was called the next week and was told I was not chosen because I did not have recent experience with EPIC. I did EPIC in nursing school and it was not that difficult to utilize when you learn new EMRs frequently without a problem.  I guess the “new nurse” they were looking for is a new grad who has recently has their hands on EPIC and the experienced nurse they were looking for must have been a nurse with experience on the floor and EPIC. Ad was too vague as to what they obviously wanted.   Hired the next week by a large hospital in OKC, so all worked out anyways. Just disappointing how the process went.", "Interview Questions": "What do you feel your strengths are?"}, {"date": "1 Nov 2021", "title": "Health Information Services Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy in Oct 2021", "Interview Descriptions": "Someone from Mercy reached out to me to schedule an interview. An in-person interview was preferred by the interviewer, but I had one over the phone without any problem. I was notified of what the possible next steps in the application process would be which is something I was grateful for.", "Interview Questions": "- Tell me about a time where you encountered a conflict and solved it.\r\n- What is your five-year plan?\r\n- What makes you a good fit for this job?"}, {"date": "20 Sept 2021", "title": "Business Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "The interview process was conducted via webex with the team supervisor and team lead. It was not video interview. It was basically a three way phone call. There were get to know you questions and questions about applicable experience.", "Interview Questions": "Why do you think you are a good candidate for Mercy?"}, {"date": "20 Sept 2021", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Zoom interview that took about 45min. It was a group interview with 5 people. Each person asked a question and at the end they told me they will give me a response within 2 weeks.", "Interview Questions": "How would you deal with a complex patient?"}], [{"date": "14 Jan 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Sept 2021", "Interview Descriptions": "I shadowed the unit first. I followed another tech around and they explained some of the basics of the floor to me. After I shadowed for about four hours, I interviewed with the manager", "Interview Questions": "Why mercy hospital ? How do you handle conflict ?"}, {"date": "23 Aug 2021", "title": "Community Health Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Aug 2021", "Interview Descriptions": "Using an interview software, the first step was to complete a quick, online interview asking why you applied and salary requirements. After completing that, you entered your phone number and the software called you for a guided, at-your-own-pace phone interview. You were given time (10 seconds) to collect your thoughts.", "Interview Questions": "Why did you apply for this position? Where do you see yourself in 5 years. What are 2 qualities you think are good for this position?"}, {"date": "8 Jun 2021", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Very straight forward- asked about skills and beliefs. Wanted to know about my training and how I was as a person. Had to do skills assessment and personality like assessment.", "Interview Questions": "Tell me about a time you dealt with a difficult patient. "}, {"date": "6 Jun 2021", "title": "Ekg Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO)", "Interview Descriptions": "In person interview with members of staff followed by shadow in the emergency room triage area. During the shadow process real patients were involved but I did not sign a HIPAA agreement/acknowledgement.", "Interview Questions": "N/A"}, {"date": "3 Jun 2021", "title": "Intake Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "I applied and was contacted to do a virtual interview very quickly. Probably within a few days. I was offered a job pretty quickly after the interview. They have you set up a \"coworker health screen\" which was basically a drug test, they take your blood pressure, gave me a flu shot, and then fit me for a n95 mask.", "Interview Questions": "I was asked at the end to give an \"elevator pitch\" for myself and why I should be hired. "}, {"date": "14 Jun 2022", "title": "Certified Nursing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy (Fridley, MN) in Jun 2021", "Interview Descriptions": "Pretty spot-on and on-track with conventional interviewing process.  Who you are, why you're applying, and why you believe you're the right candidate for hiring.  The follow-up process was also extremely punctual.", "Interview Questions": "Describe a mistake you made, and how you were able to rectify that situation."}, {"date": "14 Sept 2022", "title": "Educational Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in Jun 2021", "Interview Descriptions": "Typical. List of 5-10 questions. Back and forth dialog. Tell me about a time when you went above and beyond, when it felt you could have improved. Do you have any questions? ", "Interview Questions": "Where do you see Yourself in 5 years?"}, {"date": "12 Jul 2021", "title": "Preregistration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Mercy (Oklahoma City, OK) in Jun 2021", "Interview Descriptions": "Met with all managers in a group and went over what they expect of us to do. Went over the mercy mission statement as well as a small tour. You should be interactive during this interview as personality is a big help, you will be on the phones often with patients and some will not be the happiest to hear from you due to medical reasons but you should be the calm positive tone on the phone.", "Interview Questions": "To leave phones off of the call floor."}, {"date": "14 Jul 2022", "title": "SNT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mercy in May 2021", "Interview Descriptions": "Interview was mainly behavioral, very easy going - mine was virtual due to COVID but the process was simple and I got the position, also a great place to work to gain experience", "Interview Questions": "A lot of behavioral questions"}, {"date": "28 Apr 2021", "title": "Staff Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Oklahoma City, OK) in Apr 2021", "Interview Descriptions": "First we talked introduced ourselves and gave some background, then she asked me a series of questions. We discussed expectations and the work culture, and then she gave me a tour of the facility", "Interview Questions": "What was a time when you experienced conflict"}], [{"date": "15 Mar 2021", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO)", "Interview Descriptions": "met with the recruiter first set me up with a panel interview. the interview was laid back, felt comfortable everyone was so nice, easy questions met with 4 managers and decision made a couple of days later", "Interview Questions": "tell me a time you were in a situation which teamwork was involved"}, {"date": "27 Mar 2021", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Mar 2021", "Interview Descriptions": "Interview process starts with an HR contact who is sorting through applicants for interview with medical professionals. Interviews with the medical doctors were appropriate in time and questions. Everybody was friendly.", "Interview Questions": "Describe your approach to patient care?"}, {"date": "28 Feb 2022", "title": "Dietary Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (New York, NY) in Mar 2021", "Interview Descriptions": "It was very simple and the process was over within 1 hour and I liked the people who did the interview.\r\n\r\nWhat was great was that they were thorough and asked me relevent questions", "Interview Questions": "What's something I'd change about myself"}, {"date": "6 Mar 2021", "title": "Health Information Service Registrar Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy (Springfield, MO) in Mar 2021", "Interview Descriptions": "Went over the details of the job description, the full-time benefits, asked a lot of questions, got an overview of the day-to-day, and it was overall a great experience. Took an hour and a half long but it didn't seem that long at all!", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "25 Jun 2021", "title": "Procedure Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Saint Louis, MO) in Mar 2021", "Interview Descriptions": "Virtual interview, phone then 1:1 Interview, followed by a shadow to give you a chance to see if you would enjoy the job! \r\nI love how the hiring team kept me involved with steps of hiring process instead of keeping me guessing and confused like other hospitals!", "Interview Questions": "What would you say would be your biggest struggle while working here."}, {"date": "15 Feb 2021", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Met with managers from 3 units. Asked the same questions they ask at every nursing interview. They were very friendly and we chatted about how Mercy’s faith based system improves patient interaction.", "Interview Questions": "Why did you choose the field of nursing?"}, {"date": "18 Mar 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy in Feb 2021", "Interview Descriptions": "Can't rave enough about the management here! Compassionate, caring and really truly care about the employees growth and happiness. I was on a call with 2 different managers and loved every minute talking with such positive and warm staff.", "Interview Questions": "Why would you be a good fit"}, {"date": "15 Jan 2021", "title": "Clinic Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy", "Interview Descriptions": "Phone interview and took about a week for a call back. Pretty easy process and definitely well worth it. I had been wanting this opportunity for a while and it came true", "Interview Questions": "Why Do I want to work there"}, {"date": "13 Jan 2021", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Submitted my application online and received a call from HR who discussed openings. Then, the manager of the unit I chose called me and described the unit and position and asked if I had any questions.", "Interview Questions": "Why do you want this job?"}, {"date": "12 Feb 2021", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Jan 2021", "Interview Descriptions": "One hour interview with four current employees. The first half was getting to know me and second half was clinical questions about management of some chronic medical conditions. The people were friendly and answered all of my questions.", "Interview Questions": "Tell us about you...\r\nWhy do you want to work here?\r\n5 year goals?"}], [{"date": "3 Sept 2021", "title": "Housekeeping Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Oklahoma City, OK) in Jan 2021", "Interview Descriptions": "Slow but steady. Didn’t like the pace but I still went with it. In the end I declined the offer. Best choice ever. Wouldn’t recommend this place at all. That’s my opinion.", "Interview Questions": "Why should I hire you? "}, {"date": "11 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Standard nursing interview, easy and straight forward. Phone interview first followed by in person interview. Met with multiple people in department for interview to discuss role, all asked questions but easy to answer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Feb 2021", "title": "Sterile Processing Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Dec 2020", "Interview Descriptions": "It was great and reasonably questions . The question wasn’t to difficult.  Really just average questions.  First a phone interview then a in person interview or virtual due to COVID .", "Interview Questions": "How do you work in a stressful environment ?"}, {"date": "12 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy in Dec 2020", "Interview Descriptions": "Applied online, did an over the phone pre-interview with headquarters before doing a panel interview in person. Only one manager arrived to the interview, thankfully the department I wanted. A little clumsy, but standard interview.", "Interview Questions": "How will you add value to the team?"}, {"date": "12 Nov 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "Smooth process on the HR side, with streamlined interview scheduling and good engagement from the recruiter. There was an initial online personality test screen -- I have fun doing those lol, but it was unclear what they were evaluating or what the results would be used for.\n\nThe HR phone screen asked 4 behavioral interview questions that aligned with Mercy's values -- pretty standard stuff. But the very first question they asked is whether I was comfortable with religion and prayer in the workplace. This felt a little awkward since I'm relatively agnostic but I guess I appreciate the heads up that religion is outwardly present in this organization.\n\nDisappointing/frustrating interview experience with the hiring manager. I felt like he hadn't even reviewed my resume, as he asked me to describe very specific experience that I didn't even have. But there were no interview curveballs -- basically just \"tell me about your experience with xyz.\" As we wrapped up the phone interview (which felt very rushed), I asked if I could pose a few more questions via email and he said that was fine and shared his contact info. But I received no response to my follow up email -- completely ghosted.\n\n2 weeks later I checked in with the recruiter who did not have an update. \n2 weeks after that, I received an automated disconnect email from the applicant tracking system. Not even a personal note.", "Interview Questions": "What is your proudest accomplishment?"}, {"date": "3 Nov 2020", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "It was very professional and they made me feel very comfortable! I was not qualified for the therapy position as I have only done individual therapy. They ask me to apply for other positions!", "Interview Questions": "About my experience with group therapy "}, {"date": "20 Nov 2020", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Springfield, MO) in Oct 2020", "Interview Descriptions": "Lengthy process. Require personality test, HR interview, multiple phone conversations and finally the location interview.  None of the interviews were relevant to my skill set. I truly felt they wanted to get the least expensive employee regardless of experience or ability. If you have time to waste or want interview experience, this is a great option. If you want a career, you might want to continue looking.", "Interview Questions": "How would you contribute to the team?"}, {"date": "23 Aug 2022", "title": "Cardiovascular Technician II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Springfield, MO) in Oct 2020", "Interview Descriptions": "Be prepared for lots of odd questions, they are required to ask a specific set of questions per their ministry.  I also felt very awkward during their interview because my interviewer was not personal.", "Interview Questions": "How were you prepared in a situation with limited resources?"}, {"date": "29 May 2022", "title": "Ekg Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Springfield, MA) in Sept 2020", "Interview Descriptions": "Over the phone  interview with manager . Must be at least twenty-five to thirty minutes for the whole interview process. Then you just wait to hear back from them, if you’re offered a position humans resources will contact you to let you know when your start day will be.", "Interview Questions": "Why should we hire you? "}], [{"date": "31 Aug 2020", "title": "Nurse Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy in Feb 2020", "Interview Descriptions": "Casual, yet professional. Consisted of a preliminary phone screen followed by several face to face interviews with various levels of leadership culminating with a peer interview. Interview process felt drawn out.", "Interview Questions": "how would I handle rejection or push-back from physicians "}, {"date": "26 Feb 2020", "title": "Organizational Effectiveness Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy (Saint Louis, MO) in Jan 2020", "Interview Descriptions": "I applied online and received an email from a recruiter scheduling a phone assessment.  The recruiter was friendly and didn't ask too many questions.  She said that they already had internal candidates who would be a good fit for the position that I'd applied for but recommended me for another open position.   She asked what questions I had and described the next step in the process for me.  They base their decision entirely off of the second step in the process - a talent assessment, which she scheduled for me shortly after our conversation ended.  The talent assessment took place over the phone that evening. It lasted about 45 minutes or so and was completed by Talent+.  I didn't hear back after the assessment, but I assume had I \"passed,\" an in-person interview would have been the next step.", "Interview Questions": "I can't give too much detail, but the talent assessment asked several variations of the same question to find out how competitive I was.  The assessor did not provide feedback to any of my responses and you could tell the intention was to pose the next question quickly so that I wouldn't have a lot of time to think about my response - it would just be what came to my head the fastest, implying that it was the most honest.  The assessor was professional and courteous, but it was difficult to hear her at multiple points during the assessment.  The questions were mired in gender and cultural bias (women, and particularly women are color, aren't \"supposed\" to come across as competitive) and were along the vein of - have you stopped beating your children; yes or no? - meaning there really wasn't a good or accurate response to many of the questions.  It went on for a while and close to the end, I really just wanted it to be over.  I've never experienced this feeling during an interview or job assessment before.  I was saddened that this is the new hiring process for the hospital.  As I said, I worked there previously and really enjoyed my time there and felt that the culture was excellent.  This introduction to the company was extremely off-putting and I feel it will exclude many women, people of color, and servant leaders, despite their actually being good fit for the position and company.  Had I not worked for Mercy before, I would have determined that it was not a good fit for me (or anyone, really), based on this interviewing experience.  It would have even been better if they'd done the assessment later in the process, perhaps with final candidates, but not where it's the first and only thing they go by.  My master's degree is in psychology and even I will admit that these sorts of assessments are not entirely accurate. So, to use it and only it as the basis for a major decision isn't a good idea.   Also, the name of the assessment if misleading.  They don't assess your talents - they assess what people feel their traits to be.  I wouldn't recommend this process to anyone. "}, {"date": "13 Jan 2020", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy (Oklahoma City, OK) in Jan 2020", "Interview Descriptions": "I had a great eexperience during the interview process at Mercy Hospital. I have been thinking about starting a career here since I began nursing school and I am very thankful for this oppoertunity.", "Interview Questions": "Introduce self as if you were introducing yourself to a patient "}], [{"date": "26 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Springfield, MO) in Dec 2019", "Interview Descriptions": "Phone interview was great, questions applied to position, they were kind and helpful. Onboarding was also very simple. Any questions that you had were quickly answered. Staff was great during that process as well.", "Interview Questions": "What is a positive about yourself?"}, {"date": "27 Oct 2021", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Oklahoma City, OK) in Nov 2019", "Interview Descriptions": "Applied, in-person interview, job offer. Each person was friendly to talk to and the in-person part went very smoothly and comfortably. I am happy with my decision to apply here to work.", "Interview Questions": "tell about your experience in healthcare"}, {"date": "15 Jan 2021", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Oklahoma City, OK) in Aug 2019", "Interview Descriptions": "It was easy and straight to the point! Had an amazing experience interviewing here. Human Resources let me know within a few hours after the interview if the job was mine or not. Everyone was friendly and welcoming.", "Interview Questions": "Why did you decide Mercy"}, {"date": "24 Jul 2019", "title": "Senior Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy (Saint Louis, MO) in Jun 2019", "Interview Descriptions": "I meet with the manager and was asked to meet with the team the next day.  Interview questions went over previous work history.  Each team member asked two questions each.", "Interview Questions": "Why do you want to work here "}, {"date": "3 May 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Mercy (Saint Louis, MO) in May 2019", "Interview Descriptions": "I am still in the interview process. I have had a one on one interview. I have a 2nd interview scheduled soon. This interview will be on the phone with HR.", "Interview Questions": "Tell me about yourself."}], [{"date": "3 Mar 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Mercy", "Interview Descriptions": "I had two interviews: one with two executives and the other the individual I would be working with. Everyone I met was very nice and respectable. Both interview sessions had the same questions (written on a sheet) so it was very redundant.", "Interview Questions": "Volunteering experience"}, {"date": "13 Mar 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy in Mar 2019", "Interview Descriptions": "Human Resources were very friendly and professional.  I was immediately sent to a 2nd interview with Director of Nursing who was very outgoing and easy to talk to during the process.", "Interview Questions": "Why did you choose Mercy"}, {"date": "10 Feb 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO)", "Interview Descriptions": "Conduct a placement test to \"match\" with culture.  It is a \"knock out\" process.  You pass or your out.  Good tool if it was used as adjacent to hiring not a pass or fail process.", "Interview Questions": "Too many questions to include."}, {"date": "13 Aug 2020", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Chesterfield, MO) in Feb 2019", "Interview Descriptions": "Easy, interviewing process. Nothing too crazy, the usual of why I chose to apply to mercy. Then why I chose to work in healthcare, my days available. Stuff like that!!", "Interview Questions": "Describe a time where you felt challenged in the workplace "}, {"date": "15 Mar 2019", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Jan 2019", "Interview Descriptions": "I was interviewed at the office I work at. I interviewed with coworkers that I work with.  \r\nWe all had good chemistry during the interview. I was pretty much hired in the spot.", "Interview Questions": "How would you deal with a difficult patient?"}, {"date": "6 Feb 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy (Fort Smith, AR) in Jan 2019", "Interview Descriptions": "Applied over ten times before I got a phone screen that took 15 minutes. Then, one face-to-face interview with practice manager. Be prepared for 3 part questions - the kind that make no sense, and are so long you can't remember the first part of it before they finish. Answers are typed in to a computer and sent to HR after your interview. She told me I had the best resume she'd ever seen, and asked why I applied for such a \"low position\". I explained that I had been without a job for too long and just wanted an opportunity to get my foot in the door. It's been 2 months, I've left multiple messages with interviewer - to try and show I'm very interested - but on their website I'm still listed as \"under review\".", "Interview Questions": "Mercy is a faith-based organization, do you have a problem with praying at the beginning of every meeting? "}], [{"date": "16 Aug 2021", "title": "CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy (Oklahoma City, OK) in Jan 2019", "Interview Descriptions": "I completed the application online, and then was emailed to set up an interview time. The interview was relatively easy. They asked 4 simple questions and it only took about 30 minutes. I was then notified a day later of the job offer.", "Interview Questions": "- Tell me about yourself\r\n- Name 3 of your best qualities and one thing you're working on\r\n- When have you gone above and beyond for a patient?"}, {"date": "9 Jan 2019", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Denver, CO) in Dec 2018", "Interview Descriptions": "Very well done, fast, friendly, and built confidence this was a good job.  Focused on values and my strengths.  It lasted about 45 minutes.  I prepared too much but was happy with the process", "Interview Questions": "Why are you interested"}, {"date": "9 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mercy (Saint Louis, MO) in Nov 2018", "Interview Descriptions": "Fairly average interview that was behavioral based. They want to understand your character, integrity, and thought process. It’s not an abridged NCLEX session for the new grads, you’ll be fine! Just think of any experiences you have and what you’ve learned from them. In nursing, we must be adaptable and open.", "Interview Questions": "When is a time you had to correct a peer and how did you approach the situation with outcome? "}, {"date": "25 Oct 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy (Prairie du Rocher, IL)", "Interview Descriptions": "1. 30 min phone interview \n2.  Q &A  personality test ( phone call)\n3. Face to face interview \n\nNever heard back, I had to reach back out for a conclusion. My conclusion is that age discrimination is alive and well within this organization.", "Interview Questions": "Why are you looking for a new position."}, {"date": "13 Oct 2018", "title": "Merchandiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "There was a lot of back and forth, really not sure if it was going well or poorly.  Interviewer snapped, I snapped back. This and that, back and forth. major yikes", "Interview Questions": "What's your greatest strength?"}, {"date": "22 Sept 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Mercy (Oklahoma City, OK)", "Interview Descriptions": "The interview process was fairly easy. I met at human resources where they asked me a few standard questions. Then I interviewed with the pharmacy staff where they had a manager and a few peers ask me questions. Mainly about my work ethic, etc.", "Interview Questions": "If you could be any animal, which would you choose?"}, {"date": "29 Oct 2021", "title": "Front Desk Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Springfield, MO) in Sept 2018", "Interview Descriptions": "Interview with clinic manager and then a few clinic coworkers for good fit purposes.   Normal interview questions asked.   Reviewed my resume and spoke about how my experience relates to the position I applied for.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Aug 2018", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in Aug 2018", "Interview Descriptions": "Apply online, HR contacts you by phone and goes over the position and schedules an interview if they feel you’d be a good fit. You’ll do an interview with HR and then the nurse manager for the floor. Usually you’ll get a call within a couple days.", "Interview Questions": "What does teamwork mean to you?"}, {"date": "22 Aug 2018", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mercy (Rogers, AR) in Aug 2018", "Interview Descriptions": "There process was a two part interview. One with HR in a separate location and another with the actual pharmacy manager at the hospital. Everything seem to go well until I went on a tour of the pharmacy and I asked why medications weren’t being transported on a locked medication cart. I guess I seemed guilty asking that question and being black. As if I would plan to steal something.", "Interview Questions": "What are your strengths ?"}], [{"date": "6 Jun 2020", "title": "EHR Credentialed Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy in Jun 2018", "Interview Descriptions": "I spoke with a recruiter first that asked me general questions about my previous experience. She then sent my information to the hiring manager. I did a phone interview with the hiring manager as I lived in a different state from her. We connected immediately, and it was more conversational than Q & A. \r\n\r\nA few days later, I then had to take a personality assessment. It took over an hour to do on the phone. I believe it was through a third party company. I had to answer questions about what I would do in certain scenarios and describe a time when I had done whatever the situation was. She wasn't allowed to give me any guidance or explain any of the questions further. Some questions were the same, just worded different. Not a fan of this part!\r\n\r\nSince this was for a training position, I had to do a 15 minute presentation. The hiring manager chose my topic to be on how to do something. I had to put together a PPT. I went to the location I would be working at and presented to someone in the room along with people in other locations through screensharing and conference phone. *Be confident, have an introductory about you slide, remember people's names (write them down), ask the group or specific people questions throughout, practice timing your presentation beforehand.\r\n\r\nI was then called by HR, and they gave me an offer. I counter offered for $1/hr more and got it. They base pay off your location more than your experience. The hiring manager doesn't really have a say in the offer.", "Interview Questions": "N/A"}, {"date": "16 Jun 2018", "title": "Licensed Pharmacy Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mercy (Springfield, MO) in May 2018", "Interview Descriptions": "The overall interview process what slightly overwhelming at first, but once you see how friendly everyone is up front, it isn’t so bad. The process consisted of various open ended questions, your five year plan, and an overall understanding of why you wish to work for Mercy Hospital. My interview consisted of three tables and nine interviewers; three at each table. Everyone was well-rounded and knowledgeable in their line of business, so I felt comfortable the longer I was there. They were interested in what I was wanting to do with my future. I recommend reviewing the company’s core values and obtain an understanding for each value. Majority of the questions will be related to them. You will also be asked to provide a time in which you helped people or did something in a stressful time. Be sure to go in nicely dressed, open minded, and be precise on exactly what you want to get out of this opportunity. I am excited and I haven’t even started yet! Thank you, Mercy!", "Interview Questions": "N/A"}, {"date": "3 Jul 2018", "title": "Administrative Assistant III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mercy (Springfield, MO) in May 2018", "Interview Descriptions": "A friend recommended I submit my resume for a position in the administration office.  I did so and was quickly was contacted by the manager, with whom I subsequently interviewed. The interview went very well; unfortunately, it seems my requested salary was too rich for their blood. I had additional contact with the Mercy recruiter, but neither of these folks thought it necessary to provide follow up to me, which I felt to be unprofessional. Even a form-type letter or email to advise that they had gone a different direction would have been appreciated, and is so much better than ghosting a job candidate.", "Interview Questions": "Pretty much the standard questions throughout."}, {"date": "14 Apr 2018", "title": "Food Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy (Saint Louis, MO)", "Interview Descriptions": "I had a phone interview with Don Grace, the head chef. Then at the end, he said that a recruiter would be in touch with me shortly. I had a second phone interview with the recruiter to make sure I would be a good fit. I then went to a Mercy office to go over the job, finish paperwork, and get my ID card picture taken. I had a Mercy orientation, followed the next day by a department orientation.", "Interview Questions": "Do you have a problem working in a religious environment? (They are a Catholic based workplace)"}, {"date": "14 Apr 2018", "title": "Systems Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in Apr 2018", "Interview Descriptions": "Had a phone interview. Was requested to come in for a face to face interview that week. Interviewed with the hiring manager and her boss. The first interview was about what was expected and the culture. The  second interview was just general questions.", "Interview Questions": "What would never want to do in a job?"}, {"date": "19 Apr 2018", "title": "CRM Campaign Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in Apr 2018", "Interview Descriptions": "Mercy was extremely professional and organized throughout the interview process. I felt very comfortable speaking to both the HR recruiting Team and the Hiring Manager and they were all very receptive to my questions.", "Interview Questions": "What's something that you're most proud of in your career?"}, {"date": "12 Mar 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Mercy (Saint Louis, MO)", "Interview Descriptions": "The total process was 4 rounds: Initial HR phone screen, phone call with team manager, personality assessment and finally face to face interview (1/2 day meeting with several people at a time). Everyone at Mercy seems very nice and truly respects their co-workers and the overall mission of Mercy.", "Interview Questions": "Lots of specific questions about work I've done in my previous roles, what I've done to improve myself and how well I work with others.  Mercy definitely wants to hire people who fit in with their mission and values so be sure to mention you like what they stand for. "}, {"date": "6 Mar 2018", "title": "NICU Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "4-6 weeks. Tedious process. Have to make sure to follow up. First I applied online. Nurse manager from NICU emailed me to set up a interview. Interview was with the nurse manager and the fellowship coordinator. Then set up a interview time with the HR. Still waiting to hear back from them.", "Interview Questions": "Name an accomplishment you achieved NOT related to your education/work experience. (basically a personal accomplishment) "}, {"date": "1 Mar 2018", "title": "Payroll Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Mercy", "Interview Descriptions": "The interview process was highly disappointing. I was highly disappointed in how the interview was conducted. Prior to the interview, I was called by the hiring manager to verify I was interested in the position because I was overqualified. I explained that I was interested in the position because I was changing industries and was new to health care. I said I would love the opportunity to interview.  My interview was horrible and the lack of skills exhibited made me not want to work for the company. My interviewers explained the position, said my resume was impressive, asked a few questions about my CPA plans.. and went \"Do you have any questions?\" The interview would have been over in 15 min flat, thankfully I had prepared typed out questions.  I hadn't said anything to leave a bad taste. I was on time, professionally dressed, brought a report with work experience. Yet, I was dismissed before the interview began. It was greatly apparent they had no interest interviewing me and it was a waste of BOTH our time. If your going to ask a candidate to come into an interview, make the effort to INTERVIEW the candidate. Lets compare this to my experience with interviews at Barns Jewish. I was provided a phone interview where I was highly screened, in-depth reference check, and a very professional and detailed interview that lasted over an hour. This type of professionalism is worth my time. I will hesitate to apply to Mercy again.", "Interview Questions": "What exam do you plan to take first for your CPA?"}, {"date": "10 Apr 2018", "title": "Recreational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Feb 2018", "Interview Descriptions": "Person who interviewed me was very nice and it was a relaxed interview. Talking with her was like talking with a friend, and she made me feel comfortable right away.", "Interview Questions": "What would a group therapy session look like under my care?"}], [{"date": "22 Jan 2018", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy", "Interview Descriptions": "I applied online and several weeks later received an email from the pharmacist. I then completed an in-person interview with the office pharmacists then a phone interview by a Mercy rep.", "Interview Questions": "Tell me about yourself."}, {"date": "26 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in Jan 2018", "Interview Descriptions": "Applied online and heard from recruiter in less than a week. Scheduled interview a few days later, and received job offer on the same day. Interview was a very positive experience and I could really tell that the employees lived out the mission and values of Mercy. Nothing but positive experiences on the unit during my tour. Pay offered was lower than other facilities, but after negotiation I decided that working in such a positive environment was worth the slight pay cut. I did not want to leave!", "Interview Questions": "What were three words that someone you know would use to describe you?"}, {"date": "25 Jan 2018", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy (Saint Louis, MO) in Jan 2018", "Interview Descriptions": "First, I received a call for a phone interview which lasted about 5 minutes. I was then invited to an in-person interview in the HR building. After the interview I took a 20 question basic math test (Really easy), Lastly, I went to Mercy hospital to meet with the hiring manager. This meeting lasted about 15 minutes. I was offered the job 20 minutes after the interview! Really easy experience.", "Interview Questions": "Why do you want to work at Mercy? "}, {"date": "4 Mar 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Mercy (Oklahoma City, OK) in Jan 2018", "Interview Descriptions": "Applied online and got a call back within 3 days to schedule an interview.  They said they will call you back within 3 days for a second interview if you are selected in the top 5.", "Interview Questions": "Describe what is a good manager for you."}, {"date": "8 Nov 2018", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Dec 2017", "Interview Descriptions": "I had a pre screening phone call. I got another call to come in for face to face interview. I had another phone interview with the recruiter. Then, I had another face to face interview with nurse practitioner and a physician. Still no offer. They went with internal applicant.", "Interview Questions": "Explain a time where you made a mistake and how did you fix it?"}, {"date": "1 Aug 2018", "title": "Patient Service Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Oklahoma City, OK) in Dec 2017", "Interview Descriptions": "My interviewer was very sweet and friendly. She made me feel very comfortable. The interview was smooth and I didn’t need any kind of “hookup” to get my foot in the door. Pay was not discussed in the interview, which would have been helpful.", "Interview Questions": "Why Mercy?"}, {"date": "27 Jan 2018", "title": "Medical Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Springfield, MO) in Dec 2017", "Interview Descriptions": "I applied online at Mercy.com and went through the initial Q&A there. I got a call about two weeks later. They called me in for an interview the next day. Friendly and professional interview with the office manager and my would-be supervisor.", "Interview Questions": "What was something your coworkers would say about your faults from your previous job?\r\n"}, {"date": "21 Nov 2017", "title": "Sleep Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Mercy (Saint Louis, MO) in Nov 2017", "Interview Descriptions": "Recruiter called next day after application submitted.  Interview with recruiter within a week.  Department interview later that day.  Offer made next day.  Offer slightly lower than requested, but night and weekend differential more than made up for it.", "Interview Questions": "What makes you a fit for Mercy?"}, {"date": "6 Dec 2017", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy (Oklahoma City, OK) in Nov 2017", "Interview Descriptions": "There was an initial phone interview. The follow-up face to face interview was very prompt. The  face to face interview was with a panel and individuals on a conference line. Overall, I would describe the process very seamless.", "Interview Questions": "Describe from experiences what's wrong with the healthcare system and how to fix it."}, {"date": "17 Oct 2017", "title": "Anesthesia Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Mercy", "Interview Descriptions": "I applied online through the Mercy website. I got a phone call and set up an interview. The interview was 3 employees all taking turns asking me questions and senerios.", "Interview Questions": "name a time you were wrong & and how did you fix it."}], [{"date": "27 Feb 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Norman, OK) in Oct 2017", "Interview Descriptions": "The interview process was short and sweet.  It was pleasantly easy and both interviewers seemed very energetic and enthusiastic. The whole process was no more than a few questions long.", "Interview Questions": "Why did you choose Mercy?"}, {"date": "24 Sept 2017", "title": "Supply Chain Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy (Oklahoma City, OK) in Sept 2017", "Interview Descriptions": "I was interviewed and the coordinator and assistant were very thorough and informative. The  ladies were very friendly and showed me the area I would be working in if hired.", "Interview Questions": "why should they hire me"}, {"date": "29 Aug 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "Online app followed by meeting with two directors then another day for hr to meet with me two weeks waiting for background check and employment verification then went back for drug screen and waited for results a week", "Interview Questions": "What could I bring to the table to help the company"}, {"date": "14 Aug 2017", "title": "Recreational Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Aug 2017", "Interview Descriptions": "Applied, set up interview 2 days later, had a 10 minute cookie cutter interview with HR and then sent to a social worker who would be an immediate superior for a 30 minute interview. After the interview, I was asked if I'd be interested in coming in to observe for part of a day.", "Interview Questions": "HR asked, if you were eating lunch in the dining hall with coworkers and they were gossiping about a patient, what would you do?"}, {"date": "11 Sept 2017", "title": "Nursing Director Cardiac Cath Lab Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Springfield, MO) in Aug 2017", "Interview Descriptions": "Very shortly after I applied, less than 3 days,  I had a phone interview with HR. The next day I  had an hour phone screening with a 3rd party and within a week, I was called for an onsite interview. The whole first process took about 4 weeks from application to the end of the onsite interview. The HR person was great! She was newer to her role but was accommodating and provided a lot of good information. The 3rd party interview was a personality screening that took place over the phone but was very useful, in my opinion. The onsite interview took place with the Executive Director, a panel of managers (who would be my peers), and a physician panel. There was an extensive tour of the facilities and the ability to meet many of the staff of the hospital. Mercy paid for a car rental, a hotel room, and dinner. They also set up a community tour with a local realtor the next day. My husband and I were very excited about the possibility. After leaving the interview August 15th, the executive director told me I would hear by the end of the month. I understand this is a large organization and many hoops and lines to sign. \r\nAfterwards, I sent a Thank You to both the director and the HR director for the hospitality and their time. I received responses from both. However, I've since been ghosted. No letter, no email, no phone call. With all of the time and resources they used for these interviews, I'm unsure why there would be absolutely no follow up. If I'm not a good fit for the position, that should be communicated in some way.  I'm a hiring manager in my current position and I know things can come up that throw wrenches into the system but the lack of any communication is terribly unprofessional.", "Interview Questions": "How do you know when would be the time to delegate a responsibility? "}, {"date": "17 Jul 2017", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "Got a call back about a week after applying. Met with manager and main supervisor. After regular interview questions I was shown around the department. Not soon after I got a call that said I got the job. I gave my 2 weeks to my previous job and started at Mercy right after.", "Interview Questions": "How well do you handle difficult customers?"}, {"date": "16 Jan 2018", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy (Joplin, MO) in May 2017", "Interview Descriptions": "Very brief, very casual, main interviewer seemed overwhelmed with other things and was distracted, however everyone was very friendly. Second interviewer was the on duty pharmacist. He was nice,  asked a few questions and returned to work.", "Interview Questions": "What is one thing y ou like about your current position?"}, {"date": "7 Mar 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Mercy (Saint Louis, MO) in Apr 2017", "Interview Descriptions": "Took a long time to go through. Drug screen, back ground checks, personality test. The personality test is very serious to the process please take time while answering. If you do not pass personality test you will likely not be hired.", "Interview Questions": "Why did I leave my last position"}, {"date": "16 Apr 2018", "title": "Telemedicine Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Chesterfield, MO) in Apr 2017", "Interview Descriptions": "Pretty extensive, although you don’t need a college degree for the role. Applied online, got a call from HR and then got another call assessing my morals/how I would act in certain situations", "Interview Questions": "Explain a time where you went above and beyond your role"}, {"date": "20 Apr 2017", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy in Mar 2017", "Interview Descriptions": "I first interviewed with human resources and then I went for an interview the same day with my now supervisor. Both interviews were very pleasant and I left feeling confident.", "Interview Questions": "Mercy fit questions. "}], [{"date": "14 Aug 2017", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Springfield, MO) in Mar 2017", "Interview Descriptions": "Very quick and to the point, they asked the normal questions and then asked if so was a Mercy fit for the company and then If I was a fit for the job", "Interview Questions": "Are you a Mercy Fit ?"}, {"date": "4 Apr 2021", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Cincinnatus, NY) in Mar 2017", "Interview Descriptions": "Phone screen  performed by recruiting. 30 minutes of questions and answers. Basic screening information.  17 questions. No salary benefits discussed during this 30 minute interview.  Not enough information provided during this call.", "Interview Questions": "Years of experience in field "}, {"date": "3 Sept 2018", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Fort Smith, AR) in Mar 2017", "Interview Descriptions": "She wasn’t even paying attention she just made sure I knew the steps on how to draw blood and she said I got the job she is lazy and cow", "Interview Questions": "Tell me how to draw blood"}, {"date": "24 Aug 2017", "title": "Social Work Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Sacramento, CA) in Mar 2017", "Interview Descriptions": "They asked about my experience in the field and what my long term objectives are. Panel style with 4 individuals, asked if I had experience working with substance users. There was a nurse, care coordinator and 2 social workers, asking me questions about my desire to work in a hospital setting.", "Interview Questions": "How do you priortize case load?"}, {"date": "9 Feb 2017", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy (Fort Smith, AR)", "Interview Descriptions": "Great process! HR department was very encouraging and helpful. It felt very easy and conversational. The most important piece of advice I would give is to add community service to your resume. They found that a huge bonus, because they feel doing community service, tells a lot about you as a person. They feel that if you are willing to dedicate your time for free to others, then you'll be fantastic when they are paying you.", "Interview Questions": "Have you had any community service experience?"}, {"date": "11 Feb 2017", "title": "Operations Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mercy in Feb 2017", "Interview Descriptions": "Why do you choose us, why we hire you. whats your last position. How do you like the job and daily basis. whats your working environment and blah blah bla lots of things", "Interview Questions": "Why do you choose us"}, {"date": "6 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in Jan 2017", "Interview Descriptions": "Was not difficult. Had my interview with HR & the hiring manager the same day & was also then offered the job that day. Afterwards, started the fellowship 6 months later as I was a new grad.", "Interview Questions": "What most excites you about this positon? "}, {"date": "26 Jan 2017", "title": "Hospice Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Jan 2017", "Interview Descriptions": "Application process includes a self-assessment value/work ethic/leadership in Likert scale format. Recruiter reviewed mission statement and emphasized that they were looking for people who are willing to commit to serving the community.  Hiring Manager again emphasized mission and service.  She was accessible, and they arranged for a day shadowing a senior nurse so that I would have an idea of what I was getting into.", "Interview Questions": "N/A"}, {"date": "23 Mar 2017", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy (Oklahoma City, OK) in Jan 2017", "Interview Descriptions": "Got an interview because my brother's girlfriend works there and she pushed my resume. I was called immediately and went in for an interview within a couple of days. The interview lasted about 30 minutes and was very laid back. I would have been hired had a hiring freeze not taken place a few days later.", "Interview Questions": "Why Mercy?"}, {"date": "16 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in Jan 2017", "Interview Descriptions": "Build an excellent resume! Apply online. Wait for a response from human resources either call or email. Go to initial interview.  Go to human resources interview. Go through a company drug screen and physical. Start your new career!", "Interview Questions": "How have you handled a difficult confrontation with a coworker?"}], [{"date": "20 Dec 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Mercy (Springfield, MO)", "Interview Descriptions": "Short and easy. It was an interdepartment transfer. I have interviewed for several other departments within Mercy. Before I got my foot in the door, the interview process was very long. It took several months and applications to get a call back. They ask questions regarding Mercy Values as well as general questions regarding experience.", "Interview Questions": "Describe a time when you were under pressure and how you worked through it."}, {"date": "7 Mar 2017", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy (Saint Louis, MO) in Dec 2016", "Interview Descriptions": "I applied online. I then received a phone call and email to set up a time to interview in person. The interviewers we 15 minutes late and the interview lasted 30 minutes with two people.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "27 Feb 2017", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Dec 2016", "Interview Descriptions": "The people were very kind but very disorganized. I felt as if I had to lead the interview just to avoid awkward silences. My interviewers had difficulty describing what tasks the role requires and seemed to lack a fundamental understanding of that I would be doing. They were so nice but just didn't seem very prepared.", "Interview Questions": "Have you been on projects that failed to meet deadlines? Describe the circumstances and what you could've done differently. "}, {"date": "16 Dec 2016", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Dec 2016", "Interview Descriptions": "Standard Interview, very stale and quick. T.he panel managers acted quick and swift with the questions, they did not write the review of my interview until it was over, I wish they gave me more feedback.", "Interview Questions": "Why do I want to work for Mercy"}, {"date": "2 Dec 2016", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Mercy (Oklahoma City, OK) in Nov 2016", "Interview Descriptions": "I actually applied online for a med/surg position, the next day the HR rep called and said I applied for the new grad program. Because I passed the NCLEX recently (although I had not gone through a new grad program at my previous job) I went on the interview. There were six department heads in the interview. The day after I received a call with a job offer. The whole process didn't take a week. I had applied for a day position and was offered a night shift, it didn't seem like HR paid much attention.", "Interview Questions": "I was asked to take the interview panel through the process of introducing myself to a patient, where I saw myself in five years, what was my strength and weakness is, and a few other questions"}, {"date": "2 May 2017", "title": "Business Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy (Rogers, AR) in Nov 2016", "Interview Descriptions": "Interviewed with 2 department hiring managers.  Interview was relaxed and very comfortable with mostly typical questions and dialogue.  Much of the conversation dealt with Mercy's mission and the type of passionate individuals they look for to add to the team to best accomplish the overall mission.", "Interview Questions": "How do you think your experience directly relates to the position you are applying for?"}, {"date": "23 Nov 2016", "title": "New Grad RN - Trauma Surg Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Mercy (Boston, MA) in Oct 2016", "Interview Descriptions": "Great Review. I had a phone interview with the nurse manager as I am out of state. She was very friendly, the process was more of a conversation than interrogation which is important to me.", "Interview Questions": "Tell me about yourself and your work experience"}, {"date": "9 Sept 2016", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy", "Interview Descriptions": "The first interview was 45 min by phone. It consisted of normal basic interview questions. The recruiter was great, she stated I had higher qualifications and that this was entry level and asked if still interested. I said yes. She said the next step was a phone interview by a third party. This was a \"personality\" type text. It was really strange and was advised I could only ask them to repeat questions, that they could not clarify context of question, this call took almost 90 minutes and  consisted of questions like \"do you smile?\" I passed that then was asked to interview at Mercy one of their HR Managers.  This interview was comfortable with some behavioral questions, I felt I answered well. I received a call about a week and a half later that they had gone with an existing Mercy employee. I did not get the job.", "Interview Questions": "What role do you take in a group setting?"}, {"date": "31 Aug 2016", "title": "Marketing Planning Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Mercy (Oklahoma City, OK)", "Interview Descriptions": "The first stage was a phone interview with HR.  This was followed by an in-person interview with the hiring manager.  The third interview was a 4-person panel.  I didn't make it to the next round, but I was told that it would be a personality assessment test.  After successfully completing that, an offer would be made.\r\nEvery person I met was friendly, hospitable, kind and professional.  I would have enjoyed working with all of them!", "Interview Questions": "We are a faith-based organization.  There is a public prayer each morning over the intercom system and prayer before each meeting.  How do you feel about that?"}, {"date": "4 Aug 2016", "title": "Manager, Corporate Office Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "It was odd, but nice at the same time, that the recruiter interview was in person. It was clear that Mercy was intent on finding the right cultural fit. However, the after additional interviews, I discovered I was not selected for the position by logging in to my account. Never received an email, and I had even heard back from the hiring department in response to my follow up that they were still performing initial interviews. The follow up was after my profile had been updated to indicate I was not selected, but before I chose to check. \n\nI would still consider applying for other jobs at the company because the interviews themselves provided me enough to know that culturally, it's primarily an organization filled with great people.", "Interview Questions": "are you comfortable beginning all meetings in prayer?"}], [{"date": "30 Sept 2018", "title": "Laundry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Springfield, MO) in Aug 2016", "Interview Descriptions": "You will get a phone call to make an appointment. Make sure you are a little early for your interview. After the interview you will get a tour of the plant. Ask as many questions as you need to. If you are offered the job and accept, you will get a call back to set up a time to go to Human Resource to do paperwork, Co-worker Health for a drug test, get up to date on your vaccines, and a physical test and a date and time for orientation.", "Interview Questions": "Tell me about yourself."}, {"date": "25 Aug 2016", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mercy in Aug 2016", "Interview Descriptions": "Very friendly! I went in at sat in the waiting room and immediately saw how family oriented this company was! Everyone was friendly and I could see that customer service was there main goal!", "Interview Questions": "What are your strengths!?"}, {"date": "17 Aug 2016", "title": "Operations Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Fort Smith, AR) in Jun 2016", "Interview Descriptions": "They called me and set an interview. I went through two interviews. I had a first interview with a HR manager. He asked me very basic questions such as my personality and work experience, and it took about 20 minutes. Then, I had a second interview with a hiring manager on the same day. This time we talked about some behavioral questions.", "Interview Questions": "What do you know about Mercy and this position?"}, {"date": "8 May 2016", "title": "Clinical Midwife: OB/GYN Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Glen Carbon, IL) in May 2016", "Interview Descriptions": "What my goals, passions regarding safe midwifery birth.  What would my greatest challenges if I got this job.  I said learning their practice protocols.  I already know how to be a midwife.", "Interview Questions": "How do you feel about foreign clients.  I am comfortable with them; the woman/family is here for a safe rewarding birth and I want to provide that family experience for them when possible."}, {"date": "23 Jun 2016", "title": "Chaplain Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Springfield, MO) in May 2016", "Interview Descriptions": "The interview began with an initial phone interview.  An Additional two phone interviews and one web interview followed.  The director along with other interviews offered thoughtful questions and were easy to speak with about the position.", "Interview Questions": "Tell us a time when you handled conflict"}, {"date": "28 Mar 2016", "title": "Contracts Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in Mar 2016", "Interview Descriptions": "there were 3 interviews total. The first was a phone interview. Second was a case interview. The third was a half day interview with several employees. Overall, the process took about 1.5 months. After the third interview I received an offer within a week.", "Interview Questions": "Describe a time when you displayed leadership"}, {"date": "6 Mar 2016", "title": "Account Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy", "Interview Descriptions": "There is only one interview and it is directly with the hiring managers/supervisors. There are usually at least two people conducting the interview and they ask all Behavioral based questions. They are normally face-to-face, but I have seen them do phone interviews. They will often send the candidate the job description and will have the candidate start by seeing if they have any questions. If you just keep every answer patient/customer related and positive it is overall an easy interview, but I would recommend you have 5-10 scenerios because it seemed like they just kept asking the same questions and I was afraid that I might have doubled up on some answers.", "Interview Questions": "Describe a time in which you went above and beyond for a customer?\r\nWhy hire you?\r\nCommunicated something difficult?\r\nReceived negative feedback and how did you handle it?"}, {"date": "19 Mar 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy (Springfield, MO) in Mar 2016", "Interview Descriptions": "Applied online and was called for interview with the department head within a week of my application.  I was given 3 options for the interview time.  A large part of the interview was listening to the description and history of the department.  I was then asked to talk about myself and why I was leaving my current employer.", "Interview Questions": "To explain a situation where I was confronted with conflict and how I handled that."}, {"date": "20 Feb 2017", "title": "Service Center Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Mercy (Saint Louis, MO) in Mar 2016", "Interview Descriptions": "Easiest, and Most welcoming Interview process i have ever experienced!  After the Tech talk, we spent almost 30 minutes getting to know one another.  Positively the most warm welcome to a Company Ever. I would recommend you research the company and position before the Interview to prepare yourself. Be Very Open minded, and Accepting of their Values.", "Interview Questions": "Basic Troubleshooting Questions, then Advanced Troubleshooting Questions about Various Business Applications.  Then we got Personal."}, {"date": "2 Oct 2020", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Saint Louis, MO) in Mar 2016", "Interview Descriptions": "Several layers to the process. Started with the website submitting a resume. Then went on to the recruiter, who then moved me on to the Respiratory Director. I also interviewed with the Respiratory Services Executive Director.", "Interview Questions": "It has been too long, maybe how would I fit in to their department."}], [{"date": "23 Feb 2016", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Feb 2016", "Interview Descriptions": "Very poor interview experience. Had one initial phone screen from the recruiter, a phone screen with the hiring manager (physician recruitment manager), onsite interview with associate recruiter and hiring manager, 2 hour phone assessment, panel interview with the team, met with COO. I was mislead and basically told I had the job, to the extent we were discussing my office and the manager explained \"you cant keep my pictures\" as I would be moving in there. She also explained she \"hoped I had enough to do\"  etc which was very misleading. After providing references, I did not hear back. I reached out and received a cold email from the hiring manager that they would reach out by the end of the month. Finally received a rejection letter. I reached out to the recruiter to ask feedback and he explained \"wanted to give courtesy\" by reaching out. Very unprofessional especially when dealing with candidates that are recruiters. as well. Poor poor impression on Mercy Recruiting and will update others as well.", "Interview Questions": "Tell me about a difficult candidate. "}, {"date": "19 May 2016", "title": "Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mercy (Chesterfield, MO) in Feb 2016", "Interview Descriptions": "recruiters will string you along for weeks without providing actionable answers to your questions pointing to hiring managers. Now I understand why they have several openings in my specialized field and it is because they cannot make a decision OR they are not being honest and either way is a RED FLAG. Remember - you as an applicant will never be treated better by an organization than when you are being recruited by an organization. If you have concerns during this phase and continue, you asked for what you receive.", "Interview Questions": "Still waiting"}, {"date": "2 Apr 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Mercy (Oklahoma City, OK) in Jan 2016", "Interview Descriptions": "Mercy Oklahoma City interview process is very slow. I don't understand stand manager are slow or Human Resource is slow.there is no define process candidate know about it.  Basically Hr sucks.", "Interview Questions": "N/A"}, {"date": "7 Dec 2015", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Springfield, MO)", "Interview Descriptions": "Very average questions but with a big ? afterwards. It was awkward with long moments of silence and I wasn't sure if I should start asking questions or if they were thinking of questions to ask me. I was very unsure of myself and whether I got the job or not.", "Interview Questions": "What is one thing you look for in a job? What's most important?"}, {"date": "16 Jan 2018", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Mercy (Rogers, AR) in Dec 2015", "Interview Descriptions": "I had to wait a long time after submitting my resume for numerous positions before I received a call. Once the office manager called, I was in for an interview that week. She called me back for a second interview to meet the doctors very quickly  (within a few days). After that interview, she set up a third interview with human resources. And finally, after that interview went well, I received my offer. I  would say the whole process took about 3 weeks.", "Interview Questions": "Basic interview questions,  competency questions from the doctors, reliability questions from HR."}, {"date": "12 Dec 2018", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Mercy (Springfield, MO) in Dec 2015", "Interview Descriptions": "Received phone interview with hiring manager. Spoke about previous experience and what the dept was currently looking for. I had stayed in touch with this manager for about 5 years so hiring process with very easy", "Interview Questions": "What certifications do you have?"}, {"date": "2 Jun 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Dec 2015", "Interview Descriptions": "I had to have a phone interview then i sat down with my pharmacy manager after that i did another phone interviews I  had to agree to be ok with prayer in the workplace. Then was offered the job", "Interview Questions": "Tell me about a time"}, {"date": "16 Dec 2015", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Mercy (Edmond, OK) in Dec 2015", "Interview Descriptions": "I applied online and I got a call in about a week . I set it up for about three weeks later . I met with the main lady was about a 10 min meeting . She said I would need a peer interview with the nurses . I went in the following Monday it they asked me 4 questions then said okay we are done goodbye and showed me out . I didn't get ill call you once we know or anything .", "Interview Questions": "Tell me what you do at your job ?"}, {"date": "10 Sept 2015", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mercy (Springfield, MO)", "Interview Descriptions": "Panel interview involved HRM and two members from the department.  Usual interview questions with the opportunity to ask any questions I had about the job I was applying for.  All panel members were friendly and made me feel very comfortable during the interview process.", "Interview Questions": "What type of filing system was used in my current job?"}, {"date": "2 Sept 2015", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Oklahoma City, OK)", "Interview Descriptions": "Slow, had trouble finding the application. Had to call the manager of the department several times so that he could get in touch with them and figure out what happened to the application, once they did find it they still did not contact the manager, the manager had to call them because they didn't have time.", "Interview Questions": "How do you feel about prayer at work"}], [{"date": "22 Feb 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in Sept 2015", "Interview Descriptions": "I was referred by a family friend and got an interview that next week after the referral. Met with two supervisors at once. basic questions for a basic job. Was told by one of the supervisors a week later that I would be getting a call from HR soon with an offer. The next day I received a generic email from the same supervisor that I did not get the job. After inquiring (I turned down another job offer because I was told I was going to receive one here) I then received an offer for a position with the same title but in a different department. Since I needed the job I accepted and the rest, as they say, is history.", "Interview Questions": "Are you comfortable talking on the phone all day?"}, {"date": "8 Aug 2015", "title": "Intern - Hourly Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "I applied online. After few weeks I received the call from HR manager for first round of telephonic screening interview.   \r\n\r\nQuestions asked: Tell me about myself? Regular HR questions", "Interview Questions": "Tell me about myself? Regular HR questions"}, {"date": "31 Aug 2015", "title": "Datenanalyst Und IT-Verantwortlicher Für MS Navision Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Mercy (Saint Louis, MO) in Aug 2015", "Interview Descriptions": "1st call for interview then will be called back for second interview, You will be asked a series of questions that they get off line through Mercy. They will let you know if you have job through e mail.", "Interview Questions": "Why do you want to work for our company?"}, {"date": "22 Jan 2017", "title": "Supply Chain Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Aug 2015", "Interview Descriptions": "Extremely long 3 interviews, long and very uncomfortable they asked weird questions and I wasn't comfortable at all seriously stressed during entire interview didn't think I would receive the position whatsoever", "Interview Questions": "N/A"}, {"date": "11 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy (Saint Louis, MO) in Jul 2015", "Interview Descriptions": "I submitted my application and resume online. I was contacted by the nurse recruiter from HR. She asked a few brief questions about my experience and then set an appointment to meet with management team. I was Interviewed by 4 people in the department followed by a tour of the department. I was asked to come back for a second interview and to shadow in the department on a separate day.", "Interview Questions": "How do you had conflict with another coworker?"}, {"date": "3 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy (Fayetteville, AR)", "Interview Descriptions": "Was really wierd; no nursing questions, very little details about the job. Was called back that day and told I could have the job! Salary had not even been mentioned. I said I would think about it and get back to her. I ended up taking it, I knew some about the job prior to applying.", "Interview Questions": "There were so few questions asked of me that I really cannot remember any right now."}, {"date": "10 Jun 2015", "title": "Customer Care Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Sacramento, CA)", "Interview Descriptions": "Applied online, received a phone interview and was invited for a face-to-face.   I was informed to be prepared for a two hour interview.  In fact, it was only 40 minutes.  I was walked around to different areas.", "Interview Questions": "I was shown a report with very rudimentary data.   I was shocked at how poor their metrics were.  When asked what I thought about it, I had difficulty trying to find anything positive to say."}, {"date": "29 Jul 2015", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mercy (Saint Louis, MO) in Jun 2015", "Interview Descriptions": "Very long, several-part questions.  Gave details of job description .  Hours and days expected to work.  How transfer from department works.  If travel required and how to get reimbursed.  Also went through benefits offered.  Allowed time for questions and didn't make me feel rushed.  Offered phone number to call if any additional questions.", "Interview Questions": "Would i be wiiling to respect the prayer offering at start of meetings."}, {"date": "7 Oct 2015", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy (Washington, MO) in Jun 2015", "Interview Descriptions": "They call you to come in for an in person interview.  They interview you and give you a tour of the department.  You take a drug test and they run a background check.  If you pass both those you will get an offer.", "Interview Questions": "Have you ever been arrested for a felony?"}, {"date": "2 Jul 2015", "title": "Security Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mercy (Oklahoma City, OK) in Jun 2015", "Interview Descriptions": "A one-on-one with the Executive Director, followed by a panel interview that included HR and Ethics personnel.  From application submission to final interview, the selection process took about 5 weeks.  Interviews were approximately one hour in length and involved multiple scripted questions that were asked of all candidates.  Approximately 1 week after the final interview a decision was made and announced.", "Interview Questions": "What leadership qualities to do you feel you bring to this position that would make you successful?"}], [{"date": "8 May 2015", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy", "Interview Descriptions": "Applied online.  Admin assistant for department called to set up interview for a Friday.  Recieved a call for a second interview the following Monday.  Interviewed with VP on Friday and was offered the job the next Monday.  Initial application was submitted about a month before I heard anything, but once the ball was rolling things moved quickly.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "18 Dec 2015", "title": "Advanced Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Mercy (Oklahoma City, OK) in May 2015", "Interview Descriptions": "I was already a nurse extern, so I was transferring roles. For my nurse extern interview, I was called to set up an interview date which they easily worked around my school schedule. After setting the date, I arrived at my interview and went down to the conference center to check in and wait for the people who would be interviewing me. I was scheduled for two interviews. For one of the interviews, I was met down in the conference center and the interview was carried out in one of the rooms. For the second interview I met my interviewer up in her office. The interview was a 1:1 interview carried out by the leaders of the various floors I had applied to.", "Interview Questions": "Why do you want to work at Mercy?"}, {"date": "28 Oct 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy in Apr 2015", "Interview Descriptions": "Pretty straight forward, nothing too daunting.  Do a basic job interview prep of top 30 interview questions and you'll be fine.  Show up on time, dress professionally.  They asked a lot of questions but seemed to be your average interview process.  Manager was very friendly.", "Interview Questions": "Why are you leaving previous employer?"}, {"date": "1 Sept 2015", "title": "Intern - Hourly Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy in Apr 2015", "Interview Descriptions": "Consisted of a phone screening for \"cultural fit\" and other basic behavioral questions. Two people on the call, very personable. Made the process feel much less robotic than other phone interviews in the past. Next was an in-person interview which was again, very personable. Casual conversation to discuss experience, expectation, etc. This was an interview for an intern position, so it was admittedly less intensive than one would be for a full-time position.", "Interview Questions": "A time you have encountered a struggle with diversity. (very diverse organization, but with codified Christian values)"}, {"date": "4 Apr 2015", "title": "Nursing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy (Oklahoma City, OK) in Apr 2015", "Interview Descriptions": "They asked basic questions to get to know you and how you may function as well as what your interests were. The only thing I didn't appreciate was once they knew the distance of where I lived, it seemed like everything we had talked about and all of my qualifications just flew out the door. It's sad to think that my address is what affected my chances of landing the job. If the commute was a problem for me, I obviously wouldn't have applied for the position to start with. You would think it would make a difference when I said that I am willing to relocate, apparently I was sorely mistaken. Also, I wish any type of feedback would be given to allow you the chance to improve or at least an explanation to why you were rejected. Oh well, the hunt continues.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "10 Mar 2015", "title": "Statistician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "I submited the application online. It took about 3 weeks to process. Phone interview with HR asking questions mostly about items listing on my resume. The interviewer is nice and very on time. The process stopped there due to some family issue and position filled two weeks after. I would definitely consider the organization if there is another chance in the future.", "Interview Questions": "What did you do for your previous internship?"}, {"date": "11 Jun 2015", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Springfield, MO) in Feb 2015", "Interview Descriptions": "First had a phone interview to make sure I met basic qualifications. Then had a face-to-face interview with Regional Manager and Field Supervisor. Very simple process. There was no protocol quiz to take due to how things work in this part of the state. You will learn all about Mercy EMS protocol in orientation. Did ask a few questions about certifications and licenses held. One or two questions about past experience.", "Interview Questions": "Why do you want to work for Mercy EMS?"}, {"date": "16 Nov 2015", "title": "Lab Support Tech II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Saint Louis, MO) in Feb 2015", "Interview Descriptions": "I feel that the interview is not only made by a good interviewee, but also a good interviewer. I felt that in the interview I did not received well enough questions that truly displayed my interviewing capabilities. I feel that the quality of questions one receives in an interview is a big part of success in an interview.", "Interview Questions": "What is one of your weaknesses and how would you improve it?"}], [{"date": "12 Apr 2016", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Mercy (Springfield, IL) in Feb 2015", "Interview Descriptions": "A very laid back interview because my Aunt works for the company and is very high up in the company and simply got me the internship. They showed me around the building and gave me an idea of what my job position will require. After they did all of this they made me a snack and I had a one on one conversation with the President of the company. This was a great feeling as i finally walked throught the the the the the the the the the the the the the the the the the the the the then then then thn then then then then then then then then", "Interview Questions": "What do you want to get out of this internship?"}, {"date": "31 Dec 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mercy", "Interview Descriptions": "I interviewed from another state. The total interview process took about 3 weeks and consisted of approximately four separate interviews. It was intense but effective, and the process allowed me to determine if I was the right fit and if Mercy was the right fit for me. The process started with the 20 minute recruiter interview, then the 60 minute hiring manager interview, followed by a personality style interview which was scheduled for 2 hours. Mine took about 90 minutes and was very thorough. Finally, there was a Skype interview. It took an additional 3 weeks before an offer was made, but this was due to the process spanning 2 holidays.", "Interview Questions": "Do you strive to make your manager look good?"}, {"date": "12 Dec 2015", "title": "Laboratory Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy (Saint Louis, MO) in Jan 2015", "Interview Descriptions": "I Applied online,two days laters  recieved a call to set up a good interview date and time, next day had a phone interview then they called back a gave me a offer,i accepted the position,then started a few weeks later and it has been wonderfuo experience ever since.", "Interview Questions": "Basic questions"}, {"date": "4 Feb 2018", "title": "Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Mercy (Kansas City, KS) in Jan 2015", "Interview Descriptions": "it was very very very long process time consuming and there were a lot of people, i want to be a tech i don't know really  people were there and had no clue what was going on, why is this required just to look at a review now", "Interview Questions": "My name"}, {"date": "11 Aug 2015", "title": "RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Mercy (Saint Louis, MO) in Dec 2014", "Interview Descriptions": "It was long and lengthy. A lot had to with me and moving back to area. I had 3 interviews over the phone before I returned for an interview in December and it was some what a difficult interview for me.        I'm not a custom to group interviews.  My interviews typically are short and sweet, the really just want to know my skills. I tried to prepare for it. I was hoping my excellent skills and a good personality would have made the difference. What was the biggest disappointed they said they would inform me 2 weeks after the stated. I did understand it was the holidays.  Lucky I was able to come up with a back up plan. I was seeking full time permanent work and leaving the travel companies.", "Interview Questions": "What would you do in this situation. . ?"}, {"date": "29 Nov 2014", "title": "Chemical Dependency Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "There was a panel of 4 employees including the person who was being replaced due to retirement. Formal interview questions were used as well as a few impromptu scenarios.", "Interview Questions": "How would I handle a difficult client? "}, {"date": "2 Feb 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy in Nov 2014", "Interview Descriptions": "It was a group interview that consisted of 3 nurses and 1 other individual. They had 7 questions which were pretty simple and we flew through them pretty quickly. It was over the phone so I was not sitting down with anyone. Like usual, they told me they'd pass my info along and would contact me. Seeing how Im a current employee and was just looking to transfer I thought that they'd be transparent with me. However they never call or emailed me. I even reached out a couple times and they didnt have the respect enough to return my call.", "Interview Questions": "What is administrative assistant mean to you?"}, {"date": "15 Apr 2015", "title": "STaff Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy (Saint Louis, MO) in Nov 2014", "Interview Descriptions": "The interview was a panel interview with 6 interviewers. The people were all nurses from the floor that I was being interviewed for.  The questions were typical PBI type questions. The questions were situational and dealt with your past experiences and the character and integrity you used to work through them or solve them.", "Interview Questions": "Tell us about a time when you dealt with a difficult patient. How did you deal with the situation and what was the outcome?"}, {"date": "19 Sept 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Mercy (Springfield, MO) in Nov 2014", "Interview Descriptions": "Possibly the most damning portion of the interview process is the \"Mercy Fit\" test. It is a long test that determines whether or not you fit in with the Mercy spirit through ethics-based lines of questioning. If an applicant fails this test, they can never retake it and can never be employed at Mercy. Ever. You also must submit a traditional application and interview once with a Mercy representative and again with your floor manager.", "Interview Questions": "Describe a time that you had to stand up for what you believed in to your superiors."}, {"date": "17 Jun 2015", "title": "Admitting Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Mercy (Saint Louis, MO) in Sept 2014", "Interview Descriptions": "They didn't ask many questions. More concerned if I already knew how to use Epic, the electronic health system. They were impressed with my resume and tried to sell the position to me. Two supervisors will interview you at once. My advice is to find someone who already works for Mercy because they take more referrals rather than external applicants.", "Interview Questions": "N/A"}], [{"date": "28 Aug 2014", "title": "Medical Office Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy", "Interview Descriptions": "Attended a hiring fair, interview questions were pretty straight forward. Was interviewed on the spot and asked back for a second one on one interview with upper management. I appeared to  both  interviews with a small nose stud, nothing was mentioned about it and i went on to be offered the job. when i was working there for about 6 months i was approached by management and was told I had to remove it as it was against company policy.", "Interview Questions": "i Where do you see yourself in 5 years ?"}, {"date": "18 Oct 2018", "title": "Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Mercy in Jul 2014", "Interview Descriptions": "Very professional and ask about your experiences. did not go more into technical questions. very friendly and made comfortable. Very professional and ask about your experiences. did not go more into technical questions. very friendly and made comfortable.", "Interview Questions": "Past job experiences"}, {"date": "29 May 2014", "title": "Director, Health Information Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Mercy (Mountain View, MO)", "Interview Descriptions": "This process involved a \"Talent\" Telephone Interview and it was exceptional.  They asked many questions; there were areas pertinent to me as a person, specific to being a manager/director, also questions relative to my past career history, as well as, my strengths and weaknesses.  I found this process to be extremely enlightening.  I felt that it gave me the opportunity to see if this was an organization I wanted to work with as well as if I would be a \"right fit\" for them.", "Interview Questions": "What has been my biggest disappointment in my career."}, {"date": "23 Apr 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy (Springfield, MO) in Jun 2014", "Interview Descriptions": "Applied and was called for an interview 2 weeks later.the interview consisted of myself and 2 managers. after a week I was called and offered the position. There was a lot of phone tag between myself and the recruiter in HR.", "Interview Questions": "How would you handle a situation where conflict arises between yourself and a coworker?"}, {"date": "1 Nov 2015", "title": "Practice Manager III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in Jun 2014", "Interview Descriptions": "Several steps to ensure Mercy fit. Very professional. Willing to work around my schedule. In person meeting with supervisor and team then a phone interview with human resources. Each in person interview took an hour or more. The phone interview was 20 minutes or so. Overall typical and expected. No curveballs.", "Interview Questions": "Tell me about a difficult situation you have been in and how you handled it."}, {"date": "23 Apr 2014", "title": "Coordinator of Paramedic Outreach Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Mercy", "Interview Descriptions": "Applied within 24 hours of the position being posted. Got an email back a couple of days later saying they had filled the position. Felt that the application process was a waste of time.", "Interview Questions": "N/A"}, {"date": "2 Apr 2014", "title": "Foundation Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy", "Interview Descriptions": "I had two face to face interviews with upper management.", "Interview Questions": "Interview was fairly common with all the usual questions in fundraising regarding experience for the position, how you handle working with people, largest gift received, how you handle change on a daily basis, etc."}, {"date": "6 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Mercy (Ardmore, OK)", "Interview Descriptions": "Interviewed by one manager", "Interview Questions": "N/A"}, {"date": "5 Aug 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Mercy in Mar 2014", "Interview Descriptions": "Filled out internal transfer after looking at career at Mercy online for the facility. Received notification of my application being submitted via my personal email address. Checked back with the website to see if I was being considered.  Approximately one month later had an interview. Then a phone call from the manager that stated that I did not receive the position.", "Interview Questions": "What can you do for this company? Why do you think you are qualified for this position?  I thought this was odd already being an employee."}, {"date": "11 Feb 2018", "title": "Interventional Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Mercy (Oklahoma City, OK) in Jan 2014", "Interview Descriptions": "talked briefly on the phone, received call next day that I had the job.  that should have been a red flag, while I was there, I saw numerous people come and go", "Interview Questions": "do you have any neuro experience"}], [{"date": "25 May 2017", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy in Jan 2014", "Interview Descriptions": "Interviewed and received a job offer from my manager the same day, but then didn't hear from HR with an official offer for another three months.  (I shared I wasn't able to start until five months after the interview date due to being in school.)", "Interview Questions": "How does the Ministry of Mercy apply to you?"}, {"date": "7 Mar 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy (Springfield, MO) in Jan 2014", "Interview Descriptions": "Online application was first step.  Then human resources forwarded app to floor manager then call made and interview set up.  Lots of what if questions and opportunity to ask questions.  Relaxed with manager.  Then wait a day for call back from human resources.", "Interview Questions": "What would you do if you were feeling stressed out?"}, {"date": "9 Dec 2013", "title": "Pharmacy Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy", "Interview Descriptions": "Applied through website, was called 2-3 weeks later asking to come in for an interview that day. Talked with pharmacy director for about 45 minutes just asking why I was interested in the job, what skills I brought, how much I was willing to work, etc. Got a call about a week later asking me to set up a peer interview and got a call about a week after that offering me the job and telling me what my pay would be.", "Interview Questions": "Warned me this would be a different question, and then asked me what my closet looked like (wanted to see how organized I was) "}, {"date": "6 Aug 2015", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mercy (Joplin, MO) in Dec 2013", "Interview Descriptions": "there wasn't much to the hiring process. got a call for an interview. went to the interview. the interview wasn't really much of an interview. mostly just the manager telling me what the job entails. never really asking me questions to see if i was really a fit for the position. as long as you have previous customer service experience you're golden.", "Interview Questions": "do you have any questions for us?"}, {"date": "1 Feb 2014", "title": "Applications Developer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Mercy (Chesterfield, MO) in Oct 2013", "Interview Descriptions": "HR interview, first round phone technical screen, second round in person technical screen, 3rd round Mangers round.  HR on boarding interview.  Offer negotiation.", "Interview Questions": "unexpected - Are you eligible to work in US? my answer was Yes.  No follow up questions were asked and i haven't followed it up with my H1B sponsorship.  The rookie recruiter was rude and said the company is not sponsoring H1Bs anymore."}, {"date": "6 Oct 2013", "title": "Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Chesterfield, MO)", "Interview Descriptions": "Three portions of interview: phone interview (behavioral), technical interview, and face-to-face (behavioral) interview", "Interview Questions": "Technical interview: to design schema of solution for specific situation"}, {"date": "10 Dec 2016", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy (Springfield, MO) in Oct 2013", "Interview Descriptions": "The online application was basic. There is a Mercy Fit Test after submitting the application that asks situational questions and personality questions (\"On a scale of 1 to 10, how caring are you.\") that takes approx. 25 minutes to complete. The manager will call to set up the interview. The interview consisted of some basic questions and some situational questions. It lasted about 20-30 minutes and was only with the manager of the floor that I applied to. No skills testing beforehand. Pretty harmless.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "25 Jan 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in Oct 2013", "Interview Descriptions": "The interview process was the easiest i've ever been to. At first you start off at their office location and interview with HR. Then I interviewed with the department of pharmacy director and supervisor.  I was in and out within 10 minutes. They asked the basic interview questions \"why do you want this position?\" , \"what do you want from us as an employer?\" \"what would you bring to the table?\".  I felt like they just wanted to see who i was and if i was reliable. Nothing complicated at all.", "Interview Questions": "What do you need to remain happy here?"}, {"date": "25 Feb 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Mercy (Springfield, MO) in Oct 2013", "Interview Descriptions": "Interview was very easy going! I had one interview at HR and one with my future supervisor at the laboratory. At HR they asked me general questions, such as how do I handle stress? Why do I think I'm a good fit for Mercy? How would I handle situations with my coworkers? I'm a team player? Can I work under stress?", "Interview Questions": "How do you handle stress?"}, {"date": "9 Jun 2013", "title": "Clinic Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy", "Interview Descriptions": "Initially screened by phone by human resources.  Received a call from the manager who set up a face to face interview.  Came back for a second interview and was given a tentative offer the next day.  Had to go in for a physical, drug test before the final offer was given.", "Interview Questions": "What are your greatest strengths and weakness questions."}], [{"date": "22 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy (Ardmore, OK) in May 2013", "Interview Descriptions": "Very personable with management.   Nothing out of the ordinary.  They are glad to have you.  They should be b/c everybody ends up leaving.  The pay used to be a factor but is not now for beginning RN's.  The interview process is the same as other hospitals in that you get screened, drug test, background check, and group interview.  It was pleasant.", "Interview Questions": "What is your nursing background?"}, {"date": "9 Feb 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy", "Interview Descriptions": "Initial interview was via the phone, contacted quickly via phone and then flew out to meet the Senior Management team. All in all process took 2-3 weeks.", "Interview Questions": "Do you feel comfortable praying and where is your stand on religion?"}, {"date": "29 Oct 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy in Feb 2013", "Interview Descriptions": "Several interviews over several days \r\nMust pass drug test and take a talent survey , must travel to HR for badge and filing of paperwork. Must complete 2 weeks of EHR training.", "Interview Questions": "What is your best attribute "}, {"date": "27 Apr 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy (Saint Louis, MI) in Sept 2012", "Interview Descriptions": "Took about 2 months to get hired on after my first contact with HR.  had three interviews, one with Hr, one with manager of dept, and one with other staff/nurses of dept and then I had to shadow a nurse for about 4 hours.  Nothing too special or too difficult during HR interview", "Interview Questions": "Typical hr interview, dept interviews were more of them telling me how dept ran.   They didn't ask questions, so I had to use my list of questions, which they basically answered while telling me about the function of the dept"}, {"date": "26 Jun 2014", "title": "Business Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mercy (Springfield, MO) in Aug 2012", "Interview Descriptions": "Two business office managers interviewed me for about 20 minutes. They asked me several scearios and how I dealt with them, asked me if I was comfortable working for a Catholic organization, and described some potentially difficult parts of the position.", "Interview Questions": "Describe a time you failed, how did you deal with it?"}, {"date": "21 Sept 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy (Saint Louis, MO) in Aug 2012", "Interview Descriptions": "HR called me within couple of days, nice and brief phone interview, then scheduled face-to-face interview which was nice and smooth. Did not have to wait too long, HR lady was very friendly and seemed to care. Standart  questions about personality, values etc.", "Interview Questions": "What are your strong positive  personal characteristic?"}, {"date": "30 Mar 2016", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Mercy (Saint Louis, MO) in Jul 2012", "Interview Descriptions": "I went through several interviews.  Initial interview was for a different department and it ended up not being available.  However, the manager thought that I was such a good fit for Mercy he passed my resume along to a different department to help get my foot in the door.  Turns out I did get the job which was greatly appreciated.", "Interview Questions": "Tell me about a time when you had to make a hard decision. Explain what happened"}, {"date": "3 Feb 2016", "title": "IT Architect Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in May 2012", "Interview Descriptions": "The Solutions Engineering team is seeking a Thin Client End Point (Citrix, HP) Engineer with prior experience with Citrix and thin client products to provide Virtual Desktop Infrastructure (VDI) and Thin Client Services (TCS) working with the P-VDI Team.  Additional skill sets required to include, HP, Dell, or other thin client management tools experience.  Duties and responsibilities includ", "Interview Questions": "vdi, sccm, windows, app-v"}, {"date": "12 Oct 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy (Saint Louis, MO) in Mar 2012", "Interview Descriptions": "My interview process was a very traditional, very brief, one on one session.  My interview consisted of the standard interview questions: List your strengths, List your weaknesses, what are your short term goals, long term goals.  The interview process itself lasted maybe fifteen minutes.  My resume was reviewed and questions were asked about it.", "Interview Questions": "Name a positive experience you experienced working in the medical field?"}, {"date": "3 Dec 2011", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy (Ardmore, OK) in Dec 2011", "Interview Descriptions": "Mercy is very to the point. The HR department and management was extremely compassionate and understanding and willing to do what they could to get me hired on. I believe that they had wanted to hire me before bringing me into the interview, and I just talked to HR, management and had a quick tour and meet and greet with my coworkers. It was all complete in a matter of an hour and a half. I was very relieved at how nice and enthusiastic everyone was and it eased my nerves especially with moving from another state. Once I got to the interview, I knew this was a good move. I now have 2 appointments to make before I begin work: to get put into the system and drug test (which thankfully they do in house which is not normally how I remember hospitals doing) and then my orientation.", "Interview Questions": "How are you?"}], [{"date": "4 May 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mercy (Fort Smith, AR) in Aug 2011", "Interview Descriptions": "interviews total.  I got my second interview schedule right after the first one with HR.\r\nHiring manager was nice. She asked questions about the jobs and personality. I got a phone call a week after that I got a job offer. I like the work environment and people that I worked with. I quited  after 3 years because of school.", "Interview Questions": "Why do you want to work in the ER?"}, {"date": "1 May 2015", "title": "Account Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Mercy (Saint Louis, MO) in Jul 2011", "Interview Descriptions": "Initial HR interview consisted of behavioral questions. After passing that you move to the face-to-face interview with the Manager, Supervisor and Business Analyst. They go over a series of behavioral questions. All of which are easy to answer as long as you are able to think on the spot. I was offered the position shortly after I returned from a vacation.", "Interview Questions": "Name a time when you showed care for a patient or co-worker under stressful circumstances."}, {"date": "4 Mar 2015", "title": "Instrument Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Mercy (Oklahoma City, OK) in Jul 2011", "Interview Descriptions": "Put in the transfer to go to another dept. They replay replied back within 2-days.. Got my first interview only took 30mins.. Got another interview a day later.. Only took one hour.. Then got a peer interview the next day.. Where I got interview by the co-worker. They did an ending meeting to offer me the job.", "Interview Questions": "Why you think you should get the job?"}, {"date": "19 Dec 2015", "title": "CNA, Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mercy (Festus, MO) in Jun 2011", "Interview Descriptions": "It was simple. It took only a few weeks to get hired. They will send you to several different departments to get rated and reviewed. Then they will offer you a salary. Put everything related to healthcare in your application. They will use it to determine how much you will be offered. There is little to no wiggle or negotiation room.", "Interview Questions": "What can you bring to our team?"}, {"date": "28 Oct 2015", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Mercy (Springfield, MA) in Feb 2011", "Interview Descriptions": "one on one with a manager asking you questions about your qualities experience with people where do you see yourself in 2 yrs with this company.Can you work holidays can you work weekends can you work overtime. Do you have any family issues that would conflict with you getting to work on time", "Interview Questions": "How can you  be an assess to us what qualities do you exceed in"}, {"date": "26 Aug 2015", "title": "Registration Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Mercy (Saint Louis, MO) in Feb 2011", "Interview Descriptions": "Brief and to the point.  Initial interview was over the phone, second interview in person with middle management.  I was told that I met the qualifications and he would skip the process of their normal third interview with the direct supervisor.  I was sent an offer within 48 hours and asked to submit to a drug and background test within 72 hours.", "Interview Questions": "How have I handled a problematic patient/customer in the past?"}, {"date": "14 Jan 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Mercy (Saint Louis, MO) in Dec 2010", "Interview Descriptions": "Wasn't Bad, No real question outside the expected.  Very Type A interview.  But the People are nice", "Interview Questions": "N/A"}, {"date": "10 Nov 2011", "title": "Customer Service Analyst IV Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy (Saint Louis, MO) in Dec 2010", "Interview Descriptions": "I worked for the company for three years and was doing the job of CSA IV. When the position opened and I applied they changed it into another CSA III position. There is no career pathing at Mercy unless you can pick up another skillset. There are other jobs in MISD but everyone is going for those jobs so its pretty saturated.", "Interview Questions": "What is the hardest decision you've made at a workplace?"}, {"date": "2 Mar 2012", "title": "Sales Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 weeks. I interviewed at Mercy (Chesterfield, MO) in Mar 2010", "Interview Descriptions": "good", "Interview Questions": "Why leave your company?"}, {"date": "1 Jul 2014", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Mercy (Springfield, MO) in Jan 2010", "Interview Descriptions": "Only one interview. It was informal and insightful. I knew I would be a good fit from the start. The questions were not difficult, or lengthy. \r\nBroad discussion and abstractions of the upcoming task/projects. Detailed discussions of the mission critical components and aspects.\r\nThe interview was long, but it passed quickly.", "Interview Questions": "Needed to explain in great detail my personal solution and critical thought process to a hypothetical issue.  "}]]