[[{"date": "3 Jan 2023", "title": "Advisor I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Jun 2022", "Interview Descriptions": "After applying for the job, I wait until a month before they email me to invite me to an interview. After the selection process, they sent me an email with a link to video-interview myself. Two weeks later, they emailed me back and said I was not selected.", "Interview Questions": "How I will contribute to make the institution a better place?"}, {"date": "3 May 2022", "title": "Academic Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Apr 2022", "Interview Descriptions": "Mostly straightforward questions to get a better idea of my skills and experience.\r\n\r\nThere were 7 people in the interview committee which included the Dean and several instructors/staff. Everyone was very nice.", "Interview Questions": "Q. How do you deal with conflict?"}, {"date": "19 Dec 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Florida State College at Jacksonville (New York, NY)", "Interview Descriptions": "The individual that scheduled the first interview left a couple msg on a Monday, that I had been selected for interview. The final message that day was that the interview would be the next day Tuesday and that she \"expected\" to hear back from me by 4pm that day (msg left at 3:15, with no indication of time, only that it would be in Admin bldg).\n\nI currently am employed and live 5 hours away. \n\nNext day I do not hear back, so I call HR. HR states that typically for that level of position, they allow candidate to arrange for travel a few days out (incl reimbursement for out of town travel). HR rep contacts hiring manager, and reports back that the person who previously left messages would contact me to schedule interview next week to allow for travel. This occurred, but she didn't  seem to know what she was doing (could not even tell me whom I'd be meeting with).\n\nThe interview was panel style, engaging and relevant to posted position, great behaviorally based interview questions. I traveled, rented room, took day off to interview (no indication there would be 2nd round).\n\nI was contacted again, woman left a msg with details for 2nd interview, I called back and left a msg, accepting time/date and I asked about process and whom I'd be interviewing with. She sent email confirming meeting, but did not answer one question about accommodations or type of interview.\n\n2nd: It wa VP of program area and other leadership rep.  There was no real structure, no real questions... it was as if they already knew what I found out 2 weeks later when I called to follow up with VP.\n\nThey pulled the position and rewrote it, I'd have to reapply, but she encouraged me to reapply and would be sure to reimburse travel for revised position (could not for previous pos).\n\nNo thank you. Ethically, that was wrong.  The panel interview was great, seem like they'd be great colleagues. Interview w/leadership seemed dismissive and did not care about how their decisions impacted those they lead.", "Interview Questions": "Tell me about a time you had to manage multiple priorities.\n\nHow do you deal with swift changes in administration and  direction?"}, {"date": "30 Jan 2020", "title": "Dean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Florida State College at Jacksonville in Dec 2019", "Interview Descriptions": "Had a recent interview for Dean position. Although I did not get offer, I was impressed with the professionalism and organization during the process. They took me on a tour, provided lunch, put me in a hotel. Reimbursed quickly for expenses without having to prompt them. Met a lot of nice people. Process was a day of meeting staff (no students), usual interview questions by committee and faculty Q&A where they could ask anything", "Interview Questions": "How would you manage instructional developers?"}, {"date": "21 Jan 2022", "title": "Enrollment Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida State College at Jacksonville in Oct 2019", "Interview Descriptions": "The interview was face-to-face (Prepandemic). It felt more like a conversation. It was a panel-style interview. I was able to meet the team I would later work with. Each member of the panel asked me questions and filled in a premade questionnaire sheet.", "Interview Questions": "Do you work best by yourself or as a team member? "}, {"date": "5 Jul 2021", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Aug 2019", "Interview Descriptions": "It was very good and relaxing and I did not feel pressured And after the interview, I was giving the tour of the establishment. Everybody welcomed me at that place. It was a good experience.", "Interview Questions": "How many years have been in your industry."}, {"date": "12 Dec 2021", "title": "Computer Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in May 2019", "Interview Descriptions": "The interview was informative with job responsibilities, goals, and requirements. After those were stated, the interviewer probed on my experience background outside of training from the college.  After describing my previous experience related to the job being interviewed,  I was questioned on the IT knowledge gained since attending school at Florida State College at Jacksonville.", "Interview Questions": "What are my goals in the IT industry. "}, {"date": "23 Aug 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Florida State College at Jacksonville", "Interview Descriptions": "Was interviewed by a panel of 6 people.  Not sure why this was necessary as this was a back office, non-instructional type position.  Speaking before a group would not be a regular part of this position. I sat at the end of the table and each person took a turn and asked a question.  One interviewer actually asked a 3 PART question!!  I thought this inconsiderate to the applicant. Job interviews are nerve wracking as it is, but to be asked a 3 part question like it's a Miss America pageant?  It's too much.   Not even sure if I answered all the parts.   I walked away from this interview feeling like they judged me on presentation/interview skills rather than on my other, more pertinent credentials/experience/training.  Outstanding candidates will be misjudged in this type of interview process.", "Interview Questions": "Was asked a three-part question during a panel interview. "}, {"date": "25 Feb 2020", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Dec 2017", "Interview Descriptions": "The interview process was with  panel of five people including math Instructors and persons from the Library Learning  Common such as manager, supervisor or academic tutors. It was about twelve questions about myself, my competencies, and some behavioral questions.", "Interview Questions": "Tell us about yourself?"}, {"date": "25 Nov 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Aug 2017", "Interview Descriptions": "Straightforward and easy going interview process. The committee was composed of about 4 employees total: 2 assistant directors, 1 project coordinator and 1 academic advisor. Mostly situational and behavioral typed questions. They also asked about previous experience.", "Interview Questions": "Please provide us with three qualities that best describe you."}], [{"date": "5 Jul 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Jan 2017", "Interview Descriptions": "Panel interview with six members of staff for associated departments. Like many government position they select a few applicants to interview but they already know who they want for the job.", "Interview Questions": "How will you advance the program?"}, {"date": "21 Apr 2016", "title": "Engineer IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Florida State College at Jacksonville (Jacksonville, FL)", "Interview Descriptions": "I was interviewed by a committee with some members from the hiring group and some of their peers. They were interested in technical skills but equally interested in how a candidate would fit in with the team.", "Interview Questions": "How would you handle a situation where you were assigned more work than you would be able to complete on time?"}, {"date": "21 Jan 2016", "title": "Student Success Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Apr 2015", "Interview Descriptions": "Very large panel interview with multiple people in the room. It was a little intimidating. They asked questions one at a time from a script of questions. The process was lengthy as I applied several months before I was contacted for an interview and then several weeks before I was called with an offer and then several more weeks before I was confirmed with a start date.", "Interview Questions": "Why do I want to work at Florida State College at Jacksonville?"}, {"date": "27 Aug 2014", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Florida State College at Jacksonville", "Interview Descriptions": "You just have to take a test and then the supervisor for that particular lab will give you a brief interview. It's fairly casual, and it's easy to acquire the job if you are knowledgeable in the subject area you're applying for. It takes about 2 weeks to be processed and approved for work.", "Interview Questions": "N/A"}, {"date": "5 Mar 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Mar 2014", "Interview Descriptions": "Pleasant, down to earth, no stress. Great people!", "Interview Questions": "N/A"}, {"date": "15 Jul 2015", "title": "Environmental Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Dec 2013", "Interview Descriptions": "Professional, All pertinent questions were asked, Respectful, Positive, All questions were answered. \r\nThe interview was conducted by several heads of departments across several fields, the people conducting the interview were all professionals and well prepared. The environment was positive and comfortable. The interview process was lengthy and the work environment was a pleasure to work in. It is hard to get experience as an instructor and the experience has been very beneficial for me.", "Interview Questions": "Why Should I hire you."}, {"date": "6 Mar 2013", "title": "Tutor At Deerwood Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Florida State College at Jacksonville", "Interview Descriptions": "It wasn't much asked in interview, just few behavioral questions. They would put some situation in front of u and u will have to answer it. Make sure to fill out fafsa before applying.", "Interview Questions": "How would u deal with most annoying student?"}, {"date": "25 Aug 2015", "title": "Engineer II - Network Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Feb 2013", "Interview Descriptions": "Basic questions about IT and how you manage your work. Also, personally questions. Very quick turn around on getting the offer. After offer, you go through a drug screen and fingerprinting.", "Interview Questions": "What is the greatest prank you have pulled on a co-worker"}, {"date": "24 May 2012", "title": "Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Jan 2012", "Interview Descriptions": "Process was very easy but took too long to offer position.", "Interview Questions": "What would your collegues say about you. "}, {"date": "18 Feb 2014", "title": "Senior Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Jun 2011", "Interview Descriptions": "Was interview by the Dean for Career Education and her assistant, who would be my direct supervisor. Exchanged what my office skills were and what would be expected. Very professional and was impressed with the way both the Dean and her assistant handled the interview.", "Interview Questions": "What would I do if a student with a difficult problem was demanding an answer and I did not know the information?"}], [{"date": "31 Aug 2015", "title": "Master Student Math Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Florida State College at Jacksonville (Jacksonville, FL) in Apr 2011", "Interview Descriptions": "The interview process was very simple. There is an assessment about your knowledge on the subject you are applying for. The assessment takes about 3 hours to complete. Once they think you are qualified, they call you in for an interview and one of the professors sits down and talks with you about the job and the opportunity.", "Interview Questions": "N/A"}]]