[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Programs Fellowship", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 May 2017", "job_title": "Programs Fellowships in New York, NY", "duration": "N/A", "pros": "A vibrant, diverse, and inclusive community to stay in and work with.", "cons": "Too often the maintenance of facilities takes place."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "It’s was ok in the beginning but in the end horrible", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Aug 2021", "job_title": "Bursar Services Senior Associate in New York, NY", "duration": "N/A", "pros": "There were some nice staff there and the organization was to help connect residents together and build a network. There would be free breakfast or lunch for days of celebration or meetings.", "cons": "All the senior staff were basically playing a game of thrones with each other. Most of them don’t care about throwing others under the bus to save themselves. At my office there was a lot of passive aggressiveness, pettiness, and micromanaging from my boss. The in house therapist would talk horribly about you behind your back or reveal things about their patients. I felt like I was being forced out at the end because they would always make comments about me saying I don’t do anything when there was literally nothing to do and they were barely around. 6 of us quit around the same time because of the toxic work environment they produced. Too many people wanting to be king and so they all throw others under the bus to get to the top or keep their own jobs. Also there is absolutely no room for growth, the only way to move up is if someone dies, retires, quits, or is fired. And even then they will most likely bring someone from outside usually a friend of the senior staff."}], []]