[[{"date": "10 May 2023", "title": "Associate Director of Contracting Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (New York, NY) in May 2023", "Interview Descriptions": "Initial interview with recruiter who was a darling. The second interview was with hiring manager who was a bit tough. Third and fourth interview was with finance and strategic pricing directors. Strategic pricing director was a dream. Best interview ever!", "Interview Questions": "Tell me about a time you failed and what you learned from it?"}, {"date": "15 Mar 2023", "title": "DCoP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FHI 360 in Mar 2023", "Interview Descriptions": "It was fair and transparent. They asked technical and operational questions. They asked things that would aligned to Usaid requirements. They had multiple rounds of interviews and many people on the interview panel.", "Interview Questions": "Questions involved leadership and management as well as technical"}, {"date": "15 Feb 2023", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "The initial recruiter call with a Durham recruiter was VERY off putting- She did not look at the camera the entire time she was speaking to me. Acted highly disinterested to be doing her job as a recruiter.", "Interview Questions": "Any and all systems you have used along your career."}, {"date": "13 Feb 2023", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "First spoke to HR person, then a group of 3 potential team members. Very standard process. Disappointed that they never responded to me despite my sending of several thank you/follow up messages.", "Interview Questions": "What do you find the most challenging about this work?"}, {"date": "20 Dec 2022", "title": "Grants Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "Deux Interviews. Un premier avec le Responsables des ressources Humaines et ensuite un second avec le hiring manager et l'équipe projet qui a travaillé sur le proposition de programme financé par le bailleur USAID", "Interview Questions": "Comment se passe la gestion des partenaire"}, {"date": "4 Dec 2022", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "Positive interview experience. Consisted of a short questionnaire and panel interview with future team members. Everyone was very nice and easy to talk to. Could tell employees enjoyed working there.", "Interview Questions": "How have you applied health equity principles in your past or current work?"}, {"date": "19 Oct 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "The phone screening individual was unprofessional and never responded to emails. The recruitment team contacted me to schedule a call and when I gave my availability, they never answered, so I followed up, and we agreed on a time. They never sent me the calendar invite. Highly recommend not wasting your time here.", "Interview Questions": "They are supposed to send you the questions beforehand."}, {"date": "20 Oct 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Durham, NC) in Oct 2022", "Interview Descriptions": "Coordinating with the recruiter to schedule an interview was laborious. When we finally agreed on a time (after a no-show from them the first time), the interview was uneventful. They did not review the questions they had me fill out prior, which meant they asked the same questions with me again. At the end of the interview, the recruiter said, \"I'm going to be honest with you,\" and was incredibly rude, informing me that I was \"too green\" to be working in research—what a great introduction to the company.", "Interview Questions": "What is an accomplishment that you are proud of? What makes you a good candidate for this position?"}, {"date": "22 Nov 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 in Oct 2022", "Interview Descriptions": "First and second interviews were two weeks from each other. Just never heard back from recruiter regarding the job after that, had to email two separate recruiters two different times just to get feedback.", "Interview Questions": "Why do you want to work for FHI?"}, {"date": "7 Sept 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "Phone screen, felt like the recruiter did not know what makes someone qualified for the position. She wasn’t taking any notes either which I find strange for a phone screen.", "Interview Questions": "Why do you want this position. "}], [{"date": "19 Oct 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Abuja, Federal Capital Territory) in Sept 2022", "Interview Descriptions": "I recently did an interview with WBG for a HRBP position. It was a 4 panel member interview. The questions are mainly competency based questions. Example describe a time you made a mistake with serious implication, what was the mistake, how did you manage it and what was the outcome? I will encourage anyone preparing for such interview to attend prepared. Study the JD and ensure you have two questions set for the competencies listed on the advert. One positive and one negative.", "Interview Questions": "What are some of the competencies required for the role? What would be your greatest challenge in this role? Describe your experience in managing work related conflicts, what have you learned? What is your greatest achievement, the one that you are most proud of?"}, {"date": "12 Jun 2022", "title": "M&E Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at FHI 360 (Abuja, Federal Capital Territory)", "Interview Descriptions": "Apply to position advert with cover letter and CV\r\nOne interview - review of experience, skills and knowledge of M&E and questions on how to strengthen data use at health facilities", "Interview Questions": "Tell us about yourself and what makes you best suited for this role"}, {"date": "13 Jun 2022", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 in Jun 2022", "Interview Descriptions": "Applied online. One month between submitting application and getting information about the prescreen. Prescreen was a written questionnaire which was nice and allowed you to provide all the information you want the hiring manager to know. A few days later was notified I'd be moving on to panel interview and a week later was officially offered the position.", "Interview Questions": "Why you want to work with FHI360 and the position"}, {"date": "8 May 2023", "title": "Senior Community Research Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 in May 2022", "Interview Descriptions": "I was vetted by HR and then interviewed with several teams of people. Because the nature of the work requires collaboration with different team members, the interview process involved close to 15 people (in separate zoom interviews).", "Interview Questions": "Work history; history of working in a team, how to deal with a team member who is difficult, ability to work in a self-directed manner."}, {"date": "16 Mar 2022", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "The process was fairly standard. We went over my work history, what I'm interested in, and what I could bring to this position. I appreciated that they spent time talking about what the position looks like on a daily basis and opportunity for growth.", "Interview Questions": "How I could address gaps in my experience related to this position"}, {"date": "17 Jun 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at FHI 360 (Ciudad de Mexico) in Feb 2022", "Interview Descriptions": "I was asked to take part in a call for consultants.  There was a brief interview with a member of their office and they asked me to complete a very lengthy and thorough proposal which took me over a week to complete.  It involved working out a syllabus for a course and a detailed plan. They also asked for a resumé and three references.  They told me they would get back to tell me about the outcome but they never did.  When I wrote to them asking for feedback they took their time to reply and then just said I had not been selected for another interview. I got the impression they already had a candidate in place and just wasted people's time. This is an organization that has no respect or empathy for applicants.", "Interview Questions": "Just talked about my skills and they asked me to ask them questions about the lengthy proposal I had to complete."}, {"date": "18 Dec 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "I was selected for a Manager interview. The Recruiter sent me an invitation than failed to respect the virtual interview time. After a couple of days had passed, I was given the option to submit written answers to basic interview questions. I spent several hours completing the questionaire and the Recruiter, who missed the orignal interview time, couldn't be bothered to confirm even receiving my submitted answers.\n\nI realize recruiters have a tough job but they have an obligation to the organizaations as well as all the candidates to demonstrate a minimum level of professional integrity and respect which wasn't demonstrated in this instance.", "Interview Questions": "I never took part in a longer interview."}, {"date": "30 Nov 2021", "title": "Research Associate Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360", "Interview Descriptions": "The interviewers were very specific and strategic about their questions \r\nthey honed in on my data analysis skills, but when I asked what the main duties of the intern would be it was not solely focussed on data analysis \r\nThey seemed very critical and demanding", "Interview Questions": "Small Talk \r\nAsked about my interest in education, as it was different from my health studies \r\nAsked about previous projects during which I performed data analysis \r\nAsked about a time that I was presented with a project or task for which I had to demonstrate initiative "}, {"date": "28 Sept 2021", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "The process was informative, but the wait after the interview was too long. Would be great to let people know as soon as possible (within a week). . . . . . ..", "Interview Questions": "where do you see yourself in 5 years "}, {"date": "2 Dec 2021", "title": "Oficial de Fortalecimiento Institucional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 in Sept 2021", "Interview Descriptions": "Entrevista en dos partes: primero una llamada muy amanea con una persona de Washington para contestar preguntas muy generales, como interés en la vacante, fortalezas y debilidades, etc.  Una semana después me contactaron para invitarme a una entrevista con un panel virtual. Las preguntas se basaron en la alineación de mi experiencia previa para el puesto. Unas semanas después recibí un correo para informarme que no fui seleccionada.", "Interview Questions": "Por qué aplicaste a esta vacante? Cómo organizas tu tiempo? Has tenido experiencia trabajando con personas difíciles? "}], [{"date": "28 Nov 2021", "title": "Technical Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 (New York, NY) in Sept 2021", "Interview Descriptions": "It consisted of 2 panel interviews on separate days. The interview lasted for about an hour and majorly focused on testing knowledge and technical skills related to the role. They also asked a lot of case scenario questions relating to the role .The panel interviews comprised of 4 individuals who had lead roles in the team.", "Interview Questions": "Can you tell me about the skills and knowledge you have that make you suitable for this role \r\n\r\nWe believe in building staff capacity, how would you be able to build the capacity of your colleagues if given this role "}, {"date": "17 Aug 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "After several interview rounds I had heard nothing for several weeks; later learned position canceled. Interviews themselves were great, but wish someone had let me know that the position was canceled sooner.", "Interview Questions": "Basic phone screen questions\r\nQuestions about programs and grants experience"}, {"date": "5 Jun 2021", "title": "Senior Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "Very nice and smooth.  I like the way the whole process was handled. From the invite we were asked to submit all our documents in one pdf and can reach out to the hr manager anytime for questions as the case may be", "Interview Questions": "General questions. And professional questions"}, {"date": "3 Jun 2021", "title": "Technical Advisor, Research and Evaluation Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "I applied online. Recruiter reached up to me a couple of weeks later to set up a phone screen. She did not call at the agreed time and never replied to my follow up emails.", "Interview Questions": "Not applicable because recruiter ghosted me."}, {"date": "5 May 2021", "title": "Technical Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "It was 4 interviews including at technical interview. I met with first one team member and supervisor than  basically everyone on the team, the last interview was with the director.", "Interview Questions": "How I saw myself fitting into this role."}, {"date": "4 Jan 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 in May 2021", "Interview Descriptions": "The interview was a compilation of assessment, personal conversation and writing sample. The assessment tested one's knowledge of international affairs and global human development, the interview was about 1hour and the writing sample was applicable to project management principles.", "Interview Questions": "Interview questions applied the STAR method."}, {"date": "5 Jan 2023", "title": "Data Capturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Polokwane) in May 2021", "Interview Descriptions": "Was simply long and they took time to respond after reference checks and background check, the position was offered was very beneficial as it had a room for growth and lot of learning for me", "Interview Questions": "How do I make sure data is saved"}, {"date": "17 Mar 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at FHI 360 (New York, NY)", "Interview Descriptions": "Interview process was standard. Had a 30 minute phone interview with the recruiter. One week later, I had the formal interview which lasted for an hour.  Never received any follow-up so I guess I did not get the job.", "Interview Questions": "Behavioral/Situational questions"}, {"date": "26 Aug 2022", "title": "Senior Technical Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Mar 2021", "Interview Descriptions": "They have a very standard and impersonal process (First interview with HR, second interview with team) and they do not provide any follow up in case you are not selected.", "Interview Questions": "What tools do you use to manage your teams?"}, {"date": "22 Feb 2021", "title": "Finance Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC) in Feb 2021", "Interview Descriptions": "It was candid, to-the-point, and professional. Although there were a number of technical problems, the interview went well. It was mostly standard with discussing my background, experience, and motivation for this role at this company.", "Interview Questions": "Why do you want to work for FHI 360?"}], [{"date": "15 Jan 2021", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "Had a phone screen followed by two in-person/virtual interviews with a variety of people on the team but that sit at different levels in the organization. Everyone was nice and accomodating.", "Interview Questions": "Curious about proposal and funder experience "}, {"date": "17 Aug 2022", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Lilongwe) in Jan 2021", "Interview Descriptions": "I found it to be easy but I did not get the job. They sent me an email and told me to join online after a week. The panellists were friendly but I felt like I did not prepare enough on the day.", "Interview Questions": "What are your strengths and weakness "}, {"date": "18 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at FHI 360 in Sept 2020", "Interview Descriptions": "Very informal interview, tell me a little bit about yourself, why do you want this position? The interview only lasted about thirty minutes maximum. Received an offer the next week.", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "16 May 2020", "title": "Intern - Hourly Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at FHI 360", "Interview Descriptions": "The interview was conducted via phone call with an employee at the company. The interviewer was very nice but it was very hard to understand him, which added some frustration. But overall it was not too stressful.", "Interview Questions": "How would you approach this question? "}, {"date": "24 May 2020", "title": "Program Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC) in May 2020", "Interview Descriptions": "Pretty basic with the first one being with team members and the second one being with the HR team. All were virtual but one had the chance of deciding whether to do an in person interview at the second stage", "Interview Questions": "Tell us about yourself "}, {"date": "4 Apr 2020", "title": "Clinical Data Systems Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "30 mins screening with HR and one hour panel interview . Everyone is so nice. The director of data science responded my thanks letter very fast, I just finished it and wish there will be a good result", "Interview Questions": "What’s your career planning, what’s your experience with sql and other data management "}, {"date": "1 Sept 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at FHI 360 in Jan 2020", "Interview Descriptions": "I reached out to a recruiter and did an interview but I wasn't qualified. It was a good, professional experience.  They let me know and then reached out again with an offer for another position but I had taken another job by then.", "Interview Questions": "They asked about how I would handle cross-cultural interactions in the work place. "}, {"date": "16 Oct 2019", "title": "Intern - Hourly Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Sept 2019", "Interview Descriptions": "The employer was responsive after I initially submitted my application. The Interview was fairly standard. However, it has taken a long time to get back to me on the result of the interview, and around three weeks later I still have not heard back.", "Interview Questions": "When was a time you made a mistake?"}, {"date": "19 Aug 2019", "title": "Intern, Program Assistant, Program Officer I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at FHI 360 (Washington, DC)", "Interview Descriptions": "Successfully interviewed for 3 positions: Intern, Program Assistant, then Program Officer. The latter were both from an internal perspective.\r\n\r\nI interviewed for a summer internship (paid). Began with a call with HR outlining the company, department, and position with expected pay. Then moved on to the skype interview (I was out of the state) with 2 managers and 3 analysts.\r\n\r\nThe Program Assistant and Program Officer positions interview processes were similar with a call with HR and then an in-person interview.\r\n\r\nFor the intern and Program Assistant positions I knew someone in the department. This helps a lot at FHI and in DC in general, it gets your resume to the top and someone to vouch for you.", "Interview Questions": "Internship Q: On a scale from 1-10, 10 being high, how are your excel skills?\r\nPA Q: Describe your prioritization process for when you have a lot of competing tasks on your plate?\r\nPO Q: Question about my relationships with procurement and travel teams, and my familiarity with internal procurement processes."}, {"date": "16 Jul 2019", "title": "Programs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "Wonderful - until they ghosted me after the third interview. Expected better from such a large organization and hiring department. Hopefully others have better luck with them, as I think the company is a good one.", "Interview Questions": "All the usual questions"}], [{"date": "17 Oct 2019", "title": "Creative Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Jun 2019", "Interview Descriptions": "Had a phone screen first with an HR person that was pretty basic, then went in for a panel interview. This was with the principal that the role reports to and then some of the team that it would supervise and work alongside. All very collegial, polite, and professional. Nice, standard, downtown DC offices. Was there for approximately 1.5 hours.\r\n\r\nThe interview seemed to have gone very well, but very little in the way of follow up from them afterwards. This was four months ago and I realize that hiring processes can be long and drawn out, but I am left to assume that an offer is not forthcoming, since my thank you and subsequent follow up emails to the participants and the HR person all went unanswered.", "Interview Questions": "They asked the standard questions: tell us what you have done, etc. And then they told me about how they were set up as far as processes go and roles and responsibilities. "}, {"date": "16 Apr 2019", "title": "Research Associate I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "No response. Would appreciate a quick, auto-generated email letting me know I was not chosen to proceed. It is very frustrating to have spent time on an application only to be met with silence. Definitely makes me think twice about the company.", "Interview Questions": "N/A"}, {"date": "19 Apr 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at FHI 360 (Washington, DC) in Mar 2019", "Interview Descriptions": "Got an interview request a month after applying.\r\nThe interviewing process took about 2 weeks and got a final response 3 weeks later.\r\nThe interview process was fairly average. Nothing out of the ordinary.", "Interview Questions": "What attracted you to this position"}, {"date": "24 Dec 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "Submitted a resume and cover letter online, then took a short timed exercise assessing STATA skills. After this round, I had a relatively short phone screening with typical questions about interest and experience asked.", "Interview Questions": "Interest in the position, technical background"}, {"date": "22 Mar 2020", "title": "Senior Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 in Nov 2018", "Interview Descriptions": "The interview process was conducted in three stages over a month. First by the HR, then technical team before the project management team. Overall, questions are closely related to the description of the role on the advert", "Interview Questions": "I was asked about my management style"}, {"date": "20 Feb 2019", "title": "Project Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at FHI 360 in Nov 2018", "Interview Descriptions": "I applied in Kingston Jamaica.  The process took about 2 weeks. I was called in for an interview shortly after applying. It was a small office which made the process quicker.", "Interview Questions": "Competency based questions. "}, {"date": "17 Jan 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at FHI 360 (Washington, DC) in Nov 2018", "Interview Descriptions": "The interview process was extremely drawn out, the hiring timeline was non-transparent, and the interviewers were unresponsive when asked for updates. After several interview rounds, the least you can do is be explicit about a rejection.", "Interview Questions": "N/A"}, {"date": "11 Oct 2018", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Abuja, Federal Capital Territory) in Oct 2018", "Interview Descriptions": "It was a very interactive and comfortable process, the interviewwers made me feel comfortable during the interviwe session, there was no form of intimidation, the process went smoothly. I was asked if I had any question for them at the end of the interview session.", "Interview Questions": "why did you apply for the job/role?"}, {"date": "19 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "Phone screen and behavioral interview with members of the team I was applying to.  Involved questions about my resume, background, past experience, and interests in the position I was applying to.", "Interview Questions": "How has your past experience prepared you for this role?"}, {"date": "29 May 2018", "title": "Senior Finance Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at FHI 360", "Interview Descriptions": "HR from Thailand office setup the initial interview schedule with the hiring manager in the local office.   It was a short call and she did not ask too many details about my qualifications and job experience. Hiring manager asked why I only stayed more than a year in the last company I worked for when I stayed in that company for more than 6 years holding 2 different positions. Hiring manager went straight in asking my expected salary. \r\n\r\nHiring manager said that their budget is below my latest salary and asked me how much lower am I willing to reduce my salary.  Further said that if at that point I am not flexible in getting a lower pay, then she won't be able to include me in their short-listed candidate for the next round of interview. I was given until the following morning to decide if I am willing to accept a lower pay. I consented and was included in the 2nd round of interview with the Finance Manager of Thailand office.  \r\n\r\nThe 2nd interview went fine and  we discussed in details my job experience. At the end of the call, I was informed that the hiring manager will be the one to decide and inform me within 1 to 2 weeks about the result. I was interviewed March 23 and I sent a follow up email to the HR person in Thailand on April 9. I received a response after almost 3 weeks - April 27.", "Interview Questions": "1. How much is your expected salary?\r\n2. Tell us about your professional experience related to the job."}], [{"date": "30 Jul 2019", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC) in May 2018", "Interview Descriptions": "The interview process was multi-staged, with a phone screen, one-on-one phone call, received a data assignment, then had a presentation in person. This not unusual for jobs requiring a data analysis skill set. What IS unusual is getting all the way to the presentation stage and not receiving a single word of feedback. I never received noticed regarding the timeline for their decision making or the fact that I didn't get the job. It's incredibly rude of a potential employer to zap approximately 8-10 hours of your time over several interviews and an assignment yet not have the courtesy to simply send a \"we regret to inform you\" email. I dodged a bullet.", "Interview Questions": "What are your strengths and weaknesses, how do you prioritize task, fairly typical questions. "}, {"date": "14 Apr 2018", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "First round interview by phone with HR, went well and was told I was recommended for the next round, which would be in person.  I got an email a few days later saying that I had not actually been selected to move forward.", "Interview Questions": "Basically a walk through my experience and how it lined up with the job."}, {"date": "2 Apr 2018", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "My interview was with a panel of three women. It was an in person interview. We talked about the job position and various duties associated with the job. It went as I thought it would go.", "Interview Questions": "What databases have you used in your previous jobs?"}, {"date": "15 Mar 2018", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC) in Mar 2018", "Interview Descriptions": "The interview process took a month. First HR did a phone screen then in-person interview. The interview panel were very unprofessional, asking silly questions and have no knowledge of the position they are interviewing.", "Interview Questions": "What is your strength and your weakness?"}, {"date": "30 Jan 2018", "title": "Proposal Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at FHI 360", "Interview Descriptions": "Impressive panels with prepared questions. It was evident that there were a lot of candidates being considered and the process was very formalized so as to facilitate them easily. Very organized. Overall, it was a good experience and I was able to learn more about the company and if I would be a good fit for the role.", "Interview Questions": "My ability to multi-task"}, {"date": "4 Apr 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC) in Feb 2018", "Interview Descriptions": "Satisfactory in that the sequence of questions did not seem very coordinated and perhaps appeared to have had little preparation as to what they really wanted to understand or grasp about or from the candidate", "Interview Questions": "How to manage non-compliant contractors "}, {"date": "4 Jan 2018", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360", "Interview Descriptions": "Extremely unprofessional experience. HR had terrible communication with me leading up to my phone and in person interview. When I inquired about the process and when would be finding out about their decision , I couldn't even get an email back saying that I would not be receiving the position.", "Interview Questions": "N/A"}, {"date": "14 Dec 2021", "title": "Assistant Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Maiduguri, Borno) in Jan 2018", "Interview Descriptions": "The process was seamless. It was a one stage interview where both technical questions and HT questions were asked. The process took about 20 minutes. The major questions centered around supply chain management", "Interview Questions": "Mention the best treatment option for malaria"}, {"date": "17 Dec 2017", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC) in Oct 2017", "Interview Descriptions": "I applied online and heard a week later from an HR rep via email.  We had a 20 minute phone call, she was incredibly nice and told me she was going to pass me on to the office that was looking for the intern. Then someone else from HR sent me the details for an in person interview that same week.  The interview last about 50 minutes with a group of people from the team.", "Interview Questions": "Why FHI? Tell me about yourself.  What is you familiarity with certain databases and programs?  Do you consider yourself organized? Asked about all of their specific programs and if I knew about them. "}, {"date": "22 Feb 2018", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FHI 360 (Washington, DC) in Aug 2017", "Interview Descriptions": "Applied online and did a phone screen a few days later. Then did a Skype interview as I didn’t live in the area at the time. Very accommodating to my situation.", "Interview Questions": "Why do you want to work in a nonprofit? "}], [{"date": "31 Aug 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Durham, NC) in Aug 2017", "Interview Descriptions": "Initially began by introducing themselves and explaining the research they needed assistance with. Then, reviewed my relevant research background, and inquired how I might proceed with certain tasks. The process took no more than 45 minutes.", "Interview Questions": "How would you go about the process of systematic literature review "}, {"date": "10 Jul 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC)", "Interview Descriptions": "Phone interview with recruiter, then phone interview with Program Director, then an in-person interview with team. Interview started with overview of the project and they asked what I knew about the project. Then they  asked me to tell them a little about myself before they started asking me questions. Some questions were generic interview questions, but some were more targeted more for specific skills such as data management and Excel abilities.", "Interview Questions": "What is your biggest strength?"}, {"date": "13 Jun 2017", "title": "Technical Officer II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC) in Jun 2017", "Interview Descriptions": "The initial screening call was very pleasant. There were several weeks between the HR screen and the actual interview. I interviewed with a panel of 3 people at the DC office. From the very beginning it was awkward and seemed like the program manager lacked interviewing skills. The panel sat scattered throughout the room and when I asked where to sit, the PM did not direct me. I could tell within the first several minutes that the team either already had someone chosen and was there just to check off the box of interviewing another person or really had decided they were not interested in me before I had arrived. The interview was dry, emotion-less, and ended abruptly. I had considered this job a \"dream job\" but after the interview, I knew I couldn't see myself on that team and that the feeling was reciprocated. Super awkward, but I guess those experiences are bound to happen! C'est la vie.", "Interview Questions": "Why do you want to leave your current job? "}, {"date": "31 Mar 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at FHI 360", "Interview Descriptions": "Applied to many positions, didn't hear back. Finally got a phone call and then in-person interview for Program Assistant position. Didn't get the offer (was later told I was over-qualified for the position), and then several months later, got a call back to interview for Program Officer position.", "Interview Questions": "How do you work under stress?\r\nWhat are your long-term goals?\r\nCan you talk a little bit about yourself?"}, {"date": "18 Feb 2017", "title": "Program Officer II Exchanges Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "Applied online and about a month later i received an e-mail from a recruiter from FHI 360 to schedule a phone interview. She gave me a couple of options and i replied right away with a picked date. Didn't hear back until the day of that date telling me that something unexpected came up and would like to reschedule. we agreed on a day to skype at 10:30--this is where the most unprofessional and disrespectful behavior started. At 10:35 i received an e-mail from her apologizing for being late and that she would call me in 10 minutes. 45 minutes later--nothing! At that point i had to return to my job and e-mailed her to ask to re-schedule. I have not heard from her since then-ever! Even after e-mailing several time. I've interviewed more time than i can count with small and large companies, I have never dealt with an HR office/personnel quite so unprofessional. Shame!", "Interview Questions": "N/A"}, {"date": "3 Apr 2018", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FHI 360 in Feb 2017", "Interview Descriptions": "First, a phone interview with HR. Then, an interview with 4 team members a week later. Didn't hear back but they contacted me for an interview for another department which was another week later.", "Interview Questions": "Do you have experience working with databases?"}, {"date": "16 Mar 2017", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Feb 2017", "Interview Descriptions": "I sent my resume through an employee referral and also chatted with the recruiter at a local career event. You also have to submit an online application. There was one phone screen with one team member who then routed me to the hiring manager. That process was quite fast and took about two weeks. Then, I went in for an-person. Although I did not make it to the next round, the next steps would have been a panel interview with three FHI team members. The whole process was pretty easy, smooth and did not take a long time.", "Interview Questions": "How would you define a bad strategy?"}, {"date": "27 Mar 2020", "title": "Finance Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Abuja, Federal Capital Territory) in Jan 2017", "Interview Descriptions": "Very organized. Screening done after accounting skills test. We were 30 and screened to 5 at the end. After whivh we had a panel interview with finance and hr personnel.", "Interview Questions": "What would you do scenario questions"}, {"date": "27 Sept 2017", "title": "Associate Technical Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at FHI 360 (Nairobi) in Jan 2017", "Interview Descriptions": "I made the application online and received a call about 4 months later on a Friday informing me that i was shortlisted and was invited for an interview following Wednesday. Had option of phone interview or in-person. Panel had 3 people. Questions were technical but straight-forward. Said they would get back after 2 weeks but took wayyy longer.  Generally, it was a good experience though i didnt get the job.", "Interview Questions": "Hiw would you engage the community male members to accept use of family planning in the households?"}, {"date": "21 Aug 2021", "title": "Chief of Party Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at FHI 360 in Jan 2017", "Interview Descriptions": "There were questions that ran the gamut, from technical knowledge to management style to connections in the field. There were interviews with senior business leaders and management. HR managed the process.", "Interview Questions": "How would you run the project"}], [{"date": "11 Jul 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at FHI 360 (Durham, NC) in Jan 2017", "Interview Descriptions": "I sent an email to the hiring person which was sent to me through my university. Within a few days, I was contacted and an interview as schedule. A few days later I received my acceptance.", "Interview Questions": "They asked about my previous experiece"}, {"date": "2 Nov 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 in Jan 2017", "Interview Descriptions": "- I applied online and did not get an email from the recruiter until around 4 weeks later. The interview process was disorganized and I did not know the details until the night before.", "Interview Questions": "why FHI "}, {"date": "30 Dec 2016", "title": "Business Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Dec 2016", "Interview Descriptions": "There was a Phone interview. A Face to face panel interview as well as a Skype interview. Very well managed. Great communication throughout. Speedy movement and timely responses.\r\n\r\nSo overall impressed by the speed and efficiency of the process. Only negative could be it took a while after job application for the interview process to get started.", "Interview Questions": "Past experiences play a major role. Plus suitability to job tasks. "}, {"date": "27 Jul 2016", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "Interview was over the phone and covered areas concerning Clinical services and program management. A few details on Clinical care for HIV patients, HIV Testing and counselling guidelines and current Antiretrovirals in use in Nigeria were also discussed. Finally, there was a section about work-place relationship and management of conflict and disputes in workplace. Lasted about 45 minutes in all.", "Interview Questions": "Current 1st Line drugs for management of HIV in Nigeria\r\nEligibility criteria for commencing ART for HIV patients in Nigeria"}, {"date": "2 Oct 2016", "title": "Financial Analyst II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 (London, England) in Jul 2016", "Interview Descriptions": "first on skype for about 30 mins, followed by an oral one , the pannel consisted of 1 finance director , hr and budget analyst. they were quite okay the interviwers  though i didnt get the job", "Interview Questions": "have you ever had a problem with auditors"}, {"date": "24 Jul 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at FHI 360 (Washington, DC) in Jun 2016", "Interview Descriptions": "I was recommended to apply for the summer internship by a member of the team I networked with during a conference. After submitting my resume and cover letter and following up, I was informed that I will be interviewed by two members of the team. They were super friendly and one was even funny and that put me at ease. The interview itself was a positive experience. \r\n\r\nHowever, scheduling the interview with HR was a bit difficult and I had to follow up constantly. I was told that I will be contacted by a member of the HR team but they never did and I had to take the initiative to contact them. Also, I think they gave the team an old resume I applied with before for another position months earlier.", "Interview Questions": "Tell us about yourself."}, {"date": "18 Jul 2016", "title": "Assistant Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FHI 360 (Washington, DC) in Jun 2016", "Interview Descriptions": "They just never get back to the candidates. After few rounds of interviews, they said that the decision will be made and I will be notified within a week or two. I've waited more than two weeks and heard nothing so contacted them in order to check my status but they just did not respond. I see that this is not the case for me only. Their hiring process is very unprofessional.", "Interview Questions": "Why FHI360"}, {"date": "28 Jun 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FHI 360 (Washington, DC) in Apr 2016", "Interview Descriptions": "I applied online in mid-April. An HR staff member in North Carolina emailed about a week later and set up a phone interview for a few days later. We had a great conversation. I was then invited for an in-person interview in DC. Another HR person (also in North Carolina) sent me an email with very detailed instructions and directions to get to the office. However, I did not have any information about the woman who actually interviewed me in the office. The interview was fine, neither amazing nor terrible. After making it all the way there to show up in person (at a very specific time that they needed, so I had to rush from another commitment in a private cab), I just never heard back though. No email from the interviewer or either of the two HR people who emailed me first. I sent two follow-up emails to both of them in the week or so to follow, and never got a response. They never bothered to send a rejection. That was very disappointing.", "Interview Questions": "N/A"}, {"date": "12 Mar 2016", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Jan 2016", "Interview Descriptions": "First did a Skype screening interview that didn't last more than 5 minutes. Then they set up a phone interview but the person who was suppose to call me never did. Then a week later out of the blue I got an email to come for an in-person interview. Overall the process was very unorganized and unprofessional. It took 2 weeks to hear from them if I got the job or not and I was the one that had to call to check the status of my application.", "Interview Questions": "They didn't ask many behavioral questions. They mostly asked about my interests and experiences."}, {"date": "4 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Jan 2016", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates, and making a hire.", "Interview Questions": "Tell me about yourself and our organization as you know."}], [{"date": "12 Jan 2016", "title": "Program Officer I Linkages Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 (Washington, DC) in Oct 2015", "Interview Descriptions": "Interview process was pretty basic. Phone interview followed by in person interview. The phone interview was routine and included general questions to gauge interest.  The in person interview was rather short and included basic questions.", "Interview Questions": "What is your experience working with HIV/AIDs programs?"}, {"date": "23 Sept 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Sept 2015", "Interview Descriptions": "The first stage of selection involved a very basic, preliminary Skype interview with an HR employee. I was approved for the next round of interviewing, which was on-site and with three employees working in the same business unit and having different roles in the projects with which I would be assisting. One person tended to lead the interview, asking most of the questions, with the other two asking more task-specific questions.", "Interview Questions": "Was there ever a time you could not deliver or perform on a request by a project partner, and what did you do to resolve the issue?"}, {"date": "7 Apr 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FHI 360 (Durham, NC) in Sept 2015", "Interview Descriptions": "After a phone interview/screening, which was very laid back and casual, I was scheduled for the in-person interview. The in-person interview process itself was long. The entire in-person process lasted about 3hours. It wasn't difficult. It was just long. I was exhausted when I left the building. I applied for the position online, and it took less than a week to get a call. They really needed the position filled, and about 4 or 5 others interviewed for it too, which I discovered later. \r\n\r\nI interviewed with the director of the department, three research associates, and a senior research associate/project coordinator in two separate one-on-one interviews, and then a three-person panel interview. Afterwards, I took a written assessment test on MS Office how-to's. The test also had situational questions.", "Interview Questions": "Describe the process step-by-step: How would you go about making and securing a travel itinerary (flights, ground transportation, hotel reservations, etc.) for a twenty-person international team to meet in Houston, TX at XYZ Hotel's conference room? "}, {"date": "31 Oct 2015", "title": "Senior Technical Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FHI 360 (Washington, DC) in Sept 2015", "Interview Descriptions": "I submitted my resume via their website and was contacted by HR the next day to set up a screening interview. The screening interview was with HR and took about 15 minutes. I was also queried about my salary expectations as they didn't want to continue if my expectations were beyond what they were willing to pay. I benchmarked the position on Glassdoor, so my salary expectation fit their range. On to the next round. This was a Skype interview with a director and one other I would be working with in this position. It lasted about 45 minutes. I let them know I would be in the area and available for a face-to-face follow up. I did have a follow up at their office with the director again and two others from the funding agency. At the end of the interview, I was told that there would be decision in the next couple weeks. It has been over 1.5 months and I have not been contacted.", "Interview Questions": "Tell us about your experience with strategic planning?"}, {"date": "10 Aug 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at FHI 360", "Interview Descriptions": "I knew someone working there, so I talked to the person first and then applied online. Then I was schedule for a phone interview. The phone interview with the panel took about an hour. They asked questions about my background, the research I have done, and also specific questions related to research.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "12 Jul 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at FHI 360 (Washington, DC)", "Interview Descriptions": "I had a friend that had worked on the project previously and warned me to stay away for multiple reasons, related to how the project was managed and how PAs were treated (and overworked). I asked the panel questions I knew the answer to in order to see what they told me--and they were predictably dishonest in order to get me hired quickly. I needed a change in jobs and only planned on being there a year until the contract ended--fortunately a better offer came in at another company and I left after 2 months. I won't look for jobs at this company again.", "Interview Questions": "Typical Interview questions for an entry-level admin position"}, {"date": "26 Jun 2015", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Washington, DC)", "Interview Descriptions": "Took about a month from the time of application to invitation for the interview and response. The phone screening was friendly and I got more interested to move on to the next level of interviews. The 6 person panel set up was a bit unsettling but overall a positive experience.", "Interview Questions": "A clear understanding of the job."}, {"date": "16 Jun 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at FHI 360", "Interview Descriptions": "People were casual and very friendly and made you feel comfortable. The over all process started with HR screening and then in-person interview. Both HR and in-person interviews lasted about one hour each. For the in-person interview, make sure you arrive in 10 - 15 before the actual interview time for settling in.", "Interview Questions": "What is your experience of project management?"}, {"date": "30 Jul 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at FHI 360 in May 2015", "Interview Descriptions": "Over the phone and informal. The longest process was getting someone on the phone who could hire me I was reffered through a professor who introduced me to my manager. He was very busy but ultimately we worked it out.", "Interview Questions": "Where have you worked before? What did you do there? Why do you want this job? Do you think you could handle this job? What are your weaknesses and strengths."}, {"date": "7 Apr 2017", "title": "Data Entry Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Abuja, Niger) in Mar 2015", "Interview Descriptions": "It was not too tense. The applicant needs to be extra-prepared and composes foe the job. Knowledge of the organization's operation is equally imperative. Thus, an hour dedication to Fhi360 website would do.", "Interview Questions": "What innovation do you want to bring to this job? "}], [{"date": "23 Feb 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at FHI 360 (Lagos) in Feb 2015", "Interview Descriptions": "Hiring was a bit slow and interviews kept being repeated. A telephone interview followed a face to face interview and they weren't readily forthcoming with post interview feedback. On the flipside, once they had taken a decision, the rest of the process was quite speedily smooth.", "Interview Questions": "How will you resolve conflict between the organization and government stakeholders?"}, {"date": "25 Jun 2014", "title": "Program Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at FHI 360", "Interview Descriptions": "I was contacted by an HR rep for an initial interview, then asked to meet with 2 interviewers a few days later. I had a second round interview with 2 different people the following week.", "Interview Questions": "Describe a time when you failed to meet expectations. How did you handle it?"}, {"date": "24 Nov 2014", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at FHI 360 (Washington, DC) in Jun 2014", "Interview Descriptions": "I was referred by an FHI 360 employee for the Program Officer position after they saw the job posting circulate.  I submitted my application and credentials online and the very next morning received a call from a recruiter for the position which served as a preliminary phone interview.  The recruiter then asked if I could come in the very next morning for a 1:1 interview.  I interviewed with the person who's position I was applying for (they were being promoted).  This interview was basic - it discussed my work experience, interests, academic background, etc.  I was asked to complete a scenario test that would be emailed to me and due the next morning.  Immediately after the interview I was asked to return for an interview the next day with the hiring managers.  The interview with the hiring managers -  one who would be my supervisor and the other with whom I would be working closely, was very thorough.  It built on the basic interview I had the previous day and went further into detail about the position's demands, responsibilities and expectations.  I answered questions that focused in-depth on relevant work experience and as well as work-ethic/personality questions.  The hiring managers were direct, open to questions, and personable.  Immediately after, I was asked for three references and three business days later I received an offer from my recruiter via phone call.  I countered the salary offer.  It took two weeks to receive a response to which my counter was rejected.  I accepted the offer and my first day was two weeks later.", "Interview Questions": "What I knew about education theory."}, {"date": "25 Jul 2015", "title": "Contracting Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at FHI 360 (Washington, DC) in Mar 2014", "Interview Descriptions": "A total of five interviews.  The first two were over the phone with a HR recruiter, the third was in person with the director, the fourth was over the phone with 3 other contracting officers and the director, the fifth was in person with 2 contracting officers and the director.", "Interview Questions": "Typical - what's your greatest strength, weaknesses, etc. Background information.  Typical background on the company.  Had to listen how fabulous everyone interviewing me were ."}, {"date": "9 Dec 2013", "title": "Business Development Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at FHI 360 (Research Triangle Park, NC)", "Interview Descriptions": "The interview process took me through four separate interviews with different people. The initial experience seemed to go along pretty fluidly; however, after I made it to the final steps for hiring, the HR process became dicey. The HR contact would not return phone calls nor stick to promised dates of getting back to me. Additionally, the people whom I interviewed with never followed up with me after meeting me four separate times. After dragging the entire process out for over two months, they eventually got back to me to let me know they had decided to hire someone else. Never mind the fact that they had stated they had had trouble making contact with my references (which they never did call or reach out to them...I checked back with them) and despite the fact that they led me on a merry chase that ended up nowhere....", "Interview Questions": "What salary range are you expecting for this job?"}, {"date": "28 Aug 2014", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at FHI 360 (Abuja, Federal Capital Territory) in Sept 2013", "Interview Descriptions": "Submit your Resume and if you are qualified, you are contacted. \r\nMy interview was over the phone and the questions were basically to assess my knowledge of the position I was applying for and to check my human resource experiences and skills", "Interview Questions": "How would I handle an employee who flout the organization policy"}, {"date": "30 May 2016", "title": "Assistant Technical Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at FHI 360 (Lagos) in Aug 2013", "Interview Descriptions": "There was definitely use of some scare tactics but overall not too bad. Just be confident with yourself. Multiple people in the room, questions all related to the job experience. If you say you know how to do something make sure you are certain, they will ask.", "Interview Questions": "How many years experience do you have working with HIV and HIV related illnesses"}, {"date": "23 Jun 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at FHI 360", "Interview Descriptions": "Multiple rounds with differnent panels; rather lengthy, but straight forward process.  One did did the opportunity to meet not only the hiring manager, but also potential colleagues and manager's boss.  Interview questions were not difficult -- fairly clear review of background and experience, based off of one's CV.  Emphasis was clearly on whether or not one had the requisite skill set.", "Interview Questions": "no really difficult questions"}, {"date": "11 Jun 2013", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 months. I interviewed at FHI 360", "Interview Descriptions": "I only had one interview here and got the job immediately. The people seemed very friendly and outgoing. The interview was a lot easier than I expected. We were laughing ten minutes in and the interview broke down to a very informal, personal conversation. Great interview experience. Felt at home.", "Interview Questions": "To be honest, my entire interview was a blur. I hardly remember now. "}, {"date": "1 Jun 2013", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at FHI 360 (Washington, DC)", "Interview Descriptions": "Online application, submission of resume\r\nTelephone interview with recruiter\r\n2nd Telephone interview with recruiter\r\nFace to face interview with hiring manager and some staff", "Interview Questions": "N/A"}], [{"date": "7 Oct 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FHI 360 (Washington, DC) in Mar 2013", "Interview Descriptions": "There was a phone screen, a phone interview and then a one-on-one interview.  There were no surprising questions.  Traditional questions such as team building, career goals, conflict management, etc.", "Interview Questions": "5-year career goals"}, {"date": "9 Feb 2013", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at FHI 360 (Washington, DC)", "Interview Descriptions": "Was contacted by HR and had an initial \"screening\" interview that lasted about 15 minutes. Then I had a second phone interview that lasted about half hour with a would-be supervisor, who was actually really great. Next had an in-person interview (about an hour), which required traveling to DC. The interview did not go as well as I would have wanted. However, the interviewer still instructed me to provide two writing samples even though she already knew she was not interested in me. I emailed the samples as soon as possible. I also wrote thank you emails after phone interviews and even hand wrote and mailed a thank you note after the in-person interview. Their communication with me stopped after the in-person interview. I thought this was very rude considering they were aware that I took a very taxing trip to DC (on my own buck) to meet with them. I even followed up about a week and half after I submitted my writing samples.\r\n\r\nI am sure this organization is doing great work and that everyone is perfectly nice (including HR)  but I am not impressed by an organization that cannot take the time and consideration to reject a candidate who went through 3 interviews, sent both email and written thank you notes, and took the time to follow up with you. Had I gone through the first interview and not heard back, I would not even think about it too much, but three interviews at least deserves a one line rejection email.  To conclude, although things did not work out with this organization, I know I showed a high level of professionalism throughout the interview process, but I feel the company fell short in their level of professionalism towards me.", "Interview Questions": "How have you shown initiative at your previous work?; also my resume includes some managerial work (in an education nonprofit) and previous experience teaching. This somehow confused the interviewer who was not sure how these related and couldn't understand what I was actually interested in (i.e managerial or technical work). I was questioned about that. Although I answered the question clearly, the way she asked the question did throw me off internally."}, {"date": "18 Jun 2013", "title": "Biomedical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Bhopal) in Feb 2013", "Interview Descriptions": "It was tightly competitive, where  all the age group and experienced candidates  was available for interview", "Interview Questions": "How will you work with Govt. officials"}, {"date": "13 Nov 2012", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC)", "Interview Descriptions": "Lengthy and in-depth, the entire process took 2 weeks, I had a phone interview, met with HR, and then met with several members from my center. The background check also took a while to complete. Questions were reasonable and realistic.", "Interview Questions": "What was the biggest challenge you had to overcome in your last job?"}, {"date": "10 Jun 2013", "title": "Bio Statistician I Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at FHI 360 (Research Triangle Park, NC) in Nov 2012", "Interview Descriptions": "Initial phone HR interview.  1st On-site interview 15 mins with another HR representative, four 30 minute panels with various scientists and directors followed by a programming and written assessment (untimed but you should \"expect\" to spend an hour on it).  There were multiple people up for the position so some of the interviewers had sheets with the same questions to compare you to others with.  They will ask you if you are capable of working with foreign people or people with accents, do not say yes if you are not fully capable because some of the interviewers were difficult to understand.", "Interview Questions": "It was overwhelming to speak to so many people on the same day followed by the assessment."}, {"date": "28 Dec 2013", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FHI 360 (Washington, DC) in Oct 2012", "Interview Descriptions": "Hiring process varies depending on importance of position. Coming in at a lower level, I found it very straight-forward. Very positive interaction with recruiter.", "Interview Questions": "N/A"}, {"date": "24 Apr 2013", "title": "Business Development Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at FHI 360 in Mar 2012", "Interview Descriptions": "Panel-type interview.  HR is incredibly slow due to background checking process.", "Interview Questions": "How will you convince very accomplished scientists to take your contributions seriously?"}, {"date": "24 Jul 2015", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at FHI 360 (Durham, NC) in Feb 2012", "Interview Descriptions": "Phone interview with the recruiter first.  Then an in person interview with about 5 different people through out the department as well as HR. It was a pretty smooth process. No too stressful. I was probably there for 3 or 4 hours.", "Interview Questions": "They asked about my management or supervisor experience. They also asked if I had ever worked with an international governmental organization before."}, {"date": "28 Feb 2012", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at FHI 360 in Nov 2011", "Interview Descriptions": "I was called for an interview just 2 days in advance. I was interviewed by a panel that included coordinators of the 2 programs concerned, the financial manager and the country director.", "Interview Questions": "Tell us what you would do during your first days in this job. "}]]