[[{"date": "20 Oct 2022", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California Dental Association", "Interview Descriptions": "Average interviews. Phone screening, zoom interview with HR, and zoom panel interview with the team. Process took less than 3 weeks, and they communicated well with me throughout. Would recommend to others seeking employment.", "Interview Questions": "Tell me a little about yourself."}, {"date": "6 Oct 2020", "title": "Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California Dental Association", "Interview Descriptions": "Video call was choppy and froze a lot, which made it challenging to follow them. Technical difficulties aside (also not really their fault), it was clear that the design position was more UX and not simply graphic design. They should be more clear about their goals in filling the position in the posting, as well as the recruiter interview. I've always been upfront that I don't do backend work but it seemed to take the panel by surprise. \nIt was clearly not a fit, but the frustrating aspect was after the interview was complete I sent 3 emails to the recruiter thanking her for the time and if there was any update. She never responded to any of the messages which is extremely unprofessional. I don't believe ghosting is a good recruiting strategy. I definitely won't be reapplying for any future roles at this company.", "Interview Questions": "Asked about my design process. "}, {"date": "20 Mar 2020", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at California Dental Association", "Interview Descriptions": "Spoke with HR for a brief phone interview, then did an in-person panel with three people (including HR) for about an hour. I was scheduled for another interview with the higher ups but was then told they put the position on hold and my interview was canceled. To my surprise, I saw the position posted a week later without any mention to bring me back in. Seemed a bit shady, especially since they also told another interviewee for the same position they had chosen someone else, which they obviously didn't.", "Interview Questions": "How do you deal with difficult coworkers?"}, {"date": "29 Apr 2019", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California Dental Association", "Interview Descriptions": "I applied online, was asked to give more information, and then had a phone interview. No call for an in-person interview. The person on the phone I called with was polite and professional. They seemed to want very detailed answers, it was slightly on the longer side in regards to phone interviews, about 40 minutes. I was contacted about 1-2 weeks later via email saying they chose to move on with another candidate, overall pretty neutral and average experience.", "Interview Questions": "N/A"}, {"date": "21 Apr 2019", "title": "Human Resources Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at California Dental Association (Sacramento, CA) in Apr 2019", "Interview Descriptions": "Phone interview, in-person panel interview and an additional interview with VP and the Director in the same visit. The entire process was less than 5-days. The entire team was very thorough and asked multiple questions regarding the duties in the position and how that related to my previous work experience.", "Interview Questions": "Why do you feel you would be a good fit for the position?"}, {"date": "10 Apr 2019", "title": "Commercial Insurance Agent Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at California Dental Association (Sacramento, CA) in Mar 2019", "Interview Descriptions": "3 week process. 1. phone interview.  2. schedule in person interview 3. Interview.  I have a college degree and have paid heavy dues selling insurance business to business and cold calling without any leads, but still had recognition for high production.  I found it interesting that the ladies that interviewed me have their positions, and are empowered to hire or not to hire, because neither of them are college graduates, they are high school grads only.  How can you be qualified to have the critical thinking skills necessary to be a lead without paying the education dues?  Also, they came up the easy way in the insurance industry through clerical or salary jobs not business to business x-dating and hard core or commission sales, but they can decide who gets their cushy sales position.  They don't have the IQ to know a real insurance sales person when they meet one.", "Interview Questions": "How do you prioritize your work tasks?  Sales, underwriting, contacting leads, paper work, returning calls etc."}, {"date": "8 Sept 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at California Dental Association (Sacramento, CA) in Sept 2018", "Interview Descriptions": "I applied online and within a week, I was contacted by HR for a phone screen. She went through the list of questions in a professional manner. Another week went by, I was contacted again a day before Labor Day for an on-site interview 2 days after Labor Day. I said that I would still be on vacation and be willing to come on-site next week. She said she would check with the CIO but is not sure if they could wait for me. This is the first time I was given one and only option for interview schedule (be there or be square).  That was the last communication I got from CDA. \r\n\r\nIf the organization is so fixated on a specific schedule and not flexible to come up with alternative solutions, it is not the place I want to be. It is ironic that they said they practice Agile.", "Interview Questions": "Tell me about yourself"}, {"date": "8 Apr 2018", "title": "Nationaler Qualitätsmanager / Großkundenbetreuer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at California Dental Association", "Interview Descriptions": "Applied for job through listing on Indeed and received call for phone interview shortly after. There were two rounds of panel interviews with executives from the organization, but it wasn't as intimidating as I expected. Each interview involved technical and behavioral questions. The environment was very professional and amiable.", "Interview Questions": "Describe a time where someone disagreed with one of your ideas and how you handled the situation."}, {"date": "26 Sept 2017", "title": "Compliance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at California Dental Association (Sacramento, CA) in Sept 2017", "Interview Descriptions": "Initial phone interview followed by an in person Panel type interview. Very professional building have to check in downstairs at front desk.  Metered parking outside. 1 hour min interview time.", "Interview Questions": "describe a time you were proud of something you did?"}, {"date": "4 Feb 2017", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at California Dental Association (Sacramento, CA)", "Interview Descriptions": "I went through two brief, relaxed interviews. First round was with HR and who I now directly report to, followed by a second with the same people and VP of my department. Everyone was friendly while still focusing on the importance of the role. They were able to give insights into all aspects I'd inquired on.", "Interview Questions": "Why I wanted to get into the field"}]]