[[{"date": "30 Jan 2023", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Transparency International", "Interview Descriptions": "A very structured set of questions with three interviewers about past experiences mainly. They were taking notes and nodding nicely during the interview. At the end, they asked me if I had any questions and they took their time to respond with details. Overall a very good experience.", "Interview Questions": "How do you manage your time?"}, {"date": "3 Jun 2022", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Transparency International in Mar 2022", "Interview Descriptions": "I was ghosted after spending two days working on an interview assignment, even though the recruiter promised feedback in the initial email. A little disappointing to say the least. After writing twice to the recruiter and receiving no reply, I gave up.", "Interview Questions": "It was a research task assignment."}, {"date": "14 Mar 2020", "title": "Policy Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Transparency International (London, England) in Jan 2020", "Interview Descriptions": "There was a panel and it lasted 1 hour. Questions range from behavioural to content- expertise. It was a friendly environment and quite honest in the offer. It was a great experience", "Interview Questions": "How would you improve internal and external communication channels?"}, {"date": "14 Sept 2018", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Transparency International in Aug 2018", "Interview Descriptions": "Straightforward application followed  by Skype interview. No detail given in advance, but simple interview with friendly and accommodating panel.\r\nAfter the interview nobody contacted me to let me know the outcome. I had to follow up weeks later, more to flag that they had not contacted me, and it seemed that was standard practice.", "Interview Questions": "What type of line management do I prefer to receive?"}, {"date": "14 Nov 2017", "title": "Business Integrity Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Transparency International (London, England) in Mar 2017", "Interview Descriptions": "Skype interview, internet connection was bad so they could not see my face. They asked me some questions about how I'm motivated and why I am good for this position, I think.\r\n\r\nI asked them a question at the end regarding their position towards the government.", "Interview Questions": "What makes me capable for this position or why it would suit me."}, {"date": "18 Aug 2016", "title": "Programmer Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Transparency International", "Interview Descriptions": "The interview process was composed of: online application, written test, skype interview plus interview in Berlin. Very Professional HR staff, friendly, communicative and honest about the pros and cons of the position. Paid for travel to Berlin for the interview. The interview itself was quite easy with the usual questions about motivation and skills.", "Interview Questions": "what can you bring to this role?"}, {"date": "6 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Transparency International in May 2016", "Interview Descriptions": "Straightforward interview. Over Skype (with video), lasting for around 45 minutes with 2 staff members. Questions were pretty general e.g. motivation for applying, expectations of the day-to-day workload, working in challenging/international environments. Was contacted 2 days later with an offer and a month's time frame to relocate to Berlin, with costs of a single flight reimbursed.", "Interview Questions": "What is your motivation for working at TI?"}, {"date": "31 Jan 2016", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Transparency International (London, England)", "Interview Descriptions": "Very friendly and informal environment. Had to do a written task before for which the information is provided. Then small panel interview. Interview began with standard tell us a bit about yourself. They spend a bit of time looking at my CV, understanding what I'd been up to.  Then a series of the core interview questions; what could you bring to the organisation, strengths and weaknesses, what you'd like to be working on.", "Interview Questions": "Interview began with standard tell us a bit about yourself. They spend a bit of time looking at my CV, understanding what I'd been up to.  Then a series of the core interview questions; what could you bring to the organisation, strengths and weaknesses, what you'd like to be working on."}, {"date": "3 Jul 2014", "title": "Research Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Transparency International (London, England)", "Interview Descriptions": "Applied online and was asked to supply a written test. Was invited to interview a few weeks after the closing date, conducted by two staff. General information about the role and myself. Was then asked to undertake two further written tests of relevance to the role, similar to the original written test that was sent in prior to the interview.", "Interview Questions": "N/A"}, {"date": "2 Jan 2014", "title": "Programme Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Transparency International (London, England) in Jun 2013", "Interview Descriptions": "applied online had to send in cv and cover letter then heard back a few weeks later to come into the office for an interview. the interview was with the head of the program i would be assisting. Was a general chat then had to do two tasks. the first was writing a letter based on a report and the second was creating a plan for the launch of a report. I actually got an email addressed to someone else saying i didn't get the job - that was awkward. When i contacted hoping the intended person of my email got one saying they  got the job found out I too hadn't gotten it. They also couldn't give feedback", "Interview Questions": "what do you think the role entails? (it was a new role that had just been created so was kind of hard to prepare for such a question) "}], [{"date": "7 May 2013", "title": "Training & Advisory Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Transparency International (London Colney, England) in Jul 2012", "Interview Descriptions": "I applied online for an internship at Transparency International, and heard back from the office administrator in a couple of days to set up a phone interview with the person I would be working with. We scheduled a phone interview, and it was relatively laid-back - he only asked questions on availability, and why I was interested in interning for TI, and requested a writing sample. It seemed as if they had already decided to hire me as an intern.", "Interview Questions": "No difficult or unexpected questions - just the usual, \"why do you want to work for us\", \"how are you qualified\", and since I was a student applying for an internship, \"what is your course/how are your studies related to this position\". "}]]