[[{"date": "14 Mar 2023", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Boys and Girls Club of Canada", "Interview Descriptions": "Group interview, had to share a craft and lead a camp game, also had to build a marshmallow tower. One of the group interview members was told that they were supposed to sabotage the tower so they interviewers could see how we reacted to that", "Interview Questions": "How do you handle conflict?"}, {"date": "24 Apr 2023", "title": "Summer Camp Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boys and Girls Club of Canada (Scarborough, ON) in Apr 2022", "Interview Descriptions": "The interview process was very quick. The person who interviewed was so nice and welcoming it was easy to talk to I. I wasn’t feeling nervous or anxious at all", "Interview Questions": "What would I want with this job"}, {"date": "13 Jun 2022", "title": "Youth Mentorship Program: Mentee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Boys and Girls Club of Canada (Edmonton, AB) in Mar 2021", "Interview Descriptions": "Easy interview. Some interpersonal skill questions, and scenario questions. Long interview, about 40 minutes. Questions about prior experience with children, dealing with difficult situations, and why you want to mentor. Overall interviewer was nice.", "Interview Questions": "What would you do if your mentee disclosed something dangerous to you?"}, {"date": "4 Oct 2021", "title": "Group Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boys and Girls Club of Canada (Toronto, ON) in Jan 2021", "Interview Descriptions": "Applied online and went in for interview. It was a quick 15 minute interview one on one. They asked like 10 questions and then said they would call me back", "Interview Questions": "Describe a situation were u were challenged and how u got thru it"}, {"date": "26 Nov 2020", "title": "Group Home Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boys and Girls Club of Canada", "Interview Descriptions": "It’s was good, the questions were very scenario based but completely doable if you are confident in your abilities. Overall it was a great experience and I will take away learnings from this.", "Interview Questions": "N/A"}, {"date": "6 Mar 2021", "title": "Youth Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Boys and Girls Club of Canada (Oshawa, ON) in Jan 2020", "Interview Descriptions": "I underwent 2 interviews, 1 preliminary and then a more formal 2nd interview with the Program Director and the Executive director,  The interview was focused on giving examples of time when I demonstrated positive youth development", "Interview Questions": "Name a Time when you demonstrated excellent Customer Service"}, {"date": "24 Feb 2020", "title": "Lifeguard/Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Boys and Girls Club of Canada (Oshawa, ON) in Dec 2019", "Interview Descriptions": "They started us off in the water with skills like the 20-pound brick and then we had to do a practice teach of a level 4. they then took us inside the guard office and conducted a dry interview with questions like, what other teaching/ instructing experiences do you have what is your background with kids etc.", "Interview Questions": "what is your experience in teaching adaptive aquatics?"}, {"date": "15 Sept 2020", "title": "Program Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Boys and Girls Club of Canada (Niagara Falls, ON) in Sept 2019", "Interview Descriptions": "It was a phone interview with the Director and a person of HR... applied and after two days, they emailed for an interview. They ask you a few questions based on your skills, availability, and the location you would like to work at", "Interview Questions": "Q: Have you made programs before?"}, {"date": "30 May 2022", "title": "Summer Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boys and Girls Club of Canada in May 2019", "Interview Descriptions": "It was a sit-down interview with one interviewer. Going over questions about your qualifications and potential scenarios. The interview was filling out a sheet with my answers and notes as we went along. I'd estimate it was maybe half an hour in duration.", "Interview Questions": "How would you respond if a parent was unsatisfied/upset with the care we are providing their child?"}, {"date": "8 Apr 2019", "title": "Program Manager (BGC of Niagara) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Boys and Girls Club of Canada (Niagara, ON) in Apr 2019", "Interview Descriptions": "Applied online on Indeed\r\n\r\nWas called within a wk, by the female who would be interviewing.\r\n\r\nShe was extremely aggressive and rude on the phone (didn't even mention the role), and expected because she chose when to call me, that I would be available and know the exact job description/details even though I did not have a computer in front of me nor did I remember applying to the organization/job (as of course, as an applicant, you don't just apply to 1 job these days).\r\n\r\nBGC of Niagara seemed from the question on the phone, that they hold bias and discriminate against people's location, as the tone and questions reflected my current location compared to the work location (which obviously is a problem for them, even though I have the right to apply to any position in my province and in Canada; what don't they get about that and why choose to show the culture is to discriminate against those not in your tribe/location? hmm...).\r\n\r\nI set up a date/time to interview, but when I asked for accommodations in the hiring process, I  \"policy\" instead of a welcoming & friendly environment that expresses on their job descriptions that they create barrier-free opportunities for candidates and that they are accommodating.  \r\n*using \"policy\" indicates that corporate America has ruined the grass-roots/not for profit feel of what was the old B&GC of Canada.\r\n\r\nAfter asking for accommodations in the hiring process,  and being denied, I still agreed to the interview.\r\n\r\nAfter a very short time (in the same day), I was rudely called back and told I would not be asked to interview as they had moved on from my application. \r\n\r\nThey took a very negative approach to the hiring process, and the individual who called, when asked about the role, needed to take a few minutes to find out the information even though she called me and was the one to be in the interview.", "Interview Questions": "You live in____________, oh ok...so that's kind of far away. Hmm..."}], [{"date": "26 Sept 2020", "title": "Activity Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Boys and Girls Club of Canada (Kelowna, BC) in Sept 2018", "Interview Descriptions": "Interview took about 45mins- 1 hour. Questions started off as who you are, why do you want this job, what do you know about the boys and girls club to scenario questions. From coworker problems to childrens behaviour questions.", "Interview Questions": "What do you do if you and your coworker are not agreeing or getting along in in a classroom scenario? "}, {"date": "14 May 2017", "title": "Youth Mentorship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Boys and Girls Club of Canada (Brantford, ON)", "Interview Descriptions": "Typically interview. Answered a series of questions asked by my immediate superiors. Was vague in describing the program, working hours location etc as it was a new program and they were unsure how it would all work out", "Interview Questions": "Do you have a mentor?"}, {"date": "3 May 2016", "title": "Child and Youth Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Boys and Girls Club of Canada (Toronto, ON) in Jan 2015", "Interview Descriptions": "Formal and professional. \r\nInterview was held with Director and my direct Supervisor. I liked that the interview was at the main community centre 'hub'. I got to meet and see the community we serve directly as well as the regular day to day interactions between Director and other staff members with the community. \r\nThey were both incredibly kind and understanding and had a good sense of humour, and also shared their own personal experience and stories during our conversation / interview. Which made the interview feel like 'Interview' and more of a meeting.", "Interview Questions": "How important is Community to you (me)\r\n"}]]