[[{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Horrible Cut Throat Management, No Raises, No appreciation.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 May 2014", "job_title": "Anonymous Employee in Hell Hole Creek", "duration": "N/A", "pros": "Working in the Reentry setting working to assist inmates with their transition back into society. Majority of  coworkers are very helpful team players. Retirement plan.", "cons": "Benefits especially health coverage. Management SUCKS!! Zero staff appreciation and acknowledgement which leads to low morale and production of work. Management will throw you under the nearest bus, train, or automobile in their path. Not open-minded to ideas from staff. I've never seen anyone receive a raise without a promotion. If you are not \"in\" then you wont be recognized or included, you will just be crapped on and considered a body to work. Training sucks if it even takes place and then you will be held accountable for being unaware of certain things. No consistency, policies and rules are constantly changing. People are constantly trying to cover themselves and do not care about the inmates or the quality of the program it is all about money fulling up beds and slitting throat every chance they get."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Enjoyed my job and co-workers.  Management is very unprofessional.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Mar 2013", "job_title": "Anonymous Employee in Kentucky", "duration": "N/A", "pros": "Enjoyed assisting the residents and feeling I made a difference.", "cons": "Pay and benefits are terrible, in fact there are no benefits if you call joining a credit union a benefit.  You are told you may have some money deposited into some kind of retirement account after several years???  There is no work/life balance.  If you call in sick you are given the fifth degree.  You do not have a life.  Have you ever seen a job description telling you to empty your trash, dust your office, etc.?"}]]