[[{"date": "6 Apr 2022", "title": "PowerStudy Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southwestern College (California)", "Interview Descriptions": "The interview was pretty straight forward. It involved completing a mock tutoring session and answering questions from two administrators and a current PowerStudy leader. They made me feel comfortable and valued for the time that I spent with them.", "Interview Questions": "N/A"}, {"date": "8 Jun 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Southwestern College (California)", "Interview Descriptions": "Easy to answer, the interview was made in the supervisor office. She was great and offer me the opportunity to work with them. Overall i think is a great starting job for students.", "Interview Questions": "Why would they hire you"}, {"date": "24 Sept 2020", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Southwestern College (California) (Chula Vista, CA) in Dec 2018", "Interview Descriptions": "They (a panel) asked basic questions, but nothing about expected salary. Mostly \"tell us about yourself\" and \"do you know how to use Microsoft Office and office technologies?\" Easy, but formal.", "Interview Questions": "Can you describe a time you made a mistake at work? How did you handle it?"}, {"date": "21 Oct 2020", "title": "Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Southwestern College (California) (Chula Vista, CA) in May 2016", "Interview Descriptions": "3 tiers of interviews, fantastic reviews from those on the interview panel, ultimate decision was based on nepotism (Dean of Counseling and Disability Support Services Director).  The person selected for the job has the reputation of being the laziest and worst counselor.", "Interview Questions": "N/A"}, {"date": "26 Feb 2016", "title": "Education Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Southwestern College (California) (Chula Vista, CA) in Feb 2016", "Interview Descriptions": "You come in, first you have 30 minutes to draft a letter to an instructor. The instructions read, \"you have an instructor that has been leaving trash behind in the classroom, they are also letting out class early and students have complained,, lastly, they have not turned in their \"census\" to the director on time, draft a letter to them addressing these issue.\" Something like this. In addition to this there is a worksheet that you are to complete during the 30 minutes as well. I have no idea what is on the sheet because I misunderstood that that had to be completed within the 30 mins. Next you have 15 minutes to go over the interview questions. The questions are pretty typical. \r\n\r\nThis interview did not go well for me. 1) I misunderstood the directions so I didn't even get to finish the worksheet they gave me. 2) The interview committee did not seem very welcoming except a lady named Dawn who was there for interview compliance reasons. You come in and there are 4 of them plus Dawn sitting at a board room table with you at one end. I asked if I could sit closer to them but they said no which right away made me feel dumb. We've all been through interviews, I've had to interview people myself, everyone is nervous, the interviewers should be more welcoming and easy going. Maybe smile once in a while. It might of just been an off day for me.", "Interview Questions": "What is your experience with cultural diversity?"}, {"date": "24 Apr 2015", "title": "Student Services Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southwestern College (California) (Chula Vista, CA) in Mar 2015", "Interview Descriptions": "I applied online and it took about 3 weeks for their human resource to contact me via phone. They email you instructions about the interview- what to expect, etc.\r\n\r\nActual in-person interview.. There are two parts to the interview. First part is actually a written part and you get 15 minutes. They have a computer set up for you to use and the written part was more scenario based, such as \"student was promised by faculty that they would get credit for a specific test, but you did not grant it and it has passed due date and now student can no longer graduate. Please write a memo to the student explaining what happened.\" \r\n\r\nAfter you finish the written part, you get 10 minutes to review the list of interview questions and are allowed to write notes so that it may assist you during the actual interview. You get interviewed by a panel of people (5-7 individuals) and the questions that were asked were relevant to the position. Also, scenario type questions were asked as well.\r\n\r\nAfter the interview, they will contact you via email regardless what their decisions were.", "Interview Questions": "Can you please give us an example where you had to deal with cultural diversity?"}, {"date": "8 Aug 2016", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Southwestern College (California) (Chula Vista, CA) in May 2014", "Interview Descriptions": "If your application has been selected for an interview, a member of the department’s hiring team will contact you to set up a time.Now, this is your chance to do some background research and to gather together everything you need to come to the interview confident and prepared.", "Interview Questions": "Have you ever worked with other students"}, {"date": "10 May 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Southwestern College (California) (Chula Vista, CA)", "Interview Descriptions": "It's all about who you know", "Interview Questions": "None"}, {"date": "28 Oct 2014", "title": "Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Southwestern College (California) (Chula Vista, CA) in Dec 2012", "Interview Descriptions": "I applied in person through a friend who worked there.  Within a couple weeks, i was called into an interview. The interview process was informal.  I was hired on the spot.  It helps to know people who already worked there.", "Interview Questions": "N/A"}, {"date": "18 Jan 2014", "title": "Mathematics Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Southwestern College (California) (Chula Vista, CA) in Jul 2012", "Interview Descriptions": "Went to apply in person and the supervisor hired me on that day. Interview was informal.", "Interview Questions": "What is your most unpleasant tutoring experience?"}], [{"date": "17 Nov 2015", "title": "Project Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southwestern College (California) (Chula Vista, CA) in Jan 2011", "Interview Descriptions": "There was a timed writing exercise and a panel interview. The timed exercise was done in private after brief instruction. The group interview was cordial and very useful for understanding exactly which duties the job would require.", "Interview Questions": "Are you comfortable answering phones with heavy call volume?"}, {"date": "15 Apr 2014", "title": "Food Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Southwestern College (California) (Chula Vista, CA) in Aug 2010", "Interview Descriptions": "Very simple, go to human resources, go to a 5 minute interview involving questions about availability. Get hired.", "Interview Questions": "How are you?"}]]