[[{"date": "25 Apr 2023", "title": "Academic and Career Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Willamette University (Salem, OR)", "Interview Descriptions": "Phone Screen. Day-long on site, in person - which included a presentation (that one faculty member was nodding off in) and several group interviews with faculty, students and staff. I sent a follow up thank you note - the hiring committee chair requested to initiate my reference checks. Simultaneously, a faculty member did an accidental \"reply all\" from my thank you follow up email, complaining about how I didn't properly address him as \"Dr. So-and-so.\" I literally teach professional etiquette, and utilized more general terminology to address the group, because the school website wasn't updated with everyone's proper name, education and title, so I didn't want to offend anyone. I addressed them all professionally with the partial information I had. I withdrew my application - no way I'd want to work with faculty like that! I couldn't work with someone who is so unreasonably offended, and for their inability to professionally communicate via email, and for the way they spoke about all candidates in their email. Completely unprofessional and unbecoming for someone with a terminal degree.", "Interview Questions": "Why do you want to work here? What would you do to build stronger engagement for career development?"}, {"date": "17 Oct 2022", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Willamette University", "Interview Descriptions": "3 different interviews, one short one on the phone with a panel, one 1-hour in person with the same panel, a second full day in person with others in the division.", "Interview Questions": "What was a problem you had that you used creative methods to solve"}, {"date": "20 Sept 2020", "title": "Development Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Willamette University", "Interview Descriptions": "One interview in person in front of direct supervisor and students. Pretty easy, make eye contact and be polite to the whole group. I was fairly neutral and they met my job offer counter.", "Interview Questions": "Why do you want this job?"}, {"date": "15 Feb 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Willamette University (Salem, OR) in Nov 2018", "Interview Descriptions": "Via email, I was invited to interview with  the search committee 3 months after the job close date. It was stated in the email, in very passive language, that the job was part time, even though at time of application it was stated as a full time position. I was greatly intetested in the position and moved forward with the interview process.  My overall interview experience was positive with the exception that the search committee was disorganized when it came to discussing scheduling and pay for the position. Two weeks after my interview, I received an email from a search committee member asking for references. Even though references had been provided as a  required part of the application process, I provided the information again.  My references were not contacted for approximately a month after the request. FINALLY, a month after contacting my references I was sent a canned email notification from \"HR\" via the university's Workday system indicating the position had been filled and thanking me for my time.", "Interview Questions": "What are your strengths"}, {"date": "13 Oct 2018", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Willamette University (Houston, TX) in Aug 2018", "Interview Descriptions": "Initial contact by email, there were two telephone interviews and an in-person interview. The in-person interview was pretty intense but fair. Overall I feel the process was pretty standard. I am currently awaiting a response . I was told this position would need to be filled by the Spring of 2019.", "Interview Questions": "Describe yourself. \nDescribe your qualifications etc."}, {"date": "26 Dec 2016", "title": "MBA Recruitee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Willamette University", "Interview Descriptions": "First did a over the phone informational interview about a week after applying to provide me as the candidate with more information about the position. Friendly, genuine. Great questions, very open and welcoming. They were also wonderfully accommodating when setting up interview times,m.", "Interview Questions": "Asked about relevant experience, and about a time you didn't meet something that was expected of you."}, {"date": "20 Apr 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Willamette University", "Interview Descriptions": "Super laid back. Meet at the library and are greeted by the two boss. They take you up to the breakroom and ask the normal questions. The interview was more conversational than anything.", "Interview Questions": "What role do you think that the library has for students and public patrons."}, {"date": "28 Mar 2016", "title": "Maintenance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Willamette University", "Interview Descriptions": "phone and skype 2 interviews. The first was via phone and 2nd via skype. It went well. Very ease process. They helped with relocation too. Standard University interview. Casual.", "Interview Questions": "N/A"}, {"date": "3 Mar 2016", "title": "Community Mentor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Willamette University (Salem, OR) in Jan 2016", "Interview Descriptions": "The process went fairly well, due to the large amount of applicants the time between applying and interviews then receiving an offer was rather extensive. Still the hiring board was often open to question and were real towards the situation and possibility of being hired.", "Interview Questions": "When was a time when you put your own opinion aside to help someone solve their problem?"}, {"date": "1 Feb 2016", "title": "Director of Marketing, MBA School Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Willamette University (Greensboro, NC) in Jan 2016", "Interview Descriptions": "Friendly, timely, the standard cover/CV first, followed by a screening phone call and a search committee interview, remotely. Unfortunately, that group interview, planned as a Google Hangout turned into a phone call, because their equipment tanked. That was unfortunate, because a key interaction component was removed. Post-interview, they got back to me within a week, as promised. The response was, unfortunately, a 'no', but with no reasons given. I wrote back asking how I missed their marks, but as is usual in these kinds of things, I've heard nothing since and would be surprised if I do. That's the single thing I wish had happened. Forget the 20+ hours of prep; to get no feedback at all makes the time wasted. Lawyers, notwithstanding, I really appreciate feedback, good or bad, and the absence of it helps no one.", "Interview Questions": "Tell me about the metrics you'd use to move us forward."}], [{"date": "14 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Willamette University", "Interview Descriptions": "I spoke with the professor at the end of a class, and she told me she was roking on a project that required some legal research. I told her that I was a JD/MBA Candidate who had two previous years of legal research and also was a tutor of legal research.", "Interview Questions": "Do you have any legal research experience?\r\nAre you a JD/MBA?"}, {"date": "15 Jun 2015", "title": "Assistant Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 6 weeks. I interviewed at Willamette University (Salem, OR)", "Interview Descriptions": "Standard resume and interviews. Two full days with a variety of stakeholders.  It was pretty standard and comparable to others I had experienced.  There was good two way communication and I had the chance to ask all of my questions.", "Interview Questions": "Can you sell this place?  What are our strengths and weaknesses?"}, {"date": "9 Jan 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Willamette University (Salem, OR) in May 2015", "Interview Descriptions": "I wrote a summary of interest then I met with the professor and he asked me questions. Then I was emailed later that I got the job. He was a nice professor. I would do it again.", "Interview Questions": "What was your greatest learning experience?"}, {"date": "6 Feb 2014", "title": "GA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Willamette University in Aug 2013", "Interview Descriptions": "Asked for resume and an essay about my interests and why I want to work for this particular position. Shortlisted my resume and called me for interview", "Interview Questions": "very general questions about prior work ex."}, {"date": "8 Sept 2015", "title": "Admission Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Willamette University (Salem, OR) in Apr 2013", "Interview Descriptions": "Sent in a cover letter and an interview, had single in-person interview. Mostly asked simple situational questions. The interview was mostly just talking about why I wanted a job with admission and why I was enthusiastic about the university. I had to explain what I didn't like about the university.", "Interview Questions": "What would you do if a prospective student asked to go to a party while you hosted them overnight?"}, {"date": "12 Aug 2014", "title": "Administrative Assistant III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Willamette University (Salem, OR) in Sept 2012", "Interview Descriptions": "Phone Interview followed by a interactive in person interview. The in person interview involved not only the hiring committee but a meeting with vice president, campus tour and breakfast with potential supervisor. It was about a total of four hours interview process.", "Interview Questions": "Excel skills test had not been tested by hiring committee before hand so there was alot of difficulty and unknown when I asked questions for clarification."}]]