[[{"date": "19 May 2022", "title": "Senior Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Amigos de las Américas", "Interview Descriptions": "After submitting your online application, you are asked to take part in 1-2 virtual/phone interviews. Your English and Spanish-speaking skills will be assessed, along with your other qualifications. Follow-up was via email.", "Interview Questions": "How would you handle a conflict or other misunderstanding with a potential host family and/or community?"}, {"date": "23 Jun 2021", "title": "Project Supervisor, Latin America Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Amigos de las Américas", "Interview Descriptions": "No interview for the project supervisor position, only submitted application. I think for other positions there is a formal interview such as for project director or senior project supervisor. The application process was pretty straight forward.", "Interview Questions": "there were none available for this position"}, {"date": "19 Nov 2020", "title": "Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amigos de las Américas", "Interview Descriptions": "Interview was pretty laid back but they asked a lot of questions, was bilingual in english and spanish. Pretty standard apart from that, although I was suprised by the amount of questions that the interviewer asked me. All pretty short questions.", "Interview Questions": "What do you do to separate work from personal life and manage stress?"}, {"date": "7 Oct 2018", "title": "Project Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Amigos de las Américas", "Interview Descriptions": "AMIGOS will email you different time slots to sign up for in order to do a Skype interview. The interview will not have video, just the audio. There will be 2 people from AMIGOS on the call, normally at least one of the Regional Directors and one of the Program Managers from HQ. The questions are mostly situational - \"what would you do if...\" The interview is pretty straightforward - they have a list of questions that they ask to all candidates and just go through that. Make sure you research AMIGOS online and get a good sense for the organization's values in order to help you best answer the situational questions. There is 1-2 questions in Spanish, also typically a \"how would you respond if...\"", "Interview Questions": "Where would you like to be placed and why?"}, {"date": "8 Nov 2021", "title": "Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amigos de las Américas (Boston, MA) in Oct 2018", "Interview Descriptions": "Interview over the phone, with one member of the team. She asked several questions about previous leadership positions I had. Then she asked a set of scenarios that might face as a project supervisor.", "Interview Questions": "Tell me about a time you were a leader> "}, {"date": "10 Jul 2017", "title": "Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amigos de las Américas", "Interview Descriptions": "My interview was over phone. There was two parts, the first part was in english and the second in spanish. Because project supervisors are in country interacting  with partner agencies and community members it is required to have a basic understanding of the spanish language.", "Interview Questions": "Perhaps the most difficult question I remember them asking is what hardships if any I had experienced in my life. "}, {"date": "9 Oct 2015", "title": "On-Call Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Amigos de las Américas in Apr 2015", "Interview Descriptions": "This was a challenging interview that involved role playing tough situations with different parents and on-the ground staff, as well as, a written portion to respond to these situations via email.", "Interview Questions": "How would you respond to Mr. Smith? Mr. Smith daughter was sent home because she broke a standards violation."}, {"date": "26 Jan 2018", "title": "Senior Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Amigos de las Américas (Houston, TX) in Feb 2015", "Interview Descriptions": "The interview process involved a brief conversation in Spanish, as well as a few screening questions assessing my fit to the SPS position based on prior experience within and outside the organization.", "Interview Questions": "What makes you a good fit for AMIGOS?"}, {"date": "12 Aug 2017", "title": "Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Amigos de las Américas in May 2014", "Interview Descriptions": "Filled out an application online answering questions about my interest and experience. Received an email to set up a phone interview, which consisted of similar questions as well as a few practice Spanish questions/scenarios.", "Interview Questions": "Why are the standards of conduct important?"}, {"date": "25 Aug 2015", "title": "Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Amigos de las Américas (Houston, TX) in Nov 2013", "Interview Descriptions": "Submitted an online application and had a Skype interview. The application is on their website. The Skype interview was several weeks after I submitted my application, and I got to pick a time over two weeks or so. The interviewer was friendly and although it was over Skype we did not use video. Mostly in English, with maybe 2 Spanish questions.", "Interview Questions": "What kind of people do you work best with? Why do you want to work for AMIGOS? There were also some questions in Spanish to gauge your ability."}], [{"date": "4 Dec 2015", "title": "Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Amigos de las Américas (Houston, TX) in Jan 2011", "Interview Descriptions": "I submitted an application, and then did a phone interview to test my Spanish skills. The application included references, a letter of recommendation, and a longer essay detailing why I wanted to be a Project Supervisor.", "Interview Questions": "Why do you want to be a project supervisor?"}]]