[[{"date": "16 Jul 2021", "title": "Visitation Exchange and Supervision Monitor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Family Place", "Interview Descriptions": "So I ALMOST got a job here but I also had a bizarre and rather disappointing experience in that I thought the interview process went smoothly for all three rounds and I thought I had a positive experience for all three. Both HR and the director got back to me on time and explained everything to me clearly; HOWEVER, as soon as I mentioned to them both that I needed time off for my own wedding next year and that date was non-negotiable, I did not hear back. I ended up sending them my availability form (per their request) and followed up a second time with no response, only to get an automated email from them right after that they were moving on to other applicants. A simple email explanation back would have been strongly preferred if they could be flexible (or not) for an important event that I am letting them know at least one year out in advance. Did not even get a congratulations either. Sadly, not the agency or company I would've felt comfortable being at long-term, even if it was for a PRN job.", "Interview Questions": "Be prepared in that they asked many situational/behavioral-based questions. Also asked a lot on topics (that I wanted to learn more about and I am passionate about) pertaining to domestic violence, parenting, crisis intervention, etc. as well as general questions about your professional background, goals, etc. "}, {"date": "1 Apr 2021", "title": "HR-Resource Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Family Place in Jan 2020", "Interview Descriptions": "interviewer okay but too strict because asking me about the LGTQ issues as the company to make sure involves or not interviewer okay but too strict because asking me about the LGTQ issues as the company to make sure involves or not", "Interview Questions": "interviewer okay but too strict"}, {"date": "9 Apr 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Family Place", "Interview Descriptions": "Pretty standard. After you submit the application, there's a scheduled 30 minute interview. After that, you complete an online assessment. Next, you are scheduled for an in person interview with your direct supervisor. And finally, with the main director.", "Interview Questions": "What do you know about The Family Place?"}, {"date": "24 Jan 2016", "title": "BIPP Facilitator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Family Place (Dallas, TX) in Mar 2015", "Interview Descriptions": "It felt like a friendly chat with the director. It lasted slightly over an hour. He wanted to know if I had read over the curriculum that they use, which is the Duluth Model. Other questions that I recall, are that he asked, What type of group facilitator I was? And he asked, Are you more psychoeducational or process focused?", "Interview Questions": "What type of group facilitator are you?"}, {"date": "4 Sept 2017", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Family Place (Dallas, TX) in May 2013", "Interview Descriptions": "Not long at all", "Interview Questions": "What are my future goals "}], []]