[[{"date": "13 Jul 2023", "title": "Specialist Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice (Pontypool, Wales)", "Interview Descriptions": "The interview process is very clear, fair and logical. The questions posed are reasonable. Preparation can be made by making reference the job description and the person specification. Showing an understanding the values and the principles of Citizens Advice and giving examples of how these apply in practice is an important part of the interview; as is giving examples of advice as can be applied to particular individuals.", "Interview Questions": "They asked about the values of Citizens Advice and why these are important."}, {"date": "9 Jul 2023", "title": "Witness Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Birmingham, England)", "Interview Descriptions": "Submitted application form with multiple questions, relaxed interview with lovely panel. Within 2 weeks I was offered the job, DBS and reference checks did not take long. Easy process, loved it", "Interview Questions": "How did you promote diversity"}, {"date": "3 Jul 2023", "title": "Volunteer Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Kettering, England)", "Interview Descriptions": "Semi informal, friendly - asked questions but also a discussion about their work and culture. Be prepared, know the aims of the organisation, the work that they do etc. Lasted about 45 mins over zoom.", "Interview Questions": "What are the issues facing your local community? What skills do you bring to this role? What makes good team work? If someone had a different view in your team how would you deal with it? If a client comes to us, what do they expect? (Service expectation). If a client is in an emotional state what would you do?"}, {"date": "3 Jun 2023", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "good interview process, asked questions about motivations for the topic as well as experience in research processes. Process: contacted, sent a CV and cover letter, invited for interview about the research project", "Interview Questions": "Q) Experience in conducting a research project and working with confidential data"}, {"date": "18 May 2023", "title": "Senior Service Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "Application via portal. Interview came with request for portfolio as a work task. Single interview via zoom. Questions given verbally and written, but not ahead of time. Panel of three people.", "Interview Questions": "Give an example of your experience working as part of a multidisciplinary team"}, {"date": "15 May 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Citizens Advice (Plymouth, England)", "Interview Descriptions": "Being interviewed by one person was a relaxing experience, (although there was someone was spectating their interview). It allowed me to focus on answering the questions without feeling overwhelmed. I appreciated the opportunity to have a one-on-one conversation and found it to be a positive experience overall.", "Interview Questions": "Ask you why you want to volunteer and the skills you can bring to the company. In addition to the role you would like to do, why and what skills you can bring into it."}, {"date": "4 May 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice (Ipswich, England)", "Interview Descriptions": "It was a video interview with two senior staff. They were very friendly and engaging. They asked good questions and listened really well to responses I gave. Very enjoyable experience.", "Interview Questions": "All very standard but engaging"}, {"date": "10 May 2023", "title": "Universal Credit Help to Claim Adviser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Salford, North West England, England) in May 2023", "Interview Descriptions": "Join zoom to be told to take a written test then told to log off and log back on for main interview. The written test was questions on universal credit 4 questions different situations. such as below. .Client is homeless, has no phone, no internet access, no bank account, is vulnerable. How will you help them make a UC claim? . What advice would you give to a caller who has pre settled status and wants to claim UC? The interview it self was all based around all UC, They didn't seem bothered about getting to know me as a person or my experience in my current job. If you don't know EVERYTHING about benefits then I wouldn't bother. It seems they are not interested in giving you basic training for benefits and expect you just to know this.", "Interview Questions": "Pros and cons of telephone and web chat? How would you help someone set up claim for universal credit what they need if you were supporting over the phone. Asked about targets and amount claimants you have to sign up. Asked about new style jobseekers benefits of this over UC"}, {"date": "24 Apr 2023", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice (Royal Tunbridge Wells, England)", "Interview Descriptions": "Completed an application for after submitting my cv then had zoom call with the boss. Friendly and standard questions. Interview was during the pandemic so may have been an in person if it wasn’t for restrictions.", "Interview Questions": "Why do you want this role?"}, {"date": "31 Mar 2023", "title": "Generalist Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Bristol, England)", "Interview Descriptions": "Really lovely people, asking lots of positive questions allowing me to fully sell myself. Things such as how do you cope under pressure, suggest a time you’ve had to deal with a difficult person whilst still getting them to understand the issues etc", "Interview Questions": "Explain a time you’ve had to Deal with a difficult client and still get them to understand the information you have regarding their circumstances"}], [{"date": "7 Mar 2023", "title": "Legal Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Interview by two persons with some questions about the organisation and role, skills that apply to the role and examples of how I have previously demonstrated those skills This was following cover letter & CV which was the initial stage", "Interview Questions": "Why us and this role?"}, {"date": "5 Jan 2023", "title": "Volunteer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "very easy questions and friendly process, relaxed environment and just wanted to get to know me. kind interviewers and was given an offer to start volunteering on the day. would recommend to anyone", "Interview Questions": "for past experience advising or volunteering"}, {"date": "26 Dec 2022", "title": "Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "The questions were not very complex. Mainly focused on the information pack they provide you with. People were nice and friendly to talk to. The interview was done online by 2 team members.", "Interview Questions": "How do you secure confidentiality"}, {"date": "6 Dec 2022", "title": "HTC Quality and Compliance Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Citizens Advice (Chelmsford, England) in Nov 2022", "Interview Descriptions": "CV and cover letter submission. \n\nInterview  - virtual with 2 x interviewers on panel. Both asked set of questions. Competency 'star' method framework questions, with additional questions asked, based upon the responses they received.", "Interview Questions": "Can you advise of a situation which was difficult for you and or the customer and explain why."}, {"date": "28 Dec 2022", "title": "Head of Cyber Security Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice (Liverpool, England) in Oct 2022", "Interview Descriptions": "Very conflicted here as the recruitment contact was fantastic with an excellent process; great communications and expectation setting. Even admitted they made a mistake and allowed me extra time to answer the previously missing questions from the application; and allowed extra time for the application. I was encouraged by the anonymised cover letter and CV requirement so that prejudice was not entered into. However, the interview as not so great. The panel were inexperienced delivering interviews and my impression was that their ideal candidate is someone that fitted one of the panel's  agenda. despite the clear lack of Cyber Security experience demonstrated.  One of the panel had no Cyber Security qualifications or certifications so I believe a Cyber professional should have been contracted for the interview process. I firmly believe that when recuriting for these roles, know your strengths and if you are not strong in this area, involve someone who is.", "Interview Questions": "In a few sentences, please provide evidence that you have experience influencing behaviours across teams and colleagues beyond your direct authority"}, {"date": "2 Nov 2022", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (Caerphilly, Wales) in Oct 2022", "Interview Descriptions": "Really easy, interviewers were incredibly friendly and put you at ease. Only lasted just over half an hour and they spoke for half of it. Allow you to ask questions at the end, I asked what they enjoy about working here which they seemed to enjoy answering.", "Interview Questions": "Tell me about yourself (they say that they don’t want you to discuss work experience here at all, just hobbies etc but may be different depending where you interview) Not sure on exact question but on the topic of working under pressure/being stressed and how you dealt with it Why you want to work here - be sure to mention the aims/principles of CA and how that relates to you/any of your previous work They always want examples so be sure to expand on everything you say"}, {"date": "21 Sept 2022", "title": "Volunteer Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice in Sept 2022", "Interview Descriptions": "Filled an online application for the role available on the website. Then went through an assessment testing basic IT (Microsoft Office), math (percentages, divisions, tables and graphs) and english comprehension skills. Finally was interviewed online for the role. It lasted for about 30-40 minutes and the interviewer was very friendly, observant and receptive to my needs. Would recommend fully understanding how CAB operates, the work they do, their clients, their practice areas and their aims and principles before the interview.", "Interview Questions": "Why are you interested in this role? What experience do you have that can help you in this role? What do you hope to gain from this role? Why do you think impartiality, listening skills, confidentiality are important in this role?"}, {"date": "30 Mar 2023", "title": "Victim Witness Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Sept 2022", "Interview Descriptions": "It was pretty easy. Questions about why I want to volunteer and basic questions about what I think are the main qualities required to support intimated witnesses. Situations where I have supported someone I know who has been intimitated or vulnerable.", "Interview Questions": "Qualities required to become a witness service volunteer. How would I tackle someone who is vulnerable and intimidated?"}, {"date": "30 Aug 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Interviewed by two people. Very friendly and put me at my ease. Was asked a set number of questions relating to the person specification of the job. I was asked to give specific examples to demonstrate my ability. This was followed by a computer test.", "Interview Questions": "Give an example of having to deal with a difficult client "}, {"date": "24 Aug 2022", "title": "Workplace Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "I had to complete a task which required me to create a presentation. The presentation was option but I felt it was helpful for me. Then followed up with an interview panel with three members of staff online", "Interview Questions": "How would I go about embedding a workplace strategy? "}], [{"date": "11 Aug 2022", "title": "Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice", "Interview Descriptions": "First written exercise to test research skills using Citizens Advice website. If successful progress to online interview over zoom. Two interviewers present. Series of questions asked and then exercise simulating phone call with Citizens Advice client.", "Interview Questions": "Motivational questions - Why Citizens Advice \r\nWhether previous experience volunteering\r\nWhat relevant skills I had\r\nWhether experience of dealing with people over the phone \r\nSome general awareness questions e.g. how might people end up in debt / recent issues in news that might be reflected in work of Citizens Advice"}, {"date": "18 May 2022", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Process with quick from applying to offer.  Interview panel were informative. Interview approximately 45 minutes and quick outcome given. Made to feel relaxed and interview was fairly informal. Questions were as expected.", "Interview Questions": "What do you know about the company "}, {"date": "9 May 2022", "title": "Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "The interview process was very pleasant. The lady who interviewed me was warm and made me feel at ease. It was quite informal which reflected the working environment. The experience was overall positive", "Interview Questions": "Why do you want to work here?"}, {"date": "13 Jun 2022", "title": "General Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1+ week. I interviewed at Citizens Advice (Stafford, England) in May 2022", "Interview Descriptions": "I found the whole process to be very positive. I received great feedback and advice on perhaps applying for roles that may be more suited to me. Would interview with again if given the opportunity.", "Interview Questions": "Various questions related to role."}, {"date": "4 Apr 2022", "title": "Generalist Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "I found it quite difficult. I was unprepared and generally I panic under interview situations and that happened. however the panel were quite understanding and mostly nice. Wouldn't like to interview again.", "Interview Questions": "Why are you suitable for the job?"}, {"date": "7 Mar 2022", "title": "Trainee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "easy and informal. Asked why I want to train at CitA and how many days I am willing to contribute to the work. Nice place to volunteer and help people.", "Interview Questions": "Why Do you want to work at CitA?"}, {"date": "15 Feb 2022", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Firstly you send in your cv, then you go through a phone interview, followed by a face to face interview with your potential supervisor and finally you're contacted regarding the result.", "Interview Questions": "What skills can you bring to this role?"}, {"date": "15 Jan 2022", "title": "Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Citizens Advice (London, England) in Jan 2022", "Interview Descriptions": "Interview entailed a few questions asked by a panel of staff that work at the local Citizens Advice. The questions were based on my experience and knowledge of what they do", "Interview Questions": "What does the role of advisor do"}, {"date": "1 Oct 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Jan 2022", "Interview Descriptions": "They asked about what I could bring to the organisation.\r\n\r\nAbout my commitment to volunteering and about previous experience. I'd worked in Oldham for CAB some years previously so they asked about that experience.\r\n\r\nCan you bleed a radiator when your a bit tipsy after a couple of sherries\r\n\r\nJust about you basically and your ability to work in a team, your ability to be non judgmental and impartial", "Interview Questions": "N/A"}, {"date": "13 Dec 2021", "title": "Adviceline Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Straight forward simple scenario based questions, ask a lot about what you would do in a given situation, and also asked about why I want this role and at this company.", "Interview Questions": "why do you want to work for us "}], [{"date": "6 Dec 2021", "title": "Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Very hard. Know your social factors. wanted environmental factors, social factors and lots of other questions on the community and how this may affect people. Overall lovely people and very pleasant in interview.", "Interview Questions": "what is the social enterprise?"}, {"date": "23 Nov 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "Asked questions about the role of Citizen's advice, the advice they offer, and the campaigns they run. They also asked questions about what skills are needed for CA. \n\nIt would help to have a good understanding of what they alongside the importance of things such as confidentiality, an understanding of CA's values, e.g equality and diversity, and some examples of your own skillsets.", "Interview Questions": "They asked me some competency-based questions"}, {"date": "29 Jan 2022", "title": "Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Nov 2021", "Interview Descriptions": "Two people. Trainer, HR. \r\nQuestions: \r\n\"What do we do?\"\r\n\"Why do you want to work for us\"\r\n\"Explain how your skills apply to the role\"\r\nAnd then a discussion on availability and confidentiality.", "Interview Questions": "\"Explain how your skills apply to the role\""}, {"date": "30 Sept 2021", "title": "Volunteer Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "Two people on the panel, asking about your experience and why do you want to volunteer for CAB.  Very friendly and open. Open questions and very relaxing straight forward interview", "Interview Questions": "Why do you want to work for Citizen Advice ?"}, {"date": "8 Sept 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "The interviewer was very kind and put me at ease. The interview was more of an informal chat setting out the priorities of the charity and the role's responsibilities and making sure they were in line.", "Interview Questions": "Why do you want to work at Citizens' Advice?"}, {"date": "18 Jun 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Sept 2021", "Interview Descriptions": "A long interview for a volunteer work. Even longer than a interview for a payed work which is crazy. I was not prepare for this, I thought it was like other volunteer work that you have a friendly conversation, but it was a little bit tense.", "Interview Questions": "Why diversity is important; if you previous experience with helping people; why you choose to volunteer with them; if you will commit for a year. "}, {"date": "18 Feb 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice in Aug 2021", "Interview Descriptions": "I received an email and was invited to a Teams interview. I was asked about the core elements of the role: IT Skills Communication skills Knowledge and interest in local policies The interview did not include any practical assessments or written exams as part of the process.", "Interview Questions": "The role relies on IT skills and the independent use of software and databases. - What tools have you used? - Please, give an example of when you have applied your technical knowledge."}, {"date": "27 Jun 2021", "title": "Initial Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Easy interview process, made me feel very comfortable. Nice environment filled with genuinely nice people. Asked basic competency questions and why I wanted to work there/why I wanted to help people", "Interview Questions": "Describe a time you worked as a team"}, {"date": "24 Jun 2021", "title": "Wellbeing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "A set of competency based questions that felt fair over a video call. The 2 interviewers didn’t build much rapport and remained silent, made me feel unsure about the culture. Overall, they were transparent and I felt they were respectful.", "Interview Questions": "Tell me about yourself "}, {"date": "10 Jun 2021", "title": "Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Written Assessment sent prior with twenty minutes to answer and then interview on zoom with two members of staff within the company present asking the questions to you. The end", "Interview Questions": "What is equality and diversity"}], [{"date": "10 Sept 2021", "title": "Volunteer Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (Cardiff, Wales) in Jun 2021", "Interview Descriptions": "easy apply online and submit an application form \n\nvery informal and relaxed atmosphere\none hour process through the medium of zoom \ntwo interviewees who took it in turn to ask \nhalf general questions\nsecond half situational based questions", "Interview Questions": "what work experience do you have "}, {"date": "21 Aug 2021", "title": "Policy Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Citizens Advice in Jun 2021", "Interview Descriptions": "Interviewed for the Policy Research position which was being recruited for the Consumer Team, with a specific remit in private renting sector policy.\n\nThe recruitment advertisement didn't mention this, and was quite generic. Despite this, the written task asked us to develop a policy brief on improving the rights of renters.\n\nI feel the interview would have been much fairer if this specialist knowledge was mentioned ahead of time, as the interview process likely favoured internal candidates who may have already been aware of which teams were recruiting. \n\nI was very impressed with the lead recruiter in this interview, who was very friendly and personable. Unfortunately, one of the other panel members looked very disinterested and seemed distracted by something else in the room (this was an online interview). This made it quite difficult to perform, and at one stage I nearly terminated the interview early because of this.", "Interview Questions": "(Related to your task) Please talk us through how you would involve people with lived experience in this project"}, {"date": "8 Jun 2021", "title": "Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Citizens Advice (Bracknell, England) in May 2021", "Interview Descriptions": "50 minute basic test with questions in relation to universal credit and budgeting. Then a 1 hour microsoft teams interview with 2 colleagues. Questions relating to customer service and universal credit.", "Interview Questions": "What impression would you like us to have of you after this interview?"}, {"date": "24 Apr 2021", "title": "Help to Claim Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Citizens Advice in Apr 2021", "Interview Descriptions": "Applied on Monday and was offered an interview by the Friday for the following Friday. Did my research, spoke to many other people who had worked or volunteered for Citizen’s Advice and was told about their great online training scheme and what a great place it was to work. Was really excited to interview,  but I wouldn’t have exactly called it one.\n\nI arrived and was in and out within about 15 minutes or so. There was one single interviewer, who mixed up my degree with one on another person’s application and that was the first red flag. I didn’t have much of a chance to speak and felt the whole interview was just the interviewer talking at me - very informal. \n\nThe interviewer went over the job title, contract and benefits and spoke about the role (rather negatively, without much enthusiasm). They also told me how long they would be doing interviews for that day as if it was a hassle, not the most professional. It was almost as if the interviewer was trying to deter me from the job with the way it was being discussed and I knew from that point there would not be an employment offer. \n\nAt one point I was asked to tell the interviewer about myself, the only chance I really had to speak. They explained that they’re looking for someone who pretty much knows exactly how to do the job already, as they don’t have the resources or staff to train anyone. This left me rather confused as:\n\na) I had been informed by multiple people of their extensive online training and,\n\nb) in that case, why would they hold external interviews as opposed to an internal recruitment process?\n\nThe interviewer confirmed with me again that I had not volunteered previously, and without saying the words made it quite clear that they were looking for someone who had. Luckily, I was contacted only a few hours after the interview to be told I was unsuccessful due to my lack of experience and again how they needed someone who could do the job with no training.\n\nI believe that if they required someone who had volunteered in the past, this should have been specified on the job advert. Just by comparing my application forms with the other candidates, it was evident I hadn’t volunteered or held this exact position before - so I really have no idea why I was invited to interview. \n\nI was really disappointed with the interview process and expected so much better. I felt that my time had been wasted, as I wasn’t going to be hired anyway due to not meeting the criteria that the interviewer had and knew I didn’t meet after reading my application. I do believe that there was perhaps an interviewing quota that had to be met, and best case I was known not to be suitable beforehand, or worst case, someone was already chosen for the role and this was simply going through the motions.\n\nThe whole experience was very disheartening and draining. I would like to remind recruiters and interviewers alike, that applicants are real people with real lives and commitments. Should someone not meet (undisclosed) criteria from reading their application, please do not waste their time and energy interviewing them if there is absolutely no chance they were in the running for the role anyway.\n\nI would urge future applicants/interviewees alike to be prepared for this scenario. This was just my experience of one bureau, and may not well be the case for anyone else. Nonetheless, I am very disappointed by the whole situation and would be very hesitant to apply for a job within this organisation again.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "28 Apr 2021", "title": "Internet Assesor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (Tadley, England) in Apr 2021", "Interview Descriptions": "application, assessment centre and then an interview with the board of trustees. The application was easy, the assessment was fun and interactive and the interviewers were friendly and welcoming.", "Interview Questions": "what are your views on the level of discrimination in the UK"}, {"date": "4 Jan 2023", "title": "Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Apr 2021", "Interview Descriptions": "It was a friendly environment and asked about your genuine interest for volunteering. They also asked about the special process they have for Research and Campaigns - it is a continuous reporting and evidence gathering process to develop awareness of issues and the best way to help overcome them.", "Interview Questions": "Tell me what you know about our Research and development campaigns?"}, {"date": "30 Mar 2021", "title": "Trainee Debt Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice (Plymouth, England) in Mar 2021", "Interview Descriptions": "Invited for interview via email (only given two days notice). Interviewed via Zoom with two Energy Debt Managers. Emailed an assessment to do twenty minutes before the interview. Interviewers were professional and courteous. Given eight, quite standard, questions and lasted about 30 minutes.", "Interview Questions": "Name a time at work, when you have had a negative outcome, and how you dealt with it?"}, {"date": "20 Jun 2022", "title": "Senior Equity Diversity Inclusion Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice in Mar 2021", "Interview Descriptions": "Virtual interview including a task of a pre prepared presentation and a set of competency based questions. Panel included 3 people and the interview lasted about an hour. Was offered reasonable adjustments and they were very accomodating. Only one stage interview process so fairly quick and efficient.", "Interview Questions": "What about Citizen’s Advice and this role in particular attracted you to apply? What do you think you can bring to it?"}, {"date": "19 Jan 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Mar 2021", "Interview Descriptions": "Good experience and interview process, made me feel comfortable and very accommodating, would recommend applying, can take a while to get an interview/to hear back from them. They give you information about the organisation so you can prepare beforehand.", "Interview Questions": "Questions about customer service/problem solving questions"}, {"date": "16 Feb 2021", "title": "General Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "Panel of two employees, very laid back and easy going process. Just make sure you do your research and pick out examples of how you've helped your local community. The interview lasted around 45 mins.", "Interview Questions": "Why do you want this role?"}], [{"date": "16 Jan 2021", "title": "Advice Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "Application form plus video interview with a panel. They asked me about 12 questions based on the JD. They asked general questions e.g. working a team, as well as questions about social care sector.", "Interview Questions": "What skills would you need to support a diverse group"}, {"date": "6 Jan 2021", "title": "Volunteer Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice", "Interview Descriptions": "Very friendly and informal. Happy to help me when I got flustered and nervous. Also had to do a numerical test and a literacy test. Basic maths and literacy skills needed so not too difficult.", "Interview Questions": "How can you raise awareness of our organisation to minority groups? "}, {"date": "19 Jan 2021", "title": "General Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (London, England) in Jan 2021", "Interview Descriptions": "Applied in December and the interview was held this month. Brief (30 mins-ish) and fairly informal, in front of two senior members. Discussed prior experience, why I wanted to join and the charity itself.", "Interview Questions": "Q: Can you think of a time where you struggled to remain non-judgemental?"}, {"date": "14 Feb 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Harlow, England) in Jan 2021", "Interview Descriptions": "More of an informal discussion/conversation than a strict interview - felt very comfortable and the interviewer was very friendly.  Seemed like a casual way of getting to know me than an interview.", "Interview Questions": "Why do you want to volunteer with us"}, {"date": "29 Apr 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice in Dec 2020", "Interview Descriptions": "Filled in the application form and emailed it for a review  together with my CV and cover letter. Received an interview invitation within 4 to 5 days. The interview itself was about 20 mins long.", "Interview Questions": "Tell me about yourself. "}, {"date": "23 Nov 2020", "title": "Trainee Generalist Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice", "Interview Descriptions": "One interview conducted on Zoom with two panel members asking questions for about 30 minutes after completing an application form. The team were friendly and their interview style was welcoming.", "Interview Questions": "Provide a time you have shown your initiative"}, {"date": "26 Mar 2021", "title": "Design Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Citizens Advice (London, England) in Nov 2020", "Interview Descriptions": "Very structured, fair and formal. You are given a task to answer questions based on different scenarios/situations and then when you are interviewed by the panel you are graded and compared against other interviewees for your answers. \r\n\r\nI was told at this the end this is so the company can be fair in their process. Everyone answers the same questions.", "Interview Questions": "How would I ensure there is consistency in the work the team produces?"}, {"date": "25 Nov 2020", "title": "Telephone Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Citizens Advice (Sunderland, North East England, England) in Nov 2020", "Interview Descriptions": "Two pre assessment questions that took roughly an hour, and a half an hour Zoom video interview with 2 of the management team. The pre assessment questions were a new thing for me and I feel they set me up well for the interview, and the ladies interviewing me were lovely and made you feel really at ease.", "Interview Questions": "Why do you want this role "}, {"date": "12 Jul 2021", "title": "Communications Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Citizens Advice in Nov 2020", "Interview Descriptions": "Application with 5 questions surrounding your skills and experiences and how they fit with the role. After processing the application and taking a look at it they emailed about 2 weeks later with an invite to interview. This interview was set for a week after invitation. It was a 15 to 20 minute interview in front a of a panel of 3 and took a month to hear back. Because they received a lot of applicants there were 2 interviews for the role. The first was used to shortlist who would be invited for a second interview.", "Interview Questions": "Why did you apply for the role and what makes you suitable?\r\nCan you give an example of a time when you communicated and it was effective?\r\nWhen working in a team what role do you take?"}, {"date": "22 Nov 2021", "title": "Consumer Service Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Citizens Advice in Nov 2020", "Interview Descriptions": "Application form submitted,then a few days later emailed with a remote invite to interview. A very friendly interview, one team leader and area supervisor present. Job offer made the next day.", "Interview Questions": "What do you think this job involves? \nHow can you keep to our targets?\nWhy work for us?\n"}], [{"date": "18 Oct 2020", "title": "Volunteer Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "Filled in an application form online.\r\nHad an email to arrange an initial chat, during which the volunteer recruitment explained to me the selection process.\r\nI was sent some videos of an adviser in action and listened in to a live interview.\r\nNow waiting for some online assessments/tests and, if passed, a panel interview.", "Interview Questions": "Initial chat question: Why do you want to join us?"}, {"date": "30 Oct 2020", "title": "Trainee Debt Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Worksop, England) in Oct 2020", "Interview Descriptions": "Interview over google meet with 3 interviewers. Each asked 2 questions each and we’ve all very lovely and instantly made me feel at ease. I was informed of the decision to hire me very quickly.", "Interview Questions": "Why do I want this job?"}, {"date": "17 Sept 2020", "title": "Administration Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "Completed a long application form, sent it online, received an invitation for 2 part interview a week later.\r\n\r\nCommunication via email to setup the interview was very warm and welcoming, however the interview itself was awful. This is the first feedback I've ever felt I had to give as I was just that disappointed.\r\n\r\nIt was clear they didn't read the application form prior to the interview, as they asked the exact same questions during the interview that were in the application form (including the initial screening questions!)\r\n\r\nSimilarly to other reviews of the interview process for CAB, the interviewers were unresponsive and came across very cold throughout.\r\n\r\nThey spent most of their time reading from a piece of paper without looking at the camera. After each answer, they simply moved onto the next question without making a noise, saying anything or asking another question based on my initial answer, it did come across that they weren't even listening to what was being said - interviews are also supposed to be a 2 way conversation. Even more shocking considering CAB's nature of work of working with people.\r\n\r\nI'm not surprised myself and other people checked out during the interviews.", "Interview Questions": "Do you like working in a perfect team?"}, {"date": "12 Aug 2020", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "Interviewed by two people on Microsoft Team. Interview was for 30 - 45 mins. Interviewers introduced themselves, a brief discussion of the job role, how the interview will be conducted.", "Interview Questions": "How do I manage pressure?"}, {"date": "21 Sept 2020", "title": "Assessor/Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Aug 2020", "Interview Descriptions": "Took several months just to schedule an interview on short notice.  Did not get back to me after the interview until 2 weeks later! INTERESTING as one would imagine it doesn’t hurt to be courteous and remain professional.", "Interview Questions": "What are the values of CAB, how will you handle a client, why do you want to volunteer?"}, {"date": "28 Aug 2020", "title": "Volunteer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (London, England) in Aug 2020", "Interview Descriptions": "Applied online and the interview was fairly informal with two staff members, asked about reasons for volunteering and some situational judgement/scenario based questions. Lasted about 20 minutes and heard back after a few days.", "Interview Questions": "What does impartiality mean to you? "}, {"date": "11 Jul 2020", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (Swindon, Wiltshire, South West England, England) in Jul 2020", "Interview Descriptions": "First I had a written task to complete which was quite basic which involved me composing an email to a client responding to their query about their redundancy. In order to find out this information I had to look through the citizen advice website.", "Interview Questions": "Describe a time where you have been out of ones depth and how did you respond to this?"}, {"date": "18 Apr 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Citizens Advice (London, England) in Jul 2020", "Interview Descriptions": "Questions were relevant and direct but the interviewers were not welcoming at all. They did not give a good impression, nor did they demonstrate a positive environment to work in.", "Interview Questions": "What is your experience in agile project management?\r\n"}, {"date": "1 Aug 2020", "title": "Policy Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice (London, England) in Jul 2020", "Interview Descriptions": "After submitting my application I received an invite to interview in around a week. After the first interview, I received invite to the second in another week or so. I received the result a couple of weeks after that.", "Interview Questions": "What area of policy research should Citizens Advice focus on?"}, {"date": "26 Aug 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (London, England) in Jul 2020", "Interview Descriptions": "Quick and easy- simple questions \r\nThey asked me about my previous experiences and how that would relate to the position \r\nThey also asked me situational questions on what I would do for this research method etc.", "Interview Questions": "What do you know about the role"}], [{"date": "9 Aug 2020", "title": "Telephone Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Citizens Advice (Liverpool, England) in Jun 2020", "Interview Descriptions": "I had to complete a written application form which was successful and then had a virtual video interview due to the lockdown.  The interviewer was very friendly and the interview was no where near as formal as I expected.", "Interview Questions": "Tell me about a time you worked in a team?"}, {"date": "21 Jun 2020", "title": "Witness Service Team Leader Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice in May 2020", "Interview Descriptions": "Skype interview with 2 members of staff. They asked a lot of general questions about why I wanted to work there with a lot of focus on experience I had in managing teams.", "Interview Questions": "What does diversity mean to you and why is it important? "}, {"date": "28 Nov 2019", "title": "Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (London, England)", "Interview Descriptions": "I applied online. and got a response to an interview in two weeks.  I went to the office. One male and one female interviewed me. It was for about 30 minutes.  It was a serious type of interviewl.", "Interview Questions": "My skills and qualifications"}, {"date": "12 Nov 2019", "title": "Policy Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice", "Interview Descriptions": "Had a 20 minute competency interview on the phone, and an in-person interview in which I had to write a blog post in 55 minutes with information they gave me and had a 45 minute interview in which I discussed the blog and answered competency questions", "Interview Questions": "Tell us a time you had difficulties working in a team and how you resolved them"}, {"date": "27 Sept 2021", "title": "Volunteer Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Citizens Advice (Morden, London, England) in Nov 2019", "Interview Descriptions": "Two people asking me why i’m interested and what i can bring to the role.\r\n\r\nAlso had a task/role play of advising a client to the interviewers. Given a while to read the client’s issues then had to do research on the citizens advice website to find the relevant info that will be applicable to the client (they provide a laptop/computer). The case was about a client’s employment rights after either being made redundant or fired (can’t remember exactly but something along those lines unless they changed the spec since 2019).\r\n\r\nThen had to give advise to the interviewers and tell them the information you gathered.", "Interview Questions": "Why do you want to join us?"}, {"date": "8 Nov 2019", "title": "Customer Service Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Citizens Advice (Manchester, England) in Nov 2019", "Interview Descriptions": "I was asked to send an email along with my C.V to CAB to apply for the role. I did this on Friday 1st November. On Monday 4th November I was sent an email to advise of a telephone interview to be held on Wednesday 6th November. I was advised on 8th of November I was unsuccessful with no feedback onto why I was successful.", "Interview Questions": "Tell me about the customer service experience you have had in your previous roles?"}, {"date": "24 Oct 2019", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (London, England) in Oct 2019", "Interview Descriptions": "I filled out the application form, I then got a telephone call a week later asking me to come in for an interview. When I went for the interview I first had to complete a 20 minute test which involved listening to a customer call and writing down the information from the call, and then I had to go to the citizens advice website to find some more information. After the test I had the interview which consisted of 7 questions around my own working experiences in which I had to give examples, and also situational questions.", "Interview Questions": "Why citizens advice?"}, {"date": "22 Feb 2020", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Dumfries, Scotland) in Oct 2019", "Interview Descriptions": "Good. Relaxed. Informal chat about what they could offer and what I was interested in doing.  I’m more inclined to do Social Policy work than Advisor.  They were very supportive of this idea.", "Interview Questions": "Why I want to work with them?"}, {"date": "7 Nov 2019", "title": "Policy Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Citizens Advice in Oct 2019", "Interview Descriptions": "I had a 30 minute phone interview which was with 2 people, and then was invited for a face-to-face interview a few weeks later which was with 3 people. Before the face-to-face interview I had to do a 50 minute written task where they gave you some sources and you had to write something for them (like a blog post). The face-to-face interview was about 45 mins, started off with talking about the written task and then about 5/6 standard competency-based interview questions. All of the interviewers were fairly friendly and I didn't feel like they were trying to catch me out or anything. From application to final outcome it lasted about 2 months.", "Interview Questions": "Tell us about a project you managed and how you managed it."}, {"date": "27 Nov 2019", "title": "CONSUMER ADVISOR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice (Sheffield, England) in Oct 2019", "Interview Descriptions": "I applied on indeed, got an email for an invite to an interview. Short written exercise then interviewed by three people. Interview questions were fairly easy as long as you prepared for them. I waited over a week to hear back then got an email stating I wasn't successful in my application. When I asked what I could improve on etc I never received a reply.", "Interview Questions": "What relevant experience do you have that fits with this role? "}], [{"date": "22 Nov 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Oct 2019", "Interview Descriptions": "Interesting, I got to know more about hoe the organisation functions. Panel of three test for one hour before the interview which also lasted about an hour. Questions were mainly to test my skills and knowledge in the area, Mostly technical questions but some general questions about managing the team and strategy related questions.", "Interview Questions": "Competency based questions. Questions were mainly to test my skills and knowledge in the area, Mostly technical questions but some general questions about managing the team and strategy related questions."}, {"date": "30 Dec 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (London, England) in Sept 2019", "Interview Descriptions": "It was a standard interview. Two interviewers asking a variety of questions about motivations, workplace scenarios and so on. Quite a relaxed but formal interview process. I received a phone call a few days after the interview offering me the job.", "Interview Questions": "Why do you want this job"}, {"date": "22 Oct 2021", "title": "Volunteer Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Sutton, London, England) in Aug 2019", "Interview Descriptions": "Got called in for a face to face interview and was asked basic questions, they kept asking for examples of the skills I said I had. The interviewer was lovely, it lasted around 30 minutes.", "Interview Questions": "Can you give me an example of a time you showed independence? "}, {"date": "3 Jul 2019", "title": "Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England)", "Interview Descriptions": "It was really informal and simple. I had two people ask questions, they give you ample time to answer and the questions were just on behavioural and situational situations. The interview took about 30 minutes after which I was asked to do a test which involved - being able to search for and find relevant information for a hypothetical situation.", "Interview Questions": "How have you dealt with angry clients?"}, {"date": "1 Sept 2019", "title": "Senior Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (London, England) in Jul 2019", "Interview Descriptions": "Interview with panel of 3 interviewers. Had to produce a detailed  pre-interview presentation and send an advance handout of the slides. Did the presentation first and then had questions on the content of it, before specific questions related to the role.", "Interview Questions": "How do you manage your workload and keep track of projects?"}, {"date": "26 May 2019", "title": "Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Citizens Advice", "Interview Descriptions": "A written exercise where I had to describe a situation where I was able to solve a problem, followed by a fairly informal interview. Questions seemed to be there to gauge my opinions on things such as the benefits system/ equality etc.", "Interview Questions": "what is your opinion on the benefits system? "}, {"date": "3 Apr 2019", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England)", "Interview Descriptions": "Easy online application, email received asking for interview including technical assessment. Unfortunately I was met by two miserable staff members who looked like they didn’t want to be there, very negative interview as they barely spoke. Level of professionalism from these two staff very poor, overall impression of the company has decreased due to this. Technical test was completing assessments based on customer information given and working out if they would be better off claiming benefits or enrolling on schemes to make them more financially better off.", "Interview Questions": "Tell me a time when you made a change "}, {"date": "22 May 2019", "title": "Universal Credit Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (Portsmouth, Isle of Wight, South East England, England) in Apr 2019", "Interview Descriptions": "Interview was with two managers and was very laid back. I was asked a few scenario based questions and a few things about myself and my experiences. It was all very informal.", "Interview Questions": "What is your biggest weakness?"}, {"date": "30 Jul 2019", "title": "Debt Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Citizens Advice (Airdrie, Scotland) in Mar 2019", "Interview Descriptions": "The interview process was very straightforward and easy to handle. I understood the questions and all of the questions were relevant to the job. It was a good interview process", "Interview Questions": "Whats your IT Skills, Office, E-Calendar etc"}, {"date": "27 Feb 2019", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "One interview, basic questions and an assessment on a computer. Assessment mostly research and computer skills based, not hard. Interview very informal - I talked casually and explained that it was my first ever interview. Interview room also ends up being the rooms you work in so you can get idea of environment.", "Interview Questions": "Why would you like to volunteer?"}], [{"date": "7 Mar 2019", "title": "Universal Credit Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (Wolverhampton, England) in Feb 2019", "Interview Descriptions": "Completed a short task (around 30 mins) in which I was given a question (something along the lines of \"given the job description and the competencies listed, how would you envisage a typical day within this job?\"). After completing this I had a typical interview with 2 managers with typical competency and scenario style questions. The interviewers were lovely and I felt welcomed by the staff at the branch - the whole process was engaging and really gave me a positive view of Citizens Advice.", "Interview Questions": "What attracted you to Citizens Advice?"}, {"date": "4 Mar 2019", "title": "Content Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice (London, England) in Feb 2019", "Interview Descriptions": "I applied online, the advert was for 4 content designer roles of varying contract lengths. I was invited to interview by a hiring manager.\r\n\r\nOn the interview day, I was taken to a small room to do a 50 minute written task before the interview. The room was incredibly hot and noisy due to thin walls/people next door so quite difficult to concentrate. By the time I got into the interview I was pretty fed up - this task could have been done from home and saved us all time.\r\n\r\nThe interview itself was with a panel of 3. It was all generic competency questions with no opportunity for dialogue. I couldn't get much of a sense of how the team worked as my questions were met with fairly basic answers. I don't think they had read my application.\r\n\r\nThis panel were interviewing for one role in particular, they didn't seem to know about the other 3 roles from the advert (and I had no HR contact to ask).\r\n\r\nI heard nothing back until I chased them 2 weeks later, when they did at least provide feedback.\r\n\r\nGenerally an uninspiring experience and I wasn't disappointed by the rejection. It seems strange that a team responsible for user journeys hadn't considered that of the job applicant!", "Interview Questions": "All the usual bland competency questions, nothing memorable."}, {"date": "31 Dec 2020", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Citizens Advice (Norwich, England) in Feb 2019", "Interview Descriptions": "First, had to complete a written application/send in CV for the volunteering role. The next stage was to attend an interview, at the end of the interview, I had to a computer based test.", "Interview Questions": "Provided a scenario and asked how I would deal with the situation."}, {"date": "18 Mar 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Citizens Advice (London, England) in Jan 2019", "Interview Descriptions": "Consisted of a written exercise, then interview. Written exercise was quite simple, more or less about real life situations that people go through on the daily and how you as an individual would deal with them if clients needed assistance.", "Interview Questions": "If a client came up to you in person on your off day, what would you do? "}, {"date": "24 Oct 2019", "title": "Senior User Experience Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice (London, England) in Jan 2019", "Interview Descriptions": "Task to present approach for a piece of research. Given the task in advance and asked to send a research plan in advance. 10 minute presentation of the research plan on the day followed by 45 minutes interview -  7 or 8 competency based questions.", "Interview Questions": "Why are you interested in the role?"}, {"date": "18 Dec 2018", "title": "Senior Policy Researcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (London, England) in Dec 2018", "Interview Descriptions": "The recruitment process included an online application and one interview, which involved a written test, a short presentation and a competency-based interview. The panel was friendly, but despite the fact that advert announced no subject-matter expertise, there were some knowledge questions.", "Interview Questions": "Written test: Develop a research project with a budget of £25k to develop some evidence that service providers are charging vulnerable consumers higher prices."}, {"date": "29 Nov 2018", "title": "Advice Session Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Citizens Advice", "Interview Descriptions": "With a panel of 3 interviewers who had a set series of mainly scenario questions. I was in there for well over an hour so there were lots of them and a few were long and overly complicated.  They were okay but it did seem overkill for a 15 hour a week role.", "Interview Questions": "Lots were Describe a time...covering challenging racism, being a positive team member etc Scenarios based on a volunteer who wasn't performing, a client who was extremely distress etc"}, {"date": "20 Nov 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (London, England) in Nov 2018", "Interview Descriptions": "The interview consisted of an excel task followed by an interview with 3 panel members. \r\nThe excel task involved completing excel formulas in a workbook and finding trends in a dataset. The interview had technical and non-technical competency questions.", "Interview Questions": "What are the advantages and disadvantages of working in a team?"}, {"date": "3 Apr 2022", "title": "Customer Service Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Citizens Advice (Cardiff, Wales) in Oct 2018", "Interview Descriptions": "Informal questions to assess customer service experience and ability to handle confidential information, and off premises, such as when an existing customer approaches you in a supermarket.   Very relaxed interview with two managers.", "Interview Questions": "Informal questions to assess customer service experience and ability to handle confidential information, and off premises. "}, {"date": "5 Sept 2018", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice", "Interview Descriptions": "casual interview with head of volunteer training and head of volunteers. It was done in a very informal setting.  The interview started with more generic questions like 'Why CAB?' and progressed to your knowledge about the organisation and your personal attributes.", "Interview Questions": "What do you know about CAB? \r\nDo you know about any recent campaigns? \r\nGive me an example of when you demonstrated (a skill)?\r\nWhat can you bring to the team?\r\n"}], [{"date": "14 Jan 2019", "title": "Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Citizens Advice (Birmingham, England) in Sept 2018", "Interview Descriptions": "Competency based questions with manager. I was a one to one interview. Went over CV and why I wanted work for them. How my degree course linked into the work placement.", "Interview Questions": "Why do you want to work here"}, {"date": "30 Jul 2018", "title": "Adviceline Telephone Assessor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Streatham, England)", "Interview Descriptions": "A 10 minute interview followed by a mock Adviceline Accessor test. They give you a scenario and you have to answer the questions by looking on the Citizen Advice website.", "Interview Questions": "What do you know about Benefits? "}, {"date": "9 Aug 2018", "title": "Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice in Jul 2018", "Interview Descriptions": "You have to request the application forms from the citizens advice you want to work at then if you may be invited for an informal/formal interview depending on the branch.", "Interview Questions": "Why is confidentiality important?"}, {"date": "14 Oct 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Wigan, England) in Jul 2018", "Interview Descriptions": "Easy, call then face to face the operation manager was very easy and friendly and ask me easy questions. And was supportive and was very professional when asking the questions.", "Interview Questions": "Why u want to work for company "}, {"date": "3 May 2018", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (London, England)", "Interview Descriptions": "Online application - CV and covering letter.\r\nTelephone interview\r\nFace to face interview which was very brief with enough explanation about the work of the bureau within the community. The process was not difficult at all.", "Interview Questions": "What skills and experience can you bring to this role?"}, {"date": "21 Jun 2018", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Apr 2018", "Interview Descriptions": "Very efficient and friendly. The panel was warm and welcoming and put me quickly at my ease. The questions were challenging but sensible. I could see where they were coming from and it felt like a grown up conversation. The most important point was that although I didn’t get the job I got full and helpful feedback afterwards.", "Interview Questions": "Competency based questions, but asked in a personal and engaged way"}, {"date": "23 Feb 2019", "title": "Telephone Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (Wakefield, England) in Jan 2018", "Interview Descriptions": "CV is submitted via email to the training officer at your local Bureau. If they are interested they will then ask you to come in for a one on one job.", "Interview Questions": "Are you impartial?"}, {"date": "4 Sept 2019", "title": "Software Development Engineer In Test Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Citizens Advice (London, England) in Jan 2018", "Interview Descriptions": "Was very quick and did not take much time at all. It was a a 1 stage process with a quick 30 minute phone with 2 members of staff. Staff made me feel at ease straight away. I would highly recommend working for Citizens Advice Bureau.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "6 Jan 2018", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (Swindon, Wiltshire, South West England, England) in Nov 2017", "Interview Descriptions": "It was formal with set questions. There were two women interviewing, keeping to the questions they had prepared.  I was not encouraged to discuss my experience and skills in depth, which may have been why I was not successful.", "Interview Questions": "asking about previous experience"}, {"date": "19 Oct 2017", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Caerphilly, Wales) in Oct 2017", "Interview Descriptions": "called in at the last minute for an interview, briefly interviewed then advised would hear back asap, didnt happen, very disappointed by poor communication, have called to chase up but no response", "Interview Questions": "please describe a time you worked well as part of a team"}], [{"date": "12 Nov 2017", "title": "Contact Center Agent Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Citizens Advice (Gateshead, England) in Oct 2017", "Interview Descriptions": "Application was CV and Cover Letter. Then telephone interview (unannounced) and then a test at the centre, listening to phone call and writing down information and visiting websites and writing relevant answers to questions. At the end of the interview was told I had to attend a 6 week training programme and could not have any time off throughout this time (I would be full full time.. whatever that means) and I would be expected to take a test at the end of the training. If I failed the test my contract would be terminated.", "Interview Questions": "All competency based.. think of a time where you have given excellent customer service, what skills and experience do you have for the job, how would you deal with an irate customer etc"}, {"date": "6 Jan 2018", "title": "Telephone Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice in Sept 2017", "Interview Descriptions": "It was a panel of three each asking pr-written questions following a template. Each panel member asked their questions in turn and I was invited to ask my own questions at the end. It was a short but pleasant interview. No difficult questions just standard competency based questions.", "Interview Questions": "Competency based questions where you had to give examples"}, {"date": "13 Feb 2018", "title": "Gatwayer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Jun 2017", "Interview Descriptions": "the interview last 30 mins. It is very easy and not much preparation needed. You need to prepare why you want to work this role and why you choose to work this role. What is you availablity to this role and specific job.", "Interview Questions": "why want to work as a gatewayer"}, {"date": "4 Dec 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Citizens Advice (Stirling, Scotland) in May 2017", "Interview Descriptions": "30 minute interview with Admin Head. Volunteer position - local recruitment to help with reception desk and general admin matters. Interview was friendly and non-confrontational. Service is a charity that provides assistance to people in need.", "Interview Questions": "What computer skills do you have"}, {"date": "2 Mar 2018", "title": "Advice-line Telephone Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Birmingham, England) in Apr 2017", "Interview Descriptions": "Really friendly one-on-one interview. Really informal and they want to do well so do not worry as the atmosphere is very relaxing. They ask you to complete a simple written exercise then proceed to ask you a few basic questions. Overall the interview was simple and relaxed.", "Interview Questions": "Why do you want to work for Citizens Advice?\r\nSome of the issues we help people with?"}, {"date": "24 May 2021", "title": "Email Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Citizens Advice (London, England) in Jan 2017", "Interview Descriptions": "Informal. Asked about past (similar) experience, why I would be good for the job and how I would handle a number of common situations at CAB. Friendly recruiters and was not a pressured atmosphere. Was happy with the process.", "Interview Questions": "How would I deal with difficult members of public"}, {"date": "24 Dec 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Cardiff, Wales) in Jan 2017", "Interview Descriptions": "Informal.\r\nQuestion based to establish awareness of bureau priorities (debt management etc) and issues like conflict of interest & confidentiality.\r\nPanel of two using template structure, but interview was informal, and conversational", "Interview Questions": "Your experience of confidentiality?"}, {"date": "25 Mar 2021", "title": "Advice Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Citizens Advice (London, England) in Jan 2017", "Interview Descriptions": "Not too difficult, easy going conversation. I applied and then got an email to come in for an interview. I was then told the outcome in a few days and I had received the job.", "Interview Questions": "An economic issue affecting us politically"}, {"date": "15 Mar 2017", "title": "Information Assistant/Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (Leicester, England) in Nov 2016", "Interview Descriptions": "I applied online and went in for an interview 2 weeks later. The interview process was relaxed no pressure. I felt comfortable. Nothing was rushed and the lady who did my interview was very warm and welcoming and listened to every word that i said. I wasn't rushed. The whole process was very positive. I don't know how else to describe it.", "Interview Questions": "What can you tell us about our organisation?\r\n\r\nWhat made you want to volunteer with us?\r\n\r\nHow would you deal with a challenging client?"}, {"date": "20 Oct 2016", "title": "EECAB IT Support Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (Hackney, England)", "Interview Descriptions": "Applied through an application form online which was quite detailed. Invited to an interview. Interviewed face to face and then had to complete a 7-8 question quiz which was technology related (just to get an idea of the level of techinical understanding).", "Interview Questions": "Two part question: Take us through a time when you were part of a team and something went wrong. What did you do to contribute to the solution and what was the outcome."}], [{"date": "9 Mar 2018", "title": "Adviser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (Lincoln, England) in Oct 2016", "Interview Descriptions": "Online application and went in for an interview 2 weeks later. It was a panel of two each asking per-written questions following a template.  The whole process was very positive.", "Interview Questions": "please describe a time you worked well as part of a team   "}, {"date": "15 Sept 2016", "title": "Voluntery Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Citizens Advice (Lichfield, England) in Sept 2016", "Interview Descriptions": "After both my references where received I was called for an interview. I was telephoned and I received a written appointment through the post. I arrived for my interview 15 minutes early. Then I was shown into a room with one interviewer. The interview lasted about 30 minutes and was given a tour of the building after and met some of the members of staff", "Interview Questions": "Why do you want to volunteer for us at the citizens advice?"}, {"date": "20 Mar 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Citizens Advice (Chelmsley Wood, England) in Aug 2016", "Interview Descriptions": "Can apply online sometimes by calling.Local bureau or the one you applied for will get back to you by a letter I believe.\r\n\r\nYou will receive a tour of the office and a day in what it’s like to be at the bureau .Interview is not overly complicated,just want to know more about you", "Interview Questions": "Why do you want to volunteer at the CAB?"}, {"date": "21 Sept 2016", "title": "Volunteer Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Citizens Advice (London, England) in Jul 2016", "Interview Descriptions": "Usual questions about self/company, what the company does/expectations etc. Then a test for potential position. \r\nProfessional and friendly staff willing to help make the interview process less daunting and considerate to all members of the community and is representative of that in its workforce.", "Interview Questions": "Why would I want to work for Citizens\r\nAdvice?"}, {"date": "25 Aug 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England)", "Interview Descriptions": "The interview consisted of a test, a presentation and formal interview with a panel of three people.  The interview was what I would call a proper equal opportunities interview. The panel stuck to a series of well thought out questions but it was not over formal. It was fun, fair and interesting.", "Interview Questions": "What did I think was important in creating a good work atmosphere"}, {"date": "21 Aug 2015", "title": "Finance Capability Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Citizens Advice (Liverpool, England) in Aug 2015", "Interview Descriptions": "I had formal interview for this role. The interviewer was friendly toward me and he have kept the interview process very simple and straight forward. I have interviewed in small room for this interview process.", "Interview Questions": "What do I know about Citizens Advice Bureau?"}, {"date": "6 Sept 2019", "title": "Gateway Assessor/Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Citizens Advice (London, England) in Jun 2015", "Interview Descriptions": "Written tests, interviews. Letter writing skills test, interview with training manager and session supervisor. Skills based and an interview about how you would handle cases, clients, confidentiality, difficult clients. When to refer a case to a specialist.", "Interview Questions": "How you would handle a client who was being racist."}, {"date": "7 Feb 2016", "title": "Trainee Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Citizens Advice (Pontypridd, Wales) in Jun 2015", "Interview Descriptions": "I was seen by a lady named Julie. She asked me what skills I brought to the job.\r\nShe then asked me what I would do in various scenarios. She then explained what sort of training the Bureau provided. She asked me if I had any questions, which I did not. She thanked me for my time and I left.", "Interview Questions": "What skills would you bring to the job?"}, {"date": "13 Jul 2016", "title": "Adviser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice (Stockton-on-Tees, England) in Mar 2015", "Interview Descriptions": "Clear Description for job role and application was easy to complete  Interview include practical test and then interview. The interview was a panel of three people the interview lasted 45 minutes.  30 minutes were allowed for the test.  The whole process was very clear.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "24 Jul 2016", "title": "Gateway Assesor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Citizens Advice in Mar 2015", "Interview Descriptions": "Friendly selection day with 9-10 other candidates. Conducted a few group exercises where we discussed current affairs issues among ourselves whilst being assessed. Introduced to CAB and what we would be doing within the role. Short IT assessment that basically consisted of turning the computer on and conducting a few short and simple copy and pasting exercises.", "Interview Questions": "Why do you want to join CAB in the role of Gateway Assessor?"}], [{"date": "11 Jan 2015", "title": "General Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Citizens Advice", "Interview Descriptions": "One interview with three interviewers, manager, and two board members. Mostly competency based questions, and proof of commitment to CAB core values, how I would empower clients, (those capable), to help themselves, and how I would do this.", "Interview Questions": "Don't recall either difficult or unexpected questions - did considerable preparation for the interview"}, {"date": "2 Feb 2016", "title": "Gateway Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Citizens Advice (London, England) in Jan 2015", "Interview Descriptions": "The interview was quite straightforward. They asked questions about what I'm currently doing, what my future plans are, why I want to work at the CAB. Nothing too complicated. We then went on a three week training which was also very simple. Mostly situational tests to make sure you're suitable for the job, especially as we are the first point of contact.", "Interview Questions": "Why do you want to work for the CAB?"}, {"date": "28 Aug 2015", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Citizens Advice (Glasgow, Scotland) in Mar 2013", "Interview Descriptions": "there were no interview questions as it was a voluntary position. Just asked what other experience I had in similar positions and what area that I would like to work in when I got there", "Interview Questions": "N/A"}, {"date": "11 Sept 2010", "title": "Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Citizens Advice (Peterlee, England) in Jul 2010", "Interview Descriptions": "I was give a 10 mint test to fined specific information from several sheets of paper \r\nAnd to right it down on a separate sheet.\r\n\r\nThis was followed by a 1:1 interview of possible scenarios with cleanse.", "Interview Questions": "N/A"}]]