[[{"date": "5 Feb 2023", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Roger Williams University", "Interview Descriptions": "Zoom, in person. Met with panel and toured facilities, shown around office area and lab space. Spoke with multiple lab members and students who were working in the lab area.", "Interview Questions": "What my strengths were in the position"}, {"date": "8 Jan 2023", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Roger Williams University", "Interview Descriptions": "Not bad. The counselors asked me a few questions about my experiences and what I can bring to the table and the university. The interview was over zoom and they also asked me hypothetical questions.", "Interview Questions": "What can you bring to the table"}, {"date": "13 Feb 2021", "title": "IT Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Roger Williams University", "Interview Descriptions": "Interviewers will ask for a reference from current employer before the second interview. (Will not use any call any other professtional references from your resume) Interveiwers were vague about workload and provided no salarie range. All interviews take place between 9-5. This is a hard position to pursue if you're currently employed.", "Interview Questions": "How have you gone above and beyond for a customer?"}, {"date": "16 Nov 2021", "title": "Continuing Education Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Roger Williams University (Providence, RI) in Sept 2019", "Interview Descriptions": "Over the phone. Had a phone screen first where it was a soft conversation, then did phone interview interview and it was more specific to the job functions, roles, pay, etc.", "Interview Questions": "N/A"}, {"date": "17 Jul 2019", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roger Williams University in Jun 2019", "Interview Descriptions": "Candidates were brought in for a panel after a phone screen where at least 4 different departments were present. After, candidates were asked to create a multi-channel campaign for the department with a three day turn around timeframe -- I was told by a friend in a different department that my 20+ page document was the norm, as other candidates also submitted equally long-winded \"projects\". I appreciate being given sample tasks and the opportunity to showcase how your skills and approach will mesh with a team, but this felt excessive at best and exploitative at worst. After submitting the project, I was asked for references, a process that took almost 2 weeks to complete, and was then sent an automated email from the HR department sharing that, after all of that, I had not been selected. Admittedly, this outcome feels like a bit of a relief after this quite strange process. I'm not sure the department I interviewed with is adequately prepared both in theory and practice to be successful with their goals. I hope I'm proven wrong, if only for the sake of my friends who work in different departments.  In a phrase, the whole process left a bad taste in my mouth.", "Interview Questions": "What CRM databases are you familiar with? "}, {"date": "25 Jan 2019", "title": "Admissions Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Roger Williams University", "Interview Descriptions": "The interview process was long and silent. I would go weeks without hearing, and then they'd call me and ask if I could be available the next day. I went onto campus twice, spent hours there, and then got ghosted - not even the courtesy of an email letting me know they'd chosen another candidate. Completely unprofessional.", "Interview Questions": "What is your experience with higher ed marketing, particularly for admissions?"}, {"date": "10 Sept 2022", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Roger Williams University (Providence, RI) in Mar 2018", "Interview Descriptions": "There were standard questions and it was easy to answer and see that they needed to fill a position for professional development work too. I had a kind interviewer and it was a pleasant experience", "Interview Questions": "What do you know about what we do here?"}, {"date": "30 Jul 2021", "title": "Adjunct Professor Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Roger Williams University (Bristol, RI) in Dec 2017", "Interview Descriptions": "We had a video interview, it went well. They hired me after the call via voicemail. We met up on campus and had a great introduction to the other adjunct faculty.   Every interaction has been so friendly and positive.", "Interview Questions": "What things are you doing? Does the course seem like something you could teach well."}, {"date": "30 Dec 2016", "title": "Assistant Professor English Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roger Williams University (Bristol, RI) in Nov 2016", "Interview Descriptions": "It was a skype interview with a total of  5 interviewers. The search committee chair was in charge of asking all the questions. At the end of the interview, they asked you to ask them questions about the program and school.", "Interview Questions": "Mostly basic interview questions. What can course can you teach? How does your dissertation study help your teaching? What service can you offer? What course you want to teach the most?"}, {"date": "26 Dec 2015", "title": "Coordinator for Residence Education Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Roger Williams University (Newport, RI) in Mar 2015", "Interview Descriptions": "The interview process went as expected: phone call interview, general questions about residence life, things of this nature. I actually had a great interview experience over the phone, I spoke with their director who was super intelligent, and unlike most residence life staff at the top, seemingly unweighted down by the weight of the department.\r\n\r\nDuring the on-campus interview, things were even better, but the person who initially interviewed me was out. Even so, the man who interviewed me for the majority of the day was great, well educated, and very invested in finding a good fit for the department. I was interviewing for a position for someone who had just left last minute. The interviewers both had mentioned this several times, and were super nice about it, speaking of the their exiting employee in positive ways. The exiting employee had not confirmed her appointment at her new position just yet, meaning I could have been very well interviewing for a position that was going to be kept. Still, the experience was a positive one. \r\n\r\nAt the end of the interview the assistant director did the benefits check - the benefits were not great, and the salary was sub-par for a masters level position. In retrospect, I would not have taken the position based on salary; you don't go from 30k+ without a masters to 29k- with a masters....thats just complete nonsense. Especially for the ridiculousness that comes with being in residential affairs. But the opportunities to grow as a professional, work with liberal arts students again, and also have the chance to be close to home in Mystic would have been enough to dilute the decrease in salary.\r\n\r\nStill the environment seemed very nice, and the people I spoke to were great in referencing the institution in many positive ways.\r\n\r\nThe only CON to the entire experience was the reference checking. As is with referencing, we put down only the references we want potential employers to speak to. These folks did not follow protocol, and instead called my supervisor, who was not aware of my search, and was not listed as a reference. Several weeks later, my supervisor brought up the phone call - a super uncomfortable conversation - and mentioned how RWU noticed she was not listed as a reference, but wanted to know her opinion on my leaving. LOVELY! Needless to say I was mortified, and also super disappointed that I could have gotten the job if the references I wanted, were actually called. \r\n\r\nFor future reference, please only call references listed. It is inappropriate for any employer to do that.", "Interview Questions": "How do you approach conduct related conversations? \r\nHow do you make them more educational and less punitive?"}], [{"date": "8 Mar 2016", "title": "Social Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roger Williams University (Bristol, RI) in May 2013", "Interview Descriptions": "very pleasant experience. over the phone, then in person. Very personable and I felt very comfortable. The process took about 2 weeks, and RWU was very helpful and informative. I felt very comfortable", "Interview Questions": "questions about my experience and expertise"}, {"date": "17 Jun 2016", "title": "Senior Marketing Associate / Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roger Williams University (Bristol, RI) in Aug 2012", "Interview Descriptions": "One interview over the phone, second interview in person. The phone interview consisted of basic questions. The in person interview consisted of more in depth questions and revealed details of the job.", "Interview Questions": "Describe yourself?"}]]