[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "22 Feb 2023", "job_title": "Conference Organiser in London, England", "duration": "N/A", "pros": "Understanding managers, good teams and good benefits.", "cons": "Not the best for career progression"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Restrictive Pay Band", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "18 Feb 2023", "job_title": "Dev Ops Engineer in Bristol, England", "duration": "N/A", "pros": "Wonderful people, who are great to work with.", "cons": "The HR bands are very restrictive. If you join after 1st July, they allow no pay rises for 2 years. They enforce these rules. Can you afford no payrise for 2 years? If not, be mindful of your start date. Reaching the top of the band, means you will be forced to leave."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Probably a good time to have left", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Oct 2022", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "The flexible ways of working that were introduced after the pandemic, by the last CEO and his team, are far better than most organisations and reflect a trust in staff that isn’t visible in many other aspects of the organisation.", "cons": "I left at the start of a chaotic new period in the organisation, A new CEO had arrived, reminding everyone constantly of where he has come from (we get it!) but sharing little in the way of vision. This led to the already disfunctional senior leadership team being even more indecisive and imposing ill thought through processes on an already beleagered staff."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Strange place with a strange culture of staff who seem to thoroughly dislike working there", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Aug 2022", "job_title": "Anonymous in London, England", "duration": "N/A", "pros": "Good WFH policy and a lax working atmosphere where you don't have to tax yourself too much, if that's your thing.", "cons": "I left the Institute of Physics after 6 months because it turned out to be the most ill-conceived career decision I’ve made to date. I say “ill-conceived”; perhaps more apt is \"hugely misled into performing a role I didn’t sign up to do\". In my typical spirit of trying to make the best out of a dire situation, I tried to adapt to the role and make it my own, but it turned out fruitless due to the severely disinterested management and grim, widely agreed upon sentiment of “you’re better off cutting your losses and find another job as soon as you can” shared among many of the IOP's employees. These are both elements I found hugely off-putting about the place. The general sense of people ploughing on with jobs they vocally dislike, working with managers they can’t stand, while also being very verbal about how “toxic” and out of touch the CEO team is with its staff. It’s never great to start a new job and be told in your first few weeks how rife with politics the company is. Bar maybe two people, many people I spoke to at the IOP actively disliked their job and were raring to leave. Another largely off-putting factor was how badly disorganised everything was in terms of projects and deadlines. Plans were never firm and constantly changing every week. It was impossible to take anything seriously or indeed muster the motivation to want to do any work for somewhere where management and “heads of” can’t sort their acts out. HR and IT were also terribly disorganised and slipshod in their processes, and that was before I’d even begun working at the IOP. This in itself should have rung huge alarm bells (silly me!)."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Chaotic environment and too much people turnover", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Sept 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Flexible working hours\r\nWorking from home", "cons": "Too chaotic, productivity was affected by high turnover of people."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Disappointing experience with what I thought would be a decent organisation", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jun 2022", "job_title": "Conference and Events Coordinator in London, England", "duration": "N/A", "pros": "Salary is higher than I've experienced before\r\nRemote working opportunity", "cons": "Unsupportive management \r\nIT equipment doesn't work \r\nHR is unresponsive\r\nTraining is minimal for things that are needed (software & CRMs) and extensive for the 'tick box' activities"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Demoralising, frustrating and confused", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Jan 2022", "job_title": "Section Head in London, England", "duration": "N/A", "pros": "The mission of the organisation is great, when you’re allowed to get on with trying to achieve something. \r\nThe pay and benefits are OK.\r\nThere are some truly lovely people to work with.", "cons": "For an organisation that invests a lot in its employee support, some of the leadership are curiously oblivious to the way that constant restructures make people anxious. \r\nThe strategy is chaos. \r\nNot quite nepotism, but there’s definitely a cosy “mates of the boss” culture in the London HQ (not attached to the CEO)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "More respect is needed in the reviews here", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Oct 2021", "job_title": "Manager in London, England", "duration": "N/A", "pros": "I'm surrounded by many committed, knowledgeable colleagues\r\nIn a period of great instability in the world, I and my colleagues have been effectively supported throughout the pandemic\r\nOur senior leadership team have a very enlightened approach to how we will work in the future that will benefit everyone's work life balance", "cons": "Too many meetings! Too much discussion at times and not enough action. But the one I want to draw attention to is the lack of mutual respect among colleagues that is being displayed on this website. I’m one of those IOP staff members – the majority - who wouldn’t usually write on here. I read the reviews and see bits that I recognise in most of them. What has prompted me to write now? I’m getting fed up of seeing the disrespect displayed by some reviewers for their colleagues. To them I say it is quite possible for two people in an organisation to have different experiences and for them to be positive and negative. It really annoys me that the positive reviews are dismissed out of hand by those posting negative reviews as being written by senior managers or management stooges. Oh please, you do not speak for everyone! And this should be clear to you if you see the results of the staff survey EVERY YEAR. Of course, there are people who are unhappy with “the organisation” or “the leadership” but we all know that this is a minority. Don’t get me wrong it’s sad that anyone is unhappy but even sadder if they create the impression that everyone is feeling the same as them and brand as liars anyone who disagrees with them and says that their experience at the IOP is positive. For my part, the IOP is not perfect, which organisation is? But my day to day experience is largely positive and I see a lot of people with passion and commitment wanting to make it better and working together to achieve this. So, my plea: let’s treat each other with a little more respect here. Let’s recognise that we are describing our own experiences and not rubbish anyone else’s, even if they differ from ours. It upsets to think I'm working with people who don't share this mutual respect."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Aug 2021", "job_title": "Employee in Bristol, England", "duration": "N/A", "pros": "- Laid back culture and not much work pressure\r\n- Flexible hours and flexible working modes\r\n- Generally supportive environment\r\n- Generous holiday schedule plus decent benefits package\r\n- Good, central location of the office in the heart of the city\r\n- Many passionate, professional, committed to work and company mission colleagues", "cons": "- Rigid, hierarchical, overblown management structure\r\n- Silo culture. Working within smaller teams is usually plain sailing, cross-team work on bigger tasks or projects may be much more challenging.\r\n- Poor vertical communication channels. Feeling that feedback is not taken seriously\r\n- Many meetings, not always necessary\r\n- Overreliance on external consultants"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "An admirable mission but management leaves a lot to be desired", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Oct 2021", "job_title": "Team Assistant in London, England", "duration": "N/A", "pros": "- Working with some friendly and highly dedicated colleagues\r\n-Contributing to the important mission of making physics more accessible and valued in mainstream society\r\n- Decent enough pay and flexible working", "cons": "As a former staff member of the IOP, I've been interested to read the full gamut of reviews on here and wanted to add my own experience, which was something of a mixed bag. A recent reviewer has voiced the need for \"more respect\", but if employers aren't giving their employees respect, then how can they expect the same in return? No one owes any employer respect if they had a bad experience at said workplace; that's not how reviews work. Seeing as said review was written by a manager (or, as I heavily suspect, a member of the senior exec team masquerading as a manager as some sort of PR exercise in response to a recent negative review), it speaks volumes of the entirely different levels of respect experienced by members of management vs. non management. I think it's incredibly ignorant for said reviewer to blanket-accuse negative reviews as somehow being falsehoods and setting out to tarnish the reputation of the IOP. I don't dispute that people enjoy/have enjoyed working at the IOP but this certainly wasn't my experience of the place (or that of a vast number of reviewers on here).\r\n\r\nI respect the IOP's mission to make physics more accessible and, as a previous reviewer has stated, dedication to changing the physics landscape, but what I don't respect is the organisation's attitude towards its \"lower echelon\" staff. Intriguingly, reading the past two positive reviews, the bombastic oratory (almost Churchillian in its devotion) of the one dated 6th October could only have originated from the upper echelons, while the one dated 5th October looks as though it was copied and pasted straight from the IOP's organisational values toolkit. Whether you believe either to be authentic is a matter of personal opinion...\r\n\r\nIn my role at the IOP, I felt like a mere cog in a machine and not a respected member of staff. My manager had little time for me and didn't assign me a workload that was a) set out in the job description b) challenged me to use my skillset in any shape or form. In fact, I felt surplus to staffing requirements as there was such little work to do. The more interesting and substantial projects were outsourced to external consultants, which made me wonder why they bothered hiring me at all. This signals to me very out of touch senior exec and management teams who aren't attuned to their own organisational priorities, let alone the needs of their staff. Massively demotivating, as you can imagine. You can hark on about staff survey results all you want but I know anecdotally that many people were unhappy during their time at the IOP.\r\n\r\nThe IOP's lack of direction and gumption to see through plans and strategies seems to be a recurring theme that's dragged on for several years. It’s a shame that this long-running issue still hasn’t been tackled, and one would hope that the upper echelons will address this problem going forward.\r\n\r\nAnother reviewer mentions a resounding feeling of dissatisfaction/not feeling valued or respected among non-senior staff, and I can confirm that this is very true. Various colleagues confided in me that they were unhappy about the toxic atmosphere and unyielding attitude of the senior exec team in particular. In short, certain departments at IOP (but perhaps not all of them) aren't the place to flex your creative muscles, gain recognition and grow professionally. As per a recent review, I too was very aware of issues with bullying and management not reacting too kindly when challenged on certain issues."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Education", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Oct 2021", "job_title": "Coach in London, England", "duration": "N/A", "pros": "Good benefits and encouraged to work independently. Good support.", "cons": "Constant change of management structure"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Fake reviews ahoy. Don't believe the hype. Get their name on your CV and get swiftly out!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Feb 2021", "job_title": "Anonymous in London, England", "duration": "N/A", "pros": "Located in King's Cross, fancy building, some interesting projects, and you'll learn plenty about physics.", "cons": "To echo the overriding sentiment of many of these reviews, the IOP is a toxic work environment, and you can safely assume that many of the overly positive reviews have been penned by either HR or senior management. My relatively short term (one year) at the IOP can be attributed to the terrible leadership (or lack thereof) and suffocating work environment. The whole operation was ruled by chaos and half-baked plans and strategies that never came to fruition. I didn't feel like a valued member of staff at all (a feeling shared by many), and the complete lack of structure and direction provided by senior management made my job incredibly difficult and demotivating to do on the best of days. As for the environment, well one small mercy is that lockdown has meant not having to sit in a horribly tense and oppressive environment. I can confirm that whispers of a bizarre \"no talking\" rule encouraged by the CEO team are indeed true. The reviews on here that dispute this/claim it to be a lie are a complete fabrication. Why on earth would anyone bother to make this up? What end would that achieve, other than warding off potential applicants from entering a repressive and stomach-churning work atmosphere? The glass walls that run throughout the entire building (including meeting rooms) add to the panopticon prison effect, which I don't doubt for a second was fully intentional. \r\n\r\nThe best advice I can give for surviving this place (post lockdown) is to leave your personality/SOH at the door, get your head down and look forward to your pay cheque at the end of each month."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Flexible", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Sept 2021", "job_title": "Associate Editor in Bristol, England", "duration": "N/A", "pros": "Flexible working hours within the remote working set up.", "cons": "Lack of variety within the job role."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good for Flexibility and opportunities", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Feb 2021", "job_title": "Administrator in London, England", "duration": "N/A", "pros": "People are great, some good opportunities, feels like it's becoming more progressive and forward thinking", "cons": "Flat structure - no room to move up, still some old fashioned thinking, but change has happened"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "A good place as a first job from uni", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jan 2021", "job_title": "Associate Editor in Bristol, England", "duration": "N/A", "pros": "The office was a very friendly place", "cons": "The management was generally poor"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Progress has been made", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Feb 2016", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The other reviews are quite old, and you can tell that a lot has changed in this organisation for the better since late 2014, ask anyone who was here at that time and they'll point towards improvements.\r\nGreat people, the majority are really friendly, helpful and hardworking. Middle management is good as well.\r\nOne of the best intranets I've ever seen in an organisation.\r\nThere are always interesting projects to work on.\r\nExcellent benefits programme including health insurance with multiple levels of coverage, and shopping offers, cinema tickets etc.\r\nSolid, regular and fair appraisal process with a half-year review in the summer, and full appraisal in Dec with potential for performance-based pay rise.\r\nIf you want to make your mark here, you can, and you can get involved in a lot of varied things outside of your regular role if you choose.", "cons": "Not a lot of career progression available, you have to try and build your own career ladder/development if you want to advance here, and it's not always easy.\r\nWhile progress has been made repairing morale and relationships since a restructure in 2014, there is still some way to go. But mostly, it's the perception of senior management. At a peer level, things are very friendly.\r\nOverall, change is slow in this organisation, often because senior management can be overly cautious, which comes across as them not trusting their staff, even if that is not their intention.\r\nCurrent premises in Portland Place are a bit cramped."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Some very inaccurate reviews here!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Very good salaries and benefits. Modern new offices. Great colleagues (in the main!) who work well together and want the organisation to succeed.", "cons": "In my experience, the biggest problem is illustrated by the reviewer who talked of IOP being \"a shambles\", There are clearly some colleagues who are unhappy with the changes being ushered in by the new organisational strategy - this is the case in any organisation. But it's up to each of us to decide whether we want to stick around or move on to another organisation. Happily, the  majority of the staff are embracing the change, learning new ways to work together and getting on with things. \r\n\r\nAnd no, staff are not banned from talking to each other! That is a ridiculous accusation! And no, the deputy CEO doesn't roam the office grimacing at people. In another organisation, she would be complimented for actually walking the floor - something in my experience that very few senior directors do. Don't get me wrong, the organisation has its challenges, but it is too easy and convenient, and simply false, to pin them all on the Deputy CEO."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great management driving excellent work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Nov 2017", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Such a friendly company to work for \r\nAlways open to new ideas and looking for opportunities to improve!\r\nEveryone has a lot of support from senior staff including the exec, like being a member of a family\r\nManagement team are passionate and involved every step of the way as they really do care\r\nSenior staff have a lot of experience and offer great insight into projects, but of course encourage others to contribute too\r\nLots of team work in a positive atmosphere\r\nLots of chances to ask for support and help through management including exec and HR, always friendly and welcoming\r\nWork life balance is great, always encouraging to ensure IOP is part of an employee's life and something they enjoy, not overbearing or burdensome\r\nAn exciting time to work for the company. The projects being ran are excellent opportunities to let staff use their talents and develop", "cons": "Maybe travel expenses are quite high because of central London location but other than that I can't think of anything! Very happy working here"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A supportive organisation", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 May 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "An organisation that cares about its staff. Good pay and flexible working.", "cons": "I saw the review about an “awful atmosphere” and almost spat my tea out.  What a load of rubbish. Easy to tell lies on a public website. I now see our deputy chief executive has posted a response. She is very well respected. So to the reviewer - from those who were in your team you say you like, go to your new job and leave us alone. \r\n\r\n￼"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great people, good organisation, let down by poor management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Feb 2013", "job_title": "Manager in London, England", "duration": "N/A", "pros": "They have a great, laid-back, work atmosphere here, with many ideas and a great staff canteen that offers subsidised meals.\r\n\r\nThe management are flexible and understanding with most things.\r\n\r\nGood location in London", "cons": "Senior management do not always listen to staff, budget is spent poorly, more importance is given to operations in Bristol rather than London.\r\n\r\nThere could be a better communicated direction from senior management, and this place has Directors in place who have been there for lengthy period of time and are resistant to change, along with the Council. \r\n\r\nMore importance needs to be given to staff training, and this place needs to be more forward thinking, especially in the remit of digital."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "From great place to work to corporate hell.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Sept 2014", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great colleagues, some interesting work", "cons": "Poor leadership, lack of opportunities, unpleasant corporate culture,"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Systematic failures in this organisation, amplified by mismanaged long term changes, leaves staff feeling disheartened", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Nov 2017", "job_title": "Officer in London, England", "duration": "N/A", "pros": "The IOP has a lot of potential as a membership organisation, and generally, the people there are likable, skilled and talented.", "cons": "The IOP’s unwillingness to make decisions based on evidence, an inability to be supportive, a lack of commitment to openness, and a failure to recognise and reward talent is sadly at odds with the supposed values this organisation has boldly enshrined in its strategic aims.\r\n\r\nThe effects of these institutionalised shortcomings are amplified by the large amount of change currently taking place at the IOP, including a digital overhaul, a membership restructure, and, if all goes to plan, an actual building move that will take place next summer.\r\n\r\nSystematic failures, upheld by lacklustre senior management, means staff often feel overworked, neglected, undervalued and unhappy, especially during this period of increased activity as large scale changes and their effects resonate throughout the entire workforce.\r\n\r\nAs there is no formal feedback system for managers, those that are good at what they do receive no recognition. What is more worrying is that managers who under perform are never identified and offered a chance to improve, resulting in a negative atmosphere developing as their teams feel neglected.\r\n\r\nThere is a distinct lack of community between the executive staff and the rest of the workforce too; an “us vs them” attitude means that many staff do not feel their work is valued or their input is important or even recognised by the senior management.\r\n\r\nAnother review summed it up nicely: the words “thank you” do not seem to be in the vocabulary of those that reap the reputational rewards that stem from the hard work of others. \r\n\r\nExecutive staff are unable to resist micromanaging, usually resulting in detrimental outcomes as they lack specialized knowledge and relevant experience, something they are obviously unwilling to admit. Undue pressure is placed on departmental heads and below with junior staff having to bear the grunt of this, slowing down progress and stifling advancement. \r\n\r\nMoney is heamorrhaged at a rate that would imply some staff are unaware of the organisation’s charitable status, meaning when things go wrong and even more expenditure is needed to correct faults, no-one is held accountable. \r\n\r\nResistance to transparency by senior staff means at best, others feel they are frustratingly left in the dark and then caught out when changes are implemented, and at worst, means staff feel ignored, devalued, and lied to.\r\n\r\n An example of this was when staff satisfaction survey results were manipulated and presented by the executive management, meant that a whole workforce had their own opinions twisted and presented back to them as lies. \r\n\r\nThis is just one, if not particularly damning example, of how little executive staff respect the thoughts and opinions of their workforce and are unwilling to address the issues that are there. \r\n\r\nAll of these issues are amplified by the accelerated and supposed “development” of the IOP – a company that perhaps was not ready to take on so much change so quickly. These failures drive a vicious cycle that adds to the negative climate: staff are unhappy, staff then voice their views, nothing is done and so staff leave.\r\n\r\nWith high staff turnover comes delays in these long term projects and adds even more anxiety and pressure to those that have remained, until they too decide it is better to leave. \r\n\r\nMy advice? Until significant changes and improvements are made, avoid working there altogether."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "A company who cares", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Nov 2017", "job_title": "Project Coordinator in London, England", "duration": "N/A", "pros": "Great people\r\nChance to be creative and work on challenging projects\r\nFamily atmosphere\r\nEverybody helps each other, at all levels\r\nGreat work/life balance\r\nSupportive of personal and professional progress", "cons": "None really. I have worked for the Institute almost two years now and look forward to my future within the organisation."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Fantastic company, but poor pay.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Feb 2017", "job_title": "Anonymous Employee in Bristol, England", "duration": "N/A", "pros": "The company did brilliant work, and it was all too easy to take 10mins to read one of the thousands of published journals. Fantastic office location in Temple Quay, close to the train station. Onsite subsidised employee canteen, which served up some wonderful lunches. Bonus structure was very good also.", "cons": "General level of pay was poor, and not just for my role. Many of my colleagues I had daily interaction with complained of poor pay, most of which I believe have since left. Shame, because if the pay was better, I certainly would have stayed."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "poor management writ large", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Fantastic headquarters, salaries modest, but overall benefits good.", "cons": "Poor management is endemic with managers lacking training in how to deal with their team. People who ask questions are isolated and encouraged to leave."}]]