[[{"date": "18 Apr 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Notting Hill Genesis (Chelmsford, England) in Feb 2023", "Interview Descriptions": "This interview was a 20 minute chat using star questions and previous experience, This was followed by a quick 10 min excel test to test ability. Interviewer was very friendly", "Interview Questions": "standard star questions, then some questions about previous experience"}, {"date": "16 Jan 2023", "title": "Senior Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Notting Hill Genesis", "Interview Descriptions": "Required a 10 min PowerPoint presentation advised of ahead of interview in addition to the standard interview. What you plan to achieve in the first 100 days of commencing the role.", "Interview Questions": "Examples of experience in a similar role."}, {"date": "22 Nov 2022", "title": "Property Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Notting Hill Genesis", "Interview Descriptions": "They send an email which highlights the interview process which is quite helpful. Interviewers are friendly and willing to listen and ask you to expand on your points. Overall good interview process, can easily be passed", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Nov 2021", "title": "Talent & Learning Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Notting Hill Genesis in Jun 2021", "Interview Descriptions": "Smooth, clear and concise interview process\r\nVery good communication throughout with plenty of opportunities to learn more about the role as well. Onboard was well managed too, again a very smooth and swift process overall", "Interview Questions": "Case study and presentation\r\nFollowed by competency based questions "}, {"date": "23 Dec 2020", "title": "Carer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Notting Hill Genesis", "Interview Descriptions": "It was a phone interview, after having done an application form online, it was not a long phone interview, and only 5/6 or so questions asked by 2 interviewers", "Interview Questions": "A perilous experience when you have looked after someone?"}, {"date": "30 Sept 2020", "title": "Internship Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Notting Hill Genesis", "Interview Descriptions": "Got in contact through a recruiter. It didn't feel like they were interested in my skill set or opportunities. To me, it felt like they tried to convince me to do their work, with no regards to the goals of my study or internship at all.", "Interview Questions": "Do you have experience with the Microsoft stack?"}, {"date": "7 Apr 2021", "title": "Property Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Notting Hill Genesis (London, England) in Feb 2020", "Interview Descriptions": "There were three stages to the interview, 1) roleplay 2) interview 3) written assessment  the role play was carried out by an actor, i was given a scenario to read through prior to this commencing", "Interview Questions": "usual behavioural based questions, eg describe a time you had to deal with a difficult situation, a time when you had to deal with a difficult customer."}, {"date": "3 Jun 2018", "title": "Customer Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Notting Hill Genesis (London, England)", "Interview Descriptions": "There were 5 stages and when you pass one you go the next and you get told same day if you got the job or not.We tested in different things e.g Listening skills,Computer Knowledge,How to respond to an email and then there was role play and finally the one to one interview which is the last stage .. Trust me it was a warm environment,staff were friendly and made you feel relaxed. I had a great experience though it took the whole day but never worry because  they provided lunch. Overall it was an exciting experience,a bit different from the usual interview processes I have attended.", "Interview Questions": "What is Genesis built on?"}, {"date": "21 Jun 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Notting Hill Genesis (London, England) in Apr 2018", "Interview Descriptions": "I discovered that it is not always quick and easy to get hired. The job interview process can be lengthy. Being interviewed once and getting a job offer is typically a thing of the past. Today, many companies have an involved interview process starting with screening interviews, which often take place on the phone, followed by in-person interviews, second interviews, and even third interviews.", "Interview Questions": "What are your strengths and name a weakness? Give an example when you work as a team. Give an example of your IT skills. "}], [{"date": "5 Jan 2017", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at Notting Hill Genesis (London, England) in Oct 2016", "Interview Descriptions": "I arrived early but still had to wait almost an hour after the agreed time for the interview to take place. The man at the front desk had to email one of the interviewers about 4 times before he got a response.Took about 50 minutes.  Interviewers were very pleasant.\r\nthe whole process was very undaunting.  I felt very confident answering the questions and could see they were impressed.", "Interview Questions": "Describe the bank reconciliation process."}, {"date": "26 Oct 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Notting Hill Genesis (London, England) in Oct 2015", "Interview Descriptions": "The process was carried out via an agency. I submitted an online application, and then received a call a few weeks later informing me I had been shortlisted to an interview. The interview itself was around 1.5 hours overall, a one hour competency based interview followed by an excel test.", "Interview Questions": "Give us an example where you had to deal with a data difficult request, how you overcame it?"}, {"date": "22 Jun 2017", "title": "Research Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Notting Hill Genesis (London, England) in Feb 2014", "Interview Descriptions": "Two stage interview process. First stage included a prepared presentation with questions from the panel (3 people). A second stage interview which included an unseen test and interview with two people. The interviews were about a week apart. The head of research led the interview, along side the head of marketing and a representative from HR", "Interview Questions": "Asked about research methodology"}, {"date": "19 Oct 2013", "title": "Property Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Notting Hill Genesis (London, England) in Oct 2013", "Interview Descriptions": "They have their own Genesis HR Resourcing  and hire there own temps with in house", "Interview Questions": "recent question during infrastructure changes I asked what did they mean by assimilation to another Job role they proposed and they replied look at the Genesis management policy and I said from what I read your asking us to reapply for these Jobs for less than ten grand less annually and that we would go through another Job interview and have no guarantee of getting it and if we do not apply we would be refused redundancy ? they replied Yes "}, {"date": "5 Feb 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Notting Hill Genesis (London, England) in Dec 2012", "Interview Descriptions": "I got contacted by a recruitment agency. It was very quick and efficient. I was made an offer following day. Interview Panel was very flexible in adjusting the interview time to my availability.", "Interview Questions": "Interview Questions related to the Job Description and Person specification and in general they were standard interview questions, so no surprises there."}]]