[[{"date": "26 May 2023", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Copa  Health (Phoenix, AZ)", "Interview Descriptions": "Situation or behavioral based interview questions that test out your competencies: come with real life examples to best answer the question, things you’ve experienced in the past work place. Process involves two individuals from department leadership usually, interviewing you", "Interview Questions": "Tell me a time you had to help in customer service and wowed someone?"}, {"date": "28 Feb 2023", "title": "Program Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Copa  Health", "Interview Descriptions": "Easy going, very informative, every one was inviting yet professional. Wanted to get right into the interview yet learn about me as an individual. It was cool like zebras camels and bears that hiss", "Interview Questions": "Past experience and what I would change"}, {"date": "12 Apr 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Copa  Health", "Interview Descriptions": "It was a fairly standard interview where they just wanted to get to know you and what you could do for the company. It was an incredibly relaxed process, and i was surprised at how quickly the time passed by.", "Interview Questions": "Tell us about yourself \r\nWhat is your flexibility"}, {"date": "10 May 2022", "title": "BHT-behavioral Health Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Copa  Health in Apr 2022", "Interview Descriptions": "Very easy process and I was very comfortable in talking with interview I would tell anyone looking for a new job to be interviewed here they will be very pleasantly surprise and enjoy the process", "Interview Questions": "Listening was the most important and they did "}, {"date": "3 May 2021", "title": "BHT-behavioral Health Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Copa  Health (Phoenix, AZ)", "Interview Descriptions": "Practical questions related to time management, how you will contribute to a clinical team setting, and how you would approach the members who struggle to be independent on their own when taking care of their health needs.", "Interview Questions": "What is your strong assets and weaknesses?\r\nHow do you stay ahead with your time management?\r\nWhat will you do if a member doesn’t choose to engage with you?"}, {"date": "15 Sept 2021", "title": "Organizational Development and Learning Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Copa  Health (Mesa, AZ) in Jul 2020", "Interview Descriptions": "First I completed a phone screen with the recruiter, which was great! He gave a lot of great info about the job and company culture and asked really great questions. A couple of days later I interviewed with the chro and director or hr via zoom. All of the questions were challenging but gave really great insight as to what they were looking for. An overalll great experience.", "Interview Questions": "Describe a time when you were asked to bend the rules. How did you respond?"}, {"date": "14 Jan 2020", "title": "Peer Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Copa  Health", "Interview Descriptions": "The online application went well but trying to get a hold of a live person was next to impossible and basically I was told to wait for the job fair.", "Interview Questions": "N/A"}, {"date": "3 Apr 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Copa  Health (Mesa, AZ) in Dec 2016", "Interview Descriptions": "I applied online and was called the next day to set up an interview. I arrived and they had me fill out an actual application as I had just submitted my resume before. He basically looked over my application, told me the house he was hiring for, asked if I had any questions, and then asked if I could go to HR that day and set everything up. Was not even really an interview. Just seemed like they were desperate and would hire anyone that applied without even finding out about them. When I went to HR they had me sign everything and then right before I left to go get my drug test and fingerprint clearance card I asked something and they said, \"Oh by the way, you have to pay for your own drug test, motor vehicle test, and fingerprint card.\" This should've been explained at the beginning and wouldn't have been had I not asked.", "Interview Questions": "I can't even remember being asked anything besides my availability and where I lived so they could match me to a close house. Strange interview."}, {"date": "23 Jan 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Copa  Health (Cromwell, CT) in Oct 2016", "Interview Descriptions": "I got a call to come in for an in-person interview for their Program/Case Manager position the first week of October 2016. My first in-person interview was with two Vice Presidents in the company on October 21, 2016. The interview went really well, I built a connection with my interviewers and was even given a tour of the facility after I had answered all of their questions. They told me numerous times that they were in a rush to fill the position during this interview.  I didn't hear anything back for two weeks so I called and asked for an update on the hiring process on November 4, 2016.\r\n\r\nI was called back on November 9, apologizing for the delay and was asked to come in for a second in-person interview on November 17. This second interview was a panel interview with four people from the company from every level plus a client from one of the programs I would be managing. This second interview went very well I felt, maybe even better than the first one. I answered all of their questions thoughtfully and insightful. I was also given a second tour of the program facility after the interviewed had ended where I got to see the program in action and meet several of the clients.\r\n\r\nI didn't hear anything back for weeks and asked for an update or if a decision had been made on 12/2/2016. I was contacted a full week later and said no update had been made and one would be made in the next week, they did not expect the process to take this long. I did not hear anything for one month after this call so I called and asked for yet another update and to just let me know either way if they had a hired for the position or if I was still a candidate. I still did not hear anything from the company until almost two months after the non-update update on 1/21/2017 where I got a non-personalized letter in the mail saying I was not qualified for the position. Throughout this whole process on the company's staff page there had been the Program Manager position listed with no staff picture. This was taken down one day before I got my letter in the mail. \r\n\r\nFor future job-seekers be weary of this organization. They dragged my interview process along for almost 5 months for a job I was extremely qualified for and interviewed in-person twice. They never even hired anybody for the position! The lack of communication during this process was appalling, disrespectful, and down-right rude. If a job-seeker is not qualified and or does poorly in the interview process that is one thing but for somebody who met all the qualifications, had a wealth of experiences, and did extremely well in the interviews to get a letter is pretty shameful. But a letter almost 3 months after their second interview saying that they are unqualified for a position that you didn't even hire for and giving them two in person interviews is just abhorrent.", "Interview Questions": "How would you handle a situation with a client who refuses to do their job?"}], [{"date": "30 Aug 2016", "title": "Caregiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Copa  Health (Flagstaff, AZ) in Jan 2016", "Interview Descriptions": "Staff was very straightforward, but inviting. Management orderly, but extremely friendly. All appointments were in a timely manner and all correspondence to get to the interview was punctual as well. Interview was overall pleasant and went past the hour time frame voluntarily that had been set up.", "Interview Questions": "What I enjoyed about being a caregiver"}, {"date": "23 Jan 2017", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Copa  Health (Mesa, AZ) in Jul 2015", "Interview Descriptions": "Interview with the program director. Medium level. I applied for another position, but because I did not have a background in psychology, I had to start at Behavioral Health Paraprofessional. After a year, I became a Behavioral Health Tech.", "Interview Questions": "\r\nHow would you motivate a client who did not want to do his chores?"}, {"date": "11 Oct 2015", "title": "CLs - Direct Support Provider Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Copa  Health (Mesa, AZ) in Jun 2013", "Interview Descriptions": "There are walk in interviews every tuesday. They are at the building at 924 N Country Club Drive. pretty much you get hired on the spot. the interview times are between 9-11. you can do the application online or they had computers there. you don't really need experience to work there but you will need patience with the population you are working with.", "Interview Questions": "Do you have any experience working with the special needs community?"}, {"date": "16 Oct 2012", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Copa  Health (Mesa, AZ) in Jan 2009", "Interview Descriptions": "The company will hire any warm body. You do not have to be experienced just capable of following directions and writing brief reports documenting client behavior. It is an underpaid baby sitting job. You have to have a clean driving record to drive company vehicle and no violent background. Depending on your shift you may have to cook food or clean the house. I was hired on the spot because they are understaffed.", "Interview Questions": "When can you start work."}]]