[[{"date": "25 Aug 2022", "title": "Part-time Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Indiana University of Pennsylvania in Aug 2022", "Interview Descriptions": "Comfortable environment. Plenty of time for the interview , but the interview was conducted last minute. No fault of the department, but the school's ability to give me time to set up courses was lacking.", "Interview Questions": "What times was I available?\nWhat experience teaching do I have?\n\n"}, {"date": "6 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Mar 2021", "Interview Descriptions": "During the interview, it was very knowledgeable and the panel really want the best of your abilities. It helped me gain an insight on what is expected of me while being part of the internship program.", "Interview Questions": "What type of production would you want to be in?"}, {"date": "27 Sept 2020", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Indiana University of Pennsylvania", "Interview Descriptions": "Good, not too difficult. Make sure that you have taken the necessary courses such as  Calc I and II and that you have a good gpa. Have to be personable and have good relationships with professors and peers.", "Interview Questions": "What math courses have you taken before"}, {"date": "12 Aug 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Indiana University of Pennsylvania", "Interview Descriptions": "I was asked about my relevant previous tutoring experience and asked to complete a few short test exercises.  For example, I read a sample homework which a student may present to me asking for help, and was asked to explain. To my interviewer how I would help the student with the assignment.", "Interview Questions": "Tell me about your previous work on education"}, {"date": "25 Oct 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Indiana University of Pennsylvania", "Interview Descriptions": "It was an overall good experinece, had a phone call theu were pretty goo at hiring. he interview was over an online shared coding whiteboard, that had auto indent and syntax highlight so it was not too uncomfortable. Programming questions you get to decide the language.", "Interview Questions": "what are your skills and why do you think you are a good fit"}, {"date": "3 Jan 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Aug 2016", "Interview Descriptions": "I talked to the professor before the semester started. The department of professional studies already have all my credentials and clearances. I filled out a form previously. Only students with excellent academic performance are offered this kind of assistant position.", "Interview Questions": "What kind of experience have you had as a research assistant?"}, {"date": "14 Jun 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Indiana University of Pennsylvania", "Interview Descriptions": "I had a telephone interview with a panel of 3 professors. Was asked some common questions about my teaching philosophy and experience with technology. Most of the questions were based on past experience.", "Interview Questions": "Your teaching philosophy"}, {"date": "20 Feb 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in May 2016", "Interview Descriptions": "Submitted application through online HR portal...easy to use. Had one phone interview and was offered the position immediately after. I myself Insisted on driving up to interview the campus and facilities in person before accepting.", "Interview Questions": "Asked about my experience teaching non-majors in my field. "}, {"date": "2 Oct 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 8 months. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Oct 2015", "Interview Descriptions": "Most of the initial process and contact was done via email. Submitted resume, face-to-face interview and  hired on the spot pending background checks, clearances and fingerprinting. Overall process took approximately 8 months", "Interview Questions": "Let's talk about your resume"}, {"date": "10 Aug 2015", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Indiana University of Pennsylvania (Indiana, PA)", "Interview Descriptions": "I applied in person, and I met with the hiring manager, and introduced myself. You need to show them 2 references to recommend you, but there was no interview. It was an easy process", "Interview Questions": "Introduce yourself"}], [{"date": "7 Jan 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Jun 2015", "Interview Descriptions": "When applying for a GA outside of your department you may be interviewed by the professor seeking a GA. The process for a GA interview in my experience was a phone interview asking about my research skills and courses completed. They wanted to know if I was a good fit to help conduct research and editing for their department.", "Interview Questions": "How advanced are your Microsoft Office skills?\r\nWhat research classes have you completed?\r\nHow are your surveying and Qualtrics skills?"}, {"date": "2 Apr 2015", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Feb 2015", "Interview Descriptions": "I went to IUP for a campus interview for an assistant professor position in my field.  The backwater town and low-intensity of the school reflects in the faculty and students alike.  For example, the questions faculty asked at my job talk didn't reflect more than an undergraduate understanding of our field and I had several meetings scheduled that faculty just didn't show up for.  The meetings I did have left a bad impression - for instance one program director had drooping eyes and was struggling to keep her head up - seemed like she was on pain medication.  When we went out for dinner after my talk I was given the check to pay for my own glass of wine!  What's more, I was asked to purchase my own airfare and assured a reimbursement ...  I'm still waiting for that check two and half months later.  If you have serious career ambitions and ANY other option, I'd steer clear of this school.", "Interview Questions": "Nothing interesting nor surprising."}, {"date": "25 Aug 2014", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Indiana University of Pennsylvania (Indiana, PA)", "Interview Descriptions": "Usually a several interview process. Be sure to be up on your field in practical and theoretical areas. If you have a faculty contact at the university, see what you can find out about the gap the department is trying to fill. This will give you an idea of your chances for success. For example, if you are qualified in qualitative research and they are seeking a quantitative person, you are unlikely to be selected.\r\nBe prepared to answer: What would you like to teach at IUP? There is lots of information on the website related to the courses offered.", "Interview Questions": "Not unexpected, but surprising how many applicants stumble on this: What are your research interests?"}, {"date": "5 Apr 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Indiana University of Pennsylvania", "Interview Descriptions": "Very clear process, very professional", "Interview Questions": "How would you handle a student who is not performing to course expectations?"}, {"date": "17 Feb 2017", "title": "Teaching Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Mar 2014", "Interview Descriptions": "It was fine. The committee will send you few questions to consider and prepare for the interview. Dress formally and enjoy the discussion.\r\nyou will receive few time slots to choose from.", "Interview Questions": "How do you X subject?\r\nHow does your current degree/program contribute to your teaching?\r\nWhat is your teaching philosophy?"}, {"date": "19 Oct 2015", "title": "Clerk I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Mar 2011", "Interview Descriptions": "Invited into a room with a sole interviewer, asked questions for about half an hour, and was then given an opportunity to ask my own questions. I had several and posed them - received responses that were short, but in the end answered my questions. Could have been a little more descriptive.", "Interview Questions": "Why do you want to work for IUP?"}, {"date": "9 Oct 2013", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Dec 2009", "Interview Descriptions": "I heard from a friend that the Writing Center would be needing new workers for the next semester. The application was online, so I printed one, filled it out, attached a writing sample, and gave it to the front desk worker. A few days later, I got an e-mail to come in for an interview. The interview took place in the chairperson's office with him and the assistant chair. I answered a few questions about myself and why I wanted to work there. I was asked if I knew what the job entailed. I was asked about my writing. After about 10 minutes, we shook hands and I left. The next day, I received an e-mail that I had been hired and told the first day in which I was to show up.", "Interview Questions": "How's your grades, all A's?"}, {"date": "13 Jan 2010", "title": "Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Indiana University of Pennsylvania (Indiana, PA) in Jan 2008", "Interview Descriptions": "Great initial communication. Found the job posted on Craigslist website, as well as on their employment site. Received first callback within 24 hours. Phone interview lasted approximately 15 minutes. Received invitation to interview in person the following week. Interviewed with the hiring manager for 2 hours - received tour of facilities. Great experience!", "Interview Questions": "Where do you see yourself in 3 years?"}]]