[[{"date": "30 Jun 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkview Community Hospital Medical Center", "Interview Descriptions": "The interview was a little disorganized but was fun. We laughed a lot and I got an offered with an hour. They do make you take a dosage exam but give you a cheat sheet. It was a 2 person panel.", "Interview Questions": "Why do I want to work at Parkview Hospital "}, {"date": "23 Nov 2021", "title": "Registers Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Parkview Community Hospital Medical Center", "Interview Descriptions": "The process was fairly easy. Try to bring a portfolio with necessary documents ( resume, license, certifications, etc..) The staff was incredible nice and understanding. They were also very helpful.", "Interview Questions": "What would you do if you were out of ratio and needed to take on another patient "}, {"date": "6 Aug 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Parkview Community Hospital Medical Center", "Interview Descriptions": "Very Basic questions, nice staff. Panel interview, mostly behavioral questions. The HR manager was very sweet and helpful throughout the whole process. Math test after interview, simple medication math. Overall, simple and not a difficult process at all. Got back to me quickly and received an offer about a week after my interview.", "Interview Questions": "Tell us about a time you encountered a difficult patient and how you responded."}, {"date": "25 May 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkview Community Hospital Medical Center (Riverside, CA) in May 2020", "Interview Descriptions": "I applied online and then attended the hiring fair. Applied for DOU, given a med math quiz and they dont let you use calculators so practice % with decimals. Got a call the same day to schedule 2nd interview, 2nd interview was a group with 6 other people, had to work together to prioritize patient scenarios. Got a call two days later with a job offer", "Interview Questions": "What makes you unique?\r\nWhy this hospital?\r\nHow to do feel about caring for COVID 19 patients?\r\nIs it okay to break the set rules?\r\nWhat is your most memorable moment throughout clinical?\r\nWhat do you fear about COVID 19?\r\n\r\n"}, {"date": "19 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Parkview Community Hospital Medical Center (Riverside, CA) in May 2020", "Interview Descriptions": "Group interview two rounds and you have to interview in front of a panel which consists of the supervisor for ever department. They will ask you your top three departments that you would want to work at.", "Interview Questions": "Why do you want to work in the ED"}, {"date": "29 Mar 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkview Community Hospital Medical Center", "Interview Descriptions": "Applied online. Group interview with 5 applicants and panel of managers from each department and CNO. Asked questions based on personality and experience and then did a group activity given different patient scenarios and how you would handle them", "Interview Questions": "What department do you want to work in and why did you choose that department "}, {"date": "15 Sept 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Parkview Community Hospital Medical Center (Riverside, CA) in Sept 2019", "Interview Descriptions": "Applied at Job Fair held at the hospital where they had tables set up for each specialty (Med/Surg, ER, ICU, etc).   Was called in next week for a panel interview, which consisted of 5 department heads.   Our group of new grads consisted of 5 people.  First, our group went inside the conference room where each department head asked us a question and then everybody in the group had to answer it.  It felt a bit awkward to hear same question answered 5 times.  After those questions were done, we were presented with a scenario where we had to work as a group to prioritize 5 patients and then discuss possible treatments for those patients.  We were given only 3 minutes to figure out those scenarios so I guess the point of this exercise was to test our teamwork to see how everybody was working together under pressure.  Afterwards, we were  given a 2-page medication worksheet to complete.  No calculator was allowed so brush up on your long division skills beforehand.  The whole interview took us about 2 hours.  We were told the results of the panel interview with offer letters the following week.", "Interview Questions": "N/A"}, {"date": "2 Mar 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkview Community Hospital Medical Center (Riverside, CA) in Dec 2018", "Interview Descriptions": "It was a group interview, they didn’t tell us until we got there. It was about two hours long. Each person had to answer the question. There was a math test at the end of the interview.", "Interview Questions": "Describe a time where your patient rapidly declined. What did you do, what was the outcome?"}, {"date": "9 Oct 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Parkview Community Hospital Medical Center", "Interview Descriptions": "Group interview with 5 heads of departments. Questions were asked for each member to answer individually. After that the group was asked to complete a group activity in which they had to prioritize 5 patients and discuss possible treatments the doctor would call for and possible nursing interventions that would be needed for each patient.  After the interview the interviewees were given a medication worksheet to complete.", "Interview Questions": "Tell us about yourself and why you became a nurse."}, {"date": "20 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Parkview Community Hospital Medical Center (Riverside, CA) in Apr 2018", "Interview Descriptions": "it was internal hire. I switched department by applying for an open position. It was a panel interview and there was also a skills test with med math. A lot of the questions were group answers so I had to collaborate with the other nurse interviewing with me.", "Interview Questions": "How did you handle negative feedback about your performance"}], [{"date": "23 Sept 2020", "title": "RN Full Time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Parkview Community Hospital Medical Center in Dec 2016", "Interview Descriptions": "My interview was less than an hour. Nice manager, easy going and helped relieve my stress by her kindness. Too bad she is gone now though. Be confident, not too much.", "Interview Questions": "of course tell me about yourself"}, {"date": "25 Sept 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Parkview Community Hospital Medical Center", "Interview Descriptions": "Interview lasted few minutes and asked what kind of problems do I usually encounter and how to complete them. Why do I want to work for them. What goals do I have in the next five years.", "Interview Questions": "What are your strengths and weaknesses"}]]