[[{"date": "26 Apr 2023", "title": "Field Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Internews", "Interview Descriptions": "Two interviews, first with one person, second with the same manager and the director. Very well structured, professional, job specific, friendly. The second one was more oriented on building contacts, understanding and approaches to the fulfilling tasks etc", "Interview Questions": "Experience related to the job offer, vision of tasks and performance etc"}, {"date": "3 Nov 2022", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Internews", "Interview Descriptions": "Panel interview with pretty standard questions. They cover soft skills, admin experience, and motivations. It would be wise to be prepared on the work they are currently doing to show your understanding and preparedness", "Interview Questions": "How do you stay motivated in an administratively heavy role?"}, {"date": "21 Sept 2022", "title": "Censorship Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Internews", "Interview Descriptions": "The interview was a panel that consists of 4 employees. They were pretty friendly and asked strategic questions. they also gave me the opportunity to send some answers via email after the interview is completed.", "Interview Questions": "About internet censorship, circumvention, and anonymity tools. "}, {"date": "22 Aug 2022", "title": "Video Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Internews", "Interview Descriptions": "I got an email response to my application, and we set an interview date. The interview was done by video call. I was interviewed by two team members who were very friendly and supportive, and I got confirmation around a week later.", "Interview Questions": "We discussed my background and skillset and went over the project scope/requirements."}, {"date": "21 Jul 2022", "title": "Associate Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Internews in Apr 2022", "Interview Descriptions": "First shortlisted and had to complete a 2 hour exercise. Received an interview within the next few days. Was told it was an urgent hire but only heard back months later.", "Interview Questions": "How will you manage the role."}, {"date": "19 Apr 2021", "title": "Grant and Contract Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Internews (Arcata, CA) in Apr 2021", "Interview Descriptions": "Two interviews via Teams with a take home test. First interview included a core group and second interview had more members of the group, even fairly new hires. Plenty of space to ask questions and add during the interview. Felt like a conversation in-between the canned questions.", "Interview Questions": "What is something you fell positive about contributing to your current or previous job?"}, {"date": "15 Feb 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Internews (Nairobi) in Jan 2021", "Interview Descriptions": "I applied and got an interview invitation three months later. Had a first oral interview with the senior management team. Passed and was invited to send previous work samples. Passed and was invited to the final oral\ninterview. Overall it was quite a positive process.", "Interview Questions": "I was asked competency as well as behavioural questions. I was also asked to describe my work samples "}, {"date": "17 Jan 2020", "title": "Multimedia Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Internews (Dhaka) in Sept 2018", "Interview Descriptions": "I saw there job advertise on a job website and applied. After that I got call from them and met them at their Dhaka Office. There after sharing my previous experiences on that roll I expressed my eagerness for the job and showed how I can add betterment on that roll. Then I was asked to visit my workplace so that from both end we can decide that we can work together or not. After visiting the workplace I was asked to submit a report about my view about everything I have understood through this visit. I just submitted a detail SWOT analysis and they just liked my review and I got employed.", "Interview Questions": "At the end of a successful interview session, I was asked to visit my workplace. After visiting the workplace I was asked to submit a report about my view about everything I have understood through this visit."}, {"date": "3 Jan 2017", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Internews", "Interview Descriptions": "The interview process was painless it was like having a conversation based on my resume. He first started off by telling me about the company and they came to be so prominent in their field. He then went on to speak about the position itself and what it would entail on a day to day basis. Once we did start the question segment it was pretty straightforward. No corny questions about where do you see yourself in 5yrs, or tell me how you handle multiple deadlines. I really appreciated his thoughtfulness and tact when interviewing me. The interview took about an hour and a half maybe a little more. I can be very talkative so I was comfortable with it.", "Interview Questions": "Tell me about your greatest accomplishment while working in (XYZ)  country?"}, {"date": "11 Sept 2017", "title": "Business Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Internews (Washington, DC) in Jan 2017", "Interview Descriptions": "The overall process was quite  smooth and professional. Everyone was respectful and enjoyable to speak to. The next steps were clearly articulated and stated timelines were kept.  Internews sounds like a great organization.", "Interview Questions": "Describe your relevant experience. "}], [{"date": "7 Jan 2017", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Internews (Washington, DC) in Oct 2016", "Interview Descriptions": "Applied online, about a week later received a phone call to schedule an interview for the next week. A couple weeks later received an e-mail for a second interview. The first interview was one-on-one, the second interview was in front of several team members.", "Interview Questions": "Q: How have you dealt with an unexpected sudden deadline?"}, {"date": "2 Aug 2016", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Internews", "Interview Descriptions": "Not serious at all, a lot of laughs and jokes but no actual questions about one's skills, just about one's hobbies, about how they spend leisure time, etc. No specific information about the position advertised was given, no questions about one's experience or education at all. Poorly conducted, the main interview person seemed drunk.", "Interview Questions": "What are your hobbies?"}, {"date": "13 Sept 2016", "title": "Program Director Interview Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Internews (Kabul) in Jul 2016", "Interview Descriptions": "I applied in May 2016 for the Program Director position with Internews in Afghanistan. I was notified in July that they would like to interview me for this position. I had multiple rounds of emails. Then I was contacted by HR to provide them with some references and salary history.  I was not offered the position and was notified of this in August 2016.  I had never had my references checked before and not received that position in the past.", "Interview Questions": "Why do you want to work for Internews?"}, {"date": "14 May 2016", "title": "Senior Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Internews (Washington, DC)", "Interview Descriptions": "I had a skype call, followed by an in-person interview panel made up of a range of people from across the organization, and meeting with the principals. It was all very collegial, well-organized, and professional.", "Interview Questions": "Why do you want to work at Internews?"}, {"date": "4 Feb 2017", "title": "Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Internews (Washington, DC) in May 2015", "Interview Descriptions": "The interview process was fairly simple. The first step was a phone call which lasted about 30 minutes. The phone call didn't seem much like an interview it was more like a conversation about the job description and my qualifications", "Interview Questions": "What kind of IT set up do you have at home."}, {"date": "13 Dec 2018", "title": "Monitoring and Evaluation Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Internews (Juba, Baḩr al Jabal) in Dec 2014", "Interview Descriptions": "One round. It was a Skype audio call. Two individuals were on the other line - someone who would be my direct supervisor, as well as the Chief of Party. Writing samples were requested ahead of time.", "Interview Questions": "Describe your writing samples. "}, {"date": "28 Sept 2014", "title": "Senior Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Internews (Washington, DC) in Dec 2012", "Interview Descriptions": "Quick interview process. Lots of general discussion about the company. Relatively little information in the job description or interview about the actual details of working for the company, which involve extensive attention to compliance with government-grantor requirements.", "Interview Questions": "Worried about receiving government funding?"}]]