[[{"date": "13 Jun 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UUH Outreach", "Interview Descriptions": "It went well but it could have been done better in a good manner I think the guy was too non professional he was very nonchalant and it went very fast for the type of job it is", "Interview Questions": "How much money I would like to make "}, {"date": "9 Oct 2020", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UUH Outreach (Warsaw, Masovia) in Jan 2020", "Interview Descriptions": "very nice tested english skills, i managed to get a job and im happy with that. they asked me about coding skills and about language skills. i enjoyed the interview very well it took about 30 min", "Interview Questions": "how good is your english?"}, {"date": "26 Apr 2014", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UUH Outreach (Philadelphia, PA) in Nov 2013", "Interview Descriptions": "The interview process was straight forward, easy and comfortable. Good questions were asked to make sure that the student is a good for for the organization. Only had to meet with one supervisor who was very kind and encouraging. Interview was about an hour long but was in the form of a conversation. No intimidating questions were asked. i felt respected and as if we were both interviewing each other to make sure that it was the right fit for both the student and the organization. I was able to learn a lot about the organization before deciding to intern there. glad I did!", "Interview Questions": "No difficult or unexpected questions were asked"}], [], [], []]