[[{"date": "30 Mar 2023", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "Very good organization. Interview process was good, there were 3 rounds of interviews (screening, manager and panel). They asked about strengths, language capacity and position specific questions. Very easy to climb up the ladder if you take initiative and responsibilities.", "Interview Questions": "N/A"}, {"date": "16 Dec 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partners in Health", "Interview Descriptions": "Four rounds - initial screening, group interview with team, technical exercise (for a technical role), final interview with position supervisor. A relatively straightforward process with standard questions, hiring committee interested in style of work and how you manage work/issues as well as background.", "Interview Questions": "What is your approach to working in cross-cultural environments?"}, {"date": "3 Dec 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "2 interviews and the typical process most companies have. and then an essay on a health care issue of one's choice and how it influences career trajectory. today and tomorrow it is not that easy to put in words", "Interview Questions": "strength and weakness, passion 4 health equity"}, {"date": "8 Jun 2023", "title": "HEALTH RECORDS and IMFORMATION OFFICER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partners in Health (Boston, MA) in Nov 2022", "Interview Descriptions": "Very short, first an informal call, followed by technical test. The last one was intensive interview on my technical skills and past working experience. More focus was on my views on multi- cultural environments", "Interview Questions": "How do you deal with issues with colleagues with different cultural backgrounds"}, {"date": "17 Oct 2022", "title": "Director of Programs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "I was screened by HR and then an Executive member who did not have prepared questions. It seemed disorganized, but everyone was very nice. I didn't get solid answers to my questions which was a little concerning.", "Interview Questions": "N/A"}, {"date": "31 May 2022", "title": "Policy Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Partners in Health", "Interview Descriptions": "15 minute phone screen with one employee, followed by a 30 minute panel interview with 3 employees, after which they asked to see writing samples or a portfolio of work.", "Interview Questions": "Describe your experience leading campaigns to affect change at the federal level."}, {"date": "21 Mar 2022", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "Simple, but I they were not flexible with work hours when settings dates and times for the interview. There was also no information provided as to who would be interviewing you or total steps", "Interview Questions": "What's a time you had a difficult situation at work, how did you handle it. "}, {"date": "2 Dec 2022", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partners in Health (Manila, Manila) in Mar 2022", "Interview Descriptions": "Not easy but for me its worth to try. You have to focus on what wil they ask you and be confident and honest with yourself. Tell of more experiences", "Interview Questions": "What are the 3 skills of Radiologic Technologist"}, {"date": "25 Nov 2021", "title": "IT Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partners in Health", "Interview Descriptions": "first Interview was oral where i was asked question from both human resources and the other parties involved then technical. \nin the technical part i was asked to write a program to perform a certain task also to design a flyer to be used as communication mean to the directors", "Interview Questions": "tell us more about yourself"}, {"date": "15 Nov 2021", "title": "Covid-19 Contact Tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "There was no interview for this position at the time I was hired. I Sent in my resume through a current employee and received an offer letter a few days later, which I accepted.", "Interview Questions": "Send a copy of your resume."}], [{"date": "26 Sept 2021", "title": "Project Manager, Grants Management & Compliance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "A phone call interview was conducted as the first step of the interview process. First the organization and the job were described and explained. I was then asked if I had any questions, which I asked at length - I had many. The questions were then made to me.", "Interview Questions": "An example was, how do I like to be managed. "}, {"date": "18 Aug 2021", "title": "Covid-19 Contact Tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Partners in Health (Boston, MA)", "Interview Descriptions": "The process included 2 phone calls. The first call was a screening and the second call was a more in depth conversation. The employees there were very friendly and easy to talk to.", "Interview Questions": "Name a time when you were faced with an upset customer and how did you deal with the situation? "}, {"date": "23 Jun 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "The interviewer forgot the interview and never apologized or explained what happened. It was a bizarre experience and made me rethink the organization's reputation.\n\nThe second attempt was fine and the interviewer set a tone saying the organization is a great place to work and they \"don't just hire anybody\" and why people have to prove themselves to even get past the first interview. It was all very odd.", "Interview Questions": "Tell us what you understand about the position"}, {"date": "31 May 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "I received a  technical test first，it is an Excel test，ask you to find some trend among the data.\nThen three rounds interview， each round has more than 1 interviewers. Finally round I met all the team members.", "Interview Questions": "Why you want to join us?"}, {"date": "19 Feb 2021", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "I had a phone screen with the hiring manager.  I didn't feel it went particularly well or poorly, but I didn't hear back from them. It was disappointing to not be given that courtesy, but I've heard that PIH likes to work people into the ground for a less than livable wage in Boston, so I'm not that disappointed.", "Interview Questions": "Previous experience's relevancy to the role"}, {"date": "10 Jan 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "Someone from HR reached out to me within a couple of days to schedule an interview. Though I was not offered to move forward, the interview process was quick and I was given feedback on my performance.", "Interview Questions": "Why Partners in Health? Why this position?"}, {"date": "4 Dec 2020", "title": "Public Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Partners in Health (New York, NY)", "Interview Descriptions": "Public  Health is the  process of  preventing  diseases and  viruses  from  spreading across the  globe,  the  responsibility of the  Heath practioner is to educates and  mobilizaed, the three kinds of  prevention,  which includes the  primary, secondary  and tertiary  prevention,  in order for human life to be safe.", "Interview Questions": "yes"}, {"date": "5 Apr 2021", "title": "Project Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Partners in Health (Boston, MA) in Oct 2020", "Interview Descriptions": "The Interview was short and simple since I was already working in a different capacity on the project. They asked me about my ability to manage time, communicate and think on my feet. The person who interviewed me was essentially looking for examples of my personalities through examples of these characteristics.", "Interview Questions": "1) Give an example of a time when you were able to empathise with a colleague."}, {"date": "22 Sept 2020", "title": "Policy Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "There was a quick turn around for this job. They were hoping to hire someone within one month of the job posting. There was only one interview (one-on-one) with the manager for the position.", "Interview Questions": "So, tell me about yourself..."}, {"date": "24 Aug 2020", "title": "Monitoring and Evaluation Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partners in Health (Tuxtla Gutiérrez) in Aug 2020", "Interview Descriptions": "Heard back within two weeks of applying. Sent a calendar to sign up for a time that worked best for me. The interviewer was very clear and nice. Followed up after the interview with why I was not selected. Overall, good experience even though an offer was not made.", "Interview Questions": "Standard questions, nothing out of the ordinary. "}], [{"date": "25 Jul 2020", "title": "Public Health Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partners in Health", "Interview Descriptions": "Had a 30 min phone interview with brief behavioral questions. Interviewer introduced them self and the company for the first 10 minutes. Left me at least 5 minutes for questions about the position.", "Interview Questions": "Tell me about yourself.\r\nHow do you handle pressure."}, {"date": "15 Jun 2020", "title": "Clinical Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Partners in Health (Boston, MA)", "Interview Descriptions": "The interview was a web/video interview. You applied online first. Then a link was sent to you from their recruiting service to complete the video interview. You had until the deadline to complete it that was provided in the email. You were alone in the interview and answered the questions that popped up on your screen with unlimited total time to redo them as many times as you wanted. Within 1 week a job offer was sent with an attachment to enter references who received an email to provide these.", "Interview Questions": "Describe a difficult experience and how you overcame it"}, {"date": "15 Jun 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partners in Health (Boston, MA) in May 2020", "Interview Descriptions": "I had an initial one with the manager for 40 mins, then two 30 min interviews with 2 staff members each and an assessment. Friendly staff, assessment was showing that you are able to write.", "Interview Questions": "How do you practice self care?"}, {"date": "20 Oct 2021", "title": "contact tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Partners in Health (Boston, MA) in Mar 2020", "Interview Descriptions": "One way interview done through talent boost. Option to redo certain interview questions, given 90 seconds to think about response before submitting videos. Overall 7 questions were asked. Response received less than a week later, no second interview needed.", "Interview Questions": "Explain a time when you had to deal with a difficult customer "}, {"date": "28 Jul 2019", "title": "Development Coordinator Donor Engagement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partners in Health (Boston, MA) in Jun 2019", "Interview Descriptions": "Initial 20 minute phone conversation with the Director followed by online communication. Received an offer for an in person interview in Boston, MA.\r\nIn person interview: Two 45 minute sessions (ten minute break between)  with two teams of two, followed by a written assessment. \r\nReceived decision about four weeks later.", "Interview Questions": "  What makes you interested in working with Partners in Health?"}, {"date": "3 May 2019", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "Three rounds of interviews with the reporting manager, and other senior members of the team. The whole process took about three weeks from start (submission of my application) to finish (decision).", "Interview Questions": "How would you correct a project that has gone off-track. "}, {"date": "11 May 2019", "title": "Director of Strategic Information Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partners in Health in Apr 2019", "Interview Descriptions": "I was contacted about an interview, never sent an invite, had to ask if the interview was still on, and then I had the interview. The HR person never said that it was a panel interview, started 15mins late, and never introduced who I was talking to. The interview was extremely rushed. They started late, left no time for questions, I had to ask who I was interviewing with, and the questions left no time for me to explain anything. It was only a rushed question-answer session, not an interview...and not professional by any means. Weeks later, I never heard back, even after numerous 'thank you' emails and the HR rep said that I didn't get the job. That's interesting since they never even got to know me or let me truly have a real interview. It was odd. Beware.", "Interview Questions": "What is M&E?"}, {"date": "28 Feb 2019", "title": "Prospect Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partners in Health in Jan 2019", "Interview Descriptions": "This interview was over the phone, cold staff member, not really friendly. The interviewer was cold-cut and to the point. Talking to the staff made me not want to apply for the job.", "Interview Questions": "What can you contribute to this position?"}, {"date": "8 Jan 2019", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partners in Health (Boston, MA) in Oct 2018", "Interview Descriptions": "Submitted my application online, and heard back quickly after about a week and a half/two weeks. After having the interview, they took longer then they said to get back to me confirming that I hadn't received the job, which I had assumed. The interviewer was very nice and made me feel comfortable throughout the process.", "Interview Questions": "How do you handle communication and scheduling?"}, {"date": "1 Apr 2019", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Partners in Health (Boston, MA) in Sept 2018", "Interview Descriptions": "It was a very thorough interview with employees from various levels participating in the interview. I went through 3 interview rounds. Focus is both on personality fit and skills.", "Interview Questions": "Given different tasks of equal priorities, how do you manage to complete on time?"}], [{"date": "14 Mar 2018", "title": "Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Partners in Health", "Interview Descriptions": "Long and drawn out interview process was somewhat a waste of time and effort, more than four months from application submission to assuming that the org had decided not to hire (never heard back). The process included 1) an HR screening interview interview followed two weeks later by 2) an interview with the hiring manager, then after three weeks was asked by HR to submit 3) writing samples, then one week later was asked to 4) complete a writing test, then after an additional week was invited 5) for a panel interview. After this long process radio silence, even after polite follow up emails, which seems to be a red flag. After investing the time to make the candidate jump through so many hoops, why would you ignore the candidate who simply wants a yes/no?", "Interview Questions": "Standard questions. Nothing out of the ordinary."}, {"date": "14 Dec 2017", "title": "Executive Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Partners in Health", "Interview Descriptions": "Two voice Skype interviews that had pretty standard questions.  The interviewers were passionate and enjoyable to talk to. HR is very slow on getting back to you, unclear on timing/logistics, or just doesn't respond to you altogether", "Interview Questions": "How can you apply your current experience and skills to this position?"}, {"date": "14 Apr 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "The position required one interview and the questions focused on prior teaching experience and working style. They were very friendly and interested in learning more about me and whether I would be a good fit for the organization and position.", "Interview Questions": "Can you tell us about your past teaching experiences? "}, {"date": "2 Mar 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Partners in Health", "Interview Descriptions": "One phone interview, two in person interviews - one with the team I worked with and one with the Director of the unit. They were trying to rapidly fill a position so this process went much faster than it usually does there.", "Interview Questions": "What vision do you have for a role? What is one example of a challenge you had when working with partners?"}, {"date": "1 Jul 2017", "title": "Manager, Grassroots Strategy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partners in Health (Boston, MA) in Mar 2017", "Interview Descriptions": "Phone interview followed by 3 man panel. Friendly panelists. Asked lots of questions about experience and meeting targets. Did not hear back till almost 2 months later! Very posh office located in downtown Boston. Liked the young upwardly mobile vibe of the office.", "Interview Questions": "How did you resolve challenges while executing a project?"}, {"date": "15 Oct 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Partners in Health (New York, NY)", "Interview Descriptions": "Worked with an external recruiter. The process took 4+ months. PIH is very disjointed, disorganized, and frankly, rude to candidates. I had interviews rescheduled several times at the last minute...like within 5 minutes of a call. When there was a confirmed call or face-to-face meeting, the PIH representative was 20-40 minutes late. The standard apology was that they were in another meeting with important and interesting people.\r\n\r\nGiven the work that PIH does, the level of dismissive elitism, coupled with the obvious white-only leadership, is disheartening and bodes poorly for the future of this organization.", "Interview Questions": "Why should we hire you?"}, {"date": "23 Aug 2016", "title": "Operations and Planning Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Partners in Health in Jul 2016", "Interview Descriptions": "PIH reached out to me within a week of submitting the application. I had one interview with an HR representative and another with the director of the program. Both interviewers were pleasant and professional. However, after the second interview, the director informed me that I made it to a third round of interviews and that I would be contacted within a week by the program manager. The program manager never reached out and, despite two follow up emails, I never heard back from the organization.", "Interview Questions": "Describe your budgeting experience. How many times have you construct a program budget?"}, {"date": "18 Sept 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Partners in Health in Jun 2016", "Interview Descriptions": "I applied online for a position at a field site and had an initial phone interview with someone from HR in Boston. She didn't seem to know much about the position, and wasn't able to answer some fairly basic questions, which made it sound like the details hadn't really been hammered out and/or she wasn't super aware of what was going on in the field. I was told I would hear back within two weeks; I never heard anything. Not cool. But what really gave me a bad impression was that, while I was applying for the job, I reached out to several people who I had worked with a few summers back while an intern at PIH. I found out that ALL of the 5-6 people on the team that I had interned on just 2 years ago had since left the organization. HUGE red flag. Even though my internship experience at PIH was super positive, I don't think I'll be applying to any jobs here ever again.", "Interview Questions": "N/A"}, {"date": "31 May 2015", "title": "Executive Assistant to Chief Financial Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partners in Health (Boston, MA) in Apr 2015", "Interview Descriptions": "I applied the position on PIH career website and received on-site interview just after one day. The workplace was busy and no one greeted me.I was interviewed by CFO per se but I did not think she reviewed my resume and cover letter in details. She asked me some questions about work performances.", "Interview Questions": "How do you find out this position? How do you improve the work efficiency? What are your strengths?"}], [{"date": "23 Feb 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Partners in Health (Boston, MA) in Nov 2014", "Interview Descriptions": "I was contacted by e-mail requesting a phone screening. I had a brief phone interview (45m) , after which I advanced to an in-person interview with 3 interviewers at the PIH office. The interview took about one hour. After 2 days I was informed by e-mail that I did not get the position.", "Interview Questions": "I was asked the \"standard\" interview questions, as well as questions designed to test my ability to work in a chaotic, changing environment."}, {"date": "20 Dec 2013", "title": "Chief Financial Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Partners in Health (Boston, MA)", "Interview Descriptions": "Prolonged and arduous", "Interview Questions": "Political inclination."}, {"date": "5 Feb 2014", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Partners in Health (Boston, MA) in Aug 2013", "Interview Descriptions": "I applied for a director-level position and interviewed with senior level staff.  I had two phone calls (one with the recruiter and the other with the hiring manager) and came to the office on two separate occasions to meet with a series of people. I sent thank you emails to every person, and patiently waited for a follow up.  After over a month of no contact, I asked for an update. Two weeks later I received an email from the recruiter saying they were having a hard time getting everyone's calendars in order to finalize the process.  That was the last contact with anyone one.  I never received *any* follow up with anyone to let me know if the position had been filled or that I was no longer being considered.  I even followed up twice with the recruiter.  Why is it that it is acceptable for organizations to not have the decency to get back to you after an interview?", "Interview Questions": "A mix of pre-determined behavior questions and general conversation"}, {"date": "25 Mar 2013", "title": "Director of Corporate and Foundation Relations Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Partners in Health", "Interview Descriptions": "I have never been through such a long and disorganized interviewing  process, with little regard for the prospective employee. I first spoke on the phone with an HR manager, then with a VP who did not seem to know much about my area of work. Then I met with the CFO who made me come at 8:30am but showed up at 9:00 am (I was standing in the street until he came). He did not seem to know what to ask me. Then I was asked to meet with 8 other people. I was never told by anyone that one of the persons I met with was actually the acting director for the position I was interviewed for. There were weeks of waiting in between these interviewing episodes with no feedback. Then I was asked to provide references, which, usually signals that you are going to have an offer. My references were stellar (per the HR manager).  Several weeks later she called to say that all was fine but also announced that they had 'just hired a new Chief Development Officer' who wanted to meet with me. I had not choice but to meet with him. His experience did not really match the CDO position he had just been hired for.  He could not answer any of my questions, but that did not stop him from being arrogant.  He never thanked me for meeting with him and I never heard from him again. The HR manager called me to ask me if I had any questions--they had made the decision of putting the position on hold but did not bother telling me.  Three months passed and I received an automatic e-mail saying that they had hired someone. \r\n\r\nMy impression, is that this is a chaotic, disorganized organization. It is characterized by big leadership gaps and bad internal communication. It is staffed b with young idealistic but naive and inexperienced employees. PIH was Boston's pet charity for a while, received lots of money during the Haiti earthquake but could not sustain the flow. If  you want to dream big, hope you can jump without a parachute without hurting yourself and earn a low salary, this is the place for you.  I am personally grateful that I did not join!", "Interview Questions": "The most difficult question was that they did not know what they wanted. "}, {"date": "4 May 2014", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 7 months. I interviewed at Partners in Health (Boston, MA) in Nov 2011", "Interview Descriptions": "Recruited, called in, meet with almost the whole staff. Lots of goofy questions and back and forth\r\n Months to get to offer. Ridiculous", "Interview Questions": "Use your imagination and tell us a story of what you will solve in terms of global health equity...its a finance/accounting position, folks."}, {"date": "6 Jan 2012", "title": "Production Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Partners in Health (Boston, MA) in Nov 2011", "Interview Descriptions": "I originally applied in late October 2011 via the company website. I had previously applied for more administrative positions and had not received any sort of communication either way. I received an email from an HR staff in early November, which arranged a phone interview for mid-November. The HR staff member was late in making their phone call, but it focused on the nature of the position and the department (Training), as well as my interests, experience, and skills. A week later I went to the office for an in-person interview. I met with the majority of the department at one time. The interview was very disorganized. Members of the team entered the room at random, and many questions and discussions were repeated. The interview lasted for about an hour and a half because of constant interruptions. I was not provided with any business cards, even when I asked. Following the interview, I emailed a thank-you note to my HR contact and ask that it be extended to the rest of the team. I received no response. Between the end of November and the beginning of January, I received only one email from the HR contact, even after repeated emails and phone calls inquiring about the status of the position and interview process. Ultimately, I did not hear from the HR contact before receiving an offer elsewhere.\r\n\r\nThe team members I spoke to seem very passionate, intelligent, busy, and hard-working. However, there is also a high amount of disorganization within and between teams. Many parts of this process were last-minute, late, or completely forgotten about. It is unfortunate because this organization does really valuable work abroad.", "Interview Questions": "What would you contribute better to this role and team than any other candidate?"}, {"date": "5 Mar 2015", "title": "Production Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Partners in Health in Nov 2011", "Interview Descriptions": "This consisted of a phone interview with an HR person and then an in-person interview with the production team (3 people at the time). The team and the HR person all seemed very excited about the prospect of hiring me. After the interview, I never heard anything from the HR person, even after repeatedly emailing (phone number was not provided). Interview questions were about prioritizing tasks, organizational skills/experience.", "Interview Questions": "How would you prioritize the following tasks (I don't remember the tasks)?"}]]