[[{"date": "22 Dec 2021", "title": "Student Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at College of Charleston", "Interview Descriptions": "It was a very easy process. I was recommended by an instructor. The person who conducted my interview was very nice and helpful. She asked about my academics along with my strengths and weaknesses.", "Interview Questions": "What qualities would you bring to this program?"}, {"date": "9 Oct 2021", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College of Charleston (Charleston, SC)", "Interview Descriptions": "The interview process for this role at CofC was very straight forward. I had to complete two required activity assignments related to the job duties. They were applicable to the job.", "Interview Questions": "Tell me more about your background"}, {"date": "31 Aug 2021", "title": "IT Helpdesk Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at College of Charleston", "Interview Descriptions": "The interview process was pretty easy and quick. The questions were more about you and your schedule. I was nervous and felt like my answers were not the best but I was still able to get the job.", "Interview Questions": "What is your schedule like?\nWhat were my strengths and weaknesses?"}, {"date": "28 Jul 2021", "title": "Data Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at College of Charleston", "Interview Descriptions": "very short and to the point - I had a feeling they already had a decision on me before we spoke. All questions were very cookie cutter and basic - not challenging but also didn't give me space to distinguish", "Interview Questions": "how do you fit into this position"}, {"date": "8 Sept 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at College of Charleston in Jul 2021", "Interview Descriptions": "I got the phone call and scheduled an interview. They asked few questions about my resume. After two months No Response. I sent a follow up email to ask the update or result. No Reply No Response.", "Interview Questions": "why are you attracted to this position?"}, {"date": "26 Oct 2022", "title": "Working Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at College of Charleston (Charleston, SC) in Jan 2021", "Interview Descriptions": "pretty straightforward and to the point, I would consider this to be easy and it was running through your resume. Only one person interviewed you and asked the questions. Took about 15 minutes.", "Interview Questions": "What leadership experience do you have?"}, {"date": "27 Aug 2018", "title": "Director, CRM Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at College of Charleston", "Interview Descriptions": "Strangest interview process I've ever been a part of.  2 months after applying, I receive an email that the position was still open, and they will be contacting me to discuss an interview. A week or so afterwards, I received an email, asking to schedule a time for a 15 minute phone interview. 15 minute interview?! That's barely enough time to have a quick discussion about the position itself, and my background. \r\nI proceeded and scheduled the interview, and was informed via email that it was a round table interview with a \"committee\". I was also supplied a list of thought provoking questions in preparation for the 15 minute interview.\r\nWhen the phone interview started, there was no introduction to the position, nor an opportunity to talk about my background, so they could get a sense of who I was and where I came from. Instead, each person fired off a generic question (tell us a time where you did this, tell me about your leadership style, etc). One after the other. Then after the last person had their question, the hiring manager closed the interview, basically shutting down any opportunity for me to ask a question, and indicating that if I had any questions about the position, I could send him an email. There was still even time left in the 15 minutes, but the interview was still \"shut down\" by the hiring manager.\r\nPlease realize that not only are you interviewing us, but we are interviewing you as well. The job posting was vague and generic from the beginning, so I would have assumed the first interview would be a general introduction to both the position and my qualifications. Afterwards, if it seemed like I was a good fit, and the position was a good fit for me,  we could schedule a round table interview (longer than 15 minutes).\r\nAll in all it was a very strange and ineffective interview process. Either they did not know how to effectively interview, or they already had a candidate in mind (and were using me as filler).", "Interview Questions": "What is your leadership style?"}, {"date": "4 Apr 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at College of Charleston (Charleston, SC) in Jul 2018", "Interview Descriptions": "It started with a phone interview with the director. The phone interview was mostly behavioral questions followed by a few technical questions. Then once you got approved you got a personal 1 on 1 interview.", "Interview Questions": "Why did you choose this program?"}, {"date": "6 Jun 2018", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at College of Charleston (Charleston, SC) in Jun 2018", "Interview Descriptions": "Slightly intimidating because of the presentation, but everyone was friendly and welcoming. The questions were fairly easy to answer. Be sure to demonstrate your knowledge and love for the College of Charleston.", "Interview Questions": "How do you handle conflict?"}, {"date": "22 Mar 2018", "title": "Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College of Charleston", "Interview Descriptions": "Interviewed by 2 Human Resources/Hiring employees, gave a tour of the facility, observed a technician. I had been to the campus before. The questions they asked  were not too hard hitting", "Interview Questions": "Strengths/Weakness (for all previous jobs held)"}], [{"date": "29 Apr 2022", "title": "Budget Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at College of Charleston (Charleston, SC) in Mar 2018", "Interview Descriptions": "Initially I sat down with a representative from HR and also the head of the Administrations office. The questions asked were of varying difficulty and mostly centered around rules of accounting and budgeting terms.", "Interview Questions": "They asked me if I knew how to use a vlookup in excel. "}, {"date": "23 Jan 2018", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at College of Charleston (Charleston, SC) in Nov 2017", "Interview Descriptions": "Interviewed in early November...1 hour interview with a panel of 5 employees. I was told they were making a decision that Friday. I didn't hear anything back until the end of January. I sent a thank you and a few follow up emails to the hiring manager and never even received a response that they were still reviewing applicants. All of my references were also contacted and were told I was a top candidate. Received an email that the position had been filled. Very impersonal process.", "Interview Questions": "Typical personality questions.. tell me about yourself, what can you bring to this position that others can't. "}, {"date": "13 Apr 2018", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at College of Charleston (Charleston, SC) in Aug 2017", "Interview Descriptions": "It was between the director and associate director. Lasted about an hour. very comfortable sitting area. Common interview questions were asked. Good conversation flow. Asked for references. Emailed me back saying I got the job.", "Interview Questions": "What experience do you have?"}, {"date": "9 Feb 2017", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College of Charleston (Charleston, SC) in May 2016", "Interview Descriptions": "Asked to give a presentation on topic of choice, 15 minutes, also was asked questions for 10/15 minutes by a group of staff members. Easy going, took place on campus, about 30 minutes total.", "Interview Questions": "Why do you want to work in higher education?"}, {"date": "27 Aug 2016", "title": "Assistant Director of Stewardship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at College of Charleston (Charleston, SC) in Feb 2016", "Interview Descriptions": "Application Online, Phone interview, in-person interview. The application is extensive at jobs.cofc.edu. Include resume, cover letter and personal references. During the phone interview, basic questions like strengths, weaknesses, and why should we hire you were asked. Even though I did not get the job, the interview process was simple and straightforward.", "Interview Questions": "Why should we hire you?"}, {"date": "27 Jul 2017", "title": "Budget Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at College of Charleston in Dec 2015", "Interview Descriptions": "The Dean and staff was very professional. The committee was clear on the job description and the responsibilities of the job. I felt comfortable and at ease during the interview process.", "Interview Questions": "How do you handle stress"}, {"date": "8 Aug 2015", "title": "Faculty Secretariat Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at College of Charleston (Charleston, SC) in Nov 2014", "Interview Descriptions": "There were two interviews, an initial and final interview.  The specifications seemed cut and dry but it took almost a month before I was offered the position.  I sat before a \"panel\" of sorts, which consisted of the 3 supervisors. They asked a series of questions that applied to the position and their expectations.  It turns out they had no real idea of their expectations or abilities to efficiently supervise the position as it had not been in the past.", "Interview Questions": "How would you handle a suggestion from one of the professors that was incorrect?"}, {"date": "19 May 2016", "title": "Gym Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at College of Charleston (Charleston, SC) in Apr 2014", "Interview Descriptions": "Very easy just said I wanted to work there and they gave me the job. Then I had to sign some paper work and wait until the fall semester to work there.", "Interview Questions": "N/A"}, {"date": "10 Dec 2013", "title": "Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College of Charleston (Charleston, SC)", "Interview Descriptions": "I submitted online and heard back within the week. The interview was about 10 questions long and mostly had to do with the specific tasks of the job.", "Interview Questions": "Most difficult question was what I would most like to change about the organization. "}, {"date": "3 Jun 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at College of Charleston (Charleston, SC) in May 2013", "Interview Descriptions": "Hiring process was forthright for the most part. I applied for the position in February, and was contact in May for a Skype interview. After the Skype interview, the flew me up for my in-person interview. About 2 and a half weeks later, I had an offer. I didn't find the interview itself incredibly taxing, and felt that having done my due-diligence in preparing, I absolutely nailed it.", "Interview Questions": "Tell us why you are a match for this position- provide data from your current position as evidence"}], [{"date": "8 Aug 2012", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at College of Charleston (Charleston, SC)", "Interview Descriptions": "I applied for this position and tried reaching out through the HR department two weeks after filling my application just being told my call/emails will be returned.  None of this happened until a full two months had passed and had gotten an email from an automated server saying that the postion had been filled.", "Interview Questions": "N/A"}, {"date": "10 Dec 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at College of Charleston (Charleston, SC) in May 2009", "Interview Descriptions": "Applied online, received a call to come interview.  The interview was a panel of various members of the department (3 plus the director/dept head).  It lasted 30 minutes and consisted of behavioral questions (tell me about a time when...).  They called back roughly 3 weeks later to offer me the job.", "Interview Questions": "What challenges do you think the College faces as a whole?"}]]