[[{"date": "25 Oct 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tarleton State University", "Interview Descriptions": "Interview was professional and enjoyable. Was asked pertinent questions related to research in a respectful manner. Interview lasted about an hour and was one of the best experiences I have had.", "Interview Questions": "What is your greatest strength "}, {"date": "6 Jun 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Tarleton State University (Stephenville, TX) in Oct 2021", "Interview Descriptions": "It was about four hours long. They were very team-oriented. First, I met with the manager, then the interview committee (stakeholders across campus), the actual team, and then again with the manager.", "Interview Questions": "Tell me a time you worked on a team to complete a project. What was your specific role? What were the specific outcomes related to your role?"}, {"date": "15 Jul 2021", "title": "Assistant Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tarleton State University (Stephenville, TX)", "Interview Descriptions": "First Interview over the phone with a panel, smooth everyone really friendly. More like a conversation. 2nd interview onsite, great experience, everyone really welcoming , warm, friendly, as conversation as well.", "Interview Questions": "Irate students, deadlines, priorities, experience with banner, reporting. "}, {"date": "15 Apr 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tarleton State University", "Interview Descriptions": "Group interview with four other people. They took turns asking different questions. The questions are below.  Afterwards, I received an offer within the same day.  They do not budge on salary from my experience.", "Interview Questions": "1.\tTell us about your background and describe how it has prepared you for this position:\n\n2.\tWhere would you like your career to be in five years and how will this position support your career goals?\n\n\n3.\tShare how your strengths will support you in this position. Everyone has areas they need to improve – describe an area that negatively impacted your performance in the past and talk about what you did to change it.\n\n4.\tTell us about a time you’ve had to handle conflict on the job. \n\n\n5.\tDescribe a time when you had to learn a new software program. What did you do to gain competency with the new program?\n\n6.\tWhat brings you the most satisfaction with your work?\n\n\n7.\tDescribe your supervisory experience. How has your experience prepared you to lead/supervise a team of student workers?\n\n8.\tHow would you go about establishing your credibility, quickly, with the team?\n\n\n9.\tYou had an opportunity to review the job description when you applied for the position. What tasks do you feel most prepared to tackle and what tasks would you need development in to excel in the position?\n\n10.\tHave you ever been on a team where someone wasn’t pulling their weight? How did you handle it?\n\n"}, {"date": "19 Apr 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Tarleton State University (Dallas, TX) in Feb 2021", "Interview Descriptions": "Interview was straight forward and more of an about me. My interviewers were polite and considerate and flexible. I was called by the manager and asked to come in for an interview.", "Interview Questions": "Tell me a little about yourself?"}, {"date": "22 Oct 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Tarleton State University (Stephenville, TX) in Oct 2017", "Interview Descriptions": "very straight forward and asked questions about advising.  I conducted a lot of research beforehand about advising to make sure I knew all of the key words.  overall, the interview was pretty easy.", "Interview Questions": "how do my handle my social interactions"}, {"date": "9 Jul 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Tarleton State University (Stephenville, TX) in May 2017", "Interview Descriptions": "The process was very straightforward, simply showing interest in conducting research was all that was needed.  Some potential requirements might involve taking classes associated with the research topic of each specific instructor.", "Interview Questions": "Would you like to conduct research?"}, {"date": "13 Jun 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tarleton State University in Mar 2017", "Interview Descriptions": "After several emails back and forth with the recruiter, a phone interview took place.\r\nDr. Crawford (the interviewer) clearly explained everything about the job and life in this city, asked several (easy) questions, and was happy to answer any questions.", "Interview Questions": "Where do you see yourself in the coming years?"}, {"date": "10 Oct 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Tarleton State University in Jan 2016", "Interview Descriptions": "Very straightforward and personable. Classic in-person interview process with HR.  The time between interview and hiring decision can vary. Background check is required. Because it is a state agency, much of the hiring process is very regimented, but that makes the process more transparent.", "Interview Questions": "What is a challenge you have overcome? "}, {"date": "26 Apr 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Tarleton State University (Stephenville, TX) in Apr 2015", "Interview Descriptions": "Phone Interview with Graduate Advisor of University.  Only one interview as it is a part time position for a graduate teaching assistant and/or research assitantship (not available any more)", "Interview Questions": "Research Experience"}], [{"date": "1 Feb 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tarleton State University (Stephenville, TX) in May 2014", "Interview Descriptions": "The interview atmosphere was surprisingly laid back. They put a lot of stock in the following question/scenario: \"Think back to a difficult customer service experience you've had. How did you deal with it?\" Also, they'll ask what you'd do if a student came to you saying they were failing. Try to avoid telling them to drop. Tell them to go to the advising center.", "Interview Questions": "\"Think back to a difficult customer service experience you've had. How did you deal with it?\""}, {"date": "23 Jul 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Tarleton State University (Stephenville, TX)", "Interview Descriptions": "I put in numerous applications but was finally called after a few months.  I was interviewed by 7 staff members and all their questions were focused on my experience & the job they are filling.  It was a great interview.", "Interview Questions": "N/A"}, {"date": "9 Oct 2015", "title": "Undergraduate Research Assistantship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Tarleton State University (Waco, TX) in Jun 2013", "Interview Descriptions": "I did not have an interview, I had to submit an application for the grant to Office of Student Research and Creative Activities which provides the position of research assistantship. The application was review by a panel who decided who would be accepted to receive a position as a research assistanship.", "Interview Questions": "There were no interview questions. I had to submit a grant application to Office of Student Research and Creative Activities at Tarleton State Univeristy. I was a senior student at the university and had to present a research project design that would gain the panels attention."}]]