[[{"date": "27 Aug 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Land Trust Alliance (Washington, DC) in Jan 2018", "Interview Descriptions": "The interview process was short and efficient. The HR Coordinator reached out to me for a phone interview within a week of my application being submitted. Those questions were straightforward and it lasted around 10 minutes. I then went in for an in-person interview, where I spoke with two department members. They asked a lot of communications-related questions and the interview lasted for about 30 minutes.", "Interview Questions": "What was a situation where you were not being clearly understood and how did you deal with that? "}, {"date": "14 Jul 2015", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Land Trust Alliance (Washington, DC) in Jun 2015", "Interview Descriptions": "Interview questions are specific and experiences targeted. It's not very difficult but you need to be responsive in a very short time. Interviewers were nice and concise. The whole process takes more than 30 mins", "Interview Questions": "Why are you interested in this position"}, {"date": "31 Jan 2014", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Land Trust Alliance (Washington, DC) in Jun 2010", "Interview Descriptions": "Generally, apply online though word of mouth can work too.  Candidates will speak with HR and possibly others on the phone before in person interview.  In person interviews are in depth and with candidates meet with several people.  Candidates can also expect to meet members and have more than one in person interview.  The hiring process can take awhile.", "Interview Questions": "Be familiar with all programs of the organization before applying.  Programs can be complex yet a basic understanding will be helpful during interview process."}], []]