[[{"date": "3 Mar 2023", "title": "Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hunterdon Health in Feb 2022", "Interview Descriptions": "This was a disorganized interview process and not every one was on the same page. Their lack of professionalism made me not interested in the position. I'm not sure if they were having an off day, but I definitely did not see them at their best", "Interview Questions": "What is your biggest weakness"}, {"date": "18 Nov 2021", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hunterdon Health", "Interview Descriptions": "The first interview is with the director and assistant director of pharmacy. The second interview is with a panel of current employees. You are asked.the typical interview questions. I heard back within a week.", "Interview Questions": "I was asked about my work history as well as why I thought I would make a good fit at the hospital and in the position I applied for."}, {"date": "29 Mar 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hunterdon Health", "Interview Descriptions": "The gentleman I spoke to on the phone was very kind, he explained everything in detail and allowed me to ask questions regarding the position. They were very flexible with arranging a date and time for an in person interview", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "21 Jan 2021", "title": "Senior Buyer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hunterdon Health in Oct 2020", "Interview Descriptions": "Contacted via email for interview. In person interview , very standard STAR interview questions.  Called 3 days later to offer the job.  The process was very quick.  From start to finish it took 1 week to get hired and another week to go through the HR process", "Interview Questions": "Standard interview questions.  More behavioral than about experience"}, {"date": "4 Mar 2021", "title": "Department Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hunterdon Health (Flemington, NJ) in Jul 2018", "Interview Descriptions": "Very organized, first round was with HR over the phone. Second interview was in person with hiring manager and 2 other secretaries. It was a group interview which I liked because I met everyone who I would be working with.", "Interview Questions": "Do you work well with a team."}, {"date": "9 Aug 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hunterdon Health (Flemington, NJ)", "Interview Descriptions": "I applied on online. Was called on the phone for a quick chat and then called in for an interview. I was called and offered the job - once I accepted I had 24 - 48 hours to complete a drug test and physical at the campus.", "Interview Questions": "Why are you interested in this field?"}, {"date": "7 Nov 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Hunterdon Health", "Interview Descriptions": "I applied online after seeing a few job openings that I qualified for. A few days later I received a phone call from the director on the floor asking to set up an interview. A couple days later I was interviewed by the director and another individual. The next day I received a phone call from HR with a job offer.", "Interview Questions": "What was one of your most difficult patient interactions? What made you get into nursing? Where do you see yourself in the future? "}, {"date": "15 May 2014", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Hunterdon Health (Flemington, NJ) in Mar 2014", "Interview Descriptions": "Received phone call with brief phone interview/sharing of job details one month after applying to job. 1:1 interview followed by meeting staff/potential coworkers. Friendly, laid back atmosphere.  Interviewer was very up front about expectations and opinion of my background and ability to fit in company.", "Interview Questions": "General questions about background, why I would be a good fit for position and what I was looking for in a job"}, {"date": "3 Nov 2013", "title": "Diet Clerk Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hunterdon Health", "Interview Descriptions": "Basic questions as any interview will ask.", "Interview Questions": "Typical interview questions"}, {"date": "16 Mar 2014", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Hunterdon Health (Flemington, NJ) in Apr 2010", "Interview Descriptions": "Application is tedious, but standard. Interview was smooth- standard: why are you a good fit for this job, experience, strengths/weaknesses,opportunity to ask questions, etc. I interviewed with my boss, then other staff members.", "Interview Questions": "N/A"}], [{"date": "13 Sept 2011", "title": "Nutrition Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Hunterdon Health (Flemington, NJ) in Aug 2009", "Interview Descriptions": "When I applied for the job I had to complete a personality test which I knew was standard on most jobs, but this test was way too long and asked questions that the answers could easily be misinterpreted. At the interview they reviewed all my answers with me and made me take a short answer personality test. I felt that they did not try to get to know me and my personal achievements, the only cared about my personality test.", "Interview Questions": "How do you act in a group"}]]