[[{"date": "30 Jun 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "It was an online/Zoom interview with three staff members. It was a round robin style questions style. There were approximately ten questions asked ranging from explaining knowledge/ experience to more specific job related questions.", "Interview Questions": "Describe a project/event that you were the primary organizer."}, {"date": "28 May 2023", "title": "Faculty Member Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "Online application Resume - cover letter Preliminary screening ( respond via video recording to prompted questions ) Teaching observation by a panel - online In person panel interview Email response exercise", "Interview Questions": "Past experiences, classroom experience, challenges, Teaching methodologies, philosophy etc.,"}, {"date": "18 Feb 2023", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "I spoke with the manager. He complimented me a lot. He then set up a testing process. It was a bit challenging, and the material I tutored was much different than what I was tested on.", "Interview Questions": "What was my college major?"}, {"date": "2 May 2023", "title": "Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northern Virginia Community College in Feb 2023", "Interview Descriptions": "HR emailed me to let me know I had made it to the shortlist. I had to record myself answering a few timed questions. The process is artificial, impersonal, and driven by convenience. It's not a good way to get to know a candidate.", "Interview Questions": "How would you support the school's mission? How do you support EDI?"}, {"date": "12 Apr 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Virginia Community College", "Interview Descriptions": "very good  ,not that hard if you like your job and enjoy teaching .\r\nThe college is very good place to go and work. and and the staff is very professional and nice", "Interview Questions": "How did you treat students?"}, {"date": "23 Mar 2023", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northern Virginia Community College in Mar 2022", "Interview Descriptions": "Panel interview with impromptu writing prompt, presentation college wide with question and answer session afterwards , interview with campus head- the whole process was over the course of a week", "Interview Questions": "What happened at your last job? Is there any other position that you would consider? How would you solve faculty in fighting, student cheating and low retention?"}, {"date": "28 Jun 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Northern Virginia Community College in Feb 2022", "Interview Descriptions": "A lengthy standard Virginia community college  state-based application form to fill out first.  Once you create an account the info is saved.  This is helpful if you apply for a position with VA Community College system in the future. Several rounds of interviews. Be prepared for a long time before offer is made.  The decision process is slow. Overall it was a positive experience.", "Interview Questions": "What is an example of a project and team you managed?  What was the outcome of the project?"}, {"date": "15 Dec 2021", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "Process took months. I applied in April 2021, was contacted in July 2021, and interviewed virtually with four people in August 2021. Never heard back from the company after. Very unprofessional to take so long and then ghost a candidate.", "Interview Questions": "N/A"}, {"date": "20 Oct 2021", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "Discussed position with faculty and they were really nice. Great job outlines and worked with my student schedule. I would definitely recommend working here. I enjoy the people and the job.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Apr 2022", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northern Virginia Community College (Woodbridge, VA) in Oct 2021", "Interview Descriptions": "Depends on the supervisor at the time, but this interview mostly regards a few technical topics and the service aspect of the job. Previous service experience plus a technical background would help.", "Interview Questions": "Name a situation where you had difficulties assiting someone and how you resolved it."}], [{"date": "10 Apr 2021", "title": "Parking Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "Easy interview asked very simple stuff. Why you want work here hours you wanted etc. Total interview took about 10 minutes. However they took very long to call me back took about a month or so", "Interview Questions": "Do you mind working outside"}, {"date": "22 Oct 2020", "title": "Technical Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "Fairly straight forward interview. 3 panelists ask various questions about your experience. I would recommend working with this company. They understand and know what they are doing. I am working as a technical support technician now.", "Interview Questions": "What are your biggest strengths in IT?"}, {"date": "14 Jun 2021", "title": "Call Center Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northern Virginia Community College (Annandale, VA) in Feb 2020", "Interview Descriptions": "Easy process. Applied and got an interview a few weeks late. Very professional. I think that the process was fair and easy. I did my interview in their call center office. It was a panel interview.", "Interview Questions": "How does your experience relate to the job?"}, {"date": "2 Sept 2021", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Northern Virginia Community College (Alexandria, VA) in Jan 2020", "Interview Descriptions": "Walk into the manager's office for the interview, where you are first asked questions about networking and computing, then later asked about your school schedule and your work availability for the semester.", "Interview Questions": "What are TCP and UDP?"}, {"date": "16 Mar 2022", "title": "Computer Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Virginia Community College (Alexandria, VA) in Dec 2019", "Interview Descriptions": "Set up a meeting with the manager. The manager brings you into his office and asks his interview questions. The interview was around 10 minutes. It's a 1 stage interview process.", "Interview Questions": "Here are a couple questions that were asked\r\n- The Employees IT experience\r\n- Knowledge on network protocols (TCP/IP)\r\n- General availability."}, {"date": "3 Mar 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northern Virginia Community College in Apr 2019", "Interview Descriptions": "Had a video interview with the department dean. Face to face after the preliminary interview and also got to meet a few other support staff, professors, etc. on campus. Great chance to see the campus even though teaching online.", "Interview Questions": "Experience teaching in a virtual environment; how to make courses engaging virtually."}, {"date": "10 Aug 2022", "title": "Call Center Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Virginia Community College (Annandale, VA) in Feb 2019", "Interview Descriptions": "A panel interview that was conducted in a very professional manner with subject experts from across the agency.  Everyone took their turn asking questions and following up on answers. Focus was placed on previous experience.", "Interview Questions": "Asked about previous call center experience. "}, {"date": "13 Oct 2018", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Northern Virginia Community College", "Interview Descriptions": "I received a generic email inviting me to a completely impersonal recorded video \"interview\". While I know it's the \"trend of the future\", it is an absolute turn off. It amounts to complete disrespect, and if an organization can't treat candidates with a small ounce of humanity, one can only assume that they treat their employees even worse.", "Interview Questions": "N/A"}, {"date": "24 Sept 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northern Virginia Community College", "Interview Descriptions": "The whole process can take up to 3 months from the time of submitting application to the time you being hired. State agency moves very slow so don't be surprise if you don't hear anything back", "Interview Questions": "education services related"}, {"date": "9 Aug 2018", "title": "Parking Finance Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Northern Virginia Community College (Fairfax, VA) in Jul 2018", "Interview Descriptions": "I applied online and received a phone call to schedule an interview time within two weeks of applying. The interview was very uncomfortable as it felt that neither of the interviewers actually wanted to be there. It consisted of about 8-10 questions, and took around 15 minutes. Neither interviewer shook my hand on the way out nor did they tell me when I could expect to hear anything from them (either positive or negative). One interviewer offered to walk me out but she just opened the office door and pointed me towards the main door and told me to exit that way. A week later I checked the application status online and that's how I figured out that I wouldn't hear back from them. The whole experience felt very unprofessional and I don't think I would have taken the job if offered.", "Interview Questions": "Describe a time when a positive relationship with your coworkers helped you be successful"}], [{"date": "14 May 2018", "title": "Police Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northern Virginia Community College (Annandale, VA)", "Interview Descriptions": "Interview began with introductions of myself, a LT, and the hiring manager. Then they took turns asking questions and I, in turn answered them. After that I asked my questions. Once all questions were asked you are given a paper with a question on it and you wrote down your written response to the question.", "Interview Questions": "Why do you want to become a Police Officer?"}, {"date": "12 Mar 2018", "title": "Education Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Northern Virginia Community College (Alexandria, VA)", "Interview Descriptions": "I applied online, and was contacted a few weeks later for an interview. The interview was over Skype and I had 4 people on my interview committee. The interview lasted about 45 minutes, and I was surprised that it was that short and there were no follow up interviews. HR contacted me within a week to begin the background check process, but I did not receive an offer for 2 months, with no contact during those 2 months.", "Interview Questions": "Describe a difficult situation."}, {"date": "28 Oct 2017", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Northern Virginia Community College (Springfield, VA) in Oct 2017", "Interview Descriptions": "Arrived to the campus and parking in the visitor lot.  Parking was covered.  Met with a panel (3 people) and they took turns asking me a series of questions.  They all took notes and in the end, asking me if I had any questions. Lasted about 25 minutes.", "Interview Questions": "If you could change 3 things at your current job, what would it be?"}, {"date": "28 Jul 2021", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Northern Virginia Community College in Mar 2017", "Interview Descriptions": "Fun questions were asked. Mostly about previous experience in being a librarian.  The employees were also nice to talk to. I enjoyed working at Northern Virginia Community College. I've had the best experience.", "Interview Questions": "What do you know about being a librarian?"}, {"date": "24 Feb 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northern Virginia Community College", "Interview Descriptions": "I applied through Human Resources but also sent emails to the deans of the relevant departments, probably six because there are six campuses. I think that was a critical part of the process, and all responded. I interviewed face to face at two campuses, was hired immediately at one and a bit later at another.", "Interview Questions": "How did you become interested in [particular academic field]? Which courses can you teach? What days/times are best for you to teach? I think we talked about which textbooks they/I used. It was more of a friendly conversation than a typical interview, but it covered the topics relevant to the job."}, {"date": "16 Dec 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Northern Virginia Community College", "Interview Descriptions": "The interview was really easy and enjoyable. The manager called me for a one on one interview, and then called me back a week or so later that they wanted to hire me. We talked about the pay, I agreed and was hired. Once hired, the paper work took a few weeks for me to actually get hired and go in for training.", "Interview Questions": "tell me a time when you had disagreement with a cowork and how did you go about it."}, {"date": "12 Sept 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Northern Virginia Community College (Woodbridge, VA) in Aug 2015", "Interview Descriptions": "The interview process was very simple,. I did a presentation for the committeeI  on a topic chosen by them. I was asked to submit a writing example answering a set of questions.", "Interview Questions": "Tell me a little bit about yourself."}, {"date": "7 Aug 2015", "title": "Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Northern Virginia Community College in May 2015", "Interview Descriptions": "I applied online for a newly created full-time faculty position.  Several weeks later, I received an email invitation for a video interview.  You set up your computer to use camera and microphone then access the interview within a 5-day window.  There are 5 video questions, and you have about 3 minutes to give a video response.  You get two attempts at each question.  This was not made clear (only that you would have multiple attempts).  If you want to preview a question then pause to compose a response, you only have one response attempt remaining.  I did not like the video interview because it is one-sided.  I feel that if I am going to invest myself in the process, I should get something back at every step, such as the ability to ask a question or get a feel for what kind of place it is.  I put some effort into the video interview, but I deliberately did not strive to present my best due to it being one-sided.  Several weeks later, I received an invitation to interview with the committee, and I was told that I would deliver a 15-minute lecture to students, and compose a writing sample.  The choices of interview dates and times was very narrow.  I was not available for any of the time slots, but I negotiated a different interview date by email.  Upon arrival, I had a 15 minute interview with an administrator, then I was taken to a classroom full of students and the committee, where I delivered my lecture.  The 15 minute limit was enforced strictly.  The students were dismissed and asked to prepare their evaluations, which they deposited outside the door while I was interviewing with the committee.  The actual interview was about average.  I would call it a positive experience.  The committee had members from three or four disciplines, and they seem like colleagues that I would want to work with.  At the conclusion of the interview, I was told that I would be contacted in a week, and I was escorted to the writing center where my writing prompt was waiting.  I was given a copy of my writing sample before I left.  I was never contacted, and now three months have gone by.  The position status is still pending, although the fall semester is about to begin in 2-3 weeks.  Six weeks after the interview, I contacted HR, and they said that I was still a candidate, and the matter was still in the hands of the committee.  Some committees are slow, and HR has no control over that, they said.  I think it is unprofessional for my contacts to leave me hanging for all of this time with no follow-up or explanation about the status.  I can only conclude that the administration is not serious about filling this position and that the institution probably has low regard for its faculty.", "Interview Questions": "What committee would you like to serve on?"}, {"date": "10 Apr 2015", "title": "Marketing Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Northern Virginia Community College", "Interview Descriptions": "Brief phone interview and then a panel interview where I had to make a presentation on marketing outreach. The process wasn't too bad but there were about six members on the panel.", "Interview Questions": "How would you market online learning to working adults?"}, {"date": "29 Oct 2015", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Northern Virginia Community College (Annandale, VA) in Feb 2015", "Interview Descriptions": "3 panel interviews, then dean, then Provost.intense!!! After the third interview, I wasn't sure I was up for anymore!! Watch body language and other cues. Not all campuses are the same, interview your interviewers, fit is always important. Put all the pieces together!!!", "Interview Questions": "Lots of questions specific to NOVA. You need to know NOVA's mission and if you don't have the institutional knowledge be prepared to explain how your experience will be valuable."}], [{"date": "14 Apr 2015", "title": "Business Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Northern Virginia Community College (Sterling, VA) in Jan 2015", "Interview Descriptions": "As it was, Mitchell and Sandy came to speak to me privately. I was asked if I would like to work for them and was given the job. To note, both Mitch and Sandy had both known me for a while and had absolute trust in me.", "Interview Questions": "What is your experience with Microsoft? Particularly with Word and Excel. "}, {"date": "23 Sept 2014", "title": "Administrative Assistant (Work-study Position) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "I submitted an application to the job online. A week later someone contacted me to set an interview appointment. They also emailed me. I arrived there on time, interviewers were very nice and welcoming, they didn't give me any hard time throughout the interview.", "Interview Questions": "Easy interview."}, {"date": "11 Sept 2014", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Northern Virginia Community College", "Interview Descriptions": "There is a hiring committee. Generally 2 rounds of interviews. Pretty predicable process with about 10 questions in the interview. Prep yourself and you should be fine. Everyone is nice and they send confirmation email with everything you need to know.", "Interview Questions": "None"}, {"date": "11 Aug 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northern Virginia Community College (Sterling, VA) in Jun 2014", "Interview Descriptions": "I only interviewed with the Assistant Dean. He was wonderful. It was more of a conversation than an interview. He wanted to know about my experience in the classroom and how I handled challenging students. We discussed the text book and how I would go about preparing lectures. He wanted to be sure that I was organized and ready on the first day. He provided lots of tools once I was hired.", "Interview Questions": "Asked about my teaching style and philosophy. "}, {"date": "3 Oct 2014", "title": "Web Designer/Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Northern Virginia Community College (Fairfax, VA) in Apr 2014", "Interview Descriptions": "Applied through their website and they have closing date for application. I received a call from NOVA and they scheduled an in-person interview. It was a 1:1 with the VP and panel interview. Questions more on recent experience and exposure to new and recent technologies. They made me comfortable, it was a panel of 7-8 people and then asked 13 questions. More on recent experience and website work samples. They sent an email after few days that I am not selected for the position. I called them asking for a feedback on my interview, they answered my call and said they wanted to see more work samples. It was a pleasant experience.", "Interview Questions": "N/A"}, {"date": "19 Sept 2013", "title": "Business Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Northern Virginia Community College", "Interview Descriptions": "Contacted for interview by HR 5 weeks after online application.  Was contacted during afternoon for interview during afternoon of the next day.  Interview team seemed confused about schedule and how to juggle applicants. Consequently crossed paths with previous applicant. Previous applicant and I were face to face. Interview started late.  Received rejection notice 11 weeks after interview.", "Interview Questions": "Panel interview; first question was asked by HR member of panel, what have you been doing since your last job.   "}, {"date": "5 Aug 2017", "title": "Help Desk Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northern Virginia Community College (Annandale, VA) in Aug 2013", "Interview Descriptions": "Three person panel asking questions about prior experience, IT experience and customer service. And then an individual interview with the manager. They are looking for a combination of technical skills and customer service.\r\n\r\nThis is an entry level position. They are looking for reliability, basic knowledge of the college culture and website. I would suggest you do a search on the website for things that the help desk is responsible for and learn about it. Like the mynova portal and other online web applications.", "Interview Questions": "What is your experience with ticketing systems?"}, {"date": "17 Jun 2017", "title": "Dean Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northern Virginia Community College (Manassas, VA) in Mar 2013", "Interview Descriptions": "Reasonably well organized, efficient, professional, instructions were clear and the questions asked relevant, individuals involved were appropriate and the expectations were straightforward. I felt comfortable and respected throughout the process", "Interview Questions": "How to past experiences relate to the current position"}, {"date": "7 Apr 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Northern Virginia Community College (Annandale, VA) in Jan 2013", "Interview Descriptions": "Referral from a friend. Met with supervisor the other day. Basically talked through my background, math knowledge, and ask me about schedule. After 1 week, I got the offer. The process is stress-free.", "Interview Questions": "N/A"}, {"date": "2 Aug 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Northern Virginia Community College (Annandale, VA) in Oct 2012", "Interview Descriptions": "This was for a position teaching introductory biology.  The assistant dean is both very friendly and knowledgeable, and she was very flexible.  Once she reviewed my qualifications, we went into some questions about why I wanted the job and what I expected from teaching.  She then gave me a tour of the campus.  It was all very laid back and informal, overall.", "Interview Questions": "N/A"}], [{"date": "31 Jul 2013", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Northern Virginia Community College (Alexandria, VA) in Aug 2012", "Interview Descriptions": "It is a long, annoying and very complicated proccess. You apply online, but you have to make sure you applied for financial aid first, and before you applied for FAFSA you have to have registered for selective service.. so it is a long trail to almost no where.", "Interview Questions": "N/A"}, {"date": "24 Jul 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 8+ months. I interviewed at Northern Virginia Community College (Woodbridge, VA) in Aug 2012", "Interview Descriptions": "Group interview with/presentation ;concentration on lecture skills.. Questions and points around actual discipline were confined to one person,  as she knew the subject matter. Not a useful execution of the .time allotted.", "Interview Questions": "Questions like style and standing during lecture during class."}, {"date": "5 Nov 2016", "title": "Workforce Development Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northern Virginia Community College (Annandale, VA) in Jun 2012", "Interview Descriptions": "Friendly. Panel had excellent question as well as good interviewing to clarify answers. The panel gave a good overview of the work environment. Had a phone interview before coming to the panel interview.", "Interview Questions": "Why do you want to work for us?"}, {"date": "12 Aug 2015", "title": "Work Study/Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Northern Virginia Community College (Alexandria, VA) in Sept 2011", "Interview Descriptions": "I was interviewed by the office Manager of the Liberal Art Division. I met with the Office Manager in his office where he described the receptionist position. He informed me that there may be a possibility of a second interview with the professor in charge of the  Art  department. Therefore, he asked me to meet with him a second time to introduce to me the professor that I will work for. The next day, I came back as scheduled and met the  professor. The Interview Process was beneficial to me and my employer.", "Interview Questions": "What are you study in NOVA?  Did you like to work with a large group of people and what other language did you speak?"}, {"date": "6 Sept 2013", "title": "HVAC Mechanic Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Northern Virginia Community College in Apr 2009", "Interview Descriptions": "The position involves working on boilers, chillers, commercial refrigeration equipment, computer cooling equipment and related work such as water chemistry and supervising subordinate trades workers as well as outside contractors. Questions ranged from refrigeration cycle questions to controls to types of equipment to supervisor-employee relations", "Interview Questions": "Was there ever a time when you disagreed with your boss?"}]]