[[{"date": "3 Jan 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Virginia Health System", "Interview Descriptions": "I had to apply through their portal, then I was contacted for multiple phone interviews and digital interviews with the team. They were decently responsive via email and the team that I met were very knowledgeable and professional.", "Interview Questions": "They asked about my work history and how it compares to the position they're looking to fill."}, {"date": "27 Oct 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Virginia Health System (Charlottesville, VA)", "Interview Descriptions": "Video call on Microsoft Teams, was not too complicated, mostly asked if I had any questions, described the schedule and how things would work, asked questions related to CNA duties", "Interview Questions": "Describe how you would take a manual blood pressure."}, {"date": "19 Dec 2021", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Virginia Health System", "Interview Descriptions": "Easy process; one phone interview and then three references contacted after the interview. Decently quick onboarding process for a virtual/remote position. Phone and/or zoom always used and rescheduling is easy", "Interview Questions": "What previous experiences have you had that would help you in this position?"}, {"date": "9 May 2021", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Virginia Health System", "Interview Descriptions": "Informative and welcoming; tour of the labs, resident areas, and hospital.   Spent a fair amount of time with the resident physicians and was able to ask any questions that came to mind.", "Interview Questions": "Why are you interested in our program?"}, {"date": "25 Jul 2021", "title": "Medical Education Program Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Virginia Health System in May 2021", "Interview Descriptions": "I was interviewed by 5 people in the surgery department, and all went quite well, or so I thought.  All the physicians responded positively to my post-interview thank you note. \nTwo weeks after my last interview,  I emailed my administrative POC in the surgery department.  No reply.  I e-mailed her again about a week later.  Still crickets.  I then went around her and e-mailed HR four weeks after my 5th interview  to ask my application status.  Then last week (8 weeks after my last interview), I see on my candidate profile page that I was \"not selected\" for that position.  Gee,  really?  I figured that out weeks ago.  To this day, I have yet to hear from anyone at the UVA Medical Center.  It would have been gracious for someone to have have the courtesy to tell me my status directly.  So  incredibly unprofessional.", "Interview Questions": "Behavioral and skill set based"}, {"date": "4 Mar 2021", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Virginia Health System", "Interview Descriptions": "Phone interview and then followed by group interview. The group interview is virtual with senior data scientists and the head of the analytic division. It took about a couple weeks to hear back.", "Interview Questions": "Do you have any experience with machine learning "}, {"date": "13 Apr 2021", "title": "PFA Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Virginia Health System in Feb 2021", "Interview Descriptions": "Interviewed with different levels of leadership (managers and directors). All low stress interviews, which were mostly conversational and employed behavioral questions rather than the traditional interview question format. The interviews were video. Spread out by a lot of time due to securing availability of all the staff I had to interview with, but everyone was accommodating and respectful.", "Interview Questions": "Tell us a time where you did not particularly like someone at your previous job and how do you foster and build relationships?"}, {"date": "15 Apr 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Virginia Health System", "Interview Descriptions": "Email from unit manager for unit specific interview. Attend an in person interview with manager, then got to change in scrubs and tour the unit. I could've stayed as long as I liked with an RN on the unit to get a feel of the work flow", "Interview Questions": "How do you handle conflict"}, {"date": "12 Apr 2020", "title": "Nurse Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Virginia Health System", "Interview Descriptions": "Interviewer seemed genuinely interested in getting to know prospective employees and was a great advocate for the staff and company. She had honest answers to all my questions and seemed to really enjoy her job. I get anxiety during job interviews and mixed some words up at one point, but the manager was understanding. The process lasted about 40 minutes including my questions. I appreciated the \"getting to know you\" intro and it seems like the managers cared a lot about the person behind the resume. Follow-up was quick and I heard back the next day.", "Interview Questions": "You take a blood pressure and it is 60/40 (don't remember the exact value, but very hypotensive). What is your next step?"}, {"date": "19 Dec 2019", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Virginia Health System (Charlottesville, VA) in Oct 2019", "Interview Descriptions": "Interview process was unnecessarily lengthy. In addition, the hiring manager was not communicative so I was left in the dark about the status of my candidacy the entire time. From the get-go, they had contacted me to set up an interview and then I didn't hear back for weeks.  Finally, I heard back to schedule a 3-hour panel interview with 4 different groups of people. The interview process was very long  with no break for lunch.  Upon arriving at each panel interview, each person from the panel asked a typical behavioral question. Behavioral questions are listed on HR's website but there are ~100 or so, so it's difficult to prep. Some of them were from left-field and did not really seem to apply to the position I had actually interviewed for. Also, the panelists barely asked me questions about whether I would be able to actually perform the job.  Finally I had the interview with the hiring manager who seemed frazzled and barely looked at me during the process.  He couldn't provide much information on follow-up, except that they were interviewing more people and if I didn't hear from him in a few weeks to get in contact with him. I never heard from him again, and after trying to contact him twice with no response assumed I did not get the job. I finally contacted HR who informed me the offer had been made to someone else.  Overall, the entire interview process was disorganized. Moreover, they treated me disrespectfully as I had to take off an entire day from work to drive out there and then couldn't even follow up afterwards about my status. In my opinion, it seems like they must have had an internal candidate and only interviewed me per policy requirements.   I just had an  interview with another company, and although a slow process, the HR reps communicated with me the entire way throughout the interview process. UVA Pharmacy could definitely improve their interviewing process and maintain transparency with the candidate throughout. I initially applied for the job in early September and found out I didn't get the job midway through November.", "Interview Questions": "Tell me about a time you faced a difficult situation at work and how did you deal with it. "}], [{"date": "14 Jun 2019", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Virginia Health System in Nov 2018", "Interview Descriptions": "This was a standard interview that asked my standard strengths/weaknesses, why did you want to work here, etc. Also asked for GPA, prior education and other professional/leadership opportunities. To best prepare, you can just look at common interview questions asked online. This was by far the best preparation I could have done to prepare.", "Interview Questions": "What is one time you made a mistake and what did you do about it?"}, {"date": "16 Apr 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Virginia Health System", "Interview Descriptions": "I got contacted about 2 weeks after initially applying. The HR recruiter coordinated several interviews on different units. Each interview was very laid back and the nurse managers provided information about the unit, patient population, and answered any questions I had.  Afterwards, I had the opportunity to shadow each unit.", "Interview Questions": "Tell me about an area for growth and improvement?"}, {"date": "4 May 2018", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 6 days. I interviewed at University of Virginia Health System (Altavista, VA) in Apr 2018", "Interview Descriptions": "I had a great experience throughout my interview. I was accompanied by the nurse manager and a RN. They were very friendly and made me feel comfortable. Once the interview was over the RN showed me around the office and made me feel like we were more of friends than strangers.", "Interview Questions": "They asked a number of “if x,y,z happened” or “ what would you” questions that were fairly easy to answer."}, {"date": "25 Jan 2018", "title": "Assistant Nurse Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Virginia Health System (Charlottesville, VA) in Oct 2017", "Interview Descriptions": "Initial Skype interview with nurse manager followed several weeks later by a day long on-site interview with various team members from Director of Nursing to Nurse Manger, to other ANMs to providers(NPs and MDs) and lunch meeting with staff. Travel expenses covered.", "Interview Questions": "The various groups of interviewers all had a list of usual questions to ask...team building, conflict resolution, time management etc."}, {"date": "4 Nov 2017", "title": "Pharmacy Technician (General) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Virginia Health System (Charlottesville, VA) in May 2017", "Interview Descriptions": "They bring you into a room with the pharmacy operations manager and 2 other tech's and ask you a panel of questions. Some are more difficult than others. Also, if you need time off...tell them at this point and MAKE SURE they write it down.", "Interview Questions": "How would you react to a major casualty event in the hospital? "}, {"date": "18 Nov 2016", "title": "Lab Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Virginia Health System (Charlottesville, VA) in May 2016", "Interview Descriptions": "It was a very casual sit down with the primary and secondary investigators. Although, this was a lab that I had volunteered a copious amount of my time in over three years of my undergraduate education, so we were very familiar with one another.", "Interview Questions": "Where do you see yourself in the near future"}, {"date": "18 Apr 2016", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at University of Virginia Health System (Charlottesville, VA) in Apr 2016", "Interview Descriptions": "Preliminary phone interview with HR.  Phone interview with Department Manager. Onsite panel interview with team. It was a very pleasant experience and I was impressed with the sincerity and team-approach attitude of everyone. While there is a certain rigidity to how I have to manage my day, this is a State owned facility and I guess it is to be expected.", "Interview Questions": "We discussed logjams they were having and how I addressed them at my prior position. Asked for ideas and input on build functions"}, {"date": "19 Jul 2018", "title": "ER Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Virginia Health System (Charlottesville, VA) in Jan 2016", "Interview Descriptions": "Phone interview then in person interview; questions discuss your background such as where you went to school and did your RN training then are behavioral type questions; Tell me about a time you failed; tell me about your strengths; tell me about your weaknesses; when would you be able to start work", "Interview Questions": "Very behavioral; Tell me about a time you had to deal with adversity and how that would translate into the ED environment"}, {"date": "11 Aug 2015", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Virginia Health System (Charlottesville, VA) in Jul 2015", "Interview Descriptions": "HR Recruiter contacted me less than an hour after I submitted my application.  Scheduled interview with Recruiter and Director of Recruitment. I thought I did well based on their body language but apparently not because they never got back to me.  I am an internal candidate that works in the same building as them and they did not even have the heart to let me know that I wasn't selected for the position. What a waste of time, and as soon as I get an offer elsewhere I will leave this organization. I even sent thank you letters and didn't even get a reply back for the questions I asked him in my thank you letter. After my application status stated \"Interview Scheduled\" for over a month, I am going to withdraw and move on.", "Interview Questions": "On a scale of 1-10 how would you rate your skills with Microsoft Word, Access, Excel?"}, {"date": "18 Jun 2015", "title": "IT Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Virginia Health System (Charlottesville, VA) in Dec 2014", "Interview Descriptions": "Applied and was contacted by a recruiter to set up a 3 hour onsite interview.  It seemed odd to me that they called me in for 3 hours of interviews based solely on my resume without so much as a phone screen.  On interview day, there were 3 hour long interviews, one from the hiring manager, one from a peer and one from two individuals who would report to this manager position.  Each of the three interviewers had a single Behavioral Interview question (i.e. tell me about a time you had a conflict with the team you were working with). The rest of the questions were related to previous work history and job fit.  \r\n\r\nThe interview was 3 hours long without a break.  Nobody offered so much as a cup of water during the process.  After the interview I followed up with the recruiter multiple times, but didn't get any real feedback from her for more than 3 months when I was told that I was not selected.  On interview day the hiring manager had told me that they were interviewing multiple candidates and would be making a hiring decision within a couple of weeks.", "Interview Questions": "Job fit, a couple of behavioral questions."}], [{"date": "4 Aug 2016", "title": "HIS ANALYST Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Virginia Health System (Charlottesville, VA) in Oct 2014", "Interview Descriptions": "It took about 2 months from when I applied to when I was done interviewing. There was an initial phone interview and then an in-person interview that consisted of two managers and a peer. Probably the easiest interview of all time. After the questions they gave me a department tour and sent me on my way. Took about three weeks after that to get my final offer. The job posting did list a salary range and I was shooting somewhere in the middle, but they would barely budge from the bottom line. Once I got in there, I found out other with less education were making significantly more than me and were offered that from the start, even though we had the exact same job.", "Interview Questions": "Tell us about a time when you had to resolve a conflict."}, {"date": "29 Jun 2014", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at University of Virginia Health System", "Interview Descriptions": "My current job was a promotion, so there was only a very informal interview.  Before that, I interviewed for a systems analyst position and the interview was fairly friendly and low stress.  Probably the easiest interview of my career and I was offered the job only a few days later.", "Interview Questions": "N/A"}, {"date": "25 Sept 2013", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Virginia Health System (Charlottesville, VA) in Aug 2013", "Interview Descriptions": "The interview was not intense but it also depends on the nurse managers. However, the Human Resources department is extremely inefficient. For me, it didn't take too long to go through the process but some of my colleagues waited for 3 weeks+ to process the paperworks after receiving the hiring paper. You really have to go to the HR and press them to get the process going.", "Interview Questions": "What would you do if you have a very rude patient?"}, {"date": "3 Mar 2017", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Virginia Health System (Charlottesville, VA) in Jun 2013", "Interview Descriptions": "The interview typically consist of a panel of Lead Technicians and management which ask specific questions relating to the job and gives you a scenario to determine how you would handle it.", "Interview Questions": "How would you deal with a difficult employee, manager or patient base upon a certain event."}, {"date": "12 Aug 2014", "title": "Call Center Resource Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Virginia Health System in Jan 2013", "Interview Descriptions": "Easy. Had a panel interview with a supervisor, manager, and office manager. They got to know me as an individual. I knew I had the job after meeting with them. \n\nDon't let this fancy title fool you: this is a phone operator job.", "Interview Questions": "How do you handle office gossip?"}, {"date": "6 Oct 2014", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Virginia Health System in Nov 2012", "Interview Descriptions": "The interview process was pretty good, but the follow up after was not.  The employer was very pushy to have me come interview as soon as possible.  I traveled 4 hours to the interview and interviewed from 8am to 4pm speaking with probably around 10-12 people.  I was told I interviewed very well and I would hear something from them within the week regarding next steps.  I sent thank yous to each of the 10-12 people I interviewed with.  I never heard from them regarding next steps so I called and left a message; Nobody returned my call.  I then waited another week or so and called again to have my call not returned yet again.  That's pretty poor follow up in my opinion, especially for someone they were so pushy to have come interview right away and led to believe everything went well and would be moving on to next steps.", "Interview Questions": "This was too long ago to remember the questions, but I don't remember them being that difficult. "}, {"date": "2 Sept 2010", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Virginia Health System (Charlottesville, VA) in Jun 2008", "Interview Descriptions": "The interview was short.  I was given a tour of the lab after the interview.  I was asked questions about my education, and my previous career.  There were no situation based questions, which was a relief.  I appreciated the fact that they did not use those behavioral questions.", "Interview Questions": "Where do you see yourself five years from now?"}]]