[[{"date": "5 Mar 2023", "title": "Residant Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at William & Mary", "Interview Descriptions": "The process was simple. It required a questionnaire and one in-person interview. The timeline was very clear from the beginning. I did have a difficult time finding the location of where I needed to go. The questions were pretty standard.", "Interview Questions": "What is your biggest weakness?"}, {"date": "2 Mar 2023", "title": "Graduate Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at William & Mary", "Interview Descriptions": "When interviewing for the position, I met with the Area Director; she mostly asked questions about conflict resolution. She also asked about how to build community through residential programs. It was only one interview with one individual.", "Interview Questions": "How would you resolve a conflict between roommates?"}, {"date": "31 Aug 2022", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at William & Mary in Jul 2022", "Interview Descriptions": "Zoom interview, they did not really have a difficult interview, but they do take forever to schedule and let you know if you get the job or not. I overall would try to avoid applying if possible. Very slow.", "Interview Questions": "How would you bring diversity to our organization? "}, {"date": "18 Aug 2021", "title": "Maintenance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at William & Mary", "Interview Descriptions": "The people interviewing where very friendly and had a bunch of well thought out questions ready to ask. It was a shame I didn't get the position but I will try again the next time it is available", "Interview Questions": "What is safe in this situation?\n"}, {"date": "24 Aug 2021", "title": "Employer Engagement Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at William & Mary (Williamsburg, VA) in Jun 2021", "Interview Descriptions": "The interview went good. I waited for a week for the decision to come. It was standard process with basic behavioral questions. It had questions about how you manage your time, coordinate your study and extracurriculars, and experience using technology.", "Interview Questions": "What was your technology experience?"}, {"date": "4 May 2021", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at William & Mary", "Interview Descriptions": "The interview was an asynchronous interview due to COVID and felt very impersonal.  I think that I could have related who I am to the employers so much better in a different format.", "Interview Questions": "“Tell me about the position for which you have applied and your understanding of the related responsibilities.  What is your motivation for applying?”"}, {"date": "10 Mar 2022", "title": "PR and Marketing Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at William & Mary (Williamsburg, VA) in May 2021", "Interview Descriptions": "Easy, 1-time interview with the manager of the department. Interview took 30 minutes, and the staff was very nice and accommodating. They were upfront about the job responsibilities, and the interview asked all of your basic interviewing questions, such as strengths and weaknesses, etc.", "Interview Questions": "What are your strengths and weaknesses, specifically within marketing?"}, {"date": "5 Mar 2021", "title": "Tribe Athletics Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at William & Mary", "Interview Descriptions": "I interviewed with the Director of Marketing and it was a fairly easy process. Obviously it was just for a part time internship to compliment a full slate of classes, so it wasn't a very prestigious job.", "Interview Questions": "What is one way you should improve the fan experience at home sporting events?"}, {"date": "4 Apr 2022", "title": "Resident Assistant (RA) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at William & Mary (Williamsburg, VA) in Feb 2021", "Interview Descriptions": "Use Pre-recorded questions and record your interview. You may re-record as many times as you like. Attempts are not seen, but they can view the number of times you tried. There are about 7 questions.  They use the BIG interview platform. You can view and review your submissions before sending them in. You must send them the email link, they will not count it if you just record your interviews.", "Interview Questions": "How do you define community?"}, {"date": "27 Sept 2020", "title": "Advancement Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at William & Mary", "Interview Descriptions": "Resume and cover letter then one virtual interview, applied online through their portal. Virtual interview was a panel of 5 who rotated asking questions. All questions where behavioral and pretty standard.", "Interview Questions": "Why do you want to work in advancement this summer? "}], [{"date": "27 Nov 2019", "title": "Info Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at William & Mary", "Interview Descriptions": "Had to fill out an online application which was pretty easy. They mad it fun such as what cartoon person would you be. Then you were chosen for an in person one on one interview.", "Interview Questions": "What is your proudest moment at William and Mary?"}, {"date": "16 Sept 2019", "title": "Event and Office Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at William & Mary (Washington, DC) in Sept 2019", "Interview Descriptions": "Pretty straightforward interviewed with a panel of around 5-6 at the Washington DC Center. Each person at the table went around and asked a question or two.  After the interview I didn’t hear anything back very close to a month. I checked twice with the interviewer to see if I was still in consideration. Only to receive a voicemail stating I didn’t get it and to follow up. I followed up and was informed that I was the initial candidate and that I was great etc. but wasn’t picked because someone with a year of experience working with William and Mary. To sum, I was an ideal choice but still didn’t receive an offer.", "Interview Questions": "Why this position? Background in higher education ? How would you go about planning an event?"}, {"date": "5 Oct 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at William & Mary (Williamsburg, VA) in Mar 2019", "Interview Descriptions": "I met with the professor and she asked me some questions about the position and why I wanted to be a research assistant. There really was not much to the process. I just met with her and talked.", "Interview Questions": "Tell me about you major in chemistry "}, {"date": "7 Aug 2020", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at William & Mary (Williamsburg, VA) in Feb 2019", "Interview Descriptions": "Online application and then one interview with program director. Very relaxed and more of a conversation about the role than anything else. It felt like they wanted to get to know my personality and if id be a good fit in the office.", "Interview Questions": "What is an initiative you could see implementing at the business school?"}, {"date": "25 Oct 2018", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at William & Mary", "Interview Descriptions": "Started with a 20 minute behavioral phone screen with the entire search committee. In person interview next. It was mostly behavioral but there was a 20 minute presentation and met with lots of different groups.", "Interview Questions": "Why W&M, Why Williamsburg."}, {"date": "20 Sept 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at William & Mary (Williamsburg, VA) in Jun 2018", "Interview Descriptions": "Submitted application on line;  contacted for a telephone interview, followed by an invitation to come to campus.  Most comfortable interview, informative, relaxed, included a tour; EXCEPTIONAL group of people.", "Interview Questions": "How do you manage your email?"}, {"date": "6 Jul 2019", "title": "Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at William & Mary (Williamsburg, VA) in Jun 2018", "Interview Descriptions": "Relaxed; panel sat around the table and while questions were asked, it was on a level of \"a conversation\".   The conversation was on getting to know me as well as for me to learn more about the job (beyond the description in the positing).  Great opportunity to learn and be introduced to a remarkable staff.", "Interview Questions": "Why are you the best person for the job?   Why should we hire you?  What is different about you that stands out from other candidates?  Why do you want this job; why apply for this position? "}, {"date": "9 Aug 2018", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at William & Mary (Williamsburg, VA) in May 2018", "Interview Descriptions": "Initial phone interview to review qualifications and the job. Second phone interview with 2 people...about 30 mins. I received a follow up with an offer within 2 days of the second interview. I felt they were very up front about expectations and job description, and salary.", "Interview Questions": "How would I apply my current knowledge and experience to the class?"}, {"date": "19 Mar 2018", "title": "Technology Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at William & Mary in Jan 2018", "Interview Descriptions": "Not very friendly, very onesided, not much direction. Would not recommend. The interview board was silent and did not give any feedback throughout the experience. They did not inform me of their decision until I asked for it days after the day they said they would get back to me.", "Interview Questions": "Why should we hire you?"}, {"date": "4 Nov 2017", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at William & Mary", "Interview Descriptions": "Skype interview with Midorri. She is really friendly and easygoing, making the interview feel like a daily conversation. The process is smooth and the questions are all at regular level.", "Interview Questions": "what's your five year goal"}], [{"date": "10 Oct 2017", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at William & Mary (Williamsburg, VA) in Sept 2017", "Interview Descriptions": "Phone interview scheduled first, then followed up by an in-person interview. In person interview conducted by committee's search team (4). Average interview. Personal work style questions as well as how to deal with difficult situations within the prospective role.", "Interview Questions": "How do you prioritize and manage deadlines?"}, {"date": "22 Sept 2017", "title": "Admissions Assistant & Office Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at William & Mary (Williamsburg, VA) in Jul 2017", "Interview Descriptions": "I received a phone interview offer one week after closing date, and after the phone interview I received an intensive in-person interview two weeks later. The interview consisted of several groups over the a couple hours. A week or so later, I was contacted saying a different finalist was selected.", "Interview Questions": "There was a required presentation on \"What makes you colorful?\" which was challenging, but easy to prepare for. The overall atmosphere and questioning was fairly comfortable all things considered though."}, {"date": "31 May 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at William & Mary", "Interview Descriptions": "Contacted me to schedule phone interview after applying. They called at exactly 2:30 to have interview. There were four people on the interview asking a series of questions. Not as nerve wrecking as I thought but I thought it was a little unusual to have that many people interviewing someone with the pay only being $13.22. Overall quick interview that lasted maybe 15 minutes. Asked basic interview questions. They didn't offer the job on the spot but I'm guessing they'll call or send an email letting me know whether they they want me or not.", "Interview Questions": "How do you handle a negative co worker?"}, {"date": "9 Jan 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at William & Mary (Williamsburg, VA) in Feb 2017", "Interview Descriptions": "I applied online on their school interface, where I had to make a username and password. II had to fill out an application, attach my resume, and answer a few questions specific to the position. About 3 weeks later I received a phone call, then in-person team interview. Approximately two weeks later I got an offer.", "Interview Questions": "What kind of experience do you have with social media? "}, {"date": "11 Apr 2016", "title": "Equity Specialist/Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4+ months. I interviewed at William & Mary (Williamsburg, VA) in Feb 2016", "Interview Descriptions": "I submitted my application on November 30 through their website. They contacted me on February 11 for a telephone interview on February 18. I interviewed by telephone for about 30 minutes. I was contacted on February 19 for an in person on campus interview for February 29. The originally wanted me to pay for the costs associated with travel - I declined. They agreed to reimburse costs, and I drove. Prior to arriving they made me write a  law school exam, complete with four questions - including an analysis of their policies,  which they didn't provide, and writing out an entire interview of a witness. I learned that the fact pattern was a current case.  My answer ended up being about 8 single spaced pages. They put me in a cheap hotel. I had a full day of interviews. I still haven't received reimbursement, and I learned today, April 11, I didn't get the position. I am fairly pissed to have been put through this obstacle course.  I think that if they are going to require writing assignments they ought to compensate your time for doing what is essentially work to help them.", "Interview Questions": "Why do you want to work at William and Mary?"}, {"date": "8 Jun 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at William & Mary (Williamsburg, VA) in Jan 2016", "Interview Descriptions": "Filled out an online application.  Had an in-person interview with an area director, and was notified of my placement online in February. There is no choice in location, whatever place you were put it you are stuck. Try to name drop places in interview.", "Interview Questions": "What does self-determination mean to you?"}, {"date": "28 Nov 2016", "title": "Applications Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at William & Mary (Williamsburg, VA) in Dec 2015", "Interview Descriptions": "The interview process is a bit arduous. The first interview was via phone with 3 people on the other end.  Mostly this interview was to determine my technical skills and experience.  While it was slightly overwhelming, everyone I interviewed with was very friendly and had a great sense of humor.  \r\n\r\nHaving passed the first round interview, I was given a simple programming challenge to complete in the next 7 days.  The programming assignment was somewhat complex but I was able to complete the assignment in a few hours. Having passed the programming assignment, I had a second interview, in person this time, which took most of a day.   \r\n\r\nFirst there was a panel interview with 8 panel members, 3 of whom had been on the phone interview. The panel was made up of people with whom I would work on a regular basis.  This interview did delve into my technical skills to some extent, but was more focused on my personality and how well I meshed with the team.  The panel interview lasted an hour and a half.  After the panel interview, I was given a tour of the facility and introduced to staff members in various departments. With the tour completed I had an opportunity to ask questions of the supervisor for the advertised position and the supervisor of the department.  Finally, I was taken to lunch at a fairly nice restaurant and had a lunch with many of the department heads.  There were some questions, but largely this was to determine my cultural fit.", "Interview Questions": "Who was the worst boss you ever worked for and why?"}, {"date": "11 Dec 2018", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at William & Mary (Williamsburg, VA) in Oct 2015", "Interview Descriptions": "Make sure that your statement of purpose is strong and I would recommend going to perspective student day to meet the professors. Sitting in on a class and reviewing the professors specialties is wow helpful as well.", "Interview Questions": "What specialization are you interested in for counseling? "}, {"date": "23 Jul 2015", "title": "Conference Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at William & Mary", "Interview Descriptions": "Phone interview with the committee- took about 30 minutes or so, in person interview with a committee, in person interview with department head, they called all three of my references and there was a background check prior to the offer being made. The process took over a month. Standard questions", "Interview Questions": "If we called your supervisor what would he or she say about you?"}, {"date": "6 Nov 2015", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at William & Mary (Williamsburg, VA) in Jul 2015", "Interview Descriptions": "I've thought about whether or not I should post a review for W&M's Advancement Office for quite some time. I didn't want to be labeled as just another person who had a bad experience and needs to vent to anyone who will read my review online so I feel somewhat relevant. Truth is, I have no problems with the College itself. I'm sure it's a great place and great people work there. But my experience during the interview process was something I never experienced before and felt like I needed this to serve as a \"hey, this could happen to you\" warning for others.\r\n\r\nI waited over 3 months before I was contacted for a phone interview after I initially applied for this position. After that, it was another couple of weeks before I got a call back with the \"Hey, we'd like you to come out and visit.\" I live 700 miles away from Williamsburg, so travel arrangements had to be made. \r\n\r\nThe first indication that this wasn't going as well as planned was when they asked me for dates and I gave them some that fit within both of our schedules. I also gave them dates when I would be unavailable (like, literally traveling and not just sitting in meetings at my job). The person I was in contact with came back and wanted to do it on a date that I said I was unavailable on. Once again, I had to clarify that I was not available on that date.\r\n\r\nWhen we finally settled on one, I asked if I could see the flight itinerary before it was booked. I wanted to make sure I could get the time off, make to the airport, get to Williamsburg with enough time to find my way around, etc. Over a week later I get an email saying my flights were booked with no explanation as to why I wasn't able to see them first. As I feared, the flights that were booked weren't accommodating, so I had to email and call back several times to talk to someone to get them fixed. While they ended up fixing them for me, it was only after the whole \"I don't know if we can because it costs just as much to change a flight as it was to book it.\" Well, why didn't you send me what you were thinking FIRST like I asked before we ran into this problem? This all happened only a few days before I was schedule to fly out (3 days I believe). I was ready to back out at this point. Such awful communication.\r\n\r\nFast forward to the actual interview. Everyone is very friendly when I arrive. I was scheduled to have lunch with about 4 people; people who I would only interview with/interact with during that time. These are people I would be working directly with if I was offered the job. I was told a few hours before lunch that they were now unable to do lunch anymore (all of them) because they had a project they needed to finish up before they left the next day. I was told I was on my own. I was also told I could take a tour of campus, but because my interview sessions in the morning ran late, I wasn't able to get to where I needed to be in time. So, I had over 3 hours of nothing to do before I needed to be back. \r\n\r\nThe rest of the day was fine, and everyone else I met throughout the day turned out to be very nice and professional. I thought.\r\n\r\nThis all happened in July. It's now November and I have yet to hear from someone there that I didn't get the job (I know I didn't because they posted the name of the person they hired on their website). What kind of organization goes to all the trouble of having you come out after screwing up your travel, blows you off for a scheduled lunch, and then doesn't bother to send a \"Thanks, but no thanks.\" email or make a phone call? Maybe it was because I asked them to put me on a flight that actually worked for me instead of one they decided would work and they had to spend more money to change my ticket when it could have all been avoided. But I think it's because of their unprofessionalism. I even followed-up with them a few weeks after my interview asking them if I could know what the status was and if they need any more information from me. All my attempts to hear back were ignored.\r\n\r\nHere's the thing: as interview candidates, we are expected to be professional and perform at our best. Only the best talent gets hired. But the way I felt after interviewing with William and Mary is the exact opposite. Very little follow through, an application/interview process that took nearly 8 months, and very little professionalism on their end, in the end. \r\n\r\nPerhaps my experience is an isolated one, but regardless of how good (or poorly) you interview, I believe an employer owes you, at the very least, some type of communication as to whether or not you will or will not be offered the job, especially if you were a finalist for a management-level position.", "Interview Questions": "What interests you about this position?"}], [{"date": "30 Dec 2015", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at William & Mary (Arlington, VA) in Jun 2015", "Interview Descriptions": "I was contacted via Email. All the process was done via email communication. Since the position I applied to was for the part-time adjunct position, I think it would have been done differently for other positions, such as full-time faculty.", "Interview Questions": "My availability for the position. Salary."}, {"date": "23 Jul 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at William & Mary (Williamsburg, VA) in Jun 2015", "Interview Descriptions": "The process started with a phone interview; a few days later I was invited to campus to meet the staff and spend time in the department.  The interview on campus was an entire day meeting with various groups connected with the position and within the department.  Quite a few questions, but it was the way in which they got to know me and I was able to get to know them.", "Interview Questions": "Typical questions; then the interview turned to just &#034;getting to know me&#034; and I was provided a tour of the department and was able to ask any questions of the staff.  Very comfortable and easy-going setting."}, {"date": "21 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at William & Mary (Williamsburg, VA) in Mar 2015", "Interview Descriptions": "I got an email saying that I was invited to an interview and I was given several time slots to choose from. I emailed the person back and set up an interview for the following week. It took place at Dean's office, and it was very low key. She asked me a few questions about my academic interests, and extracurricular interests, It was a relatively easygoing conversation for about half an hour. I was given an offer on the spot.", "Interview Questions": "Why do you want to become a tutor?"}, {"date": "17 Sept 2019", "title": "Senior Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at William & Mary (Williamsburg, VA) in Jan 2015", "Interview Descriptions": "The interview process was completely painless.  Everyone who works here is very friendly and kind.  HR does a wonderful job of explaining to you all the ins and outs as far as signing up for direct deposit, health benefits, retirement planning , etc.", "Interview Questions": "What are some of your strengths and are you able to handle many different tasks independently?"}, {"date": "12 Oct 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at William & Mary (Williamsburg, VA) in Nov 2014", "Interview Descriptions": "There was phone interview first with a committee of staff and faculty. After the phone interview, I was invited to campus. On campus, I met with a variety of staff, faculty and administrators. I had to present on a topic. Questions were mostly behavioral.", "Interview Questions": "Tell me about yourself."}, {"date": "28 Sept 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at William & Mary (Williamsburg, VA) in Feb 2014", "Interview Descriptions": "Overall questions fairly straightforward; the faculty I was interviewed by were warm and friendly; asked me a lot about my former experience; it took about two months from start to finish and I was pleased to have the opportunity", "Interview Questions": "Why do you think you would be a good fit for this position?\r\nAsked me about previous positions I had held"}, {"date": "17 Apr 2013", "title": "Development Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at William & Mary", "Interview Descriptions": "First I submitted an online application and cover letter. i received a call three months later about scheduling a phone interview. The phone interview lasted about 20 min and was with a three-member panel. All of the questions were behavioral. There weren't any questions about how I would communicate in writing.", "Interview Questions": "The most unexpected question was about working with difficult people. This was unexpected because this was a writing role that didn't apparently require a wealth of discussion between different offices."}, {"date": "29 Apr 2016", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at William & Mary (Williamsburg, VA) in Jan 2012", "Interview Descriptions": "I received a phone call about a week before asking me to come in for an interview.  Interviewed by department chairman and two faculty both from the department.  The interview lasted about 45 minutes.  I believe there were about six questions, all of which dealt with how I might teach a specific course.   I may have been offered a campus tour afterwards though it was a while ago and I don't specifically remember.  All in all, it was pretty straightforward.  They seemed to be in a bit of a rush during the interview process.  I was offered the job during the interview.  I was pleased with the experience overall and would recommend it.", "Interview Questions": "How would you teach a class in (this discipline)?  What books would you use, etc>"}, {"date": "24 Feb 2010", "title": "Games Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at William & Mary (Williamsburg, VA) in Oct 2009", "Interview Descriptions": "Really wasn't that bad, just a few interviewes. Culture is very important, as well as any responsibility tha tyou can show.", "Interview Questions": "Describe a time in which you were responsible."}, {"date": "22 Dec 2009", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at William & Mary (Williamsburg, VA) in Mar 2009", "Interview Descriptions": "Initial Phone interview with 2 members of search committee. Questions on basic understanding of the field, experience with students\r\n\r\nOn site consisted of 6 interviews all with multiple people and 1 with a group of students. The group interviews were with individuals that I would interact with across campus. The students were Seniors that interacted with the office.", "Interview Questions": "How would you counsel a MBA student that is looking to transition careers from another career area. "}], [{"date": "11 Jan 2010", "title": "Student Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at William & Mary (Williamsburg, VA) in Jul 2008", "Interview Descriptions": "Questions about why W&M instead of another institution.  Behavioral questions.  Standard questions. A couple of \"What would you do if a student....\" questions. Some student development theory questions.  Interview started with breakfast with a senior administrator, then met with a group of students, a group of student affairs professionals, the staff of the office where I wanted to work, a presentation  consisting of a sample workshop, some faculty, the job supervisor.  After a tour of the campus, dinner with the job supervisor.  A really long day.  Although the questions were all very standard, I think they were mostly looking for bubbly, bright, energetic, enthusiastic.  They also want to know that you think W&M is the best of all colleges.  Poor grammar is a no-no.", "Interview Questions": "How would you help a liberal arts student understand his/her potential?"}, {"date": "1 Apr 2010", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at William & Mary (Williamsburg, VA) in May 2008", "Interview Descriptions": "Very relaxed, simply a one on one meeting with a professor to determine your career goals and interest in the subject of research. If the professor has additional funding available, it is quite likely that he or she will take you on for training and interesting projects.", "Interview Questions": "Why would you like to be part of this research effort?"}]]