[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Very good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Mar 2021", "job_title": "Student Ambassador in Telford, England", "duration": "N/A", "pros": "Casual work, different events and varied work.", "cons": "Competitive booking for events, hard to get consistent work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Generally a great place to work but depends on your role and department", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 May 2019", "job_title": "Anonymous Employee in Telford, England", "duration": "N/A", "pros": "Wonderful location\r\nBeautiful grounds\r\nGreat facilities (gym, pool, restaurants)\r\nDiligent and hard-working staff (for the most part)\r\nGood working conditions\r\nGood pension options\r\nFlexibility of working for some staff depending on role\r\nPay rises each year (albeit small)", "cons": "Poor communication between departments and even internally within departments.\r\nLack of career progression due to low staff turnover and little to no funding for new roles unless the existing role becomes vacant.\r\nLow holiday entitlement for support staff.\r\nLaissez faire attitude of some middle and senior managers who in some cases have little to no operational input or management of their team or workload. This in turn leads to uneven distribution of workloads within departments leaving the competent, diligent staff to compensate for their incompetent colleagues.\r\nArrogance and apathy displayed by certain members of academic staff towards support staff in particular."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fabulous place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "27 Mar 2020", "job_title": "Professor in Edgmond, England", "duration": "N/A", "pros": "Harper has a  real sense of community among staff and students. There is a can-do attitude everywhere and I think that is why we do so well in so many different areas of our work.  There are always new projects and opportunities, and a great amount of freedom to pursue all sorts of different ideas. People are kind, the campus is beautiful and always feels safe, free parking is amazing and there is lots of scope for lunchtime walks. Great external reputation in teaching, research and specialist agri-food sectors. A growing number of international staff means that there is increasing diversity.", "cons": "Downsides include having a lot to do - as a small institution people often have a ‘big brief’ but this is also good because it keeps life interesting, sometimes a bit remote, but I like the trade off with the environment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "18 May 2020", "job_title": "Principal Lecturer in Newport, West Midlands, England", "duration": "N/A", "pros": "The size of the University means that you get to know everybody quickly and there are many opportunities for collaboration. \r\n\r\nThere is a lot of freedom to carry out your job, and many CPD opportunities.\r\n\r\nThe campus is compact, so the longest time it takes to walk from one teaching room to another is 15 minutes. The University estate offers lots of opportunities to relax and exercise. \r\n\r\nStaff:student interaction is excellent at Harper Adams too. \r\n\r\nGood support for both new and existing staff. \r\n\r\nThe University is good at recognizing, publicizing, and rewarding good and innovative practice.", "cons": "The University is in a rural setting. This may not suit somebody looking for a more urban environment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Avoid at all costs!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Sept 2020", "job_title": "Lecturer in Newport, West Midlands, England", "duration": "N/A", "pros": "It has a beautiful campus and some fascinating colleagues. There are decent facilities on campus such as a gym and multiple cafes and ample parking.", "cons": "Far too many to mention! Expect to work above and beyond your contract yet at minimum wage- do not raise to management as it will be ignored and suggested you volunteered to do this. Expect them to be reluctant to pay overtime. Also avoid whistle blowing on illegal activities as they will be ignored by management and then HR and you’ll be quietly ushered out the door. There is also little career progression if any. If it’s promised then it is more than likely a pipe dream to make you stay. Avoid at all costs for your own well being!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Harper Adams University - come and see for yourself!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "26 Mar 2020", "job_title": "Assistant Registrar (Validations and Accreditation) in Stoke-on-Trent, England", "duration": "N/A", "pros": "The 'Harper Spirit' running throughout the institution and putting students at the centre of all activities; can-do approach, friendly, supportive professional, highly qualified staff across the whole institution; availability of learning opportunities; beautiful environment", "cons": "Rail, road networks can sometimes be challenging; not always possible to find the time and opportunity for reflection within an extremely busy work schedule"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Feb 2017", "job_title": "Anonymous Employee in Shrewsbury, England", "duration": "N/A", "pros": "Surrounded by interesting and mostly very pleasant people, the location is peaceful and there are good facilities such as swimming pool in the summer and nice cafes for lunch.", "cons": "Sometimes it is hard to know what is going on and the senior management can seem a bit detached from the workforce. There are a couple of departments that I am very pleased that I don't work in as the managers seem fairly unpleasant."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at HAU", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "27 Mar 2020", "job_title": "Head of Department in Telford, England", "duration": "N/A", "pros": "The staff are a highly committed, passionate group of people who love what they do. They are a very friendly group and always willing to support each other and the students. They make going to work a real pleasure!\r\nIt is also a beautiful campus with open countryside all around where you can take a walk during breaks, relax in the sunshine, watch the wildlife and admire the planting on campus.", "cons": "I can't think of any!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Working @ Harper", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Oct 2016", "job_title": "Facilities Manager in Telford, England", "duration": "N/A", "pros": "great people, great location, variety of work, extremely busy", "cons": "extremely busy not enough time to stop and think/plan strategically"}], []]