[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Slightly Chaotic, Fun Place to Work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Mar 2023", "job_title": "Assistant Visitor Experience Manager in Edinburgh, Scotland", "duration": "N/A", "pros": "Working in proximity to animals Varied work, no two days the same Free entry for family Heavily discounted food and drink for staff Opinions are valued by senior management (even if they're not always acted on)", "cons": "Most departments are under resourced High expectations not enough time to do everything you need to do Poor internal comms (common in visitor attractions)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Animal keeper", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Oct 2022", "job_title": "Animal Keeper in Edinburgh, Scotland", "duration": "N/A", "pros": "Work with good colleagues, work with animals", "cons": "Low payment, not secure contracts"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good place if no career ambition", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Aug 2021", "job_title": "Admissions & Retail Assistant in Edinburgh, Scotland", "duration": "N/A", "pros": "Very flexible hours and good benefits", "cons": "There is no place for promotion"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Jul 2021", "job_title": "Visitor Experience in Edinburgh, Scotland", "duration": "N/A", "pros": "Good place to work, environnement, atmosphere, colleagues.", "cons": "Zero contract hours, salaries, lunch break"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The most toxic workplace I have ever had the misfortune of working in", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Dec 2020", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "The dedication of the keepers and team members at the bottom of the ladder.", "cons": "I worked at RZSS for several years and can honestly say it was the worst professional experience of my life. The management expect staff to put up with terrible wages and mistreatment because those of us who come to work here usually care a great deal about animals and conservation. The excuse of 'but we're a charity' is trotted out whenever the subjects of pay or training are raised, meanwhile the upper management, or ‘leadership team’, enjoy severely overinflated salaries while several staff members, including animal keepers, are forced to work second jobs just to make ends meet. Much smaller organisations in the third sector offer a rate of pay far higher than RZSS for comparable roles, it is for this reason that the available salary is never listed when the society is recruiting. They also claim to invest in their staff through training programmes and membership of professional bodies, however, throughout all my years here not one request I made for professional development was fulfilled.\r\n\r\nWhile being undervalued to this extent has a hugely detrimental impact, by far the most damaging aspect of working here is the toxic environment management have created. I lost count of the number of incidents of workplace bullying I witnessed; I also had the misfortune of being targeted directly towards the end of my tenure. The society has pushed out some incredibly talented people over the past few years, both highly respected individuals at the top of their field, and those at the start of their careers. Simply raising questions, attempting to improve things, or not fitting into one manager's own career plan is enough to put a target on your back.\r\n\r\nThere is little to no opportunity for progression at RZSS, and due to the low salaries on offer the quality of management is severely lacking. While these positions may attract high-quality candidates at the application stage, once the salary has been disclosed many drop out or refuse the job after interview. Several managerial positions are occupied by those who were third, fourth, or even fifth choice for their roles, and this lack of skill, talent, and knowledge has a hugely negative effect. Those at the bottom of the ladder are usually overworked and underappreciated attempting to make up for the shortcomings of those above them.\r\n\r\nNow in the wake of COVID-19 the organisation is making redundancies under the guise of saving money. However, the majority of these job losses are falling on the shoulders of the lowest-paid members of staff, including many animal keepers. New jobs have simultaneously been created and fully qualified individuals have been refused the opportunity to redeploy into them. Meanwhile, the overpaid leadership team have refused a temporary pay cut to help safeguard against these job losses. The sweeping cuts being made are not only impacting people's lives, they’re also having a detrimental effect on animal welfare and staff and visitor safety.\r\n\r\nIf I could offer one piece of advice it would simply be DO NOT WORK HERE. While going to work in a zoo might seem like a dream the reality is a very real nightmare. RZSS is a toxic organisation that does not stand by its core values, those in positions of power care more for their bank balance than the animals in their care. Seeing the effects of this up close is a heartbreaking experience you will not recover from."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful experience", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Nov 2020", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "The animal staff are heroes, as are many of the people working on the bottom rung of the society who never get remunerated, recognised or valued for their hard work.", "cons": "I was employed at this organisation for a considerable amount of time. Not only is the pay way below industry standard (they had to remove 'competitive salary' from job adverts because it was a lie), the environment is unbelievably toxic and, at times, downright bizarre. \r\n\r\nTo cut to the chase: it is without doubt one of the worst places I have ever worked. Skilled employees who have toiled tirelessly for the society for a very long time are still on salaries lower than one could get working in a coffee shop. There is next to no progression and, as a result of covid, the much-delayed and much-needed pay review has been postponed indefinitely. Redundancies have been made while those at the top (known as the leadership team) refuse to make any reduction to their over-inflated pay checks. Incompetence in management and middle management is rife, particularly in relation to the society’s outward presentation of itself. This is because the salaries are so low the organisation does not attract great candidates for managerial roles. If you take a job here, chances are you will be managed by someone who knows less than you, works less than you, but is paid double your wage for the hardship.\r\n\r\nThe society has deterred, punished and pushed out some incredibly intelligent and industrious members of the zoo community during my time here. It has been heart-breaking to watch and often the society will not send an email of acknowledgment or thanks when a long-standing member of staff leaves. Personally, I have received no pay rise, progression, training or recognition. I have left feeling less skilled, less confident and even a little traumatised by the experience. In short, if you are thinking about working here: don’t. If you do, be prepared to be paid peanuts and expected to be grateful for it. Also – never try to change anything, particularly not the toxic culture that benefits those at the top while the lower downs live in relative poverty. If I could go back in time and not work here, I would."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Poo", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Oct 2020", "job_title": "Poo Handler in Glasgow, Scotland", "duration": "N/A", "pros": "Poo, lots and lots of it", "cons": "Can be a bit smelly"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Lovely place to work, too many or too few hours", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2019", "job_title": "Visitor Experience Assistant in Edinburgh, Scotland", "duration": "N/A", "pros": "It is an amazing charity that funds and plays a key role in many conservation projects and it is therefore somewhere you can be really proud to work. They offer very flexible hours (both a blessing and a curse). The staff are all lovely and friendly", "cons": "In Winter or off-peak the hours are terrible if you're trying to make a living and in Summer you are worked until you drop. You're the first port of call for customers making silly complaints about there being no animals (despite there being hundreds of them) which can get exhausting by the end of Summer."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great job but low pay and poor management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Feb 2020", "job_title": "Education Officer in Edinburgh, Scotland", "duration": "N/A", "pros": "Fantastic team, great colleagues across the society, fun job, active, partly outdoors, meaningful work", "cons": "Low pay for what we did, did not feel valued by senior management."}], []]