[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great organization, mission, growing with opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "18 Sept 2015", "job_title": "Employee in Pittsburgh, PA", "duration": "N/A", "pros": "This organization has a unique mission for keeping the elderly independent.  This is not a nursing home or hospital and is extremely rewarding. Company continues to grow which is good but sometimes with growth comes challenges. Offers good pay and unbelievable benefits. Medical coverage is very cheap per pay, but only has $10 co pays and no deductibles. Been here for years and there is a commitment to providing benefits at good costs.", "cons": "No company is perfect, but seeing some reviews on here is not fair to the company. Everyone is committed to the mission and works hard to be a good employer. There are a lot of staff who have been employed for longer than 5 years, and lots of employees who have been offered promotions and advancement.  With growth, comes challenges and management development is needed. Managers at times are just too busy with the management of Participant care and staff can feel put to the side. Never see this at intentional and there are some great managers to work for."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "cool place", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Apr 2023", "job_title": "Patient Care Assistant (PCA) in Pitts, PA", "duration": "N/A", "pros": "i like the staff and residents", "cons": "none really, good pay for fast money"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Not worth it", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Mar 2023", "job_title": "Patient Care Assistant (PCA) in Greentree, PA", "duration": "N/A", "pros": "Participants are amazing. Good job on paper.", "cons": "Management sucks. Out of touch. Rude."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Extra Extra", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Oct 2022", "job_title": "Warehouse Manager in McKees Rocks, PA", "duration": "N/A", "pros": "Great benefits, decent pay and HR is very very helpful", "cons": "Communication between Co workers is also like pulling teeth without Novacaine!!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Awesome program on paper, execution is lacking", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Oct 2021", "job_title": "Certified Nursing Assistant CNA in Pittsburgh, PA", "duration": "N/A", "pros": "You will only be fired if you call off too much. The participants are mainly nice and fun to work with.", "cons": "Management is out of touch and absolutely too forceful with micromanagement. The most physically worked employees are paid the least and treated the worst. Expectations for workers are very high and barely communicated."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Used to be an awesome company to work for", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Oct 2021", "job_title": "Center Supervisor in Pittsburgh, PA", "duration": "N/A", "pros": "Benefits, Pay is fairly descent, participants(most), founders day, summer picnic.", "cons": "management, under staffed, over worked, cover multiple positions for one jobs position."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great Mission, Not a Great Place to Work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Nov 2015", "job_title": "Corporate Office in Pittsburgh, PA", "duration": "N/A", "pros": "The concept of this company is great. The idea of being able to help Senior Citizens maintain their independence is heart warming and makes you feel like you're making a difference.", "cons": "The Administrative staff is run by a nightmare clique of Directors/Managers who routinely degrade their employees. Employees are micro-manage, under-appreciated, and mistreated. Good performance is futile and goes unrecognized. \r\n\r\nThe clique of Directors/Managers do not like to integrate anyone new. The level of it all is quite ridiculous for grown adults. Any innovative processes a new talent might bring is quickly squelched by insecure Management. The narrow-minded clique perpetuates stagnation within the company’s potential to expand its mission.  \r\n\r\nManagement/Directors are unprofessional and unethical; making blatant lies and gossiping about their employees. Employee reviews are passed around to various staff members in an attempt to discredit them. I was shocked when a Manager began gossiping about one of her staff then proceeded to disclose to me how poorly the employee was performing. At one point, a Director accidentally sent an email to me that she had intended to send to a Manager; it was an email gossiping about me.\r\n\r\nOverall the administration in this company is very unprofessional and unethical. There are people in high level positions that simply do not understand how to respect their employees. Please consider the reviews for this company before accepting employment; there is a clear repetitive message being conveyed."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "S.O.S", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "4 Jun 2020", "job_title": "Registered Nurse in Pittsburgh, PA", "duration": "N/A", "pros": "I’ve spent many years with LP, most of them very happy. I enjoy job, love my profession and support the LIFE Pittsburgh mission in its entirety. This program has been amazing to hundreds of people. They have incredible, gifted, caring staff and an extraordinary CEO.", "cons": "Unfortunately I’m finding that the pro’s become overshadowed by the cons. The work environment has become extremely hostile to say to say to least. Interrogations and condescending conversation have replaced the once friendly work environment. Outgoing and helpful colleagues have become bitter and resentful. I’m watching the company that I love fall apart at the direction of a single person."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Heart-filling Opportunity to Make a Difference", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Sept 2015", "job_title": " in Pittsburgh, PA", "duration": "N/A", "pros": "The first time I walked into the building and saw the staff interacting with the participants - average age of 79-80, average of 7-8 chronic medical conditions, all paid for my medicare and medicaid, I was literally in tears.  I thought, I want to do whatever I have to in order to be in this environment. I have been a member of the management team, a group of about 40 people who gets together every month. Every single person in the organization has an opportunity to be heard. The CEO founded the organization about 15 years ago and she is a remarkable human being. Her door is always open to anyone at any level in the organization. This is a great way to make a difference with the people in the region who need it most.  The staff are wonderful and there is a real team environment. The participants are so very appreciative - to a person - that it makes going to work there (for me, at least), a true privilege.", "cons": "My biggest frustration is that, given that the organization is Medicare/Medicaid-based, there are quite a few things that the Centers for Medicare & Medicaid Services (CMS) needs to approve, and they are slow. Want to change a page on the website? It literally might take CMS up to 45 days to approve it. This, combined with the fact that it's a healthcare organization, means that most change moves slowly. As a can-do, impatient, results-oriented worker, initially this frustrated me to no end.  However, since I changed my expectations (too me about 6 months!), I no longer get upset by this."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Lack of management skills", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Aug 2019", "job_title": "Anonymous Employee in McKees Rocks, PA", "duration": "N/A", "pros": "participants  and employees are great to work with.", "cons": "Upper management does not follow the pace process as said, every participant is not treated equal.  Many medication errors, standard care doesn’t happen in timely manner. Unless you have family who push for ongoing comprehensive care , there is a delay in care. Managed by with no management background but rather became upper management due to being there for years."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst Place to Work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Aug 2015", "job_title": "Anonymous Employee in Pittsburgh, PA", "duration": "N/A", "pros": "Benefits (Health Insurance and Paid Time Off), Free Parking, Casual Dress Code. \r\n\r\nNon Director level employees were good, honest, hard working people", "cons": "Rated 1 star because if I left it blank you may think I skipped that part! \r\n\r\nI worked at the corporate office and it was a very unpleasant experience. I was micro managed beyond belief. Then when I would not micro manage my staff or write them up for the most silly mundane things I would be treated unfairly. This company really does look for any stupid reason to write someone up. I heard it said many of times to document everything we can so we have a case when we fire them. Basically you show up day one and they are already plotting a case against you. At one point I was working 12+ hour days and it still was never good enough. Nothing you could ever do was good enough. \r\n\r\nI repeatedly would hear conversations about prior employees and that \"they sucked\" or \"Well we were going to fire him/ her....\" These statements were untrue. It was all delusional so they could feel like nobody that was good would actually resign working there. \r\n\r\nOften times these reviews are biased, but I have read the other reviews posted for this company and they are spot on - I witnessed the same events by the same people mentioned. There is a small circle of people running that company and if you are not liked by them then you will be forced out - they will find a way. I witnessed people harassed and abused (mentally and physically) by Sr Management. One Director would lash out at staff and throw objects at them in disgust - YES, I witnessed that! \r\n\r\nIt is really a shame because this could be a wonderful place to work since it has a great mission. This was by far the worst place I have ever worked. I would never recommend this place to anyone. Best decision I made was quitting - I was begged to stay even though I later found out from former coworkers that I \"Sucked\".... Not surprising, as that was the story I always heard about anyone else who left."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Don’t waste your time", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Dec 2019", "job_title": "Driver in Greentree, PA", "duration": "N/A", "pros": "Benefits,pay, bond with participants", "cons": "Micromanaged, reprimanded for not being perfect, violation of privacy, exposed to infestation daily and treat employees like garbage. “At Will”  company they can fire you at any giving time without warning. The supervisors want you to be on call ."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Stay away if you care", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Sept 2017", "job_title": "Anonymous Employee in Pittsburgh, PA", "duration": "N/A", "pros": "Pay and benefits are only pluses. Great elderly people that need services but breaks your heart to see slipping services due to management greed/power trips. You do learn not to send family members there.", "cons": "Management only worried about money not people you are caring for. Then chase away great great employees time and time again. Upper management makes excuses as to why slipping services when forcing great employees out door is reason for slipping services."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Cna", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Sept 2018", "job_title": "Center Aide in Allegheny, PA", "duration": "N/A", "pros": "Benefits and life insurance", "cons": "Rude Nurses and Center Aides"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": "N/A", "review_title": "Company review", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Nov 2017", "job_title": "RN Case Manager in McKees Rocks, PA", "duration": "N/A", "pros": "Excellent patient care, I miss my patients", "cons": "Nothing that made me not take good care of my patients"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Don't", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Aug 2015", "job_title": "Administrative Assistant in Pittsburgh, PA", "duration": "N/A", "pros": "Working with the participants is very rewarding", "cons": "Thankless job with a clueless management team"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Stay away.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Mar 2017", "job_title": "Scheduling Associate in Pittsburgh, PA", "duration": "N/A", "pros": "Healthcare and that's about it.", "cons": "Everything. It's not even worth the interview."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "OVERWORKED", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Mar 2019", "job_title": "Transportation Assistant in Pittsburgh, PA", "duration": "N/A", "pros": "Vacation time and Benifits, most coworkers are good people.", "cons": "Disorganized and lack of communication greatly over micromanaged!!!!!!!!!!!"}]]