[[{"date": "24 Apr 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Rockefeller Foundation", "Interview Descriptions": "It is what you would expect, a round with HR and then a round with the team you’re applying to. Mostly behavioral questions and a lot of time to ask the interviewers about their careers and interests.", "Interview Questions": "Why Rockefeller? Why this team?"}, {"date": "14 Mar 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Feb 2023", "Interview Descriptions": "I applied in January and received an email offering a phone screening in February. They rescheduled the screening two times — each time it was last minute. Standard screening questions. After they asked about where I was in my internship search, I told them I had an offer that I needed to respond to within 3 weeks. They assured me they would get back to me the following week about whether I would move on to interviews. They also told me that they were planning on making a decision about who they would hire within two weeks. I followed up a week later expressing my continued interest. No response for 5 days after that and then I received an email declining me.", "Interview Questions": "Tell me about yourself, how will your experience help you in this role, can you give me an example of how you have been adaptable"}, {"date": "21 Jul 2022", "title": "Summer Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Rockefeller Foundation", "Interview Descriptions": "Straight forward questions, very relaxed and laid back conversation style interviews. 30-min HR interview and then 4 rounds of 30-min conversations with people on the team. HR interview felt the most rigorous and specific to the role. Team conversations felt more about assessing my mindset and relation to the work and assessing my general strenghts/interests.", "Interview Questions": "Why Rockefeller? Why this job? What would you do in this job-specific situation? What experience do you have in this area? What do you know about Rockefeller? What are you looking for on a team?"}, {"date": "30 Jun 2022", "title": "System Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Rockefeller Foundation (New York, NY) in Jun 2022", "Interview Descriptions": "Basic teams video chat meeting got to know the hiring manager. Only had 30 mins quite short I barley got to ask any questions by the time she was done explaining the role to me which is unfair.  Also didn't communicate that I was not selected had to ask someone else.  Quite unprofessional imo", "Interview Questions": "just \"tell me about yourself and your experience\""}, {"date": "4 Mar 2023", "title": "Team Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Mar 2022", "Interview Descriptions": "The interview process was very lengthy but seems unnecessary for a coordinator role. Took around 4-5 different interviews after HR to give out an offer. When they did offer, always a lowball offer with temporary positions and have to “wait” to be regularized with benefits after six months.", "Interview Questions": "Work Specific Questions mostly asked"}, {"date": "17 Mar 2021", "title": "Summer Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Rockefeller Foundation", "Interview Descriptions": "One phone interview. I applied for one team, but they interviewed me for another. Included general questions about my background, interest, and what I would contribute to their team. They followed up about 4 weeks later.", "Interview Questions": "Why do you want to work at The Rockefeller Foundation?"}, {"date": "8 Dec 2022", "title": "Internship Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Feb 2021", "Interview Descriptions": "Was a very brief screening call - recruiter was not warm or friendly or trying to get a real feel for the candidate. just wanted to ask the required questions and then immediately hang up.", "Interview Questions": "what skills do you have for this position"}, {"date": "2 Mar 2021", "title": "Summer Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Rockefeller Foundation in Jan 2021", "Interview Descriptions": "First round was a preliminary phone interview, which the recruiter rescheduled last-minute to the following week. Interview lasted about 30 minutes, questions were pretty standard. Sent two emails asking follow-up questions over the course of two weeks after the interview, with no response. Received a rejection email from the recruiter over a month after the interview.", "Interview Questions": "What are you looking to accomplish through this internship program?"}, {"date": "21 Sept 2020", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Rockefeller Foundation", "Interview Descriptions": "I participated in two rounds - a screener call with HR, and a Zoom interview with the Director of the department. Both conversations were really enjoyable, more conversational, with a lot of opportunity to demonstrate my strengths and ask questions. I was disappointed when I wasn't moved on to the next round, but the process was a positive experience on the whole.", "Interview Questions": "Why the Rockefeller Foundation? What about this department makes you want to work here? Tell us about your skills around policy, research, communications, project management."}, {"date": "26 Nov 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Rockefeller Foundation (New York, NY) in Jul 2019", "Interview Descriptions": "Don’t hold your breath for timeliness. I ended up taking another position to hear back after more than a month of silence after 3 interviews, asking if I was still interested. Job has been posted for 6 months now. Makes you wonder if the position is necessary. Obviously the organization will loose great candidates because of its inefficiency.  Just because you have a prestigious name doesn’t mean you can treat possible future employees with disrespect.", "Interview Questions": "Tell me about yourself (I know, rather clever question)."}], [{"date": "4 Jul 2019", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Apr 2019", "Interview Descriptions": "A telephone screening interview with human resources. Then back-to-back in-person interviews with three separate people. The interview process would have been more effective as a panel interview. Such that the applicant did not need to constantly repeat information or become burnt out toward the end.", "Interview Questions": "Conversational rather than structured or semi-structured in-person interviews"}, {"date": "25 Jul 2018", "title": "Fall Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Jul 2018", "Interview Descriptions": "Lots of behavioral questions during the phone interview. The one on one was very casual and resume-based, more of a conversation. Interviewer would describe organization and their missions/goals and you would have time to chime in about your past experiences.", "Interview Questions": "Which accomplishment are you most proud of?"}, {"date": "15 Aug 2017", "title": "Executive Assistant to the President Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at The Rockefeller Foundation (New York, NY) in Jul 2017", "Interview Descriptions": "Incredibly thorough process with recruiter and key members of the president's office team. A very transparent process that felt like a \"two-way street\" throughout. Asked to provide several concrete examples of how I responded in various scenarios and was given ample opportunity to ask questions", "Interview Questions": "Various \"tell us a time when\" questions "}, {"date": "14 Jun 2017", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Rockefeller Foundation", "Interview Descriptions": "The interview process was incredibly long and exhausting. While the interviews themselves were standard and professional, the entire process was completely disorganized. I invested quite a lot of time in preparing for the final assignment and presentation and did not receive an offer. From the onset, they had other priority needs and another candidate was a better fit. However, this lack of fit could have easily been identified from my resume or the first few rounds of interviews. My recommendation is to only request a final assignment and presentation from the first choice candidate so other candidates are not wasting their time. In addition, only the first choice candidate should be requested to come in for the final in-person interviews.", "Interview Questions": "Standard behavioral questions then industry specific questions. "}, {"date": "14 Sept 2017", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Rockefeller Foundation (New York, NY) in Sept 2016", "Interview Descriptions": "The experience felt extremely \"process oriented\" though quick.  Over the course of a few weeks the recruiter went silent despite multiple emails requesting a status update. Eventually, got a call months later stating the search had stopped for the position.", "Interview Questions": "What skills would make someone successful in this role?"}, {"date": "10 Dec 2016", "title": "Talent Experience Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Aug 2016", "Interview Descriptions": "2 phone interviews, 3 in-person interviews, 1 assignment, 1 final round in-person interview. The process was quick, I heard the result of each interview within 3 days of interviewing. It was a smooth process. I was able to get a good sense of the team and how I would fit in if I were to get the job.", "Interview Questions": "Tell me about a time you had to convince someone about your idea."}, {"date": "5 Feb 2016", "title": "Marketing Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Rockefeller Foundation (New York, NY) in Jan 2016", "Interview Descriptions": "Applied online, then they contacted me for a phone screening. The HR woman told me she was fairly new to the Foundation. She had sort of sour attitude and it really felt like the conversation was just annoying to her and that she would rather be doing anything else but that. \r\n\r\nExtremely negative questions asked, so much so that I was really taken aback. \"\r\n\r\n\"Tell me about the time you failed on a major project at work and how you dealt with it?\r\n\"How do you deal with negative people?\"\r\n\"Can you think of two times when you didn't succeed at something you worked on for a long time?\"\r\n\"What qualities do yo think you need improving on?\"\r\n\r\nJeez. I think I dodged a bullet by not having them call me back. Just a terrible interviewer.", "Interview Questions": "\"What qualities do yo think you need improving on?\""}, {"date": "22 Mar 2016", "title": "Accounting Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Rockefeller Foundation (New York, NY) in Nov 2015", "Interview Descriptions": "took one week, the interview was 1 to 1 and very basic. behavioral questions mainly. the interview took about 20 minutes and interviewer seems to be very certain about having me, yet they declined me after 1 week.", "Interview Questions": "what did u do at ...firm(last internship)? do u need H1B visa etc."}, {"date": "13 Jul 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at The Rockefeller Foundation in Nov 2015", "Interview Descriptions": "I interviewed several times via Skype and also in person, all within a 7-10 day period. I was applying from out of state while already employed, so this required a significant amount of effort. It was very concentrated and fast-paced. In the end, HR didn't reach out to me to tell me I wasn't selected. I had to email several times to elicit a response. I found that quite unprofessional given how much was asked of me during the interview and how responsive I was.", "Interview Questions": "I remember that the HR screening interview was pretty non-traditional. Lots of open-ended, behavioral questions. "}, {"date": "4 Sept 2015", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Rockefeller Foundation (New York, NY) in May 2015", "Interview Descriptions": "Submitted an application online. Hiring manager followed up requesting to set times with each of the team members, and for the initial phone screen. 2 weeks later had an international Skype interview, which was pleasant overall and just gave a general background on the team. The second Skype interview, however, was THE WORST INTERVIEW EXPERIENCE OF MY LIFE. The interviewer got offended when I asked about projects they would like to see in the future in the department, saying that they \"didn't have a fiefdom\" and it wasn't up to them to decide what came next. It completely rattled me that the answer was so aggressive and unprofessional after a completely standard question, and it was hard to bounce back after that. I got the overall sense that the interview was interfering with something more important. After the interview I searched for company reviews and was shocked to see the word \"fiefdom\" come up. I have never heard this word used in passing, so this must be a term that is used often in the office -- and this is not a good sign. Needless to say, I was quite worried moving forward. \r\n\r\nThe third interview went off without a hitch, just the standard interview questions that I was asked in the first Skype interview. The fourth Skype interviewer no-showed, and when I followed up with the hiring manager they said it would not be rescheduled (and I was never offered an explanation or apology). Then a week later they followed up to reschedule the interview with the fourth interviewer (who was actually quite friendly in the end). The last interview was in the Rockefeller offices with the first interviewer, and I was given a tour of the offices. I was not notified of the final decision until months after the date I was told in the last interview. I have always wanted to work at RF, but this experience has completely turned me off from ever applying again. \r\n\r\nI completely agree with a previous interview review: The immediate demands of the position were not clear from the job description, and they were never fully explained during the interview process so it made it impossible to explain your added value to the team. Even after 5 interviews I was struggling to understand the role of the Associate in the team.\r\n\r\nAdvice for management: Multiple interviewers discussed Rockefeller Foundation's struggle to find legitimacy in an increasingly competitive non-profit space (with players like Gates and Clinton, both of which have much larger reaches/budgets). This needs to be figured out immediately, and a discussion needs to happen with senior management/anyone who interviews prospectives so that appropriate answers can be given. People are interviewing with you because they are looking for somewhere exciting to work, and because you have a century-old track record of doing important work. For an experienced interviewee looking for a solid next step, it is not reassuring to speak with team members who cannot tell you about future projects/plans. When you invest in new/junior staff, this is when you will truly succeed. Innovation is key. It is ok to have a tough interview process, but it should always be friendly and professional. The best and brightest are flocking to Gates and Clinton Foundations because they are doing both of these things. Also, hiring should not be outsourced -- your point of first contact should be impeccably professional and fully invested in building a positive workplace.", "Interview Questions": "Where do you see yourself in the next 10 years?"}], [{"date": "21 Jun 2015", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Rockefeller Foundation (Nairobi) in May 2015", "Interview Descriptions": "Shortlisted candidates were interviewed by a panel of three people. Interview was well structured. Next interview for those who made it was with Country Director which was one hour. Did not have any test to be done. Document /  Certificates were asked", "Interview Questions": "How does your experience in your current role allow you to be and ideal candidate for this role"}, {"date": "20 May 2015", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Mar 2015", "Interview Descriptions": "Submitted an application online. Hiring manager followed up requesting a writing sample. 4 weeks later had an international skype interview. Questions were standard and interviewer very pleasant. The immediate demands of the position, however, were not clear from the job description. The Foundation's needs appear to be somewhat cyclical, so be sure to ask what the immediate needs of the hiring team are.", "Interview Questions": "Can you describe a time when you had to follow orders/accept the decision of a senior authority?"}, {"date": "3 Jul 2014", "title": "Intern Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Rockefeller Foundation (New York, NY)", "Interview Descriptions": "Filled out the application, a few days later was contacted by hr she was very nice and we maintain correspondence . I went in for my first interview and it went well then there is a final interview when you are selected. It a biographical interview then resume based.", "Interview Questions": "N/A"}, {"date": "6 Feb 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Jan 2014", "Interview Descriptions": "After a brief interview with HR, you enter a series of meet and greets with various Directors and Associate Directors.  It feels like a culture interview as well as a technical one.   Overall, everyone is very friendly and professional.", "Interview Questions": "What is your greatest weakness?"}, {"date": "29 Oct 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Rockefeller Foundation in Sept 2013", "Interview Descriptions": "The interview process was thorough but exhausting (and a little dispiriting, truth be told). Five rounds of interviews with ten different people over the course of a month. After the fifth round, I was convinced I wouldn't get the job. A week later, however, they called and offered it to me.", "Interview Questions": "I honestly don't remember. There were tons of questions."}, {"date": "8 Dec 2015", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at The Rockefeller Foundation (New York, NY) in May 2013", "Interview Descriptions": "phone interview.  We discussed mutual colleagues, and experiences.  We discussed the job and the work the organization does and what it might do in the future.  What kinds of qualifications would lead to success in the job.  And we discussed in detail my work history and experiences, with focus on what was successful and what lessons I drew from that.  How I see the field going forward and what challenges are emerging.", "Interview Questions": "tell me about your experience"}, {"date": "29 Mar 2016", "title": "Writer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at The Rockefeller Foundation (New York, NY) in Nov 2012", "Interview Descriptions": "I was initially contacted by a HR Manager, who turned out to be an interim hire. That interview went well, and led to four further interviews, all scheduled on different days, with my immediate supervisor, a VP, and an Associate Director. A second HR interview was also part of the process. I came in second, but was not notified; I found out by looking online. While each interview was professional, the overall process was mismanaged.", "Interview Questions": "What are my weaknesses?"}, {"date": "6 Sept 2012", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Rockefeller Foundation (New York, NY)", "Interview Descriptions": "I was called for an interview after submitting my resume. First round interview was with HR associate, who was pleasant and asked standard questions regarding previous work experience and why I was interested in the position.", "Interview Questions": "Tell me about a time when you used humor when faced with a challenging situation."}, {"date": "22 Nov 2015", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Rockefeller Foundation (New York, NY) in Feb 2012", "Interview Descriptions": "The process was long, meticulous, and involved several in-person and phone conversations with a variety of individuals. Often the interviews involved one individual, follow-ups were more group oriented and included several others with staff members of different departments.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Jul 2011", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at The Rockefeller Foundation (New York, NY) in Jun 2011", "Interview Descriptions": "Upon arriving the first step was to fill out a detailed application form including previous job details and salaries and reference information. Thought it was strange that they also asked for your requested salary when salary was something that had not been discussed at all yet. Then has interview with HR person followed by program staff. Overall everyone was very professional.", "Interview Questions": "Describe your career goals?"}], [{"date": "19 Oct 2014", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Rockefeller Foundation in Jul 2010", "Interview Descriptions": "a straightforward process with a panel interview on relevant experiences.  I met 4 staff. Questions were thought provoking. There was also a screening phone call prior to the interview. Overall, the staff were friendly and professional.", "Interview Questions": "How would you have dealt with a situation in your previous employment differently?"}]]