[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great organisation making a real difference for animals", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Oct 2022", "job_title": "Finance Manager in London, England", "duration": "N/A", "pros": "Huge progress made on focusing the strategy, resources available for implementation, motivated competent people", "cons": "Some legacy issues from previous strategy and leadership"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Flexibility and trust makes up for lower pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 May 2023", "job_title": "Operational Support Manager in London, England", "duration": "N/A", "pros": "Leaders truly care. The flexibility that is trust-based (built with your manager) Forward-thinking Individual and well-being focused", "cons": "Low level of pay (supposed to be mid-market rate, but it doesn't feel like it) Slow and cumbersome processes"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Great company", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Jan 2023", "job_title": "Senior Wordpress Developer in London, England", "duration": "N/A", "pros": "Great staff and great rewarding work", "cons": "Under resourced and hard to get funding"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid and pls make donations somewhere else or these would end up in senior managers' salaries", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Can't think of any. Very little money goes to animals it is upsetting", "cons": "Dysfunctional place with poor leadership resulting in low morale.  A lot of talking but no actions. HR listening a lot but not doing anything about bullies. They think flexible working is the answer to everything and will balance out the poor working environment and unfair pay treatment. Promises have been made since 2019 to address pay but nothing's been done."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Really passionate place, but problems not dealt with", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Apr 2021", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "Most of the staff are passionate, friendly and great to work with, a lot of team players, a lot of socializing at lunch time / after work. Everyone working towards a good cause.", "cons": "There are staff that don't behave well continually and its not dealt with, 2 of them have been there for at least 10 years, nothing has ever been done, although lots of complaints. Everyone knows who they are. There have been 2 cultural reviews in the time I worked there and nothing has changed."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Nice place to work for a while", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 May 2021", "job_title": "Campaigns in London, England", "duration": "N/A", "pros": "Great colleagues, great HR support and good quality work", "cons": "Directors with egos, difficult to progress career/no promotions other than for Directors themselves"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Helping the charity in their goals to help wildlife and animals", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jan 2021", "job_title": "Software Developer in London, England", "duration": "N/A", "pros": "Great company and people to work with. Everyone is caring about their goals and really motivated", "cons": "No investment in technology, does not seem to have a strong digitial strategy"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Like being back at primary school", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jun 2016", "job_title": "UK Office in London, England", "duration": "N/A", "pros": "Working with some lovely people who are passionate about the cause. \r\nSome great campaigns which will hopefully make important differences to the lives of animals.\r\nSome good work being put in place to ensure integration across departments.", "cons": "Old-fashioned draconian-style management. Both new and old senior managers don't seem to trust junior staff and speak down to them like school children. They brashly appoint biased blame without giving employees much opportunity to speak. \r\nLow morale and well-being aren't addressed sensitively and treated more as an inconvenience. \r\nWhat I've heard about HR is concerning to say the least and sadly they've made sensitive issues much worse.\r\nCliquey, with a culture that seems to be surrounded by survival of the loudest.\r\nSnap assumptions are made against others and petty grudges are held for months on end.\r\nFavouritism fuels disharmony amongst team members, tell tale type nonsense, bullying, and loss of self-confidence amongst many hard-working employees.\r\nMany people's good work and skills gone unnoticed and unused.\r\n\r\nSince I've been working here, I've noticed a big drop in the motivation of a few of my colleagues, including myself. It's a shame because many employees care deeply about the welfare of animals and want to make a difference, but the way they are being treated is taking its toll. I've never worked in an environment like this."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Daily conflict on to stay or go", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jun 2016", "job_title": "Campaign Manager in London, England", "duration": "N/A", "pros": "Lots of committed colleagues who want to work hard\r\nClear commitment from the new CEO that he wants to make this a great org", "cons": "Many senior staff caught up in blame culture: micro managing so they can claim the hard work of others as their own when successful but, immediately pointing fingers when the smallest things go wrong. Doesn't reflect who is doing the real hard work and means team spirit is never a priority. Lots of self congratulating, and no credit given: between senior individuals who aren't involved in significant achievements . Many, many people promoted into positions without training or support from their Managers to guide them: lots of making it up on the job! Some of them are trying so so hard with no support and some are then turning into worrying workplace bullies. Over the years I've watched passionate, really skilled people come and go but you can see them become disengaged, quiet and no longer willing to fight for the cause at this organisation: it's really sad. I could easily think of at least 5 people who work their socks off and have made real change in their jobs but are actively looking to leave because of their treatment by their Managers, or their worry their work is constantly claimed by others, or, that they are unable to make a difference."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A charity which cares more about titles than helping animals", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Sept 2014", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The salaries are good for the sector and I met some really nice people.", "cons": "A lot of the problems at WSPA (now re-branded World Animal Protection) stem from the poor leadership of the senior management teams.  There is a lack of transparency around hiring and promotions, and an obsession with titles and hierarchy.  The opinions of non-senior staff are often dismissed and it is very difficult to progress.  \r\n\r\nThere is a lot I could go in to around certain issues to do with leadership, transparency and morale, but I do not wish to as I do not want to damage the reputation of what could be a very effective charity.  However, I would say that a good test to see how good an organisation is, is by how many staff members donate or fundraise (in an non-paid capacity).  I don't believe that many of WSPA/World Animal Protection's supporters are staff members."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A rising star. If you're passionate, positive and entrepreneurial, you'll do well here.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Nov 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "A job with World Animal Protection gives you the opportunity to transform the lives of animals around the world. You get to work with a diverse bunch of wonderful colleagues, all of whom are experts in their field and dedicated to the cause. The organisation is putting some great systems in place to deliver truly integrated global campaigns and the culture is improving every day. Salaries are pretty decent. The working environment is great.", "cons": "The place is fairly process heavy but show me a global organisation that isn't.\r\n\r\nSome colleagues just don't get the link between personal choice and mission (e.g. eating factory farmed meat in the office), but hey, it keeps us out of the animal welfare bubble, which is actually really useful.\r\n\r\nThere needs to be better global alignment in terms of our operating model - we're a campaigning organisation and we need to act like one. There are a few too many debates about the vale of  'insider' versus 'outsider' approaches. This will get better as internal confidence grows."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great workplace", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Oct 2020", "job_title": "Research Officer in London, England", "duration": "N/A", "pros": "Great people, work-life balance and mission", "cons": "Lots of entry and high level jobs. Hard to progress in the middle."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Bad talent management", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Sept 2013", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "-Project work is very interesting\r\n-The majority of staff (low to mid-management) is very knowledgeable and truly dedicated.\r\n-Good work is carried out on the ground by the teams implementing the work (either direct WSPA staff or contracted NGOs)", "cons": "Appalling talent management: the organisation is full of blossoming dedicated individuals with a great deal of innovative ideas to tackle animal welfare problems but senior management is completely incapable of managing them and spends too much time ‘parking’ people while they are busy going through yet another restructuring and wasting donor funds. There is a huge turnover of  staff in departments who are able to find other jobs easily (e.g. fundraising), and there are massive frustrations  amongst the specialist staff who stay holding on to a glimpse of hope that MAYBE there might be a possibility that perhaps someday they can be left to do their job. The politics are toxic and only bending to this brown nosing culture will allow staff or specific work to survive. A real shame as the organisation would have had so much potential otherwise."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "The direction is right, but it needs to be embedded", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Dec 2013", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "WSPA is a global organisation, allowing you to work with a mix of cultures (which is great). WSPA is focusing on the biggest issues facing animals, so there is huge potential to make a big difference for animals. WSPA has had many internal weaknesses (especially in Campaigns), but is now starting to get it's house in order (especially in Campaigns). And there was resistance to engaging with staff, but that's now happening. I'm (cautiously) optimistic.", "cons": "The CEO doesn't lead, which creates a vacuum. WSPA has gone through a lot of change over the past few years (both in strategy and structure), and there are the inevitable frictions as a result. But they are worse than they should be because the change isn't being properly led. It can be really hard to get things done. WSPA really needs the CEO to stand up and be counted, to 'live' the culture that WSPA needs, and to reward good performance and hold people to account when they don't deliver."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Bad management and decreasing reputation", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Sept 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Flexi working hours\r\nWSPA used to do decent job", "cons": "Helping animals isn't their priority anymore. People who lead the organisation have little knowledge about animal welfare and take important decisions without consulting experts. There is no freedom to do things, everything is dictated from people above you. There is micromanagement at all levels and it really drives you crazy when someone is almost spying on you and not letting you do your job because they are extremely controlling and have trust issues. They never recruit people on time and there are gaps that are not filled for long time, this makes it harder for you to do your job."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "1 star today, 5 stars next year?", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Sept 2015", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "As of this week, the departure of the CEO who has agreed to step down is a massive pro that we have been waiting for for a long time. We are nervously looking to the future and hopeful that the darkest days are behind us.", "cons": "The biggest con has left and good riddance. However, he leaves behind a supine board of trustees who sat by and did nothing through years of incompetent management, cronyism and bullying. Did it really take the threat of a tabloid exposé to stir them into action? Shame on them!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great people and working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Jul 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "There are some amazing passionate people that work here, friendly and knowledgeable in their own fields, always willing to help. \r\n\r\nDevelopment opportunities are outstanding, but you have to know what you want and not be afraid to ask. I have personally been offered great career progression that I will forever be grateful for. \r\n\r\nMany recent changes in culture and structure helped streamline processes and identify faults, which made our voices feel heard.", "cons": "Not a lot of extra employee benefits, but as an animal lover, working for a charity that helps so many animals surely is benefit enough."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Love this place, and the continued potential is enormous", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Amazing colleagues (it feels like a little family in our team!) with limitless talent, enthusiasm and energy. An exciting and inspiring mission - an organisation that truly makes impact for animals around  the world. It's great coming into work every day to know you're a part of that.  There are so many exciting things happening, and if you are driven, passionate and use your initative, you can be at the crux of all of this and help shape it. The potential for the future is enormous, and this in itself is really exciting.", "cons": "There have been some challenges with processes and comms between departments, often the case at many workplaces, but these are rapidly improving."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Painful...", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Sept 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Working hours are good - no need to work extremely long hours.", "cons": "Coming to work most days makes me want to slit my wrists. A lot of colleagues do not have any interpersonal or teamworking skills and they come across really confrontational. They will not thank you for putting in the hours to do your job but they will make you feel rubbish if you make a mistake, no matter how small it is. It's all a blame game."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great organisation striving to be world class", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Oct 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great organisation making a difference to animals worldwide. Flexibile workplace and not a long hours culture that I have experienced in  other charities. Accessible and capable senior management team.  Great monthly staff meetings which showcase our work across the world. I am proud to work at this organisation.", "cons": "Like many organisations going through a change process there is tension in some areas. However, the organisation is working with colleagues to improve the employee experience and culture. Many of these posts on this board relate to the past, not the current working experience which is much improved in terms of accountability and openness and connection to our country offices and our animal impact."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Miserable", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Jul 2017", "job_title": " in London, England", "duration": "N/A", "pros": "Shared trauma creates good friendships.", "cons": "This organisation is constantly trying to prove to itself that it can do the job it purports to do, but fails in almost every way. Working here was a daily professional and personal slap in the face. \r\n\r\nAs for work environment, you will observe adults behave like spoilt children after following the example set by senior management. Hard workers, late stayers and those with the most relevant sector experience will be bullied, exploited and demoralised, as they watch those in bed with the CEO promoted. I’ve never worked anywhere else with such a high turnover rate, or so many taking stress leave to recover from doing their office-based jobs.\r\n\r\nDo yourself a favour and work for a charity that cares about its employees, recognises effort, and applauds genuine passion for the cause. Steer clear of this soul destroying black hole in the animal welfare movement, where supporter donations go to die."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Rome wasn't built in a day... a place for those with vision and determination!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Sept 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The organisation does some truly outstanding work, and it takes a different approach to protecting animals than other charities. It has some innovative campaigns and is responsible for some major wins over the years, of which I'm proud to have been a part of. \r\n\r\nThere are plenty of positive, passionate people who you get to work with on a daily basis. If you're lucky, you'll get to witness some of the work first-hand around the world. But not everyone gets this chance, because it's not the primary way change is made. \r\n\r\nAnd if you work hard, opportunities will come your way to work on different projects, new campaigns, and with new people, and to step up.", "cons": "The culture of the organisation has taken a hit recently. It's not perfect. No surprises there. But find me a company without its challenges. There have been big changes across the organisation over the last 24 months, and as with all change there are winners and and there are losers. You tend to find that people who have an axe to grind will find their way to Glassdoor quicker than others, hence the dominating sentiment across most of these reviews. My advice to those people: if you're unhappy, ask yourself why you're still there. You're doing neither yourself nor the organisation and the cause (protecting animals!) any favours. \r\n\r\nSo it does mean that you have to find your motivation from within and not from those you work with. Yes, that can be tough day to day, but you need to remember why you're here and what you're trying to achieve. There's no place in an organisation like this for people who just want to rest on their laurels and complain. Animals need our help, and nothing should get in the way of getting the job done."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "It used to be a great company", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2014", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Lots of top qualified staff", "cons": "Lack of focus.  Disaster Management used to be a strong suit; but is now hardly there at all.  If done, WSPA pays others to do it.  Gone are the days of John Walsh.   Much more needs to be done to develop international standards for animal welfare within the International Organization community; but while some staff have been exerts in that arena, most are not, are frankly ill prepared."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Inspiring cause, with hardworking, passionate and intelligent professionals", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Jul 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Inspiring cause, with hardworking, passionate professionals. Good internal career opportunities.  If you have initiative, drive and a proactive mind-set, you can shape and lead your work and really contribute to delivering a positive impact.  An organisation with a heart, that is moving in the right direction.  Informative and inspiring internal monthly staff meetings.", "cons": "Management relating behaviours, in some teams, could be more courteous, which the organisation is working to address."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "a corporation covering up as charity", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Nov 2013", "job_title": "Programmes Manager in London, England", "duration": "N/A", "pros": "lots of international experience, work with multiple governments", "cons": "ridiculous nepotism (jobs are frequently not advertised not even internally), progress completely dependent on personal relationship with senior management, poses to be an international organisation but unless one is British and a Tory, there is no chance to progress past middle management, unfortunately all the good technical idealistic staff are harassed out the door by managers that have hardly ever touched an animal"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "More pros than cons in my experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Dec 2013", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "I should perhaps mention that I did not think much of the reviews in this website, but now I have been asked by completely unrelated friends and relatives if it really is that bad working in this organisation and one of them went as far as to say that they would not work here if given the chance. Comments according to which we are not delivering AT ALL, make me and my own line of work look bad and I think that as much accountability we're asking management to have, there should be some of that as well on us, the reviewers. \r\n\r\nThese reviews present a very gloom picture that it is far from my experience here so I will take this chance to present my view of this organisation. Hopefully I can focus on the things I consider to be factual, in hope that future reviews do comment on these as well. Ultimately this is a forum to share opinions but I insist on having some responsibility for people who are currently employed by the organisation that are making an effort to deliver on their own jobs and that want some things to change. That is the position I am in. \r\n\r\nIN *MY OPINION*, WSPA has very competitive salaries which are complemented by a fairly good pension plan. I can say that in my case the difference between my salary in another organisation and WSPA is substantial as I currently earn 1.5 times what I earned some 3 years ago and I did not have access to a pension plan. In addition to the salary itself, I was presented upon arrival with a series of benefits, such as loans for transport and a bike scheme, among a few others. It is easy to take for granted that the location of the office is great, accessible to the main lines and in Central London. Similar organisations with offices in places like Surrey and beyond would make it impossible for me to work in the sector. The office itself is organised, has a modern look and resources (software, printers etc.) are constantly updated. I have also been provided with opportunities to enhance my skills and advance in my career, which I can't take for granted. \r\n\r\nThe job is very flexible. I have never had a discussion with my line manager about working from home from time to time in situations like having to attend an ill relative or even receive a parcel. I have also the flexibility to come at 8.00 AM and leave at 4.00 PM (normally 9.00AM to 5.00 PM) which means I can balance quite well work with life. True, I had longer days and stressful periods where this doesn't apply and I end up pulling a 8.00-8.00, but I can confidently say that this is not the rule for me and certainly nothing I have seen managers encouraging. I know that there is some inconsistency in the way that the work from home scheme is applied, but for people like me having the liberty to agree on the scheme is priceless. \r\n\r\nI have never found trouble arranging my annual leave and the office closes for a week in Christmas so even then the leave entitlement is slightly better than it is in other organisations. I am also aware of current study leave being allowed and members of my team with academic pressure have been able to continue with their studies thanks to the organisation's flexible approach to work. \r\n\r\nMany people have made reference to managers simply refusing to recognise the union. I am aware of the existence of a committee that is working with management to get the union recognised and I understand from him that this is a process with some complexities and delays, but I have never heard from them that management have closed the door for conversation and so they have informed in meetings, emails and newsletters. The fact that people here are continuing to simply write \"the union is not recognised\" is also a statement that goes against colleagues that ARE working to make this possible. This is another example of trigger happy comments that are really not helping us to change things that need to be changed. If you don't know about the union process, speak to the union people, they're no longer hiding in a closet. If you think you're doing us/them any favours by simply saying that there is a direct refusal to recognition you are not acknowledging any of their work. That is irresponsible.   \r\n\r\nI do enjoy what I do and in my team there is generally and atmosphere of respect and good cooperation. I do not have to worry about someone else working on the same thing so there is no competition. There are expectations, and these are quite high, but the expectations are not set on a personal basis, which is why I think I could never do this for the private sector. As such the atmosphere is challenging, but relaxed. As expressed before, there have been days or periods of the year in my case where I certainly know when these days are coming, but in my line of work, this is not just WSPA, this is everywhere. \r\n\r\nMany others have written before that the people are the best part of WSPA. This is most true and WSPA is the kind of organisation where you can relate to people and even make a few friends down the road.", "cons": "I think that there is a serious problem of communication and that decision and the decision making process need to involve more staff that will be ultimately affected (positively or negatively) by these decisions. \r\n\r\nSome of the reviews here have presented a very critic view of the campaign work of the organisation and I think that in some cases they have a point that I don't think I can't add anything substantial. This needs urgent attention and campaign decisions need specific impact assessments so that some of the negative situations described can be avoided. I have to say that I have had the chance to speak to my GLT member about the impact of these decisions and I have always had a reply in the formality of team meetings. While I don't always agree with the reasoning, I had my chance to present my views and answers to my somewhat difficult questions have been provided. \r\n\r\nHaving said that, I think that the kind of work that this organisation does is not just narrowed down to campaign work. In the time that I have been working here some substantial political gains have achieved, with impact at the heart of UN or with our work with OIE. I am convinced that these achievements have the potential to change the situation for animals around the world. Some current work in WSPA is aiming to that effect and therefore, colleagues of ours are making an effort When our organisation is described as utterly ineffective I don't think we are taking into consideration people who are working on these departments or people who are working in resources allowing this work to take place. I certainly don't feel comfortable describing my job as ineffective. \r\n\r\nI think that a good part of the problem is the fact that there is a perceivable distance between decision makers and staff executing these decisions."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Ruthless. Nepotistic. Indecisive. Damaging. Avoid.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Nov 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Make animals' lives better. Work with other committed staff. Flexible working.", "cons": "Overblown planning processes, short term thinking on theories of change; more focused on making noise than real impact. Often short on technical capability. Ruthless and incompetent management, fearful working environment. I only realized how much damage it had done to my integrity and sense of competence after I left. HR are woefully incompetent and careless, making several important mistakes. It was a learning experience, not one I am keen to repeat. My performance reviews were always really positive, but by the end I didn't think I was capable of anything."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Disgruntled 'old' staff", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Sept 2015", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great people making a difference.", "cons": "Disgruntled old staff that just can't seem to let go of the organisation. It's quite sad really and think they need to move on and concentrate on their current roles and personal lives. My advice to anyone considering a job here: Make your own mind up and don't listen to people hiding behind a computer screen."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Confusing workplace with lots of big egos", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Nov 2019", "job_title": "Team Leader in London, England", "duration": "N/A", "pros": "You get to work towards something you believe in, whether you make a difference or not is hard to tell", "cons": "Some people work for charities to polish their own egos, not so much because they actually believe in the charitable objection of the organisation. There are a lot of big egos in this place and certainly not everyone is in it for the right reasons."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great organisation for animals, horribly wrong for employees", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Oct 2014", "job_title": "Programmes Manager in London, England", "duration": "N/A", "pros": "Great staff. Passionate and willing to work beyond the expected in order to protect animals. General staff lives the values and mission you'd expect from this NGO. Nothing bad to say about the work they try to accomplish.", "cons": "Management is isolated. No trust or respect of employees unless friends. Preach cultural sensitivity but very UK centric."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Working here is poison", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Sept 2016", "job_title": "Campaign Manager in London, England", "duration": "N/A", "pros": "You will meet some great people and make lifelong friends", "cons": "Crippling working environment, poor leadership, no development opportunities, climate of insecurity and fear, dreadful culture and misuse of funds.\r\n\r\nWorking at this organisation will strip you of your confidence and make you doubt your abilities. It's run by people who don't know or care about animal welfare and treat their staff like dirt. If you care about the cause and want to see real change for animals, work elsewhere and avoid this place like the plague. \r\n\r\nTo get ahead at Wspa you have to be one or all of the following: ruthless, game playing, fake, or in the pockets of those at the top. Hard work is rarely rewarded or recognised and those at the bottom who do all the work and have all the knowledge about the issues are disregarded and are gradually being depleted as part of the continuous restructures. Ironically the most incompetent people are promoted first, often with no training or support, to the detriment of everyone else. The illusive leadership team (all white, middle aged men) seem clueless and ineffective in sorting out the real issues that the organisation faces.\r\n\r\nif you would like to feel miserable about your job, lose your passion for the cause and feel entirely ineffective and undermined, take a job here. \r\n\r\nDespite claiming to \"move the world\" and being an \"authority on the issue\" I could probably count on one hand how many animals have felt the benefit of wspas work in the last couple of years. Instead, money is spent on pointless rebrands, flying senior leadership around the world and hiring extortionate consultants, with no obvious or tangible benefit.\r\n\r\nThe organisation struggles to have a clear cut opinion on any issue and is confused about what its purpose is, what it wants to achieve and how to go about this.  \r\n\r\nWspa's only saving grace is the truly wonderful people, mostly at junior management level and below. However their skills and enthusiasm is wasted at an organisation that has lost its heart and it's way. Most people are desperate to leave or at their wits end. A sad state of affairs for an organisation that has the potential and the funds to really help end animal suffering. \r\n\r\nIt's only after leaving that you realise how miserable working here has made you and what a toll it takes on your health."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Change is overdue", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Oct 2018", "job_title": "Assistant Manager in London, England", "duration": "N/A", "pros": "Don't readily come to mind", "cons": "It’s very difficult to paint an excessively bleak picture of the state of WAP at the moment because despite the oft promised and hoped for “light-at-the-end-of-the–tunnel”, it never comes.  What is also extraordinary is that the Board, who promised all the right things about wanting to be more involved, recognised that they had let people down, etc etc are either not bothered or (more possibly) oblivious to the ongoing misery which characterises the working environment. They may be helped in this regard by having a very artificial perspective on the State of WAP since it is all neatly and soothingly fed to them through the mouth of the CEO, now practiced in the art of explaining away any murmurings of discontent as the necessary and expected ripples issuing from the restructure (aka Night of the Long Knives). \n\nHe offers up this silence as being an indication of support for the programme of change. In fact, what it represents is yet another manifestation of the fear of speaking out which has paralysed the organisation over the past two years and enabled the CEO to impose his authority. Those brave/suicidal enough to hold a different view were, almost without exception (and by the most extraordinary coincidence..), the same ones who were victims of the ‘restructure’. These were talented people who in many different ways helped the organisation become successful, dynamic and creative – winning campaigns, awards, helping animals. They may have had their flaws and/or egos but none were so great as to warrant the quite appalling way in which they were treated. But then the CEO has a long track record of shafting work colleagues.  Far more flawed is the logic of getting shot of high achievers and replacing them with ranks of nodding dogs, who will answer the call of either master or mistress.           \n\nWhat is ironic, is that having disposed of the services of some of these long-serving members of staff, on the basis that their work somehow didn’t “fit” with the new public face of WAP, work is now being done which pretty much replicates it. Bears were ‘out’ when the miscreants wanted to campaign on them, but now they are gone, you can’t move for them. But like everything at WAP right now, you don’t have a voice, you do what you are told and you don’t express a contrary view or opinion. Not only is it pointless, but you have a mortgage or rent to pay and shoes to buy for your kids and that kind of concentrates your mind."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Lions led by donkeys", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Dec 2012", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "WSPA is a very well-resourced organisation with a desire to have a global reach which can result in international travel and meeting a lot of people who are very committed to animal welfare. The organisation’s salaries and benefits are competitive and may get even better if the leadership respect the wishes of the staff and recognise a Union (are there any large voluntary sector organisations who still don’t do this?) The staff is on the whole a fantastic bunch and I have made some friends for life.", "cons": "I share the majority of concerns raised in other reviews here (sadly not those of the woefully misguided senior director masquerading as a ‘current project worker’…). There seems to be a lot of fear and mistrust exhibited by the senior directors: fear of debate (seen as conflict) and a lack of trust in their staff to carry out their roles. This is a great shame as it increasingly leads to a paralysis where colleagues are unwilling to put their necks on the line by having an independent thought or action – they have seen too many suffer the consequences – and it also encourages some rotten apples to rise in the organisation by parroting what the senior directors want to hear and by working against those who are out of favour. Much staff time is also wasted trying to guess what it is that senior directors want but this may be because they don’t know themselves.\r\n\r\nMany colleagues therefore live in a state of continued fear – described by some as ‘walking around with a target on your back’ - and the organisation’s recent history is unfortunately marked by examples of staff who have offended the senior directors in some way – either disagreeing with them or a member of their inner circle – and have been side-lined and excluded and sometimes even ‘encouraged’ to leave."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid WAP like the plague. They wouldn't treat animals the way they treat their staff.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Nov 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Most of the people have great intentions and are there for the right reasons, to make a difference to the lives of millions of animals around the world.\r\n\r\nWorking in pretty unfriendly circumstances brings staff closer together.", "cons": "Seems to attract the very worst types of management all the way to the top, regardless of which 'regime' is in charge. \r\n\r\nSignificant issues continue around CEO promoting those he is 'close' too. This was a problem with the previous CEO and remains today.\r\n\r\nOngoing issue of the organisation raising millions of pounds every years off the back of issues (particularly bears) that very little attention is paid to and a tiny fraction of that money is spent on. This is a dishonesty to the loyal and amazing supporters that is now accepted across the organisation but is appalling. The preservation of organisational and fundraising growth is put ahead of the supporters and benefits to animal welfare.\r\n\r\nI have never heard of an organisation causing more people to become physically and mentally ill than here. Numerous staff members have been off on sick leave caused at least in part by the pressures the organisation unfairly puts on them and the manner in which they are managed.\r\n\r\nSeems to be a new (or 'refreshed') strategy every year or so. Causes widespread confusion and doesn't allow staff to plan long-term. Constant issues of budgets being slashed and then suddenly under spends being announced so money is miraculously recovered and spent on projects with little strategy involved.\r\n\r\nAlong with changing strategies comes staff restructures which are expected each year. First comes a protracted consultation (where feedback is routinely ignored) and then staff not seen as loyal to senior management  are made redundant, with various payoffs depending what dirt they have on the organisation and the CEO. But then surprise surprise, within a few months virtually the same job is advertised for but with a different job title.\r\n\r\nI wouldn't recommend this organisation to my worst enemy and I would tell potential donors to go elsewhere if they want to see it a positive difference for animals. Working there creates a bunker mentality and drains all energy possible. I genuinely hope the appropriate governing bodies do a full enquiry into the issues at this organisation as I do not believe anything short of this will actually change the shocking way it has been run."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "plea to management - care about your staff", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Oct 2014", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "Like so many of the other reviews here; the best thing about WSPA (or WAP as it is now known) is that the colleagues you will work alongside are amazing and completely dedicated to animal welfare. Don't go any higher than Manager level though because at this point your realise it is every man and women out for themselves in one giant power battle which has nothing whatsoever to do with animals. \r\n\r\nYou will make so brilliant friends, and get paid a decent amount - and hopefully the connections you make will help you quickly find your next job.", "cons": "Here is my plea to management - care about your staff, and show them that you care. Maybe even apologise for your mistakes - this would go a long way. \r\n\r\nWAP has a long and horrible history of bullying, and the HR team are only seen to work for the benefit of the senior managers. Countless staff have left with no job to go to because they simply cannot stand to work there anymore. This is especially true of the UK office. And yet this is both never recognised by managers - or acted upon. \r\n\r\nIf you are liked by SMT then the world is your oyster - you can get promoted to positions created especially for you, get pay rises and are flown around the world. The inconsistent recruitment policy is a long term cause of frustration amongst middle and junior management staff who see people get given jobs, whilst other position are advertised externally and internal candidates are told not to apply. \r\n\r\nThis review and all the others written on here are considered to be the views of a couple of 'troublemakers' - SMT listen to your staff. We are not troublemakers, we want to work in a constructive environment which doesn't pit staff at junior levels against each other, which in turn creates an atmosphere of fear and distrust. This only results in teams which won’t communicate because they feel they are competing with one another. This all comes down to the fact that the CEO won’t decide who ultimately makes decisions, should the communications team guide campaigns, should policy or campaigns come first? No one will make the decision so the internal infighting to see who comes out on top is horrendous. \r\n\r\nSMT - It is good that you have finally chosen to recognise the Union, but now you have to listen to what the Union say and make changes which show that you genuinely care about your staff. \r\n\r\nSecondly, please actually do something to make the lives of animals better. I really don't understand how WAP hasn't been investigated by the Charity Commission or a similar body for misuse of charity funds. The reporting system asks for staff to indicate how many animals have been 'saved' by the work of WAP. The real answer is shockingly low, a handful of bears that are taken into a sanctuary in Romania are the only real beneficiaries of WAP's millions. And this case study is then used as the fundraising appeal to generate excessive amounts of money which is ploughed back into a series of endless board meetings and strategy workshops. I don't know how many times each country office can say that a new sanctuary enclosure needs to be built before someone questions exactly how much money actually goes to the sanctuary (a fraction of what is raised). \r\n\r\nIt is often mentioned that charity funds have been used inappropriately, be it to pay for large workshops which require staff from all around the world to fly to the UK to stay in four star hotels, or to pay for the rent on a London flat for a member of SMT. Almost like the MP's expenses scandal it seems that this can’t go on forever without members of the public finding out. \r\n\r\nAs another reviewer mentioned I have known staff who loved WAP before joining, and donated on a monthly basis - only to join the organisation and immediately cancel their direct debit once they understand how their donation is used. Surely this is an indication that something is seriously wrong with the charity."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Entrenched, growing problems", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Nov 2012", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "WSPA International has a fantastic staff base, the majority at the implementer level (Leader/Manager, Coordinator, Officer and equivalent roles). At these levels both longstanding and newer staff are bright, committed, forward-thinking, and eager to make a difference to animals through their work. We recognise how lucky we are to be able to work with inspirational colleagues and partner groups on worthy issues around the world, and value our working environment and roles highly because of factors like this. Opportunities to learn new campaigning and working techniques are encouraged by certain managers, and are eagerly exploited by staff. Benefits and terms & conditions are competitive.", "cons": "This same enthusiastic staff base is being sadly let down by WSPA’s current leadership.\r\n\r\nWith the takeover by a new leadership team over two years ago, WSPA has changed from an inclusive, listening-and-learning organisation that valued it’s staff’s considerable expertise and achievements to a hierarchical top-down organisation that relentlessly pushes an agenda of change. This agenda appears less and less to have real change for animals at its heart, and more focus on flash-in-the-pan campaigning that serves to get WSPA’s name out there at any cost. WSPA International has borne the brunt of this change, though the trickle-down effects are also resonating throughout WSPA’s regional offices - colleagues based regionally describe today’s WSPA as ‘a body without a soul’. Experienced staff with broad knowledge of diverse animal welfare issues and working effectively across cultures have been replaced by what appears to be the leadership team's friends and aquaintances. Time and time again seemingly random recruitment choices are made for senior positions, the majority of which soon fail, only for the unsuitable candidates to be segued into another role (or a role magicked up) and replaced by further ill-suited replacements. Recruitment processes are opaque in the extreme, and, as has been said before on this site, cronyism and favouritism are widespread. There is a feeling that the only way to progress here is to ingratiate yourself with the leadership team, leading to the encouraging of people going above the heads of direct management, underhand activity by those who should know better, unfair representation and marginalisation. Senior management across many of WSPA’s offices is now characterised by confusion, lack of experience at working internationally, poor (or appalling) people-management skills, next to no animal or animal welfare knowledge, and a dogged determination that nobody should find these flaws out!\r\n\r\nTo work for WSPA used to mean working in dynamic teams with support and trust from the leadership, where challenges, different opinions and new suggestions were welcomed, worked through and acted upon. To work for WSPA today means confronting layers of disjointed management, working against frustrating bottlenecks, and endless confused decisions seemingly made on a whim. These characteristics are not par for the course for an organisation coming through change - they are symptomatic of the leadership culture at WSPA now."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "'Leadership' has now left the building...", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Jul 2013", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The pros SHOULD be working with amazing people for a truly amazing cause - however, with a strategic process that is now in it's fourth year with no signs of anything 'strategic' coming out of it (I give you one appalling Turtle campaign, soon to be followed by an even more appalling Civets campaign), and with most of the amazing people having left already or on their way out, the pros suddenly cease to exist...", "cons": "The entire Global Leadership Team, who market themselves as a 'leadership team' but have yet to actually offer anything remotely resembling leadership..."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "All the way downhill, from a great beginning to a disappointing end", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Nov 2013", "job_title": " in London, England", "duration": "N/A", "pros": "This is going to sounds so predictably like the other reviews. The staff are what can make this a great place – many people who work at WSPA across the offices (those that are still open!) are dedicated, imaginative and have a sincere interest in animal welfare. Working with people I respected, many of whom have become good friends, is one of the key reasons I remained at WSPA so long when there is so much fundamentally wrong with the place. \r\n\r\nAlso some of the T&Cs are good, bike scheme, parental leave, holidays etc. and the pay is good for the sector, which is why the refusal to recognise a union is bizarre. \r\n\r\nI was proud to work there once, WSPA has a great history, but there needs to be a major sea change before I believe many could say that in future.", "cons": "Where to begin! The leadership have created a toxic atmosphere where all questions and suggestions are taken as criticism. Once you are branded ‘negative’ there is no way back. It is incredibly clear who is in favour and who is not – if the management don’t like you, you really do need to start looking for a new job ASAP as responsibility and staff will be stripped away until your position becomes untenable. This didn’t happen to me as I decided to put my morals in a cupboard and get on with the job, but I have seen it many times. \r\n\r\nMy role allowed me more than a glimpse into the finances - I was horrified. If the charity commission decide to take a long hard look at the books there would be serious points to answer. ‘Lost’ money, money spent where it isn’t meant to be, what is counted as ‘education’ costs... And this is all apart from the flagrant waste on senior management travel and conferences when Skype would do.\r\n\r\nA quick look at where the highest paid people have come from/how they’ve met will soon show up a web of nepotism and fundamental lack of skills to do their roles that will literally make donors weep. Animal welfare work – which I once saw make major change for animals around the world and was so proud to be part of – has ground to a halt. Look at the last Global review and read between the lines, then ask what they spent the money on.\r\n\r\nAll this stems from the leadership, which is rude, surprisingly ignorant of the issues they purport to care about and arrogant. My line manager was amazing and inspiring, but could not shield me from being sworn at by their superior and generally talked to like dirt. Never experienced anything like it after more than 15 years in the charity sector at numerous orgs, large and small. Successive good managers I had at WSPA left, disillusioned. And have gone on to great things!\r\n\r\nIn short, I expect to work hard for a charity and to be paid less than peers in the private sectors. I expect to have less perks and to work with limited resources. What I don’t expect is to leave at the end of each day feeling like I am complicit in stealing from people who care about the cause, while the board soirees are served by hired waiters."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Science based charity making animal welfare changes on a global level", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 May 2020", "job_title": "Communications Manager in Peacehaven, England", "duration": "N/A", "pros": "Global reach, passionate staff, corporate and government engagement, evidence based, proven success, fantastic cause", "cons": "Internal consultation, internal communication, brand awareness, agility, lowest paid staff members undervalued"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Human Resources", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Dec 2016", "job_title": "Human Resources in London, England", "duration": "N/A", "pros": "Really good opportunities for Learning, Development and progression.  Good Leadership at Senior Level.", "cons": "Need to develop middle management"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A great organisation making a positive difference to animals across the world.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jun 2012", "job_title": "Project Worker in London, England", "duration": "N/A", "pros": "Modern, forward thinking, good terms and conditions and great opportunities to work internationally. The organisation has gone through significant change in recent years and is now much more focused on raising the issue of animal welfare with international decision makers to make true long lasting improvements across the globe - it's all very exciting.", "cons": "They do acronyms like no other place I've worked!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "castrating experience", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Sept 2015", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "great colleagues, great office, flexible work conditions", "cons": "I was loosing all confidence in myself and in my skills until I left this job. The matrix style management model simply does not work. Decision making is everything but clear. Projects don't get off the ground. Too much money is spent on internal meetings in exotic locations."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Mixed", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jul 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Staff dedicated to the cause.", "cons": "Frustration as rigid strategy interferes with opportunities to get results"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Goosd", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "20 Aug 2016", "job_title": "IT Support in London, England", "duration": "N/A", "pros": "Nice place to work also", "cons": "None that  can think of"}]]