[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great Place", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Dec 2022", "job_title": "Clerical Officer in Compton, CA", "duration": "N/A", "pros": "Great colleagues Management Flexible schedule", "cons": "Pay could be better Better opportunities for promotions"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Weird Pay Structure", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jun 2023", "job_title": "Adjunct Faculty in Costa Mesa, CA", "duration": "N/A", "pros": "Paid by completions. Lots of support for faculty.", "cons": "High turnover. Difficult to keep up with change."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Diminishing returns for hard work", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Feb 2023", "job_title": "Faculty in Las Cruces, NM", "duration": "N/A", "pros": "This used to be a university dedicated to student success. Many students graduated with doctorates and went on to successful careers as psychologists. The school had an excellent reputation with the various licensing boards of states.", "cons": "More and more benefits are being taken away. No longer can you count on being paid for your work. There was a program where you could submit research to be published and the university, recognizing that it was also receiving marketing, would pay for the work. No more. The school does not trust employees requiring more and more reports to be submitted. No longer does it trust the faculty to do their work. In the past 2 years, 4 additional levels of approval have been required for doctoral projects with no explanation of why."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Hopefully things have changed.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Jan 2023", "job_title": "Academic Advisor in Costa Mesa, CA", "duration": "N/A", "pros": "Great staff, career advancement opportunities, discounted higher education is a fantastic benefit.", "cons": "CalSouthern is dripping in office politics. Major brown nosing to the executive staff as well as professors. Very stressful environment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Crazy & Psychotic President", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Sept 2019", "job_title": "Support in Irvine, CA", "duration": "N/A", "pros": "the learners and the people who really support them, academic advisers, professors, deans, the vp in charge of those deans all", "cons": "favoritism, unqualified friends and favorites working in the company. there are friends of the assistant to the president who are promoted and not qualified. the people in senior leadership are not qualified. only the people that are doctors are qualified, but they are ignored.  the president is the wife of the founder. she is a real psycho and her little cronies who do not challenge her psychotic decisions, are promoted. what you read on here is not just disgruntled employees; they are people telling the truth. something that president could never do or accept.  I feel sorry for that provost, who is humiliated monthly; the HR, who cannot do what is right if you paid them to do so, or the deans, who are powerless. they try to do what is right, but that crazy president, listens to dummies like the inexperienced people in unauthorized \"institutes\" who accomplish nothing.  the president locked a vp of marketing in a closet and everyone kept it quiet.."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful School with a President that Leads", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Oct 2019", "job_title": "Anonymous Employee in Costa Mesa, CA", "duration": "N/A", "pros": "Equal opportunity employer, and it shows. Culturally diverse staff from all backgrounds are welcomed and appreciated here. The President, Dr. Finestone, exemplifies servant leadership and makes the university, its learners, and the staff’s best interests a number one priority. \n\nEmployee morale is the highest I’ve seen with any company I’ve worked for. People enjoy their jobs and are appreciated through constant events and displays of gratitude. Raises are often and performance evaluations are taken seriously.  The benefits are rich and the health insurance benefit is top notch!\n\nDr. Finestone’s hallmark is that of professional development and growing her employees. It’s her vision to have everyone operating at their best for what they are best suited for and she fulfill this vision effortlessly.  \n\nThe founder believes strongly in affordable education for all which is easy to get behind. The senior school is affordable, accredited, and designed around working professionals. I loved working here!", "cons": "I honestly can’t think of any cons to working here."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic Culture, Environment and Workplace", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Sept 2020", "job_title": "Academic Advisor in Costa Mesa, CA", "duration": "N/A", "pros": "There are absolutely none. The only thing I miss are my colleagues. You had to become tight knit in order to make it, it was a survival tactic.", "cons": "Where do I begin? A whole swath of employees were let go under the guise of \"Covid-19\" when those some of those same employees were seen talking to the regional accrediting body by executive management just a couple of days before, informing them of how badly things were being run. If you did or said anything that wasn't in line with what the president wanted, you were fired. She ruled with fear and it was very well known that it was the only way she ran things. If you are seeking a job here, I HIGHLY suggest you look elsewhere. The turnover rate was so high, even students noticed and commented about it!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Do not work in Admissions", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jul 2019", "job_title": "Admissions Counselor in Costa Mesa, CA", "duration": "N/A", "pros": "Casual Friday, Keruig machine, nice co workers", "cons": "I started working there before the current president was there and things were a lot better. The leads were great and there was not really any marketing team. However once current president took position they decided they wanted to globalize and take trips to countries that low percentage rate of students actually enrolling. After doing the math and showing what countries we were getting the best leads they decided to ignore sound and logic and invest thousands of dollars in lead generation in international countries and the success rates of these lead generations were so low but they insisted it was us not reaching out enough. If you want to move up apply to be an executive assistant there are like 6 of them and all have managed to become Director or something."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Awful Place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "23 Jul 2019", "job_title": "Administrative in Costa Mesa, CA", "duration": "N/A", "pros": "for me the only pro right now is the location of the university to where I live and where my children go to school, however I am actively looking for a new position in higher education", "cons": "leadership is inept, angry and inexperienced.  Leadership with no educational administrative experience is in the position because of personal relationships. Many lawsuits than anywhere else I have ever worked. I have been here 10 years and have seen firsthand the decline from the prior administration, which was a wonderful group of experienced professionals. This place is now governed by fear and intimidation"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Dec 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Benefits, paid time off, great parties and luncheons, fun activities, not to stressful, lot's of different types of coffee, and the new management coming in is great! HR is so helpful here. Training was good too.", "cons": "Promotions are interdepartmental typically, not great holidays but more than most companies give or equal, and you will be held accountable for your actions so performing to the best of your ability is key. Senior management is real interactive."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Think Twice before working there..", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Dec 2017", "job_title": "Anonymous Employee in Irvine, CA", "duration": "N/A", "pros": "Family orientated. As long as you are related to the owners family.", "cons": "No matter how hard you work or give to the company, the owner simply doesn't care. He fired friends and the best talent during the midst of a divorce.  He simple does not care about people as much as he care about $."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Enrollment Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Dec 2016", "job_title": "Anonymous Employee in Irvine, CA", "duration": "N/A", "pros": "Loved working with staff. Was a great environment until they began a restructure and fired all of their key performers who brought in the most revenue.", "cons": "Unorganized, underpaid for the workload, they require you to meet number driven quotas and work your butt off for no incentive like commission or bonuses. Online education seems to be going downhill and I wouldn't be surprised if this place is still standing in  6 months."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Bad working environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "26 Dec 2018", "job_title": "Anonymous Employee in Costa Mesa, CA", "duration": "N/A", "pros": "None that I can think of right now. They do have some benefits but they are so so.", "cons": "Bad leadership which creates a very hostile workplace . If the current leadership does not like you you will be gone even if you work hard you are set up to fail. The atmosphere is filled with paranoia, favoritism, belittling just to name a few. I have never been so unhappy to work anywhere as I have in the recent years."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic environment, clueless, confused and nasty President that rules by FEAR", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Sept 2019", "job_title": "Ex-Worker in Costa Mesa, CA", "duration": "N/A", "pros": "none, this is a VERY TOXIC place thanks to a damaged person running this place into ground. I feel sorry for the employees who are denigrated daily, they live in CONSTANT FEAR.", "cons": "Toxic work environment that was created when this incompetent, confused, psychotic fake ”doctor”  came on board. And, she did not come onboard because of her qualifications, she got married to the Founder and from very first day as new “president” she showed her evil ways. First, she insisted that everyone address her as a ”doctor”, instead of positioning herself so that she first earn the respect, she should not demand it from the employees.\r\n\r\nThen, she immediately started isolating her husband, the Founder (“building a fence around him”  as she would say), then  she fired competent employees, especially those that had lots of knowledge on how university operates and who the Founder trusted, so no communication between employees and management was possible.\r\n This created the  chaos for the employees who had to take over the responsibilities. \r\nAt the same time, she started employing incompetent sycophants that she is now surrounded with. That is her layer of protection – get rid of smart and competent and replace them with dumb and incompetent.\r\n\r\nThe bottom line, she is totally incompetent, sometimes downright illogical, she does not care about the business, if it is going to fail or not. I would not trust her with running a hot dog stand, much less running the University, so having other dumb and incompetent employees  around her as “protection” is yet another layer of protection, besides bullet-proof glass and  doors, cameras and microphones around her office!\r\nI never seen anyone who is so messed up in head and yet running a business!\r\n\r\nWhile smart CEOs or Presidents surround themselves with SMART people that help them grow their business, she surrounds herself with incompetent sycophants. She simply gives them enormous salaries and made up titles, exactly because of their lack of qualifications. As the result,  they become her little obedient lapdogs that turn into attack dogs towards the \"lower\" employees on her command.\r\n\r\nI recently left the university and I feel sorry for current  employees and future employees!\r\n\r\nIf you are employed, leave if you,  STAY AWAY if you are looking for a job!"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "California Southern University has Changed Dramatically with New & Inexperienced Leadership", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "4 Feb 2019", "job_title": "Adjunct Faculty Psychology Online in Costa Mesa, CA", "duration": "N/A", "pros": "They have outstanding quality and rigor of their educational programs", "cons": "New Administration and leadership lacks experience in running a company"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Lack of structur", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Jun 2017", "job_title": "Advisor in Costa Mesa, CA", "duration": "N/A", "pros": "Great co-workers, free coffee/tea, not bad medical/dental benefits", "cons": "Bad management, hardly any communication. No real performance  \"reviews\". If you suck up, they'll keep you no matter how bad you are performing, yet let others go who are genuinely trying. HIGH turn over rate. Don't waste your time like I did working here. It's honestly not worth it."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Admissions Representative", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Apr 2017", "job_title": "Anonymous Employee in Costa Mesa, CA", "duration": "N/A", "pros": "good PTO, great coworkers, good salaries, lots of paid holidays, flexible hours", "cons": "poor management, lack of advancement opportunities, expensive benefits"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "You Do Not Want To Work Here", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Oct 2017", "job_title": "Admissions Representative in Costa Mesa, CA", "duration": "N/A", "pros": "There are no pros, this company treats employees terribly and has zero potential for career advancement. Do not work here!", "cons": "Leadership is the worst part of this company. The ownership is awful and terrible upper management. Seriously do not work here!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Compan Review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "18 Sept 2016", "job_title": "Dean, Psychology in Irvine, CA", "duration": "N/A", "pros": "values, integrity quality, respect, diverse", "cons": "short sighted vision, poor leadership, value, position undermined, academics underappreciated  nor respected"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Adjunct professor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Nov 2015", "job_title": "Adjunct Instructor in Saint Petersburg, FL", "duration": "N/A", "pros": "Great company, recently received regional accreditation!  Exciting times at CSU", "cons": "none that I am aware of."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Cal southern University", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Jun 2017", "job_title": "Anonymous Employee in Costa Mesa, CA", "duration": "N/A", "pros": "high salaries, regardless of skill or experience", "cons": "Inept and inexperienced leadership with a phony board of directors."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Negative stars", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Sept 2020", "job_title": "Anonymous Employee in Costa Mesa, CA", "duration": "N/A", "pros": "Nothing good to say here", "cons": "Degree mill and totally unethical business practices ."}]]