[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "GREAT MISSION", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Oct 2020", "job_title": "Team Lead in Toronto, ON", "duration": "N/A", "pros": "Organization has an audacious goal of Empowering Indigenous Youth in Canada and the Youth of Africa to access dignified and fulfilling work.. I loved that the Foundation goal is guided by a 10 year strategy, therefore having a timeline of achieving the goal.. Foundation is also investing heavily in education which will pipeline well to the Young Africa Works Strategy.", "cons": "Some people have responded very slowly to ongoing transformation of the organization."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Pros and cons", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Jun 2023", "job_title": "Program Lead in Toronto, ON", "duration": "N/A", "pros": "Positive mission and goals. Wonderful colleagues. Good benefits.", "cons": "Can be very confusing and demoralizing at times, as processes and management demands are unclear and constantly changing. Highly bureaucratic with decision-making concentrated at the very top. People's expertise is not valued unless they know how to say the right things at meetings."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Non for profit? More like we profit first", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "15 May 2023", "job_title": "Programs Manager in Toronto, ON", "duration": "N/A", "pros": "Good benefits, good allocation of tools to do your job.", "cons": "Upper management specially IT have no idea what they are doing, they only worry about adding headcount and justify expenses to the CRA but do not really take action when it comes to projects, big disappointment"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Confused", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Mar 2023", "job_title": "Accounting and Finance in Toronto, ON", "duration": "N/A", "pros": "Previously it was the people but most have left over the last few years.", "cons": "The organization needs to really nail down the direction they want to go and stick with it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Research well before joining", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jun 2022", "job_title": "Executive Assistant in Toronto, ON", "duration": "N/A", "pros": "Good benefits, desire to really live the org values, travel opportunities", "cons": "Long hours - the organization operates in a decentralized model with staff scattered in 5 different time zones but expected to work like they are side by side\r\n\r\nDiscrepancy in how your colleagues in a different country is treated through pay and working conditions even though you work side by side. \r\n\r\nToo many meetings - this is an org that prides itself in deciding by consensus. \r\n\r\nChaotic - 85% of staff out of 480 (approximately) were hired during the pandemic so there are mismatched expectations. Systems and process are not yet well developed. Activities are not planned ahead so it is always a race to the finish.\r\n\r\nExecutive Committee - too much decision as a committee and not by individual Chiefs in their area thus creating backlog in implementing things\r\n\r\nWasteful of resources - The lack of foresight creates activities to be done in a rush hence wasting resources\r\n\r\nWay of work - people work inefficiently and get away with it because it’s a non profit. \r\n\r\nEA role is important but not highly valued. If you are coming from Canada, be prepared for the shock of being treated as just a secretary. The culture where most employees comes from ate hierarchical.\r\n\r\nAs an admin, growth opportunities are limited because of the above\r\n\r\nIf you’re part of the LGBTQ2S, be prepared for any celebrations to be muted or next to none. The org panders to its partners who tend to be from conservative countries"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Toxic Management in Technology", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Sept 2022", "job_title": "Technical Support Analyst in Toronto, ON", "duration": "N/A", "pros": "Nice colleagues in other departments", "cons": "Technology team management are closed-minded people"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor leadership and management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Oct 2022", "job_title": "Analyst in Toronto, ON", "duration": "N/A", "pros": "Flexibility\r\nManageable workload\r\nGood office facilities\r\nGood benefits and vacation time", "cons": "Poor leadership and management\r\nBureaucratic \r\nPoor compensation package"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Culture is bad", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Dec 2021", "job_title": "Program Manager in Toronto, ON", "duration": "N/A", "pros": "Good benefits, 2 weeks break in winter time", "cons": "Culture does not reflect the values of the company, too much talk about humility but in reality there is too many egos to deal with . Management thinks that bringing people with a big padded resume will help the organization, these people have experience running already established companies , not building one , the Foundation is getting rid of precious talent just because they want to add big names to payroll that provide nothing new , a waste of money"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Work environment and compensation", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Dec 2020", "job_title": "Project Manager in Toronto, ON", "duration": "N/A", "pros": "Lots of interesting work and strong appetite to work on the big challenges in Africa and Canada.\r\n\r\nOrganisation has ambitious goals and a clear vision for the future. \r\n\r\nSmart colleagues.\r\n\r\nMatrix management system", "cons": "Disconnect between C-suite's vision and how that's implemented on the ground.\r\n\r\nPoor communication about changes that affect employees.\r\n\r\nGoing through big reorganization. You will experience change fatigue very quickly!\r\n\r\nShifting goalposts. Too many changes implemented too frequently make it difficult to see tangible traction in workstreams, despite these being organizational priorities AND employees working very hard to achieve prioritised goals. Can feel chaotic at worst, and frustrating at best.\r\n\r\nLack of transparency around compensation scales for roles so difficult to know if you're being treated fairly.\r\n\r\nUncompetitive salaries compared to similar Foundations/ donor agencies.\r\n\r\nPoor job security and incentives vs expectations and demands on employees (depending on location)."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Needs work, but unwilling to change", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Aug 2018", "job_title": "Manager in Toronto, ON", "duration": "N/A", "pros": "-Opportunities for learning where relevant\r\n-Often in the room with leaders in the field; good exposure to expert networks\r\n-Flexible around schedules as long as filling core hours", "cons": "-There is very little room for growth unless you have been there for years (and years) and have made the right internal connections.  \r\n-Misalignments around title and compensation amongst employees\r\n-Poorly performing HR dept that is not accountable to delivering on their responsibilities and promises to staff; no recourse\r\n-Managers tend to be driven for their own purposes/projects/growth, rather than in support of their staff; nearly impossible to find a champion \r\n-No clarity of job, tasks, and responsibilities. Often made to just do busy work- org thrives on consultants \r\n-Undergoing change for nearly 2 years now; this is  being poorly managed from the top down."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Chaotic, Toxic and Lacks Direction", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Dec 2019", "job_title": "Manager in Toronto, ON", "duration": "N/A", "pros": "1. Dedicated group of young men and women\r\n2. Great office location\r\n3. Working from home is becoming more accepted", "cons": "1. CEO is the sole decision maker- it is her show! She is building her own legacy.\r\n2. Lack of accountability from the board- the CEO reads every word of board book before it reaches board members. \r\n3. Do not disagree with partners who are CEO's friends or you might just get fired!\r\n4. HR does not understand what  diversity and inclusion means in an African context! You cannot fill an office with the folks from the same tribe/community. \r\n5. Passively racist towards folks of color and specifically black people.  You will waste your time getting that promotion while your white peers are promoted left and right. \r\n6. Starting your career- do not come here! They talk about empowering young people but those at the Foundation lack support and mentorship."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Massive potential squandered by outmoded management philosophies and budget constraints", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Nov 2014", "job_title": "Misc in Toronto, ON", "duration": "N/A", "pros": "The staff are great: smart, experienced, dedicated, and fun. Some senior managers are enlightened. The programming makes a difference.", "cons": "Hours are long, flex time is non-existent, and working from home is frowned upon. The office is a cubicle farm. There are no job descriptions, no wage scales, and no advancement scheme. Staff development opportunities are minimal. Travel is extensive, and is in coach class only, irrespective of distance or duration. There is no policy regarding days off in return for weekends spent working and travelling. Vacation time is stingy at 3 weeks. Program staff spend a disproportionate amount of their time preparing materials for Board meetings rather than developing programs and supporting partner organizations. Budget constraints are killing this organization and driving away good staff. Management maintains overhead at an absurdly low level compared to similar foundations."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Total chaos", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Sept 2019", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "Meaningful work, talented staff, great office, good benefits.", "cons": "Approaching second restructure in two years after they botched the first one. \r\nOrg culture is fear-based, passive aggressive, and driven by perfectionism. Employees aren't valued. Work life balance is non-existent. The only recognition for great work is more work. \r\nStuck in start-up mode 13 years in, which means changing course constantly, creating total chaos. \r\nDecisions are driven by board or CEO expectations rather than strategy or results."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Catastrophically mismanaged", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "26 May 2020", "job_title": "Partner in Toronto, ON", "duration": "N/A", "pros": "Passionate young staff and worthwhile social mission.", "cons": "The CEO - over ten years into her tenure and with no end in sight - is not a serious person. Her decision-making is arbitrary and the directives that follow are ill-articulated, often internally contradictory, and counter to policies and good industry practices. She prizes external voices (which have their own agendas) over those of her staff. She is not equipped to advocate to her Board on behalf of the organization, and following each Board meeting, overturns months of staff work on the basis of her dire interpretation of an off-hand remark from a Board member. To work here is to see your best, good-faith, professional efforts systematically undermined time after time, year after year. It is not healthy. The best years of your career are better spent elsewhere.\r\n\r\nThe organization is in a perpetual state of turmoil as one after another set of consultants is brought onboard to reinvent systems and processes. The CEO knows the organization is dysfunctional, but fails to recognize that this dysfunction starts with her. Instead, she cloaks herself in one “bold” action after another (30M young people employed in 10 years! Pivoting on a dime to become an African organization!) when what is really called for is careful, stepwise growth grounded in organizational and personal humility.\r\n\r\nFollowing the CEO’s decision to dismiss 40 staff with centuries of collective experience (while preaching about the deeply held \"values\" of the organization), several of her senior staff have apparently come to the same conclusion, as they rush for the exits. The CEO made no effort to work with staff to develop new roles; she preferred to jettison them (curiously, many of those let go were the most experienced and critically-minded). And still, the Board renews the CEO’s tenure at great cost to the organization’s assets, its reputation, and its well-being. It’s an embarrassment.\r\n\r\nFor the Board: Ignore the criticisms of the CEO as the words of a few malcontents if you wish, but please ask yourself: Why aren’t other voices jumping to her defense? Why, when people cite the wise words of international development foundation CEOs in op-eds and at global conferences, is the Mastercard Foundation’s CEO not among those cited?"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Exciting Changes Are Happening", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Nov 2018", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "- its a great place to be if you are interested in helping to build and grow an organization. \n- must be a flexible and adaptable to work here\n- great work being done in Africa\n- flexible working arrangement", "cons": "- lots of work to do but more and more employees are joining the foundation which is helpful"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Program Manager", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Oct 2019", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "Smart and dedicated workers at the staff level.", "cons": "Terrible place to work. Leadership lacks vision, integrity and honesty. They are still way behind on diversity on inclusion. Very clear barriers for career advancement for Black staff despite their qualifications, experience and exposure. They keep making flimsy excuses not to promote and reward the hard work of minorities while playing petty politics.  No respect or trust for staff as a professional."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Terrible place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Nov 2018", "job_title": "Project Manager in Toronto, ON", "duration": "N/A", "pros": "Nice offices and amazingly talented staff.", "cons": "This place is a one woman show. The CEO and a handful of managers make all the decisions. The talents of amazing staff are wasted. You feel like you are wasting the best years of your career working here. Good work is rarely recongized."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jul 2020", "job_title": "Partner in Toronto, ON", "duration": "N/A", "pros": "Lots of money and potential to help youth in Africa.", "cons": "Leadership is lost. They are preoccupied politics and not results. It puts staff in unprofessional situations."}]]