[[{"date": "3 Apr 2023", "title": "Enrollment Services Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Carrington College (Pleasant Hill, CA) in Jan 2023", "Interview Descriptions": "Went through 2 interviews then was told there was no space on the campus. The recruiter then said the next best thing was joining the online team for rhe same position. Scheduled me for a 3rd interview (at this time it I had been in the interview process for 2 months). After all the calls and email check-ins I received a generated email saying they went with another candidate. No response from the recruiter as to where I missed the mark. By that time I had missed another opportunity for a similar position at another school.", "Interview Questions": "What is your experience in the proprietary education system?"}, {"date": "30 Nov 2022", "title": "Academic Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carrington College", "Interview Descriptions": "The interview process was fairly simple and easy. However, it seems that the campus experiences a lot of turnover based on the conversation I had with the interviewer. Not only was the position that I applied for vacant but the other coach and supervisor were leaving as well.", "Interview Questions": "What do you know about Carrington College?"}, {"date": "6 Mar 2022", "title": "Enrollment Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carrington College", "Interview Descriptions": "Invited for initial interview with Talent Acquisition member, then had second interview to meet with Assistant Director of Enrollment, Campus Director and final interview was to speak with Regional Director of Enrollment.", "Interview Questions": "Tell me about your prior Admissions/Sales Experience."}, {"date": "20 Nov 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carrington College", "Interview Descriptions": "Multiple steps before education verification and background check. Usually takes 2-3 weeks from start to finish. Meet with HR for screening first, then campus director/program director. May have a third interview with Program Director.", "Interview Questions": "Had to do a mock teaching presentation. 1-hour, subject of your choice"}, {"date": "24 Oct 2021", "title": "Enrollment Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Carrington College (Pleasant Hill, CA) in Sept 2021", "Interview Descriptions": "Interviewed by three different people and was offered position within 5 days of first interview. All interviews conducted virtually. Everyone courteous and professional. Process and follow up was 5 star experience.", "Interview Questions": "Am I comfortable in a metrics driven environment"}, {"date": "23 Jun 2021", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carrington College", "Interview Descriptions": "First there was a HR screening interview via phone \r\nThen there was a phone interview with the Regional Career Services Director.\r\nFinal interview was with the  Campus Director & Regional Career Services Director in person.", "Interview Questions": "What are your long and short term goals "}, {"date": "26 Mar 2021", "title": "Career Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carrington College", "Interview Descriptions": "Several interviews from start to finish. Phone screening interview with HR, phone interview with manager, and in person interview with manager. Medium level of difficulty. Entire  process took about 1 month. Manager was good with communication.", "Interview Questions": "Where do you see yourself in 3 years? How do you handle multiple priorities and interruptions?  Have you worked in a metric driven role?"}, {"date": "10 May 2023", "title": "Financial Service Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carrington College (Sacramento, CA) in Jan 2021", "Interview Descriptions": "Applied online, recruiter reached out two weeks later after finding my application for another position. Interview was scheduled and then it was canceled the morning of and rescheduled for the following week. The interview was conversational, overall positive. Typical recruiter questions, went over the position, tell me about yourself, why are you looking to work here, why are you leaving your job. Recruiter stated would give a call within 24 hours, two weeks later, still nothing. I think it's fair to say the reviews for the company on here are pretty accurate. The communication was poor, lack thereof.", "Interview Questions": "Tell me about yourself Why are you looking too work here Why are you leaving your current job"}, {"date": "10 Jan 2023", "title": "DON Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carrington College (Phoenix, AZ) in Jul 2020", "Interview Descriptions": "Recruiter Interview was very informal and relaxed. The facility interview was more detailed, with specific opportunities to discuss why you are the best candidate for the position. It was friendly and relaxed.", "Interview Questions": "Based on your experience, what do you think you bring to this position?"}, {"date": "12 Aug 2020", "title": "Assistant Director of Enrollment Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Carrington College (Pleasant Hill, CA) in Jun 2020", "Interview Descriptions": "A recruiter reached out to me for a screening, and recommended an interview a manager on campus, which was very pleasant. I was then contacted by the recruiter again to have an interview with their regional director. The interview was belittling and uncomfortable. I was asked questions about my previous salary, why I didn't apply for the role at my last job, and if I would take a position as a rep, rather than the director.  I was so INSULTED, I couldn't focus on his questions. I also learned, that someone in my network was hired for the position. The recruiter couldn't contact me to tell me they considered someone else, I had to find out through my own Linkedin Network.", "Interview Questions": "How much did you make in your last position? "}], [{"date": "2 Mar 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Carrington College (Phoenix, AZ) in Nov 2019", "Interview Descriptions": "I first had a telephone interview, once I made it through that process I had a panel interview with 5 employees and then a mock teaching session. I then had another phone interview with academic deans as well as regional directors.", "Interview Questions": "Tell me something about yourself you would not want anyone else to know about you. "}, {"date": "15 Nov 2021", "title": "Career Avisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carrington College (Sacramento, CA) in Jul 2019", "Interview Descriptions": "Very easy. Recruiter reaches out, followed by department manager then, campus president. Simple questions. All you need is basic customer service experience, situational experience, such as dealing with difficult customers, and multi-tasking skills.", "Interview Questions": "Situational questions, tell me about yourself, why are you interested, when can you start, etc"}, {"date": "28 May 2022", "title": "Director Financial Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Carrington College (Albuquerque, NM) in Jul 2018", "Interview Descriptions": "Meeting with the current campus director in her office.  The meeting was relaxed and casual.  We hit it off right away and discussed several topics such as the job, working with other departments, hours, etc.", "Interview Questions": "Strengths and weaknesses assessment questions"}, {"date": "1 May 2017", "title": "Student Finance Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carrington College", "Interview Descriptions": "Multiple interviews.  The process took so long I had already applied, interviewed, and gotten a position somewere else.  The process took nearly a month after the first phone screening  interview.", "Interview Questions": "When faced with many tasks, how do you  determine priority?"}, {"date": "12 Sept 2017", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carrington College (Chicago, IL) in May 2017", "Interview Descriptions": "Brief telephone interview just confirming your resume and educational background.  Then followed up with a formal telephone interview about three days later.  Then when you are \"screened\" you speak to the Dean, which was very informal.  If he'/she likes you, you must complete a background check packet and go for a drug screen.  When that comes back passing, you are scheduled for a mock teaching session in front of a Program Director and 2 other random people from the school.", "Interview Questions": "You have a student who is not performing up to standards or is acting out.  What would you do?"}, {"date": "9 Apr 2017", "title": "Treatment Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Carrington College (Brentwood, CA) in Mar 2017", "Interview Descriptions": "Applied online at Indeed.com; called in for interview.  Met with office manager and DDS; was told I would be called back for working interview that was never called for.", "Interview Questions": "How are your skills in the back office?"}, {"date": "14 Jun 2016", "title": "Enrollment Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carrington College (Albuquerque, NM) in Jun 2016", "Interview Descriptions": "It was a 3 week process. \r\nOne) Applied online and got a call the next day. Had me do an online skills and personality test.\r\n\r\nTwo) Had an initial phone interview 2 days after applying and immediately was offered 2nd in person interview. \r\n\r\nThree) In person interview was exactly one week after with the Assistant Director of Enrollement services. Asked behavioral question. Showed need for long term enployee. Very laid back and trying to get to know you instead of intimidating you.\r\n\r\nFour) Exactly one week later had phone interview with Regional director. Asked same questions as last interview. More formal. \r\n\r\nFive) 5 days later position was offered to me! Had me complete a background check.\r\n\r\nGreat interview process. Really kept me in the loop and looking forward to a great career!", "Interview Questions": "Tell me a time you had a issue with another department?\r\nTell me a time when you had to approach another coworker?"}, {"date": "30 May 2016", "title": "Teaching Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carrington College", "Interview Descriptions": "HR from headquarters contacted me. Interview over the phone first. Then I had an interview in person at the school. I was asked to do teach back. I did a great teaching demonstration. I was notified that I  got hired with a week after my teach back. The whole process about 3 weeks.", "Interview Questions": "How would you handle a challenging student."}, {"date": "31 Jul 2015", "title": "Enrollment Services Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Carrington College", "Interview Descriptions": "They have you go thru 2 interviews in person and two over the phone. This process takes about 6 weeks. It is overkill for a customer service job with a fancy title.", "Interview Questions": "The standard... Explain a situation where you handled a dissatisfied customer and how did that look?"}, {"date": "17 Sept 2015", "title": "Career Services Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carrington College (San Jose, CA) in Jul 2015", "Interview Descriptions": "I had applied for the position in April 2015. Received an email in July from a recruiter requesting a time to set up an appointment for a phone interview. If you pass the phone interview, they then send you an email to take an assessment test. If you pass the assessment test you receive a call from someone in Human Resources to schedule a face to face interview.", "Interview Questions": "What is your biggest accomplishment?\r\nHow do you handle a student who has been asked to be removed from their externsite."}], [{"date": "2 Jul 2015", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carrington College (Sacramento, CA)", "Interview Descriptions": "I started off with a phone interview which went great. The recruiter was very nice and made the process comfortable. Then I had the in person interview. The director was intense and told me that she has been looking for the \"perfect\" candidate for 7 months. 7 months???? That should have tipped me off that this was obviously not going to happen. If you are looking for someone for that long, the candidates aren't the problem. YOU ARE. I thought it went well overall but apparently I wasn't the \"perfect\" person she was looking for. I then emailed the recruiter asking about an update. She has blatantly ignored my emails. I should have known that the process would be unprofessional since this isn't a real university. Especially since the \"campus\" is a converted grocery store. Students and applicants beware!", "Interview Questions": "Typical STAR Questions."}, {"date": "17 Aug 2017", "title": "Community Outreach Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Carrington College (Mesquite, TX) in Aug 2014", "Interview Descriptions": "Was an internal transfer from Chicago. I had to meet with my director, then with the vice president, then with the director in Texas and ultimately with the director in phoenix. There were a total of seven interviews.", "Interview Questions": "If I could handle the heat in Texas."}, {"date": "30 Aug 2014", "title": "Director of Financial Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carrington College in Jun 2014", "Interview Descriptions": "Carrington Stockton was an impressive place to interview.  I was immediately given the impression that they cared for their students and staff.  The Campus President had answers for my questions which demonstrated effective leadership.  The phone interview which preceded the on site interview was not as intimidating as I thought it would be.  Everyone I spoke with, from the appointment scheduler to the interviewers, were professional and pleasant.  I was pleased with the clear approach to the process.  Every interaction ended with an explanation of the next step.  It is a long process, but they are very professional and upfront about it.", "Interview Questions": "Most of the questions were pretty standard."}, {"date": "28 Jan 2017", "title": "Instructor- Medical Billing and Coding Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carrington College (Sacramento, CA) in May 2014", "Interview Descriptions": "first i applied online, then I had to take 2 small tests and had a phone interview...last I had a group interview and had to do a demonstration in the classroom.", "Interview Questions": "What do I see myself doing in 5 years."}, {"date": "25 Aug 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Carrington College (Phoenix, AZ) in May 2014", "Interview Descriptions": "It was a lengthy process, starting with talent acquisition, then finally meeting the marketing team. There was a series of phone calls/interviews and two half-day long in-person interviews. They were more interested in me being a cultural fit than my skills, which I found interesting. I didn't get asked a lot about my resume or my experience.", "Interview Questions": "Why is a manhole cover round?"}, {"date": "23 Sept 2015", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Carrington College (San Jose, CA) in Mar 2014", "Interview Descriptions": "It was long.  Screening phone call to set up phone interview.  Phone interview is a behavioral interview.  After phone interview, applicants are required to do computer assessments.  These assessments are timed.  They include personality as well as critical thinking questions.  At that point in person interviews are scheduled with Dean and Executive Director.  Upon acceptance drug screening and background check are performed and then offer and negotiations can begin.", "Interview Questions": "phone interview is a behavioral interview"}, {"date": "2 Feb 2014", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Carrington College", "Interview Descriptions": "Completed the phone interview. She asked about every job I have ever had, what my strengths and weaknesses were at each one. Why I wanted to work for the Devry Education Group, standard questions. Then I had to complete an online assessment. After this they will call within a week or two to schedule an in person interview.", "Interview Questions": "N/A"}, {"date": "29 Oct 2015", "title": "Enrollment Services Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Carrington College (Phoenix, AZ) in Feb 2014", "Interview Descriptions": "-Basic interview process\r\n-Liked the idea that the team interviewed me as well\r\n-Overall a basic process for hiring, it wasn't anything extravagant and it was overly simplified or streamlined\r\n-I don't have anything additional to say on these topics but have to type something to meet the minimum requirements to post this experience", "Interview Questions": "-What will make you successfull in this role?"}, {"date": "16 Nov 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Carrington College", "Interview Descriptions": "First was invited in for a group interview where they had everyone stand up and do a mini presentation. Two interviews with Director of admissions and dean of school.", "Interview Questions": "N/A"}, {"date": "3 Mar 2016", "title": "Billing and Coding Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Carrington College (Boise, ID) in Jan 2012", "Interview Descriptions": "The process was involved.  I had three phone interviews. Then a barrage of online aptitude tests.  Finally, I secured a face-to-face interview with multiple staff members of Carrington College.  I met with the HR Managers, I met with a Campus Director, and I met with the Department Head.  Orientation consisted of a webinar conducted in a room by myself.", "Interview Questions": "What was my work experience related to medical billing and coding?  Am I comfortable with public speaking?  Did I have any teaching experience in an adult-learning environment."}], [{"date": "14 Oct 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carrington College (Spokane, WA) in May 2011", "Interview Descriptions": "Initial interview of basic questions such as my prior experience both technical and teaching. Some get to know you type questions followed by what the job responsibilities included.  Once you get past this they had me prepare a teaching demo that was presented to peers on a subject of their choice.  AFter that   Met with department lead and director of the school.  Interview was several years ago so do not remember many specifics.", "Interview Questions": "N/A"}, {"date": "17 Aug 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carrington College (Albuquerque, NM) in Feb 2011", "Interview Descriptions": "The manager had no prior supervisory experience. We had a nice conversation but the manager completely misrepresented the quality of the students enrolled. Many turned out to be emotionally unstable and the manager and school did not care whether the instructors were physically safe and able to be productive in their teaching and grading.", "Interview Questions": "What professional credentials do you have that we could encourage our students to pursue?\r\nCan you work with a prescribed lesson plan?"}]]