[[{"date": "26 Feb 2019", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University Online (Phila, PA) in Mar 2018", "Interview Descriptions": "The interview was based on instructional design experience. I was interviewed by three employees during a Zoom meeting. It was a fairly decent process, I had never been interviewed through a conference call before.", "Interview Questions": "Have you ever worked on a project that was given a deadline that was past due?"}, {"date": "16 May 2018", "title": "Senior Benefits Development Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University Online (Phila, PA) in Feb 2018", "Interview Descriptions": "The interview process in itself was pretty standard. The phone interview started on time, yet the recruiter seemed rushed during our agreed upon time slot. It was a little taken aback, but continued to focus on the task at hand.", "Interview Questions": "I was asked \"if I had a valid driver's license and/or access to a reliable vehicle\"? The question was a little strange, considering the original job post did not call for either.  "}, {"date": "19 Feb 2018", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Drexel University Online in Oct 2017", "Interview Descriptions": "Completed a brief phone screen and then was invited for an in-person interview. Met with the recruiter from HR that I spoke with on the phone, then I met with the Instructional Design Manager and a few employees. Within a few days, I was called with a job offer.", "Interview Questions": "How familiar are you with accessibility guidelines?"}, {"date": "8 Dec 2017", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Drexel University Online (Philadelphia, PA) in Aug 2017", "Interview Descriptions": "1. Phone interview with HR representative. \r\n2. In person interview with assistant director of the team that was hiring\r\n3. In person interview with director of Enrollment Services. \r\n\r\nProcess from application to offer took about 4 weeks.", "Interview Questions": "How will you ensure that each student receives the care and attention they need?"}, {"date": "21 Mar 2017", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Drexel University Online (Philadelphia, PA)", "Interview Descriptions": "I initially applied online and then was contacted nearly 2 months later to set up a phone screening. This lasted approximately 30 minutes. I was asked about my previous work experience, and how much time I spent on the phone on a given day in my last position. After the phone interview, I was contacted to set up an in-person interview. I interviewed with the Assistant Director of Enrollment Services. The interview questions were fairly typical, asking about my previous experience and how situations in those positions would help me in the Enrollment Counselor position. The interviewer read from a sheet of questions but she still did well in making me feel comfortable and like the situation wasn't overly formal. I received a lot of information about the position. In this role, you are expected to log 60 phone calls and 2 hours of talk time on the phone daily. Every few weeks you would have a meeting with your supervisor to go over a call of yours that was recorded and discuss ways to improve it, which made me feel like this position was more of a telemarketer than anything. It also made me uncomfortable that essentially you were being watched and recorded on the phone. Additionally, your hours throughout the week are 8-5 for 3 days, and 2 days you have to work from 11am-8pm. This interview took place on the \"garden level\" that the office was on. This \"garden level\" referred to a basement level of the building - no garden, and no windows. The office was dimly lit and very gray. After this interview, I was contacted shortly after to schedule a second, final interview with the Director of Enrollment Services. This interview asked several of the same questions and seemed to hone in on a few specifically. Throughout both interviews, there was a lot of focus on phone calls and this company quota that had to be met. Many questions involved asking how I would ensure I was just as positive and helpful from the first call to number 80. No matter which way it was spun, this was a telemarketing position more than anything and not the kind of Enrollment Counselor position that I was looking for. Not long after my final interview I was contacted and offered the position. I was given a couple of days to think it over and was told I could call/email back with my decision. I ended up declining the offer. I emailed the contact and never even received an email back as an acknowledgment of my response. This left me feeling as though they were just looking to get someone in there to fill the position and on the phones as fast as they could. After reading previous Glassdoor reviews as well, that was the overall feeling I got from this place.", "Interview Questions": "How does this position line up with your future/career goals?"}, {"date": "5 Aug 2018", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University Online (Philadelphia, PA) in Mar 2017", "Interview Descriptions": "3 steps: First was human resources. Super friendly and asked specific questions about the position and university. Second interview was with the assistant director.She was also very friendly and always smiled.Made me feel very comfortable and questions were mostly scenerio questions. Third interview was with the director. He talks alot and will ask questions in a weird way. He will talk in circles and can be a bit hard to follow. I ended up leaving after the second interview extremely hopeful, but I left the third interview feeling like I didn't get the job.", "Interview Questions": "Whats does success mean to you?\r\n(DUO has a webpage with general questions, which was asked by the assistant director.)"}, {"date": "15 Dec 2016", "title": "Events and Conferences Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University Online (Philadelphia, PA) in Dec 2016", "Interview Descriptions": "The woman I spoke with was extremely rude and condescending. I felt attacked throughout the interview process. Two minutes in I wanted to tell her I was no longer interested and hang up, however I chose to be the bigger person and treat her respectfully and so I finished the interview. I've never experienced anything like it, it was not enjoyable.", "Interview Questions": "Why are you interested in working for us?"}, {"date": "3 May 2016", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Drexel University Online (Philadelphia, PA)", "Interview Descriptions": "Had a phone screen with the HR representative that took about 30-45 minutes. Asked very general questions about myself and how I work in a team. About a week later, I was invited into the office for an interview with the supervisor and it was a very normal interview. They read the questions from a paper which I felt made the process more formal and somewhat uncomfortable than it needed to me. Had third interview with the department head.", "Interview Questions": "Do you have any experience working many hours on the phone?"}, {"date": "2 May 2016", "title": "Strategic Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Drexel University Online (Phila, PA) in Apr 2016", "Interview Descriptions": "I was contacted by HR for a phone screen and then interviewed by phone by the hiring manager.  Both were very professional and polite and took considerable time to explain the job responsibilities and interview process.   Interview was tough, asked a lot of difficult questions, be prepared!  Interview is process in long - four rounds.", "Interview Questions": "Compensation, right off the bat, in the first call.  Have your 'elevator pitch' ready."}, {"date": "2 Jun 2016", "title": "Senior Strategic Partnership Developer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University Online (Philadelphia, PA) in Feb 2016", "Interview Descriptions": "As described previous posts. Series of phone interviews, the first is screen about experience and salary.  Then in person panel with preso. The pay is 70's, if you want more- forget it.\r\nI declined because of low pay.", "Interview Questions": "Behavioral- how do you react when, explain how...."}], [{"date": "7 Sept 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Drexel University Online (Phil, KY) in Jan 2016", "Interview Descriptions": "Very easy and normal questions. Nothing out of the ordinary. They have you wait forever and you get to see some of the department. Looked pretty depressing in the online division.", "Interview Questions": "Why are you the best candidate for the job?"}, {"date": "27 Jul 2015", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University Online", "Interview Descriptions": "Scheduled a phone interview that was supposed to last 30 mins; the woman who interviewed me called ten minutes later than our scheduled time, no apology or mention that she was calling late. Interview lasted around 45 minutes. She kept saying \"okay, hold on...\" after nearly every answer I gave because, she told me, she was making sure to type up every single word I said. At one point she said her computer froze, and she then hand-wrote everything I said. At the end, she told me she would email me within a week to let me know ~either way~ if I was selected to come in for an in-person interview. After a week of not hearing anything, I sent her an email. Never heard anything back.", "Interview Questions": "How do you stay organized?\r\nThis position requires being on the phone for nearly 8 hours/day; would you truly and honestly be able to handle that?"}, {"date": "22 Mar 2016", "title": "Strategic Partnership-Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Drexel University Online (Philadelphia, PA) in Mar 2015", "Interview Descriptions": "Typical process: Internal recruiter phone screen 30 mins, then advanced to Hiring Manager phone interview 45 mins; then advanced to Director/VP phone interview;  then invited to present to team for 15 min with powerpoint.", "Interview Questions": "Behavioral: Tell me how you dealt with a difficult client or prospect.  Tell how you structure your work day, etc."}, {"date": "21 Jan 2013", "title": "Enrollment Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Drexel University Online (Philadelphia, PA) in Aug 2011", "Interview Descriptions": "It was very long. This is typical with higher education. Management would not get back to me for a couple of weeks. I am not sure what they were looking for.", "Interview Questions": "Please explain how awesome you are?"}, {"date": "24 Jul 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Drexel University Online (Philadelphia, PA) in Mar 2011", "Interview Descriptions": "The hiring process was very simple when I originally applied but the enrollment counselor interview process has gotten to be more drawn out over time. Questions were very easy - what you would find in a typical interview. Be sure to ask the right questions - this is looked at as a mix of inside sales as well as counseling. If you aren't numbers driven or can't stand making a bunch of calls each day, it may not be for you.", "Interview Questions": "Usual questions"}]]