[[{"date": "13 Feb 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at World Wildlife Fund (Singapore)", "Interview Descriptions": "The interview was conducted by the HR and the line manager. Both are friendly and nice during the whole process. So firstly it was self introduction, then the interviewers asked more details about the resume, after that came to the QA session. But seems they prefer a candidate that can work full-time for at least six months and whose first language is English.", "Interview Questions": "Which animal best represents your personality?"}, {"date": "20 Aug 2022", "title": "Graduate IT Role Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Great interview process -  shared about work experience in resume and elaborated on the experience. Had follow-up questions on the work experience. There were behavioural questions asked too.  Overall, the interview process was manageable as long as you had the work experience lined up and could elaborate well.", "Interview Questions": "Some questions asked were related to my work experience. Some other questions were more on the behavioural side - eg. \"If you had to face this issue, what would you do?\""}, {"date": "16 Mar 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "The first round of interview was with the team. Second round of interview was tgt with HR with other team members. The interview process was swift and professional. The HR informed me of the results within 3 days of the interview.", "Interview Questions": "Why do you want to work for an NGO?"}, {"date": "5 Dec 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "I interviewed at one of their regional offices after completing my undergraduate degree. I was asked about my experiences based off my CV, my interests and asked technical questions on how I would approach certain conservation projects.", "Interview Questions": "What is the first step you would take in determining whether a certain lake is pollution?"}, {"date": "7 Sept 2021", "title": "Sustainable Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Jun 2020", "Interview Descriptions": "Some very specific questions were asked on the sustainable finance scene and ESG scene. It was quite challenging to navigate through these questions but was overall a good experience. Interview was with 2 staff from the team.", "Interview Questions": "Tell us what you know about the sector. "}, {"date": "22 Aug 2021", "title": "Policy Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Feb 2020", "Interview Descriptions": "One of the best interviews I've ever had was with WWF-Singapore. From the first call I had with the HR until the interview with the hiring manager - every step of the hiring process was filled with respect. The questions asked by the two interviewees I had were relevant and carefully thought of. The interview felt more of a conversation because I was at my best self and there was no intimidation. I wish all other interviews were like that! I didn't get the job but I didn't feel bad at all because I was treated in a way that made me feel I mattered and my opinion counted. I was also given constructive feedback (through email) a few days after the interview. I didn't expect it because other companies would just ghost you if they didn't like you, right?\n\nSo, thank you WWF for the wonderful interview experience!", "Interview Questions": "What environmental policies in Singapore that you would want WWF to address?"}, {"date": "3 Feb 2021", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at World Wildlife Fund (Singapore) in Jan 2019", "Interview Descriptions": "The interviewer is engaging and introduces the history of WWF well. Encourage those who would like sales experience to give this job a try as the interview is not demanding or scary, but rather, reflected the firm warm hospitality", "Interview Questions": "What did you know  about WWF? \r\nWhy did you want to work here?"}, {"date": "30 Jan 2021", "title": "Internal Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Singapore) in May 2018", "Interview Descriptions": "Call with Swiss counterpart first. Then assignment, and second interview with Singapore head of comms and line manager.\n\nCronyism is strongly at play here - the Singapore head and manager are both of Indian nationality. Was told to come in and interview, but got asked inane questions and my assignment wasn’t even reviewed.\n\nDidn’t get turned down, but checked on LinkedIn to see another person of Indian nationality got the job. Was I the token Singaporean to fill the interview quota?", "Interview Questions": "What did you do in xxx? (The interviewer asked about every single of my 6 jobs. No creativity maybe?)"}, {"date": "30 Jan 2018", "title": "Assistant Campaign Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Singapore) in Oct 2017", "Interview Descriptions": "Fairly standard 1 hour long interview. Interviewer asked questions to survey work experience and tested me on the spot to pick my brain for ideas. The inexperienced HR executive who was part of the 2 person interview panel asked only 2 really basic questions throughout. They're impressed and told me they would get in touch with me but sad to say, neither of them bothered to reply. In the end, this job position closed and I found out that they took my ideas and launched them into a new content marketing direction. HORRIBLE BRAIN PICKERS.", "Interview Questions": "Give us ideas on how to market an existing campaign."}, {"date": "20 Feb 2017", "title": "Conservation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Singapore) in Jan 2017", "Interview Descriptions": "Mainly questions on my experiences and how I could apply those experiences for the job scope. After which, the interviewer explained the the work that they have done and what would be the contribution of the intern to their work.", "Interview Questions": "What do you know about the work of WWF?\r\n"}]]