[[{"date": "12 Jun 2023", "title": "Bioinformatics Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "The screening interview was 30 minutes long over zoom. The next interview would have been in-person with several members of the team, along with a tour of the place, but I didn't make it that far.", "Interview Questions": "Why should we hire you for this position?"}, {"date": "7 Jun 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "Can you please provide me with some information about yourself, such as your interests and any relevant experience? Additionally, I'm curious about what specifically piqued your interest in this opportunity. Lastly, could you please answer some basic behavioral questions? Thank you.", "Interview Questions": "Tell me about youself why are you interested some basic behavioural questions"}, {"date": "23 Jun 2023", "title": "Senior strategist - research communication Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Nationwide Children's Hospital (Columbus, OH) in May 2023", "Interview Descriptions": "5 interviews total over the course of 3 weeks; 2 virtual and 3 in-person Consistent email communication regarding next steps Online application submitted References requested during final stages of interview process", "Interview Questions": "How does your previous experience translate to what you'd bring to this role?"}, {"date": "25 Apr 2023", "title": "Peer Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2023", "Interview Descriptions": "it was great and informative I enjoyed speaking with her, she answered all my questions. I liked the interview questions, they were thoughtful and I felt like they got a good feel for who I am", "Interview Questions": "give me an example of how you handle DEI"}, {"date": "7 May 2023", "title": "MHS Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2023", "Interview Descriptions": "The hiring process was long and complicated. First, I had to qualify for an interview time slot for a big hiring event by getting past the computer gatekeeper.  Candidates were being sent home left and right because the computer gatekeeper apparently let a lot of people through that didn’t make the cut.  They were all sent home for not having one full year experience in a medical setting in the last 3 years. I even witnessed one who worked in a chemical dependency program  for 11 months who was told to come back in 30 days. Brutal! Then there  were a couple of weeks of waiting for background checks and such. NCH has this whole process down to a science and all of it was painlessly done online. \n\nThe only thing that really stood out was that every piece of paperwork indicated that the drug test would be a urinalysis, including the ones I signed that gave permission to legally collect my bodily fluid samples in the first place. However, they had me shove a sandpaper feeling sponge in my mouth and rub it around for 10 minutes to gather up some saliva instead, turning the inside of my mouth to ground meat in the process. The tech said, “Oh, yeah. We switched to saliva tests a couple of months ago.” \n\nThis felt almost like a staged “gotcha moment” and did very little to instill trust in NCH as a potential employer. This stands especially true when you get into the organization and realize that NCH is meticulous about literally every minute detail and “mistakes” like outdated paperwork being distributed for months on end simply don’t happen. This was the only part of the process that made me question my interest in working for NCH. It was seriously shady.", "Interview Questions": "How will you take care of your own mental health when you are being exposed to the trauma that you will see being experienced by children and families, day in and day out?"}, {"date": "17 Dec 2022", "title": "Perioperative technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Very easy - 3 stage review. 1 with a recruiter, 2nd with manager and a lead tech, then 3rd with 2 team members. Generally to ask about you and who you are, and if you are a good fit for the team culture.", "Interview Questions": "What do you to hold yourself accountable?"}, {"date": "8 Feb 2023", "title": "Histology Trainee Laboratory Scientist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Nov 2022", "Interview Descriptions": "Was pretty quick process, great communication with HR and hiring manager. The interview process was simple, vetted with HR via video conference then scheduled interview with hiring manager. Couldn’t accept job bc of hours.", "Interview Questions": "Example of a time worked with a difficult team member and how did I address it."}, {"date": "24 Oct 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Positive experience - great new facilities and nice amenities. The benefits could use some work though. Really nice people and a good location near german village. Hope to get it.", "Interview Questions": "Please review your prior research publications"}, {"date": "2 Sept 2022", "title": "Admin 2 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "The process is usually HR will contact you through email to set up a Virtual interview.  They will give you times to pick from for the interview. They will give you a link from web x, Microsoft, or zoom. You say “yes” or “no” to the email of whether you except the interview or not", "Interview Questions": "Tell me about yourself and your work history."}, {"date": "13 Jul 2022", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Interviewed by HR and then two of the department heads. The process was alright, stressful. Ask you questions about your experience and if you can handle the work environment. It is a lengthy training process.", "Interview Questions": "They asked about my previous experience in mental health work. "}], [{"date": "26 Jun 2022", "title": "Emergency Communications Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Since I interviewed during COVID, I had an all online interview. The manger was very relaxed, and it seemed very relaxed. While they work hard, they also seem to have a good time.", "Interview Questions": "Briefly tell me about yourself."}, {"date": "10 May 2022", "title": "Behavioral Clinic CRC I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Two part interview with manager and current CRC II’s on zoom. Answering questions and having an opportunity to ask questions in both parts. Nice and welcoming team. Communication after the interview was hard since I had to wait for the first interviews to be completed before hearing if I moved onto to the second round of interviews.", "Interview Questions": "Are you okay with sitting and being at a desk for the majority of the work day?"}, {"date": "17 May 2022", "title": "Project Engineering Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in May 2022", "Interview Descriptions": "Quick to respond and set up the interview.  HR was very helpful in answering questions and giving specific parking, location and process instruction.  Very nice experience.  Seems like a great group and place to work.", "Interview Questions": "Are you a good team player?"}, {"date": "20 Apr 2022", "title": "Summer Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "I applied and got a call for an interview about 3 weeks later.  I interviewed with HR online and then got another call a few weeks later to interview with a specific unit. I talked to 2 people in person. Got the job offer like 2 weeks later. Everyone was super nice and questions were to be expected.", "Interview Questions": "What do you do to ensure patient safety?"}, {"date": "4 Apr 2022", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Quick phone interview followed by an in person 2 hour walkthrough and questioning. Met with all departments and had extensive time with the supervisor overseeing the position.  Other lab technicians were able to sit down in groups and ask questions as well which was appreciated.", "Interview Questions": "How do you work as a team? What time management skills do you have?"}, {"date": "25 Jul 2022", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2022", "Interview Descriptions": "It was a multiple round process via zoom and was pretty formal. The people I spoke with were not very warm, other than the HR recruiter. It was Q and A, but a conversation.", "Interview Questions": "What was one experience and caused you to act in a crises? "}, {"date": "30 Apr 2023", "title": "Undergraduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital in Apr 2022", "Interview Descriptions": "in person interview, they ask ur experience and work and how you would contribute. interview was over 1 hour long. three different people. very stress less and very nice people", "Interview Questions": "have not heard back on offfer"}, {"date": "4 Feb 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Manager forgot about the interview and had to reschedule, video interview rescheduled. In person interview went well. Did not offer a shadow.  Quick response after interview. HR talent coordinated interview process", "Interview Questions": "Situational questions\r\nQuestions about yourself and how you take care of you"}, {"date": "24 Feb 2022", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital in Jan 2022", "Interview Descriptions": "Contacted via email to set up interview a few days after applying. First interview was over Webex, it went well, she actually told me another unit I applied to was interested and that my next interview would be at the hospital, with both unit managers. I interviewed with both managers, I thought they went well, they made it seem as if I was a perfect fit, and their mannerisms and things they were saying made it seem like I definitely got the job. A few days after that, I received the basic thanks, but no thanks email.", "Interview Questions": "Tell me about yourself\r\nTell me about a mistake you made\r\nStrengths/weaknesses\r\nTell me about a time you went above and beyond for a patient\r\n"}, {"date": "27 Dec 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Talked to 5 people one-on-one, each person told me about their role and asked me different questions. They were very very unorganized. It was in person and took about an hour or so.", "Interview Questions": "What is your research experience? "}], [{"date": "25 Oct 2021", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "I was given a tour of the facility and then sat down with the supervisor and manager to go through my resume and a list of their prepared questions. They made sure to give plenty of time for my own questions at the end.", "Interview Questions": "What drew you to this position?"}, {"date": "7 Oct 2021", "title": "Supply Chain Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Very simple, first interview with recruiter, second with manager, and third with team. Mostly behavioral questions during the interviews, very friendly interviewers. All very passionate about the work they do at Nationwide Children's Hospital.", "Interview Questions": "Tell me about a time when you dealt with someone on a team who wasn't up to standards and was resistant to change and how you addressed that. "}, {"date": "1 Oct 2021", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Coordinator reaches out to you to schedule a virtual interview, then you meet with the recruiter virtual as well as add references. If all goes well then you meet with the manager and if the ref come back great and manager wants to move forward. You will get a offer", "Interview Questions": "Behavioral based interview question for HR "}, {"date": "19 Feb 2023", "title": "Managing Editor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital in Sept 2021", "Interview Descriptions": "Was contacted by email to schedule interview and have five references fill out a form. Had a short phone interview with an HR person, who was nice and told me I'd be contacted either way, which did not happen.", "Interview Questions": "Why do you want to work at NCH?"}, {"date": "7 Aug 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Short and easy to follow. Everyone was nice and helpful throughout the process. Nationwide is a very selective hospital and it can be difficult to find a job unless you have connections on the inside.", "Interview Questions": "What is one thing you could bring to the table"}, {"date": "31 Jul 2021", "title": "Admin Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Efficient and quick. Interviews were scheduled and completed within 2 weeks of submitting my application. The interviewers asked insightful and relevant questions about my interest and work experience. They answered all my questions honestly, allowing me to gain a better understanding of the organization.", "Interview Questions": "Why do you want to work here"}, {"date": "25 Jun 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2021", "Interview Descriptions": "apply online at childrens nationwide hospital and then waited two weeks received an email with HR employee that she would like to shcedule a phone call for research assistant position", "Interview Questions": "tell me about yourself, prior research experience "}, {"date": "31 May 2021", "title": "PCA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Zoom interview then in person interview first with HR then with the managers on the unit to which I applied. Similar questions were asked in each, very laid back overall.", "Interview Questions": "What is one difficult think you experienced in healthcare that you had to overcome? "}, {"date": "22 Jun 2021", "title": "Central Scheduling Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2021", "Interview Descriptions": "Great, they were very nice & seemed passionate about their work. It seems like a great place to work but ultimately, I decided that it wasn’t the right fit for me at this time.", "Interview Questions": "Why do you want to work at NWCH?\r\n\r\nWhat would your current manager say about you?\r\n\r\nWhat are some of your weaknesses?\r\n\r\nWhy do you want to leave your current job?\r\n\r\nDo you think you will adapt well to this position?\r\n\r\nWhat are you strengths?\r\n\r\n\r\n\r\n"}, {"date": "11 Oct 2021", "title": "Room Service Ambasser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2021", "Interview Descriptions": "the interview process was quick and easy no hard question. what's your strength and weakness.  full time or part time . experience why children's  how do you handle stress at a job", "Interview Questions": "hour you can work  and what days "}], [{"date": "20 May 2021", "title": "Autism Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Interview process was pretty standard. I went through 3 rounds before being hired: phone interview with Talent Acquisition, phone interview with supervisor, then zoom interview.  It was pretty standard overall!! Everyone made me feel very comfortable & relaxed.", "Interview Questions": "About my past experiences & roles."}, {"date": "19 May 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "I had two 45 minute interviews - one was with a supervisor, and the other one with the PI. They occurred a a few weeks apart. Received an offer shortly after my last interview. It was a very organized proecss.", "Interview Questions": "Please describe your current role."}, {"date": "26 May 2021", "title": "Clinician I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in May 2021", "Interview Descriptions": "Had a phone screen, an in person interview with HR and a supervisor, and a second interview with HR and team members. The last one never happened though. They canceled and rejected me the day before, no other contact at that point until I reached out to confirm.", "Interview Questions": "Why Nationwide Children's? Experience with/preferred modalities? Etc. Nothing too out of the way for a therapist position."}, {"date": "12 Jul 2021", "title": "Rehab Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in May 2021", "Interview Descriptions": "The interviewer wouldn't let me hardly speak & interrupted me when I tried to answer their questions. It was frustrating to be able to advocate for myself & explain my abilities not listed on my resume", "Interview Questions": "What is one strength, what is one weakness, what are my plans after college"}, {"date": "28 Apr 2021", "title": "Medical Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital in Apr 2021", "Interview Descriptions": "1 week after I submitted my application, I received a text and email to set up an interview. The interview was conducted on Webex by the hiring manager and took approximately 30 minutes.  Hiring manager indicated I should get an update by the end of that week or the beginning of the next.  After two weeks had past, I emailed for an update but did not hear anything back. After three weeks, I received an email stating the position had been cancelled/offered to someone else (this last point was unclear).", "Interview Questions": "1. Why do you want to work at Nationwide Children's?\n2. Describe your background.\n3. Describe a situation where you had to deal with a difficult person.\n4. Explain how you approach diversity in the workplace.\n5. Describe a time where you didn't do your best work.\n6. Where do you see yourself in five years?"}, {"date": "4 Jun 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2021", "Interview Descriptions": "I applied online. I was contacted by a recruiter via email for a video interview call. Shortly after that, I was contacted for a video interview with the team and hiring manager. The interview went great. I met with 4 people. They made it like I was a great fit and they would be moving forward. \n\nThe next day I was contacted by text and email to submit 5 references. A little overkill. The recruiter ghosted me and was not transparent about the process and was rude after that. \n\nI am sure they do great things- but the process needs big improvement. \n\nA month later I got a standard thanks but no thanks email. I was really disappointed with the whole experience. \n\nNo way would I recommend anyone consider that company.", "Interview Questions": "What do you like to do for fun?"}, {"date": "4 Aug 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2021", "Interview Descriptions": "Was initially difficult to schedule an interview.  I needed to contact HR multiple times.  Multiple positions open within the hospital due to staffing shortages.  Salary offer was not competitive compared to other health systems.", "Interview Questions": "How soon can you start"}, {"date": "27 Mar 2021", "title": "Behavioral Health Outpatient Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "There have been phone calls from human resources, a resume had to be sent to the program, zoom interviews with program staff to ensure a good fit, a zoom interview with the clinical director, emails from program, etc.", "Interview Questions": "Previous work history and future goals"}, {"date": "25 Feb 2021", "title": "Clinical Informatics Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 days. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "One of the worst interviews I’ve had. Recruiter was very rude on the phone from the beginning and seemed uninterested in trying to understand my experience/background. Felt like a waste of time for both of us. I wouldn’t want to work for a place where recruiters treat potential employees this poorly.", "Interview Questions": "Why did you apply for this position"}, {"date": "5 Feb 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Interviews with two managers. Each interview was 45 minutes. They asked a lot of great scenario related questions. They were both friendly. They did a great job of explaining the job and what my role would be.", "Interview Questions": "Why do you want to work at Nationwide? Asked scenario questions on how you would handle different situations."}], [{"date": "25 Jun 2021", "title": "Bioinformatics Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2021", "Interview Descriptions": "It was long, virtual (because of Covid), but very well co-ordinated and well explained. I met with 5 PIs and a bioinformatician over a period of 1 week. Everyone had different projects and requirements, however I was sure if I had to let them know the projects that interested me most to least.", "Interview Questions": "There was a coding exercise to be completed within 24 hours in a language of your preference."}, {"date": "11 Feb 2022", "title": "Outreach Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nationwide Children's Hospital in Feb 2021", "Interview Descriptions": "The process consisted of 1 prospect interview with the hiring manager, 2 short interviews with a recruiter, and then a series of 4-5 interviews with the team. Although I understand the need to speak with the team, this made the process stretch to about 3 months end to end.", "Interview Questions": "How would you improve programs should you get the role."}, {"date": "20 Jan 2021", "title": "Health Information Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Summer internship learning about ROI. Internship was helpful and taught me a lot. It was frustrating to deal with customers but the staff you work with is a lot of fun and will get you through it.", "Interview Questions": "How would you deal with angry customers"}, {"date": "27 Sept 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital in Jan 2021", "Interview Descriptions": "First had a webex interview, then an in person interview. Overall an easy and comfortable experience, I was given time to ask staff questions as well and see the building.", "Interview Questions": "Job history and my educational background."}, {"date": "21 Jan 2021", "title": "Intake Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2021", "Interview Descriptions": "A lot of answering interview questions and feedback on the questions. Also, salary negotiations During the first interview. Prepare a reason why you want work at nationwide specifically, This seems to be one of the more important questions.", "Interview Questions": "Why I Wanted to work at nationwide Children’s Hospital?"}, {"date": "2 Dec 2020", "title": "Quality Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "they ask you about strengths and weaknesses and why you want to work there and think you are a good canidate. have a panel of 5 people asking you questions", "Interview Questions": "Q: why are you the best canidate?"}, {"date": "27 Mar 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Dec 2020", "Interview Descriptions": "I was asked to set up a time to talk, which ended up being a full one hour official interview, not just a chat. I did mine over Zoom because of COIVD. I introduced myself to the team then they each took turns asking me questions. Notes were not taken, the point of the interview was to get a sense of if they liked me and thought I could fulfill the role.", "Interview Questions": "What makes you unique? (why should we hire you)"}, {"date": "17 Nov 2020", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Nov 2020", "Interview Descriptions": "Relaxed and friendly. Both the ladies I interviewed with were easy to talk to. The first interview prepared me for what to expect in the second one. If recommend bruising up on your typing and math skills prior to the interview.", "Interview Questions": "Why do I want to work there?"}, {"date": "14 Sept 2020", "title": "Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Overall very straightforward process. I applied through my school and the PI contacted me directly to schedule a call. Definitely should know some of the papers for the lab and be able to walk through them.", "Interview Questions": "Go through your laboratory skills."}], [{"date": "8 Sept 2020", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Interview process included an initial phone interview conducted by panel of faculty,  followed by an in person interview. The in person interview was a full day and consisted of meeting faculty, staff, and a hospital tour.", "Interview Questions": "Research experience, interests, future plans "}, {"date": "11 Oct 2020", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Nationwide Children's Hospital in Sept 2020", "Interview Descriptions": "It was a two step interview process. The first interview was on a conference call with a panel of 7 people. Each person asked one question. The second interview was with 2 people, each asked 2 questions", "Interview Questions": "Why do you want to work here "}, {"date": "9 May 2021", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital in Sept 2020", "Interview Descriptions": "Applied online, had an initial video interview with the lab PI, followed by another formal video interview with the PI and an HR representative and another two video interviews with two other PIs from other labs. Whole interview process took about 2-3 weeks.", "Interview Questions": "What are some challenges you have faced in your research?"}, {"date": "4 Aug 2022", "title": "Senior Talent Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2020", "Interview Descriptions": "Extensive written recommendations for the apucation, telephone screen with HR, followed by Zoom with the potential direct manager, them a presentation of two workforce solutions proposals. \nThe presentation was quite extensive.", "Interview Questions": "Mostly questions about self and social awareness and navigating once  you are in the door."}, {"date": "24 Jun 2022", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital in Jul 2020", "Interview Descriptions": "Multiple interviews with multiple managers. Phone interview p, zoom, and in person. Did some math calculations. Very easy. It was the basic routine questions. The interview was overall very smooth. It’s very easy to prepare for. The in person was a bit confusing because of the building", "Interview Questions": "They asked about my previous jobs and what I learned from Them."}, {"date": "22 Oct 2020", "title": "ETL Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital in Jul 2020", "Interview Descriptions": "Had initial recruiter call and he tried to drag me to lower pay by changing numbers multiple times and also said it would takes 2-3 months from hiring manager on initial resume review which is not reasonable. No transparency, Not even worth applying .", "Interview Questions": "Salary expectation\r\nIntroduction\r\nAny questions?"}, {"date": "30 Jun 2020", "title": "Mental Health Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2020", "Interview Descriptions": "I had a phone interview first which was about 20/30 minutes and then was offered a second in person interview at the hospital. The in person interview was also about 30 minutes and asked about the same questions but just more in depth. And explained the day to day work this position required.", "Interview Questions": "Why are you interested in this position? "}, {"date": "6 Apr 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Started with a phone interview that went well and I was asked to come in for an in person interview. It was a 30 min interview asking about prior research experience.", "Interview Questions": "What research techniques do you know. "}, {"date": "6 Jan 2020", "title": "Administrative Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "Interviewed for several position. One interview was with 8 people and lasted for several hours. Completely too much for Admin position. then had to complete 20 minute assessment. Job was not offer to me", "Interview Questions": "Why do you want to work here"}, {"date": "11 Dec 2019", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Nov 2019", "Interview Descriptions": "Friendly and helpful staff, quick wait times in interview waiting area. Clean environment and kind interviewers. Quick to hear back over email and phone after applying and quickly scheduled an interview date and time.", "Interview Questions": "What position/department would I like to work in and what hours suit best for me"}], [{"date": "4 Oct 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Straight forward process beginning with a phone interview followed by a panel with HR department. They wanted to know what I hoped to gain out of the internship experience and really see if I was a good fit.", "Interview Questions": "Talk about a time where you had to change your communication method "}, {"date": "21 Aug 2019", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2019", "Interview Descriptions": "It was a group panel where members of the panel took turns asking you questions. It was slightly intimidating as they all took notes as you spoke, but they had very friendly personalities.", "Interview Questions": "What does working in a team mean to you?"}, {"date": "18 Jun 2019", "title": "Administrative Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "General interview questions about past experience as well as role-playing questions and different scenarios. The whole process took about 20-30 minutes and there was time for questions at the end.", "Interview Questions": "Describe a previous situation in which you experienced conflict and how you handled it."}, {"date": "5 Jul 2019", "title": "Ambulatory RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH) in May 2019", "Interview Descriptions": "Met with HR rep for about an half hour, discussed past work history and was asked the usual interview questions. And then the Nurse Manager of the floor on which I was interviewing for gave me a tour and then interviewed me again in private.", "Interview Questions": "Name a situation in which you I countered conflict and how you set with it"}, {"date": "9 Apr 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Within a couple weeks of applying I heard from the project manager to set up a phone interview. I was then contacted about an in person review and heard back about the job quickly compared to other jobs I applied to.", "Interview Questions": "What do you hope to get out of this job in terms of your career path?"}, {"date": "2 May 2021", "title": "Clinical Genomics Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2019", "Interview Descriptions": "I was invited for a phone interview initially and once I passed the first phone screening, I was invited for an on-site interview (all day event) starting with me presenting my work.", "Interview Questions": "Why I want this career? Why there?"}, {"date": "12 Aug 2019", "title": "Mental Health Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2019", "Interview Descriptions": "applied online, received a phone call and was asked a few questions about myself and my interest in the job, was offered an interview, interviewed with HR and then interviewed with manager", "Interview Questions": "Q: If you saw a fellow staff member on the unit not following safety protocols, how would you handle that?"}, {"date": "1 Aug 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2019", "Interview Descriptions": "Completed online application. Received an email invite to interview.  Attended the interview and three weeks later was offered the position.Two weeks later I attended the orientation, which an eight hour day.", "Interview Questions": "How do you resolve conflict in a department?"}, {"date": "25 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "I didn't have to go through in an interview, I'm honestly just filling this out because I want to see more things on glassdoor and it prompted me to fill out a review", "Interview Questions": "What are your strengths"}, {"date": "19 Feb 2019", "title": "Genetic Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "The interview process was not very difficult. The first step included a phone interview with HR and then the hiring manager. Then they called me onsite for a 1 hour interview. Lastly, they asked for five references.", "Interview Questions": "Why NCH?\r\nWhy this position?"}], [{"date": "22 May 2019", "title": "Postdoctoral Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2019", "Interview Descriptions": "I first had a 25 minute phone interview prior to the in person interview.\r\nThe interview process involved several hours of interviewing with a various teams and divisions in the department I would have been housed in. \r\nI met with division heads and other postdoctoral researchers, and was given a brief tour of lab space.", "Interview Questions": "What project would you lead on your own if you could?"}, {"date": "22 Apr 2021", "title": "Mental Health Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2019", "Interview Descriptions": "Great process. Appropriate amount of time. Appropriate questions. On time. Got back to me in good amount of time. Appreciative of the time they took to ask about myself. Good eye contact. Great posture.", "Interview Questions": "What are some of your strengths?"}, {"date": "6 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Nov 2018", "Interview Descriptions": "Interview process was very quick. I had an interview two weeks after submitting my application, which consisted of a brief interview with HR and then a 30 minute interview with the unit manager.", "Interview Questions": "What does teamwork mean to you? "}, {"date": "21 Aug 2018", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2018", "Interview Descriptions": "HR will either contact you by email or phone call, come in for an initial interview with a recruiter. Then you will meet with a unit nurse, he/she will ask you basic questions like any standard interview but don't be fooled. On their job ads, they don't require you to have experience as a PCA as long as you meet their pre-requirements to apply for said position. If you have no experience as a PCA they WILL NOT HIRE YOU.", "Interview Questions": "Why do you want to work at Children's?"}, {"date": "18 Apr 2022", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2018", "Interview Descriptions": "The interview process had a reasonable amount of structure as I met with appropriate people.  The process was transparent and communication during the process was excellent. All of my concerns were addressed.", "Interview Questions": "Why do you want this job?"}, {"date": "17 Jun 2018", "title": "Quality Outreach Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Applied for the job online. Did not hear any feedback until 2 weeks after application submission. Received a call to set up a phone interview. After phone interview, I went in for an in person interview.", "Interview Questions": "What is your greatest quality?"}, {"date": "30 Jun 2018", "title": "Genetic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2018", "Interview Descriptions": "Pleasant, and relaxed. Starts off with a tour/explanation of the job. You tell them your relevant experience, you get asked questions back at the office, and you get to ask questions. Make sure you ask lots of questions! It is crucial.", "Interview Questions": "What experience do you have relevant to the job?"}, {"date": "22 Jun 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2018", "Interview Descriptions": "Two interviews, one over the phone and another in person. Overall basic questions about your experience and technical abilities. Interview was 30 mins, and a tour of the lab was given.", "Interview Questions": "Tell me about yourself?"}, {"date": "11 Apr 2018", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Very smooth and organized. \r\n1st you will meet with HR for an initial interview.\r\n2nd they will give you a tour of your department and interview with the managers  in which the department you are applying for", "Interview Questions": "How would you deal with a difficult family member or patient?"}, {"date": "23 Apr 2018", "title": "Intellectual Property Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2018", "Interview Descriptions": "The team I met with was a lot of fun, and I felt the questions ranged in their complexity.  The first interview was supposed to be the only one, and I sat in a room with the entire team and answered questions in a round.  They decided to do a second interview, and I understood. I felt I was strong in the first, but likely a little unsure of myself.  In the second interview, they split the team up in to two. The first group walked me through a generalized overview of their process and I asked questions, etc.  The second group was a little more casual and we were able to get to know each other a little better.  There's nothing I could say that's bad about the people I met as far as the department itself.  I was, however, a little disappointed and surprised at the poor follow up to this interview. I felt the recruiter was a little evasive. I didn't hear from him for a while, and when it became clear that I likely did not get the position because it had been so long since I heard from anyone, I honestly thought he was just going to ghost me.  I had to email him and ask him to please consider me moving forward and thank him again to prompt him to write back a quick email saying they'd gone with someone with more Intellectual Property experience.  I felt he could have called me and I felt he could have been a little bit more transparent throughout the entire process.   I felt that I gave them my time and full attention and care, and it wasn't necessarily returned in this particular situation.", "Interview Questions": "They asked a lot of open ended questions and also gave me a lot of space to ask my own."}], [{"date": "1 Mar 2018", "title": "Behavioral Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "I met with HR for 30 minutes then 1 hour with the unit supervisor and MD supervising the program. I was then given a tour of the unit.", "Interview Questions": "I was asked to participate in 2 role plays. I was the clinician for an angry parent who's child was taken on the unit and for a 14 year old female with SI. "}, {"date": "17 Mar 2018", "title": "Scheduler Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nationwide Children's Hospital (New York, NY) in Mar 2018", "Interview Descriptions": "The initial interview was over the phone. It was very professional. They asked several questions. I was able to ask questions about the position. They were very informative and detailed.", "Interview Questions": "What do you have to offer to our company?"}, {"date": "6 Apr 2018", "title": "Simulation Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2018", "Interview Descriptions": "Interview was very relaxed and felt like I was talking to friends. I interviewed with two physicians that over see education, four simulation coordinators and the manager. The process was long  due to other applicants going through the all the interviews.", "Interview Questions": "What was an innovative design or concept that you took lead on?"}, {"date": "28 Feb 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2018", "Interview Descriptions": "Phone call. Meeting with HR. Meeting with hiring manager(s). Whole process took about 2-3 weeks. After phone call offer is accepted, then you are scheduled for Employee Health, drug screen, background check, and orientation.", "Interview Questions": "Please share a time when you disagreed with someone on an important issue, and how you handled it."}, {"date": "10 Feb 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2018", "Interview Descriptions": "Project manager interviewed for one hour. Its a one on one meeting. They mostly asked questions from my resume and some behavioral questions. She said they are looking for somebody who can manage a big team.", "Interview Questions": "how do I manage stakeholder meeting with multiple people"}, {"date": "21 Feb 2019", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2018", "Interview Descriptions": "Thorough and interesting. Got to know each other very well. Had lunch with several leaders. Met a lot of the team. There were some gaps in the onsite interview day, but it went by very fast.", "Interview Questions": "What I aspire to be."}, {"date": "5 Feb 2018", "title": "Pharmacist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2018", "Interview Descriptions": "I applies online and then the recruiter for in person interview. When i went in, I was first interview by the  HR manager. After I was done with the HR manger,  I was then interview by the Pharmacy manager along side with the  Night Shift manager.  After the interview , i was given a tour of the hospital and the pharmacy", "Interview Questions": "Tell me about a time you went above and beyond for a patient "}, {"date": "12 Jun 2018", "title": "Constant Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nationwide Children's Hospital in Dec 2017", "Interview Descriptions": "Very nice , went over resume , asked basic interview questions . Nurse manager and Recruiter were both in the interview . Both very nice and open and honest about the position", "Interview Questions": "What are one of your weaknesses"}, {"date": "25 Feb 2018", "title": "Behavioral Health Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Nov 2017", "Interview Descriptions": "Had one interview with the panel and HR. Everyone is nice and friendly.   No offer was given and no explanation as to why. Interviews were fairly straight forward, no surprises.", "Interview Questions": "1. Tell me a litte about yourself\r\n2. Explain yout previous work experience \r\n3. what will you do if the children refuse to cooperate your plans?"}, {"date": "11 Oct 2017", "title": "QA Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "First I had a 1 on 1 interview with the lab manager. After that, I interviewed with a panel of 3 current employees: the head of the department, my prospective trainer, and the shift leader. The panel interview felt very relaxed. I did go through a recruiter and I feel it made it easier to get the position as I've been unable to get an interview with Nationwide in the past.", "Interview Questions": "Would you feel comfortable making a 2 year verbal commitment to the company?"}], [{"date": "15 Oct 2017", "title": "Lead Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nationwide Children's Hospital (Westerville, OH) in Oct 2017", "Interview Descriptions": "It was a VERY thorough interview process. There were four interviews in all! First with the hiring manager, then a group of three clinical directors, then a one on one with another clinic’s director, and finally a one on one with the Behavioral Health Operations Manager.", "Interview Questions": "What do you think you can bring to this role?/Why are you applying for this title?"}, {"date": "8 Sept 2017", "title": "Administrative II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "I had two interviews, and got to meet the whole administrative team to answer questions and hear about how what they enjoy about working in the specific department. It was very eye opening and calm and approachable.", "Interview Questions": "Why do you want to work here?"}, {"date": "26 Sept 2017", "title": "Lab Courier Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Sept 2017", "Interview Descriptions": "Over the phone interview then in person interview. I was declined for the position for \"lack of driving experience\" but the interviewer gave me my salary and sample schedule during the interview.", "Interview Questions": "Why do you want to be a courier?"}, {"date": "15 Oct 2017", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Sept 2017", "Interview Descriptions": "No personal contact in first part of the application process. An online math test with personality questions. It seemed more psychology based with often repeated questions about work preferences. Was frustrating knowing how to answer words like \"obsess\" and \"need\".  I prefer \"committed to\" and \"prefer\".  It was hard to know what they were looking for.", "Interview Questions": "Rate the level of how you \"obsess\" over work projects"}, {"date": "4 Dec 2019", "title": "Cook I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2017", "Interview Descriptions": "I had an awesome recruiter to begin with. Interview was very informal and enjoyable. Background check was lengthy. Physical and medical process was thorough but was  comfortable and enjoyable", "Interview Questions": "How reliable I was as far as reporting on time"}, {"date": "12 Jul 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jul 2017", "Interview Descriptions": "Went well - thorough. I enjoyed the process, everyone was helpful and very kind. I felt open to ask a lot of questions and they encouraged me to check in", "Interview Questions": "If I was available 8 am - 5pm monday thru friday"}, {"date": "25 Feb 2018", "title": "Community Based Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2017", "Interview Descriptions": "HR interviewed me half an hour and the panel interviewed me for the other half. HR asked me most of the questions. The panel asked me several questions about my preference of the work setting and population.", "Interview Questions": "How would your supervisor describe your strength and weaknesses?"}, {"date": "10 May 2017", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "Full Day of Interviews and three weeks until I heard back.  Some were late to show up due to traveling to site of interview and they felt rushed. Interview room was nice and parking was paid for.", "Interview Questions": "What are your Leadership strengths?"}, {"date": "28 Apr 2017", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2017", "Interview Descriptions": "It was very informal.  Met with the Chief who gave me a tour and introduced me to the hiring manager where I had an on the spot interview with two separate individuals.", "Interview Questions": "My Strenghts"}, {"date": "22 Feb 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2017", "Interview Descriptions": "Group interview with 3 other candidates, we were given information about Nationwide and then split up and interviewed with two Social Workers at a time. The entire process was pretty easy. They did not ask very many questions.", "Interview Questions": "Why did you choose Nationwide"}], [{"date": "7 Nov 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2017", "Interview Descriptions": "Through a staffing agency, I was placed at Nationwide Children's Hospital. I was notified I had an interview on a specific date. I then interviewed with a couple people from the department.", "Interview Questions": "How I handled an adverse situation at a previous employer"}, {"date": "26 Jul 2019", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2017", "Interview Descriptions": "Met with hr and then the hiring manager. Took about 4 weeks to get a call for interview. Once interviewed took only a few days to hear back. Everyone was very nice and welcoming.", "Interview Questions": "Why do you want to work here? "}, {"date": "24 Jan 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "I met with an HR rep to discuss my previous roles and my experience. We discussed the job I was applying for and how I would be a good fit for the organization.", "Interview Questions": "Why do you want to work at Children's?"}, {"date": "26 Dec 2018", "title": "Urgent Care Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2017", "Interview Descriptions": "I emailed the online contact and they wrote me about the position. I did a short phone interview and they offered an in person interview. Everything was paid on our behalf.  I met with about >6 various members of the team such as the section chief, administrators, etc.", "Interview Questions": "Standard interview questions also what I would like to know about the position, fairly laid back."}, {"date": "27 Nov 2016", "title": "UR Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "I applied online, recevied a call from HR , set a time to meet.  I completed questionaire , typical when on-site , we then discussed my history, education, salary and expectations of the position.   He asked when I would like to begin the position, i said at least 3 weeks notice, i was to wait and hear from the HR dept.  It took less than one week.", "Interview Questions": "What was is your present position and why are you leaving"}, {"date": "27 Oct 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Two interviews- with HR and with PI. It was intimidating, but they were nice. They asked a lot about experience. It helps to do research about the studies they are doing.", "Interview Questions": "Describe your past research experience"}, {"date": "3 Nov 2016", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Oct 2016", "Interview Descriptions": "Applied Online\r\nReceived Call \r\nWent in for ONE Interview with the supervisor of that specific department\r\n\r\nI met with the supervisor after having applied online. I went in later that week. It was more like a conversation and human centered. It was not a long list of unnecessary questions. NWCH definitely employs updated recruiting and interviewing tactics. I have had 2 other more recent interviews and it seems to be the norm.", "Interview Questions": "Why do you want to work for NWCH"}, {"date": "13 Sept 2019", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Sept 2016", "Interview Descriptions": "Very easy going took a tour of the department everyone is very nice. If hired you'll do a drug test an orientation just like any other employer. Your learn about the benefits package an retirement pages as well.  There could be over 200 people there an it could last 6 to 8 hours long. They do offer lunch to all the new hires", "Interview Questions": "They just asked what my goals were, what made me interested in the position with children's hospital"}, {"date": "5 Aug 2016", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "sat in front of supervisors and they asked questions about what you would do in situations and how you would react to kids and things that security deals with. They wanted to know about other stuff I did that wasn't security to know how you are as a person", "Interview Questions": "What is your experence in security."}, {"date": "27 Sept 2016", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2016", "Interview Descriptions": "The interview was good and the manager was nice, even though I don't know some questions he still can help me. But it took about three months to hear back after the onsite interview.", "Interview Questions": "Asked about the project"}], [{"date": "7 Mar 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2016", "Interview Descriptions": "Brief phone interview with manager and longer Skype interview with 3 person panel (over Skype because I wasn't local at the time). Interviews were easy and laid-back, everyone seemed friendly. Heard back within a few weeks of the Skype interview.", "Interview Questions": "Describe your research experience?"}, {"date": "2 Nov 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2016", "Interview Descriptions": "They send an email about setting up an interview, depending on the recruit you can get an interview quick or you get the run around for a week or two. Once you have your interview you are asked to fill out a reference sheet on their portal and they have to be able to get a hold of all your references. Then you will receive a call or email offering you the position.", "Interview Questions": "What skills can you bring to the nationwide children's hospital team?"}, {"date": "22 Mar 2016", "title": "Community Therapist- School Based Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2016", "Interview Descriptions": "I originally applied for a different position that I ended up not being super qualified for. Their HR rep reached out to me and looked into alternative opportunities that I would be interested in /good at.\r\n\r\n1. Phone screening with HR\r\n2. Met with the school based team for first interview (clinical/diagnostic questions)\r\n3. Interview with school based team's supervisor (two role plays) \r\nAfter the interviews, they had 5 references fill out a survey via email.", "Interview Questions": "What differential diagnosis would you give to a child who has been diagnosed with ADHD?"}, {"date": "25 May 2017", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2016", "Interview Descriptions": "Initially was a one on one interview, but was shifted to a panel interview in a some what whimsical fashion.  Low pressure questions about past experiences, no aptitude/riddle questions were asked.", "Interview Questions": "What techniques would you use to expedite a task from a coworker"}, {"date": "30 Aug 2017", "title": "Clinical Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2016", "Interview Descriptions": "Time between contacts was too long.  Phone calls and emails were not returned timely.  The human resource department is unorganized and it was difficult to get through to talk with the staff.", "Interview Questions": "Do you agree to get a flu shot?"}, {"date": "11 Sept 2016", "title": "Quality Outreach Coordinator-Partner for Kids Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2016", "Interview Descriptions": "It was a very smooth interview process. General questions about why I want to work in that department. I did two interviews. The first one was with the hiring manager and the second one was with the team. They both were average.", "Interview Questions": "Why do you want to work for Partner for Kids? What you do know about Partner for Kids?"}, {"date": "9 Dec 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "Situation and behavior type questions, be prepared, often meet with hr first then a manager in the department, references checked closely, background check, wear comfortable shoes as you may have to walk far to the manager", "Interview Questions": "Why do you want to work at NCH?"}, {"date": "2 Mar 2016", "title": "Parent Partner - SPARK Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Dec 2015", "Interview Descriptions": "First I  met with the recruiter at the HR Office.  He asked many questions about my background and experience.  The expected salary for the position was discussed at this point.  I was then directed to another location to interview with the hiring manager.  The manager reviewed my resume' and asked more in depth questions about my background and interests.  Work hours were discussed along with a brief overview of the department.", "Interview Questions": "What attracted to you to this position?"}, {"date": "17 Sept 2016", "title": "Licensed Practical Nurse Close to Home Centers Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Dec 2015", "Interview Descriptions": "The interview process was professional, fast and very straight to the point. I met with a recruiter and he talked me through the whole process while walking to our destination. Upon arrival, he asked me a series of questions and then made copies of my ID and CPR card. He then lead me to who would become my manager so I could have a meet and greet with her. I later had a day to shadow at a clinic.", "Interview Questions": "How did you hand a difficult situation at you current job?"}, {"date": "6 Sept 2015", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "The interview process was very extensive. They required me to interview first with an HR rep. and then another clinical research coordinator on the team and the clinical research program manager for the second interview. I was then called in for a third interview with the PI. Lastly, I was asked back to interview with the Director of Clinical Research Services.", "Interview Questions": "They asked a lot about my previous experience. "}], [{"date": "12 Aug 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Had two in person interviews. The second interview included a laboratory tour and meeting with potential co workers. No offer was given and no explanation as to why. Interviews were fairly straight forward, no surprises.", "Interview Questions": "Do you prefer a predictable, repetitive work environment or one that changes often?"}, {"date": "3 Feb 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2015", "Interview Descriptions": "The interview went very good. The interviewer was fair with his questions and was able to give me an overview of work environment at Nationwide Children's Hospital. I also had to make a presentation that went pretty good and successful.", "Interview Questions": "N/A"}, {"date": "22 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "laid back. not too hard to do. really easy questions, more of a culture fit than anything else. Unpaid position means less stressful interview. i enjoyed the fact that it wasn't too hard to do because i felt as if some of the other places that i had applied and interviewed with took the process far too seriously for an unpaid position.", "Interview Questions": "What is something about you that is not on your resume?"}, {"date": "28 Jul 2015", "title": "Billing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2015", "Interview Descriptions": "Very easy, all my questions were answered. They were very thorough with the job requirements and expectations. Interview was about an hour long. The job seemed like one I would enjoy.", "Interview Questions": "Strengths and Weaknesses"}, {"date": "4 Jun 2015", "title": "Communication Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Got email for in-person interview with HR.  Met with recruiter, then moved to supervisor and another manager.  Followed up with everyone I met, never heard back about position.", "Interview Questions": "Are you willing to work occasional nights and weekends?"}, {"date": "11 Dec 2018", "title": "Housekeeper Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2015", "Interview Descriptions": "Very short but informative. Manager that interviewed with was very kind and punctual. Overall great experience with the interview. Everyone encountered was very helpful. Great environment through the whole property.", "Interview Questions": "Why I wanted to work there.?"}, {"date": "1 May 2015", "title": "Employer Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "The interviewers were all very nice and professional. Very easy to be myself and ask various questions. I would say that the interview process went very well, and was very easy for those with natural and relaxed personalities.", "Interview Questions": "Name something creative that you've done?"}, {"date": "3 Aug 2015", "title": "Social Worker (Comm Support Worker II) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in May 2015", "Interview Descriptions": "I was contacted about the social work positions after submitting a resume for review for a different position.  Overall the interview process went smoothly.  I first spoke with a recruiter who discussed what the job was and what type of candidate they were looking for.  At the conclusion of the phone call we set a date for the interview.  At the interview I first met with the recruiter and then with the respective Social Work managers.", "Interview Questions": "I was given 4 Social Work cases and asked how I would prioritize them over the course of the day."}, {"date": "24 Mar 2015", "title": "Private Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Very poor communication from HR. Led me to believe I was a good candidate for a position they eventually decided I was not qualified for. Surveyed my references for no reason.", "Interview Questions": "Describe your strengths and weaknesses."}, {"date": "15 Jun 2015", "title": "Behavioral Health Team Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2015", "Interview Descriptions": "It's a long process, but worth it if you stick with it. You need 5 professional references, a meeting with HR, sometimes a group panel interview if multiple teams are interested, then individual interviews. Make sure to be familiar with assessing, diagnosing, and treatment modalities.", "Interview Questions": "How would you assess for depression?"}], [{"date": "23 Apr 2015", "title": "Information Systems Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2015", "Interview Descriptions": "One in-person interview, waste of my time as they look at peoples physical features not your true skills, they may be hiring people they know not a fair interview at all.", "Interview Questions": "Went over the same questions that were on my resume and told me the technical department was not able to interview me after I drove all the way downtown."}, {"date": "1 Jan 2015", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "Most communications are done by phone calls with their talent and acquisition office.  The recruiters are very pleasant and seem to be working for the best of the job candidate.  Arrive early for interviews as you first meet with recruiters and then are sent off to the interview which was a long walk through the hospital to the research buildings.", "Interview Questions": "General interview questions were asked.  Nothing out of the ordinary."}, {"date": "21 Mar 2017", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2015", "Interview Descriptions": "It was a very casual interview. I was asked my experiences, where I saw myself in 10 years, what my prospective salary was, and what my most important moment in college was. The interview was fast and painless.", "Interview Questions": "What do order these values. Safety, speed or Quality."}, {"date": "2 Jun 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital in Nov 2014", "Interview Descriptions": "I was called within two weeks of applying and had a brief phone interview with a HR Representative. He then set up an interview with myself and the manager. The interview with the manager was a typical interview with questions about my previous work experience, why I want to work for NWC, etc. I left the interview feeling confident. I was called the next day with an offer that was a little too low, did not match my years of experience in registration. I counter offered with a fair salary. I was notified later the same day that my counter offer was accepted. The orientation and training was thorough and helpful. I'm still a proud member of this team.", "Interview Questions": "How do you handle working with a number of individuals with different personalities?"}, {"date": "29 Nov 2014", "title": "Behavioral Health, Parent Advisor Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital in Nov 2014", "Interview Descriptions": "This was a position I previously interviewed 2x for and was passed over ~ interviews were difficult, if going by job description there is no way you would be at all prepared. I was called back after being passed over several months before. Went through another round of anxiety ridden interviews with the same hiring managers again giving conflicting feedback. I was told they \"really liked me\" that I had \" improved\" did \"great\" that hiring would finalize by the end of that week. Two weeks later I get a nice phone call telling me they are sorry that it was taking longer then anticipated and that it was due to internal scheduling conflicts.  One week after that I  get a call saying \"I am sorry, my intention was to hire you, but at the last minute someone applied and had just a few more points then you\" apparently you get points during the interview?  I was pretty shocked,really was enthusiastic about position. I'm pretty sure I was just a back up all along~like we will hire her if no one better comes. I was pretty bruised, couldn't believe I was passed over twice for the same job within 3 months. Why in the world would anyone call an applicant back in , an applicant that they had several lengthy interviews with,  completed 5 reference checks on and ultimately rejected, to do the same process all over , minus reference checking with no real genuine intent to offer them the position .", "Interview Questions": "Not really difficult questions but conflicting statements about actual scope/role of position, from hiring managers, a sense they didn't exactly know what they wanted. Interviews included role plays with very little prep information. Although,I felt the 2nd time around was a bit easier because I knew what to expect. "}, {"date": "24 Oct 2014", "title": "IT Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH)", "Interview Descriptions": "Two lengthy phone interviews to confirm my lengthy background with Nationwide's current software systems and my management experience. After the positive phone interviews a face to face meeting was set up. \r\nDuring face to face meetings no further questions were posed regarding my experience and all meetings were brief.\r\nIt appeared I was being screened for physical appearance. The next day I received a call stating that another candidate was better suited for the position. This could not have been the case because of my exclusive healthcare background and experience with their Lawson Software systems. I am in my low 50's and plan to work another 15-20 years. I am active and physically fit as well. My salary requirements aligned perfectly with the position as well. My age was the determining factor in not getting hired.\r\nUnfortunately the best experience and qualifications do not always mean a company will look beyond age. This is not an equal opportunity employer.", "Interview Questions": "We are looking for succession planning. Are you willing to move within the company as needed?"}, {"date": "30 Sept 2014", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Nationwide Children's Hospital in Sept 2014", "Interview Descriptions": "Applied online, received phone call the next day. Took a simple math and logic test followed by a in person interview. There are several things I wish to warn potential applicants about when applying for jobs at Nationwide. First, do not trust the job description/and or requirements listed on any literature, they are highly inaccurate, and if used for research purposes will lead to you not being hired. For this position, Nationwide listed the requirements as being a high school graduate with some experience in hospital or mental health field, a bachelors degree candidate would be given preference. \r\n\r\nI am a 2nd year graduate student studying neuro and addiction psychology, and the interview questions presented were designed for someone who has been in the mental health field for many years, and if you only possessed a high school diploma (or even B.S.) you would probably have zero answers. In short, there is no possible way a high school graduate or B.S. degree holder would have any knowledge of processes and questions asked during interviews \r\n\r\nAnother tip: Nationwide will not hire anyone, or move forward in the hiring processes unless you have a minimum of 5...yes 5 professional references that have a valid email address in which they are willing to fill out a survey about you. If they do not have a valid email address, you will not be considered for employment.\r\n\r\nMy advice, tread with care, if you receive an offer at another health system or employer I would highly advise you to take that position.", "Interview Questions": "Please tell us a time when your treatment style conflicted with your supervisors, what did you do to handle this conflict?"}, {"date": "22 Aug 2014", "title": "Secuity Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital", "Interview Descriptions": "selection process,extensive background check,3 interveiws,medical evaluation, bonding , insurance , preventitive shots, HR keeps you well informed as to what each phase you completed an what is next.you a given a tour an informed of various aspects of job an what to expect", "Interview Questions": "N/A"}, {"date": "14 Jun 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2014", "Interview Descriptions": "I actually got an email reminding me when to come to the interview. The only problem: I didn't apply for that job and never got a call about it. When I called HR they apologized, said it was a mistake then offered an interview (it was a huge interviewing thing for the switch from McKesson to Epic). I obviously agreed. Two women interviewed me at a table in the middle of a conference room surrounded by about 20 other interviews going on. Really weird, but NOT their usual.", "Interview Questions": "Tell me an example of a time you made a difference for a patient"}, {"date": "23 Jan 2017", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Feb 2014", "Interview Descriptions": "First I had a phone call with HR. Next I had an initial interview with the hiring manager and peers in my department. Lastly I had a second and final interview with the senior manager.", "Interview Questions": "Tell me about yourself"}], [{"date": "4 Feb 2014", "title": "Physician Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital in Jan 2014", "Interview Descriptions": "I initially replied to a posting on LinkedIn.  I received an email asking me to fill out the full application online which was very lengthy and repetitive.  Once that was complete I was emailed a short questionnaire to fill out with questions related to my experience and the position.  After that was completed I was invited in for a 1:1 interview with the Dir of Employment Services.  The interview lasted approximately 45 minutes.  I was told that she was wrapping up interviews within the week and would let me know a decision either way.  After three weeks with no contact, I sent an email to which I received a quick reply saying that they moved forward with a different candidate.", "Interview Questions": "Pretty general recruiting interview questions"}, {"date": "22 Jan 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2014", "Interview Descriptions": "Pretty informal, met with the manager. They had a group of 30 of us and were planning on selecting 10 to be interns. They asked the basic questions. I have nothing else to remark on it, it was a while ago.", "Interview Questions": "Describe ITIL"}, {"date": "18 Oct 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Dec 2013", "Interview Descriptions": "Interviewed with HR then with section manager and then with department manager and staff MD. Direct supervisor, 2 RNs and a lead secretary were present during the interview. Met with one of the staff MDs and she asked some role specific questions and how I would handle certain situations. Everyone was very personable.", "Interview Questions": "Why do you want to work for Nationwide Childrens?"}, {"date": "7 Mar 2017", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Dec 2013", "Interview Descriptions": "It was challenging and exceeded my expectations. First IVd with HR rep for an hour, then hiring manager. Invited to return to IV with project management. Impromptu IV with larger team", "Interview Questions": "What is your experience with account management and laboratory skills"}, {"date": "27 Aug 2013", "title": "Housekeeping Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2013", "Interview Descriptions": "I have put so many applications in and had like 3 interviews", "Interview Questions": "when they call can you come in for enterview "}, {"date": "22 Jul 2014", "title": "BH Community Based Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jul 2013", "Interview Descriptions": "I interviewed 4 different times for the same position. Additionally I spoke with the HR Recruiter 2 different times. Interview process was anxiety ridden. I received the interview through attending a job fair at the hospital. The recruiter immediately followed up with me and provided interviews for 2 different Behavioral Health Positions within the hospital.", "Interview Questions": "Demonstrate a role play detailing how you would discuss behavioral issues with a teacher whom doesn't understand how to teach to students with learning disabilities."}, {"date": "13 Aug 2015", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jun 2013", "Interview Descriptions": "First did phone interview, then the in-person interview, interview was very easy due to I had a lot of experience in the cleaning. Then we talk about compensation of the position interviewer stated it would be on the high side but when I the recruiter call me it and told me the amount I would be making it was actually on the low side", "Interview Questions": "Why do you want to work for Nationwide Children's Hospital?"}, {"date": "29 Jun 2015", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Omaha, NE) in May 2013", "Interview Descriptions": "Phone interview with HR.\r\nDrug test\r\nbackground check \r\n6 days later get formal interview with Management in my area\r\nthan 4 days later get called for scheduling for the job.\r\nIs huge processes that half time didn't know if I passed or not.\r\nHad personality test and math test and typing test which passed all on certain score they have.", "Interview Questions": "Why do you want to work at these hospital?"}, {"date": "21 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2013", "Interview Descriptions": "Applied online and was given a phone interview about 3 weeks later. I then met with 3 senior leaders 4 days later and was given the position via telephone 2 hours later. Nothing stood out about the interview process. They were more interested in my interests and why I wanted to work for the organization.", "Interview Questions": "Why did you want to become a manager?"}, {"date": "1 Jul 2013", "title": "RN Clinic Position Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital in Mar 2013", "Interview Descriptions": "Several interviews with recruiter, with hiring managers, hiring manager professional, recruiter absolutely rude and unprofessional", "Interview Questions": "Nothing was unusual"}], [{"date": "29 Nov 2016", "title": "Synagis Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in May 2012", "Interview Descriptions": "A recruiter from HR called me one random day, and told me that the manager of Homecare specifically requested me for a new position they opened up. I applied online and the next week I had an interview. It was a one on one interview with the hiring manager. Second interview was with the team.", "Interview Questions": "Tell us a little about yourself. What qualities do you have that could utilize in this position?"}, {"date": "27 Nov 2012", "title": "Graduate Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2012", "Interview Descriptions": "I had an initial phone interview after the connection had been established by my PhD mentor. We then had a casual interview during which we discussed my research experience, career trajectory, interests, skills, etc. I had already been working for another PI in Research, so we also discussed what I was currently doing and what I was hoping to get from a new position in terms of content, schedule, and tuition funding. Several more emails, phone calls, and informal meetings happened before the university worked out joint funding with the research department I was going to work with.", "Interview Questions": "What do you want to do when you finish your PhD?"}, {"date": "19 Jul 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2012", "Interview Descriptions": "I Applied online.   received a call from HR to do and phone interview.  Waited a week then received call to set up interview.  Met wth HR rep and went over generalities then met with the hiring manager.  Salary is not confirmed.   Once I received the job offer you will need to negotiate salary at that time,  Before starting you will be scheduled for a drug and TB testing as well as ID picture session.   Then you will attend a two day long orientation.", "Interview Questions": "why nationwide.   Big on people choosing to work here for more than just money"}, {"date": "29 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2012", "Interview Descriptions": "Applied online and received call from HR department a few weeks later. Interviewed with HR and then met with the unit manager the same day. Received offer the following week.", "Interview Questions": "Tell about a time you were involved in conflict in the work environment and how you handled it."}, {"date": "24 May 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Nov 2011", "Interview Descriptions": "I applied for the position, it took quite some time to get a call back along with several calls to HR to follow up. In addition my referral continuously called the employer to ask them to interview me. Once I received a phone call to come in for an interview I had a one on one with someone in HR, then they forwarded my information to move on to second/third interview with someone in the specific department I applied for. Once at my final interview it was myself along with 2 department supervisors and they extended the offer. I have also applied for job transfers within Children's, at that point if they decide to interview you for the position, you skip the interview with HR and move directly into the series of interviews within the department as well as a job shadow to make sure it is a good fit. During one of my interviews it was 4:1 and they used a lot of pressure to see if you are a good fit and can handle high stress situations. (There was a series of 3 interviews and then 1 job shadowing to make sure was a good fit).", "Interview Questions": "How to handle certain workplace situations (Ex: how to deal with irate patients, difficult situations you have dealt with, how to handle workplace hostility). Also why I felt I would be a good fit and what I had to offer to the department. They also asked me if I understood the job responsibilities of the position I applied for. "}, {"date": "17 Mar 2014", "title": "Systems Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Aug 2011", "Interview Descriptions": "First, you meet with a representative from Human Resources.  She will ask you general questions that try to size up your personality.  Then you interview with your potential manager and they will ask more position-centric questions and give you a technical assessment.  Usually the assessment is JavaScript or .NET.  After that, there is a panel interview with the people that you would actually work with, and yes they are judging your abilities and whether or not they want to work with you.  After that, it's usually a week before you get an offer.", "Interview Questions": "Name a time where you worked with someone who was difficult to work with and what did you do to alleviate the problem?"}, {"date": "25 Apr 2012", "title": "Data Architect Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Apr 2011", "Interview Descriptions": "I was considering a salary position after being out on my own consulting as a software architect and manager for over 5 years.  When I showed up at HR it was like they were herding cattle.   When the receptionist pointed me to the no cell phone sign I promptly left the building to complete my conversation.  The meeting with the HR person for the specific IT department went like this.  \r\n\r\nIT HR:  What are you looking to make?\r\nME:  What is the salary range?\r\nIT HR:  I can only tell you the bottom of the range is 56,000\r\nME:  That's less than I was making in 1999 (10+ yrs ago).  I'm over six figures now.\r\n(at this point the HR person was ready to end the interview had I not said...)\r\nME:  Why don't I meet the team and talk to them for a bit and find out what type of things they are working on.\r\n\r\n(at which point I had a great conversation about the impact and opportunity of the Internet on Healthcare, and mobile technologies, with a couple middle managers for 1.5 hours.  During the conversation it became clear they wanted an ETL/database monkey and the position was not for me, but it was a nice conversation none the less.)", "Interview Questions": "How much are you looking to make?"}, {"date": "13 Jun 2012", "title": "Senior IT Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2011", "Interview Descriptions": "Easy interviiew", "Interview Questions": "How do you handle conflict"}, {"date": "28 Mar 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Jan 2011", "Interview Descriptions": "Simple. Submit using online tool. Arrive to sign for drug test and speak with recruiter. Quick notification.", "Interview Questions": "N/A"}, {"date": "7 Jan 2012", "title": "Psychology Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Dec 2010", "Interview Descriptions": "I had to go through the national internship match service, APPIC.", "Interview Questions": "I didn't have any difficult questions, the process was more conversational"}], [{"date": "15 Aug 2012", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Nov 2010", "Interview Descriptions": "I was already working at Children's, so the first interview was in person. A little bit of a meet and greet. The second interview was a ssh session and assessment of my programming skills. There were three questions, that were mostly scripting based questions. I also met with the rest of the staff. After accepting the job, and then going through the process from the other perspective, meeting the staff is important and is used to determine if the interviewee is a good fit.", "Interview Questions": "Because this is a position that involved biological research, there was a question that went deeper into my biological knowledge than I expected. Be prepared to answer questions from all areas."}, {"date": "16 Oct 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Sept 2010", "Interview Descriptions": "I was contacted by HR a couple of weeks after I submitted my application online. I first interviewed with an HR manager and the interview questions were pretty typical. I then moved on to move to the department that I worked in to do an interview with people who were on my team. They were incredibly nice and genuinely seemed interested in my work experience. I felt comfortable the entire time. They had other candidates to interview after me, so I was offered the job about 2 weeks later and accepted.", "Interview Questions": "Name a difficulty work experience you had to overcome."}, {"date": "20 Apr 2010", "title": "Sponsored Projects Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 days. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2010", "Interview Descriptions": "Human resources phone screen was well organized and informative. Human resources 1:1 interview consisted of mostly background/experience questions and was well managed. Direct manager 1:1 interview consisted of questions and discussion on how background/experience would relate to the position and specific position details. Panel interview with individuals in the position I was interviewing for was unexpected and personnel were rather unfriendly, disinterested and unhelpful, mostly taking occasion to discuss why someone would not want this job.", "Interview Questions": "How much time are you comfortable sitting at a computer?"}, {"date": "27 Feb 2011", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Mar 2010", "Interview Descriptions": "Initial phone/E-mail contact with department admin. & main doctor.  Flew down from NYC for an interview. Talked to several doctors and went to several locations where they see patients/do research.  More informal discussion of my background, what the job entails, etc.  I paid for my own flight & hotel room etc., followed up twice when I got home, and NEVER heard back from anyone.  Unprofessional, horrible, and just lacking the common decency to give me a call or send me an e-mail to let me know if I had gotten the job or not.", "Interview Questions": "What was your thesis about? "}, {"date": "19 Nov 2013", "title": "Human Resources Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Nationwide Children's Hospital in Oct 2009", "Interview Descriptions": "Received a quick response to application submitted; interview was professional", "Interview Questions": "None were difficult or unexpected"}, {"date": "5 May 2010", "title": "Systems Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Nationwide Children's Hospital (Columbus, OH) in Dec 2008", "Interview Descriptions": "It was a well designed process that was easy to follow and involved many interviews.", "Interview Questions": "How would your experience help in your new role?"}]]