[[{"date": "28 May 2023", "title": "English Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAP Community Foundation (Jurong East New Town, )", "Interview Descriptions": "Hiring process was initially through Zoom. The hiring manager and principal was very friendly and the whole process was fast. They also asked me questions related to my prior experiences and were very receptive to the answers.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jul 2023", "title": "Executive, Learning & Development Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at PAP Community Foundation (Singapore) in May 2023", "Interview Descriptions": "Received a message from the hiring manager via WhatsApp. Had a short voice call at 9 pm on Friday to schedule the interview. The interview was held at HQ and was an hour long. The department director and manager asked questions regarding experience and character.", "Interview Questions": "Tell me more about your experience at ______."}, {"date": "28 Apr 2023", "title": "English Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAP Community Foundation (Pasir Panjang, )", "Interview Descriptions": "Good flow of conversation. The interviewer was very friendly and I was able to share and discuss my concerns and doubts. It was a good experience as my first time attending an interview.", "Interview Questions": "questions regarding teaching in a preschool"}, {"date": "24 Nov 2021", "title": "Trainee Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PAP Community Foundation in Nov 2021", "Interview Descriptions": "Friendly interviewer. The full interview process went straightforward and smoothly. They advised me on what to expect from the job and the career progression I can have by taking the job.", "Interview Questions": "What makes me to apply for this position?"}, {"date": "7 Oct 2021", "title": "Preschool Teacher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at PAP Community Foundation", "Interview Descriptions": "It was simple, direct, and easy-going. Interviewer asked questions about my future plans and views on children.  Great start for those who want to be in the early childhood industry. However, it depends on which center you are posted to.", "Interview Questions": "What do you see yourself doing in 5 years? \nDo you have any experience with children? \nWhat makes you want to join us? "}, {"date": "16 Feb 2021", "title": "English Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PAP Community Foundation", "Interview Descriptions": "Interview with centre head for EL teacher position. Interview process was smooth and fast. Get your necessary documents ready and good to have photocopies of them. Good to share examples of your teaching strategies to give them a better idea.", "Interview Questions": "Why do you choose to join PCF?"}, {"date": "1 Nov 2020", "title": "HR-Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PAP Community Foundation", "Interview Descriptions": "It was relaxed with only 2 interviewers who were very friendly. Spent about 45min in the interview and the interviewers were very open to sharing about the job expectations etc.", "Interview Questions": "What skills do you have that would help you with this job?"}, {"date": "21 Mar 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PAP Community Foundation (Singapore) in Nov 2020", "Interview Descriptions": "Fast response from the HR. They were kind and polite. 1st and 2nd interview done within few days. Offered the position in less than a week as well. Employment contract was detailedly explained online with HR personnel.", "Interview Questions": "Why do you think we should recruit you?"}, {"date": "2 May 2016", "title": "KN Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at PAP Community Foundation", "Interview Descriptions": "The interview will ask you those standard interview question like why you leave your last job, why you choose to work in this company, what do you think you can contribute and ask me about the preschool education things that ca be found from the theories of early childhood education. Basically, they want to know that they employ someone who can speak well, present well and has the maturity to handle a class of children as well as some demanding parents from time to time.", "Interview Questions": "Why do you want to be a preschool teacher? "}, {"date": "12 May 2013", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PAP Community Foundation (Singapore) in Jul 2011", "Interview Descriptions": "Hiring process takes about a month or more to complete. Interview process depends on the boss.\r\n\r\nThe HR would take a long time (around 3 weeks) to finalize the salary, which is usually lower than expected.", "Interview Questions": "Questions are standard ones. Just be yourself when answering the interviewers and treat the interview session like a chit chat session."}]]