[[{"date": "28 Feb 2023", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at CARE (USA) in Jan 2023", "Interview Descriptions": "The interview process was about 3 months. It consisted of an HR screening where they provided the questions prior to the zoom call, interview with the department Director followed by a panel interview and finally with the Department head. They took quite a while to get back to me with the final decision and didn't communicate it would take that long to make their decision.", "Interview Questions": "What excites you about the role and organization?"}, {"date": "12 Dec 2022", "title": "Senior Communications Manager, Mega Gift Strategy and Content Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at CARE (USA) (Atlanta, GA) in Nov 2022", "Interview Descriptions": "1st step: HR screening - video call 2nd step: Questionnaire 3rd step: Interview with the Hiring Manager, who would also be the supervisor of this position, the Executive Director of the department. 4th step: writing test 5th step: final interview I was not contacted by anyone to inform me that the position had been filled. After all of the work and preparation I put into this interview, I would have appreciated a follow-up email notifying me that they would not be moving forward with me. Such a lack of consideration has certainly left me with a bad impression of the organization.", "Interview Questions": "Why do you want to work for CARE? What do you know about the organization? Tell me about your background as it relates to this position."}, {"date": "29 Aug 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at CARE (USA) (New York, NY)", "Interview Descriptions": "Process over the course of months, 1:1, panels, etc. fairly normal if long. \n\n“Strategy assignments” (plural!) with unrealistic timeframes to complete satisfactorily. Serious red flags on work life balance and culture. One is reasonable. Four is unacceptable.\n\nIn hindsight, less about skills or compatibility and more about fishing for ideas. \n\nApplicants, you are valuable and above free work.", "Interview Questions": "How did you learn about CARE? why does our work resonate?"}, {"date": "15 Oct 2021", "title": "Regional Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CARE (USA) (Nairobi) in Aug 2021", "Interview Descriptions": "Tedious 4 step interview.  To move to the next, you had to qualify in the previous step. However, the job was readvertized immediately after the fourth step before sending a regret.", "Interview Questions": "1. Pre-screening open ended questionnaire\n2. Written test with a section on Ms Excel\n3. Multiple choice questions\n4. Oral Interview"}, {"date": "29 Jun 2021", "title": "Digital Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CARE (USA) (Atalanta) in Jun 2021", "Interview Descriptions": "I went on the interview it was an online interview and we spoke for around a few minutes Suddenly i had an internet disconnection I tried solving it, suddenly a staff just called me asking me of the problem I replied that i had an internet problem and they understood ,they are really understanding people", "Interview Questions": "no questions yet but will update"}, {"date": "12 Jul 2021", "title": "Grant Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at CARE (USA) (Atlanta, GA) in Mar 2021", "Interview Descriptions": "The interviews were moderately formal, with three employees over the course of three interviews. The first was more of an informational interview, the second they got to know me better, and with the third they asked a couple more questions and then the required HR questions. I wasn't able to ask as many questions as I had wanted due to time limits.", "Interview Questions": "What experience do you have bringing people together? "}, {"date": "21 Feb 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at CARE (USA) (Atlanta, GA)", "Interview Descriptions": "I was recuited through the university's careers department. I had submitted my resume for a full time entry level job that I did not get. I was later emailed about a summer internship with one of the department. Because I was going in for graphic design, I just sent my work samples and was later offered the role", "Interview Questions": "Why do you want to work with CARE?"}, {"date": "16 Jul 2020", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at CARE (USA) (Atlanta, GA)", "Interview Descriptions": "Three step interview vetted by hiring manager then team and then possible follow up interview. There was also a demonstration of skills and  thorough reference check. Most of it was done via Zoom.", "Interview Questions": "What new ideas do you have for our work?"}, {"date": "28 Feb 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at CARE (USA) (Atlanta, GA) in May 2020", "Interview Descriptions": "They reach out and it was a quick transition from start to finish.  Although, I have heard a lot of our co-workers had a hard time reaching out the requiting team.", "Interview Questions": "Experience in the sector with examples"}, {"date": "23 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at CARE (USA) (Atlanta, GA) in Sept 2019", "Interview Descriptions": "The interview had several parts. The first was question and answer, and the second was a written test where I was given 20-30 minutes to write about a topic that I was passionate about.", "Interview Questions": "Do you have questions about our company?"}], [{"date": "23 Jan 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CARE (USA) (Atlanta, GA) in Aug 2019", "Interview Descriptions": "Submitted my application through the online site and was contacted about an interview with the hiring manager in less than a month. After the interview, I moved forward to complete a writing exam where I had to create informational material in a newsletter format. Upon completing that exam, I heard back from CARE within a week.", "Interview Questions": "Oral and written skills"}, {"date": "17 Apr 2019", "title": "Education Technical Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CARE (USA) in Jan 2019", "Interview Descriptions": "submitted cover letter and resume, and was called for a phone screening with HR. The conversation felt like it went well, but then I heard nothing for nearly 2 months despite several follow ups.", "Interview Questions": "describe your qualifications"}, {"date": "8 Jun 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CARE (USA) (Atlanta, GA) in Jan 2019", "Interview Descriptions": "I went in for an in-person interview at their Atlanta office. The Hiring Manager was kind and told me about the position before asking me about my background experience and general behavioral questions.", "Interview Questions": "Tell me about your experience ."}, {"date": "28 Jun 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CARE (USA) (Atlanta, GA)", "Interview Descriptions": "Communication was not optimal from organization. Applied online and completed a lengthy pre-screen assessment. Invited for an interview. Three weeks after the interview, completion of background check, and reference check I had still heard  nothing, so I contacted the HR representative. She replied to tell me that they had gone with another candidate.  I completely understand that they went with someone else based on qualifications, etc. However, I do feel that once someone has gotten to the interview/background check/reference check stage, at least a courtesy email is appreciated if that candidate isn't chosen. From application to final word from HR, the process took two months.", "Interview Questions": "What one word would your manager use to describe you? Your friends? Your coworkers?"}, {"date": "15 Jun 2018", "title": "Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CARE (USA) (Remote, OR) in Jun 2018", "Interview Descriptions": "I recently had a phone interview that was very easy going and professional. It was a screening call that primarily gave me an opportunity to talk about myself, my career path and why I want to work for the organization.", "Interview Questions": "Tell me about your career path."}, {"date": "30 Oct 2017", "title": "Global Funding Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CARE (USA) (Atlanta, GA)", "Interview Descriptions": "The overall interview process went well. I applied online and it took them one week to get back to me. The interview was very relaxed and easy going. The interviewer was very nice and made me comfortable.", "Interview Questions": "Tell me about yourself"}, {"date": "22 Sept 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CARE (USA) (Atlanta, GA) in Oct 2017", "Interview Descriptions": "The interview process was great. I was interviewed by a Coordinator who I happened to work directly with during my duration. Very informal. I was asked a few questions specific to the role, but most were questions about my life.", "Interview Questions": "1) Where do you see yourself in 5 years? 2) What do you know about our company? 3) Tell me about your coursework. In what ways is it relevant to this position?"}, {"date": "30 Apr 2018", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at CARE (USA) (Atlanta, GA) in Jun 2017", "Interview Descriptions": "The process took nearly two months, and included two interviews, a written component, a background check, and a ridiculous amount of sitting around, waiting. Interview covered the basics: talked about my experience, why I wanted the position, etc.", "Interview Questions": "Describe a time that your job or project was somewhat ambiguous. How did you manage to move forward and stay on task?"}, {"date": "16 Apr 2017", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at CARE (USA) (Atlanta, GA)", "Interview Descriptions": "About half (time wise) standard interview questions and about half choice of written or verbal response to scenario questions.  Standard questions were a few standard interview questions, a few technical related and few more challenging about how I have handled various situations. Interview was scheduled for an hour but lasted more than 1.5 hours.  Questions were mostly not standard, challenging (in a good way) questions.", "Interview Questions": "Provide an example of how you responded to a shift in strategic direction.   How do you manage your time."}, {"date": "17 Dec 2018", "title": "Md Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 months. I interviewed at CARE (USA) (Atlanta, GA) in Apr 2017", "Interview Descriptions": "Took five months to get from first interview by phone to a contracts. Panel interview included two people on Skype or phone. Only interviewed with who was to be my boss once. Helped me already know people when I joined.", "Interview Questions": "Focus on fund raising"}], [{"date": "9 Mar 2017", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at CARE (USA) (Atlanta, GA) in Feb 2017", "Interview Descriptions": "Prior to the interview I was sent screening questions. Once the screening questions were reviewed I was asked to come in for an interview. The interview was a panel interview (3 panelists) and lasted close to an hour. There was also a language component. After the interview I was asked to do a writing assignment.", "Interview Questions": "N/A"}, {"date": "13 Feb 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at CARE (USA) (New York, NY) in Dec 2016", "Interview Descriptions": "I had to turn in a document with my ideas, which is a good way for them to collect ideas from experts at no cost. It was very time-consuming to put the paper together and was ultimately a waste of time, as it seems the only way to get hired is to be personal friends with and look like someone in leadership.", "Interview Questions": "Interview questions were delivered by a panel. They were very thoughtful and relevant to the field, related to the job, diversity, and philosophical underpinnings of development."}, {"date": "31 Oct 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at CARE (USA)", "Interview Descriptions": "Very open and not to difficult. Good questions that were open ended nothing to difficult. They were specific when they needed to be specific. Other than that they were very open ended and friendly", "Interview Questions": "any experience prior"}, {"date": "22 Apr 2016", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at CARE (USA) (Nairobi)", "Interview Descriptions": "Fast and thorough efficient process. The panel always clarified the next steps, process and what to expect . Professional panel. HR was quick as sending emails on the same. Preparation of what to expect in the organisation was also helpful.", "Interview Questions": "Why I think I best fit this job"}, {"date": "8 Apr 2018", "title": "Digital Advocacy Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at CARE (USA) (Washington, DC) in Nov 2015", "Interview Descriptions": "Phone interview and then a panel interview. It was friendly and cordial. I was able to talk about my background and also gain information about the organization and the position.", "Interview Questions": "What qualifies you for this position?"}, {"date": "6 Jan 2016", "title": "Advocacy Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CARE (USA) (Washington, DC) in Nov 2015", "Interview Descriptions": "I had both a phone and an in person interview at the DC office. The initial phone interview was quite informative for both of us as I learned more about the expectations and reponsibilities of the position and was able to share how my background would fit well in that position. The in-person interview was with five different people; there were two in the conference room with me and three joined in by video conference. They asked about my background and also about what I would do in certain situations.", "Interview Questions": "How would you approach a particular situation specialized to this position?"}, {"date": "14 Sept 2015", "title": "Administrative Support Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CARE (USA) (Atlanta, GA) in Sept 2015", "Interview Descriptions": "I read the job description completely.  I wrote a custom cover letter and resume matching my skills to the skills requested in the job description.  I got an email requesting that I complete a pre-screen questionnaire; which I did.  I was then contacted and scheduled a phone interview. I prepared for the phone interview; re-read the job description, had my copy of the cover letter, resume and pre-screen and waited for the call in an empty conference room (to minimize distractions).\r\nThe interview began with introductions of all the interviews and an outline of the interview process.  A few minutes into it, they made it clear they were looking for a \"must have\", very specific previous experience and skill.  This \"must have\" was no where on the job description, and a transferable, related skill (that I do have) was listed on the job description at the \"15% of time\" level of the job duty.\r\nSince I did not have this particular specific former experience, the phone interview was terminated.", "Interview Questions": "How does this position complement your background and strengths? (From the pre-screen questionnaire; also noting that my answer would serve as my writing sample.)"}, {"date": "12 Jul 2019", "title": "Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at CARE (USA) (Port-au-Prince) in Jul 2015", "Interview Descriptions": "It was an ok process in my opinion. The panel was with three persons of which two were senior management and 1 HR.  They asked me questions in turn; the HR person mostly made sure I was comfortable during that time.", "Interview Questions": "Tell us about yourself."}, {"date": "10 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CARE (USA) (Atlanta, GA) in Jun 2014", "Interview Descriptions": "I had an in-person interview with two of my direct supervisors, because the third supervisor was out of town at the time. I also took a brief editing test. Overall, it was a pleasant interview and they did not ask any tricky questions.", "Interview Questions": "Tell us about a group project that went poorly?"}, {"date": "3 Apr 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at CARE (USA) (Atlanta, GA)", "Interview Descriptions": "Hired through Emory University Channels", "Interview Questions": "Name one experience that didn't go well and how you handled it."}], [{"date": "11 Feb 2014", "title": "Health Advisor At A Country Office Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CARE (USA)", "Interview Descriptions": "There were two interviews by phone: 1) with someone from HR at CARE HQ and someone from the Regional Desk at HQ; 2) with the Director at the Country Office where the position was based. I was working at another CARE Country Office at the time. I have always felt that my prior performance and internal references helped me get jobs within the organization.", "Interview Questions": "Tell us about a time when you were leading a team and you encountered a conflict with someone from outside the team which affected the team's work ..."}, {"date": "14 Dec 2012", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at CARE (USA) (Atlanta, GA)", "Interview Descriptions": "Getting an interview took forever.  I was told later that there was a need for the position but the budget had not been approved.", "Interview Questions": "No questions were difficult at all.  Very easy interview."}, {"date": "10 Jul 2012", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CARE (USA) in Apr 2012", "Interview Descriptions": "One in-person, other phone panel.  Short-listed for second interview with phone panel.  Phone interviews are challenging, not the best way to meet people.", "Interview Questions": "Relevance of background to job"}, {"date": "4 Dec 2015", "title": "Head of Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CARE (USA) (Nairobi) in Apr 2011", "Interview Descriptions": "A very fast and efficient interview process, considering there are three different levels of interviews. All completed and offer made within three weeks since the first invitation of an interview.", "Interview Questions": "Questions were job-related and also tested leadership competencies and context application.  In my view, was all rounded interview."}, {"date": "22 Nov 2013", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at CARE (USA) (Atlanta, GA) in Jun 2009", "Interview Descriptions": "The interview was quite informal, even tough it followed the HR procedures, the fact that got me inside was that I was working in a field office. The interview committee, they either like  you or not. You can have a great CV but is the personality match they seek the most", "Interview Questions": "Question about what I think about the mission and vision of the organization"}]]