[[{"date": "1 May 2023", "title": "Nursing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Arlington (Arlington, TX)", "Interview Descriptions": "Got an interview a couple days after applying. Spoke with a recruiter first and she set up my appointments for my interview. Doesn’t take long to fill out a applications", "Interview Questions": "N/A"}, {"date": "27 Apr 2023", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Arlington (Arlington, TX)", "Interview Descriptions": "erview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "ridiculous, why do choose this hospital"}, {"date": "25 Apr 2023", "title": "Certified Surgical Technologist (CST) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Medical City Arlington (Arlington, TX) in Apr 2023", "Interview Descriptions": "Spoke with the OR manager. He was awesome. The interview lasted about 45 minutes. It didn't really even feel like an interview, it felt more like two friends having a conversation.", "Interview Questions": "experience and procedures you have done"}, {"date": "5 Jan 2023", "title": "PCT Patient Care Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Arlington", "Interview Descriptions": "Amazing. I felt comfortable talking with interviewer and valued as a prospected employee. I cant wait to join the family and start my career at Medical City. . . . . ..", "Interview Questions": "I was not asked much about myself, it was more about asking questions you might have as a future employee regarding position/"}, {"date": "11 Oct 2022", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Medical City Arlington in Oct 2022", "Interview Descriptions": "The interview process for me was really quick. I was only asked maybe 5 to 6 questions. It’s okay to take your time to think of an appropriate response. I was offered a position afterwards!", "Interview Questions": "Tell me about yourself? Why nursing? How do you manage your time? Tell me about a time where you had to thinking quickly? Tell me about a time you had a difficult patient/customer? Why medical city?"}, {"date": "29 Jul 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Arlington", "Interview Descriptions": "The interview was a 2-part interview. The first was with the unit manager, and was more of a getting to know me type interview. The second part we’re the actual interview questions. I was asked 8 of them.", "Interview Questions": "How would you de-escalate a situation?"}, {"date": "22 Nov 2021", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Arlington", "Interview Descriptions": "It was an in person interview about 40 minutes in duration. The jury consisted three interviewers that included two currently working medical technologists from chemistry and microbiology departments. We discussed my interests, education and experience, the laboratory expectations and the work processes.", "Interview Questions": "How did you find about us?"}, {"date": "21 Sept 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical City Arlington (Arlington, TX)", "Interview Descriptions": "The staff made me feel very comfortable during the interview and I immediately felt a connection here. They asked questions about the culture of the company and they are looking at candidates that have an understanding of their values.", "Interview Questions": "How do you handle stress?\r\nTell me about a time you had to deal with a disgruntled patient or family member?"}, {"date": "19 Sept 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Arlington", "Interview Descriptions": "Applied online, in person interview with 2 people from the unit, heard back about the position the same day, then began orientation process that next week, overall good and easy experience", "Interview Questions": "Tell me about a time "}, {"date": "1 Apr 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Medical City Arlington", "Interview Descriptions": "Two people were on the phone and asked me situation based questions. they were very sweet. They were very encouraging. you are stupid why would you make me write so much.", "Interview Questions": "when did you make a mistake and fess up"}], [{"date": "3 Mar 2021", "title": "RN ICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Arlington", "Interview Descriptions": "In person  interview with a panel of nurses asking various questions about past experiences with patients, coworkers,  and doctors .   This interview was conducted in a formal setting and I also presented my resume to the head person.", "Interview Questions": "How do I deal with difficult patients?!"}, {"date": "28 Jan 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Medical City Arlington (Arlington, TX) in Jan 2021", "Interview Descriptions": "Contacted by intern recruiter via email and call to set up interview with hiring manager. Interviewer did not show up for 1st interview due to being busy in the unit. Another interview was scheduled and  was a 30 minute call followed by a call with a peer nurse.", "Interview Questions": "1. Tell me about yourself\n2. After explaining the position, was asked if I was still interested in position"}, {"date": "26 Oct 2020", "title": "Social Worker MSW Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Arlington", "Interview Descriptions": "It was pretty quick process. The administration/management missed my first interview and followed up after one week. I didn’t like that but the process it self was easy and quick.", "Interview Questions": "Asked relationships with co workers and how to handle conflict? "}, {"date": "9 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Medical City Arlington (Arlington, TX) in Jan 2020", "Interview Descriptions": "Apply online. A few weeks later received a call to interview. Interviewing was awesome. Felt comfortable with the director. Left there with feeling positive.  A week later I was surprised with a call offering me the position.", "Interview Questions": "Where do you see yourself in a year? "}, {"date": "7 Apr 2021", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Arlington (Arlington, TX) in Jul 2017", "Interview Descriptions": "Overall easy and effective. Communication of what’s expected is understandable and achievable. Very nice people to work with. They’re looking for team players and open minded therapists. Someone who can easily adapt to new situations", "Interview Questions": "Behavior related questions mostly. “Tell me about a time when”"}, {"date": "31 Jan 2016", "title": "Director of Nursing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Medical City Arlington (Arlington, TX) in Dec 2015", "Interview Descriptions": "Three phone interviews and an all day on site interviews with all levels of employees and administration. I applied online and within a day I received a phone call from a recruiter to schedule a screening interview with her. I then had to complete a psychological evaluation before I could progress to the second phone interview.  The second phone interview was with the HR Director. The third interview was with the hiring manager. Afterwards I  granted an onsite interview. The onsite interview lasted 6 hours with little more than a 5 minute break. Those on the panel interview were professional and cordial; however, no one was concerned about my comfort. It wasn't until four hours into the interview process that someone asked if I would like a bottled water. I was also not asked if I would like a restroom break until an hour before the interviews were over. It was because of the inconsideration during the interview process that I declined to take the position. If this is any sign of what it is like on the inside, I did not want to be apart of it.", "Interview Questions": "Give us a brief overview of your employment history."}, {"date": "13 Jul 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Medical City Arlington (Arlington, TX) in Feb 2014", "Interview Descriptions": "Simple.  Met with the manager of the unit and then the educator.  It took a about 10 minutes.  They were friendly.   They made me feel at home.   We discussed kids and home life.  I knew immediately I wanted to work for them.   And this initial impression proved to be true.   It's a great place.   They do care about you as a person.", "Interview Questions": "What do you do if/when you make a medication error?"}, {"date": "3 Feb 2014", "title": "Occpational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Medical City Arlington (Arlington, TX)", "Interview Descriptions": "I had a very easy process at MCA.  I did my internship after school there so I believe it helped the process alot.  The HR staff was very friendly and helped me walk through the application process.  I was hired within 24 hours.  If they are needing people for your position it will go quickly.  Be available to answer questions about any experience you have had in this field or anything close.", "Interview Questions": "Why would you be the better candidate over someone that has a higher degree or more experience?"}]]