[[{"date": "9 Mar 2023", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at SPIN, Inc. in Mar 2023", "Interview Descriptions": "Interview is virtual. Start pay is 16 dollars more for experience. And more if your a college graduate. They do background checks before job offer and process is fast. This is one of the better jobs in this field.", "Interview Questions": "Your different scenario on helping individuals."}, {"date": "29 May 2023", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at SPIN, Inc. (Philadelphia, PA) in Oct 2021", "Interview Descriptions": "The interview was straight forward and the interviewer was very informational. You go through a background check and drug test before being hired. Once hired, you have to complete two weeks paid training with computer lessons. You go through a few days of on the job training and then you start the role.", "Interview Questions": "What does it mean to you to be an advocate for someone?"}, {"date": "9 Jan 2022", "title": "Direct Care Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at SPIN, Inc. (Philadelphia, PA) in Sept 2020", "Interview Descriptions": "Virtual. Hired after interview.  interviewer was kind and informative about the company .  She  asked applicable questions and  gave honest  opinions .  It was an interactive interview and  she was very welcoming", "Interview Questions": "Asked what I would do in various situations."}, {"date": "26 Jun 2022", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SPIN, Inc. (Philadelphia, PA) in Sept 2018", "Interview Descriptions": "Fair and nonjudgmental.  It was a single interview with your to be supervisor. It was a relaxed environment. By the end of the interview, I knew I had gotten a job.", "Interview Questions": "General questions about experience in home health and working with the IDD population."}, {"date": "22 May 2018", "title": "Mental Health Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at SPIN, Inc.", "Interview Descriptions": "A few scenario questions. Mostly asks about previous experience and how you would handle certain situations moving forward. Also, asks some basic interview questions as well. The whole  process was only an application and one interview.", "Interview Questions": "What are two strengths you feel that would fit with this job?"}, {"date": "22 Oct 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at SPIN, Inc. (Philadelphia, PA)", "Interview Descriptions": "Apply on line and interview with HR and direct managing staff.Once hired you must go through a mandatory payed week of orientation and training which they have a great team to give you every tool you will need to work with residents who reside in there wonderful homes.", "Interview Questions": "Have I ever worked in this field?"}, {"date": "9 Sept 2018", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at SPIN, Inc. (Phila, PA) in Sept 2017", "Interview Descriptions": "I applied online and got a phone call within 3 days. The interview process was fairly simple, I met with my current supervisor and Human Resources representative. After the portion of the interview with my supervisor was completed, I was offered the position on the spot and I accepted.", "Interview Questions": "Why do you think advocacy is such an important part of your job for the people we support?"}, {"date": "17 May 2017", "title": "Lead DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SPIN, Inc. (Philadelphia, PA) in Sept 2016", "Interview Descriptions": "The interview process was not bad. It was a one on one interview, and it was focus on the individual you will be taking care of. the interviewer give a n  and asked what I would do if I was in such environment. She asked how was I going to meet the goal of the individuals I would be taken care of.", "Interview Questions": "What will you do, when you notice an error."}, {"date": "14 Dec 2017", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SPIN, Inc. (Philadelphia, PA) in Jul 2016", "Interview Descriptions": "I was interviewed by a temporary HR employee as the first part of the interview process. The employee made me feel comfortable and he was very friendly and compassionate. He felt good about hiring me and also advised me about what the department was looking for and that they would most likely hire me. I then interviewed with my direct supervisor who was also very friendly and kind. Then a few days later I got called back for a panel interview with other members of the department I had applied for.", "Interview Questions": "How familiar are you with Autism?"}, {"date": "5 Jan 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at SPIN, Inc. (Philadelphia, PA) in Oct 2013", "Interview Descriptions": "We only talked about different things about what I like and don't like, After filling out the application they hired me on the spot as an intern. I loved it!", "Interview Questions": "What do like about the company?"}], [{"date": "1 Sept 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at SPIN, Inc. (Philadelphia, PA) in Mar 2012", "Interview Descriptions": "You will interview with the director of the home you will be working in. They will ask you about your experience working in this field. Tell you about the individuals you will be supporting. Then they will explain the process ; prepared for a week 2 week training process; you will be certified in first aid, cpr and safety. They prepare you for working in the homes. Spin is very strict when it comes to time and attendance. Don't fall asleep and always be prepared.", "Interview Questions": "Explain a difficult situation working with people with IDD"}]]