[[{"date": "19 Jul 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health in Jun 2023", "Interview Descriptions": "Applied online, and received interview confirmation within next week, Interview went well, and the Nurisng educator, and manager told me to wait for a call from the HR, It has been 1.5 months now, No reply from the HR, ignored my phone calls, and emails, Expect us to be disciplined, and professional, but they do not have a courtesy of respect to reply, even one email can help someone to move on, Anyways, I got a better offer at another hospital where people are nice and responsive, Unexpected, and unprofessional experience from such a great hospital", "Interview Questions": "Hypoglycemia CHF and pneumonia Fall assessment Chest pain"}, {"date": "20 Jul 2023", "title": "Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mackenzie Health (Vaughan, ON) in May 2023", "Interview Descriptions": "Standard interview process with recruiter phone screen, 2x interviews. Was VERY slow between each stage though each concluded with messaging around sense of urgency to fill. they also wanted to contact my current manager before finalizing offer - something I was not comfortable with", "Interview Questions": "Why Mackenzie Health Experience relevant to role Biggest trends I see in industry"}, {"date": "19 Apr 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mackenzie Health (Brampton, ON)", "Interview Descriptions": "it was a fun easy group process nothing to stress about normal questions, more like a group chat, our interviewer was really fun and engaging and supportive asked normal interview questions nothing too crazy", "Interview Questions": "why do you want to work here"}, {"date": "5 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Mackenzie Health in Feb 2023", "Interview Descriptions": "It was 30 minutes long, straightforward, lots of behavioural and clinical questions. make sure to have a lot of anecdotes and examples when answering your questions. There were two people interviewing. They're very nice, take a lot of breaths and calm down. Think before you say your answers, they give a lot of time for you to think. They don't expect you to know everything.", "Interview Questions": "signs and symptoms of CHF, treatment, what is chf, pneumonia S+S, treatment, assessment, signs and symptoms of hypoglycemia, hypotension, treatment, assessment. dementia, delirium falls risk clients and assessments and actions to prevent falls. how to know the client is satisfied with care?"}, {"date": "17 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health", "Interview Descriptions": "It was supposed to be an hour interview, concluded after 40 minutes. Consisted of a panel of 3 personnel. Interview consisted of panel members asking questions one at a time, with an opportunity to ask questions to the panel at the end.", "Interview Questions": "Tell me a time you have faced conflict, and how did you manage this?"}, {"date": "18 Dec 2022", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mackenzie Health in Dec 2022", "Interview Descriptions": "The interview process was average. 5 behavioral interview questions + 2 general education and experience questions. The interview was scheduled for 30 minutes via Zoom. The interviewers were pleasant and nice. Overall, a good interview.", "Interview Questions": "Explain a situation where you have to deal with a misunderstanding"}, {"date": "1 Dec 2021", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health (Vaughan, ON) in Nov 2021", "Interview Descriptions": "The interview was conducted by a panel of three. The time set for the interview was an hour however we concluded after 33 minutes. One person was a clinical manager, a coordinator and one nurse educator.", "Interview Questions": "I was asked questions to do with experience, situational questions and problem solving along with dispute resolution."}, {"date": "18 Sept 2021", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mackenzie Health", "Interview Descriptions": "It’s take about 30 minutes. It includes the normal interview questions and nurse knowledge questions. I didn’t prepare well, and I don’t know answers for some questions. I couldn’t remember if they have math test", "Interview Questions": "They asked do you have any conflict with your coworker, example "}, {"date": "18 Sept 2022", "title": "ER Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health (Richmond Hill, ON) in Sept 2021", "Interview Descriptions": "Panel interview. Situational questions. Incorporate their Hospital mission to your work you are applying for. It was a bit of slow for me at that time coz their management team are new and Cortulecci just opened.", "Interview Questions": "What would you do If the the Doctor takes long in assisting the patient?"}, {"date": "12 Jul 2021", "title": "Clinical Extern (Student Nurse) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mackenzie Health (Toronto, ON) in Jul 2021", "Interview Descriptions": "Situational questions related to safety and team work, two panel virtual interview that took 10-15 mins, experiences as a nursing student is enough to answer the questions, PSW experience would be an asset", "Interview Questions": "Interventions or steps for when you encounter an unresponsive patient "}], [{"date": "12 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mackenzie Health", "Interview Descriptions": "online panel interview with the manager, patient care coordinator, and the educator who took turns asking questions. Lasted about 30 minutes, then they provided time at the end of the interview to ask your own questions", "Interview Questions": "signs and symptoms of hypoglycemia"}, {"date": "18 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Mackenzie Health in May 2021", "Interview Descriptions": "I applied online and the interview took about 30minutes. There were two pannels (nurse managers). My result came in very fast. I had a good experience and very excited to work here.", "Interview Questions": "hypoglycemia symptoms and signs and what would you do"}, {"date": "31 May 2021", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mackenzie Health in Mar 2021", "Interview Descriptions": "clinical and behavioural questions. Lasted about 30 mins. Very basic question you would expect the employer to ask during an interview. Nothing out of the ordinary. For instance, how to deal with conflict in the workplace, or explaining how your education pertains towards the job.", "Interview Questions": "order of draw of specific tests "}, {"date": "15 Mar 2021", "title": "Patient Registration Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mackenzie Health (Vaughan, ON) in Mar 2021", "Interview Descriptions": "There was a lot of phone tag for the initial phone screening interview but when it was confirmed, it was very pleasant and productive which led to an online interview with the Manager and HR Manager. Zoom interview followed a week later which was also good.", "Interview Questions": "describe what customer service experience you have and what empathy means to you"}, {"date": "16 Feb 2021", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mackenzie Health (Toronto, ON) in Feb 2021", "Interview Descriptions": "Fairly straight forward questions wit 1or 2 scenario based questions. There were two people interviewing me, this was during COVID times so it was conducted through Microsoft Teams. The hiring panel was very nice and friendly, it was a 30 mins interview. No surprise questions really.", "Interview Questions": "1) How will your past experience help you with this job?"}, {"date": "8 Dec 2020", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health", "Interview Descriptions": "The interview process was a little hard base on my experience. It was not like any other kitchen interview I had in the past. The interview requires research about the position and hospital values.", "Interview Questions": "Do you know the hospital values? "}, {"date": "26 Sept 2020", "title": "RPN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health (Toronto, ON)", "Interview Descriptions": "It was a 45-minutes online panel interview. Interview was scheduled roughly 2 weeks after receiving a confirmation email It composed of behavioral questions, case scenarios, and a few basic and traditional interview questions such as \" 3-5 year goal.\"", "Interview Questions": "behavioral questions as well as several case scenarios needing critical thinking skills."}, {"date": "16 Sept 2020", "title": "RPN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mackenzie Health in Sept 2020", "Interview Descriptions": "I disappointed with the interview. I had video interview with two managers.  All situational questions. They were just reading question paper and reading really fast.  It was like line interview. They might have many interviews. Overall, not good impression of interviewer.", "Interview Questions": "How would you do not mobile orthopedic patients?"}, {"date": "15 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mackenzie Health (Toronto, ON) in Feb 2020", "Interview Descriptions": "It consists of  10 min online presentation and 10 min competency and behavioral questions. The interview process was very smooth and friendly.  It was a panel interview contains, director of nursing, two managers,  educators, and two HR representatives.", "Interview Questions": "what was the last challenge with patient"}, {"date": "1 Oct 2021", "title": "Senior Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health (Vaughan, ON) in Jan 2020", "Interview Descriptions": "Great. Easy and medium. Nice people. Great interview. Mostly questions related to personal experiences. Technical stuff is less. Not really good negotiations though. Great at welcoming. Good place to work at.", "Interview Questions": "Mostly  just your personal expirations and some technical stuff."}], [{"date": "28 Nov 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mackenzie Health (Richmond Hill, ON)", "Interview Descriptions": "Two in person interview followed by MS office & typing test. \r\nDescribe your experience as it relates to the job\r\nWhy are you looking to work here\r\nHow soon are you available to start\r\nCan't remember the rest.", "Interview Questions": "Situational based questions  along with reviewing resume."}, {"date": "2 Nov 2019", "title": "Instructor Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mackenzie Health", "Interview Descriptions": "Two interviewers interview you with booklet. Answer questions while they jot down your answers. They also ask you provide 2-3 references after interview. Very friendly and non judgmental. Asked about your experience in the field", "Interview Questions": "What would you do when a parent informs you they abused their child?"}, {"date": "20 Feb 2022", "title": "Board Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mackenzie Health in Oct 2019", "Interview Descriptions": "The interview process was structured. I received a call prior to the interview to inform me of what to expect and what the process would look like. The interview itself was comfortable, respectful and professional.", "Interview Questions": "One question theme was about collaboration and working with others - to describe my approach to collaboration and to provide an example. "}, {"date": "16 Sept 2019", "title": "PCO Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health", "Interview Descriptions": "phone, face to face, I got a call , screening call from the director , it took 15 minutes, then I got a call from HR to schedule a face to face interview , took an hour then got the offer", "Interview Questions": "N/A"}, {"date": "12 Aug 2019", "title": "Instructor Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health", "Interview Descriptions": "email was sent to notify me that I was accepted for an interview. Interview went really well, it was a panel interview I was asked a sires of set questions, while I spoke they would write down everything. Overall, I felt very comfortable and if I was unsure of a question it was repeated and I could answer at my own pace.", "Interview Questions": "give me a time where you implemented a policy or procedure at work"}, {"date": "8 Feb 2020", "title": "RPN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health (Richmond Hill, ON) in Aug 2019", "Interview Descriptions": "One time in person interview. Got a call within 3 days of applying and set up an interview day next week. Interview was 30 minutes long and questions were kinda typical. But It was my first interview as a nurse, so my answer was really bad I guess.", "Interview Questions": "What would you do when a resident had a fall"}, {"date": "6 Oct 2021", "title": "Instructor Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Mackenzie Health in Jun 2019", "Interview Descriptions": "Great questions and a great team to work with! They really care about their clients and really emphasize ABA principles and scenarios. It can be a bit intimidating with so many people watching and marking down, but it was a great interview and process.", "Interview Questions": "How would you transition a child from a preferred activity to non-preferred?"}, {"date": "16 Sept 2019", "title": "Clinical Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mackenzie Health (Richmond Hill, ON) in Mar 2018", "Interview Descriptions": "Received an email invitation for an interview. In-person panel-format interview in the HR office with the Director of Professional Practice and a Professional Practice Lead. Both of the interviewers had prior experience as RNs.", "Interview Questions": "Mostly behavioural questions (tell me about yourself, what are your goals, provide anecdotes, explain a time you went above and beyond for a patient, scenario questions)"}, {"date": "28 May 2017", "title": "Mealtime Support Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mackenzie Health (Richmond Hill, ON) in May 2017", "Interview Descriptions": "The actual interview itself was around 10-15 mins. Another 10 mins for providing details about the job, orientation, taking a photo for the badge. I applied online in early March, got a call back the end of May. You need a police check, immunization record, and 2 references before orientation. I was asked about my availability, and even though I was free, I was only given one shift per week. Each shift is 2 hours during mealtimes.", "Interview Questions": "Describe a time you were stressed at work and how did you handle it?"}, {"date": "12 Jun 2017", "title": "Instructor Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mackenzie Health (Richmond Hill, ON) in May 2017", "Interview Descriptions": "I applied online and got a call about a month later to come in for an interview. The interview comprised of a panel of 2 Senior Therapists. The interview had some brief ABA questions and the rest were behavioural style questions i.e. tell us about a time you required flexibility for a project/job and what was the outcome? They had a package of questions and scribbled down my answer to each as the interview went on.", "Interview Questions": "Tell us of a time you disagreed with a colleague or family member and how you handled that?"}], [{"date": "17 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mackenzie Health (Toronto, ON) in Mar 2017", "Interview Descriptions": "Two people panel interview. It comprised with behaviour questions and clinical questions. The interview was about 30 minutes in length. They asked you some behaviour questions first then clinical questions. Describe a time you provide a great customer service, who received the service and what's the outcome.", "Interview Questions": "How would you assist a diabetes patients who is not responding."}, {"date": "27 Jun 2017", "title": "Credential Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mackenzie Health (Toronto, ON) in Mar 2017", "Interview Descriptions": "It was very quick. Only a few questions regarding your teaching experience and they let me know the result in the same day after I got home. Only general questions asked during the interview, your strength, do you have previous teaching experience. How are you going to handle the relationship between clinicians, etc.", "Interview Questions": "Give you a scenario about how to teach people to make a cheese burger."}, {"date": "2 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mackenzie Health (Richmond Hill, ON)", "Interview Descriptions": "Interview with manager and educator. I applied in person and also applied online. It took about 2 weeks to receive a call for an interview and I got the offer in two days. The interview had many behavioural questions and some clinical questions.\r\nSome questions include... What are some signs and symptoms of hypoglycemia? How do you manage high work load and stress? Describe a time when you made a mistake. Etc", "Interview Questions": "Why this unit? Where do you see yourself in two years? Five years?\r\nConflict management and some clinical emergency questions"}, {"date": "20 Oct 2016", "title": "Serviceleiter / Meister Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mackenzie Health (Toronto, ON) in Jun 2016", "Interview Descriptions": "3 interviewers, very nice, took turn asking questions about basic ABA concepts and interpreting graphs/ identifying function of behaviour. Asked why you want to be part of Mackenzie Health/why you are leaving the current job.", "Interview Questions": "What is your most severe case you have worked with?"}, {"date": "10 Apr 2016", "title": "Permanent Part Time ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mackenzie Health (Maple, ON) in Feb 2016", "Interview Descriptions": "It was a group interview with the interim manager, education, and team leader.  I was given a battery of scenarios by each team member and asked how I would deal with each scenario.", "Interview Questions": "How would you deal with a situation where your colleague is calling off sick but he is working at another hospital.  Would you report it to the manager?\r\n\r\nA patient is brought to hospital having chest pain, has history of diabetes, high blood pressure, and high cholesterol.  He gets to your unit stable and starts to have more chest pain.  How would you start the assessment ?"}]]