[[{"date": "29 Mar 2023", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chicago School of Professional Psychology (Chicago, IL) in Nov 2022", "Interview Descriptions": "1 online interview with a panel of three staff members Afterwards, zero follow-up from the company even after being promised to update within two weeks. I personally asked for an update twice and then out of nowhere the hiring manager said \"We just fill the position.\" without any other context. Not a very communicative hiring process.", "Interview Questions": "Standard interview questions about my interest and professional experience."}, {"date": "22 Dec 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chicago School of Professional Psychology", "Interview Descriptions": "I did not have a positive interview experience. I was not told the interview panelist names in advance, so I blindsided by a panel with over 5 people. The interview protocol felt a little outdated. It felt more like a test rather than an interview.", "Interview Questions": "What is the current retention rate?"}, {"date": "31 Jul 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Chicago School of Professional Psychology in Jun 2021", "Interview Descriptions": "Interview was over video conference. I was asked questions pertaining to my expertise in certain areas of the field I expressed interest in teaching.  I was also provided an overview of the in person teaching schedule.", "Interview Questions": "What is your experience with online teaching?"}, {"date": "31 Dec 2020", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Chicago School of Professional Psychology", "Interview Descriptions": "4 stages culminating in a phone call with the Dean of Admissions. Communicative throughout. Very professional. Mostly over Zoom, but not awkward. The whole process was relatively quick. Beginning to end it took about a month to get through the entire process.", "Interview Questions": "Why are you interested in working as an admissions counselor?\r\n"}, {"date": "20 Jul 2020", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Chicago School of Professional Psychology", "Interview Descriptions": "I was asked to be interviewed from an HR rep. A screening that would take 10-15 minutes. It was just the rep on the phone. She passed along information to hiring managers and if they wanted a next step, they would contact me.", "Interview Questions": "Are you willing to relocate? "}, {"date": "4 Nov 2020", "title": "Department Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chicago School of Professional Psychology (Washington, DC) in Feb 2018", "Interview Descriptions": "First there are 3 one on one interviews with different staff and then there is a final panel interview of 4 or 5 others interviewing you at the same time.", "Interview Questions": "A lot of questions were asked about how well you can work with others."}, {"date": "6 Oct 2017", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chicago School of Professional Psychology", "Interview Descriptions": "Skype interview with 3 other individuals including the person currently in the position. It was about 1 hour and they were pretty  friendly. The entire thing was not very stressful at all. I did not get a really good idea of what the position would entail though and I felt like my answers were not answered fully, like they were holding back.", "Interview Questions": "Tell me a time you had a conflict with your co-worker. "}, {"date": "4 Jan 2017", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chicago School of Professional Psychology (Washington, DC)", "Interview Descriptions": "Easy. A recruiter responded to my application and asked a few questions over the phone - offering me an in person interview before ending the call. The interviewer at the in person was 10 minutes late and clearly uninterested in me after a question or two. Highly unprofessional interview experience.", "Interview Questions": "Why do you want to work here"}, {"date": "10 Nov 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Chicago School of Professional Psychology", "Interview Descriptions": "Phone interview with HR took 15-20 mins, then a campus interview with the director which was about 30mins, lastly meet with the president for 20mins. Interview process was fast and informative. They asked questions about my goals, why should we hire you, the type of customers I have worked with in the past.", "Interview Questions": "What are your strengths and areas of opportunity\r\n\r\nWhy should we hire you"}, {"date": "25 Oct 2015", "title": "Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chicago School of Professional Psychology (Chicago, IL) in Apr 2013", "Interview Descriptions": "The interview process started of great.  The contacted me through email.  The interviews were online through Skype.  Though they had technology issues on the first interview we eventually connected.  The second interview was also online through Skype.  The interview went well.  However, after the second interview I never received a rejection letter or confirmation.  I gave them a couple of calls and everyone said they new nothing.", "Interview Questions": "Are you willing to relocate"}], [{"date": "6 Mar 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Chicago School of Professional Psychology (Chicago, IL) in Aug 2012", "Interview Descriptions": "An offer was made based upon high course performance scores. There was no actual \"interview\" process, as a Teaching Assistant position is offered based upon a year of observation through classes and interactions with the student. A job description would have been helpful during the project, in order to give realistic scope of the job.", "Interview Questions": "How to balance work/life/school schedule."}, {"date": "2 Dec 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Chicago School of Professional Psychology (Chicago, IL) in Jun 2011", "Interview Descriptions": "It was a little unusual for a professor position.  Some things were typical.  I gave a colloquiem, interviewed with a lot of the faculty, etc.  On the other hand, it seemed rushed and thrown together.  All in all it was a pleasant experience.", "Interview Questions": "Tell me about your research."}]]