[[{"date": "1 May 2023", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at YWCA (Toronto, ON)", "Interview Descriptions": "It was an overall positive interview, with pre-written and structured questions. Felt formal but interviewers were very friendly. Long process between scheduled interview and receiving outcome. Don't expect to hear back right away.", "Interview Questions": "Tell us about yourself and why you're applying for this role"}, {"date": "16 Jan 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at YWCA", "Interview Descriptions": "interviewed with Program Director for a one-hour interview where they asked me about my past experience, my career goals, why I want to work there, and gave me some scenario questions.", "Interview Questions": "Why do you want to work at YWCA San Diego"}, {"date": "22 Jan 2023", "title": "Business Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at YWCA in Jan 2023", "Interview Descriptions": "- Asked questions relating to the skills required in the job posting (conflict resolution with a shelter participant, budgeting, assigning shifts for relief workers), and many questions related to feminism and violence against women.", "Interview Questions": "What does feminism mean to you?"}, {"date": "11 Apr 2022", "title": "Volunteer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at YWCA", "Interview Descriptions": "Casual interview that focused on learning about past volunteer experience and educational background that will benefit the performance of the tasks at hand. Very clear description of standard and expectations as well as how to attain them.", "Interview Questions": "What experience in the field do I have?"}, {"date": "16 May 2022", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at YWCA (London, ON) in Mar 2022", "Interview Descriptions": "First I have submitted Resume via email and cover letter after a month, I had a panel interview with 3 people and then reference checks followed. it was a pretty tipical process...", "Interview Questions": "What did I do in a previous positon"}, {"date": "1 Feb 2022", "title": "Stopping the Violence Outreach Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at YWCA", "Interview Descriptions": "This interview was tedious and very specific.  I felt slightly hounded by the interviewers and it was very challenging.  There were specific questions that pertained to my current employment as well as questions that would allude to how I would fair at the job in question.", "Interview Questions": "Where does domestic abuse come from?"}, {"date": "13 Jul 2021", "title": "Curriculum Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at YWCA (Edmonton, AB) in May 2021", "Interview Descriptions": "Very pleasant and casual.  I was interviewed by two people over google meet. They questions were the basic questions usually asked. Basically remember to highlight what you bring to the table and your experiences.", "Interview Questions": "1. What three things are most important to you in a job?\n2. What is your experience in workshop development or facilitation?\n3. What skills can you bring to this role at the YWCA?\n4. What are your greatest strengths and weaknesses?\n"}, {"date": "26 Jul 2019", "title": "Employment Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at YWCA", "Interview Descriptions": "very well presented over the phone and quick responses. i was asked about timing and when i was available to go in for the interview, i was given info on the process of how the interview will be conducted.", "Interview Questions": "are you still looking for a this position?"}, {"date": "29 Sept 2018", "title": "Employment Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at YWCA", "Interview Descriptions": "Answered a series of questions and did a written exercise. It was a good experience overall. As long as you are prepare yourself in advance, you should be good. They ask things that you can tie in many of your own experiences/stories.", "Interview Questions": "Straightforward questions that you would expect for the type of job. They test you to see how well you are aware of current employment issues, how you would deal with challenging situations, etc."}, {"date": "14 Aug 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at YWCA", "Interview Descriptions": "Pretty easy! Not difficult! Interviewer wanted to know more about me and how I will benefit the organization.  What other organiation I am involved with and ideas I have for this organization.", "Interview Questions": "Ask you about what you know about the organization? "}], [{"date": "26 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at YWCA (Toronto, ON) in Jan 2018", "Interview Descriptions": "the ask you several questions that you can find on most websites like tell me about yourself and the same things like your weakness and strength and some personality questions.", "Interview Questions": "1.tell me about your self?\r\n2.Why did you choose to work for us?\r\n3.what was  the worst situation that you had to cope with and how did you do that?"}, {"date": "5 May 2017", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at YWCA (Vancouver, BC) in Apr 2017", "Interview Descriptions": "Panel. Questions for me, short facilitation exercise, questions from me. Submitted resume and cover letter, got called for interview and told to prepare short facilitation exercise; questions on the YWCA, personal questions on character, preferences, strengths, teamwork, etc. and presentation.", "Interview Questions": "What do you know about the YWCA?"}, {"date": "6 Nov 2018", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at YWCA (Edmonton, AB) in Mar 2017", "Interview Descriptions": "Smooth interview. Polite and friendly staff. A lot of the questions asked were related to my personality and ability to handle crisis in the workplace. Good client management skills are also paramount.", "Interview Questions": "How have you helped to improve existing work/management processes in your former job role(s)."}, {"date": "15 Mar 2017", "title": "Job Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at YWCA (Toronto, ON) in Feb 2017", "Interview Descriptions": "Interview of 13 questions with two staff, Interview was pleasant and non stressful. Questions were a mix of behavioral type questions mixed with experience in sector. Manager was pleasant and offered water part way thru the interview. The interview lasted a little over an hour and was very professional.", "Interview Questions": "Give an example of a time where you had to manage a conflict at work with a client or another staff."}, {"date": "4 Jul 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at YWCA (Toronto, ON)", "Interview Descriptions": "Interviewed with 4 members of the HR team and it felt more like a relaxed conversation. They took turns asking a question from the booklet they had, you will then be rated on how well you answered that question. Based on your overall performance, you will then be selected as the successful candidate, of course, considering all other aspects of cultural fit, etc.", "Interview Questions": "Experience with AODA & other legislations."}, {"date": "1 Sept 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at YWCA (Calgary, AB) in Mar 2016", "Interview Descriptions": "It was a one on one in person interview with a slate of standard questions.  The questions were asked in a polite and respectful manner and the interviewer was delightful.", "Interview Questions": "Why do you want to be a volunteer with the ywca?"}, {"date": "3 Feb 2017", "title": "Sexual Assault Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at YWCA (Lethbridge, AB) in Oct 2015", "Interview Descriptions": "The interview was run by the program manager. The position I applied for was not the position discussed in the interview. The HR did not say anything. The age discussed in the interview was 19.10/hour and the actual wage in context was 18.12/hour (same situation with other employees). HR forgot to contact me to extend the offer. The Program Manager contacted me weeks later to start immediately", "Interview Questions": "What do you know about the cycle of domestic violence?"}, {"date": "13 Jan 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at YWCA (Calgary, AB) in Jun 2014", "Interview Descriptions": "Got to the interview through volunteering. Casual and easy interview. Lasted for about an hours. Was interviewed by HR representative and direct Supervisor. Most of the questions were behavioral. Called back in a week.", "Interview Questions": "What is the worst thing that your friends are telling about you?"}, {"date": "15 Feb 2014", "title": "Employment Counsellor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at YWCA (Vancouver, BC)", "Interview Descriptions": "Two interviews followed promptly by a job offer. The interviews were both panel interviews with each panelist taking turns asking a predetermined series of questions. You must know the YWCA mission and be clear that you are a good fit. There was also a practical test to assess computer skills.", "Interview Questions": "Have you ever experienced an ethical dilemma with a client?"}, {"date": "8 Mar 2016", "title": "Child Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at YWCA (Regina, SK) in Sept 2013", "Interview Descriptions": "I was referred by a friend who works there. Got an interview one week after. \r\nEasy interview,nice people~\r\nAsked to introduce myself, past experiences, why do you want to work here, how do you plan to do your work.", "Interview Questions": "Why do you want to work for us"}], [{"date": "19 Feb 2013", "title": "Purchasing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at YWCA (Vancouver, BC) in Mar 2012", "Interview Descriptions": "I recieved a phone call in response to my application and resume submission. There were 2 interviews done in total, both with more than one interviewer. They were direct, but nice people, asking basic interview questions (based on past experiences, your background in the field, etc). HR do not carry out the interviews, you will be meeting your boss directly for them. Interviews are done in meeting/conference rooms, 2 chairs facing one. Be prepared with information you know about the organisation and their industry.", "Interview Questions": "The questions are quite standard, nothing out of the ordinary. The classic hard ones are : What challenges did you face at your last job and how did you manage it? They place emphasis on workplace relationships and will ask how you would deal with difficult colleagues."}]]