[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic opportunity for young professionals. Definitely a great hands-on experience in international development.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Feb 2020", "job_title": "Program Manager in Panamá", "duration": "N/A", "pros": "Global Brigades is a great place to work, it has a dynamic environment and it's truly culturally diverse. \r\n\r\nEven if Non-Profits aren't your thing, it is a great place to learn and put in practice knowledge for the benefit of others and grow professionally.\r\n\r\nIt is an organisation that is growing fast and there are a lot of projects to get involved that make a sustainable impact in different countries.", "cons": "For some, it takes some time to adapt to the speed and dynamism of the organisational culture, but if you are prepared and open-minded you'll adjust easily."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "More of an internship than a job", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Nov 2020", "job_title": "Program Associate in Panamá", "duration": "N/A", "pros": "Unique experience to work abroad\r\nA good mix of office work and time in the field\r\nOpportunity to work with an international staff\r\nOverall good mission although it oftentimes takes a backseat when it comes to making hard decisions", "cons": "Company is more concerned with profit than impact\r\nFinancial transparency is a core value but is severely lacking\r\nDisorganized and zero transparency from leadership\r\nLots of work for very little pay"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great life experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 May 2015", "job_title": "Chapter Advisor in Panamá", "duration": "N/A", "pros": "Living abroad is an amazing opportunity. You have the opportunity to gain field work experience as well as office skills. With the transition to all chapter advisors to Nicaragua it can be a bit more office time but there is still ample opportunity to get out on brigades and in the field if you show interest and take initiative. \r\n\r\nMeeting awesome local staff! Navigating a cross-cultural workplace can be trying at times but it's a great challenge to take on. My Spanish skills definitely improved while in-country, don't stop speaking Spanish (it's also a great résumé booster!)\r\n\r\nThere is a lot of opportunity to travel and explore the country you are living in. Work//life balance is great. \r\n\r\nI met some of my best friends in GB. I'll always remember my time in Central America!", "cons": "Some of the brigade coordinators are extremely unprofessional and hard to work with. Can be difficult to manage that and a million other things at once. \r\n\r\nProgramatic changes are extremely challenging to implement. Program Associates // Managers need to be invested and involved in making those changes, especially to new GB disciplines."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great organization to experience nonprofit management and implementation first-hand", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 May 2015", "job_title": "Director in Panamá", "duration": "N/A", "pros": "This organization has such a wide range of services that it wouldn´t be difficult to encounter at least one aspect that triggers your professional interest. GB truly provides opportunities to test professional and personal capacities do to its ample volunteer-community development vision. No matter what role you are working on, the expectation is that all coworkers be immersed (to some degree) with tasks such as managing budgets, staff and resources, client service, development, project management, impact measurement, supervision, etc.", "cons": "The variety of roles is scarce as the organization constantly strives for low budget-lean operations. In some cases various tasks and roles are assigned to one employee in order to maintain low costs which can be overwhelming at times. Nevertheless this particular downside has provided incredible growth opportunities for those that were able to organize and balance the work load."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Microfinance Consultant", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 May 2015", "job_title": "Microfinance Specialist in Panamá", "duration": "N/A", "pros": "One of the fewer organizations in Panama committed to support and develop an honest development efforts to increase rural poor communities access to opportunities for improvement.\r\nCross cultural environment open to improvements and always concern about the positive impact in small communities.  \r\nMost of the Program Managers are professionals with genuine interest in rural development and providing opportunities for local employment. The organizational structure is changing according to the needs of the organization and considering to make effective and sustain support to communities. \r\nThe staff is open to suggestions and feedback not only from coworkers, but supervisors and community beneficiaries.", "cons": "Most of the middle positions are for young professionals interested in a intense learning environment with great capacity building and professional development but not a long term career. \r\nRequieres discipline to operate under limited supervision"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Very disappointing and unaccountable", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Sept 2013", "job_title": "Program Associate in Panamá", "duration": "N/A", "pros": "Doing field work in rural communities, working with indigenous communities, working on week-long brigades with students building composting latrines, planting trees, providing med/dent services, etc.", "cons": "The organization cannot find a direction and stick with it. Staff turn over is extremely high, which makes productivity next to impossible. American management was very unprofessional  and put forth little effort to work with his in-country team. Company executives are far more concerned with the student experience rather than local communities that we were trying to impact."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It was great to work for an organization focused in sustainable rural development in Latin America.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jun 2012", "job_title": "Intern in Panama City", "duration": "N/A", "pros": "living in another country, learning another language, working towards a cause you are passionate about, working closely with a team of interested, young, and close individuals- it's a great way to get field experience when you finish with college", "cons": "pay is minimal, work environments are cramped, things are always changing"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Looking to make an impact on the ground in developing nations", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Dec 2013", "job_title": "Program Manager in Panamá", "duration": "N/A", "pros": "You develop skills quickly and are given room to explore ideas and pilot various projects. Management is very open to new ideas. Great for career starters", "cons": "Pay and benefits are very low with little to no opportunity for advancement in the organization.  There is also very little investment in the staff."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission, still finding its feet", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jul 2020", "job_title": "Monitoring and Evaluation Officer in Panamá", "duration": "N/A", "pros": "cultural exchange, focus on sustainability, meet inspiring clients", "cons": "scope of work is limited by the donors, still working to solidify program goals and activities, management frequently moves forward with large programmatic changes without the input from lower-level staff"}]]