[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Caribbean Campaigner", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Apr 2023", "job_title": "Campaigner in Ciudad de Mexico", "duration": "N/A", "pros": "Even though I have only been working at Amnesty International for a month and a half, I have already formed a highly positive opinion of the organization. One thing that has impressed me the most is the flexibility the company offers its employees. This has allowed me to balance my work responsibilities with my personal life in the best way for me. Additionally, the overall work environment is fantastic. The company culture is welcoming, and everyone is supportive and friendly. The camaraderie among colleagues is palpable, and I feel amazingly comfortable asking for help or advice from anyone in the office. I also appreciate the respect and promotion of diversity that Amnesty International embodies. The company is committed to creating a workplace where everyone feels valued and respected, regardless of their race, gender, sexual orientation, or any other characteristic. Finally, I am impressed with the company's dedication to the health and well-being of its employees. Even though I have only been working remotely, I can see that the management team is highly committed to ensuring that everyone feels supported and cared for. Overall, I feel extremely fortunate to be part of such an incredible organization, and I look forward to continuing to grow and develop my skills while working here.", "cons": "In my brief time working at Amnesty International, I found the experience rewarding and fulfilling. However, I believe the company could make some improvements in its onboarding process for new employees. I have found that the amount of knowledge required to succeed in my role is quite significant, and the learning curve can be steep. While my colleagues have been incredibly supportive and helpful in answering my questions, I believe a more robust onboarding program would benefit all new employees. For example, the company could create a more structured training program that covers all aspects of the job, including policies, procedures, and systems. This could help new employees better understand their role within the company and feel more confident in their abilities."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Good training", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Dec 2022", "job_title": "Direct Dialogue Fundraiser in Ciudad de Mexico", "duration": "N/A", "pros": "The techniques that they provide us to do fundraising was good. The training is constant and the environment is pleasant.", "cons": "I would have liked them to train us more in human rights issues. There are not many opportunities for growth."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Human rights campaigning", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Sept 2022", "job_title": "Deputy Director Campaigns in Ciudad de Mexico", "duration": "N/A", "pros": "Committed colleagues and well funded organization that allows you to be creative to achieve change.", "cons": "Large organization which may sometimes feel burocratic."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Sept 2021", "job_title": "Content Manager in Ciudad de Mexico", "duration": "N/A", "pros": "A diverse multicultural organization with outstanding professionals", "cons": "Too centralized in London, needs more decentralization"}], [], []]