[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Working Remote for an Amazing Animal Career School", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "3 Dec 2020", "job_title": "Management in Valencia, CA", "duration": "N/A", "pros": "I have been part of the ABC family for over a decade. ABC is a growing family that cares about its employees, both personally and professionally. \r\n\r\nI can’t imagine working anywhere else, and I have personally referred many people who are now also working for ABC that feel the same way. Many of us have been with the company for over a decade because we recognize a great place to work, and we share the same passion for helping people and animals. I am a firm believer that if you enjoy what you do for a living, it doesn’t feel like work. Luckily for us, the owner is smart and made sure that we always had an emergency plan. While we never expected to have to use it, he made sure that if something were to happen (a fire or an earthquake is what we were worried about) that ABC employees would still have a job, and we would be able to conduct business at either an alternate location or from home. \r\n\r\nNo one could have predicted Covid, but luckily, we were more prepared than most companies and had everyone working from home with minimal downtime (most experienced no downtime). ABC was able to keep everyone working, which has been a blessing for us all. ABC has decided to allow employees to continue to work from home, which opens up the door for us and others since now people can work in other states besides California.", "cons": "Often, hard work is rewarded with more work. But the positive side to this is the company takes care of its dedicated employees. So, while it can be stressful having an overwhelming full plate, it is always worth it in the end. ABC recognizes and rewards those that work hard and are dedicated to making ABC better."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "(Working remotely)", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Nov 2020", "job_title": "Admissions Counselor in Valencia, CA", "duration": "N/A", "pros": "(Working remotely) - I am an employee of Animal Behavior College. ABC has worked very hard as a team unit to make us a remote working environment a good one for all employees as a whole since Covid began…to be apart and still work together as a team. Although I do miss all of the staff and the great environment we had. I am very grateful my company has adapted and created a virtual/remote environment so all of at ABC could continue to keep our jobs and still be able to help people get into careers helping animals as a professional Dog/ Cat trainer, Vet assistant, Groomer, Aquarist and Zoo Keeper Assist. I am very fortunate to be able to keep my job and work remotely….this is an awesome company to work for", "cons": "Miss all of the staff and the great environment we had....But, I get to save gas and sleep in a bit (no driving time)"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not Great, unless you love stress.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Nov 2021", "job_title": "Admissions Counselor in Valencia, CA", "duration": "N/A", "pros": "Experience in repetitive data entry. Relaxed environment, for the most part. Other than that, it’s really just a good filler job until something better comes along. Experience with call center/telemarketing work (even though they promise a position “helping students achieve their goals” and “bring up the next generation of groomers/vet assistants/trainers”. Ability to transition to remote during COVID has been helpful, however employees have been scrutinized for not being able to provide ideal work environments in the short transition period. With the choice to stay remote, I believe employees will be given additional time to provide themselves with proper set ups. Being an Admissions Counselor, commission is given per student enrollment.", "cons": "Upper management are known to condescend and publicly shame employees, including talking poorly of specific employees with office doors open and extremely audible. HR fraternizes with certain upper management so complaints against them are never taken seriously, and anything you say is immediately repeated to whomever the complaint was about. Unless, of course, you file a complaint about someone that HR doesn’t like, then your case may get some action. Externship Coordinators, Program Managers, and Qualifiers are paid pennies in comparison to upper management. “Bonuses”, if you can call them that, are only given to five employees at a time (awards done each month) and they’re usually either $100 (for two employees) and the rest get $25 for the Program Operations Department. But it’s entirely based on numbers, which is difficult for all departments to maintain considering the vast differences between the expectations of student in each and the job descriptions of each employee. ABC expects their mentors to work for free, unless it’s the Dog Obedience Program. Admissions Counselors are allowed and encouraged to be dishonest to students to enroll them, even so far as to enroll student with significant intellectual or physical disabilities that ultimately prohibit them from completing the program once they get to Externship, which doesn’t matter because they sign their right away to a refund if they reach that stage. So ABC still gets its money. ABC overworks their staff and expects perfect performance, while offering little to no support. We are expected to answer questions about legalities, disabilities, and insurance concerns with no assistance or knowledge of what ABC is actually covering and how we can assist student and mentors. The CEO is so out of touch with his employees, he genuinely doesn’t understand how his own programs operate or what we even do when we’re working. He puts priority in to uninteresting and unsuccessful programs while the others flounder, to see which he can make a quick buck off of. Rather than supplying additional support for his current staff so that we can provide a much better experience for existing programs, he creates programs that no one wants and hires more staff at awful pay and leaves other staff to fend for themselves. If you apply for a position, whether you already work for the company or not, but you don’t get the job they will just ghost you rather than informing you that you aren’t getting the job. Which isn’t required, but it’s basic decency. Which ABC seriously lacks. The company also encourages employees to write good reviews on Glassdoor and other sites, sometimes even offering pay as an incentive, to keep their scores up. Even going so far as to recommend things to say or have upper management write it themselves. Upper management lacks compassion for employees and they often retaliate in subtle ways to make employees uncomfortable, further preventing employees from speaking out and voicing concerns. Answering phone calls from angry students and parents and not being able to transfer them easily or reach out to management for assistance is exhausting. The turn around for the company is astronomically fast. Ultimately, if you value your sanity, choose another company, because you’ll constantly feel responsible for other people’s words and actions, leaving you drained at the end of every work day. On top of it, ABC boasts having the ability for employees to advance within the company, but rarely make positions known to employees who are eligible. While the remote life is nice, the overall work environment is not worth it. Prepare to be ignored, undervalued, and neglected by your superiors, unless you’ve somehow managed to get their negative attention in which they will hyper-fixate on impossible standards."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Company tries to maintain employee morale", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Nov 2021", "job_title": "Admissions Counselor in Valencia, CA", "duration": "N/A", "pros": "Full Benefits\n401K\nFamily-Oriented\nWell known college in the animal education industry (Dog Trainer, Groomer, Vet Assistant, Etc.)\n8 am - 5 pm M-F (regular work hours)", "cons": "Micro-managed environment\nLittle opportunity to interact with co-workers throughout the day\nRecord calls, listen back and critique sales \nInflux of sales reports distributed \nMore interest in a sale than in education"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Animal Behavior College is not just a school, it's a family!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Oct 2020", "job_title": "Customer Service Specialist in Santa Clarita, CA", "duration": "N/A", "pros": "After working for Animal Behavior College for almost 8 years, I can honestly say that this has been the best job/career that I have ever had! Especially during the COVID crisis, I did not have to worry about being laid off - in fact, ABC adjusted to the crisis and now we have the option to work from home, remotely! As a mom, ABC has always been understanding when doctor appointments come up, etc. and time off was needed. What I like about this job is the people. We really do treat each other like family, and our managers really care about their employees! Best job ever!!", "cons": "I have nothing negative to say about Animal Behavior College"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Animal Behavior College", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Nov 2020", "job_title": "Qualifier in Santa Clarita, CA", "duration": "N/A", "pros": "My coworkers are great and the company is great to work for. There is a positive energy at this company. During Covid-19 they adapted really well and allowed us to continue to work remotely.", "cons": "I really do not have any cons about working here."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "My Favorite Job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Mar 2017", "job_title": "Anonymous Employee in Valencia, CA", "duration": "N/A", "pros": "I am so glad I was offered the opportunity to work at ABC. It is my favorite job that I have ever held and I feel that everyday presents a new chance to grow. My co-workers and management are not only hard working and supportive, but also make the office an enjoyable place to be. There are high expectations of employees and the work can be challenging; however, the company also has an amazing work-life balance. The management team truly understands that we are all individuals with lives outside of the office and in exchange for the hard work done by employees, they are willing to offer flexibility. I highly recommend ABC as a place of employment and can see myself staying here for a very long time.", "cons": "The departments can tend to be independent from one another so it is hard to get to know everyone in the company. Also, if you are hired in a certain role at ABC, you may not necessarily advance in title, but there are opportunities to earn more and/or take on additional responsibilities. It is all about what you make it in my opinion."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Overall a great, local company.  I look forward to going to work each day", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Sept 2018", "job_title": "Anonymous Employee in Valencia, CA", "duration": "N/A", "pros": "Flexible hours and awesome people are what makes Animal Behavior College a great company! As a well-established company in the Santa Clarita Valley, ABC is a fantastic company to work for.  Employees are friendly, helpful and just about everyone who works here is very family oriented.  Management is also very understanding when it comes to work/life balance. I have not had any trouble with scheduling appointments or vacation, and they are very open to adjusting schedules around said appointments. As a single parent I appreciate their compassion and flexibility. ABC is also full of fun, friendly people who go out of their way to be helpful and kind.", "cons": "Management can be slow to adapt when it comes to changing their methods and new ideas.  Often employees have fantastic ideas of how to better improve overall work flow and they are ignored or set aside with faulty reasoning of why the idea cannot be implemented."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Jan 2018", "job_title": "Program Manager in Valencia, CA", "duration": "N/A", "pros": "Wonderful managers and coworkers who really care about you. Wonderful working atmosphere where everyone has each others back. Flexible, office environment.  Fun office potlucks and wonderful staff. Overall it's an awesome job with medical and dental benefits and a team that cares. Feels great to help students achieve their goals to work in a field I've worked in for over 15 years.", "cons": "The pay is not amazing and it feels like some students shouldn't be enrolled in the program because they don't want to be here. However, I feel you would find this in any educational environment and you can only help the ones who want to be helped!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Friendly and Easygoing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "2 Jan 2018", "job_title": "Program Manager in Santa Clarita, CA", "duration": "N/A", "pros": "I have spent 7 years with this company and love working here! Like most jobs, if you put the effort into your work you are rewarded for it. With ABC’s assistance, I was able to expand my knowledge about the animal services industry. Every day I come to work, I use what I’ve learned to help students. Helping them makes me feel good and gives me a sense of accomplishment. This makes my job very rewarding. Regarding promotions, since I’ve been at ABC my hard work and diligence paid off, as I was even promoted a couple of times! You never feel alone. The staff truly cares about you and management is accommodating and supportive. They encourage you and help you to succeed. The pay is also good and I’ve made many wonderful friendships here.", "cons": "I do not have any cons"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A terrible place to grow", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jun 2017", "job_title": "Program Manager in Santa Clarita, CA", "duration": "N/A", "pros": "Flexible schedule, work Monday - Friday, managers CAN be easy going, work is the same daily. Great co-workers!", "cons": "They really don't know how to properly run a company, everything is backwards. People get away with doing terrible work. Some management has no clue how to manage effectively, no prior experience managing, no room for growth, very rarely gives raises, president could not care less about you. They care more about making money than taking care of employees."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Externship Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jul 2016", "job_title": "Externship Coordinator in Santa Clarita, CA", "duration": "N/A", "pros": "I love being able to help students follow their passion and dreams in the animal industry.", "cons": "My department has some turn over moments.  That is not the companies fault.  It's more about hiring people who really do love grooming and want to help others.  If you don't have a passion for it then you won't last.  That goes for any job but especially in this field."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Admissions Counselor", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 May 2017", "job_title": "Admissions Counselor in Valencia, CA", "duration": "N/A", "pros": "This has been a really great job for me, for almost 4 years, and the ONLY reason I am leaving this awesome company, is because I am moving out of the city.  They are like a family here, and they are so considerate and flexible, when it comes to your own family.  I am a single mom of a boy in elementary school, and ABC has allowed me the time off as needed, in order to do the mommy thing.  I have even been allowed to bring my son to work with me, when I couldnt get a babysitter at the last minute or something. So if you need a job that will work with you around your family schedule, this is a good one!!  The management here has been great, and I can honestly say the best thing about ABC is the people that work here. They are big animal lovers, with huge hearts, and they help out at the pet rescues and adoption centers.  They even have a campaign here called Students Savings Lives, in which they assist in helping the dogs at the shelters get adopted out.  This is really an awesome company to work for, and if I ever move back here, I would absolutely love to come back to work at ABC!", "cons": "The only con is that because we have different departments that are on different floors of the building, I wasnt able to see ALL of my work friends everyday."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Oct 2020", "job_title": "Customer Service Specialist in Los Angeles, CA", "duration": "N/A", "pros": "-you know exactly what to do everyday when you come in (self starter).\r\n-everyone is nice and friendly.\r\n-trainer is knowledgeable and patient (in my dept at least).\r\n-CSS dept has some of the best employees to work with. \r\n-communication is key and they all communicate very well with each other daily. \r\n-LOVE the Holiday festivities (even remotely). \r\n-HR does a wonderful job at bringing the company together and lifting spirits (again, even during a pandemic).\r\n-AC’s are always quick and friendly to assist us.\r\n-Management is always available to assist a and help when needed.", "cons": "-can be stressful and overwhelming at times."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Sept 2016", "job_title": "Program Manager in Santa Clarita, CA", "duration": "N/A", "pros": "Its a easy job, none of the employees have any higher education than highschool.  So not much is expected of you as a employee.", "cons": "Management doesn't know how to do their jobs\r\nNo room for growth\r\nNo Leadership\r\nPoor pay\r\nNo Direction\r\nExtreme Favoritism\r\nHigh school like environment all based on clicks"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A good company and a great cause!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jan 2018", "job_title": "Administrative Assistant in Santa Clarita, CA", "duration": "N/A", "pros": "This is an interesting intense job, great for a motivated self starter like myself.  It is not the traditional corporate environment and there is opportunity for those willing to apply themselves.  Plus, helping people help animals is a great thing!", "cons": "No real cons.  This is not a job for someone who expects to be rewarded for just showing up."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "\"Pawsitive\" work environment.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Jul 2016", "job_title": "Anonymous Employee in Santa Clarita, CA", "duration": "N/A", "pros": "- Excellent location, away from high traffic areas of the city. The office is very nice.\r\n- Some really great people here, in all departments.\r\n- Arranging time off has never been a problem.\r\n- Great interdepartmental meetings, creating a team environment.", "cons": "- Low pay ceiling.\r\n- Slow moving procedures delay certain tasks."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Externship Coordinatior", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Aug 2018", "job_title": "Externship Coordinator in Santa Clarita, CA", "duration": "N/A", "pros": "Fun, challenging,  rewarding, atmosphere with little to no stress. They work well with my schedule, weekends and major holidays off and wonderful co workers!", "cons": "Wish I could work from home. And there is not really an opportunity to promote. Other than that, cant think of any!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "They don't know how to run a company", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Apr 2017", "job_title": "Manager in Santa Clarita, CA", "duration": "N/A", "pros": "Managing other department employees\r\nCompany relationships\r\nWorking at a school seems like a great thing to do", "cons": "They didn't value my input and suggestions\r\nAlot of people keep quiting so not a nice place to work\r\nThey work you to death doing lots of menial work"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "grooming", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Feb 2016", "job_title": "Dog Groomer in Walkersville, MD", "duration": "N/A", "pros": "I really enjoy were I am working", "cons": "None better tools  some of my contacts weren't nice"}]]