[[{"date": "10 May 2022", "title": "Community Outreach Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dress for Success in Apr 2022", "Interview Descriptions": "I had a 30 minute zoom interview with three team members: the director of communications, director of programs and HR.  Although I didn’t get this job, we had a nice conversation.", "Interview Questions": "Why are you interested in working for us? \r\n"}, {"date": "23 Apr 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dress for Success in Jan 2022", "Interview Descriptions": "Hello, \r\n\r\nThey don't allow phone calls or recruiters, which is fine--so I went ahead and researched who I would be reporting to/who would be my hiring manager, and applied using the email given. I never heard back-- not even a generic bounce back email saying that they received my email.  Never assuming the worst, I checked my junk mail folder, checked back often, and nothing. Eventually LinkedIn updated the job post saying that it was no longer available. :(\r\n\r\nI'm big on communication and respect for peoples time no matter what. Hoping it was just a glitch and the job just wasn't meant to be-- because it would really be unfortunate for such a wonderful company to have such a crappy hiring practice.\r\n\r\nThanks!", "Interview Questions": "Was told to send resume and thoughtful cover letter to the email address given. Was never contacted for a follow-up interview."}, {"date": "14 Oct 2021", "title": "Manager of Corporate Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dress for Success (New York, NY) in Aug 2021", "Interview Descriptions": "It was quick enough, but after the initial interview, I was told to wait about two weeks to hear back.  I didn't, therefore I reached out and was ghosted.  Highly unprofessional.  If you want to move forward with another candidate, that's perfectly fine, but it is rude to not reply to an inquiry or update candidates on their status.  I can see why they had trouble filling this vacancy considering their communication standards.", "Interview Questions": "Generic intake interview in some ways.  "}, {"date": "29 Mar 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dress for Success (Ban Som Phone) in Aug 2020", "Interview Descriptions": "First, there was a quick phone interview (under 15 minutes), then a couple of Zoom interviews following that. The questions were basic and the interviewer was friendly. Received email communication afterward.", "Interview Questions": "Why do you want to work for Dress for Success?"}, {"date": "29 Jan 2019", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dress for Success", "Interview Descriptions": "I sent my resume and cover letter to the hiring manager via email. I was a freshman in college and I found the listing for the position through my university job/internship database.", "Interview Questions": "What qualifications for you have for this position? "}, {"date": "13 Aug 2016", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Dress for Success (Los Angeles, CA) in Jan 2016", "Interview Descriptions": "It was really layed back. They invited me to the office, asked me a few questions, gave me a tour of the office and introduced me to everyone, and invited me to join the team before I walked out. \r\n\r\nIt's an unpaid internship at a non-profit so I'm not sure how many applicants there are, and there were multiple positions open. I mentioned I applied for one position but would be open to either that matched my skill set, and they said that was fine.\r\n\r\nA lot of the focus was on me and what I would gain, again since it's an unpaid internship, they work really hard to make sure it's going to be a valuable learning experience and that the fit with the company is good.", "Interview Questions": "Why do you want to work here?\r\n\r\n"}, {"date": "11 Dec 2016", "title": "Development Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Dress for Success (New York, NY) in Jan 2016", "Interview Descriptions": "There was a two step interview, plus the application; basically you submit your cover letter, resume, and hypothetical and wait for a callback. You head in for the first round of interviews and then if they like you they ask you to come in again. After that it's pretty quick they just bring you in, give you a computer, and you basically figure everything out on your own. Terrible training here.", "Interview Questions": "What past experience did I have that has prepared me for this position. "}, {"date": "16 May 2015", "title": "Graphic Design Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Dress for Success (Los Angeles, CA) in Apr 2015", "Interview Descriptions": "Development manager took the interview and asked a few questions about what I am capable of. It made me comfortable when she says I was just the kind they wanted.", "Interview Questions": "How long do you need to design this?"}, {"date": "14 Apr 2014", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Dress for Success", "Interview Descriptions": "1 informal Interview with Executive Director and Manager present. Questions about previous experience and present skills and hours of availability. Affiliate is small with only a max of 3 (Executive Director included) paid staff. Approximately 6 - 10 active volunteers. resume was reviewed.", "Interview Questions": "No difficult questions. Everything was standard. Interview was informal."}, {"date": "7 Dec 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dress for Success (New York, NY) in Mar 2014", "Interview Descriptions": "met with center manager, then company manager hired the next day ask a bunch of questions, pertaining to the job, they told me about the position and i was impress,", "Interview Questions": "whey do you wanna work here"}], [{"date": "11 Jul 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Dress for Success (New York, NY) in Mar 2013", "Interview Descriptions": "Interview Q & A.  Interviewed by one level of management.  Then interviewed by the next level of management.  I was grilled about my work experience that related to position I was being interviewed for.", "Interview Questions": "Questions about experience related to job.  Specially non-profit questions."}, {"date": "24 Feb 2013", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dress for Success in Jan 2012", "Interview Descriptions": "1. First contact was a phone interview. This was straightforward- asked about my experience working with the client population, why I was interested in the position, etc.\r\n2. Second contact was an 1:1 interview. Again, fairly straightforward, a lot of behavioral questions. How would I deal with a difficult client, how do I deal with a conflict with a co-worker, etc. \r\n3. Third contact was a presentation. I had to develop a curriculum module on job searching, come up with ideas to recruit clients and partnering agencies.\r\n4. My references were contacted.\r\n5. Final interview. I was given less than 24 hours notice for this interview. Good thing it was a phone interview. The interviewer called me at the wrong time and did not know what position I was applying for. \r\n6. After all that, no response. No courtesy email saying that they chose another candidate. I find that behavior to be incredibly rude and unprofessional.", "Interview Questions": "Develop a module on job searching for job seekers."}, {"date": "18 Jun 2011", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Dress for Success in Jun 2011", "Interview Descriptions": "I was impressed by the office and the pleasant staff working at the front desk. I only spoke to a director one on one and did not meet others in the office. I didn't like that the staff was all women and that the office was so open and loud you could hear everyone's conversations. I don't think the job was the right fit for me but otherwise it was an ok situation.", "Interview Questions": "tell me about why you chose nonprofit"}, {"date": "31 Dec 2012", "title": "Program Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dress for Success (New York, NY) in Apr 2011", "Interview Descriptions": "1. I first received a call asking if I was still looking for a job several months after I submitted my application. The caller said that many of the applicants s/he was sifting through had found employment. She would be calling back the following week if she wanted to interview me in person.\r\n2. I had my first interview with my potential boss. It was friendly and informative. I was given a couple questions/problems and asked to write a short essay on how I would approach/solve the issues presented.\r\n3. A couple days later, I was told via email that the answers/solutions should be in PowerPoint format instead.\r\n4. After submitting the presentation in pdf format, I was asked a second question and told to submit a second presentation with a solution to that issue.\r\n5. I was told it was most likely I would have a second interview, but with a panel to include other managers and my potential supervisor's boss as well. They were waiting to find out available dates. As I was going to be out of town the following week, I let them know the date I would be returning.\r\n6. I received an email while I was out of town, asking me to come in for the second interview the next day. I replied that my flight did not arrive until two days later, so the interview was rescheduled for the morning after I arrived.\r\n7. My 2nd face-to-face interview was with three other women, two of my potential supervisor's peers and their supervisor. I was asked several questions, but was not given the opportunity to ask any of my own, but was dismissed from the interview abruptly when they had finished with their questions.\r\n8. I received an offer letter a few days later along with a call from my potential supervisor. I had some questions to ask her and she advised that I should pose them to her supervisor, who seemed confused as to why I would be asking any questions. She was also abrupt in confirming details of the hire which were not clear to me.\r\n9. My position started with a week of training which was slightly disorganized, but relatively informative. It felt like no one really wanted the job of training me, but were under obligation.", "Interview Questions": "The most difficult questions were those posed for the project(s):\r\n1. How would you decrease the number of no-show clients?\r\n2. Write an informative presentation for employment seekers by choosing an element of the job search to highlight."}]]