[[{"date": "30 Mar 2023", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bellevue College (Bellevue, WA)", "Interview Descriptions": "Be prepared for about 40 mins of questions from the “Screening Committee” and then a teaching demo on the topic that the Comm assigns you and gives a week or less time for you to prepare", "Interview Questions": "Why do you want to teach at BC?"}, {"date": "18 Feb 2022", "title": "Associate Dean of High School Initiatives Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bellevue College", "Interview Descriptions": "Job was advertised in August 2021, I applied in October, had a 1st round interview in November and then a Final round interview in January. The panel said that I would hear back from them in 2 weeks. I withdrew yesterday (February) because they have not communicated the results yet. A complete waste of time, definitely not worth the effort. In addition to a lack of professionalism on the hiring official's part, a large majority of the team members in the panel inter iew seemed unmotivated to participate in the interview. I got the sense that there were many employees that were disgruntled or simply unhappy. Not saying this is due to the College, however such was my experience.", "Interview Questions": "How do you deal with differences that occur in the work environment?"}, {"date": "27 Oct 2021", "title": "Payroll Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bellevue College", "Interview Descriptions": "the process was easy and everyone was kind and nice. be honest and you will be fine. having payroll experience is a plus. Be ready to ask question at the end.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "19 May 2023", "title": "Global Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Bellevue College (Bellevue, WA) in Sept 2021", "Interview Descriptions": "You will be asked about how you could help international students and let them engage in the program, as well as your plan to organize an international event. Plus some personal questions.", "Interview Questions": "Q: As a global leader, can you propose an event idea that will actively engage international students"}, {"date": "23 May 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bellevue College", "Interview Descriptions": "Invitation to interview in front of 5 people.  I was given the list of questions to answer about 10 minutes before the interview, then they read the questions and I answered.  There was no discussion or follow up questions on their part.", "Interview Questions": "How would you promote inclusion and diversity in my position?  It was also required to write a diversity statement to include with application."}, {"date": "9 Nov 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Bellevue College (Bellevue, WA) in Sept 2018", "Interview Descriptions": "They director of the ASC would look at the form you filled and ask you questions from the form. Also, if accepted, they would check on which classes you're taking and what your availability is to tutor.", "Interview Questions": "*Look at one of the questions from the form you filled out"}, {"date": "13 Jul 2018", "title": "International Admissions Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bellevue College", "Interview Descriptions": "Committee was rude and unprofessional, did not talk to me, but at me. They did not make eye contact with me at all. They had me come in early, and as I was waiting in the room, they did not acknowledge my presence.", "Interview Questions": "They asked about immigration regulations."}, {"date": "3 Nov 2017", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bellevue College", "Interview Descriptions": "Two rounds of interviews. First was with a panel of three, and the second was with the head of the department. Was offered the position at Bellevue College. \r\nHowever, they lowballed me on the offer, offering less than my requirements and less than what I currently make. They offered me the lower range of the stated budget, and yet they were TOTALLY unwilling to negotiate even a little bit. I was basically told, \"this is the budget for this position. Accept it or we'll move on\". \r\nI believe Bellevue College puts higher salary ranges on their online application and then actually offers a lower salary when the time comes. I would suggest being upfront with your requirements (and their honest budget for the position) or staying away all together. They obviously don't value their employees.", "Interview Questions": "How do you deal with people over email, on the phone, and in-person?"}, {"date": "10 Nov 2015", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bellevue College", "Interview Descriptions": "Apply Online through NeoGov\r\nWill be called for interview with HR after about 2 weeks\r\nThen 2nd interview with department manager\r\nNo drug test or background check will be required\r\nYou will need to attend orientation with HR dept", "Interview Questions": "Have you work with student before? If yes, please tell me your experience with it."}, {"date": "16 Sept 2015", "title": "Student Lab Help Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bellevue College (Bellevue, WA)", "Interview Descriptions": "Didn't really have to apply. My instructor recommended me for the position. If you are interested in any academic student positions, talk to your instructors and department head. They will be willing to help you.", "Interview Questions": "Availability"}], [{"date": "20 Jul 2015", "title": "Customer Service Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Bellevue College (Bellevue, WA)", "Interview Descriptions": "3 interviews total. 1st one was over the phone, getting to know you. 2nd was a panel interview that consist of at least 4-5 people. 3rd was to interview face to face with the executive director. They also require you to provide at least 3 professional references (preferably your ex-supervisors) and they actually call each and every one of them.", "Interview Questions": "Tell me about Bellevue College's mission"}, {"date": "13 Feb 2017", "title": "Continuing Education Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bellevue College (Bellevue, WA) in Aug 2014", "Interview Descriptions": "I have submitted an online application form along with my resume and two letters of recommendation. They have contacted me via email within a few weeks (I was applying for the Fall quarter at the end of Spring). Since I was traveling at the time, we have scheduled a one on one interview in late August. The interview lasted about an hour. We talked about my education, professional, and teaching background; the courses I am planning to offer (curriculum, potential audience, outcome etc.). After I have passed the interview the process was speedy and easy. I had a time to review the contract, salary, and benefits. I also had to attend a mandatory teacher training at no cost. I began teaching my first class within a few weeks after the initial interview. My two bosses have been nice & supportive throughout the hiring process and employment. I enjoy working with them.", "Interview Questions": "My experience and why am I interested in working for them. Who is the audience for my classes, what's the format, what will be the outcome."}, {"date": "17 Aug 2015", "title": "Front Desk Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Bellevue College (Bellevue, WA) in Feb 2014", "Interview Descriptions": "Interview with panel of Program Coordinator, Student Government Rep., and current Desk Lead.\r\nAsked questions about previous customer service and given scenarios, general questions about skills\r\nQuestioned about resume and previous experience\r\nAsked about familiarity with Bellevue College Student Programs (important!)", "Interview Questions": "What Pluralism and Diversity means to you"}, {"date": "29 Aug 2013", "title": "Director, Technology Development & Support Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bellevue College", "Interview Descriptions": "Very thorough and objective process. Must respond to official posting with cover letter that addresses all job requirements. Resume must map to job requirements and cover letter.\r\n\r\nIf application packet passes review by large committee, you will likely participate in a panel telephone interview before being invited to a panel interview on campus.", "Interview Questions": "Give an example of a project you led that did not go well."}, {"date": "22 Mar 2013", "title": "Staff Position Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Bellevue College", "Interview Descriptions": "Only accept online applications; HR screen; Committee members review; interview; Final interview", "Interview Questions": "Describe your commitment to pluralism"}, {"date": "13 Mar 2013", "title": "IT Systems Specialist V Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Bellevue College (Bellevue, WA)", "Interview Descriptions": "There is lots of process in higher education, so expect it to take a long time between phases. When I left I was part of the hiring team for a few positions and saw some prime candidates lost to other opportunities because of the time delay.", "Interview Questions": "None of the questions I received or have given were all that difficult if applying to a position appropriate to your skill set. Do be prepared to answer questions about diversity, and your history working with diverse groups. Pluralism is one of the key tenants of this institution."}, {"date": "7 Mar 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Bellevue College (Bellevue, WA) in Feb 2013", "Interview Descriptions": "You will have get a from academic center. The form will require to write down the class you want to tutor, your grade in that class in that class (has to be B+ or above), and a signature from your lecturer of that class. It is ok to teach more than one subject.\r\nThe hiring person will send you an email for interview in her office.", "Interview Questions": "Why do you want to work as a tutor?"}, {"date": "26 Feb 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bellevue College (Bellevue, WA) in Nov 2012", "Interview Descriptions": "3 Step process:\r\n1. Email Questions that need to be responded by a particular date.\r\n2. In person interview with 4 people panel. Usually 2 Hours. Not that hard.\r\n3. In person interview with hiring manager.", "Interview Questions": "What coding standards do you follow?"}, {"date": "17 Sept 2015", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Bellevue College (Bellevue, WA) in Feb 2011", "Interview Descriptions": "very simple and customer related interview process. two managers had interviewed me and it was an on the go type interview, meaning there were people in line to get interviews. interview took approx 5 minutes and was very short and simple. just basic questions and simple answers.", "Interview Questions": "why should we hire you\r\nwhat do you know about this company\r\nstrengths and weaknesses"}, {"date": "22 Nov 2015", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Bellevue College (Bellevue, WA) in Feb 2011", "Interview Descriptions": "Face to face conversation, review of my transcripts and recommendations from previous or current instructors. We discussed the student tutor functions, scheduling, required functions, academic disciplines I was qualified for. There were no tests or problems to solve. I just had to prove that I was qualified to interact with students in the capacity of a student tutor.", "Interview Questions": "Can you you work with larger groups of students. "}], [{"date": "8 Jul 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bellevue College (Bellevue, WA) in Mar 2010", "Interview Descriptions": "Very long, more than 3 months. When selected, the HR VP and the Instruction Coordinator set up an interview. The candidate must prove his/her skills, every details on the resume is verified.", "Interview Questions": "Why do you want to work with us?"}]]