[[{"date": "9 Sept 2021", "title": "Purchasing Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Missouri Western State University", "Interview Descriptions": "Few people, asking basic job knowledge questions. Not intimidating. Applied, got a call, scheduled an interview, had interview, got an offer, rejected.  Pay is low in my opinion., otherwise I’d have taken it.", "Interview Questions": "Have you every completed a purchase request?"}, {"date": "24 May 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Missouri Western State University", "Interview Descriptions": "Very easy process. This was in person and you had to do a group interview, with multiple rooms as well as an individual interview. The group interviews were long and previous RA's would rate your success.", "Interview Questions": "What is your greatest acomplishment?"}, {"date": "4 Jan 2021", "title": "Switchboard Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Missouri Western State University", "Interview Descriptions": "Was asked how to handle phone systems and what my experience was in terms of customer service and reception work. Was told I would be trained on the job and I was", "Interview Questions": "My schedule and availability for the semester  \r\n"}, {"date": "16 Dec 2019", "title": "Computer Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Missouri Western State University", "Interview Descriptions": "I was interviewed by the manager of the department and three associates. They were all involved in the interview and each too turns asking questions that were obviously created and agreed upon prior to my interview.  Everyone was very polite and kind.  I did not receive an offer for this position, however, the department manager kindly passed along my name and resume to another department she felt had a job opportunity I was better suited for. I then interviewed for that job and got the position.", "Interview Questions": "Describe a time you made a mistake and how you handled it."}, {"date": "16 Apr 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Missouri Western State University (Saint Joseph, MO) in Jul 2017", "Interview Descriptions": "It was very smooth and quick. Interview was with the dean of graduate school.  The dean of graduate school interviewed.  The dean explained responsibilities. Talked about flexible schedule and work hours. The most part of interview was about understanding the responsibilities.", "Interview Questions": "Why you would like to work in this position? "}, {"date": "10 Jan 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Missouri Western State University (New York, NY)", "Interview Descriptions": "Good interview process, mostly questions about customer service experience, written and oral communication, presentation skills, teamwork abilities. They also wanted to know about my availability since they work around your schedule.", "Interview Questions": "What hours are you available to work? (they work around your schedule)"}, {"date": "15 Jun 2021", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Missouri Western State University in Jan 2017", "Interview Descriptions": "You discussed your academic qualifications with the center director, your professor recommendations, and what motivated you to apply to the job. The director wanted to get a feel for your personal tutoring philosophy and style to ensure you would suit the position.", "Interview Questions": "How would you approach a resistant student?"}, {"date": "8 Feb 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Missouri Western State University (Saint Joseph, MO) in Nov 2014", "Interview Descriptions": "Interview Day.  Met with Chair of the department, then search committee for presentation and interview questions, then to meet the provost. Chair took me out to lunch. Was an all day affair.", "Interview Questions": "How do you include standards in your curriculum.  Background."}, {"date": "29 Nov 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Missouri Western State University (Saint Joseph, MO) in May 2014", "Interview Descriptions": "I walked into the office and was greated by the Administrative Assistant. She was very easygoing, helpful, and made me feel at ease. There were two people who interviewed me and they were both easy to talk to. The questions were specific to the job, but they had buffer questions to make me feel more comfortable. Overall, it was a great experience and it was a great company to work for.", "Interview Questions": "What qualifies you for this position?"}, {"date": "28 Dec 2015", "title": "Intensive English Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Missouri Western State University (Saint Joseph, MO) in May 2014", "Interview Descriptions": "I applied on line and the next week the Assistant Dean called me and gave me a 10 minuet interview and hired me on the spot.  The interview was unprofessional and was far too short.  The questions asked had very little relevance in relation to the job.", "Interview Questions": "Have you ever worked with international students before?"}]]