[[{"date": "5 Apr 2019", "title": "Group Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sports & Arts In Schools Foundation (New York, NY) in Apr 2019", "Interview Descriptions": "On April 1st, 2019, I was contacted via e-mail to attend an interview for a part-time position (Group Leader). Just 72 hours later, on April 4th, I reported to the SASF Headquarters to be interviewed by Ms. Stowe. At the conclusion of the interview, I was told that I am being considered for the position and will receive correspondence from an afterschool director at a site where a vacancy exists. Note that you are permitted to pick your top 2 borough preferences. Additionally, I was told that I must pass a background check, clear a fingerprint screening, and return a negative finding of tuberculosis obtained by means of blood sampling.", "Interview Questions": "Do you possess relevant experience working with children in an educational setting?"}, {"date": "10 Oct 2017", "title": "Tutor/Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sports & Arts In Schools Foundation (New York, NY)", "Interview Descriptions": "It wasn't extensive like Apple. They try to find your interest in their company. And they ask about your interest in children and your experience in children. It really can vary who interviews you as the Director of the potential site of over 100 sites can be the interviewer.", "Interview Questions": "Where do you see yourself in 5 years? How do you see yourself helping the children reach their full potential?"}, {"date": "19 Jul 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Sports & Arts In Schools Foundation", "Interview Descriptions": "The interview process is misleading and unorganized. They talk about the company and your role like it is one way but once you get there u realize how disorganized they are", "Interview Questions": "N/A"}, {"date": "13 Jul 2016", "title": "Tutor/Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sports & Arts In Schools Foundation", "Interview Descriptions": "I worked in the same company as the person who hired me, who wasn't the manager. I feel that may of contributed to why i got the job despite not having worked with children before. My manager was surprised by me not having worked with children before", "Interview Questions": "N/A"}, {"date": "7 Nov 2016", "title": "Activity Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Sports & Arts In Schools Foundation (Queens Lake, VA) in Jul 2016", "Interview Descriptions": "The staff was very courteous and polite they remained professional. They asked questions pertaining to my history and were able to apply them to real time situations. They raised my interest by asking questions pertaining to my resume. They were able to match all of my high expectations.", "Interview Questions": "how well did I understand the need to be able to adapt to your environment"}, {"date": "14 Apr 2017", "title": "Dance Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Sports & Arts In Schools Foundation (Jamaica, NY) in Jan 2016", "Interview Descriptions": "The hiring process was simple. They asked a few questions about why I want to work with kids, and then I had to fill out lengthy paper work and get fingerprints done. The process was timed and it took about 7 days.", "Interview Questions": "Why do you want to work with kids?"}, {"date": "3 Nov 2016", "title": "After School Program Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sports & Arts In Schools Foundation (New York, NY) in Aug 2015", "Interview Descriptions": "The process was very unorganized and impersonal. The interviewers did not have all their materials ready and were not prepared. The company should seek out PD opportunities for staff who will be interviewing. The office space was also very messy. Their answers to questions (such as site placement if hired) was very vague. I've heard unpleasant things about the organization, and still decided to go ahead an interview with them but this was a complete waste of my time, I'm glad I did not receive an offer as I probably would have turned it down because of the messy interview process.", "Interview Questions": "How have you increased enrollment among students?"}, {"date": "3 Nov 2016", "title": "After School Program Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sports & Arts In Schools Foundation (New York, NY) in Jul 2015", "Interview Descriptions": "I interviewed for a position with SASF in the summer (July-August) of 2015. I applied for an after school program director role. I came to them with 4 years of experience in that very same role at a different organization. I interviewed 3 times with their team, and at the end, did not hear back on my status. It left me with a bad impression on the organization as they seemed so eager (seemed a bit desperate too) to get me in for interviews and they showed such enthusiasm at the prospect of me joining the organization. At one point, in between my 2nd and 3rd interview, they asked if I would like to be considered for a program manager role (a level above the program director role) and I said yes and would like to be considered for both roles and hope they picked me for the right role, given my experience and skill set. After 3 rounds of interviews, they went quiet. No email or phone call regarding the status of my application. Extremely unprofessional and distasteful.", "Interview Questions": "How have you collaborated with other partner organizations or with your host (location) school?"}, {"date": "8 Jan 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Sports & Arts In Schools Foundation", "Interview Descriptions": "Very easy. It was a group \"interview\". Pretty much everyone who showed up on that cold Saturday morning got the job. They held the interview at a high school cafeteria in Brooklyn. There wasn't even a formal interview or prospective employee screening. They just afforded us instructions on how to perform out jobs. I was young and I needed any money I could get. So I took the job.", "Interview Questions": "\"Will you be able to work weekends?\""}, {"date": "24 Sept 2015", "title": "Audio Production Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sports & Arts In Schools Foundation (New York, NY) in Sept 2014", "Interview Descriptions": "The interview process was very straightforward. You interview with one of the directors at their headquarters, you get asked a series of questions pertaining to your field, and then they send out your resume to different schools. Then which ever school wants to hire you, they will invite you for an interview with the Site Director of that school.", "Interview Questions": "What experience you do have playing instruments?"}], [{"date": "26 Mar 2016", "title": "Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Sports & Arts In Schools Foundation (Bronx, NY) in Jun 2012", "Interview Descriptions": "Was very laid back, it was at the site level so it was only with the person who would be my direct supervisor. Salary was discussed after the background check was completed, this is a required process", "Interview Questions": "Q: What was one thing that they asked you? what is your data experience"}]]