[[{"date": "12 Jun 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "Email followed by zoom meeting. Generalized questions making sure I was competent enough to complete job tasks and duties. Some behavioral and personality questions peppered in as well. Overall easy.", "Interview Questions": "Describe a time when you dealt with conflict in the workplace."}, {"date": "12 Jun 2023", "title": "Team Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baylor University (Brooklyn Heights)", "Interview Descriptions": "Great interview process. Amazing people that set it up. Would like to interview again. Hopefully I can work for this company in the future. Organization is phenomenal and communication is superb.", "Interview Questions": "What is your preferred salary?"}, {"date": "17 May 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University (Waco, TX)", "Interview Descriptions": "The zoom interview was very professional and cordial. I was not short listed after the interview so I can not speak to the onsite process. The committee included nonfaculty which was unusual. The chair was extremely helpful and let me, on inquiry, that I was not moving on prior to the completion of the search. I reached out because I was considering other positions.", "Interview Questions": "Normal. Asked about my past experience and specific academic and work experience related to the position."}, {"date": "22 Jun 2023", "title": "Social Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Baylor University (Waco, TX) in May 2023", "Interview Descriptions": "There was an initial HR call, a Zoom interview, and a final in-person interview on campus. They flew me out and it was great to speak various people throughout the day, followed by a campus tour. Everyone was very understanding and kind throughout the whole process!", "Interview Questions": "What do you like about the Baylor brand?"}, {"date": "30 Mar 2023", "title": "N A Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baylor University (Waco, TX)", "Interview Descriptions": "Great interview went as expected and They dont ask you a lot of questions but they do go fast through the whole process and hire extremely quickly, the job I took is in athletics and i believe they have a big tunrover rate within that department", "Interview Questions": "what are your strength and weaknesses"}, {"date": "21 Feb 2023", "title": "Working Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "I applied to the school a while ago and got in to the school. Very mundane process like every other school. I know attend here at Baylor University, very cool.", "Interview Questions": "Why do you want to come here"}, {"date": "12 Sept 2022", "title": "Admissions Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "Seemed pretty standard, I thought that the interview went well and the person I interviewed with was very nice. They called me over the phone to schedule an interview the following day. It lasted about 30 to 45 min. ", "Interview Questions": "What are some goals you would like to accomplish in the first 3 months? "}, {"date": "23 Aug 2022", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Baylor University (Waco, TX)", "Interview Descriptions": "Pretty standard, seemed very personal while keeping the process professional. HR was never present, and never informed me if I was accepted or not. I actually turned down two job offers while waiting. Tried following up multiple times. Terrible experience.", "Interview Questions": "Tell us a little about yourself."}, {"date": "4 Jan 2023", "title": "Business Development Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Aug 2022", "Interview Descriptions": "Initial Interview then a follow up interview. They ask for your testimony. Fairly easy interview process with straight forward questions. I received the offer. Months late, I do not recommend working with these people.", "Interview Questions": "Testimony, How I would grow their specific events, what topics I would cover in a on-campus camp. How do you track and manage data."}, {"date": "20 Jan 2022", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "Very unorganized with a lot of last minute, conflicting communication. Was asked to interview for a final round with less than 15 hours’ notice. Told to expect a video link, but never received one. Had to access department website to find a phone number to call the hiring manager and ensure that the interview was happening. Discovered that I was late for the interview because I was given the wrong time.", "Interview Questions": "3 stage interview process with a screening from HR, and two video interviews with various team members"}], [{"date": "29 Aug 2021", "title": "Community Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "Thorough interview process. Involved initial intake, group interview, semester course, and final evaluation/placement interview. If you have a passion for the work and understand general professionalism, you will have no problem conversing with staff about the position.", "Interview Questions": "What is one program that you would like to implement to better build community in this specific building?"}, {"date": "27 Sept 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Baylor University in Aug 2021", "Interview Descriptions": "I applied online and heard back from HR after I called to express my interest in the position three weeks later. I was told about the wonderful benefits package, the great opportunities, and the Christian atmosphere. At that point, I was then told I had made it into the panel interview round via zoom. I was interviewed by four lovely people who were a mix of employees of different statuses. I felt like the interview went well and I proceeded to follow the interview up with personal notes of gratitude. Since then, I’ve heard absolutely nothing from anyone. I’ve emailed my recruiter with HR to follow up, called and left two voicemails and continued to wait patiently. After 1.5 months of waiting, one has to assume they’ve moved on with a different candidate. Which is great. All of us were praying collectively for someone to fill the role and I want the right person to be hired regardless if it’s me.\n\nI think I’m disappointed by the wasted opportunity to finish well. Baylor had a choice to let those of us know we weren’t the best candidate in a loving, kind and truthful way. Yet they, for maybe a really good reason (covid, short staffed, ?),chose not to. My hope is this review will encourage Baylor to choose to do better and be better.", "Interview Questions": "Why do you want to work at Baylor?"}, {"date": "2 Jun 2021", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "Meet with professor, met with lab team on two interviews. We discussed projects and how to coordinate with each other. After discussing how we matched together we were allowed in lab.", "Interview Questions": "Tell us about yourself?\r\nHow did you like Neuroscience?"}, {"date": "25 Feb 2021", "title": "Research Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "answer few questions from professor, such as some questions in his research field and how would I contribute to his research, and other questions such as if I am familiar with some coding techniques. not difficult if you have prepared thoroughly.", "Interview Questions": "What coding language do you usually use?"}, {"date": "10 Feb 2021", "title": "Financial Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "Quite a lengthy one- first is a phone interview, it didn't take as long. Secondly there was an interview with the head of the department and a handful of associates from related departments who asked varied questions related to experience, and wanted examples of qualities they were looking for (e.g. good communication skillls)", "Interview Questions": "\"Talk about a situation where you had to break down a complex situation and how you dealt with it.\""}, {"date": "20 Feb 2021", "title": "University Ambassador Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Jan 2021", "Interview Descriptions": "I filled out an application and they called me for a follow up interview. They never got back to me, probably because they are not hiring, but did not know about that at the time of the interview.", "Interview Questions": "How do you keep yourself organized?"}, {"date": "10 Dec 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "I applied and got the interview. They asked how I would handle different situations. Then I answered them honestly and before I finished she already told me that I was going to be hired and this was just a formality.", "Interview Questions": "What do you think occurs in this job?"}, {"date": "10 Oct 2020", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baylor University", "Interview Descriptions": "Short but good. The interview was online. It was for an administrative position.  The administrative position was full time and it is an excellent university.  It is a conservative school.", "Interview Questions": "Tell me about your self"}, {"date": "7 Oct 2020", "title": "Student Athlete Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "Very easy going, casual, maybe 15 minutes long, basic questions about my grades, asked how many hours I could work per week, wanted to know basic tutoring strategies I would have, showed me around the work area, informed me on basic expectations", "Interview Questions": "How comfortable I am with teaching certain subjects "}, {"date": "28 May 2022", "title": "Community Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 7 months. I interviewed at Baylor University in Oct 2020", "Interview Descriptions": "The interview process is very long. First you apply online in the fall. Then you get a group interview. Then a one- on- one interview. Then you are selected for a Leadership course. You must make a B or higher on the course in the spring. Then you get interviewed by some hall directors. Finally you might get selected for the role. If you don't get selected you could become an alternate or denied all together. The alternate list gets used up every year so don't fret. The denied did a bad job in the class.", "Interview Questions": "How would you approach a facilities issue situation?"}], [{"date": "15 Aug 2022", "title": "Assistant Director of Communications Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University in Sept 2020", "Interview Descriptions": "One short interview, not especially difficult. Mostly asking why I wanted the job and how I would handle different situations in the job. I was offered the job shortly afterward", "Interview Questions": "If you could be an animal, what animal would you be?"}, {"date": "28 Apr 2021", "title": "Financial Aid Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Jun 2020", "Interview Descriptions": "The interview process was LONG, well over two months and requiring a presentation to the committee.  The last communication was that an offer was forthcoming and then NOTHING.  Completely ghosted.  It was a disappointing display of a lack of courtesy and integrity from an organization that pays a lot of apparent lip service to Christian values.  I believe it's completely justified to demand a lot out of prospective candidates and it's understandable that circumstances can change; however, if an organization does that then they could at least provide feedback and information and not just stop the process cold.", "Interview Questions": "How would you handle a difficult situation that was not necessarily your doing?"}, {"date": "6 Apr 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Baylor University in Mar 2020", "Interview Descriptions": "1. phone interview --What would you do if exams and work shift schedules were arranged simultaneously? -- The pay starts at $8.75, will you accept it? 2. get the offer 3. go to work", "Interview Questions": "What would you do if exams and work shift schedules arrange at the same time?"}, {"date": "10 Jul 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baylor University (Waco, TX) in Jan 2020", "Interview Descriptions": "Students and staff were in the interview. They took rounds asking different questions. Some were about your experience at Baylor as a student and others were general questions about work experience, why you want to join, etc.", "Interview Questions": "What is your favorite part about the Baylor community?"}, {"date": "11 Dec 2019", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baylor University", "Interview Descriptions": "I applied early Oct. and received a call shortly after from HR to review benefits and salary requirements. The following week I received an email for phone interview with the dept. After the phone interview I heard nothing for about a week, I emailed HR and he said the decision was not made yet. Then a day or so later I received a request for Skype interview. After the Skype interview I heard nothing else, the system still shows me in an \"interview selected\" status. After about 2 weeks I email the HR gentleman to get status and have not heard back. It has been 2 weeks since I sent that email, so I have no choice but to assume that I did not get selected to move forward to the third round of interviews.\r\n\r\n I think that it is very  unprofessional for someone to ignore emails in the workplace. Especially when it would only take one minute to type, \"thank you for your time but the hiring committee  decided to move forward with other candidates \".  During both of my interviews I was asked how does my faith/religion affect my day to day work, I would like to ask that of the person who received my email and CHOOSE not to respond. This situation has placed a huge cloud over what could have been a decent interviewing process. The panel that interviewed me was professional and nice, the individual who has not responded was very professional the first time I spoke with him and during our email interchange between the first and second interview. But I guess if you are not on the list for the next round of interviews you don't get that same respect, and that's quite unfortunate.", "Interview Questions": "How does your faith affect your every day work?\r\n"}, {"date": "18 Nov 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Baylor University", "Interview Descriptions": "Phone interview. Simple and straight forward. It was a phone interview and they were looking to hire students for the front desk job. It was a great experience and the people could not have been nicer.", "Interview Questions": "What is your greatest weakness?"}, {"date": "27 Nov 2019", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baylor University in Nov 2019", "Interview Descriptions": "After being contacted by HR and invited to a Skype style meeting, they could not get their technology to work properly and after 10-15 minutes of fumbling, we eventually had a phone screening, which felt awkward given the circumstances. I appreciated the time, but I was cut short as they \"Had other interviews to conduct\". I don't feel like I had a fair shot, and it felt very much like a courtesy call. I did send some follow-up questions to the executive director as requested, but did not hear back from him.", "Interview Questions": "How do I handle conflict?"}, {"date": "5 Oct 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Baylor University (Waco, TX) in Jan 2019", "Interview Descriptions": "Received an email, came into the business school, and there were two women interviewing me. It took around 20 minutes. Then I received an email not too long after about the position.", "Interview Questions": "How I would manage students and other professors when they needed help?"}, {"date": "28 Oct 2021", "title": "PR and Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Baylor University (Waco, TX) in Dec 2018", "Interview Descriptions": "Baylor University's Missions Department has a great interview process for interns! There was one interview process to receive the internship role. The position provides great hands-on experience for students pursuing real-world exposure to PR and marketing in a college or university setting.", "Interview Questions": "What do you want to work with the Missions Department specifically? "}, {"date": "10 Oct 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Baylor University", "Interview Descriptions": "I was sent an invitation by a professor to apply to be a student athlete tutor. I sent the hiring manager my resume, and I also filled out an application form. I was called in for an interview at her office.", "Interview Questions": "How much experience do you have teaching others?"}], [{"date": "21 Nov 2019", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baylor University in Sept 2018", "Interview Descriptions": "The application is intensive and descriptive, and it took me about 30 minutes to complete. They ask for a completed application, resume, cover letter, and at least three references. The university also asks about your faith.", "Interview Questions": "How does your faith influence your work?"}, {"date": "1 Aug 2018", "title": "Undergrad Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "I reached out to my engineering professor who was conducting research for the University. The professor knew I was a good student with a strong work ethic and was happy to offer me a position doing research work for him.", "Interview Questions": "Are you interested in nondestructive evaluation of carbon fiber laminates? "}, {"date": "23 Jan 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Baylor University (Waco, TX) in Aug 2018", "Interview Descriptions": "Spoke with the Office Manager on the phone. She asked me if I had worked as a student worker before and why I wanted to work in the specific office I applied for. My GPA was checked and that was about it.", "Interview Questions": "What is Your GPA"}, {"date": "13 Mar 2019", "title": "Employee Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baylor University (Waco, TX) in May 2018", "Interview Descriptions": "The interview was very brief. I was asked questions about what my skills were to determine if I could do the job. It seemed a little too \"demanding\" for the work that was done.", "Interview Questions": "Past leadership examples"}, {"date": "16 Mar 2018", "title": "Office Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Baylor University", "Interview Descriptions": "It was fun and easy, the supervisor is nice and helpful, willing to adjust interview time. You will get the job for sure as long as you can fit the available hours required.", "Interview Questions": "Your available time during the week"}, {"date": "28 May 2019", "title": "Student Athlete Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Baylor University (Waco, TX) in Jan 2018", "Interview Descriptions": "Basically a conversation about what subject you want to tutor as well as your own strengths and weaknesses regarding tutoring.  There is also a lot of paperwork involved and a meeting.", "Interview Questions": "What would be something difficult to deal with in a student and how would you deal with it?"}, {"date": "27 Jan 2020", "title": "ITS Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baylor University (Waco, TX) in Jan 2018", "Interview Descriptions": "The interview process was very casual, consisting of mostly conversation about the nature of the job as well as the interviewees prior experiences with similar work. The conversation was roughly about 30 minutes long, and I met two staff members in the office and went on an office tour.", "Interview Questions": "Would you be comfortable driving the ITS shuttle around to campus locations?"}, {"date": "13 Nov 2017", "title": "Ph D Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University", "Interview Descriptions": "A phone call, although my process differed from what normally happens. I believe the normal interview process brings students in and conducts an in-person interview with numerous professors from the department.", "Interview Questions": "Why do you want to work here"}, {"date": "15 Nov 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baylor University (Waco, TX) in Nov 2017", "Interview Descriptions": "The interview process was thorough it was not lengthy it did not take a long time it was clear cut and to the point and it was great. I loved it.", "Interview Questions": "What is your greatest strength and weakness "}, {"date": "31 Dec 2017", "title": "Senior Coordinator of Waco Hall Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baylor University (Waco, TX) in Oct 2017", "Interview Descriptions": "I applied through the Baylor University website. I got an email about a month later asking to set up a webcam interview. The interview took about 30 minutes, and was talking with about 10 different people. About a month and a half after the interview, I got invited for a campus interview, where I met with different groups of people (it was an all day event).", "Interview Questions": "Name a difficult situation you had no control over."}], [{"date": "15 Sept 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Baylor University", "Interview Descriptions": "Basically I talked to the professor I am interested directly, and I had a phone interview and then a on site interview. Talked about my previous research. And asked whether I understood numerical modeling on electromagnetic problems", "Interview Questions": "Could you use the software FDTD?"}, {"date": "9 Sept 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University", "Interview Descriptions": "Normal questions were asked. Nothing out of the ordinary. I was interviewed by the head of the program and the interview was very easy. I was called back the next day for the internship", "Interview Questions": "Why do you want to be an intern? If \"x\" happens what would you do?"}, {"date": "5 Sept 2017", "title": "GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "They are incredibly kind. I did not know what to expect but the interview process went relatively well. Everyone is incredibly nice in the office. The interview was face to face and I was excited to work here.", "Interview Questions": "What is my experience in clerical work?"}, {"date": "5 Feb 2018", "title": "Accommodation Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baylor University (Waco, TX) in Sept 2017", "Interview Descriptions": "The first interview was over the phone with a hiring personnel from HR. The 2nd round interview consisted of a video interview because I was out of town. The 3rd round interview was in person over a light breakfast, with a committee first, a meeting with the boss's boss, and a tour of the department. I really enjoyed interviewing with this team, unfortunately I was not offered the position.", "Interview Questions": "What types of accommodations would you give someone who has ADHD?"}, {"date": "9 Aug 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Aug 2017", "Interview Descriptions": "It was a stressful interview.  It almost seemed like they wanted to trip me up, rather than actually see what I have to offer.  It really made me wonder if working there was going to always be stressful.", "Interview Questions": "How would you implement budget cuts?"}, {"date": "25 Jun 2021", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University in May 2017", "Interview Descriptions": "Easy not difficult at all. The interview lasted for about 30 minutes to an hour. I answered to the best of my ability. I was ask what qualities will I bring to this position.", "Interview Questions": "What are your strengths and weakness"}, {"date": "26 Sept 2017", "title": "IT Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Baylor University in Apr 2017", "Interview Descriptions": "The entire process itself was very casual. They made me feel very comfortable before the beginning to ensure I did my best. The whole point of the interview was to gauge my work commitment and my ability to keep looking for a solution.", "Interview Questions": "It was a Linux command question regarding setting permission flags on a file."}, {"date": "21 Sept 2018", "title": "Telecounselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Feb 2017", "Interview Descriptions": "A phone interview followed by a in person interview . The process was pretty straightforward. They were looking for positive students who liked Baylor.  The process was pretty straightforward", "Interview Questions": "They asked about my experience at Baylor"}, {"date": "13 Feb 2017", "title": "Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University in Feb 2017", "Interview Descriptions": "Very nice conversation like interview questions.  They inquired about how I responded in certain situations and I answered.  They were inquisitive about my knowledge in certain areas so I elaborated on key points.", "Interview Questions": "How I would handle a move with my family?"}, {"date": "24 Jan 2019", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Jan 2017", "Interview Descriptions": "It  was pretty easy and starightforward   and not too technical. One had to just meet the professors requirements which were  ability to research and also  finish tasks on time", "Interview Questions": "What technical abilities do you have?"}], [{"date": "18 May 2020", "title": "GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baylor University (Waco, TX) in Jan 2017", "Interview Descriptions": "There wasn't really a formal interview, I had mentioned I was interested in the position the semester prior, but there were no jobs available at the time. I was contacted by the department the following semester and asked if I was still interested in a position. I had the requisite grades and GPA for the job.", "Interview Questions": "Do you have the right GPA for the intended position?"}, {"date": "12 Dec 2016", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baylor University (Waco, TX) in Nov 2016", "Interview Descriptions": "I had an initial phone interview with two people. The next day I was asked in for a second interview. My second interview had three people and quite a variety of questions. A week later I was asked back for a third interview. For the third interview, I gave a slideshow presentation in a room of about 20 people. I was interviewed by the marketing department, the IT department and the department managers. I went to lunch with three of the people who interviewed me and then took a campus tour with student tour guides. A day after my interview, I got a request for a background and reference check. Once all of my references had been contacted, I received a phone call with an offer.", "Interview Questions": "What computer programs do you use regularly?"}, {"date": "12 Oct 2017", "title": "Assistant Director of Donor Engagement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baylor University (Waco, TX) in Sept 2016", "Interview Descriptions": "I applied online and after a few weeks received a screening call from a recruiter. I then had a phone interview with the manager over the position. After that call I received an email asking me to come in for a panel interview. During this interview I had two panel interviews, the first with the team I would be working with and the second with the search committee in charge of hiring for this position. The last interview I had with Baylor was another phone interview with the Assistant Vice President.", "Interview Questions": "Tell us about your experience in putting together events."}, {"date": "16 Feb 2017", "title": "International Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baylor University (Waco, TX) in Jun 2016", "Interview Descriptions": "It's long and tedious. There are three rounds - phone, Skype and actual interview with a presentation. Don't waste your time applying here if you are not white - very little diversity on this campus, and this department so if you are a person that needs a diverse group of people to be around, you might want to consider another place.", "Interview Questions": "Are you okay with traveling for 6 weeks?"}, {"date": "26 Aug 2016", "title": "Vets Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Baylor University (Waco, TX) in Jun 2016", "Interview Descriptions": "The process was to get everything filled out online and then to wait. There was an extremely long wait with no update,  There was not any interaction with any department and just a committee.  The length of time before notification seemed a little disingenuous but I guess that is the University process.  There was a e-mail and a phone call and then it was done.", "Interview Questions": "Are you a veteran?"}, {"date": "26 Jun 2016", "title": "Student Telecounselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baylor University (Sherman, TX) in May 2016", "Interview Descriptions": "I was asked to send in a cover letter and resume, and eventually I got a call back to do a phone interview. Lastly, I video chatted instead of an in-person interview and was offered the job afterward.", "Interview Questions": "Can you tell us a time where you succeeded at something?"}, {"date": "8 Mar 2017", "title": "Visit Experience Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Baylor University (Waco, TX) in Mar 2016", "Interview Descriptions": "Very personal and hypothetical. One on one interview with the bosses and wanted to get to know me as a person and also wanted to see how I get along with people", "Interview Questions": "If a mother came in very mad about a rescheduled tour, how would you handle it"}, {"date": "31 May 2016", "title": "Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baylor University (Waco, TX) in Mar 2016", "Interview Descriptions": "I applied for the position via the university's online application center.  Several weeks later I received a phone call from the human resources department to schedule an interview.  A week later I met with the department head and assistant department head for an interview.  It's been 2 1/2 months I still haven't heard anything. At this point, I assume they have filled the position.", "Interview Questions": "Why do you want this position? Tell me about your work history. Are you comfortable with reading and creating financial reports? Have you ever directly supervised anyone? What church are you a member of? "}, {"date": "10 Feb 2017", "title": "Campus Visit Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Baylor University (Waco, TX) in Mar 2016", "Interview Descriptions": "Multiple interviews:\r\n-Group: First round of interviews\r\n-individual: final round of interviews\r\n-intensive training: includes three parts that lasted roughly two to three months\r\n\r\nOverall a very simple interview process, just know the basics about Baylor and why you feel you should represent the university to potential students.", "Interview Questions": "When was Baylor founded?"}, {"date": "13 Apr 2018", "title": "Financial Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baylor University (Waco, TX) in Nov 2015", "Interview Descriptions": "The hiring process took a total of two weeks.  I was contacted by the talent acquisition specialist who set up an interview for me to come to campus and interview.", "Interview Questions": "Behavioral questions that centered around hierarchy.  What order would your process the following requests?"}], [{"date": "22 Sept 2015", "title": "Telecounselor--Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Baylor University", "Interview Descriptions": "The interview process was brief and laid back.  I had an enjoyable, professional experience with the Admissions Office.  The hiring team is warm and friendly and made me feel very comfortable", "Interview Questions": "What activities are you involved in on-capus"}, {"date": "4 Sept 2015", "title": "Mail Center Stocker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Baylor University (Waco, TX)", "Interview Descriptions": "I was hired through someone I knew so I did not have an interview. It's a chill atmosphere but can be really busy and fast paced at times. From the interviews I have seen, the manager there ask behavioral type questions. As long as your schedule fits you should be okay.", "Interview Questions": "n/a"}, {"date": "10 Nov 2015", "title": "Student Photographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Baylor University in Aug 2015", "Interview Descriptions": "They had me come in and just asked me generic questions. They then showed me a video they produced and they asked me what I liked and didn't like about it.", "Interview Questions": "What would you change about this video?"}, {"date": "31 Mar 2016", "title": "Teaching Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Baylor University (Louisville, KY) in Jul 2015", "Interview Descriptions": "very positive.  Looked at the schools web site and it helped me prepare for the interview, including the questions that they were asked and it helped me frame my answers.  I did not use Glassdoor b/c I did not know about the service at that time.", "Interview Questions": "Why do you want to work here?"}, {"date": "13 Sept 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Baylor University (Waco, TX) in May 2015", "Interview Descriptions": "Panel of 5 people, was pretty intimidating. Went over work history, my spiritual stance, how I would deal with conflict resolution among my team. But overall everyone was super nice, as they always are in every department. But it was clear that everyone in Waco...and 50 miles in every direction, desperately wants a job at Baylor, so they are very picky about who they let in the door.", "Interview Questions": "How does your faith guide you in your professional life?"}, {"date": "6 Mar 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Baylor University (Waco, TX) in Apr 2015", "Interview Descriptions": "There were two interviews. The first was with a committee of folks who worked in the office. The next was with the Director I would be working with most directly.", "Interview Questions": "Tell me a time when you experienced conflict."}, {"date": "5 May 2018", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Feb 2015", "Interview Descriptions": "last 2 days, research lecture, meet the chair, the dean,\r\nand asked religious questions, the interviewers are friendly and try to help you in most cases, especially the chair helps you a lot when he finds you are in an uncomfortable situation", "Interview Questions": "how did you become a Christian?"}, {"date": "22 Jan 2015", "title": "GA Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Baylor University", "Interview Descriptions": "1 calls about your interest and need for the position. Then I submitted my resume and cover letter... 2 weeks later, boom! There was not too much to really prepare for, I had the fortune of previously meeting the individual in charge of hiring.", "Interview Questions": "None really"}, {"date": "5 Apr 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Baylor University (Waco, TX) in Jan 2015", "Interview Descriptions": "Emailed the professor to see if there were any positions open. She confirmed that there were. She told me about the project and I started doing research. Professor previously knew me.", "Interview Questions": "What is your experience in the specific study area? Can you commit to 20 hours/week?"}, {"date": "27 May 2019", "title": "Budget Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baylor University (Waco, TX) in Jan 2015", "Interview Descriptions": "A phone interview (with multiple participants) followed by half day process involving interviews with representatives from multiple departments, along with lengthy panel discussion with several department members. Each person had a pre-selected list of questions.", "Interview Questions": "Tell about a time when you solved a problem"}], [{"date": "1 Jun 2016", "title": "Audio Visual Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Baylor University (Waco, TX) in Jan 2015", "Interview Descriptions": "Took about a week. Straight Forward, Ask me about various equipment, They had some equipment for me to operate to prove I knew what to do. They also asked if I had a driver license which was important for the job", "Interview Questions": "Can you work on weekends?"}, {"date": "29 Dec 2014", "title": "Student Photographer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Baylor University", "Interview Descriptions": "The hiring process was simple. I saw one of the two main officials in charge or marketing and communication (photography division) on campus and got his card to let him know i was interested. I followed up with an email about 1 month later about an interview. The interview was only me bringing in a couple of pictures I had taken previously for them to look at.", "Interview Questions": "There were no difficult questions, just honest questions to get to know me better"}, {"date": "7 Mar 2016", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baylor University (Waco, TX) in Oct 2014", "Interview Descriptions": "Each Department is different. For my area, the first interview is a Skype interview. If you make the cut, you are brought in to speak with the Executive Director, and then the Director, followed by a panel interview of 10-15 people. A times a presentation has been required, depending on the job.", "Interview Questions": "Tell me about yourself, Tell me about a time that you failed, What will your priorities be in your first 30 days?, Tell me about a time that you went above the call of duty."}, {"date": "10 May 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Baylor University (Waco, TX) in Oct 2014", "Interview Descriptions": "I was first interviewed in-person at a conference. A 2-day follow-up interview was then done at the campus. During this time, there are various faculty meetings, a presentation to a group, and meetings with different administrators in the college and university. Each individual meeting lasts about one hour and is quite unique depending on the interests of the one doing the interviewing.", "Interview Questions": "What is your opinion on whether marketing promotes or undermines social good?"}, {"date": "23 Apr 2015", "title": "Usher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Baylor University (Waco, TX) in Oct 2014", "Interview Descriptions": "Basically I was called in, asked about my experience (I had had not previous job experience), and was hired on the spot. I believe the most important thing you can express is that you are willing to learn and comfortable dealing with people", "Interview Questions": "Pervious work experiences\r\nAre you comfortable when dealing with people"}, {"date": "20 Jun 2016", "title": "Community Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 8 months. I interviewed at Baylor University (Waco, TX) in Sept 2014", "Interview Descriptions": "The interview lasts for two whole semesters.\r\nFall: You go in for a short interview with two hall directors at some point in the middle of the first semester. If you pass, you are invited to the group interview, in which you will demonstrate how you would perform in the actual role (this part requires a lot of thinking on your feet).\r\nIf you pass the group interview, you are invited to take a leadership class for the spring semester (which is necessary to get the job). If you accept, you must sign a contract agreeing to live on campus for the next academic year, regardless of whether or not you are extended an offer.\r\nSpring: Take the class, read the material, and discuss it in a small group setting (typically lead by a hall director and a higher level CLL staff member). Submit preferences for which 4 residence halls you would most like to work with. Interview with 3 of them. The Hall Directors will then negotiate who goes where. Offers were extended around mid April.", "Interview Questions": "What are your 5 strengths on Strengthsquest? How would you see them at play in this role?"}, {"date": "19 Aug 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "You should have high GRE and Toefl. You have to pass qualification exam! You have chance to Talk and meet with faculty in baylor. You also have three oral exam during the phd process.", "Interview Questions": "you have to pass qualification exam!"}, {"date": "28 Jul 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baylor University (Waco, TX) in Jul 2014", "Interview Descriptions": "They are very easy going and want to assist you in your endeavor through school but still expect the most out of you. They email back and forth with you and then they call you in for an interview and it ultimately is more like a conversation to see if you're interested and if you have the personality to fit in the office and you're wiling to do the job. Everyone is really really kind.", "Interview Questions": "What jobs have prepared you for this one in the past?"}, {"date": "20 Jul 2016", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Baylor University (Waco, TX) in May 2014", "Interview Descriptions": "They had already talked to me before I applied so the interview was more of a follow up. They asked me about my personality and how I would respond to certain athletes.", "Interview Questions": "What makes you qualified for this position"}, {"date": "12 Nov 2015", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Baylor University (Waco, TX) in Feb 2014", "Interview Descriptions": "The interview process for my specific position was extensive and included a significant vetting process.  The first interview included an office staff member and human resources member.  The second interview involved numerous members of the office staff.  A third interview incorporated my direct supervisor and was only after a significant period of waiting.  Overall, the process was pleasant and everyone was very helpful.", "Interview Questions": "Tell us about a time you faced a problem in your career.  How did you address the problem?"}], [{"date": "13 Jan 2017", "title": "FTPBA Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 7 months. I interviewed at Baylor University (Waco, TX) in Jan 2014", "Interview Descriptions": "One initial phone interview, plus 2 Days of back to back departmental interviews, in addition to a classroom lecture, a research presentation, and a final interview with the Provost, Dean and Department Chair.", "Interview Questions": "Please describe your faith experience and background. "}, {"date": "17 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Baylor University in Aug 2013", "Interview Descriptions": "Applied online through the school employment website. Submitted resume, work history, student information and such. Very short application compared to other jobs i have applied for. Interviewed within a week with the manager of the department.", "Interview Questions": "Technical problems. How would I solve them."}, {"date": "22 Jun 2013", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Baylor University (Waco, TX) in May 2013", "Interview Descriptions": "I applied as a recommendation from a connection through the school.  I applied and heard back for an interview within 2 weeks.  I drove to Waco to conduct my primary interview.  Overall, it was a typical interview with relatively standard questions.  I didn't find anything tricky, unusual, or difficult.", "Interview Questions": "Are you willing to take this job, if offered, if it doesn't pay more than your current employeer?"}, {"date": "23 Apr 2013", "title": "Manager Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Baylor University", "Interview Descriptions": "just go to the office and ask for availability status for the position and then got a 5-mins chat interview.", "Interview Questions": "not at all"}, {"date": "8 Feb 2013", "title": "IT Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Baylor University", "Interview Descriptions": "Interviewed by a panel.  Not very technical.  Questions were vague.  They were very knowledgeable about their system and not much outside of it.   Actually asked \"since you have a been exposed to newer technology, will it be an issue if you did not get that exposure in this job?\"  Overall, meh but worth the experience.  Thanks.", "Interview Questions": "Explain to us, in layman's terms, what half of the things on your resume are?  "}, {"date": "23 Nov 2015", "title": "Line Camp Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at Baylor University (Waco, TX) in Nov 2012", "Interview Descriptions": "There was a group interview process as well as an individual interview. The group interview process included 20-25 other potential Line Camp leaders. Activities included team-work exercises, problem solving, and real-life camp leader scenarios. The individual interview was easier for me, but was a one-one-one setting that asked pretty basic questions.", "Interview Questions": "What made you want to be a Line Camp Leader?"}, {"date": "20 Aug 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Baylor University (Waco, TX) in Feb 2012", "Interview Descriptions": "I was flown to Baylor and met up with the other candidates.  I stayed with other grad students.  There were many informative and fun events that weekend, and I had a good time.  My interview was brief and was mostly about my writing sample.", "Interview Questions": "If you could ask God one question, what would it be?"}, {"date": "12 Apr 2016", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Baylor University in Jan 2012", "Interview Descriptions": "It was really easy and nice. The graduate director just asked me whether I want to come. I said yes.\r\nI think before he called me, he already made the decision to accept me. My background is related to my current adviser's research, I think my adviser named me to be his student that's why the interview is very easy.", "Interview Questions": "Whether I want to come and accept the scholarship."}, {"date": "22 Jun 2015", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baylor University (Waco, TX) in Nov 2011", "Interview Descriptions": "Basically I was called in, asked about my experience. It was a phone interview however, I was hired on the spot. The decision was given to me as soon as I was done with the interview process. I believe the most important thing you can express is that you are willing to learn and comfortable dealing with people.", "Interview Questions": "Tell me about yourself."}, {"date": "3 Jun 2015", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Baylor University (Waco, TX) in Nov 2011", "Interview Descriptions": "They had a pretty informal interview, but the hiring process takes forever! Don't expect a prompt response to your application, but once you get past that first part it can move quite quickly. The HR department gets first crack at you before anything goes to the department to which you're applying.", "Interview Questions": "N/A"}], [{"date": "13 Oct 2015", "title": "Alumni Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Baylor University (Waco, TX) in Aug 2011", "Interview Descriptions": "It was very laid back. I was asked about my experience and how I felt about the prospect of calling alumni and asking them for money and likely being rejected. I was interviewed by two different student managers. I was also given the opportunity to listen to a phone call by one of the senior callers.", "Interview Questions": "How will you handle objections?"}, {"date": "22 Jun 2015", "title": "Engineering Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baylor University (Waco, TX) in Aug 2011", "Interview Descriptions": "Low key, mainly geared toward freshmen students, just basic questions about yourself for the staff to get to know you a little bit and see if they will enjoy working with you.", "Interview Questions": "N/A"}, {"date": "29 Dec 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baylor University (Waco, TX) in Jan 2011", "Interview Descriptions": "I was gone through phone interview. it basically lasted for about 15 minutes. Asked about previous research experience if any. Hiring manager was nice and soft spoken. I was able to ask some questions as well", "Interview Questions": "Why you like Baylor?"}, {"date": "18 Feb 2011", "title": "Communication Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Baylor University (Waco, TX) in Feb 2010", "Interview Descriptions": "I had to fill out an appplication", "Interview Questions": "There were no interview quesitons for this process"}]]