[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great place", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Sept 2022", "job_title": "Graphic Designer in Tulsa, OK", "duration": "N/A", "pros": "Everyone values community at this place.", "cons": "The pay isn't always the highest, but it's a good place to grow."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Amazing Teachers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jan 2022", "job_title": "Admissions Coordinator in Tulsa, OK", "duration": "N/A", "pros": "This college has the most amazing teachers, they really care and have the students well being at heart. They want all their students to succeed.", "cons": "Communication, or lack of communication."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent Organization!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Nov 2021", "job_title": "Manager in Tulsa, OK", "duration": "N/A", "pros": "Caring, family-oriented with excellent opportunities if you are willing to work for it! Great pay and benefits. We are encouraged to be servant leaders, the best people I've ever worked for!", "cons": "None that I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Cares about their Students and Employees", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jul 2021", "job_title": "Customer Relations Specialist in Tulsa, OK", "duration": "N/A", "pros": "Community Care College is a great company to work for, they care about their employees. They are a very understanding and caring place to become part of the team.", "cons": "I think with any company you have cons. But from working at Community Care College for the last 2 years, that it is a very employee orientated place. Issues will arise anywhere when you have a ton of people together, but at Community Care College we do not have issues like that. We are a very friendly and caring team."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poorly run company", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Jul 2021", "job_title": "Surgical Technology Department in Tulsa, OK", "duration": "N/A", "pros": "3 weeks total annual leave, schedule can be flexible if needed", "cons": "Zero pay raises, no benefits until after employed for 60 days, extremely political and money driven"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Media Assistant", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Apr 2014", "job_title": "Media Assistant in Tulsa, OK", "duration": "N/A", "pros": "Working as the video guy at CCC, as well as Clary Sage College and Oklahoma Technical College has been an immensely positive experience. I have much more flexibility to use creative ideas and generate my own solutions than I thought I would. Rarely have I felt so much love and support from co-workers and managers. Here at CCC I feel like I am respected and valued. I am always treated like a professional and encouraged to grow and try new things. The leaders here continue to teach me things I didn't know I was missing out on, and they push me to be better in positive ways. Probably what I admire most about this company is the devotion to the mission - everything comes back to helping students prepare for and obtain excellent jobs. It is really fulfilling for me to work here.", "cons": "Because I am the kind of person that often needs specific guidance on tasks to feel productive, it can be difficult to go out on a limb with my own plans regarding an issue or problem. However, this flexibility has improved my sense of confidence and initiative in more ways than one."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Community Care College is my second family. Each and everyday there is a smile to greet me.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Mar 2015", "job_title": "Surgical Tech Department Head in Tulsa, OK", "duration": "N/A", "pros": "I work at Community Care College for many reasons... Personally, I want to share my passion for Surgical Technology and this position allows me to do that. From an employee stand point, I love that our top core value is to HONOR GOD. This is vital for me as an employee because I have the opportunity to pray for and with the students when the situation calls for it. I have a team that is above and beyond supportive. We as a department have the common love for helping people in general, but particularly helping students get from where they are to where they want to be.", "cons": "Students become such a part of my life that I truly miss them when they are gone."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Apr 2020", "job_title": "Instructor, College Or University in Tulsa, OK", "duration": "N/A", "pros": "They show their CARES culture to everyone, Employees, Students, Public, Animals \r\n During the COVID-19 Our company has gone above and be on the call of duty, Was they make sure their students still continue their education, To making sure their employees are taken  of an every way shape and form.\r\n We are more then a group of colleges, We are a group of Family and Friends that love and care for one another. We show support and grace to our Students and Employees.\r\n\r\nP.s I have worked for many companies in my Industry, i must say the Knox Family and my Bosses are amazing, i have never felt so appreciated in my industry like i do at Community Higher Ed. Thank you so much to everyone for their love and support or our schools and students.", "cons": "Nothing, there are always learning curves in any place you work, But honestly this is the most grateful employer I’ve ever seen so far."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jan 2013", "job_title": "Front Desk Coordinator/Manager in Tulsa, OK", "duration": "N/A", "pros": "I absolutely love working for this company, they have a culture of excellence that is not just in theory but in practice. Co-workers and managers are courteous, professional and work as a team. There is an open door policy so every one from your direct manager to the CEO welcomes your feedback at any time and actually uses it to improve the business. They have a CARES culture which stands for courtesy, accountability, respect, excellence and success. You read about companies with amazing culture and this is one of them. I feel blessed to have found this job. There is constant focus on growth and learning of all the employees, I have grown so much in the 3 years I have worked here. Great place, I would highly recommend for anyone that loves learning and appreciates a culture of excellence. :)", "cons": "No cons. I have recruited several of my friends to work here because I found such a great place to work and those can be hard to find."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "OMG!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Jun 2016", "job_title": "Instructor in Tulsa, OK", "duration": "N/A", "pros": "None that I can really think of.", "cons": "Salaries way low.  MBA's making $35K per year.  Way too much pressure.  Required to be available to students 24/7.  Work/life balance does not exist.  Your life will become the school.  Management is inflexible and out of touch.  Any comments or suggestions will get you fired.  All conversations are monitored.  If you say anything suggesting you are even remotely dissatisfied you will be fired.  Management takes \"At Will employment\" to a whole new level.  Ever Monday you find out that someone else was let go.  You don't discuss it or ask why or you too will be fired.  Productivity is discouraged.  If you are devoted and want to help the students learn, you will be fired for \"straying off:\" the designed curriculum.   I do not recommend this college."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent organization that makes a big impact. Loved my 7 years!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Mar 2016", "job_title": "Instructor in Tulsa, OK", "duration": "N/A", "pros": "I worked 7 years for the company and resigned recently only to take care of my children. Despite operating in a disruptive environment called higher education, the school genuinely puts students and employees first. They converted to non profit in order to increase the number and amount of scholarships and to even the playing field with government schools like TTC. It was the best job. Benefits average around $15,000 per year and my pay was more than I had ever made for administrative work.", "cons": "I couldn't ask for a better employer. I plan on going back in 2 years if they will have me!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Misrepresentation-it is all about the money!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Jul 2011", "job_title": "Instructor in Tulsa, OK", "duration": "N/A", "pros": "Easy to find, easy access to highways, right next to Sam's Wholesale", "cons": "Positions Misrepresented, this is a sweat shop, you are expected to work in excess of 50 hours a week, 7 days a week.  Weekends you are expected to work from home and be on call 24/7.  No work/life balance.  Benefits are terrible! Sick days/vacation and personal days are accrued, but never granted.  If you do take time off, expect to be fired.  The school has very high turnover - 30% voluntary last year (per the \"Best Places to Work\" magazine) and even higher this year.  Nepotism is rampant in this company.  If you are not related to the owner, you will not be promoted or ever have job security."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "My co-workers, students, and incredible environment make going to work a joy!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Mar 2015", "job_title": "Instructor in Tulsa, OK", "duration": "N/A", "pros": "Everyone at Community Care has so much compassion for their each individual job, which gives our students the best possible outcome to be successful. Community care actually cares not only about their students, but also their employees and I have loved working there over the last year.  I love that if I have a question, I can go to anyone and ask for help, even admin!", "cons": "It would be great if we had a FSA or HSA for our families as well as a daycare on site again. The company itself, I have nothing bad to say."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Worst employment experience I've had.  Students are the best part of working at this school.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Feb 2011", "job_title": " in Tulsa, OK", "duration": "N/A", "pros": "Pay seems fair to start.  Easy to access by highway, centrally located in Tulsa, OK.  Students are the best part of emplyment there.", "cons": "Jobs are misrepresented when applying and interviewing.  Once employment paperwork is completed employees are given manuals with what is actually required of employees at the company regardless of what position they may hold and what hours they are supposed to work.  Employees are led to believe that they have benefits, but will be let go for taking sick days even when attendance is perfect otherwise.  Employees are also let go for not having a personal computer at home even though you are never told when applying that it is a requirement.  The school system has NO security."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Company to be a part of", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jul 2014", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "I thoroughly enjoyed my time at Community Care. The CEO is a woman with drive and intellect that anyone can admire and learn from. I watched students enter lost and leave completely changed. It was a very fulfilling time in my life and I would recommend this company to anyone.", "cons": "The pay in some areas seemed unfair. I knew people around me were getting much more and some, less. I think there should be a steady pay range in place that would make everyone much happier. But still such a good company!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love it here and you will too!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 May 2013", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "This company has welcomed me with open arms and really inspired me to grow both personally and professionally.  I love how we are always ahead of the trends and looking for the next opportunity to engage our students. I've been able to make lifelong friends during my 6 years as an employee with Community Care College. I love having a work-life balance that allows me to pursue my personal goals and spend time with my family!", "cons": "I wish I had started working here sooner!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Awful.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jul 2012", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "Students are motivated and excited to be in school.", "cons": "HR dept. operates in ways that leave employees distrustful. Employees have no avenue for complaints because HR and CEO are family. Too much nepotism, and no one will say anything about it for fear of losing their job. Promotions are pretty limited to family and friends of the owner, so not much room for growth unless you're in the circle. Company culture of kindness is nice, until it's put to the test and you find out it's a facade aimed at keeping students enrolled for the $$. It's all about the money, not the welfare of the students and employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "By far the best career move I ever made was to come to work here!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Mar 2014", "job_title": "President in Tulsa, OK", "duration": "N/A", "pros": "The CARES Culture and CORE Values are our foundation for excellence. Senior Management are very open to input and we have a transparent culture which encourages team members and students to feel free to speak with anyone at any time. Students are team members #1 priority and they work very hard to connect, help and serve.", "cons": "Only that I didn't start working here sooner."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great People, Emotional Decisions", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "1 May 2014", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "The staff is absolute quality and genuinely care about their students. Faculty members are the real deal and experts in the field.", "cons": "Benefits are not good and expensive. Upper Management makes decisions that do not necessarily have their students' best interest in mind and can present a moral dilemma to employees.  No process are completed digitally and everything has an extensive paper-trail, which complicates everything."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Don't Believe the Negative Reviews!  Best Company in Tulsa!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 May 2014", "job_title": "Administrative in Tulsa, OK", "duration": "N/A", "pros": "I've worked for this company a long time, this is by far the most rewarding experience of my life.  The company is VERY honest and take their Core Values seriously.  This Company does not tolerate dishonesty, continued poor work ethics or violations of no tolerance policies such as sexual harassment or positive drug tests.  Employees who have been terminated, are no longer with the company for a VERY good reason and those are the few disgruntled employees who make negative comments.  The work environment is one that encourages professional growth and development.  Employees who do well are rewarded and promotions are frequent in this Company.  The benefits are AMAZING, where else can you get a monthly Spa service?  Not to mention great insurance, paid vacations, holidays and personal time.  They even offer a full service Gym to promote health and wellness.  I'm so grateful to have the opportunity to work with amazing people such as the Owner and CEO Teresa Knox, who started this company when she was a dental assistant.  Going to a career college changed her life and in turn she has changed thousands of lives in the almost twenty years the school has been around. Dr. Kirk is the president of the Company and a true servant leader.  The Company cares about each and every student, it's not about the money and never has been in the years I've worked here.  I plan to retire with this extraordinary Company!", "cons": "I cannot think of any cons presently in the Company.  If you do not fit into the culture and do not care about helping others then this is not the company for you."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I love working for Community Care College and the feeling of being a part of such an awesome team.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2015", "job_title": "Instructor in Tulsa, OK", "duration": "N/A", "pros": "I can go to any faculty/staff member at any time and know that they will help me with any questions I may have.", "cons": "I honestly cannot think of any cons off the top of my head."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Administration", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Jun 2016", "job_title": "Administrative in Tulsa, OK", "duration": "N/A", "pros": "What a fabulous company to work for!   Our CARES (courtesy, accountability, respect, excellence, success) culture is lived out in all the staff and faculty, and the students!  People are kind, friendly, and love their work!  It's a pleasant environment for all.", "cons": "Really, I have no negative comments at this time!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I love my work family!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 May 2017", "job_title": "Administrative in Tulsa, OK", "duration": "N/A", "pros": "This is the best company to work for in my opinion. They take care of their employees and I always feel valued and appreciated. It is a home grown operation that gives back and I respect that so much. The culture is what really drives it home. Visit us and you'll see.", "cons": "I have nothing negative to say. This is the first place I have worked in my adult life where I actually feel valued."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A lipstick smeared pig", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Jan 2016", "job_title": "Administrative in Tulsa, OK", "duration": "N/A", "pros": "Formed many wonderful friendships and enjoyed great perks such as free massage and generous discounts on goods and services.  Nice facilities.", "cons": "It may seem excessive to describe this organization as cult like, but I can't say how many times that very word crossed my mind while working there.  I snicker as I read a review written by a current employee raving about the low turnover rate, putting God first and the positive, life changing impact the school has on students.  I remember being regaled with the same tellings during an employment interview at Community Care College and later found absolutely no validity whatsoever in these canned talking points.\r\n\r\nI had the misfortune of being seated within earshot of a department that sued dropouts.  Listening as former students would literally beg, cry and plead that a lawsuit garnishing their already meager wages for the inability to make payments be  dropped.  I was horrified by some of the ghastly responses such as \"it's not my problem\" and \"you should have thought about this before you enrolled\", or \"well, that's just too bad.\"  Locks were placed on certain departments doors shortly after this practice began.  Hearing these sorts of conversations  marked the lowest point of my employment time at CCC and necessitated the employment of some heavy duty mental gymnastics before reporting to work each day.\r\n\r\nIn the open air, management required that the financial aid department not \"package\" new enrollees who brought with them large amounts of existing student loan debt along with a history of multiple drops from other schools nobly suggesting that an almost inevitable repeat would only deepen the existing hole of a potential student.  I can't  count the number of those that fit this very scenario who were enrolled and saddled with even more loan debt only to drop  a short time later.  Looking back, I feel shame that I played a role in robbing others of any hope of financial freedom, the very thing that brought them to the doors of CCC. \r\n\r\nThere were bloodbaths of layoffs and firings.  I recall the insult and anguish of a good number close friends as they were forced to fight for unemployment benefits after it was said that their dismissal was due to spending too much time on the internet, which, in every case was later disproven.  \r\n\r\nThe glowing reviews on this site are unsurprising, as I recall that on at least two occasions I (as well as many others) was required to publicly express positive statements about the school.  One in the form of a written statement regarding what a great company CCC was to work for and the other a video recording of what a great benefit the school was to it's students.  I reluctantly did as I was told, but didn't dare tout the \"God first\" tenant, as by doing so  marking myself a charlatan. \r\n\r\nJob placement  is a joke.  Graduates were regularly placed in jobs that had very little connection to their respective field of study.  \r\n\r\nThis new talk of being non-profit is a smoke screen.  There are 101 ways to be classified as such and still direct dollars dirctly into the pockets of owners and shareholders.  \r\n\r\nWhile my salary was decent, I would never  work for this company again.  It made me feel dirty and shameful.  I regret having stayed as long as I did, especially after discovering it's nasty inner workings."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "For Profit Only", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Apr 2014", "job_title": "Instructor in Tulsa, OK", "duration": "N/A", "pros": "Flexible schedules, good location and managements requirement to network via social media.", "cons": "Very low salaries for the education level that is required for even the lowest level jobs.  Management is disconnected from staff.  Labor laws are ignored or not known by managers.  Employees must provide their own tools (computers, cell phones, books, movies, etc.).  Must be willing to be on call 24 hours with no additional pay or comp time off.  No advancement unless related to owners. The Right to Work laws are frequently used resulting in very high turnover."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Aug 2013", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "Great culture, core values and mission, family friendly and flexible, the company values and celebrates the accomplishments of it's employees, promotes from within, great place to advance and move up the ladder!  This company has vision and is a leader in the Career Education industry, technologically advanced.", "cons": "I honestly cannot think of anything negative about this phenomenal company!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Love working here, it's like my 2nd home...", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Feb 2019", "job_title": "Financial Aid Specialist in Tulsa, OK", "duration": "N/A", "pros": "I couldn't be happier to have found an employer that truly values and cares for their employees as well as their students. I've been here for 4 1/2 months now but I can see myself here for a very, very long time.  I love the people I work with and I love making a difference in our student's lives.", "cons": "I really haven't experienced anything negative."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A GREAT place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Jul 2013", "job_title": "Career Services in Tulsa, OK", "duration": "N/A", "pros": "I've work for the company for 10 plus years and couldn't see myself anywhere else. I love having the opportunity to making a difference in the lives of our students!  \r\nThe CARES culture and Core Values including \"Play to Win\" and \"Honor God\" sums it all up!", "cons": "No cons that I can think of"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A life enhancing experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Feb 2013", "job_title": "Executive Assistant in Tulsa, OK", "duration": "N/A", "pros": "CARES culture, Core Values including \"Play to Win\" and \"Honor God.\"  The company has complete open transparency with financials, strategy, and management style.  Inspiring vision of CEO sets path of single purpose direction.", "cons": "In an industry that is always under fire."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Jan 2018", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "Excellent culture! Positive working environment, great working conditions, and beautiful campuses.  More like a family with the ability to be a part of something greater than yourself by helping others become successful.  Great benefits and amazing leaders.  I will be here until I retire! Love CCC, CSC, and OTC!", "cons": "Non that I can think of"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company To Work For!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Jul 2015", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "Excellent CEO and College leadership!  Very positive environment that's customer service oriented.  Beautiful campuses, wonderful people to work with.  I love that we change lives and do so much for the community.  I would never work anywhere else!", "cons": "I cannot think of any cons"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Employee Beware", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Nov 2010", "job_title": " in Tulsa, OK", "duration": "N/A", "pros": "At first it sounds all good, but within days you realize you made a huge mistake leaving a job to go to Community Care.", "cons": "They take Right to Work State to a whole new level. People are fired everyday without notice. Just because Community Care can. It's a power thing I guess."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love the school", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Apr 2016", "job_title": "Anonymous Employee in Tulsa, OK", "duration": "N/A", "pros": "non-profit, student focused, life-time job placement, my supervisor is attentive to my concerns, salary is fair, benefits are great, countless students feel at home here, beautiful to watch the transformation from students.", "cons": "I have two weeks of vacation, I wish I had 3."}]]