[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great people and great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Jun 2023", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "If you are looking to make a difference this could be your place. The people are amazing and the organization, although going through some changes, is focused on the right things - making sure more people get transplanted in the safest manner possible. *People *Flexibility *Time Off *401k", "cons": "As noted above, the organization is making lots of changes - which creates a lot of opportunity. If you are looking for an organization that is stagnate, this is not it!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jun 2023", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Work life balance Benefits Able to work remotely", "cons": "Disconnect between management and staff"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jun 2023", "job_title": "Salesforce Administrator in Richmond, VA", "duration": "N/A", "pros": "-Great team -Good Management -Flexibility -Work life balance", "cons": "-Not enough time off benefits compared to other companies"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Software Engineer Review", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Jan 2023", "job_title": "Software Engineer in Richmond, VA", "duration": "N/A", "pros": "Work life balance Feels good to work for a good cause", "cons": "Toxic team environment Very low pay by industry standards Adverse to remote working Disorganized engineering practices"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Words vs Actions", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Sept 2022", "job_title": "Computer Engineer in Richmond, VA", "duration": "N/A", "pros": "We do life saving / life changing work\nWe have dedicated and enthusiastic staff\nTeam work / Team integration is built into the core of the company culture", "cons": "Modernizing the company is slow\nLack of staff in key positions (Moving to Azure, we have 1 cloud person?)\nSmall teams with large workloads result in 'good enough' solutions more times than not, that do not account for the longevity of the product/solution.\nWhen management says something is a priority, generally you can wait 48 hours, and something else will come along to displace it. I recommend having patience, its a great asset for avoiding work you dont want to do. \nManagement will find a term they like, such as 'DevOps' or 'CI/CD' and implement it as the name of the team or process, but will not actually implement the procedures underneath of that concept.\nAutomation is a word that is loved to be said, but no one will actually perform. There are numerous processes that are so hyper-critical that they cannot be automated as 'what happens if i need to release something last minute?' comes up as a defense against automation. \nMost staff in IT have been at UNOS over 5+ years, with key persons having been there their entire career. This results in some very 'inbred' configurations and ideology that does not adjust or adapt to rapidly changing circumstances. \nLack of technical knowledge in key staff results in incomplete or flat out wrong diagnosis of problems (when a diagnosis is performed), meaning that the true cause of an issue or problem is never found or fixed.\nWhen external employees are brought in, they are not given the reins to do what they are good at. The 'old heads' on teams will not relinquish control of what is in their domain which does not foster learning or career development. This has resulted in a 'Hero Complex' where there are about 5 people you want on an incident, and then everyone else is just fluff. \nWe do not follow ITIL, though we have partially implemented it. This results in disastrously poor 'critical problem/incident' handling.\nUNOS leadership is terrified of making a mistake, which means we continue to plod down the same pathways we have always gone down. Improvement is slow if you are scared of changing, and it is even slower when you are more worried about 'how will my team look if we make a mistake' than if you are actually look when you're team cant even get a VM deployed in less than 8 hours."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "If you are passionate about I.T. and technology , this isn't the place for you.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Aug 2021", "job_title": "Information Technology in Richmond, VA", "duration": "N/A", "pros": "The people there are nice.\r\nNice building to work in & convent parking.\r\nYou can get lunch downstairs and nearby lunch options that are within walking distance.", "cons": "UNOS is outdated, I am surprised that HRSA lets companies like this handle public data. The companies legacy application (s) can hardly be called an application and is using outdated .net software which was written 10+ years ago and hasn't changed since that day (outside of feature bloat) and all ties back to a single point of failure (db) which doesn't even have true HA.\r\n\"Best place to work award\" is absolute hogwash, they sent out multiple internal surveys and skewed those results by including \"undecided\" into the positive bucket; which says allot about how this place is run.\r\nPrepare for endless useless meetings, working your butt off while the folks that get recognition will be the ones with the least technical knowledge but biggest mouth. UNOS cannot hold on to good talent because they shun new ideas and would rather rely on outdated opinions from IT employees who haven't learned anything new since the 90's . The only time UNOS tires to implement something new is when they are audited and HRSA/GOV puts the pressure on them, I wouldn't feel safe with them handling my data."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Don't work here if you have a disability", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Mar 2021", "job_title": "Project Manager in Richmond, VA", "duration": "N/A", "pros": "The pay and benefits were alright", "cons": "Rather than providing reasonable work accommodations to help me succeed in my position as an employee with a disability, upper management belittled and reprimanded me for issues I experienced due to my disability and specific needs that were a result of not receiving any accommodations. I tried to have a number of conversations to inform leadership within my department of challenges I experience due to having a disability, but was dismissed. I was looked down upon and was treated as if I was a problem or nuisance. I felt that I did not receive the support or tools to be successful in my job. I was on more than one occasion called incompetent and had my intelligence insulted in a number of demanding ways. After several months of trying to succeed in a work environment that broke me down, I was let go due to it not being a a right fit. I feel that they did not see my disability has \"real\" and decided to find someone else who did not create extra burden."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Awesome place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Aug 2021", "job_title": "IT Support Engineer II in Richmond, VA", "duration": "N/A", "pros": "Here are the pros in my opinion:\nGreat benefits\nFamily Oriented\nFair/Good pay rates\nUpward mobility/opportunity to grow into a higher role", "cons": "Honestly, I can't complain. I love working for UNOS, I work with awesome people, and working for this company has actually improved the quality of life for me and my family."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Mission", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "20 Nov 2021", "job_title": "Administrative Assistant in Richmond, VA", "duration": "N/A", "pros": "Cafe, great people, the mission is wonderful!", "cons": "Lots of changes within the organization"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Only work here if you have no other choice", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Apr 2021", "job_title": "Liaison in Richmond, VA", "duration": "N/A", "pros": "The mission is great! \"Saving lives together!\"", "cons": "The culture here leaves a lot to be desired. It's so unfortunate that they're not wiling to do what it takes to be better. This organization should be further along and they are STUCK in antiquated systems and processes. They have a closed ear to criticisms internally or externally. I'll leave you with this, google \"UNOS\" you'll find that a pizzeria pops up, NOT this organization. A perfect example of knowing there's an issue, and doing absolutely nothing to overcome."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Constant stress and worry while working at UNOS", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Jul 2021", "job_title": "Software Developer Level II in Richmond, VA", "duration": "N/A", "pros": "There are some pros, but the cons substantially outweigh the pros.", "cons": "I worked at UNOS 5 years. On my 5th anniversary, I received my annual review, a 3% raise, then exactly a week later, my employment was terminated. Then they made up a lie to block my ability to receive unemployment (which was later found out and I received the unemployment benefits anyway).\n\nMy first 3 years at UNOS I completed the most work items out of anybody on my team. They had graphs and charts to show and prove it. But after 3 years, the number of work items I completed started to decline because of various life issues I was dealing with. Instead of understanding that life happens and sometimes affects people, and offering help or resources, they instead demand that you pump out as much deliverables as humanly possible, or they cut you loose.\n\nThey are constantly firing people, seemingly for no reason. The manager who hired me was terminated a week after she hired me, and she had been there 14 years, as well as about 10 other employees who had a mountain of knowledge about the software developed at UNOS. Needless to say, while working at UNOS you live in constant fear of being the next target of firing.\n\nSometimes getting the latest source code from their versioning system would cause days of downtime while you resolved a mountain of issues.\n\nUNOS absolutely LOVES meetings. Sometimes they would have a meeting about a meeting. I calculated that on any given week, no less than 35% of my time was spent in useless meetings.\n\nDuring my final 2 years at UNOS, there was a massive surge in on-call incidents compared to my first 3 years there. I believe that the spike was the direct result of poor management.\n\nUNOS is run by extremely conservative boomers, who absolutely refuse to even consider a work-week that is less than 40 hours.\n\nUNOS offers remote work, but doesn't let anybody use it, except for a very small group of less than 10 employees, who lived out of state.\n\nThey offer a company gym, however I was specifically told to do my exercising at home, even though I never worked out on company time.\n\nThey have very unfair and inconsistent hiring practices. I saw someone with NO Microsoft development experience get a direct offer of employment, while others may get anywhere from 30-day to 1-year contract-to-hire offers, the length of contracts being very arbitrary.\n\nThey have an unusually high turnover rate, largely because of their constant firing people, but also because people would leave on their own because they can't deal with the daily nonsense that occurs in the workplace.\n\nThe CTO at UNOS also worked in a very high position at AOL, which crashed to the ground and burned. Sometimes you get the feeling that he's out to make UNOS' technology departments crash to the ground and burn as well.\n\nThis review can honestly go on more, but it's long enough already. You should get it by now, anyway."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great place to work", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Aug 2021", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Awesome people, culture and benefits.", "cons": "Poor management style, through you under the bus."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Unos", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Aug 2021", "job_title": "Policy Analyst in Richmond, VA", "duration": "N/A", "pros": "Good mission and strong culture", "cons": "High pressure to support important mission"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Steady work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Apr 2021", "job_title": "Senior Software Engineer in Richmond, VA", "duration": "N/A", "pros": "Great benefits and steady work", "cons": "Older technology, inconsistent message on direction."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "UNOS has a great mission, but that's about it.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Nov 2017", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "I come to work every day knowing that my work, as well as the work of others, truly has an impact on patients and those awaiting a lifesaving transplant.", "cons": "This company has gone down so, so much in the last 5+ years. It used to be a company where employees felt valued, you felt like part of a family. Now it's just all about the money and politics. Good - no, GREAT - people are being let go with no explanations whatsoever. As far as staff can tell, the people being let go are those that had an opinion and tried to speak up and create positive changes. Some of the directors don't seem to like that or want that though, regardless of what they pretend to say. They claim there's an \"open door\" policy, but anyone who tries to bring up any issues or take part in any change that might benefit employees is walked out the door. This is so disheartening to the rest of us, and it does nothing but create distrust and most certainly discourages anyone from speaking up."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "TOXIC Doesn't Begin to Describe the Atmosphere", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Jun 2016", "job_title": "Independent IT Consultant in Richmond, VA", "duration": "N/A", "pros": "Great mission, some very dedicated professionals who want to make a difference and work hard", "cons": "There is no leadership, to speak of.  There is no vision except one of golden metrics that paint the picture they want others to see.\r\n\r\nThe management style in IT is exceptionally poor, starting at the top with a CIO who patterns himself after Jack Welch, and is proud of it.  He uses Jack's playbook to intimidate, threaten and beat people down.  The morale was so bad, and you could smell the fear in the air.  The CIO is a micromanager who lies, triangulates, manipulates and destroys people, and seems very comfortable doing so.  He has absolutely no conscience and is incapable of empathy.\r\n\r\nThe CIO is technically backward, managerially deficient and as far as leadership, he's a train wreck.  I, too, could not take it any more and had to leave to keep my sanity and self-esteem.  The company mission was what drew me in, but the CIO is what drove me out.\r\n\r\nUnfortunately, no one with any authority in the organization will do anything about the CIO and all his destruction.  He plays favorites, picking the wrong people every time to hold up as the model employee.  He pits people against each other and destroys individuals in front of their peers.\r\n\r\nThe CIO never gets to the truth in any issue, but rather takes the side of his pet employee and shreds the others.\r\n\r\nIt's a total disgrace, and he should be removed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "My overdue review of UNOS", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 Sept 2019", "job_title": "Software Engineer in Richmond, VA", "duration": "N/A", "pros": "I wish that more of the driven staff at UNOS would take the time to leave a review of the organization.  Unfortunately, many of us are likely engaged in mission-related discussion around the clock.\r\n\r\nParticipating with UNOS isn't \"work\" - it's participating in something that is life-defining for someone else, and it's not just one time.\r\n\r\nYour experience with any organization is what you create of it.  UNOS is a smaller organization (compared to the typical Richmond top employers) that has much more limited resources, which means that the weight that staff carry is greater in scope than other organizations.  Whether you're a policy analyst, software engineer, data scientist, or manager, this translates to having to do a little beyond your specialization - at the same compensation, with the same amount of time, with the same resources.\r\n\r\nThis creates a lot of growth opportunities for our staff; unfortunately, over the years, I've noticed that we end up creating extraordinarily skilled staff to work elsewhere.  It's a phenomenal place to work, if your situation fits.", "cons": "Most things in life are relative, and anything could be done better.  I admire the organization for it's staff, mission, and culture for what it is, and have no cons."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Management is a joke", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Oct 2014", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "This company does some of the most truly noble and honorable work imaginable - they save lives. But that's about the only good thing I can say about this place.", "cons": "Where to start...management and much of the staff in general is (or was when I worked there; I'd be shocked if it's changed much) horrific. They provide virtually no guidance of what they want done or how or when...then get upset when it's not done \"right.\" They often scoot out of town to conferences to hob-nob with lawyers and doctors and no doubt massage their quite massive egos, virtually ignoring the people who work for them. Working conditions are absurd; if you get a tiny, cramped cube, you're one of the lucky ones. I've seen a half-dozen employers crammed into rooms that could scarely fit two comfortably. If they have any concerns or problems with anything you're doing in any way, they don't do the logical - and professional - thing and bring it to your attention; they'd much rather talk behind your back and suddenly spring it on you when it's too late. When I was there they went through contractors like people go through underwear; they make Cap One look stable (no easy task). I could go on, but you get the gist. This is the very LAST place you want to work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great mission, great peers, company experiencing severe growth pains", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jul 2014", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "The people, or rather the underlings, are fantastic people to work with. They have big hearts and the majority of them truly stand behind the mission of the organization. The benefits are awesome, including pay increases every year and over 6% matching for 401k. The pay isn't great, but doable. Most managers are flexible, making it family friendly. IT department workers may not say the same thing.", "cons": "UNOS has a lot of new upper management and in turn undergoing drastic changes in staff, even those that have been there for 10+ years. Staff morale is currently in the dumps. Some of the changes were needed to trim the fat, and clear out those that had been there too long and become ineffective. However, the way the trimming has happened has been distasteful and disorganized. Decrees are made from the top and underlings flounder to still make things happen with less staff. Don't get a job there right now hoping for good job security."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good place for a technology career", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Feb 2018", "job_title": "Software Engineer in Richmond, VA", "duration": "N/A", "pros": "The IT department is much more forward-thinking than I've heard about times past.  We're getting into the cloud, leveraging things like SalesForce, APIs, and enhancing the mobile platform.  There's good morale in Software Engineering.  \r\n\r\nThe culture of the company allows for fantastic balance between work and home.   At least in SE, the managers really value your time with your family and give you flexibility to do what you need to do with your family.\r\n\r\nThere's also a culture in SE toward education.  We're given access to learning websites and are encouraged to take time each week to learn new technologies.\r\n\r\nThe benefits are great compared to what I've seen before.\r\n\r\nThe mission of UNOS is unlike no other.  You literally work on things that save people's lives.  It doesn't get more meaningful than that.", "cons": "The main con is that the salary doesn't seem to be as high as other companies in the tech industry.  It's a non-profit, so that makes sense, and they try to make up for it in other ways."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Good for your conscience, but not for your morale or pocket", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Sept 2008", "job_title": "QA Technology Manager in Richmond, VA", "duration": "N/A", "pros": "The mission is terrific - matching organ donors and recipients. Most of the people are really nice and caring. The company is very family-oriented. Work-life balance is strongly supported. The company tries really hard - sometimes too hard - not to fire people. When a layoff occurred - once in the 6 years that I was there, due to a re-organization - the company tried really hard to find jobs for those affected within the company and provided outplacement services. The benefits are surprisingly good for a non-profit, though the low pay makes it hard for all employees to fully participate.", "cons": "Most of the pay is comparable with that of other non-profits, but the pay for QA personnel is poor, even by non-profit standards. Company-wide, pay adjustments are based more on longetivity than on performance and responsibility. Professional development is not offered at all. There is no tuition reimbursement. There is no room for career growth. HR exists almost solely to process personnel transactions and resolve conflicts."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great Coworkers; Great Purpose; Great Place!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Aug 2016", "job_title": "IT Engineer in Richmond, VA", "duration": "N/A", "pros": "UNOS is not just a place you go to work, it is a community of people who value your contributions and who will challenge you to provide your best efforts to the overall mission of saving lives. As a small company, UNOS is constantly challenged with making the most out of its limited resources and it is very evident that UNOS makes it work because they value the ideas and contributions of their employees.", "cons": "There have been times where the stress from work can wear one down. Working on projects that require you to almost constantly change direction because of missed requirements or where you have to revisit and reanalyze a situation during a critical junction point is not just hard work and straining to morale, it does cause one to ask the question about how some business decisions are being made by management. It can seem at times that the business is being driven more by personalities than by data driven analysis."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Cronyism thrives", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Jul 2017", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "I gave one star to note the prior CEO.  As someone who worked there 10+ years, i have had the benefit of working with and for people who truly believe in the mission.", "cons": "Newer management hires people for jobs that are not even posted.  There is no transparency and the \"yes, boss\" people are suddenly appointed to manager and director positions. So if you are someone who likes to provide ideas for change, look elsewhere as it is not going to happen.  Departments and positions are suddenly \"eliminated\" and management makes no effort to find other jobs within UNOS for these employees.  In stead you have a meeting where you are dismissed and then walked out by HR.  No matter what, it is embarrassing and makes you feel \"dirty\".  It does serve to stir up fear and distrust in the folks who are left behind.  Then, you may find out that after eliminating your position, a few months later they will find someone who they can pay less to do the job that was supposedly eliminated."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Employer ever.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Feb 2018", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Great Mission: not sure that there is anything more compelling than life saving as a reason to come to work.\r\n\r\nGreat working environment, team mates, interesting work, principled and engaged leadership. Awesome benefits, and a dedicated development budget for EVERY employee!", "cons": "Anyone that thinks there are \"cons\" about working has one of two issues...\r\n\r\nA boss that is just learning to be a leader and so they make mistakes... \r\n\r\nOR\r\n\r\nThey havent worked anywhere else!\r\n\r\nLots of people have little complaints, but relative to most healthcare, or Fortune 500 companies... this place is HEAVEN! UNOS has been a Top Workplaces in RVA winner for four or five years in a row."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Mission focused life sciences company", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "23 Feb 2016", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Staff are totally committed to the mission, TX recipients love UNOS, nice building, ample parking, great benefits, and The One Stop Cafe is the best.", "cons": "Departments tend to be silo'd in their operations creating a \"one hand does not know what the other hand is doing\" scenario despite efforts to make things more collaborative. The IT dept. has been and is still way behind the technology curve and is a revolving door of staff and management. Mid and senior management have been a target for layoffs the last couple of years, with numerous \"escorts\" out of the building witnessed.  Cruel way to treat people that have committed themselves to mission for so long."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Software Engineers be warned.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2017", "job_title": "Software Engineer in Richmond, VA", "duration": "N/A", "pros": "Relaxed enough work environment, respectable mission", "cons": "Ancient technology, low morale, annoying bureaucracy, very low pay for software engineers."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Okay Company", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Mar 2016", "job_title": " in Richmond, VA", "duration": "N/A", "pros": "Great mission and cause. Saving lives and increasing transplants is the prime focus. The company has a youthful feel (sometimes) and there will be plenty of times to let your hair down to dance, engage in some events like the 5K, as well as attend many other functions. Cafe downstairs in the case you want spurge on lunch one day. Great 401K plan.", "cons": "Not much growth/promotion opportunities, or even solid job security. Every other week someone is leaving.  Salaries aren't competitive compared to other industries so people stay because of the mission/values. Parking isn't convenient, unless you're granted access into the main parking garage, which takes over 2 years. No avenues to further education. Experienced micro-managing to a very high degree."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Missed Opportunity", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Nov 2019", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Mission, Mission & Mission! Benefits & cafe in the lobby.", "cons": "Alarming attrition rate.  \r\n\"Some\" managers are leading by fear. \r\nInterdepartmental struggles that are \"personal\" in nature, can and will destroy a team or teams over time.  \r\nFavoritism is rampant, it destroyed my morale & faith within the department leadership very quickly, which in turn lead me to make a difficult choice of leaving a company I once loved to work for."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Mission. Poor Management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 May 2016", "job_title": "IT Manager in Richmond, VA", "duration": "N/A", "pros": "The mission is wonderful and many people are there because of it.  The bottom line at the end of the day is that you are finding ways to save more lives.", "cons": "Too many Boom/Bust cycles in IT.  One senior manager after another comes in, tries to implement something, fails, then another comes along.  Lots of turnover and changes in direction.  There seems to be no appetite for identifying what works and modeling that - its big new idea after big new idea.  HR is a mess and not supportive of Employees or Managers."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Beware!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Sept 2016", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Opportunity to work with many highly intelligent and dedicated professionals in service of a lifesaving mission. Great little cafe in the lobby!", "cons": "Current CEO has created an environment of fear, mistrust and paranoia, which even the senior managers in the \"c suite\" seem powerless to counter. I've sadly watched a number of highly capable and dedicated staff members be suddenly fired without any indication of what was coming - no previous word from their managers that their performance was lacking in any way. This has resulted in an atmosphere of stress and paranoia among remaining employees- and a bit of a revolving door as newer employees don't feel any sort of loyalty to an organization that treats its employees that way."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent Place to Be", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Aug 2017", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Incredible mission and culture.  The people are all dedicated to the mission of the organization and work together to make it happen. Senior leadership is aligned in vision and dedicated to building a learning/improving culture.  They try to take care of their employees.  Everyone values hard work and innovation, and they are both encouraged.", "cons": "Not all the directors and managers should have been elevated to those positions.  Jobs don't always have a clear career path but I hear that is being worked on with new, more experienced & capable HR leadership than what was previously had."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Sept 2019", "job_title": "Software Engineer in Richmond, VA", "duration": "N/A", "pros": "I think your experience here will vastly depend on which team you are placed on. My team is very close knit, and while my previous team at UNOS was also decent, my current one is much better.\r\n\r\nOverall, I really enjoy the work I do here. My team is great, I have a lot of respect for my manager, who is incredibly knowledgeable, and our director is also fantastic. Our CTO fairly regularly holds 'catch ups' to also discuss how things are going in IT as a whole. It's a great opportunity to discuss with the CTO what is and isn't working, and suggestions to fix anything that isn't working. I do not interact with anyone above the CTO regularly enough to have any strong opinions.\r\n\r\nThere's a lot of opportunities to learn new things here. I currently work on several different products here using different technologies, so I get experience with a lot of different tech stacks. Our team also has 'fourth Fridays' where you can work on a project you would like to work on, learn a new skill, keep current with your existing skills, and so on. I really like this opportunity as well. I've worked on several interesting projects during this, and I love the opportunity to learn about new technologies as well.\r\n\r\nWorking hours are also reasonable, with no expectation that you will work 60-80 hours a week. I almost always work 40 hours, with the very occasional need to work more. Not to say that you won't have plenty of work to do while you are at work, but it is generally manageable. \r\n\r\nI also really like our benefits here for the most part. Our PTO/vacation time is fairly generous (2 weeks starting, 1 week of 'floating holidays' which are simply vacation time that you use or lose, the ability to purchase another week of vacation, and I believe it's 2 weeks of sick leave, but I am not certain on that). The 401k program is also good, although the vesting period is fairly long (6 years) if you plan to leave soon (which I do not, but it is still a consideration).\r\n\r\nOf course, the mission is also great. I really like the fact that the code I write is helping someone get a life saving transplant. For me, though, working environment and benefits are also important (which is why I focus on them here).", "cons": "Sometimes it can be difficult to get things done with other departments, which can affect productivity. I've needed to get my manager or director involved in several issues to push things along.\r\n\r\nYou would also be able to make more money at CapitalOne or CarMax, for instance, but overall, the working environment and mission make this trade off worth it for me.\r\n\r\nSome of the policies don't make a lot of sense to me as well. For instance, there is a policy that says you are supposed to get your computer erased upon your return if you take it out of the country or to take a loaner computer. With the amount of setup I'd need to do and software that I'd need to reinstall, this is a real drag to productivity. I could see erasing it before you leave (so that the CBP or whatever agency is in your destination country is not able to get access to UNOS data), but it doesn't make a whole lot of sense to me to do it when you return."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Concealing layoffs?", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jan 2018", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "The mission, the mission.  That is why people stay.", "cons": "Over the past few months, UNOS has been avoiding the expense and exposure of laying off employees by selectively forcing some out.  Members of management are telling certain employees to look for another job.  The implication is clear.  In most (if not all) cases, this comes after good reviews and the raises that followed fall’s annual performance review... making it completely unexpected.  It makes you wonder if these 'covert' layoffs are to cover employee losses as they bid for the new contract."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "A missed opportunity to grow into a dynamic IT Department", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 May 2013", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "People passionate about the organization's mission. New senior management is making changes to the management team.", "cons": "IT department has had major turnover in previous years as a result of firing previous CIO. New CIO has very hierarchical management style and rarely leave her office. Very difficult to institute change or new ideas to this organization."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "stewardship ,unity,  trust ,excellence, accountability(WHAT A JOKE)", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Jan 2019", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "UNOS does boast a pretty diverse eclectic group of individuals, some friendly others not so much.", "cons": "Shady business practices \r\nConfusing dress code policy\r\nfavoritism\r\nLack of ACTUAL accountability\r\nLack of ACTUAL trust\r\nLack of Stewardship"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Was once a wonderful place to work...", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "10 Jan 2018", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "The mission, many of the co-workers (extended family)", "cons": "UNOS used to be a very family oriented place to work. I am not sure where things went wrong but the last few years have really taken a major turn for the worst. There are still some great people holding on there but so many have left over the last five years or so that it is no longer a desirable place to work. I have witnessed wonderful, hard working employees fill open positions in hopes of getting the position permanently only to be disappointed when the higher ups award it to someone new or outside the organization. Then watch that asset decide to leave as a result. Then the current CEO and the Board of Directors decide to choose a CTO that does not fit within the organization at all. As a result, the IT department is now in shambles. Almost all of the best IT employees have moved on and the ones hanging on are merely hoping for that ever constant changing of the guard that happens all too frequently at this company. In just a three year span, there were three different CTOs, and my department alone saw five different managers in that same span. \r\nThe entire HR department was wiped out and for awhile was manned by one contractor. \r\nThey state they live by these core values, yet the upper management there (with the exception of a few) have yet to set that example for the rest of the employees. \r\nEmployees are no longer treated like they matter. Just when it seems like morale cannot get any lower, it does. \r\nLong standing employees are being forced to retire or else. \r\nI once thought this was a place I could retire but now I would not suggest it to my own enemy."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Unethical and Poorly managed", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Jan 2016", "job_title": " in Richmond, VA", "duration": "N/A", "pros": "Their overall mission is admirable, but they are failing at executing it.", "cons": "It is time for a new organization to take on this contract. UNOS is plagued by management issues and financial problems. They have been ineffective in making any real change to the transplantation system. They do not use federal dollars responsibly, especially when staff travels and the government foots the bill for wild nights of drinking and partying. The company's ethics are questionable and it is worrying as both a former employee and a tax paying citizen."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don’t apply for IT jobs!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Feb 2020", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Great mission, great people working there.", "cons": "IT is a disaster.  Ancient tech, high turnover, a pie in the sky roadmap, and a very high level of incompetence in leadership.  CTO has made promises to the business that he  has failed again and again to keep (Membership).  Beware of being thrown under the bus that will back up and run you over again."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Great feeling of assisting others", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Apr 2013", "job_title": "Analyst in Richmond, VA", "duration": "N/A", "pros": "Great work environment and talented peers, family friendly, Sense of doing good for others. Flexible daily schedules and work at home availability.", "cons": "The only con is that the salary is not as competitive as other industries in the area.  I guess to be expected from a non profit."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Nov 2016", "job_title": " in Richmond, VA", "duration": "N/A", "pros": "Great mission, people,  vision, benefits.   Continues Transformation - improving performance review, new technology, innovations, empower individuals to lead.", "cons": "Some technology will remain old.  Some feel of being government contractor (not all bad)"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Same OLD UNOS", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "24 Jan 2019", "job_title": "Management in Richmond, VA", "duration": "N/A", "pros": "Mission, talented and resourceful staff", "cons": "CEO is not a leader or empowering agent. The opinions expressed here are EXACTLY identical to prior years."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Apr 2018", "job_title": "Senior Software Engineer in Richmond, VA", "duration": "N/A", "pros": "Excellent mission, self-driven co-workers, great work-life balance, always striving to improve", "cons": "Still using some old technology"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "IT Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Nov 2018", "job_title": "IT Manager in Richmond, VA", "duration": "N/A", "pros": "Friendly people, excellent work/life balance, flexible hours, family focused", "cons": "Pay isn't competitive with other non-profit companies"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Feb 2017", "job_title": "Anonymous Employee in Richmond, VA", "duration": "N/A", "pros": "Great work environment, awesome people, innovative environment", "cons": "limited opportunity for advancement, slow pace"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Mar 2020", "job_title": "Policy Analyst in Richmond, VA", "duration": "N/A", "pros": "Work environment was very collaborative", "cons": "Work timeframes were often very tight."}]]