[[{"date": "13 Apr 2023", "title": "Assessment and Institute Effectiveness Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Kansas City University (Joplin, MO) in Jan 2023", "Interview Descriptions": "3 step process beginning with a screening call followed by a Zoom interview. Finally, there was an in-person interview at the Joplin campus including a tour. The entire process took about 3 months before I was offered the position.", "Interview Questions": "Why are you interested in this position?"}, {"date": "3 Feb 2021", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kansas City University", "Interview Descriptions": "Walked me through the basics of what I would be doing in the position, very concise and established who I would be working with. The demeanor was very professional yet friendly.", "Interview Questions": "Tell me about your design process"}, {"date": "10 Jun 2019", "title": "Director of Alumni Development and Annual Giving Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kansas City University (Kansas City, MO) in Apr 2019", "Interview Descriptions": "I had a conversation with the recruiter about the requirements and expectations.  I then did a video interview with whom would be my boss.  I was then brought to campus for a few hours of in person interviews and then a final video interview with the president.", "Interview Questions": "What is it about our institution that makes you want to work here."}, {"date": "14 Feb 2019", "title": "Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Kansas City University in Aug 2018", "Interview Descriptions": "phone interview followed by on site  very friendly process and very focused not too difficult but you should be prepared . Seems like a nice place to work at and very good professional people work there.  Overall was a good experience.", "Interview Questions": "present lecture"}, {"date": "21 Jul 2016", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Kansas City University (Kansas City, MO) in Mar 2016", "Interview Descriptions": "Very long involved process with folks who are not very friendly or welcoming. They made me feel about as welcome as the a thorn in their side. Had two or three lengthy interviews with multiple people. Why be so off-putting to a prospective employee? After the first interview I thought it could have been me, after the second interview I was certain it was the folks doing the interviewing. One of them spent time on the cell phone during the interview.", "Interview Questions": "How would I go about solving a problem that can't be solved? What kind of question is that?"}, {"date": "30 Nov 2014", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kansas City University (Kansas City, MO)", "Interview Descriptions": "Colleague recommended the position to me.  I filled out resume online & heard from HR within 1 week to set up interview.  The PI I interviewed with was friendly & personable.   Asked me about my experience,  my role in my prior labs research projects & papers.   The PI went over their research interests & current projects.  I was then taken in a tour of the research department.  Every individual I met was friendly,  seemed genuine and quite competent.   The facility's equipment was limited,  not a surprise given its size (such as 2 high quality lab water units & 1 hood for the entire building), but a majority of it recent.  What was older was quite dated,  some of the biosafety hoods were > 20 yrs with difficult to use metal sashes. The 1 fume hood for the building was completely filled with various bottles, pipet waste, beakers, waste  & had me wondering about the state of the EHS department.  The tour concluded the interview.   I refrained from inquiring about the university's benefits,  advancement opportunities & other training opportunities for a follow-up interview if there was to be one.    I did find out that the interviewer contacted not only my listed references, but researched my past labs' staff listing to contact some of them for their assesment of my performance (I'm not sure prospective emplorers are able to do that).  There was no 2nd interview,  which I found surprising, & a position was offered.", "Interview Questions": "What type of work environment would your ideal?"}, {"date": "29 Aug 2015", "title": "Financial Aid Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Kansas City University (Kansas City, MO) in Apr 2011", "Interview Descriptions": "The interview took about 5 hours total.  You meet with various employees or small groups that interact with the position/ office you are applying for 20-40 min each.\r\n\r\nThe interview style means answering the same question multiple times for each person/group you meet with, but it does allow you to get a sense of the personalities in play and the work environment itself.", "Interview Questions": "Why I wanted to love back to Kansas City."}]]