[[{"date": "24 Nov 2022", "title": "Senior Field Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "It was good and it was online with questions on data quality, leadership, challenge in field of research and their remedies. There questions on how to ensure you meet your daily target.", "Interview Questions": "On use of survey cto"}, {"date": "12 Jul 2022", "title": "Senior Field Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "It was easy and swift and the interviewer was friendly. Questions asked were not so complicated and there was enough time to answer. The interview was not long and there was room to ask any question or clarification", "Interview Questions": "Briefly tell us about yourself "}, {"date": "9 Jun 2022", "title": "M&E Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "General application followed by an interview with the hiring manager, and then a technical test - the technical test was a lot more difficult than advertised. I had SPSS, Stata experience for a few years at that point, but the test was nearly-impossible", "Interview Questions": "the technical exam had a lot of hypothetical questions - something that didn't have a direct answer"}, {"date": "2 Jun 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "3-4 rounds of interviews, process began with a written test, first round of interview with the project team, the principal investigator of project and finally with the country director. Thereafter an offer is made", "Interview Questions": "Job specific questions and practical "}, {"date": "10 Jun 2022", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Innovations for Poverty Action in Jan 2022", "Interview Descriptions": "A lengthy interview process that took a total of 5 months from application to start date.  I had a phone screening with the recruiter, completed an interview task, and then interviewed with two staff members.", "Interview Questions": "Questions about my experience with the job requirements including people and project management."}, {"date": "26 Aug 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "The application process involves completing an online application, and these applications are reviewed on a rolling basis. They invite you for an in-person interview with the Research Manager or Coordinator, followed by the Stata test.", "Interview Questions": "Why do you want to work with Innovations for Poverty Action?"}, {"date": "25 Feb 2021", "title": "Research Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "The process was super fast and structured, consisting of a practical test with a case to solve (focused in RCT methodology and research design) and a competence based interview (made in english and country language).", "Interview Questions": "- How is your leadership profile?\r\n- + technical cases during the interview \r\n"}, {"date": "31 Dec 2020", "title": "Student Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "I applied through University website and I only got a phone-interview from the manager. I guess because this is an unpaid position, the interview was relatively simple and easy than I thought.", "Interview Questions": "Tell me something about yourself "}, {"date": "29 Dec 2020", "title": "Student Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "The hiring manager responded to my application saying they'd already filled the position that I'd applied to, but they were looking to fill another, similar position. I said I was interested, had one interview, which felt comfortable and conversational, and was given the position. No Stata test and no super technical questions. Overall a great experience!", "Interview Questions": "Please go over your resume and describe your experiences."}, {"date": "25 Feb 2023", "title": "Senior Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Innovations for Poverty Action (Tamale) in Nov 2020", "Interview Descriptions": "First, there was a short screening interview about my motivation working for IPA, what I think I would be best and worst at in the job position I applied for, salary expectations and starting date. Then, I had to make a Stata test. Afterwards I was invited for a 45 minute interview with 2 staff members, and lastly there was a short conversation with the PI of the project I would work for.", "Interview Questions": "Why am I interested in this role? Which challenges did I foresee in my new role, and how would I handle them? Had a ever have to give someone disappointing news? If yes, how did I go about it? How would I deal having to manage different stakeholders and their different demands on the project? What was my experience with data analysis, Stata and SurveyCTO? How would I handle working as a western person in a senior position in an office in West Africa? Two scenario questions about challenges during data collection and how I would handle them"}], [{"date": "27 Oct 2020", "title": "Monitoring and Evaluation Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "Trois entretiens. Un avec les ressources humaines, un test de logique et un autre entretien technique avec le superviseur du department. Les entretiens ont eu lieu en ligne du à la crise sanitaire.", "Interview Questions": "Qualité/ défauts, pourquoi etes vous le candidats idéal, etc."}, {"date": "26 Oct 2020", "title": "Policy & Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "I applied online and had to answer form questions. I was contacted for a phone interview and after a scheduled STATA test. Stata test is most difficult for many applicants for this I was told. However, the test was not as difficult as I anticipated.  I am waiting on the next stage.", "Interview Questions": "What is it on the TOR you will have challenge performing?"}, {"date": "1 Oct 2020", "title": "Project Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action (Rome) in Sept 2020", "Interview Descriptions": "Student TEST about Policy and Project Development in African countries, with 4 questions both in French and English language and then Interview with 2 team members about motivation and previous experience and academic course", "Interview Questions": "What do you know about IPA and our evaluation method?\r\nWhich are of intervention are you interested and why?\r\nAcademic and professional experience"}, {"date": "28 Aug 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "If was through Zoom, there were 2 persons. They were very nice. The interview was in Spanish and there was a part in English. It took around 30 minutes, and the instructions were good", "Interview Questions": "What was my wage expectation"}, {"date": "24 Sept 2020", "title": "M&E Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action in Aug 2020", "Interview Descriptions": "The first stage involved a hiring assessment consisted of two parts-a 20 minute logical reasoning test and a 2 and half hour long assignment which involved preparing a presentation based on a evaluation prompt.", "Interview Questions": "N/A"}, {"date": "14 Apr 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Bogota, Cundinamarca) in Jan 2020", "Interview Descriptions": "Interview usually asks for RCTs experience and basic evaluation concepts knowledge. It is focused mostly  on a test on R+ Stata or Arcgis after the interview. This is the hard part of the initial assesment.", "Interview Questions": "Difference between monitoring and evaluation and RCT knowledge"}, {"date": "20 Nov 2019", "title": "Student Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "It was an informal and conversational interview conducted by Skype. \r\nI mainly talked about my previous work experience and what I' ve learned from master's degree. They also asked about my practical skills and the reason why I applied for this role.", "Interview Questions": "what skills can you contribute to our team if you join our team?"}, {"date": "6 Oct 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "Written(knowledge)->Stata->Written(contextual)->Phone\r\nThe interview process was long. Every stage came with at least 2 weeks of waiting. Application to interview spanned 3 months. Interview(test) questions were very detailed and creative. The contextual written exam can be done completely creatively. Pretty cool.", "Interview Questions": "How do you plan on hiring surveyors for a certain project given the scenario."}, {"date": "18 Nov 2019", "title": "Operations Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Innovations for Poverty Action (London, England) in Oct 2019", "Interview Descriptions": "The interviews were intense. Written screening interview, oral and Executive via Skype.\n\nMainly questions were related to the JD and skill sets to accomplish tasks. The panelists were experts in the departments and with active listening skills", "Interview Questions": "Why have regulatory approvals"}, {"date": "15 Jun 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Innovations for Poverty Action (New York, NY)", "Interview Descriptions": "Four stages: 1) online application (requires recs and transcripts, 2) informational interview, 3) Stata test, 4) in person interview with people working on the project.\n\nThey can take a long time to get back to you, as the internal recruiting process is somewhat disorganized. Don't be surprised if you fill out an application then don't hear back until three months later.\n\nMost difficult part for most RAs is the Stata test, although I found it easy and finished with an hour to spare.\n\nDon't remember much about interview questions. They value quant skills and experience with experimental studies.", "Interview Questions": "What previous research experience do you have?"}], [{"date": "7 Aug 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Innovations for Poverty Action in May 2019", "Interview Descriptions": "Initial call with recruiter. Then moved on to a hiring assessment. Assessment was an intensive, but good 3 hour exercise. \r\n\r\nFollowing assessment, never heard a word from the recruiter despite following up. Extremely unprofessional to not notify candidates one way or the other after they participate in an interview process.", "Interview Questions": "Talk about a time you present to or engaged the leadership of an organization; what were the goals, how did you communicate your message?"}, {"date": "6 Aug 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action in Apr 2019", "Interview Descriptions": "Well organized. Not very intimidating. It  normally start with questions related with casual inference knowledge and coding abilities; ability to explain processes on data management and protocols is an strong advantage. Then questions are related to experience on field work. Then team work; and, finally communications at workplace. \r\n\r\nQuestions changed from country to country.  Having a past professional relationship with a university or affiliated professor is an strong plus.", "Interview Questions": "How would you explain an RCT to an aunt?"}, {"date": "1 Apr 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "The interview process included a CV review, Stata exam, Written exam, a skype interview and two references. The exams mimicked the actual job tasks well and asked to apply the qualifications listed in your CV.", "Interview Questions": "Typical behavioral interview questions, such as how did you manage a difficult situation in the past, what would you do in X situation, etc."}, {"date": "30 Mar 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Berkeley, CA)", "Interview Descriptions": "The process was very smooth. There were two rounds of interviews, both went well. I was provided three rounds of stata exercises to be completed by a certain deadline. The turn-around was fair but would have expected it to be quicker.", "Interview Questions": "Why is this kind of work important"}, {"date": "14 Apr 2023", "title": "Field Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Siaya) in Mar 2019", "Interview Descriptions": "It involved a written test about field scenarios. The questions are like&nbsp; What you will do if a respondent fails or refuses to give consent to the survey&nbsp; What will you do if the field car breaks down? When you are selected, there is training where some 2–3 people are eliminated, so one needs to pay attention since there is another test after training.", "Interview Questions": "What you will do if a respondent fails or refuses to give consent to the survey&nbsp;"}, {"date": "6 Jun 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action (Washington, DC) in Jan 2019", "Interview Descriptions": "The hiring process was rigorous; about 4 rounds of interviews including test. Very insightful and most interesting I have ever had. Quick turn around time between interview and feedback; sometimes immediately. Concluded and offered the job within 2 weeks.", "Interview Questions": "What are your career aspirations?"}, {"date": "1 Mar 2019", "title": "Research Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Innovations for Poverty Action in Jan 2019", "Interview Descriptions": "I had an initial hour long phone call that was a combination of explanation, introduction, and some more difficult behavioral/situational questions and technical questions on RCTs/econometrics.  All of it was very cordial, though. After that there was supposed to be a stata test - I was not currently at a university nor did I have access to stata so I would have had to find a way to pay for it. At this point I had another job offer that I decided to take and backed out before the stata test. Overall, it moved very, very slowly (to be expected with academics).", "Interview Questions": "Would would you do if your field partner thought you weren't being fair to the beneficiaries; what if some of your surveyors were caught cheating on the survey collection; What if on your first day your field staff decided to strike? "}, {"date": "31 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action in Dec 2018", "Interview Descriptions": "Skype interview, with basic qualitative questions about why you're interested in the job, what your background is in the field, etc. Followed by a 3-hour STATA test to see if you know the software well enough to use it on the job.", "Interview Questions": "Why do you want this job? ; Do you have experience with RCTs?"}, {"date": "30 Nov 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Innovations for Poverty Action (Nairobi) in Oct 2018", "Interview Descriptions": "The Interview Process took 5+ weeks, with responses after approximately 2 weeks. There are 3 stages of the interview:\r\n\r\n1. Written test. This includes a maths & logical reasoning test (25 mins) and a STATA test (1 hr 30  mins). STATA test includes data processing and data analysis qns.\r\n2. Oral interview-was with Research Manager, HR and one PI. Questions mainly on your previous job roles, interest and situational questions of the various challenges, you would encounter in your work and how you would deal with them. This was about 1 hour long.\r\n3. Phone interview with PI's. A lot of situational questions, your previous duties and your interest in the project/job. This took 30-45 mins", "Interview Questions": "Tell us how your previous experience has provided you with the skills for this job"}, {"date": "17 Sept 2018", "title": "Senior Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "1. Apply online\r\n3. I was given a case study to study and design a proposal for. I sent in the proposal via email, and was asked about it again during the interview.\r\n2. Interview with Manager, who asked about my experience and tested my quantitative skills\r\n3. Interview with Directors, who asked about my experience and what I would do in case-to-case situations", "Interview Questions": "What is your approach in working with government institutions?"}], [{"date": "8 Aug 2019", "title": "M&E Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Innovations for Poverty Action in Jun 2018", "Interview Descriptions": "I applied online. About a week later a recruiter reached out to me asking a few questions. I did an assignment which was to prepare a presentation and I had to do a 20 minute logic test. The total time for this was about 2 hours. The following week I then had an interview via video chat with the manager and recruiter, which was also about 2 hours. I was very impressed with the response and speed of the process up until after the interview, where I then was ghosted. Nearly 6 weeks after the interview and no one even bothered to email me to say that I had been rejected. It was a very positive experience with a sudden and extremely negative ending.", "Interview Questions": "What other jobs have you applied for?"}, {"date": "30 May 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action (New York, NY) in Apr 2018", "Interview Descriptions": "I submitted a common application, was contacted for an interview with HR, then the Research Manager, and then had a third interview with the Country Director after completing a written test.", "Interview Questions": "How would you describe an RCT to a child?"}, {"date": "16 Mar 2021", "title": "Field Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Kisumu) in Mar 2018", "Interview Descriptions": "The interview was much easy since it was written and this was fair because there was no favoritism during the process.\nIt was just one interview processes and the employer responded within 2 weeks", "Interview Questions": "Describe how you will handle a responded that doesn't consent to the survey "}, {"date": "18 Mar 2021", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (San Diego, CA) in Feb 2018", "Interview Descriptions": "Applied for the job online, got an interview scheduled after 6 weeks. Zoom interview with a group of PIs based in multiple locations and working on a project in West Africa.", "Interview Questions": "Standard questions about general interests in research and paper taken during Masters. "}, {"date": "26 Jun 2017", "title": "Data Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "The whole process was:\r\n1. Application submission\r\n2. STATA test (10 hours to submit) \r\n3. Skype interview\r\n\r\nThe final interview on Skype was probably the least important. As a data manager I imagine that they were mainly looking for technical knowledge on data cleaning, assimilating, analysing etc. on their preferred statistical package (STATA in this case). The Skype interview was just a run down to see if we were compatible, discuss salary, and other logistics. There was a couple of technical questions but if you passed the STATA test, it should be not a problem.", "Interview Questions": "What commands would you use to clean a dataset on STATA?"}, {"date": "1 Apr 2017", "title": "Voluntary Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "I had a skype interview for an unpaid position within IPA. The interview lasted 30 minutes and not any minute more. They asked me to introduce myself and explain why I chose IPA, and about data analysis and management projects I had done in the past. Then some questions on team working and how I would deal with situations in a developing country and more precise questions about my logistical skills. From the feeling I had they were looking for someone they couldn't pay (at all) to do the boring logistic job of the data collection process. Did not feel like there was anything to learn as an \"intern\" there. Such institutions should stop the 21th century of unpaid internship that recreate the inequalities of class.", "Interview Questions": "What do you think are the two main challenges of the position? Do you have experience in logistics, such as booking taxis etc? Do you have experience working on stata?"}, {"date": "30 Apr 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Lima, Lima Region) in Mar 2017", "Interview Descriptions": "The first round of interviews out of two. The interview lasted an hour and was done by skype. They asked me about what I knew about IPA and why I had applied to the job.  I was interviewed only by one person. Half of the interview was done in English and the other half in Spanish.", "Interview Questions": "Ask me about RCTs, why they are good for program evaluations."}, {"date": "3 Mar 2017", "title": "Policy Associate - Philippines Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Innovations for Poverty Action (Manila, Manila) in Jan 2017", "Interview Descriptions": "The WORST hiring process I had experienced. It took an aggravating 5 months to know their decision. From 1 online application, 1 phone interview, 1 face-to-face interview, 5 email follow-ups, 1 written exam (that has a 6-hour deadline), and 4 writing samples just to put you on a limbo. After all those months of correspondence, updating/emailing the person (who allotted their time and effort just to go through their hiring process) is just unprofessional. Mind you, this is an organization that \"discovers and promotes effective solutions to global poverty problems\", maybe they haven't discovered how to value other people's time and effort, or maybe this is just a cultural/social practice in the country that needs research.", "Interview Questions": "How do you explain RCT to policy makers or a government officials?"}, {"date": "16 Feb 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Nairobi) in Jan 2017", "Interview Descriptions": "I applied online,got a call after a week,it was a panel interview of two interviewers.Prior research experience is need.Confidence is key,one should know more about Ipa,and atleast be ready for situation based questions", "Interview Questions": "Tell us more about you"}, {"date": "10 Jan 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Kampala) in Jul 2016", "Interview Descriptions": "it was friendly, Open and transparent all through.\r\nIt started with the online application, followed by the invitation to the oral interview and background check then finally the offer. All this was done in a very clear manner.", "Interview Questions": "why should we hire you."}], [{"date": "10 Jun 2016", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "Skype interview, only a couple of days notice given, interview was made more difficult by low internet connection for skype however the 2 interviewers did not work in sync with each other so questions jumped about in logic, despite sending a follow up email I never received any response for them or any feedback on my interview.", "Interview Questions": "Favorite Stata command, strengths, weaknesses, challenges faced, justifying why they should give me this position when they normally offer it to candidates with more expereince"}, {"date": "22 Apr 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Innovations for Poverty Action (Manila, Manila)", "Interview Descriptions": "The whole process was online. The first interview was with a Senor Research Associate/Research Coordinator, which took me around 3 hours. Questions included my knowledge about IPA and J-PAL, randomized control trial (RCT) method, my field experience (doing surveys), my understanding of statistical matters (different types of variables), etc. Then I moved to the second round with a STATA test and a research design assignment. After the second round, I talked with the country director about some of my experience and expected salary. The final interview was with 3 Primary Investigators of the project that I later worked on. Questions mainly focused on previous research experience and data analysis (with the emphasis on quantitative methods: methods, economic models, STATA commands, etc). Other questions include my understanding of the region that I will have to relocate to and my willingness to travel. This one was approximately 45 minutes.", "Interview Questions": "What is RCT?"}, {"date": "29 Jun 2016", "title": "Field Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Innovations for Poverty Action (Nairobi) in Feb 2016", "Interview Descriptions": "alerted via phone for an interview.you can go but sometimes done via phone,a pannel of two asks questions.mostly about research on the field when collecting data,challenges on the field during data surveys and how you will react", "Interview Questions": "tell us about your self"}, {"date": "17 Jan 2016", "title": "Country Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "The interview process was a little messy and seemingly ad-hoc, but the people doing the interviews asked the right questions. There were several rounds, with each interview being with a person of greater seniority than the last.", "Interview Questions": "I was asked about financial management, project management, and understanding of randomised controlled trials."}, {"date": "28 Jan 2016", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Innovations for Poverty Action (Cusco, Cusco) in Jan 2016", "Interview Descriptions": "Very in depth interview about my past work experience in research. Asked for detailed examples of proceedings, instruments used etc.\r\n\r\nIf I had experience in field work, if I was comfortable working with many people in stressful situations.\r\n\r\nThey also asked me why I was interested in working with the specific research project I had applied to Intern for.", "Interview Questions": "Do you have experience writing and designing interviews?"}, {"date": "19 Oct 2015", "title": "Associate Field Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Innovations for Poverty Action in Oct 2015", "Interview Descriptions": "I sent my CV by email. I was interviewed by the research associate and field and data manager. Everyone was very friendly. The questions were about my skills in Excel and other statistical software. I did an attention to detail test on site, for three minutes, timed, after which I was given an exercise on Excel.", "Interview Questions": "What statistical analysis have you carried out?"}, {"date": "5 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Innovations for Poverty Action (San Diego, CA) in May 2015", "Interview Descriptions": "After submit the application, I got an Stata exercise to check data management and data cleaning skills. After this, I got an email to schedule an interview. My position is in the field, I had a Skype interview with my supervisor. It was only voice interview. She asked me about my previous experience, how much I am prepared for the position, team-work building experience. She also described me her expectations on me if I get the position.", "Interview Questions": "What skills can you bring into the team?"}, {"date": "17 Oct 2015", "title": "Summer(Field Based) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Innovations for Poverty Action in Apr 2015", "Interview Descriptions": "Interviewed a month after application. Received offers a month after interview. Interview itself is a 20-30 minute Skype conversation with the Research Manager and the Research Associate, more about how you can contribute (technical) than fit (behavioural/personality).", "Interview Questions": "What is your project management style?"}, {"date": "15 Mar 2015", "title": "Project Associate/Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "The interview was through Skype, since I am not living in America. It was the two research managers asking questions about the interview. They were easy to chat with. They were friendly people. But some of the questions really required background of RCTs/knowledge of development economics and some of the things that they are doing.", "Interview Questions": "How has your past research experience provide you with skills for this job?"}, {"date": "1 Apr 2015", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Innovations for Poverty Action (New Haven, CT) in Mar 2015", "Interview Descriptions": "Three stage process: 1.) Phone interview with two research analysts that had held this position in the past. This stage followed by 2.) a Stata test to demonstrate econometric analysis skills (likely to have test for relevant programs, such as SPSS or SAS), and finally, 3.) an interview with the Principal Investigator for the project to determine a good fit. I was contacted about 3-4 weeks after submitting my application, with a notification to move onto the second stage in about 10 days..", "Interview Questions": "How do your interests and background relate to the PI's?"}], [{"date": "11 Mar 2018", "title": "Field Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (Dhaka) in Feb 2015", "Interview Descriptions": "Excel  test and basic questions. Two people asking me about why i want to join, do i have previous experience and if i want to travel on field. As i was a women in a developing country they asked me a lot about if i'm really comfortable travelling outside the city everyday for field work", "Interview Questions": "how do you organize yourself"}, {"date": "18 Nov 2014", "title": "Multiple Positions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Innovations for Poverty Action in Oct 2014", "Interview Descriptions": "The interview process was disorganized to put it mildly. There were different recruiters contacting me for the same position at the same time, and the recruiters had no idea that the other had contacted me. There were \"phone screens\" (multiple for the same position), \"in-depth interviews\" that were not in-depth at all and \"brief chats\" that lasted 90 minutes. The impression I got was a highly undisciplined and unorganized organization, and most people in the organization had poor communication skills, which hindered my ability to understand what they wanted out of the position.", "Interview Questions": "How would you communicate an RCT to an audience? "}, {"date": "11 Sept 2014", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Innovations for Poverty Action", "Interview Descriptions": "3 interviews-- first a screening one to make sure I knew basic stuff about the work, then one with the director of the initiative, then a second one with the director. the first interview with the director was more in depth and tested some of my economics knowledge and knowledge of RCTs and development.", "Interview Questions": "I can't remember exactly but it was about RCT design and sampling/attrition. "}, {"date": "23 Feb 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action (Madrid) in Sept 2014", "Interview Descriptions": "It was a Skype interview for a field RA position in Asia. There were two interviewers who asked me questions in turn. They started with basic questions from why I applied for the position, and then moved on to questions like my knowledge about RCT, work experience, etc. All the questions were predictable ones. No surprise.", "Interview Questions": "How familiar are you with RCT?"}, {"date": "26 Aug 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Innovations for Poverty Action in Jul 2014", "Interview Descriptions": "One set of technical exercises, one phone interview, one in-person interview. Interviewed by three researchers with whom I'd be working. Process is very slow, with the interview separated by about a month. I'm still waiting on a final response.", "Interview Questions": "No unexpected questions. Some softball technical questions about statistical methods, but they didn't seem overly concerned with hearing exactly the right answers. Maybe this was because the completed exercises tested technical ability. Several questions to judge whether I'd be able to commit to the position: the hours, the contract term, etc. Specific questions about relevant experience I'd listed on my resume; clearly they had read my resume before the interview. Follow up communication was useful and transparent, and they are apologetic about the slow process."}, {"date": "22 Apr 2014", "title": "Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "I applied online via the JPAL/IPA common application. Everyone was very friendly, but the hiring process was very disorganized - it felt completely ad hoc. I had many many interviews (10+) with, often, the same people again, but in different combinations. This negatively affected my impression of IPA's administration. The marginal added value of each interview just plummeted, and - at each stage - I was given the impression that *this* was the last stage.", "Interview Questions": "What's your management style. "}, {"date": "20 Jul 2015", "title": "Project Associate/Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Innovations for Poverty Action (Washington, DC) in Apr 2014", "Interview Descriptions": "I went through the first round and the Stata test before they finally asked me whether I was a Pakistani national. I had always indicated that I was a US national with no other work authorizations. They then told me that the role was only open to Pakistani nationals, and the process ended there. I was very frustrated because it seemed like they had wasted my time.", "Interview Questions": "Are you a Pakistani national? [asked in an email after the process had begun]"}, {"date": "6 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Innovations for Poverty Action (Lima, Lima Region) in Jan 2014", "Interview Descriptions": "The interview was conducted by Skype as I was not in the country of the workplace. I answered general questions about what I knew from IPA and Randomized Control Trials. Then I was sent a STATA test and a case study to design a RCT.", "Interview Questions": "Have you already worked with STATA?"}, {"date": "1 Sept 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Innovations for Poverty Action", "Interview Descriptions": "I was contacted a week after the application deadline after which I spoke to a Senior Project  Associate. The interview was very straightforward- I was asked about my interest in the position, my knowledge of RCTs, and a few questions about the particularities of the initiative.", "Interview Questions": "How would you describe RCTs to your roommate?"}, {"date": "5 Aug 2013", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Innovations for Poverty Action (New York, NY)", "Interview Descriptions": "I received an offer to interview for this position, based overseas, several months after applying via a common application for all IPA and JPAL positions. The first step was a phone interview with two of the team members - 85% was in English, 15% in French as that was to be the working language for the assignments. Following that, another phone interview was then scheduled with the organization's Managing Director. At the final stage, I met with the President in person but that was more for of a meeting and less of an interview as I had essentially already received the offer.", "Interview Questions": "No questions were really unexpected, though I was not informed portion of the first interview would be in French. It presented no problem, however. \r\nThe most difficult questions were generally those testing technical knowledge (sample size, randomized controlled trial methodology and rationale, etc.) but these were not as specific or pointed as they could have been."}], [{"date": "29 May 2013", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action in Apr 2013", "Interview Descriptions": "I was first contacted by email. I responded quickly, and the position's incumbent took a little while to get back to me with a confirmation. \r\n\r\nThe interview was not really an interview. It was two questions posed to me (a question and a followup), and then the incumbent talked about her own accomplishments for 30 minutes. She spoke very quickly, almost incomprehensibly, and judging by what she spoke about, she seemed more preoccupied with her own achievements and future than either how my qualifications could fit that role or even the job itself. It was a waste of time, and her behavior negatively reflected on IPA.\r\n\r\nAfter the interview, I sent a \"thanks but no thanks\" note.", "Interview Questions": "What is the largest difficulty you have in your current role?"}, {"date": "10 Jun 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Innovations for Poverty Action (New Haven, CT) in Jan 2013", "Interview Descriptions": "I interned with the research team for a few months; transitioned into the main team; before interning the Country Director called me. We discussed my skills in statistical programming, previous field experience, etc.", "Interview Questions": "Specific questions on data management and do files in STATA"}, {"date": "9 Mar 2016", "title": "Field Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Innovations for Poverty Action (Kakamega) in Aug 2012", "Interview Descriptions": "Lasted two weeks, interviewed by two senior officers. Was called after applying in person, the feed back turnaround took a while, accepted the job offer. The process was quite transparent, well qualified candidates selected.", "Interview Questions": "Salary, about the role"}, {"date": "15 Dec 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Innovations for Poverty Action (New York, NY) in Aug 2012", "Interview Descriptions": "There were two principal investigators and I got interviewed by each them in separate interviews. Then I got a third interview from the Human Resource person. Similar questions were asked by all three.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "31 Aug 2013", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Innovations for Poverty Action (Manila, Manila) in Apr 2010", "Interview Descriptions": "The interview process took about two months and involved three phone conversations: One with a Country Director, one with a Project Coordinator and one with someone from HQ. There was also a written test. They asked for three references. I applied through the online common application in January and was contacted several months later.", "Interview Questions": "Explain all of the steps of an RCT."}, {"date": "25 Oct 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Innovations for Poverty Action (Washington, DC) in Mar 2010", "Interview Descriptions": "Phone interview and 6 hours' worth of additional supplemental hiring prompts that I was given 24 hours to work on, comprising of writing a budget plan and a strategic position and plan.", "Interview Questions": "Are you comfortable with living in an isolated location?"}, {"date": "19 Jul 2013", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Innovations for Poverty Action in Jan 2009", "Interview Descriptions": "Interviewed over the phone with the country director who managed the projects in the country where I would be posted and later interviewed with the head of the organization. We only did phone interviews. I was surprised that I was hired without ever meeting anyone in person!", "Interview Questions": "Was asked about my cultural background and language skills as this was seen as invaluable working with local communities."}]]