[[{"date": "11 Jul 2023", "title": "EIR (Entrepreneur In Residence) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "The process was exceptional in every way. The professionalism, expertise, and passion of the panelists, coupled with the inclusive and dynamic culture of the organization. impressed by the panel's commitment to inclusivity and diversity. They emphasized the importance of fostering an inclusive environment that values diverse perspectives and backgrounds.", "Interview Questions": "If you could solve any problem, what will it be and why ?"}, {"date": "10 Jul 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Boston, MA) in Jun 2023", "Interview Descriptions": "Long process, I had one phone call, one zoom interview and 5 in person interviews, two assessments. The panel was friendly, the culture was welcoming too. The interviewers typically consist of members from the department or program the candidate would be coordinating. The interview begins with a warm greeting and an opportunity for the candidate to briefly introduce themselves. The interviewers then delve into the candidate's professional background, asking questions about their previous experience in program coordination, event planning, and project management.", "Interview Questions": "What would you tell MIT student to convince him of the program."}, {"date": "19 May 2023", "title": "Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT (Boston, MA)", "Interview Descriptions": "The work interview at MIT was an incredibly engaging and insightful experience. The interviewers demonstrated a deep understanding of the field, asking thought-provoking questions that challenged me to showcase my skills, knowledge, and potential. Their professionalism and expertise made it a truly valuable opportunity for personal and professional growth.", "Interview Questions": "Tell us about yourself and your background. Why are you interested in working at MIT? What specific skills and qualifications do you bring to this position? How does your previous experience relate to the role you are applying for? Describe a challenging project or situation you faced and how you handled it."}, {"date": "4 Jun 2023", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in May 2023", "Interview Descriptions": "Positive experience overall. The team was very friendly and open about my perceived strengths and weaknesses, and we were able to discuss them in detail. The process felt very fair.", "Interview Questions": "Asked about my fundraising experience"}, {"date": "29 Apr 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "In person interview with Professor at his office. Asked about my experience in the class topics and previous teaching and working with students experience. Discussed the logistics of the course, expectations and hours. Overall very good experience and I was briefed on what the job would entail.", "Interview Questions": "Previous experience teaching classes and working with students"}, {"date": "30 Mar 2023", "title": "Visiting Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT (Boston, MA)", "Interview Descriptions": "Phone call interview with the lab instructor to understand your interests and explain lab needs. You will then work on getting your paperwork done to visit the USA. Their teams are very efficient and the process is easy!", "Interview Questions": "What are your research interests?"}, {"date": "23 Mar 2023", "title": "Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Very straightforward nothing out of the normal of why would you like to work here. Lasted all of 15mins from start to finish. I did decline offer, but would consider another position", "Interview Questions": "Why do you want to work here"}, {"date": "20 Mar 2023", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "Great interview process, people were very kind, environment was very welcoming, facilities were very clean and inspection ready, and overall had a great time with the hiring team and the people in general", "Interview Questions": "In 30 words or less, tell me about yourself?"}, {"date": "14 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Submit the CV to the application system. Indicate several professors you'd like to work with. And the professors who are interested in you will send interview invitations. Interview basically involves chatting about research experience.", "Interview Questions": "Tell me about your research projects."}, {"date": "27 Feb 2023", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Phone interview direct and to the point, they were very friendly and intellegent with their questions and approach to the position. It was a very smooth conversation and seemed to be full of good information about the role and expectations for the perfect candidate to fill this position at MIT.", "Interview Questions": "Past experience, priority engagements were a critical focus"}], [{"date": "16 Feb 2023", "title": "Master Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "I met with one prof and he asked both tech and behav questions. I first introduced myself and the past research experiences. Then he asked some details about the research I did.", "Interview Questions": "Introduce yourself and your past experience"}, {"date": "9 Feb 2023", "title": "Research Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Several phone interviews and a fly out that involved a presentation and full day of in person interviews. My travel and accommodations were covered. I think the timezone change added an extra layer of difficulty. But ultimately I think this was pretty standard for an academic interview process.", "Interview Questions": "How will you handle lab members that are hard to wrangle or organize?"}, {"date": "10 Jan 2023", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Varies dependent on boss. Can be easy, but can also be difficult. Should prepare thoroughly beforehand. Reading research summaries, abstracts of recent publications, and maybe even full publications in areas of interest.", "Interview Questions": "Research interests in the past and future"}, {"date": "21 Feb 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at MIT (Cambridge, MA) in Jan 2023", "Interview Descriptions": "Was emailed a few days after applying. Had time set up, and had an interview over Zoom. HR wants to hear why you're the best, and will make you feel like you probably aren't if you're not meeting their expectations.", "Interview Questions": "Standard questions such as \"tell me about yourself,\" and \"where do you see yourself in 5 years.\""}, {"date": "28 Nov 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "They have multiple interview stages with other researchers and practitioners to check on your research qualification, research interests, personal character, funding situations, etc. The whole process takes about a month.", "Interview Questions": "Q: Tell us about your recent research topic Q: What do you want to research at our lab. Q: Why our lab? Q. What can you contribute?"}, {"date": "15 Nov 2022", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Contact hiring professor, and interview directly with professor. Questions are based upon the current needs of the project. Employment is determined based upon the qualifications of the individual and fit in the group.", "Interview Questions": "Does this project interest you, and what do you expect to do after this job?"}, {"date": "9 Dec 2022", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT in Nov 2022", "Interview Descriptions": "Recruiter screening then meeting with committee/hiring manager. Phone screen was fine, interview seemed to go well then was ghosted for a month and a half to both positions applied for. Second position the person clearly was not interested in the fact I did not work at an Ivy League institution currently and seemed to dismiss me from there. First position I was not a diverse enough of an applicant..", "Interview Questions": "Why should we hire you to work at MIT?"}, {"date": "24 Oct 2022", "title": "Machine Learning Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Was straight forward, had take home assignment and also a personal code sample to show. Lots of interesting chats with research scientists working on challenging problems. Great opportunity to help build tooling along with possibly getting published", "Interview Questions": "Identify errors in a coding sample"}, {"date": "22 Oct 2022", "title": "PhD Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "The departmental interview is just one round with three interviewers. In my case only one professor is really close to my research but that almost happens to everyone because not all professor you have on your list will be available. The professor who's working in my field asked more technical questions and details about my past research project, whereas two other professor mainly chatted me through their life experience and why they think MIT is a good place to go.", "Interview Questions": "Tell me about yourself. Tell me about your research interests. Why do you want to do a PhD?"}, {"date": "22 Aug 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "There isn't one, I'm just forced to write a review to get on here. No calls or zooms or whatever. I did some phone calls to get a sense of some of the professors and their labs but it wasn't mandatory.", "Interview Questions": "Why do you demand that people pointlessly do this when they don't have useful input?"}], [{"date": "20 Aug 2022", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at MIT", "Interview Descriptions": "All day informational interviews with all the lab mates. Took most of two days. Meet with the PI at the end. Gave a talk. In general chill but stressful. Meet lots of good people", "Interview Questions": "What do you want to do in the lab?"}, {"date": "4 Apr 2023", "title": "Science Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Aug 2022", "Interview Descriptions": "One phone screen, one zoom interview with the hiring manager, one all-day in-person interview with faculty members and different departmental officers, as well as follow-on interivews via zoom for other departmental officers who were not available that same day. Did not receive a rejection email.", "Interview Questions": "How would you communicate complex biomedical concepts to a general public?"}, {"date": "12 Jul 2022", "title": "Technical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "Phone interview with PI, then phone interview with post-doc. Very friendly and interested in what I wanted to do afterwards. Supportive of my professional future. Got the offer and started within 2-3 weeks.", "Interview Questions": "What do you want to do after MIT?"}, {"date": "6 Jul 2022", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Long interviews with many folks plus usually starts with HR for salary screening. After that, you will be interviewed by 2 teams with at least 3 people on each committee.", "Interview Questions": "Lots of situational questions so think about those before showing up."}, {"date": "4 Nov 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Jul 2022", "Interview Descriptions": "The process entailed 3 interviews as follows: [1] quick informational zoom meeting spanning approximately 20 minutes with assistant and team lead [2] second extended zoom interview lasting around 1.5 hours focusing on a 25 minute presentation with Q&A from all staff and team leads [3] final round in-person interview with team lead and executive director lasting around 1.5 hours.", "Interview Questions": "Tell me about yourself. What is your least favorite part about large scale event planning? How do you incorporate a DEI lens into your work?"}, {"date": "22 Jun 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Phone interview within a day of applying and then offered an in person interview two weeks after. I attended the interview which I think went well and they asked me to complete a task within 4 days. Submitted the finished task and they completely ghosted me, no feedback or even a polite decline email. My request for an update was ignored. I will not be applying at MIT again.", "Interview Questions": "Why do you want to work for MIT specifically?"}, {"date": "14 Jun 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "The interview process took several weeks, though the time of year could have impacted this. I had a total of 4 interviews over the length of the hiring process. Approximately every two weeks until the offer.", "Interview Questions": "Questions based on previous higher education experience "}, {"date": "1 Jun 2022", "title": "HR Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Very easy!  Phone screen first, then two rounds.  Only hitch was that they could not be flexible on dates.  I found the process very simple and I was well taken care of during the course of the interview day.", "Interview Questions": "What appeals to you about working at MIT?  What is appealing about our mission?"}, {"date": "25 Oct 2022", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at MIT (Cambridge, MA) in Jun 2022", "Interview Descriptions": "It was a good interview. They focussed mostly on my research skills and conceptual knowledge related to the proposed research work. They asked many questions related to experimental work. Then, at the end questions were asked from motivation for the PhD position and future scope after PhD.", "Interview Questions": "What is your motivation to this PhD position?"}, {"date": "11 Feb 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT in Jun 2022", "Interview Descriptions": "Consisted of 3 interviews: zoom call for an initial screen, 1-hour presentation to all staff followed by specific interview , meeting with executive director and tour of office. Emphasis on presentation skills.", "Interview Questions": "Asked to present on a large scale event"}], [{"date": "6 May 2022", "title": "Archivist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "It was a difficult interview, and I did not get the job. It was a great learning experience for what I needed to be better prepared to answer. I wish I could go back in time and redo it!", "Interview Questions": "How do you see yourself fitting in with the team."}, {"date": "2 Aug 2022", "title": "Senior Internal Auditor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in May 2022", "Interview Descriptions": "Scouted by a recruiter who set up preliminary interview. Company requested formal application to be completed on website and set up final interview and skills testing. \nOnline application was by far the most intuitive and painless application process I've ever experienced.", "Interview Questions": "Why are you interested in this position? "}, {"date": "31 Mar 2022", "title": "UROP (Student Researcher) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "I visited the Media Lab and the interview was conducted inside the hiring manager/head researcher's office. The entire interview took about 30 minutes where they gave me an overview of the position and briefly looked at my resume.", "Interview Questions": "Q: Tell us about yourself."}, {"date": "2 May 2022", "title": "Marketing Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Apr 2022", "Interview Descriptions": "I spoke with a panel of 6, each asking a different question. The questions were elaborate and required me to speak about past accomplishments as well as future endeavors. Interviewers were nice, but intense.", "Interview Questions": "How can you relate to the current students body at MIT, and how would you craft a marketing campaign around them?"}, {"date": "24 Mar 2022", "title": "Operations Supervisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MIT in Feb 2022", "Interview Descriptions": "2 virtual interviews followed by an on-site interview. An on-site interview was a half-day interview with various people in different positions/roles within the department including personnel in a senior management role.", "Interview Questions": "What is your strength and weakness"}, {"date": "1 Feb 2023", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Feb 2022", "Interview Descriptions": "great! thorough questions and logical expertise. showed lots of command and respect for the outlook. the interviewer showed me respect and made sure i was comfortable in the environment. would definitely go back and interview again.", "Interview Questions": "what was it that you did in school?"}, {"date": "20 Jan 2022", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Took 2 months from first interview to decision, not much communication between steps during the process, had to reach out for updates. 3 rounds, first with hr for phone screen, hour meeting with the hiring manager, then met with 3 faculty members for the last round.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Jan 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Jan 2022", "Interview Descriptions": "I chatted with the professor, and he gave me an informal offer. Discussions were about my previous research projects, and he asked me some questions. The process was smooth and pleasant.", "Interview Questions": "Why do you think you are a good fit in my lab?"}, {"date": "23 Apr 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Jan 2022", "Interview Descriptions": "In fact, I think they had already decided to give me an offer before the interview. So the interview is quite easy, just about the research I did. And it was a phone interview.", "Interview Questions": "What did I do during my summer research"}, {"date": "10 Dec 2021", "title": "Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT", "Interview Descriptions": "The whole process went on 3 weeks.  First round HR, asked basic research background and skills. 2nd round, panel interview by hiring manager, went through the coding of a machine learning project. 3nd round individual interview with the group members. One of the interviewer was very rude unprofessional. Crudely challenged my research is useless. Every researcher needs to respect for other's work. It is lucky I didn't get the offer and don't have to work with such person as a team.", "Interview Questions": "machine learning\r\nSQL\r\nPython dataframe\r\nexpected salary\r\nwhy MIT"}], [{"date": "20 Oct 2021", "title": "Technology Licensing Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Phone screen with someone in human resources.  Then interview with hiring manager.  Then multiple separate interview with people in Technology Licensing Office that I would be working with more or less closely.", "Interview Questions": "Explain how your experiences help prepare you for this job?"}, {"date": "19 Oct 2021", "title": "Technical Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "It was pretty good. They asked me to create a powerpoint presentation. During interview, I presented that and additionally, asked some questions on how I would solve certain problems (like how you would set up the experiment).", "Interview Questions": "Don't recall but they asked how would I set up an experiment to get certain data."}, {"date": "28 Sept 2021", "title": "EHS Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at MIT", "Interview Descriptions": "The interview process was pretty simple overall. It was all through a phone call and I did not feel blindsided by any of the questions. It was straight forward and pretty short.", "Interview Questions": "What you are most interested in about the job "}, {"date": "9 Sept 2021", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Went well they were polite, I got the job. \nIt doesn't feel intimidating they feel very friendly towards you and speak to you like a friendly way. I did feel nervous at first but it wasn't difficult to speak to them.", "Interview Questions": "Did you have any issues in your last job?"}, {"date": "19 Jan 2022", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at MIT (Boston, MA) in Sept 2021", "Interview Descriptions": "Very solid. Lots of stages, but for the purpose to ensure that you're passionate about the job and will work well with multiple parts of the team. Would recommend reading into the projects they've funded and brushing up on your experience with fundraising development.", "Interview Questions": "What does development mean to you?"}, {"date": "25 Jun 2021", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "I had a great time talking with my research supervisor. They were very thorough about the work we are going to do. I was really excited to start! I worked there for a semester.", "Interview Questions": "What is your previous research experience?"}, {"date": "10 Jun 2021", "title": "Administratitve Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Fair and thorough interview process. It was just really long and drawn out, it could be shortened to make it faster so there is less time waiting for the position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jun 2021", "title": "Human Resources Coordinator (HR Coordinator) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "4 rounds of interviews.  A phone conversation, interview with hiring manager, interview with team, interview with department chair. Took over 2 months between applying and hearing back. After the two month period I was told they would go with an internal candidate.", "Interview Questions": "Tell me about your past experience."}, {"date": "14 May 2021", "title": "UROP Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "easy interview, friendly professor and teammates to talk with easy interview, friendly professor and teammates to talk with easy interview, friendly professor and teammates to talk with easy interview, friendly professor and teammates to talk with", "Interview Questions": "I don't remember exact questions"}, {"date": "17 Jul 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in May 2021", "Interview Descriptions": "The interviewer asked about my past coding experience and the projects that I've done. He also gave me some details of the current research project and asked me some questions regarding it. Most importantly, he made sure that the project will tally with my interest and also asked for my time commitment to it. The interview was 30 minutes and was quite enriching for me.", "Interview Questions": "Tell me more about yourself."}], [{"date": "1 Apr 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "It was a phone interview. Followed by three in person interviews. The first was with the staff team and peers, once I passed that, I interviewed with the program director, and after that I interviewed with the assistant dean.", "Interview Questions": "What makes you want to be part of this team? "}, {"date": "12 May 2021", "title": "Senior Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MIT (Boston, MA) in Apr 2021", "Interview Descriptions": "From applying to getting a rejection letter, the whole process took over 3 months. I knew it would be intense and long, even for a position that's not very high up in the grand scheme of the school. I had two interviews, one with a recruiter and then a full, 3.5 hour interview with the hiring team. It was a fabulous interview and intimidating in length, but a friend who'd recently gotten an entry level job there said she'd had 4+ interviews including some where she'd had to give a presentation. I got on really well with the team and felt like it was one of the best interviews I'd ever had. The HR partner was upfront about timeline and what to expect. Even though rejections happen, I was hugely disappointed when I finally received word back a week late. After all of that they just sent a short, stock letter type email instead of even giving me a call, with no explanation even though I had 4+ years of experience in the same industry and a very similar role. They just said there was someone better. Standard for interviews, but very disappointed in how poorly they communicated in the end, especially since I made two polite follow ups to ask for feedback and what made the difference with going with someone else! They're pretty rude and just ignored me once they'd decided I wasn't the one.", "Interview Questions": "When you receive a project, what do you start working on first? "}, {"date": "30 Apr 2021", "title": "Technical Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Richardson, TX) in Apr 2021", "Interview Descriptions": "Pretty smooth. First, they gave me details about the position and the responsibilities involved, followed by questions. Several lab members took my interview. They were very sweet and I enjoyed talking to them all.", "Interview Questions": "What's your long term goal?"}, {"date": "29 Mar 2021", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Process was straight forward! 3 rounds of interview then received an offer. Competency interview (with a business case), behavioral interview, and last round was a pannel interview, speaking with the entire team, and getting to know them", "Interview Questions": "Tell me about yourself\nwhy MIT?\nOther questions based on business case"}, {"date": "16 Apr 2021", "title": "Human Resources Administrator for Center for Transportation & Logistics Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Boston, MA) in Mar 2021", "Interview Descriptions": "Head of the department reached out to me over the weekend to schedule an interview for Monday. Got the invite less than 24 hours in advance which is not terrible, but still a red flag. \r\n\r\nI had an hour long zoom interview. The interview itself was easy, discussed my professional background and the opportunity. Nothing difficult.\r\n\r\nI was supposed to hear back at the end of that same week, however that didn't happen. So I assumed that I was not selected for this role.", "Interview Questions": "- Tell me about yourself\r\n- Why do you want to work here\r\n- This is a 6 month position. Are you okay with that?\r\n- General questions "}, {"date": "25 Jan 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "I had a great experience with the team and they were very communicative throughout the entire interview process. The interview was divided into three separate rounds. Most of the questions were things I expected to be asked based on the role and the full job description.", "Interview Questions": "Can you please tell us about yourself and your experiences related to this position?"}, {"date": "15 Jan 2021", "title": "Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Initial pre-screen call followed by four rounds of zoom interviews with increasingly senior staff. All very friendly and welcoming. Made it to next to last round of interviewing. Received great understanding of position and office structure.", "Interview Questions": "Tell me more about your projects and experience."}, {"date": "15 Jan 2021", "title": "Senior Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "IT was quick and very technical. I had to write pseudo code and whiteboard the design and architecture topics and questions. There were two people in each panel and two rounds.", "Interview Questions": "About Core Java, Spring & Hibernate"}, {"date": "4 Jan 2021", "title": "SAM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "It was just one interview that was less than an hour. I did a video call because I was not in the area. I was called a few weeks later with an offer", "Interview Questions": "Tell me a little bit about yourself "}, {"date": "6 Mar 2021", "title": "Phd Student Researcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT in Jan 2021", "Interview Descriptions": "First you submit your application via MIT grad website by December 1, then if selected for an interview they will contact you via email. Interview invite was sent out late January. You are interviewed by 3 people in the program, 1 professor, 1 lab tech, and 1 current student. Interviews are 20 minutes long and conducted over Zoom. Final decisions were sent late February for the program.", "Interview Questions": "Most of the time was spent discussing what I was interested in researching. A little bit of information also about my background. That was it. "}], [{"date": "2 Mar 2021", "title": "Research Assistant III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT in Jan 2021", "Interview Descriptions": "Standard, they asked me typical questions like my relevant experience, if i'd be available, they explained working under COVID and their timeline for coming off of remote work, etc. I asked them a lot of questions as well regarding the position, their research, the project they'd been working on, etc. It was actually a fantastic interview, I followed up with a thank you email, I had very similar previous experience...but in the end they wanted someone with more experience (typical) and told me so in an email that addressed me as Morgan or some other name that's wildly different from my own. At least they doubled back and apologized for that, but the rejection still was for me.", "Interview Questions": "Tell me a little about yourself"}, {"date": "18 Dec 2020", "title": "Undergraduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "The interview went very smoothly and I was given thorough explanations of the tasks I will be performing. They also gave me a lot of info on the culture of the lab I was applying to.", "Interview Questions": "Describe your past research experiences"}, {"date": "17 Feb 2021", "title": "Financial Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Boston, MA) in Dec 2020", "Interview Descriptions": "It was questions that encompassed on the spot thinking. Some were concerned with covid-19, others about my interest. It was via Zoom. Only lasted around 15 minutes; it was labeled a screening.", "Interview Questions": "How is covid-19 affecting the workplace?"}, {"date": "5 Oct 2020", "title": "Student Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at MIT", "Interview Descriptions": "I submitted a paper form and an informal transcript showing that I had taken the class I wanted to grade. The math department accepted the form and hired me as a grader.", "Interview Questions": "What were your grades in the relevant classes?"}, {"date": "13 Oct 2021", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at MIT in Sept 2020", "Interview Descriptions": "The different stages of the process included: \nPhone Interview, followed by a Zoom Interview with search committee.\nFinally, there was a full day interview with presentation and meeting with different teams\nFinal 30-minute interview with  director", "Interview Questions": "Tell me about your experience advising students?"}, {"date": "25 Jun 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at MIT", "Interview Descriptions": "The process was challenging. Make sure you know what the research group does and  can demonstrate that your prior knowledge will be useful to the group. Be courteous to the Professors and always follow up with an email after your interview to reiterate your interest.", "Interview Questions": "Background research experience "}, {"date": "19 Jan 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at MIT (Cambridge, MA) in Jun 2020", "Interview Descriptions": "As part of their MBA interview process, I was asked a series of behavioral based questions ranging from working under pressure, leading a cross-functional team, conflict with a boss, short to long term goals. The interview lasted for about thirty minutes. She was very professional, patient. I received the status of my application within twenty-four hours after the interview", "Interview Questions": "How do you work under pressure"}, {"date": "4 Jul 2020", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at MIT (Cambridge, MA) in May 2020", "Interview Descriptions": "Virtual interview for 30 min, including a short presentation, PI was very friendly. Got an email offer after I followed up in the third week.\r\nI found the position by direct emailing to PI.", "Interview Questions": "Detailed info about my past projects.\r\nResearch interests."}, {"date": "20 Apr 2020", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Phone call and then on site interview. 1 hour presentation about your previous research and multiple 30 min one on one meetings. The process takes weeks. Then go through HR.", "Interview Questions": "Previous research"}, {"date": "10 Mar 2020", "title": "MFIN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "30min Skype interview + 15min quant test. \r\nall behavior questions. focus a lot on your resume. So be prepared. \r\nquant test is pretty easy. knowledge of basic linear algebra and probability is enough", "Interview Questions": "Why do you choose MFin? "}], [{"date": "19 Feb 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Boston, MA) in Mar 2020", "Interview Descriptions": "There were three phone calls asking about previous research experience, and interest in the subject. One was with the PI. The other phone call was with another member of the lab.", "Interview Questions": "Give details about your organization in your research. "}, {"date": "28 Mar 2021", "title": "Project Archivist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Feb 2020", "Interview Descriptions": "I applied online through the university's portal.  After receiving an invitation to interview, I met with two members of the archives staff at Hayden Library in Cambridge. I believe that the interview took about 45 minutes.  Both interviewers were friendly and professional.", "Interview Questions": "For the most part, they asked about my previous experience with archival processing.  Due to the specific nature of the project, they also asked about my ability to read music. "}, {"date": "16 Jul 2021", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at MIT (Boston, MA) in Jan 2020", "Interview Descriptions": "The interview process is kind of informal, with no real channels to get to cool research. You have to know or reach out to some professors in order to really get going.", "Interview Questions": "What were my past projects?"}, {"date": "21 Nov 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Meeting with a professor, postdoc or professors are rather informal. Sometimes there are UROP postings online that give details about what the lab is looking for, but there is definitely merit to approaching professors personally or via email.", "Interview Questions": "What do you want to do after undergrad?"}, {"date": "12 Feb 2021", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at MIT in Nov 2019", "Interview Descriptions": "Phone interview with PI's. 30 minute presentation on a previous project with ~30 minutes of technical question and answering session followed by introduction to existing project. Have seen others also give an hour long seminar at group meetings.", "Interview Questions": "What was the key difficulty you had to overcome for this project?"}, {"date": "6 Feb 2020", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Boston, MA) in Oct 2019", "Interview Descriptions": "Kind interviewer, we had a nice technical discussion. Then advanced questions on algorithms and data structures using a programming language like design a balanced tree, questions on complexity and programming exercises", "Interview Questions": "Design a balanced tree "}, {"date": "4 Sept 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Very easy, meeting with the professor and discussing a bit about the course description and prior experience. It helps if you know the professor beforehand. Values going to prior office hours or engaging in the class.", "Interview Questions": "Asked about main topics from the course, grade obtained in course, prior experience, etc. "}, {"date": "20 May 2020", "title": "Program Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Sept 2019", "Interview Descriptions": "Virtual hour-long interview with 2 people, then a day-long interview with staff and students. Everyone was very kind and easy to talk to. Took 4 weeks to hear back that they had selected someone else.", "Interview Questions": "How would you engage MIT students?"}, {"date": "18 Aug 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Submit CV to all potential PI, Some may reply and ask more detail about your bg. If they find a good match, they will either make a skype call or invite you to meet on site (in their office). The meetings are quite different depending on profs. Most people will ask some general questions in their field and ask what your interests are.", "Interview Questions": "Why do you want to join our research group"}, {"date": "30 Jul 2019", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Was asked some technical questions  and general experience. Everything done through Skype. Interviewer is my future  direct supervisor,  is very knowledgeable and kind. Questions asked are relevant to the job.", "Interview Questions": "What projects have you worked on"}], [{"date": "28 Jun 2019", "title": "Email Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "The process from online application to initial phone screen took almost 2 months. Recruiter on phone interview did not give a background or greetings, just jumped right into a bunch of (about 10)tough behavioral questions that has nothing to do with the actual job responsibilities. Felt like I was being interrogated. Zero interaction, no feedback or anything before jumping to the next questions. It was obvious that questions are from a list and recruiter was reading one after another without really paying attention to my answers. Overall was a very dull and unprofessional phone interview.", "Interview Questions": "10 tough behavioral and personality questions."}, {"date": "23 Jun 2019", "title": "Multiple Positions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "The interview process included several multiple round, multiple hour interviews which included multiple employees at various levels. Two of the positions either never got back to me and position has been posted over a year later or took weeks to follow up.", "Interview Questions": "Why do you want to work at MIT?"}, {"date": "18 Jun 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Process took 5 months, 6 interviews - 3 phone interviews, 3 in-person. Very tough if you are currently employed for not being a supervisor/manager role. Process was very long to not get it.", "Interview Questions": "Very specific situational questions."}, {"date": "28 Mar 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT", "Interview Descriptions": "3 interviewers, a list of questions....scenario questions “how would you react....”    “Give an example....”\r\n\r\nThen I was asked if I had any questions, which I did, interview ended. \r\n\r\nOverall pleasant, professional interview, not intimidating.", "Interview Questions": "Give an example .... "}, {"date": "8 Feb 2019", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "In person,  I felt  the organization was only interested in non-diverse clones of  what’s already there -  I regret bothering to go in to meet them.   I really wish they were more open about  The unwritten attributes they expect in employees it would’ve saved me time.", "Interview Questions": "N/A"}, {"date": "9 Jan 2019", "title": "Signal Processing Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Lexington, MA)", "Interview Descriptions": "Interviewed for an entry signal processing engineer position. \r\nCame in around 9:00am. Waited for a few minutes in front lobby while they gave me a security pass and called the HR coordinator. When the coordinator came, she took me in and walked me to my first interviewer. Ended up interviewing with 4 individuals, and then had lunch with a couple other folks working within the same group. Finished up around noon or 1:00pm. \r\nAll in all it was a pleasant experience and I enjoyed speaking with everyone. I thought the interview went really well, but I didn't end up getting the job.", "Interview Questions": "Tell me about this course you listed on your resume.\r\nTell me why you decided to study signal processing. What is it that excites you about signal processing, and why do you want your work to be focused on this."}, {"date": "14 Nov 2018", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MIT", "Interview Descriptions": "There was phone interview and I got an offer for on-site interview. There were a lot of technical questions  during presentation.  It was not that difficult tho.", "Interview Questions": "what is your strength.. during phone interview "}, {"date": "17 Nov 2018", "title": "Postdoctoral Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at MIT in Sept 2018", "Interview Descriptions": "I applied the position through sending the professor my resume.  The interview is arranged three days later through Skype.  I gave a presentation about my PhD study and we had discussions on my research.  He asked a lot of questions and tried to understand what I am doing in my research.", "Interview Questions": "What is your career plan?"}, {"date": "10 Jul 2018", "title": "Senior Research Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "I sat down with the PI and discussed my resume, education, and past work experience. Overall, the process was very informal, and I heard back from the lab within a week.", "Interview Questions": "Why are you interested in this position?"}, {"date": "9 Jul 2018", "title": "Visiting Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "It was an in person interview which was thoughtful and an interesting conversation. Nothing particularly insightful to say about it, it was a straightforward interaction, as such interviews ought to be.", "Interview Questions": "What do you intend to work on while here?"}], [{"date": "20 May 2018", "title": "Senior Reactor Operator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MIT (Cambridge, MA) in May 2018", "Interview Descriptions": "Applied online, had a phone interview within the month, and was invited up two weeks after that. Throughout the process, the emphasis is on finding out if you know your own strengths and weaknesses. For the former, describe times when you used them; and for the latter, what did you learn from it / how have you improved. Other parts of the interview were professional (ascertaining you had the appropriate background) and personal (hobbies, workplace/area culture) in nature. Included lunch and a tour of the facility.", "Interview Questions": "Describe a time when you were asked to work outside your job description responsibilities. "}, {"date": "5 Apr 2018", "title": "Senior Reactor Operator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "First did a phone interview where there was typical STAR type questions.  Only a few questions about nuclear power in general terms.  Face to face interview consisted of a facility tour, face to face interview with 4 others, lunch, talk with HR and two other members of the staff.  Overall very friendly.  Mostly just asked about past experiences and other typical STAR type questions.  Asked several times to describe my own weaknesses.  No POSS tests required.", "Interview Questions": "What would your current manager say is something you could improve upon?"}, {"date": "6 Sept 2018", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Apr 2018", "Interview Descriptions": "It was a very relaxed 10 minute conversation. We mainly talked over some of the things on my resume. She was very delighted to hear that I was interested in education. She then spent most of the time telling me about the project that I would work on.", "Interview Questions": "Tell me why you are passionate about education."}, {"date": "17 May 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT in Apr 2018", "Interview Descriptions": "It took 2 phone interviews from 2 different labs. In both cases, the lab manager asked me my work experience, future plan and work style stuff. However, about 2 weeks later, they emailed me that they decided on other candidate.", "Interview Questions": "Describe one of you weakness."}, {"date": "23 Mar 2018", "title": "Portfolio Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "The process was quick and efficient. My interviewer was very friendly and seemed genuinely interested in learning more about my skills and interests. The whole process was over in a few weeks.", "Interview Questions": "What technical skills I have"}, {"date": "30 Dec 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at MIT (Boston, MA) in Mar 2018", "Interview Descriptions": "Interviewed with 2 faculty members after getting accepted to the Computation for Design and Optimization Program (CDO) now rebranded and the Masters program in Computational Science and Engineering. Both faculty members were very friendly and asked about my previous research experience and how it's relevant to their work. There was also room for me to ask some questions about their research groups.", "Interview Questions": "1. Describe your previous research experience. 2. What coursework have you done in computational engineering"}, {"date": "26 Feb 2018", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at MIT", "Interview Descriptions": "Great full day interview! Very nice to meet so many people and have lunch with students. The process for selecting a candidate was slow but very well thought out.", "Interview Questions": "What are some of the challenges that are unique to MIT students? "}, {"date": "16 Feb 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MIT (Boston, MA)", "Interview Descriptions": "Contacted by HR for phone interview. Basic resume questions and then invited to on site interview. Met with four people separately for about half hour each. No communication after the onsite interview. Not sure if the position was filled.", "Interview Questions": "Basic resume questions"}, {"date": "20 Feb 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT", "Interview Descriptions": "Three rounds of interviews--first a 30 minute phone screen with the hiring manager, then a 1.5 hour in-person with the hiring manager, and finally a 3 hour interview with the hiring manager and two other team members (three separate interviews). From application to offer it took about 2 months.", "Interview Questions": "What are three accomplishments you are proud of?"}, {"date": "11 Feb 2018", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "Online application including Statement of Objectives, CV, 3 Letters of Recommendation, and short response questions about fairly basic things like research interests and summary of awards/recognition. Notified via email unofficially of acceptance on February 9th. No interview, however some applicants did require an interview. Seems to be a case by case basis for interviews.", "Interview Questions": "Describe your research interests."}], [{"date": "7 Feb 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "There was a phone interview screen, as well as an on campus day, which included small group, one on one meetings, lunch and a presentation to the staff.  Many staff members from different teams were involved throughout the day and there was a chance to ask questions at each session.", "Interview Questions": "Why do you want to work at MIT? "}, {"date": "15 Jan 2018", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "all went well, no surprises....nothing to report, just the usual academic job talk,etc ...I have to keep writing so I will, but I have nothing more to share....thirty words is a lot on this topic", "Interview Questions": "N/A"}, {"date": "10 Sept 2019", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MIT (Cambridge, MA) in Jan 2018", "Interview Descriptions": "I emailed a few professors who I thought were interesting things as a current student and some emailed back. We then set up a time to meet. After making sure I would be committed to the project, I joined.", "Interview Questions": "\"Are you familiar with this technology being used\"\r\n\"How much time do you have per week\""}, {"date": "17 Nov 2017", "title": "Director, Strategic Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Applied online with resume and cover letter. Had a phone screen with HR/admin who asked about salary requirements etc. Made that cut. Then asked to provide writing samples AND goals and audiences I'd target and methods to reach them and more--basically a plan of action. Too much info to ask of a prospect before they've met anyone in person. Plus, its asking the candidate to do some of the most important strategic work without compensation.", "Interview Questions": "What are you looking for re: salary?"}, {"date": "26 Mar 2018", "title": "Visitor Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT in Nov 2017", "Interview Descriptions": "Positive interview experience, engaged and encouraging interviewer who was a pleasure to speak with. If other options hadn't been on the table, would definitely have joined this team. Awesome institution with really interesting and exciting exhibits.", "Interview Questions": "Why this role?"}, {"date": "12 Mar 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MIT in Nov 2017", "Interview Descriptions": "I applied for the MIT Summer Research Program (MSRP). The application is similar to a college application but more in depth. Applicant must write 4 essays about their research experience and their future plans.", "Interview Questions": "Please tell us how graduate school relates will further your career."}, {"date": "15 Feb 2020", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at MIT (Cambridge, MA) in Oct 2017", "Interview Descriptions": "Interview with all members of the lab throughout the whole day. That includes a technical presentation and technical discussions. A 30 min interview with the top boss is also included.", "Interview Questions": "Why you are not going to industry"}, {"date": "15 Sept 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "The first interview was about 30 minutes, the second was an hour. It was very engaging and not intimidating at all. The hiring managers were very friendly and the overall tone was colloquial and inquisitive. They wanted to learn about it.\r\n\r\nSadly, I never heard another word from them after months, despite following up. This seems to be a very unfortunate trend when it comes to hiring nowadays. Zero courtesy or decency.", "Interview Questions": "What kind of work excites you? What sort of work do you really dislike doing?"}, {"date": "17 Nov 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Sept 2017", "Interview Descriptions": "After my profile was seen on a recruiting drive, I was reached out to and immediately scheduled a Skype interview with the two economics professors conducting research on the effects of R&D subsidies and technological progress.", "Interview Questions": "2 technical case-type questions regarding econometric models and 2 questions about general understanding of economic theories relevant to the research"}, {"date": "27 Oct 2017", "title": "Education Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT in Aug 2017", "Interview Descriptions": "I applied online and was contacted for a phone interview. Most of the phone interview involved describing the position as it had been listed in the job description. Then I was asked to do a Skype interview during which I was supposed to 10 minute scientific presentation for 6-12th grade students. I did a very nice job with my presentation (I asked for feedback). Yet, I was not told this would be followed by an additional interview . The types of questions asked and they way in which they were delivered made it clear the interviewers were trying to discredit me for the position. In the end, I did not receive an offer but looking back I am glad for this because the interview left a bad taste in my mouth and I could tell I would have been miserable working there.", "Interview Questions": "If you could use give yourself one piece of advice when you started, what would it be?"}], [{"date": "4 Apr 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Washington, DC) in Aug 2017", "Interview Descriptions": "the interview process was very easy, they asked me what me interest was in Science and if there were any specific topics I was interested in within the Biological Sciences specifically.", "Interview Questions": "What interested you in our program?"}, {"date": "1 Sept 2017", "title": "Financial Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MIT (Cambridge, MA) in Aug 2017", "Interview Descriptions": "Phone interview very formal. Close to an in-person interview. Be prepare to give details about works experience by telling stories not by listing skills. They also wanted details about the depth of skills in Excel.  They look for people not only with accounting skills but equally with good customer service skills.", "Interview Questions": "How do you handle difficult people. "}, {"date": "12 Sept 2017", "title": "Communications and Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Jul 2017", "Interview Descriptions": "I applied through the online portal and was contacted by the hiring manager to set up a 20-minute Skype interview.  HM asked that I submit writing samples and complete a case study assignment to submit to the committee before the interview. Despite logging on to Skype 30 minutes early, there were technical difficulties (Skype is the worst), so I had 14 minutes total to speak with five people, who each asked questions. Most of them sat far from the laptop they were using, so questions had to be repeated to be understood. The writing samples and case study work were never discussed. I received an email three weeks later from the hiring manager saying that they were pursuing another candidate.", "Interview Questions": "If you could remove one duty from this job description, what would you choose?"}, {"date": "17 May 2017", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "There is a brief training period and a few meetings with management. The interview process isn't overly rigorous if you have a good attitude and demonstrate a willingness to learn the tour content.", "Interview Questions": "Shadow a current tour guide then give a practice tour of your own after completing a test demonstrating proficiency of campus / tour guide knowledge."}, {"date": "6 Apr 2017", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at MIT", "Interview Descriptions": "Most professors will invite you onsite for a talk, then you will speak to each one of their students. Generally the way to get in is to have people like you, not to come off as a \"know-it-all\".", "Interview Questions": "Why do you want to come to MIT?"}, {"date": "6 Mar 2019", "title": "Internship Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Apr 2017", "Interview Descriptions": "The hiring manager failed to inform me to what extent and how many interviews I would be involved in that day. I was interviewed by the whole division team, nearly 10 different people. The whole process took about 3 hours. The team was extremely nice and had relatively basic questions.", "Interview Questions": "How well do you work with others?"}, {"date": "11 Apr 2017", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT in Mar 2017", "Interview Descriptions": "It was a very short interview. The interviewer asked my interest in the position, then asked if I had any other questions for him. I wasn't sure if that was how all interviews went or if he wanted to cut my interview short due to lack of interest in my candidacy.", "Interview Questions": "Why does this position interest you? "}, {"date": "19 Apr 2017", "title": "Freelance Copy Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MIT (Boston, MA) in Mar 2017", "Interview Descriptions": "Phone interview with two people. Pleasant, friendly, professional, asked pertinent questions, were open to questions from me. They were honest with me that they had another candidate to talk to, and said they would get back to me. When the manager did a couple weeks later, it was an email to say they'd gone with someone else, but she was kind enough to explain that the other candidate had more website experience.", "Interview Questions": "How did you help your previous employer to increase their distribution (I had mentioned this on my resume). Tell us about your web-building experience."}, {"date": "22 Sept 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Mar 2017", "Interview Descriptions": "I received a Phone interview - my boss asked me standard interview questions in my field.\r\nFifteen days later I did an in-person group interview with my current team. Everyone had the chance to know me at a personal and professional level. There were two one-hour group interviews. Two months later I received the job offer.", "Interview Questions": "What is your favorite part of the work?\r\nWhat PM software did you use in the past?\r\nWhy do you think you can contribute to this team?\r\n"}, {"date": "25 Mar 2017", "title": "Technical Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Boston, MA) in Feb 2017", "Interview Descriptions": "I applied on line and received a call for a 30 min phone interview with the lab team member. The questions were about my previous experiences and some technical part. I didn't get the offer.", "Interview Questions": "Where do you see your self after five years, why MIT etc"}], [{"date": "12 Sept 2017", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Jan 2017", "Interview Descriptions": "Had two interviews at MIT for HR positions. After initial in-person interviews, I did not hear back about the position. It would have been nice to have some communication and closure.", "Interview Questions": "They asked about challenges in my current role. "}, {"date": "22 Oct 2016", "title": "Database Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "The whole process was sloppy once my application was sent to the Hiring team. They never replied to my follow up emails.  Leaving me with an impression that they are rude and best that I am not their peer.", "Interview Questions": "What was one issue you had to deal with and how did you resolve it."}, {"date": "4 Oct 2016", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "40 minutes with the hiring manager. Very pleasant, conversational interview. Basically about my background and why would I like to work there. Also, we discussed their expectations and then the hiring manager answered my questions about work culture, and how it looks like working there.", "Interview Questions": "How would you describe your best work environment?"}, {"date": "15 Feb 2017", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MIT (Cambridge, MA) in Oct 2016", "Interview Descriptions": "Phone screen from HR about 1 month after application submitted. Follow-up HR skype interview 1 week later. Two additional skype interviews after another week. On-site interview after another week with 3 other people plus head of HR. NO FOLLOW UPS! They took over a week to reply to each of my emails, most of which said they had \"other priorities\" that were getting in the way and that they hoped to reply to me \"soon.\" After almost 2 months of this (past on-site interview) they finally said they had moved on to other candidates (in response to my email).\r\n\r\nThe interviews were pleasant and they covered all costs associated with the on-site trip, but the lack of communications afterward was quite rude.", "Interview Questions": "Usual interview questions."}, {"date": "5 Mar 2017", "title": "Cable and Harness Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at MIT (Lexington, MA) in Sept 2016", "Interview Descriptions": "It was a very professional interview with clear expectation. I was shown the work environment and it was described to me what hardware and software to be used. Shortly after I showed them my work I was told pretty much that they were satisfied and the interview ended much quicker then I expected.", "Interview Questions": "I how I felt about being a team player."}, {"date": "28 Dec 2017", "title": "TechCaller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT in Sept 2016", "Interview Descriptions": "I applied online and got an email a couple days later with a student manager to schedule a phone interview. The interview was brief and I received an offer shortly after it.", "Interview Questions": "What would you say to an alumni over the phone if they say they do not wish to donate to MIT?"}, {"date": "12 Aug 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Full day meeting with students and postdocs in the same lab. During each 30 min individual meeting, discuss with people about their current research, life, and fun places around MIT. Not stressful as discussions are really casual. Everyone will have their evaluation sent to the PI after the candidate left. Remember, lunch is also part of the interview process.", "Interview Questions": "What did you do during your PhD."}, {"date": "22 Feb 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Aug 2016", "Interview Descriptions": "Simple interview about my experience in the subject of research with the faculty team.\r\nI knew the professor before hand, and I just submitted my CV to complement my application for the job. I helped TAing a class as part of the job as well.", "Interview Questions": "Previous experience in the area of research?\r\nTakeaways from that experience."}, {"date": "6 Jan 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at MIT in Aug 2016", "Interview Descriptions": "The interview process was fine but the program director was incredibly rude and actively snickered and was surprised by my experience. I was interviewed by the current program manager who was leaving and the program director. They both asked questions from a designated list. The program director was very clear that she started the program and seemed to be making a point to let me know things would go through her and she was quite particular about how things were done.", "Interview Questions": "What do you believe will be the most rewarding and most difficult aspect of the job?"}, {"date": "13 Jul 2016", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Boston, MA) in Jun 2016", "Interview Descriptions": "Overall, it went well. Met with lab staff in addition to the main professor. Had a group of people all part of the group I would be working in interview me all at once. Took about 3 hours. My experience matched up well with the lab's needs. The McGovern Institute is beautiful and everything seemed top-of-the-line", "Interview Questions": "Why do want to leave current position?"}], [{"date": "13 Aug 2016", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at MIT (Boston, MA) in May 2016", "Interview Descriptions": "skype interview with the team. they asked mainly about the resume , skills you know , for eg. I said I know mysql , so they , how good you are at. also ruby on rails questions.", "Interview Questions": "mainly questions about resume , what you know"}, {"date": "9 Apr 2016", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MIT in Mar 2016", "Interview Descriptions": "I interviewed with the head of the lab and assistant over Skype. Shortly after, I was asked for references. Only a few days after that, I received an unofficial offer. Overall, it was a very quick process. During the interview, it was easy to tell that my skills and interests aligned with those of the lab. The questions were straightforward and clearly asked to ensure that I would be a good fit with the lab.", "Interview Questions": "Describe your previous research experience."}, {"date": "4 Apr 2016", "title": "Marketing Strategy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MIT (Cambridge, MA) in Mar 2016", "Interview Descriptions": "The interviewers are pretty nice and you won't feel anxious during the process. They also provide with some drinks and snacks. So pretty laid-back atmosphere. And they asked some questions based on your previous experiences.", "Interview Questions": "Talk briefly about your previous professional experiences"}, {"date": "13 Apr 2016", "title": "Lab Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Boston, MA) in Mar 2016", "Interview Descriptions": "She was friendly but they didn't specify what was needed for the position so I was rejected. But they were both very nice and very fast with the process. Overall an okay interview.", "Interview Questions": "I don't understand why you stayed in one lab for so long."}, {"date": "14 Feb 2016", "title": "Facilities Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at MIT", "Interview Descriptions": "It was just a procedure showing that \"we have an equal opportunity\".... They hire the people they know like friends, etc. so you have no chance. If you do not know hiring director, do not waste your time.\r\n\r\nMy interview was pretty much fake. They even did not have a question to ask.", "Interview Questions": "N/A"}, {"date": "7 Feb 2016", "title": "STEM Program Manager OEOP Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "I applied online, the MIT HR representative contacted me via email before the holidays to set up an interview after the holidays. I responded, but never heard back. I sent another email and the HR rep scheduled an interview. The interview involved meeting with the general manager, other program managers, an HR representative, and the program director. They typically split the interview into several days and take candidates out to lunch, but I live a significant distance away so I met with everyone on one day and they took me out for coffee.", "Interview Questions": "What is your experience connecting with a diverse group of students?\r\n"}, {"date": "4 Feb 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Internet application required CV and cover letter. Phone interview, on site interview including seminar before receiving an offer. During the phone interview I received general background research questions from 3 people and more sitting in the background. On site interview included 1:1 with 7 professors/researchers and a 1 hour seminar.", "Interview Questions": "Motivation"}, {"date": "21 Mar 2016", "title": "Masters In Finance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MIT (Cambridge, MA) in Feb 2016", "Interview Descriptions": "One-hour interview on campus. Quite challenging.. A lot of tricky behavioral and technical questions. They invite for lunch with current students afterward. Overall pretty good experience. Took some time to prepare.", "Interview Questions": "Why did I choose the program?"}, {"date": "4 Jan 2019", "title": "Postdoctoral Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Jan 2016", "Interview Descriptions": "I met with a man at a conference and he persuaded me that I should do a postdoc. I don't remember who the man was but the professor was very nice. He gave me a lot of good advice", "Interview Questions": "Who are you?"}, {"date": "11 Jan 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MIT (Cambridge, MA) in Jan 2016", "Interview Descriptions": "Relatively straightforward. HR screen, two rounds of substantive interviews. Reasonably streamlined process, only the normal hoops to jump through, but not lots of extra steps or unnecessary stages. Good process.", "Interview Questions": "If offered the role what changes would you make?"}], [{"date": "12 Jun 2017", "title": "Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MIT (Cambridge, MA) in Jan 2016", "Interview Descriptions": "Went well with lots of questions, I also toured the lab and they continued to ask more questoin reagarding how statics work  on a crane, where I had to answer questions such as moment arm and stresses acting on the metal. It was short and intense. I further talked about prsonal projcts and such.", "Interview Questions": "What is Pressure?"}, {"date": "12 Nov 2015", "title": "Java Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Resume submitted by one of the recruiting firms. Got shortlisted and scheduled for a written exam. After that followed by technical interview on various java, j2ee related technologies for about 2 hours. Got selected in the technical round and scheduled for a brief conversation about the current position and expectations  with the HR manager.", "Interview Questions": "Questions on Spring MVC, Java, Eclipse, Generics."}, {"date": "28 Oct 2015", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Oct 2015", "Interview Descriptions": "Using SAP ERP software: review and edit purchase orders, resolve supply chain issues, and communicate directly with the supplier to optimize procurement process. Interact with the MIT community by providing assistance and instruction to follow purchasing policies and improve vendor relations. Lots of fun good time, free food every day", "Interview Questions": "What do you enjoy?"}, {"date": "3 Sept 2015", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "Initial phone interview. Half an hour long. No small talk, straight to the point. They asked what I already knew about MIT and the department. There was a lot of time to ask questions to the interviewers. They finished by letting me know what the next steps were.", "Interview Questions": "What new skills have you learned in the past year?"}, {"date": "5 Apr 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Sept 2015", "Interview Descriptions": "It was a great experience. I gave a presentation for the whole group. They asked technical questions related to my work and presentation. They also asked specifically about my papers and patents.", "Interview Questions": "What is the process to design metamaterials? "}, {"date": "17 Nov 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at MIT (Cambridge, MA) in Sept 2015", "Interview Descriptions": "Phone interview about a week after I applied online went great and I was scheduled for an in person interview about 2 weeks later. First met with the manager for 20 minutes then 4 people together for 20 minutes. The experience with the manager was good, he was very nice and personable and discussed the job and asked me a few questions, however the panel interview was a horrible experience. The people on the panel, potential future coworkers, acted like I was wasting their time from the moment I met them. No smiling, no friendliness, and nothing to suggest that I might be someone who would actually be a coworker in the future and that they cared what I thought of them. I found the experience very unsettling. They seem to get a lot of their workers as temps but this is no reason for this kind of behavior.", "Interview Questions": "What kind of office environment do you prefer?"}, {"date": "15 Feb 2019", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Boston, MA) in Sept 2015", "Interview Descriptions": "I sent an e-mail and got a reply in 5 min requesting for skype meeting.  Then I talked with all group members online. It was quick. They told me they already knew my works, they were following them. So on..", "Interview Questions": "are you okay with the animal experiment? Can you do it your self if you are trained?"}, {"date": "18 Aug 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "I found the position on Craigslist and interviewed a few weeks after it was posted. I sat down with the post-docs looking to hire a technician. They told me about their research and asked me some basic questions about my past work.", "Interview Questions": "Why this lab?"}, {"date": "5 Aug 2015", "title": "Summer Programs Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at MIT", "Interview Descriptions": "Apply online with application and resume drop. Takes a bit of time to hear back (a month or 2). Then  you have Skype interview with the program coordinator and another member of the staff.", "Interview Questions": "Why this job?"}, {"date": "11 Nov 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Aug 2015", "Interview Descriptions": "Contacted advisor you want to work with and meet for one-on-one interview.\r\nThen set up a schedule to meet an future-advisor and discuss previous work and future work to do. After that he contacted me that I can work in his lab, he gave me time to think about it and I accepted the offer.", "Interview Questions": "What is your interest field of research?"}], [{"date": "21 Jul 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MIT", "Interview Descriptions": "I got a response on the same day of the job inquiry and got interviewed just a week later. I had the opportunity to interact with all the current members of the lab that I was applying for.", "Interview Questions": "Presentation on previous research."}, {"date": "17 Jul 2015", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at MIT (Boston, MA)", "Interview Descriptions": "First got accepted to MIT. Then found a Research Assistant position. They were looking for a matching in interest, background and capabilities. Also the candidate should be open to exploring new areas, new datasets and be flexible if the project direction is constantly changed. Was required to handle projects with 3rd party companies.", "Interview Questions": "About by interest in machine learning. Also was asked about my programming and software development background, my interest in distributed systems."}, {"date": "14 Jul 2015", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "I was admitted as a graduate student to one of the major departments. The department asked me what mu interests were and matched me to some professors, i.e., they made me go talk to a bunch of professors who acted like I was wasting their time for being there, felt really disrespectful and pointless.", "Interview Questions": "They just made me talk to run down the clock, said a bunch of platitudes and that was it. Again, almost felt like sitting there and pretending to listen was a way for them to fulfill some quota, not seriously consider my candidacy. It took me about 3.5 years to get a stable RA (which, in my opinion, is ridiculous). But this was a good time to observe and realize the real reason -> they just hire each other -> the white professors hire white students (and some asians), the asian professors hire asian students (and some white ones), while I was told (I am a minority, not asian) \"you just don't fit in here, good luck\". A freaking joke. "}, {"date": "6 Jul 2016", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Boston, MA) in Jul 2015", "Interview Descriptions": "Was contacted by an admin to schedule date and time for face-to-face with Assistant Director of Administration and Administrative Coordinator. Sat down with both at the same time. Was told that the person hired would support three different groups within the department, not including the group that the Administrative Coordinator is part of, which made me wonder why she was in the room since it makes more sense to include reps from the aforementioned groups.", "Interview Questions": "The Assistant Director seemed concerned that I may have been overqualified for the position."}, {"date": "10 Jun 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Met with every member of the lab for 30 minutes, gave a presentation summarizing my past research, had lunch with members of the lab, attended a department seminar, toured the facility, met with the lab manager, discussed possible projects in the lab", "Interview Questions": "why this lab, what projects i would be interested in"}, {"date": "6 Oct 2015", "title": "Technical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MIT (Cambridge, MA) in Jun 2015", "Interview Descriptions": "Initial telephonic interview to make sure that resume was checked out and to find common interest in research. By the end of the telephonic interview, I was asked to come over for an in person interview at the MIT campus in a couple of days. \r\nIn person interview consisted of meeting the team members and going on a tour of the facilities and getting to know what the work would be like. I was asked to build an electronic component following a demo by the team member and I was able to do it quickly. The team member gave me compliments on completing the device as it usually takes a while if it;s being fabricated the first time. \r\nAfter the tour, I got a chance to interact with the person in charge of hiring and it lasted for about 20 minutes.  \r\nThe whole interview lasted for about 2 hours and I was told at the end that I would be having a quiz to complete along with the submission of 3 professional references.", "Interview Questions": "What is your 5 year plan ? "}, {"date": "19 May 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Jun 2015", "Interview Descriptions": "Took many months. Job description changed in the middle of the process. Hiring managers didn't seem to know what was going on.  Surprised that the place is still functioning. Even after having received the job, there was no real onboarding procedure. No one really cared what happened to you after you get the job. They don't support you after you get hired. Might as well devote a % of your salary towards buying the support and supplies you need.  Full salary position and couldn't even get a decent computer for a month or two. No one even bothered to ensure that there was a working phone in my office.  Just expected me to pay for calls using my personal cell.", "Interview Questions": "N/A"}, {"date": "11 Mar 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Boston, MA) in Jun 2015", "Interview Descriptions": "I had 2 interviews. One was general and one involved giving a presentation on my PhD work.  The process was very quick and the main decision was the PI so I didn't worry about anything else.", "Interview Questions": "How did you solve this problem?"}, {"date": "19 May 2015", "title": "MITpostdoc Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MIT", "Interview Descriptions": "For postdoc you apply to a lab you interested in with some proposed research plan.\r\nIf the PI like the idea and interested you will go to present your previous work and visit the lab.\r\nif everything goes well you may get an offer.", "Interview Questions": "N/A"}, {"date": "16 Apr 2015", "title": "Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at MIT", "Interview Descriptions": "Too long; didn't interview with actual decision makers.  The interview lasted over 3 hours.  Inefficient process.  Also, before 3 hour interview, they have you do an hour long phone interview.", "Interview Questions": "Where do you see yourself in 10 years?"}], [{"date": "14 Sept 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at MIT (Cambridge, MA) in Apr 2015", "Interview Descriptions": "a phone screening, and then you gave a seminar, then another skype interview. The day you gave a seminar, you spend a whole day there, talking to a few professors, some of them ask you about your future research, some of them ask you tough questions.", "Interview Questions": "many many"}, {"date": "15 Mar 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Apr 2015", "Interview Descriptions": "It’s pretty straightforward and phone based. I was interviewed by one of the phd students working in the lab, who was very nice . I was asked about my lab and research experience.", "Interview Questions": "Have you worked in a lab before?"}, {"date": "24 Jan 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Boston, MA) in Apr 2015", "Interview Descriptions": "You apply online and rank the classes you want to teach.  From there, its up to you to go after and contact professors and see if they want you to help teach in the class or not.  Very relaxed, have to make sure to stay on top of the whole process.  Assuming you already got accepted into the masters of engineering school.", "Interview Questions": "Previous teaching experience, grade you got in the class."}, {"date": "5 Nov 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Apr 2015", "Interview Descriptions": "You can contact any professor whose research you are interested in or search through the listings on the UROP website and then contact the supervisor from there. After responding, the supervisor will probably set up a time for an interview so you guys can discuss your interests in the research and what you can contribute.  They will also make sure that you might all the requirements for the position and will probably ask you to send them a resume that you will discuss at the interview.", "Interview Questions": "What are your prior research experiences."}, {"date": "26 Mar 2015", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at MIT", "Interview Descriptions": "A red flag should have been that the folks were very boring during the interview. Monotone voiced, uninteresting, could not make small talk. No one tried to engage me or get to know me.", "Interview Questions": "N/A"}, {"date": "4 Mar 2015", "title": "Graduate Student Researcher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MIT", "Interview Descriptions": "interview process was fairly straightforward. Met with several different professors who asked about previous research experience as well as research interests and goals. Not very behavioral. Just a summary of previous experiences.", "Interview Questions": "Tell me about your previous research experience. "}, {"date": "28 May 2015", "title": "Senior Reactor Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Mar 2015", "Interview Descriptions": "Phone interview for basic experience and level of knowledge. They want to know you're qualified and intelligent before they bother bringing you in. Once you're in the panel interview they ask about your experience, family, hobbies, etc. NRL is a small team so they need to know that you will fit in well personality wise with the other staff members. It is an intelligent, friendly team and they work closely together and depend upon each other to accomplish the tasks necessary.", "Interview Questions": "Tell us about your experience in training other personnel"}, {"date": "26 Dec 2017", "title": "Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Feb 2015", "Interview Descriptions": "Smooth, efficient, and quick. Felt collaborative instead of interrogative. Questions were relevant to the position being applied to. Interviewer was warm and enthusiastic for the interview. Questions focused a lot on how to contribute to the community / role.", "Interview Questions": "How can you contribute to the community? "}, {"date": "29 Mar 2015", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at MIT in Feb 2015", "Interview Descriptions": "Very long and tiring, but worth it in the end since I accepted the job offer! I met with about 8 different people and interviewed with them each individually. Afterwards I spoke with the recruiter regarding the details and he negotiated an offer.", "Interview Questions": "Went over the resume and past jobs/internships\r\n\r\nWhere do you see yourself in 5 years?"}, {"date": "21 May 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MIT (Boston, MA) in Feb 2015", "Interview Descriptions": "Around 3-4 weeks after submitting the online application, they email you either saying you got the interview or not. If you did, there'll also be a link to the open time slots which you can choose from for the specified date. \r\n\r\nIn the interview, the interviewer first asks you to walk through your CV then asks followup questions and after these goes to the behavioural questions part. These should be in past tense since they're looking for experiences not made up ideas. After 2-3 of these the interview is finished by your questions. I think you should definitely ask 1 or 2 to look interested. Mine was 40 minutes.", "Interview Questions": "Tell me about a time where you had a conflict with someone and how you resolved it"}], [{"date": "8 Oct 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Feb 2015", "Interview Descriptions": "He basically just came in and made sure that I could contribute in some way to the project.  He knew that it would be a learning experience for me, so it was ok to learn some things on the job.  It was more of a first meeting than an interview in that sense; my resume and his demand for students pretty much got me the position.", "Interview Questions": "What do you want to work on?"}, {"date": "20 Jan 2015", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MIT", "Interview Descriptions": "Submitted application, was invited to an interview weekend, spoke with professors and graduate students, all of whom evaluated me (including, yes the graduate students, even during social situations).  Acceptance email was delivered within a week of interview weekend.  Most applicants were accepted, with a few exceptions, mainly due to inappropriate behavior during social situations.", "Interview Questions": "Most questions were expected--describe research, etc."}, {"date": "12 May 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Jan 2015", "Interview Descriptions": "I applied online and then waited 4-6 weeks. My manager emailed me to set up a phone interview for the next week. The phone interview was about 20 minutes and went well. She invited me in for an in-person interview by email the next day. The in person interview was with three people. I was asked to give a 10 minute presentation and then we had an interview portion where I was asked questions and was given time to ask questions in return. I was offered the job about a week later and salary negotiation lasted about a week after that. We set a start date of one month after the offer was given. All told the process was maybe 3 months long.", "Interview Questions": "They asked about working on a team. Collaboration is big here."}, {"date": "25 Jun 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MIT (Boston, MA) in Jan 2015", "Interview Descriptions": "Very thorough .Several round of open discussion.One needs to be thoroughly prepared for the subject. You need to be well read, informed and must have ability to articulate your own singular viewpoint . The process is very open discussion format.Since you are going to work on projects which have no reference in the world,it is appropriate that you need to be ready to become reference.", "Interview Questions": "What do you think about the future of X field ? What is your vision? Why do you think like that?"}, {"date": "19 Jan 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MIT in Jan 2015", "Interview Descriptions": "submit your application package, GRE scores, GPA, recommendation letters, SOP. Then you will probably get to interview with some faculty, and you receive your acceptance letter sometime between February and March.", "Interview Questions": "What is your research experience ?"}, {"date": "11 Apr 2015", "title": "Senior Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Dec 2014", "Interview Descriptions": "I applied for the job online and received a response back from HR within two days for an interview. I interviewed the following week with the associate director and supervisor for the department. After the interview it took three months to find out that the position hadn't been filled and that they were still looking at candidates to fill the role. It seemed that they were willing to wait for the perfect candidate.", "Interview Questions": "What was the most important achievement during your career?\r\nWhy do you think you experience matches our job description?\r\nWent over background."}, {"date": "18 Nov 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "I heard back very quickly and had an interview within the week. I was interviewed by the main heads of the department. The people were pleasant, but it took a long time to hear back after the interview.", "Interview Questions": "N/A"}, {"date": "10 Sept 2014", "title": "Technical Associate Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "Applied online directly through MIT job board. Was contacted about a month later and scheduled for a phone interview. Came in for 2 in person interviews and was told my desired salary was far above what they were able to offer for the position, though I also interviewed for a nearly identical position at another university in Cambridge that was willing to work to match my desired salary.", "Interview Questions": "Would you be willing to take on additional responsibilities beyond what is listed in the job description? This was asked during the same conversation where I was informed they were unable to make a competitive salary offer."}, {"date": "26 Jul 2014", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at MIT", "Interview Descriptions": "For higher-level positions, expect to meet with at least 5 people, as well as the entire team (support staff). It will be a full day of meetings. You will be invited to a lunch, where you will be evaluated for your soft skills, personality, and ability to carry a sophisticated a conversation. Be prepared to talk about MIT news and things you might share with a donor.", "Interview Questions": "Tell me about a time when you were given feedback that surprised you? What was the feedback and how did you handle it?"}, {"date": "17 Jul 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Taken into the office and talked to about my accomplishments and goals. What I'd done in the past and what research I'd taken part in. Overall nothing too out of the ordinary. They did ask in detail about previous research.", "Interview Questions": "What did you do during the research period?"}], [{"date": "4 Mar 2015", "title": "Development Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Jul 2014", "Interview Descriptions": "Stiff and clinical, people at MIT Sloane are overly professional and have lost the human touch. One feels like one has to fit a mold, and any deviance from the accepted overworked, worker ant norm (even if you are doing your job well, and hitting all performance standards) is looked down upon.", "Interview Questions": "Why do you want to work at MIT?"}, {"date": "16 Jun 2014", "title": "Graduate Resident Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Basically you put in an application, went through a vetting process with the Dean of Students.  Then you needed to figure out which dorm you were going to work in.", "Interview Questions": "What was your reaction upon hearing there was an annual cross-dressing party."}, {"date": "5 Jun 2014", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MIT", "Interview Descriptions": "Very friendly, in-person interview after email communication. I sent an email to the PI after hearing from an acquaintance that they would be searching for TAs, and after a couple of weeks of email correspondence, I had a phone interview with the PI. A few weeks later, I traveled to MIT to have an in-person interview with several members of the lab.", "Interview Questions": "As expected, challenges of research"}, {"date": "2 Jul 2014", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Jun 2014", "Interview Descriptions": "FIrst round was a phone interview. They emailed telling me they were interested and then we conducted a phone interview with 2 supervisors. Then a second live interview and tour, with introductions.", "Interview Questions": "What was a time you took initiative at work? What was the result?"}, {"date": "28 Jul 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at MIT (Cambridge, MA) in Jun 2014", "Interview Descriptions": "I was interviewed by Lab Supervisor first by phone and then a full day interview in Cambridge campus. The main focus was on technical side of the project they were looking for a researcher to work n. Not many behavioral questions was asked.", "Interview Questions": "Mainly technical"}, {"date": "29 May 2014", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at MIT", "Interview Descriptions": "I was hired through a temporary agency for a part time position, had one phone interview and was asked to come in.  Then I grew within my department to a permanent position after 6 months.", "Interview Questions": "How long do you plan on staying around?"}, {"date": "14 May 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "I applied for an advertized position and was short listed. I was interviewed on Skype as I was in Europe during that time. After the interview, email confirming my acceptance came and work permit documents were soon dispatached within 2 weeks. It took 1 month after administrative processing at US embassy for J1 visa", "Interview Questions": "where do you see yourself in next 5 years"}, {"date": "10 Sept 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT in May 2014", "Interview Descriptions": "Applied for job posted end of April. Phone interview 2 weeks later, on-campus interview 2 weeks after that. Long interview on campus, about 6 hours, including a presentation for a just above entry-level position. It was several weeks before I heard a decision and I had to reach out to them. Was told by one employee that a decision would not be made for another week but received another reply from different employee same day saying they had selected someone. Hmm. Several months later I found out they didn't hire anyone. Would have liked a little more transparency...", "Interview Questions": "Question regarding student development theories. I had not been in grad school for over two years at this point and couldn't recall specific names or publications. "}, {"date": "7 Oct 2015", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MIT (Boston, MA) in Apr 2014", "Interview Descriptions": "I came in to talk about a research scientist position. I gave a talk, met with people I would be working with, and heard a lot about the potential project. It was all pretty standard, people were nice. There were not many questions, more being talked at than questioned. Went out to dinner with the group, toured around the campus area where I would be working. The presentation was in a seminar room and involved some questioning, but just on past research.", "Interview Questions": "Are you willing to do this job?"}, {"date": "29 Mar 2014", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Easy to communicate with hiring team, very personable. Thorough, 3 step interview process beginning with support staff and ending with upper level faculty and administration. All my questions were answered.", "Interview Questions": "Don't recall"}], [{"date": "2 May 2018", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Jan 2014", "Interview Descriptions": "Requirements included a one hour job talk with question and answer period afterwards, one on one interview with a current faculty member, and an interview with faculty search committee. After the process, I felt that the committee already had the right candidate in mind and needed to go through the motions with other candidates.", "Interview Questions": "What is future role of your field?"}, {"date": "31 May 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at MIT (Cambridge, MA) in Jan 2014", "Interview Descriptions": "I initially planned to take a course at MIT, but upon persistence, continued communication and great performance, I was able to get paid for conducting research immediately. I was not technically \"interviewed\"; it was rather a 6 month long process of staying in touch with and collaborating with (and doing free work for) my desired lab.", "Interview Questions": "My ten year plan. I had never had one, and so I had to devise one."}, {"date": "10 Dec 2013", "title": "Human Resources Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT", "Interview Descriptions": "Pros:\r\n-Speedy response after applying online.  I received a call for a phone screen about 1 week after applying online\r\n\r\n-Was invited in for an in-person interview less than a week after the phone screen\r\n\r\n-Interview was very informative and gave great insight to the culture and the people itself\r\n\r\n-People in the department were extremely friendly\r\n\r\n\r\nCons:\r\n-Was told by the recruiter that my salary expectations were within the range but was told during the in-person interview that they were not anywhere near their range\r\n\r\n-The in-person interview with director was extremely long; almost half the work day\r\n\r\n-Even after sending a thank you & checking in a week later, I never received any sort of response or follow up as to the status and whether or not they had filled the position with another candidate.  Very unprofessional, especially for an HR department.", "Interview Questions": "I wouldn't consider this the most difficult, but they did as how to handle certain employee situations (performance issues, compensation, etc)"}, {"date": "7 Dec 2013", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Hiring process was very convenient. The interview was very technical and positive.", "Interview Questions": "N/A"}, {"date": "19 Jun 2014", "title": "Postdoctoral Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Dec 2013", "Interview Descriptions": "MIT media labs contacted me after I applied online. I was extremely surprised that they even considered me. I thought I was fortunate to get this response from them. I was scheduled to talk to a staff member from the lab from the biological side. She spoke to me and asked general questions about my PhD, my interests, computer vision and machine learning. I did OK and I didn't expect a callback as a result.", "Interview Questions": "What is my experience in biomedical/retinal computer vision?"}, {"date": "15 Jan 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT in Dec 2013", "Interview Descriptions": "Like non-profits companies it does take a while to go through the process.  You need to be patient throughout the entire process.  Even when they offer the job you need to have the background check to make it official.  That process is a very long two weeks.", "Interview Questions": "They verbally offered job but not official until background check which takes 2 weeks."}, {"date": "20 Jul 2015", "title": "Data Analyst/Project Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Dec 2013", "Interview Descriptions": "Very straight forward, quick and to-the-point. Typical questions were asked including current employment, why you would want to work for the company, three best qualities, three worst qualities, What would your friends and coworkers say about you. Hired upon completion of interview.", "Interview Questions": "What are your three best qualities"}, {"date": "28 Sept 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Nov 2013", "Interview Descriptions": "I am a PhD from a local university in Boston.  I emailed the professor whose research area I am interested in.  Meanwhile,  I sent a hard copy of my CV and cover letter to his office.  After about 1 week, I got the email reply to have onsite interview with his lab.", "Interview Questions": "All questions are about technical problems. You will have to understand what you were doing clearly."}, {"date": "30 Oct 2013", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "Excellent process.  Very professional.", "Interview Questions": "Nothing unexpected."}, {"date": "17 Oct 2013", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at MIT", "Interview Descriptions": "Very long process. From the time I applied, it took 3 months to receive any information about the status of my application. I finally heard back and had a string of interviews (5-6) in one day.", "Interview Questions": "What is something new you learned today?"}], [{"date": "4 Oct 2013", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MIT", "Interview Descriptions": "just get invitation from the professor", "Interview Questions": "N/A"}, {"date": "30 Sept 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "no formal interview, just emailed the prof and met him to discuss the research", "Interview Questions": "N/A"}, {"date": "21 Oct 2013", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT in Sept 2013", "Interview Descriptions": "I had a brief chat with the senior recruiter who advised me that she would recommend they interview me. About 2 weeks later I was invited to interview with two different people in one on one situations. About a week and a half later I was invited to interview with the Dean. The interviews were quite casual and informative.", "Interview Questions": "N/A"}, {"date": "13 Aug 2013", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Phone interview, followed by in-person interview.", "Interview Questions": "No crazy questions, they just wanted to make sure that I was qualified for the position and my resume checked out."}, {"date": "7 Aug 2013", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "Hiring processes at MIT can move slowly and often require several interviews.  This is because once someone becomes a part of the community, it is very difficult to get rid of them, so managers want to be really sure someone is a good match.  Sometimes managers don't even start looking at resumes until a position has been posted for a few weeks, so don't expect a quick response.  Expect to do more than one interview, not just with the hiring manager but with multiple stakeholders.  If you are applying for a job working directly with students, you may be interviewed by students, and their opinions are taken seriously.", "Interview Questions": "Everyone at MIT believes it is a very unique place.  So, if you act too confident that you will be successful in a job here because you have done a similar job somewhere else, that may be a turn-off.  Ask lots of questions and try to talk about how you would tailor your approach to the unique conditions that exist here."}, {"date": "22 Oct 2013", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA) in Jul 2013", "Interview Descriptions": "Applied online on MIT webiste.  First talked to a general HR recruiter.  Then set up a skype interview with the professor.  The interview was a bit bumpy, but I guess this person must have liked me very much because I ended up his first choice.  Just asked standard questions about research experience and career goals, management style, etc.\r\nThen I got another pushy phone call from the HR person asking me to decide within a day whether to accept or not.  I did not like dealing with the HR department but I absolutely love my professor very much.", "Interview Questions": "What was the biggest challenge/problem you had to solve in your past position?"}, {"date": "28 Oct 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Jul 2013", "Interview Descriptions": "Usual postdoc application process. I gave a 50 min presentation to the research group I applied to. Then met with the advisor, other postdocs and graduate students. I had several questions from all of them. I also had the opportunity to ask the postdocs privately about working with the advisor. A week after the presentation I got an offer to start working the next week.", "Interview Questions": "I was asked mostly about what experimental techniques I am familiar with. Also how experienced I was in writing custom instrument control software etc."}, {"date": "31 Jan 2015", "title": "Manager of Communications & Special Projects Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT in Jul 2013", "Interview Descriptions": "I applied online and was selected for a phone interview. From the phone interview I was brought in as a finalist for a 5+ hour interview (they provided breakfast and lunch). I was not selected but they did call to tell me directly, which I appreciated. It was a pleasant process and an impressive institution.", "Interview Questions": "Nothing difficult or scripted- It was all very conversational with the different parties involved. I was a little daunted by the 5 hour+ interview ahead of time, but it was an overall enjoyable process. "}, {"date": "24 Jun 2013", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at MIT", "Interview Descriptions": "Phone interview about past projects and future plans", "Interview Questions": "nothing difficult"}, {"date": "18 Aug 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Jun 2013", "Interview Descriptions": "Every postdoc interview is different depending on the lab you are joining. I got the full day experience: 1h morning discussion with prof, 30min time-slots with other students and postdocs, lunch with prof, more 30 mins time-slots, 1 hour presentation of my research (30 min talk, and 30 min questions); debrief with prof and then finally dinner with 3 other postdocs. comprehensive enough, got offer next morning.\r\nbogus text to fill up 50 word minimum\r\nbogus text to fill up 50 word minimum\r\nbogus text to fill up 50 word minimum\r\nbogus text to fill up 50 word minimum", "Interview Questions": "Do you prefer to work in a team or alone?\r\nLots of science specific questions."}], [{"date": "31 Jul 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT in Jun 2013", "Interview Descriptions": "I was invited for a talk on my past projects. I presented my PhD thesis Project. Some professors, Students and Postdocs came to my talk and some of them asked questions about the application of my findings.", "Interview Questions": "Tell us about your findings. how can you compare your results and method with others."}, {"date": "29 Mar 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Jun 2013", "Interview Descriptions": "Submit the CV and research statement. They will require the reference letter, usually at least 3 letters. After several weeks, I got the onsite interview, including  public presentation, talked with professors, talked with industrial coordinator, talked with students and other postdocs, lunch, dinner. It took one day and I got the response very soon.", "Interview Questions": "Academic questions about the research, thesis and paper"}, {"date": "25 May 2013", "title": "Production Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "I emailed my resume was called within hours for interview. I interviewed with 4 people over 2 weeks and received an offer. They seemed to care more about character than skills. It's a kwirky company they are looking for very smart people who will in.", "Interview Questions": "They asked very personal questions that a little out of line."}, {"date": "28 Apr 2015", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at MIT (Cambridge, MA) in May 2013", "Interview Descriptions": "Single, very brief interview. The position was for basic data collection, so they were looking for basic competency. I interviewed a week after graduating college and was eager to accept an offer as soon as possible. My employer understood that I was overqualified for the position, and made it clear that this position would be a good stepping stone while I work to start my career.", "Interview Questions": "What are your long-term career goals?"}, {"date": "17 Jul 2015", "title": "Educational Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at MIT (Cambridge, MA) in May 2013", "Interview Descriptions": "This interview was for a newly formed department and was conducted among three separate teams across a three hour period. The teams varied from those I would be sharing an office with, to those who would be directing the department. There was a lot of nervous humor about working in an atmosphere that was constantly changing. They weren't joking. A lot of the job (which I accepted) has been \"from the hip\" for the past two years. Only recently have we begun formalizing our processes.", "Interview Questions": "How do you handle uncertain, changing goals?"}, {"date": "8 Apr 2013", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MIT (Cambridge, MA)", "Interview Descriptions": "I was first contacted and had a brief phone screen that lasted approximately 20 minutes.  They asked me a few basic questions about my interest in the position, my prior experiences, and my salary expectations.  I was invited in for an in person interview by email the following week, and I met with the associate director and director of the office I was applying to.  Both interviewers were very friendly, and mainly wanted to know what skills I thought would be most valuable and how I believed my previous experience would lend itself to this position.", "Interview Questions": "What three skills would be more important in this position?"}, {"date": "23 Dec 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MIT (San Diego, CA) in Apr 2013", "Interview Descriptions": "Consisted with one phone interview, one on-site interview, and multiple follow-up phone interviews. During the main on-site interview, many random questions were asked. It seemed like there was no specific structure of the interview. However, most of the questions was about research in general and domain knowledge.", "Interview Questions": "Design a research that you wanted to conduct by assuming that there would unlimited resources."}, {"date": "27 Jun 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at MIT (Cambridge, MA) in Apr 2013", "Interview Descriptions": "Send curriculum vitae and interview via Skype and send some supporting documents such as papers, PhD dissertation, and so on. And waited for 1 week and got an offer, and I took it.", "Interview Questions": "Just technical things related to previous research based on prepared slides for interview. Questions were focused on practical skills for me."}, {"date": "13 Mar 2017", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at MIT (Cambridge, MA) in Mar 2013", "Interview Descriptions": "I had an interview with the professor I ended up working for. I discussed my research interests and previous work experience. I also discussed potential projects I could be involved in during my Phd.", "Interview Questions": "What was your previous research experience?"}, {"date": "16 Jun 2017", "title": "PhD Graduate Student, Biology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Feb 2013", "Interview Descriptions": "You meet around five or six professors and talk about your research, and ask questions about their research. Being able to carry out scientific conversations and talk to them about their research is necessary.", "Interview Questions": "What difficulties did you face in your project/research and how did you overcome it?"}], [{"date": "28 Aug 2017", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Feb 2013", "Interview Descriptions": "It involved several directors asking questions about my previous experience and how it related to the position. It was about 90 minutes. There were no boiler plate questions that hiring managers tend to run with.", "Interview Questions": "How does your previous experience relate? "}, {"date": "2 Apr 2016", "title": "BMS Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Feb 2013", "Interview Descriptions": "When I arrived my current boss and a lady from HR were already ready to start the interview process. Seeing as I always show 20 minutes early for any interview I was shocked and pleased that they were all ready to go. We sat in a conference room and they proceeded to go over my past work experience and knowledge of the job. Interview all in all took about 20 min and went very well. Two days later I received a call from HR asking to come in for a second interview the following week with the same people plus another supervisor. Again, I arrived 20 min early and they were ready to get started. I had the same interview and got a call that night that with an offer for the position!", "Interview Questions": "Why I think I'm best for the job."}, {"date": "27 Feb 2015", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at MIT in Feb 2013", "Interview Descriptions": "I applied for Mechanical Engineering department for Master degree. \r\n\r\nI got email for scheduling Skype interview from the faculty and next week I had interview with the faculty.\r\n\r\nThe faculty interviewer is the one I referred on my SOP as whom I want work with.\r\n\r\nBut he told me that that was just general interview for whole departmental level, not just for his lab.\r\n\r\nHe told me that they don't usually interview like this for Master applicant in their department but policy was changed from that year.\r\n\r\nThe interview was really casual around 30 mins interview in very casual atmosphere.\r\n\r\nI just briefly talked about my prior research experiences and he asked some questions.\r\n\r\nIt took more than 2 months to be declined and thought I was on the wait list.\r\n\r\nHope this would be helpful for you guys!", "Interview Questions": "When is the most frustrated moment in your research experience?"}, {"date": "18 Jan 2013", "title": "Master of Finance Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MIT", "Interview Descriptions": "Normal application process with essays and interviews\r\nInterviews are all fit questions such as why this program? Why you? What's your career goal? Give me an example when you lead a team. Give me an example when you are a team player.", "Interview Questions": "Not really. What courses/professors you are interested in. Be sure to get familiar with the course name."}, {"date": "11 Nov 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Jan 2013", "Interview Descriptions": "Very technical; spoke everyone to the team. Be very good with your technical papers. They ask you very detailed mathematicalk questions about your work, however it depends on the kind of work you do. Both math & value of your work are important.", "Interview Questions": "Explain the value of your last publication and what it does?"}, {"date": "5 Jul 2017", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MIT (Cambridge, MA) in Jan 2013", "Interview Descriptions": "Very hard and extensive. with technical questions on every part of my background. It first started on optical setups and then progressed to device physics questions and more so on nanotechnology and chemistry.", "Interview Questions": "What is your best paper"}, {"date": "1 Apr 2015", "title": "Industrial Liaison Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MIT in Oct 2012", "Interview Descriptions": "I got a phone interview from the HR first. It was short, about 10-15 minutes. She just checked some points on the resume and gave some explaination about the position. Then she scheduled site interview with me immediately. The site interview ended after only one question, do you need visa sponsorship?", "Interview Questions": "do you need visa sponsorship?"}, {"date": "22 Jan 2016", "title": "Fiscal Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Oct 2012", "Interview Descriptions": "First round interviews were in-person with manager and several team members. The second round was in a group setting with the whole team. Very detailed interview questions about skills and experience. Also met with unit director. Interviews were followed by reference checks.", "Interview Questions": "How have you added value to a team, both quantitative and qualitative."}, {"date": "9 May 2014", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Sept 2012", "Interview Descriptions": "Interview with PI and then second interview with whole lab. Was asked a range of questions, ranging from career objectives to details about SQL programming. PI was very relaxed and happy to help me get to the US. The culture of the lab was relaxed and it was important to be considered part of the team.", "Interview Questions": "Presentation of previous research and being grilled"}, {"date": "7 Oct 2012", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA) in Aug 2012", "Interview Descriptions": "I was hired for a biomedical research position in a professor's lab. My hiring process seemed very informal, especially compared with my interviews for industry positions and former job at a company. A week after applying, the PI contacted me, and we had an agreeable conversation over the phone. About a week later, he arranged for some other folks in the lab to meet me, show me around and take me out for lunch. None of the questions were very difficult and I was given the impression that an offer was likely given that I was invited in in the first place. Things moved quickly with an offer; I received a verbal offer from the PI, and he asked for my thoughts, got a sense that I seemed likely to accept, and sent me a formal offer a week later. I was working in the lab 2 weeks after my in-person visit. The process was curiously simple, and I would caution others not to assume this is a reliable pattern from lab to lab.\r\n\r\nOn the downside of \"informal\", starting at the lab was a bit awkward. On the plus side, a grad student did take initiative to help me get situated, and someone had put together a welcome packet- more than my others before me had gotten. But there really wasn't much by way of official \"orientation\" or a clear message or timeline concerning what I needed to do to appropriately integrate into the lab.", "Interview Questions": "Nothing stands out. Nobody really went for the tough questions."}], [{"date": "11 Mar 2016", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at MIT (Cambridge, MA) in Jun 2012", "Interview Descriptions": "I came in through a recruiter and everything happened very fast. I met with the office manager and the front desk admin for about an hour. Two days later I came back and interviewed the three managers I would be supporting and the process was straightforward. The next day I had an offer and I started the next week.", "Interview Questions": "Describe your previous work experience and how would you currently manage a difficult-to-manage employee?"}, {"date": "30 Nov 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Jun 2012", "Interview Descriptions": "GRE, TOEFL and application, with a phone interview. The process is quite similar to other university application in general. Although the references from your college might play a good part.", "Interview Questions": "how much experience i have in field i applied for"}, {"date": "7 Feb 2013", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Apr 2012", "Interview Descriptions": "Earlier in the Spring, I emailed a bunch of labs in the Media Lab for a UROP for the summer. I received very few responses, one of which was from the lab I worked in, which told me they didn't have any open positions, but they would email me if anything came up. The last day before the UROP application deadline, I emailed them again, and they had an open position. I went in that day, and they gave me the job after a few talks with the professor and the grad student I would be working with. So I got the position.", "Interview Questions": "What do you know about big data?"}, {"date": "26 Apr 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Feb 2012", "Interview Descriptions": "It starts with the phone interview 2 week ahead of time. then on site interview starts with talk with the PI. followed by 45 min presentation plus individual meetings with 5 people wihtin the group", "Interview Questions": "Which project is the one best reflecting your skill set and capability?"}, {"date": "25 Jan 2013", "title": "Student Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Bloomington, IN) in Feb 2012", "Interview Descriptions": "I was applying for a student position at MIT. I was interviewed by a graduate who worked in cognitive science. I was in high school at the time and had no prior interview experience. I thought the whole experience was a bit awkward; we didn't find too much common ground to talk about.", "Interview Questions": "Why MIT? "}, {"date": "29 Jun 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Jan 2012", "Interview Descriptions": "Gave a 1 hour talk and spent the day speaking with graduate students and postdocs from the lab, around 30 - 45 mins per person. Lunch and dinner was also spent with lab members. Spent an hour with the principle investigator (PI) before the talk, and interacted with the PI during the presentation. Was offered a position at the end of the day, but took a month to consider it and accept.", "Interview Questions": "Was asked questions during my presentation directly related to my graduate work."}, {"date": "2 Apr 2016", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at MIT (Cambridge, MA) in Jan 2012", "Interview Descriptions": "I was asked to visit the lab and give a formal presentation. I had interacted with the group members one on one and went for dinner with a postdoc from the lab", "Interview Questions": "N/A"}, {"date": "18 Feb 2012", "title": "Technical Associate - Sponsored Research Staff (Temporary) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Jan 2012", "Interview Descriptions": "I spoke with the supervisor while a fellow lab researcher listened in, and later the director of the lab group stopped by very briefly. They mostly asked me questions about my technical background based off of my submitted resume, and there was also a simple, open-ended question about the experimental problem the job entailed to assess my thoughts and approaches. Later, I was shown an experiment in progress similar to what I would be working on. The interview was mostly informational in nature, and took 30 minutes total.", "Interview Questions": "Suppose the driver of a push-button ignition vehicle finds his/her vehicle is suddenly accelerating out of control. What would their first reaction be? What improvements need to be made to today's systems to address this?"}, {"date": "5 Sept 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Dec 2011", "Interview Descriptions": "Application for admission to graduate school needs to be completed online. It requires GRE score, 3 letters of recommendation (minimum), TOEFL score, SOP (statement of purpose). The deadline for submitting the online application is around December 1 for mechanical engineering department. Once the application is submitted, it is reviewed by the admission committee. If successful in getting admission into graduate school, one can talk to professors in their field of interest to join their group as a research assistant.", "Interview Questions": "Getting admitted into graduate school is the hardest part"}, {"date": "28 Aug 2012", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MIT (Cambridge, MA) in Oct 2011", "Interview Descriptions": "Wrote an email with my cv; then skype interview about what they're doing and what I'm going to do there; had to provide 3 references that were checked; got applied after references were spoken to", "Interview Questions": "I knew one person there that was interviewed before; I told him that I could conduct some research on a different university. He obviously told them about it, so they asked me what I would do there and why I would prefer to work here."}], [{"date": "20 Sept 2012", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Sept 2011", "Interview Descriptions": "I was brought in for a temp to perm position. This job required you to be personable, so they just wanted to talk and get to know me.  The ladies I worked with were very easy to talk to, offered me water or coffee, and generally made me feel very comfortable. The interview lasted about an hour in which they asked about my resume and past experiences and how they were applicable to the position.", "Interview Questions": "They did not ask any of the awkward interview questions. Everything was very straightforward. They asked about my resume and past experiences and how they were applicable to the position. "}, {"date": "19 Apr 2015", "title": "Administrative Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MIT (Cambridge, MA) in Sept 2011", "Interview Descriptions": "Standard interview questions and process. There were no surprises, they asked basic questions relevant to the job and the interview was long enough and casual enough for them to get a feel of whether I would be a good fit for the culture of the department, in addition to having the skills to do the job. If you made it to the interview stage then you already passed a lot of hurdles and it's mostly about personality and how you come off.", "Interview Questions": "Describe a time when you handled a difficult work situation. Where do you see yourself in 5 years?"}, {"date": "7 Oct 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MIT (Cambridge, MA) in Jun 2011", "Interview Descriptions": "Easy get-to-know you interview process,   It was informative.  It told me about what the project was about.", "Interview Questions": "N/A"}, {"date": "22 Feb 2012", "title": "Undergraduate Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Jun 2011", "Interview Descriptions": "The phone interview is great!!! He asked me about my experience and different programs I can use. Overall, it's not a bad interview.", "Interview Questions": "How would you handle the project if you work independently?"}, {"date": "22 Jun 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Jun 2011", "Interview Descriptions": "Two interviews, one with the boss, one with coworkers. I never met or was screened by anyone in HR. There was also a long pause between interviews. I found it unusual that the interview and hiring process was not managed by HR in any way. It is difficult to provide useful information here because now that I've been at MIT for a while, I know that each department will conduct their own interviews and they will vary widely.", "Interview Questions": "Lots of standard behavioral interview questions and questions about my past experience. "}, {"date": "15 Jun 2012", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at MIT (Cambridge, MA) in Jun 2011", "Interview Descriptions": "The interview process was slow, but my department was thorough.  I had a phone interview, in person interview, then a meeting with the program director.  MIT has a  fragmented HR department, so it was difficult to get answers to questions that were HR related.  Also, it was over a month between when I interviewed and got an offer for the position.", "Interview Questions": "How would you deal with working in a small office environment?"}, {"date": "19 Oct 2014", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at MIT (Cambridge, MA) in May 2011", "Interview Descriptions": "I first met the postdoc I was hired to work for at a lab meeting at Children's Hospital Boston. I was recruited by a PI at MGH, and she openly protested and offered me a position on the spot. \r\n\r\nI had a formal interview and another post-doc decided he wanted to have me work for him as well, so I ended up having two separate projects to work for full time (in hindsight, this was a mistake). \r\n\r\nThe interview itself was pretty informal. I was asked about what research areas I was interested in, what my goals were, and the usual interview banter. The PI of the lab later told me that one of my recommenders (I didn't know it at the time, but a collaborating PI) said he'd \"have to be insane not to hire me\". Lesson learned: never underestimate the value/power of what others say about you (both positive, and negative).", "Interview Questions": "What is your life's ambition"}, {"date": "1 Jun 2013", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MIT in Mar 2011", "Interview Descriptions": "Good communication between the HR department and the job poster and the candidates. Affirmative action is in full force at MIT, making it particularly difficult for highly qualified white male candidates to get positions, which is unusual since the gender ratio at MIT is very even and about 80% of the population is not white.", "Interview Questions": "what are your long term goals?"}, {"date": "28 May 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at MIT (Cambridge, MA) in Mar 2011", "Interview Descriptions": "send my CV directly to the Professor. I had three phone interviews in the four months of the process - I applied in March, got the offer in July, and started working in August.", "Interview Questions": "I told them that I had another offer and needed time to decide and they ask me the other company's name."}, {"date": "2 Jul 2011", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at MIT (Cambridge, MA) in Feb 2011", "Interview Descriptions": "Rule #1: Sign up with a staffing agency. Find out what agencies the school you want to work at utilizes and sign up with them. This was the key component of getting the great position that I have. The agency will help you tweak your resume, etc. Working with them really serves as a pre-interview.\r\n  \r\nMIT is looking for people who know their stuff. Make sure you have some background in Academia and emphasize your ability to work cross-departmentally. Eventually everyone works together so you have to be a team player.", "Interview Questions": "Do you really expect to make between x & y dollars? "}], [{"date": "3 Nov 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at MIT (Boston, MA) in Jan 2011", "Interview Descriptions": "Via Mail.  Inquired if any positions available, specified skills.  Talked on telephone with potential employer and got an offer in the mail a couple of weeks later.  Very easy", "Interview Questions": "N/A"}, {"date": "24 Mar 2014", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MIT (Cambridge, MA) in Jan 2011", "Interview Descriptions": "People were very nice. Had one on one interviews with about 10 people.", "Interview Questions": "What are things that you do outside of work?"}, {"date": "27 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at MIT (Cambridge, MA) in Jan 2011", "Interview Descriptions": "Regular grad school applications, followed by a weekend long interview.  Met with three professors for individual interviews.  The questions are related to your past academic and job experience, and mainly research.  The professors tell you about their research so you can learn about what the program offers and ask them questions.  You also get to spend time with current students and meet more professors over lunch and dinner.  Overall very fun.", "Interview Questions": "Tell me about your research and use a piece of a paper to draw diagrams."}, {"date": "10 Sept 2010", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at MIT (Cambridge, MA) in Jul 2010", "Interview Descriptions": "First I was called in for 1:1 interview with the professor. It still consisted of me giving a presentation but only to him. Then we talked about my experieces etc. Overall, it was just a nice conversation.\r\nThen he said that he'd like me to come in and give an official presentation to the whole lab, and that was ok as well. After that there was a lunch and dinner interview with the lab members, which was still just talking...", "Interview Questions": "why do you want to join our lab?"}, {"date": "13 Nov 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at MIT in Jul 2010", "Interview Descriptions": "Very specific to department and lab. Mine involved talking to all principal investigators regardless of if I would work on projects with them. Slow hiring process - IT has to interview a certain number of people even if they want you.", "Interview Questions": "If you mention skills in CV be prepared to talk about them!"}, {"date": "26 Aug 2010", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Boston, MA) in Jun 2010", "Interview Descriptions": "Experience, management style, personality and past salary matter.  Especially past salary.", "Interview Questions": "salary requirements"}, {"date": "24 Jul 2010", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MIT (East Cambridge, MA) in May 2010", "Interview Descriptions": "I contacted my colleague for which a position was available in his department. I submitted my resume and cover letter via email. We spoke on the phone and set up a time to meet to discuss my desires. We then met t talk about my impending layoff and desire to transfer within the company. A second interview was then set up with him (the hiring manager) and the supervisor. It was pleasant, informative, congenial, and I felt I was a good match for the job. At the end of the interview, I was informed that a decision would be made within two weeks. This time had gone by, so I emailed my colleague to inquire about the status. He informed me that they were making an offer to another candidate, but if she didn't accept it I would be considered a finalist.", "Interview Questions": "How would you handle a difficult situation where a director asked you for your immediate help with travel, and you had an imminent deadline on a presentation quickly approaching."}, {"date": "4 Feb 2013", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MIT (Cambridge, MA) in May 2010", "Interview Descriptions": "The interviewer is very friendly. Personal attitude is a critical criteria during the selection process. I am a easy-going person and I can get along with most people. They are looking for person who pays attention to details, responsible, able to work independently.", "Interview Questions": "What field-related experience do you have?"}, {"date": "22 Nov 2010", "title": "Quantitative Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MIT (Cambridge, MA) in May 2010", "Interview Descriptions": "It was an online application and telephone interview", "Interview Questions": "What is the yield of a treasury bond"}, {"date": "25 Nov 2014", "title": "HVAC Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MIT in Apr 2010", "Interview Descriptions": "Oral interviews, where you are asked about previous job experience and reason for leaving. and the candidate is asked why he/she wants to work for MIT. the tell you what is expected of the candidates, and what the job entails.", "Interview Questions": "There is also writen technical quize regarding his/her professional trades"}], [{"date": "20 Jul 2010", "title": "UROP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Nov 2009", "Interview Descriptions": "Interviewing for an UROP position at MIT is relatively easy. I first look up the professors who has research topics that interests me. Then I either emailed them or talk to them in person to express my interest in becoming a UROP intern at their lab. Next, I scheduled interviews with them. The interview itself is very lax in its atmosphere. The professor just want to you if you are really interested in their research and if you have any background skill that's necessary in their research. For many of the UROP positions though, you don't even need to have much skill in their research area since it's often cutting edge anyways.", "Interview Questions": "Considering your normal school work load, how much time can you commit to this project?"}, {"date": "1 Jul 2010", "title": "Student Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at MIT (Cambridge, MA) in Aug 2009", "Interview Descriptions": "presentation, panels, one on one with an office head. Be yourself--if you don't mind not getting a job. Pay attention to the climate of the office and how everyone interacts. I", "Interview Questions": "Walk me through your resume....\r\nDescribe a conflict within a team and how I handled it. "}, {"date": "6 May 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at MIT (Cambridge, MA) in Apr 2009", "Interview Descriptions": "I went to MIT for my undergraduate degree, so the application process was fairly straightforward. I emphasized heavily my hands-on research and internship experience, which I thought would be valuable going into experimental research. I did not receive any feedback on my application packet, just an acceptance letter. I was in close contact with faculty in my prospective department throughout the application process.", "Interview Questions": "There were no particularly difficult questions on the application; it was a straightforward graduate admissions package. "}, {"date": "18 Jul 2011", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at MIT (Cambridge, MA) in Mar 2009", "Interview Descriptions": "Based on prior presentations at conferences, one on one interview and advisor recommendations.", "Interview Questions": "How did you decide on studying physics?"}, {"date": "18 Mar 2009", "title": "Science/Engineering Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at MIT (Lexington, MA) in Feb 2009", "Interview Descriptions": "I gave a 45 minute presentation on my current work, then met with 3 separate individuals for 1:1 interviews.  The interviews were respectful give and takes where we had opportunity to discuss my work and the company's activities.  The questions were appropriate and not terribly hard.\r\n\r\nThe HR department is very disorganized.  I only had 2-day notice of my interview, and that a presentation was expected.", "Interview Questions": "They asked about technical details related to my work.  The questions were all specific to my research work."}, {"date": "16 Sept 2011", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MIT (Cambridge, MA) in Feb 2009", "Interview Descriptions": "Interview about prior research experience and academic interest. Discussions about future funding opportunities in various labs affiliated with the PhD program.", "Interview Questions": "Discuss: how the brain processes information. "}, {"date": "24 Jul 2010", "title": "Open Postdoctoral Applications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at MIT (Cambridge, MA) in Dec 2008", "Interview Descriptions": "initial contact at conference, then e-mail application with resume. e-mail reply back with request for letters of recommendation. 1 hr presentation about research done, 1 hour interview with Pi about reasearch done, ongoing research in the lab and my research interests. 1:1 or 1:3 meetings with alsmost all lab members.\r\nfinal meeting with PI, positive vibe, should let know my project interests and put that on paper.\r\ne-mail correspondence about when and how to start", "Interview Questions": "Why are you interested in our laboratory?"}, {"date": "24 Mar 2010", "title": "Engineering Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at MIT (Cincinnati, OH) in Nov 2008", "Interview Descriptions": "My interviewer was really nice and was very open to taking questions and talked about his own experience at MIT and how it helped him. The questions were interesting and thought provoking, so be sure to get a lot of sleep beforehand so as to be clear-thinking. He did take some notes as I talked.", "Interview Questions": "If the government gave you a project to lead how would you assemble your team?"}, {"date": "18 Dec 2012", "title": "Technical Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at MIT (Boston, MA) in May 2008", "Interview Descriptions": "Hiring and interview happened informally at a conference and then at MIT", "Interview Questions": "N/A"}, {"date": "18 Mar 2009", "title": "Web Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MIT in Mar 2007", "Interview Descriptions": "This was an internal referral, so I was interviewing with people I was mostly familiar with already.  I was interviewed by one person and then he was joined by a colleague for the second half of the interview. The interview process was fairly casual in terms of attire and also how they approached asking me questions. They may have discussed questions in advance but it seemed like most questions were improvised. Most of the time they diverged from a written list of questions.\r\n\r\nA few days later I was interviewed by a group (\"the team\") in a small office. There were 5 people present asking me questions and I didn't really know any of them. The group interview was not structured and was quite chaotic. I was able to ask them questions and found myself leading the interview at points. Later on it became more of a free for all when we got onto a hot button topic. I found the group trying to steer my responses in their direction (to their point of view) , I mostly agreed with them but chose to hold my ground. Based on their responses I realized that this position was not a good match. I later told the two main hiring managers that the position wasn't a good fit.\r\n\r\nThe Information Technology group there is interesting, the culture is fairly laid back and flexible. Many people work unusual schedules and are able to come in later and work later or work half days. Some people are able to work one day from home. This is a big part of why they're able to retain employees. The atmosphere is more artsy/newsroom than a Dilbert cube farm. People work hard but are still fairly chatty and they tend to congregate in the break room at lunch time. No one wears suits and very few people dress up. If you're wearing something nice, you either have a presentation or you're headed to a job interview. Overdressed people draw suspicion.", "Interview Questions": "Why do you want this job?"}]]