[[{"date": "2 Jun 2022", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Golden Gate University", "Interview Descriptions": "Two interviews with 2 people each. It included mock calls, and a lot of general questions, as well as scenario based questions. Be familiar with the company as well as the job.", "Interview Questions": "How would you answer X question for a prospective student?"}, {"date": "3 Feb 2022", "title": "Student Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Golden Gate University", "Interview Descriptions": "Great interview with a manager who asked questions about my background and my experience. The Head of the department also interviewed me about cultural fit, future goals, and projects I would like to take on myself.", "Interview Questions": "Please tell me about yourself?"}, {"date": "23 Jun 2020", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Golden Gate University", "Interview Descriptions": "Standard interview process. General and role-specific questions. Phone screen, group interview and then 1:1 final round. Wait between each portion of the process was standard 1 week or more. Presentation was part of group process.", "Interview Questions": "Why do you want to work at Golden Gate University?"}, {"date": "15 Oct 2019", "title": "Director of Digital Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Golden Gate University (San Francisco, CA) in Jul 2019", "Interview Descriptions": "I applied online and was asked to do a 45 minute, first round video interview with two members of the hiring team.  It was an awkward interview in which the VP of Communications continuously stressed the high level of tension within the department. It did not make me want to work there. Overall she spent more time talking than interviewing me.  At the interview, they asked me to send work samples over, which I did immediately. They never contacted me after that.", "Interview Questions": "Asked about experience with various digital media channels"}, {"date": "27 May 2023", "title": "Senior Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Golden Gate University (San Francisco, CA) in Jun 2019", "Interview Descriptions": "The interview process was easy and quick. They were very professional and personable. They immediately made you feel very comfortable, even throughout the entire interview process. They made me feel comfortable.", "Interview Questions": "What do you think you are the right fit?"}, {"date": "9 Jul 2019", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Golden Gate University (San Francisco, CA) in Feb 2019", "Interview Descriptions": "The initial screen took 2 weeks after applying; with an additional two weeks to schedule the screen and another week for an in-person interview.   Appear to be building a pool of candidates as if hiring on a seasonal basis.   The interview and role was sales driven.", "Interview Questions": "A question was asked about how you would respond to a prospective student call, where the student is interested but indecisive.  "}, {"date": "19 Jun 2018", "title": "Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Golden Gate University", "Interview Descriptions": "5 rounds of interview process. It was more of business side and related issues and would  ask how would you handle such situation if you were given a chance to handle them. So basically you  would handle situational based answers", "Interview Questions": "how would handle a depressed student ?"}, {"date": "14 Nov 2017", "title": "Associate Registrar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Golden Gate University in Oct 2017", "Interview Descriptions": "Was interviewed over the phone by the Registrar, and then for the second, came into the office to interview with the Registrar and the Associate Registrar at the time. What was interesting about the process, was that although I wasn't offered the position, the Registrar recommended I apply for the Assistant Registrar position. An internal candidate was hired.", "Interview Questions": "What is your favorite app?"}, {"date": "27 Jul 2017", "title": "Career Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Golden Gate University (San Francisco, CA) in Jul 2017", "Interview Descriptions": "I applied for the job online and was interviewed over the phone the next week. The phone interview lasted about 23 minutes. I am currently waiting to hear back from them next week to see if I got the position.", "Interview Questions": "Why do you want to work for Golden Gate University?\r\nWhat do you know about Golden Gate University student population?\r\nDo you have any questions?\r\n\r\n"}, {"date": "7 Feb 2017", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Golden Gate University", "Interview Descriptions": "I applied online and heard back from GGU the next day.  I was told I might be a good fit for the role and they listed the salary at $48,000 in their introduction email and asked if I wanted to interview.  I was a little thrown off and explained that was lower than what I was currently making, but if I could interview so we could all see if I was a good fit and if my experiences matched what they were looking for, then salary could be negotiated then.  They responded that there was no room for negotiation, take it or leave it.  So...I decided not to interview.  Who can survive in San Francisco making $48,000?? Especially for an assistant director position!  I'm not sure how GGU can expect to gain and maintain talent with compensation that's so low.", "Interview Questions": "Since I didn't interview, the only question I was asked by GGU was regarding accepting their low salary."}], [{"date": "13 Sept 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Golden Gate University (San Francisco, CA) in Dec 2016", "Interview Descriptions": "A one-on-one interview followed by a writing test. The interview was to understand how you will use your past experiences in the current role. Attitude and personality match with the basic job role.", "Interview Questions": "How do your past job experiences align with the current job role? "}, {"date": "18 Jul 2016", "title": "Financial Aid Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Golden Gate University (San Francisco, CA) in May 2016", "Interview Descriptions": "Ok experience. They were a bit unorganized, but also very responsive when it came to follow up. Had 2 interviews, both group/panel. Ended up going with someone with more financial aid experience, but let me know I would be recommended for another position.", "Interview Questions": "What is your favorite app?"}, {"date": "11 Oct 2016", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Golden Gate University (San Francisco, CA) in Jan 2016", "Interview Descriptions": "Applied online got an email to schedule telephone interview\r\nAsked One question why GGU?\r\nGot another email for in-person interview\r\nAsked couple of question such as strength and weaknesses, major achievements, etc make sure you dress properly and answer with full confidence. Which means a lot to the team", "Interview Questions": "Why GGU?"}, {"date": "8 Sept 2017", "title": "Academic Technology Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Golden Gate University (San Francisco, CA) in Jan 2016", "Interview Descriptions": "On call technical round regarding scenarios from past experiences. In-person technical round which includes 2-4 interviewers who give you scenarios around the university and how in general would you respond to support them.", "Interview Questions": "What are the three things that you might check if there is a classroom call regarding the overhead project not working?"}, {"date": "8 Jul 2015", "title": "Circulation Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Golden Gate University (South San Francisco, CA) in Nov 2014", "Interview Descriptions": "English Skills and flexible schedule are the most important parts of the interview. Be honest and show interest. The interview will be very short and concise. The fact that you already have a SSN is a plus because they are usually in a rush to hire new student assistants.", "Interview Questions": "They asked if I was willing to work on weekends and how was my weekly schedule."}, {"date": "1 Sept 2014", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Golden Gate University", "Interview Descriptions": "Basic Interview. In person with about 5 people. Each will ask you a few questions, each are members in the department. There was a second follow up interview that was just one on one with the VP. Everyone was nice and friendly, seemed relaxed. Process took around 4 weeks, and they were frequently in touch.", "Interview Questions": "N/A"}, {"date": "17 Jan 2016", "title": "ELearning Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Golden Gate University (San Francisco, CA) in Mar 2014", "Interview Descriptions": "I applied online, then there was a 1:1 interview and a few days later I already got the offer. Only 1 round of interviews, with the direct manager. They were very nice and conducted the process in a timely manner.", "Interview Questions": "Customer service experience, role playing."}, {"date": "9 Mar 2017", "title": "Journalist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Golden Gate University (San Francisco, CA) in Jan 2013", "Interview Descriptions": "It was an in person interview.  I spoke with 3 people.  Took about a week until final interview after being given a tour of the facility.  Overall, the process was fairly standard.", "Interview Questions": "Salary"}, {"date": "19 May 2015", "title": "Graduate Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Golden Gate University (San Francisco, CA) in Jan 2011", "Interview Descriptions": "Received an email and conducted a phone interview. Next was the group/panel interview. There were at least 3-4 people asking questions by turn. Then the next day the hiring manager will call to let you know if you received the job.", "Interview Questions": "Basic questions."}, {"date": "27 Apr 2010", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Golden Gate University (San Francisco, CA) in May 2008", "Interview Descriptions": "It was a really easy process - I was contacted for an initial phone screening interview.  After the phone screening I came to campus and interviewed with my coworkers and supervisor in separate meetings - lasting about an hour each.  Then I was shown around the campus.  It took about 2 months after I interviewed before the position was offered. The entire process was about 3 months long.", "Interview Questions": "What do you see as the difference between counseling and coaching?"}]]