[[{"date": "29 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "If you’re being interviewed as a new grad, they ask behavior questions and what would you do if X happened. Nothing academically or anything. Overall a fairly easy interview, got an offer the next two days.", "Interview Questions": "How would you deal with a rude family member?"}, {"date": "25 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "Informal and practical interview process done with both manager and a clinical supervisor. Friendly and not intimidating at all. Management willing to work with you in terms of flexible scheduling.", "Interview Questions": "How would you prioritize x, y, z type of patient?"}, {"date": "1 Jul 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Presbyterian Hospital (Los Angeles, CA) in Jun 2021", "Interview Descriptions": "Three different managers took turns asking interview questions.  Started with introductions and tell me about yourself. Interview was approximately less than 30 minutes long.  Questions were based on personal work experiences and no clinical scenario questions", "Interview Questions": "Describe an unsafe practice and how you handled it.  Describe leadership roles that you have been involved in on your unit."}, {"date": "7 Jun 2021", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valley Presbyterian Hospital in Jun 2021", "Interview Descriptions": "Was contacted by HR had a 15min information phone call set up an interview they were only holding them on one day, but it worked for me. Asked the typical why valley, tell me about yourself, and why nursing. Then they asked about 10 scenario based questions really focused on how you would respond to situations and who would be a good fit for the team. I thought it was challenging, but I was able to highlight my skills and why they should hire me. The interviewers were really kind and honest about the expectations and current vibe on the unit.", "Interview Questions": "What to do when patient has new onset confusion, how to respond when another staff member doesn't complete patient care, CNA nurse relationship "}, {"date": "24 Mar 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Presbyterian Hospital in Feb 2021", "Interview Descriptions": "The interview process was pretty straight forward. Was asked to bring 4 portfolios and it was a panel of 3, one being a nurse who recently completed the program. Started with generic questions, and then went more to scenario questions. Interviewed for telemetry", "Interview Questions": "Tell us about yourself. Why do you want to work in telemetry? Why Valley Pres? If a patient has a BP of 210/180 what do you do? "}, {"date": "15 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Presbyterian Hospital (Los Angeles, CA) in Nov 2020", "Interview Descriptions": "Met with Human resources first and was walked to in person 30 minute interview. Very personable interviewers & friendly staff. I would recommend this hospital.  Interview went over-time. The process to get back to me with an offer was delayed due to COVID however they apologized and communicated.", "Interview Questions": "Describe a time when you broke the rules and how did you turn this situation around? "}, {"date": "17 Mar 2021", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in Jun 2020", "Interview Descriptions": "I attended several in-person interviews over several hours in HR and the administration building. Some interviews were 1 on 1 and others were group interviews. It ended up being a very long day", "Interview Questions": "Please Describe your leadership style"}, {"date": "1 Apr 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Presbyterian Hospital in Mar 2020", "Interview Descriptions": "Fairly easy, asked common interview questions - panel of 2. Total of 20 mins. The interviewees were running very late, had to wait an hour before seeing them. I believe it was the nursing manager and a charge nurse? They had good poker faces, couldn't really tell how they were accepting my answers.", "Interview Questions": "Tell us a time when you had a miscommunication with a colleague? "}, {"date": "11 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valley Presbyterian Hospital in Sept 2019", "Interview Descriptions": "I applied through their website - I got a call about one month later for an interview and got a job offer the next day! I was interviewed by only 2 people - the unit manager and one clinical nurse; however I know other units can have up to 6 people interviewing you.", "Interview Questions": "Tell me a time where you had a difficult patient and what did you do?"}, {"date": "4 Oct 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Presbyterian Hospital (Los Angeles, CA) in Aug 2019", "Interview Descriptions": "Smooth, with a panel of 4 included the Director, nurse manager, Nursing supervisor, the focus was more behavioral opposed to knowledge. They really wanted to understand how I react to certain situations and how I utilize my problem solving skills.", "Interview Questions": "Tell me about a time when you had a miscommunication with a colleague? "}], [{"date": "24 Aug 2020", "title": "RN New Grad Medical Surgical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Presbyterian Hospital in Aug 2019", "Interview Descriptions": "Friendly environment. Panel interview with 3 nursing managers. Very nice. Ultimately, they are seeking to find the best fit for the unit and for the hospital. Asked behavioral and 1 scenario question. Overall good experience", "Interview Questions": "Tell me about yourself\r\nWhy Valley Presbyterian Hospital?\r\nHow can you seek to provide Excellency in you service?\r\nWhy should we hire you?\r\nPrioritization question which patient would you see first?\r\n "}, {"date": "10 Aug 2021", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in Jun 2019", "Interview Descriptions": "I was contacted about 2 weeks after I submitted my application.  Interview was the unit manager. Easy questions about why VP , how I handle stress, and about my experience as a CNA.", "Interview Questions": "Tell us about your experience as a CNA "}, {"date": "6 Sept 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in Aug 2018", "Interview Descriptions": "5 Directors and Managers on the panel asked scenario and personality questions pertaining to your own resume. The Directors and Managers stayed professional and friendly. Interview lasted about 20 min and I was out the door in no time.", "Interview Questions": "Have you ever had stressful situation? what was it and how did you handle it? \r\nWhat brought you to nursing? \r\nhow did ____experience change you as a person and how will that contribute to this hospital? \r\nTell me about yourself \r\n"}, {"date": "22 Sept 2018", "title": "PA-C Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Valley Presbyterian Hospital in Aug 2018", "Interview Descriptions": "Great interview with pleasant directors and staff.  HR has been on point with application process.  Medical directors did not waste time and focused on making sure I was a good candidate with the right kind of experience.  Informal but focused questioning.  Hope it all goes as smooth from here.", "Interview Questions": "clinical experience"}, {"date": "16 Mar 2018", "title": "New Grad Clin I RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA)", "Interview Descriptions": "The interview was very straightforward and I was pleasantly surprised by how friendly and approachable the interviewing managers were. It was a panel interview with managers from several units. The questions were all very subjective and easy to answer.  There were no clinical knowledge questions. I received a response regarding the job within about a week. There was a short informal interview with HR over the phone prior to receiving an offer to interview.", "Interview Questions": "Describe a time you provided exceptional customer service. \r\n\r\nDescribe a mistake you've made while in the clinical setting and how you dealt with it. "}, {"date": "5 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "I was hired as a new graduate here. Hiring process was pretty straightforward. Staff were very polite during interview. The panel all went around asking general interview questions, such as what are your strengths and weaknesses? Why do you want to work at Valley Presbyterian?", "Interview Questions": "What was your favorite clinical rotation from nursing school? "}, {"date": "12 Nov 2016", "title": "Patient Access Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA)", "Interview Descriptions": "One interview sit down with immediate management. Interview took no more than about 20 minutes. Think of it as a list of questions being asked than a natural flow of conversation. Nothing too difficult, just standard administrative work questions to be expected.", "Interview Questions": "What is teamwork?\r\nWhat hospital systems have you worked with?\r\nName a time when you disagReed with management."}, {"date": "6 Aug 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "HR forwarded my resume to the department's director. The director called me a couple days later to gauge my interest and we set up an interview. It was a panel interview and they were all very pleasant and seemed to enjoy their jobs which is awesome. Interview took about 30-40 minutes. I got a call back several days later with an offer.", "Interview Questions": "Why are you interested in this department?"}, {"date": "30 Jan 2016", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "the interview consisted of a panel of 6-7 nurses with different roles. It wasn't very intimidating at all, they were very nice. There were a mix of general, behavioral, and clinical questions. They didn't expect too much from a new grad for the clinical questions though.", "Interview Questions": "mix of general questions, behavioral and clinical questions"}, {"date": "25 Jan 2016", "title": "Rn-ICU Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "I talked to the RN recruiter via email. She told me to apply online first. Then about a week later, she scheduled me an interview with ICU director. They called me the day before about the interview so I was not prepared at all. It was a panel interview with about 5-8 nurses. Some were supervisors and some were newly hired people. Most of the staff who are a part of the interview have worked there for over 10 years. Be prepared to turn in many copies of resume. They were also interviewing many other people on the same day. Each person asked 1-2 questions. The whole thing took about 1 hour.", "Interview Questions": "why do you want to work at ICU?"}], [{"date": "24 Jul 2015", "title": "CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "Talked to a recruiter at a job fair who had me apply online and passed my resume along as well. Called back a few weeks later. Interviewed by 3 people at the same time. They seemed nice but one of them asked most of the questions while the other two kind of just listened and asked one question.", "Interview Questions": "Tell me about a time you did something for a patient they were grateful for."}, {"date": "5 May 2016", "title": "Patient Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in May 2015", "Interview Descriptions": "The interview process was informal and relaxed. I was asked many questions based on what I would do to prioritize my day and keep patients safe. I was asked how I intended to balance a career with school and other commitments. I was also asked about my past work experiences and how they have prepared me for the role I applied for.", "Interview Questions": "Name a time when you had conflict with a patient or family and how did you resolve that conflict."}, {"date": "6 Apr 2015", "title": "Clinical Nurse I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in Mar 2015", "Interview Descriptions": "I originally contacted the recruiter and interviewed with the ICU director for a new grad position a few weeks later. She was super friendly and open. It felt like a normal conversation. Everyone in the hospital seemed like they like their job and know each other very well.", "Interview Questions": "Why ICU? Tell me about yourself? What scares you now that you have graduated?"}, {"date": "7 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in Nov 2014", "Interview Descriptions": "It was a panel interview with 3 managers. They each took turns asking me standard behavioral questions. No clinical questions were involved. They were very approachable and professional and showed a genuine passion for the organization, which was comforting. The interview lasted approximately 45 minutes and I was also introduced to additional managers before I left.", "Interview Questions": "Why do you want to work here?"}, {"date": "23 Jan 2014", "title": "Clin Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "I applied online and was invited for an interview. Some of the questions they asked were:\r\n\r\n1. Why did you go into nursing?\r\n2. What is your favorite memory from nursing school?\r\n3. Describe a conflict you had with someone in the hospital?\r\n4. Describe a time when you demonstrated evidence-based practice?\r\n5. What makes you able to handle such a heavy load here (5 patients)? \r\n6. Why do you want to do oncology?", "Interview Questions": "Why didn't you pursue medical school?"}, {"date": "17 Sept 2013", "title": "Ultrasound Tech Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Valley Presbyterian Hospital", "Interview Descriptions": "I was referred to the hospital by someone i interviewd with right before i applied. You make a  phone call to meet with director of radiology for an interview. It was easy.", "Interview Questions": "N/A"}, {"date": "14 Feb 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in Jan 2013", "Interview Descriptions": "Fast, quick. Typical interview process.  Asking strength/weaknesses, where do you see your self in 5, 10 years. Name three words to describe yourself. Are you willing to work weekends fairly easy .", "Interview Questions": "N/A"}, {"date": "21 Dec 2016", "title": "Registered Nurse, Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Presbyterian Hospital (Van Nuys, CA) in May 2012", "Interview Descriptions": "Interviewed with the manager, who reviewed my history of over ten years experience in specifically ER nursing, most recently a 13 week travel assignment at an east Los Angeles White Memorial Medical Center ER.", "Interview Questions": "Can you work a 12 hour 13:00- 1:30AM Shift full time without being too tired and having absences? "}]]