[[{"date": "31 May 2023", "title": "Clinician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Health Center, Inc. (Bethel, CT)", "Interview Descriptions": "There were two rounds to the interview process, both via zoom. The initial interview was very vague and mostly focused on job requirements that were listed in the posting. The second interview was with management.", "Interview Questions": "Relevant experience? Ability to meet stated schedule? Level of independence?"}, {"date": "7 Mar 2023", "title": "Research Scientist/Director of Research Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Community Health Center, Inc.", "Interview Descriptions": "The interview with leadership involved reviewing You tube videos of interviews with healthcare executives (radio shows). There was hardly any conversation about the work that would need to be done and vision for future research. That is fine since it would be the responsibility of the Research Scientist to drive some of that work. Things were alright until it came to salary negotiations. They were paying at least 40-50K below the market rate and expected a person in this position to bring funds, in addition to developing and driving research. Offer was accepted after negotiations, however it was rescinded later without any explanation. Overall, interviews had several red flags, the organization did not appear to be stable and solidly funded, vision and strategic leadership appeared to be lacking, and appeared to be a top down organization.", "Interview Questions": "What did you like most about the organization? What do you know about us?"}, {"date": "18 Jan 2023", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Health Center, Inc.", "Interview Descriptions": "You have to complete 4-5 interviews that include the Founder of the health center. Each stage for the interviews is different based on your interviewer and their position. The first stage is with the manager, the second is with other co-workers, the third is with the senior scientist, the fourth is with the principal investigator and the fifth is with the co-founders.", "Interview Questions": "Tell me about your experience working with patients?"}, {"date": "11 Nov 2022", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Community Health Center, Inc.", "Interview Descriptions": "This company typically requires at least 3 rounds of interviews. My first interview was with the Director of the Weitzman Institute, followed by a panel interview with potential colleagues. The final interview will always be with the President and VP of Community Health Center, Inc. Be prepared to show your knowledge of the organization and do as much background research as possible.", "Interview Questions": "What do you know about CHCI? Why are you interested in this position?"}, {"date": "24 Sept 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Center, Inc. (Middletown, CT)", "Interview Descriptions": "The interview process was fairly quick, but certainly felt that after the interview I had a bad feeling about this company. I had asked about the worked life balance and they informed me that sometimes people pulled an all nighter to get things done (which happens more than once). Also, after asking about the support and guidance , I was informed that expectation is for the person to be able to get through the interviewer said not much “hand holding”!! I certainly saw red flags ", "Interview Questions": "What prior experience and why want to work there? "}, {"date": "29 Dec 2020", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Center, Inc.", "Interview Descriptions": "You have to go through A LOT of interviews, the process takes awhile. The also ask you a lot about what you know about the organization - do you research beforehand!", "Interview Questions": "What do you know about the company"}, {"date": "19 Jun 2019", "title": "Human Resources Generalist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Health Center, Inc. in Jun 2019", "Interview Descriptions": "My candidate and interview experience at Community Health Center was positive. It starts a phone assessment to gauge your professional strengths, weaknesses, and personality type.  The next step was a very friendly and in-depth phone screening that gives you an ample opportunity to ask questions and understand the ins and outs of the role you are applying for. I had an in-person interview with three different members of staff who were both very friendly, personable, and professional. They both put me at ease during the process, which involved great open-ended questions more geared towards both my professional and personal experiences.", "Interview Questions": "What do you know about the CHC?\r\nWhat are your greatest professional strengths?\r\nTell me about your experience with the HRIS system we use?\r\n"}, {"date": "21 Sept 2020", "title": "Dental Hygienist RDH Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Health Center, Inc. (Boston, MA) in Mar 2019", "Interview Descriptions": "phone interview first, then face to face interview with a panel of dentists and clinical manager, the interview itself was pretty comfortable and laid back. They will ask you a series of behavioral questions.", "Interview Questions": "Why do you want to work here?\r\nWhat do you know about this facility?\r\nDescribe your favorite / least favorite patient interaction\r\nWhy should they hire me? \r\n"}, {"date": "25 Nov 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Community Health Center, Inc. (Bristol, CT)", "Interview Descriptions": "The interview with the site and with Chief Nursing Officer went well however the CEO and VP completely turned me off from working there . The\nCEO and VP only asked me what I had been researching about the company . They never asked anything about me or the job . The only wanted to make sure I had done lots of reading on the company and wanted me to boost their ego about the company during my interview", "Interview Questions": "The history of the company"}, {"date": "30 Jul 2018", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Community Health Center, Inc.", "Interview Descriptions": "Everyone who works there has a second interview with the CEO and VP of Clinical. VP showed up 20 minutes late and CEO didn't bother showing up. Not very respectful but  it didn't phase me at the time. The VP kept telling me how privileged i was to have an advanced degree and i think she wanted me to admit that i didn't work hard to get to where i am. She also got really defensive when i brought up some articles from the 2010's that were of concern. \nI politely declined the position, but I'm not willing to work for an organization that 1) doesn't respect their employees, 2) is under constant government scrutiny, and 3) makes erroneous assumptions about potential employees. I rescinded my application right after.", "Interview Questions": "they want to know that you know about their programs and research"}]]