[[{"date": "10 Feb 2021", "title": "Financial Aid Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bellevue University", "Interview Descriptions": "The interview was fine. They had 5-7 people in the room for a position starting at $16/ hr which seemed eccessive to me. They took turns asking questions, and were all engaged. It was intimidating to have that many people in the room. But they each provided input to my questions.", "Interview Questions": "How would you handle a difficult situation?"}, {"date": "17 Nov 2020", "title": "Communication Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bellevue University", "Interview Descriptions": "It happened in the time of Covid 19, therefore it was via video chat. Fairly easy, two steps. Mostly béhavioral questions and personality questions. I spoke to the manager and the director of the department.", "Interview Questions": "Tell us why this job?"}, {"date": "5 Jul 2023", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bellevue University (Bellevue, NE) in Apr 2019", "Interview Descriptions": "Fun the process was very easy and straight forward . Very relaxed office and quick response to interview. Did not have any trouble fi ding the office once on campus very friendly staff to gelp fuide you to your area .", "Interview Questions": "When can you start and availability"}, {"date": "16 Feb 2022", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bellevue University in Oct 2018", "Interview Descriptions": "One phone interview and another on-site interview. Typical situational interview questions. Offered the position within the same week. Spoke directly to the hiring manager, the process did not involve recruiting.", "Interview Questions": "Why I was interested in the role."}, {"date": "29 Nov 2017", "title": "Relationship Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Bellevue University (Victorville, CA) in Oct 2017", "Interview Descriptions": "I applied online and received a phone call from HR the same day.  We scheduled a phone interview to be done within a week.  After the phone interview with HR, I had a phone interview with the hiring manager a few days later.  The hiring manager stated he would select three individuals as finalists for the final in person interview which would include him as well as the president of the community college.  The in person interview consisted of a 10 minute long power point that I had to developed based off the information that I had via the school's website.  \r\n\r\nAfter the interview I was told that a selection would be made within a few days and I would hear back.  Almost a month went by and I was the one that had to make contact regarding the position.  At the end, I was not selected yet I was offered to have another final interview at a different community college that was further away from me.  I declined this offer mainly because my lack of experience of the area, the long commute through Los Angeles traffic as well as the lack of communication through the interview process.\r\n\r\nMy experience overall was neutral.  HR as well as the hiring manager were both extremely professional, very knowledgeable and helpful through the process.  However, the lack of communication and the offer to a different college that I had no interest in left a sour taste in my mouth.", "Interview Questions": "How would I relay the situation, to a student, of a marketed new degree program that would suddenly have to be cancelled because of lack of enrollment?  \r\n\r\nTell me about the experience at your previous three employers.\r\n\r\n"}, {"date": "30 Dec 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bellevue University (Bellevue, NE) in Jul 2015", "Interview Descriptions": "Disorganized and lacking in meaningful discussion of critical issues unless raised by the interviewee.  It is difficult to say much more because these people have no idea how to do hiring interviews.", "Interview Questions": "N/A"}, {"date": "25 Apr 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Bellevue University (Bellevue, NE)", "Interview Descriptions": "Basic, met with HR and a few that I would work with, basic questions asked. Did get to ask a lot of questions to learn about what would be expected. Should have asked more about culture and support.", "Interview Questions": "Strengths, situational questions."}, {"date": "25 Aug 2014", "title": "Office Assistance Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Bellevue University", "Interview Descriptions": "I was asked my previous working experiences and just talk with my supervisor, then she started to ask when I can begin to work. I was surprised and confirmed with her that if I was hired. Usually this position is hired in the interview.", "Interview Questions": "How many profs you know in COB"}, {"date": "17 Jun 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bellevue University", "Interview Descriptions": "Several interviews in the screening process.  Able to meet several leaders in the university which helped determine the best fit in both skills and personality.", "Interview Questions": "Scenario based interviews that tested skills at all levels."}, {"date": "3 May 2011", "title": "Can't Say Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bellevue University (Bellevue, NE) in Mar 2011", "Interview Descriptions": "Not well organized", "Interview Questions": "They wanted a business plan"}], [{"date": "28 Oct 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Bellevue University in Jun 2010", "Interview Descriptions": "Phone interview with Dean of College. Lasted approximately 30-45 minutes.  Interviewer was very professional and asked behavioral based questions.  Was also very knowledgeable about actual class I would be teaching.  Very honest about the time commitments required weekly for position.", "Interview Questions": "No questions was out of the ordinary. "}, {"date": "10 Dec 2009", "title": "Senior Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bellevue University (Bellevue, NE) in Oct 2009", "Interview Descriptions": "The Bellevue University receptionst emailed/called me to set up an interview. We determined a date/time. \r\nI showed up for the interview, but needed to wait to meet with the interviewer as they were on a business call. \r\nInstead of interviewing for the Sr. Business Analyst position, I ended up interviewing for the Manager of Business Analyst positions. I was not as prepared for a management interview. The interviewer asked general \"how would you handle X\" if you were a manager type questions.", "Interview Questions": "Have I ever had to fire someone"}]]