[[{"date": "N/A", "title": "SSA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "It was long and they asked a lot of questions and examples and hypotheticals. They also asked a lot of examples of situations on previous jobs. They were very friendly and offered examples themselves", "Interview Questions": "How do you prioritize your tasks if you have multiple?"}, {"date": "13 Jun 2023", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "Short interviewing process. Communication definitely could have been better. Questions were only pertaining to your previous roles, with little room for a relaxed and connective conversation. I had a total of 3 interviews and they were pretty long going for about 45-50 minutes each (except for first interview which was with talent acquisition).", "Interview Questions": "Q: How do you manage having multiple tasks and assignments due at the same time with short deadlines?"}, {"date": "18 May 2023", "title": "Faculty Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at DeVry University (Los Angeles, CA)", "Interview Descriptions": "Interview was smooth, they ask the average questions as to how will you contribute and why you are interested. They also ask questions as “what would you do if you had an issue for instance with a student when assisting them”", "Interview Questions": "How do you handle private information? Since we deal with peoples social, address phone numbers etc."}, {"date": "1 Jun 2023", "title": "Sr. Career Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at DeVry University (Los Angeles, CA) in May 2023", "Interview Descriptions": "30-min phone screen for initial interview after taking an assessment. Then meet with hiring manager and search committee, then do a mock appointment. I forget what the last step is.", "Interview Questions": "Recruiter spent most of the time speed talking through the expectations/reqs of the position."}, {"date": "28 Apr 2023", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University (Surprise, AZ) in Mar 2023", "Interview Descriptions": "Great process. Met with Valori for and initial interview. Then an interview with with welcome team and continuing. Over all the interview process was very easy. Overall the process took three weeks.", "Interview Questions": "How can you separate work from home and time off. What do you do to get out and away from the desk."}, {"date": "10 Feb 2023", "title": "Visiting Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at DeVry University (Cornwall on Hudson, NY) in Jan 2023", "Interview Descriptions": "A strange process. The faculty chair was the first to reach out. Discussed the presentation process for their review board. Was unclear on what the role or location would be.", "Interview Questions": "They were observing my presentation in lieu of asking questions."}, {"date": "2 Jul 2022", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (New York, NY) in Jun 2022", "Interview Descriptions": "First you have a screening call, mine was a really nice woman who explained the job thoroughly. The interview itself was negative for me. The interviewer I had told me \"empathy is a weakness\" , that he \"only cares about results\", and that the employee they need cant have depression because the job is actually a sales call position and you will get a lot of rejections.", "Interview Questions": "What do you do if you call someone and they say yes to DeVry but then doesn't complete any of the applications necessary and keep asking for deadline extensions?"}, {"date": "22 Apr 2022", "title": "Associate Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "It was a virtual interview with different team members where I answered a variety of questions.  Each person took a turn asking standard interview questions to include questions on my background.", "Interview Questions": "How do you overcome challenges?"}, {"date": "1 Apr 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University", "Interview Descriptions": "I applied online and received an email from a recruiter to schedule a call. After that call, I was scheduled for a meeting with the hiring manager.  The final step would be one more interview, which I did not have. The company asks candidates to take a Predictive Index test. I took this test three times in the year for various employers and received different results every single time. The result I received in this case did not fit my actual work and personality styles but they seemed to take these test results very seriously as there was a somewhat negative point that came up several times in my interview. I would have preferred that this test be something taken post-interview, as just a general picture, rather then pre-interview, as it created bias and directed the interview in a way. I felt like I was defending myself against this one negative aspect that the report stated.. which wasn't at all accurate. I hope that they consider the candidate in front of them going forward rather than this report that does not hold much value.", "Interview Questions": "Questions generally asked for examples that were relevant to the job. "}, {"date": "26 May 2022", "title": "Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at DeVry University (Aurora, IL) in Apr 2022", "Interview Descriptions": "It 2 step process. Initial screening with the talent acquisition recruiter Then panel interview with 3 people over teams. Will need internet connection with cat5 cable as their computers don’t operate via Wi-Fi.", "Interview Questions": "Describe a time when you were asked to do something that made you feel uncomfortable. Describe a time you had to tell a customer no."}], [{"date": "28 Mar 2022", "title": "Student Support Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "Horrible! Comparable to an interrogation. 3 supervisors asking questions most of the time over talking one another. Compared the department to a call center environment, 40 minute interview ..Lengthy!\n\nWaste of time", "Interview Questions": "Is there a question you wanted us to asl but we didnt?"}, {"date": "3 Jan 2022", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "1st I had an over the phone interview with HR and then I had my in-person interview with two managers.  The next day the HR rep called me with an offer. It was a smooth process", "Interview Questions": "How are your weaknesses?\r\nTell me a time you dealt with an angry client. How did you handle that situation?"}, {"date": "18 Nov 2021", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "Averted questions. Communicated about my interest, strengths, and ability to work remotely. It was pretty lengthy due to having conversations about job experiences and what I do in my work now.", "Interview Questions": "How would I overcome the challenges that comes with working remotely?"}, {"date": "12 Nov 2021", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University (Redding, CA) in Nov 2021", "Interview Descriptions": "Very informative without being formal. Very personable Interviewer. I felt very comfortable. Talked about how remote school is getting more and more popular. If I was a Tackie? Would remote be a problem for me.", "Interview Questions": "Straights, weakness, why do want to work here..the usual"}, {"date": "10 Sept 2021", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "Semi lengthy process but just be prepared for the behavioral questions and how to respond to scenario type questions. You will know in a few days whether they will offer you the position", "Interview Questions": "What was one of your biggest accomplishments? "}, {"date": "21 Apr 2021", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "It was a smooth process and interviewed with about 3 different people on separate occasions.  My interviews were done virtually as I was out of state and relocating. The team was very communicative and always knew the next steps in the process.", "Interview Questions": "What can you bring to DeVry?"}, {"date": "29 Mar 2021", "title": "Admissions Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University (Philadelphia, PA)", "Interview Descriptions": "I went through submitting my online application, cover letter, and resume. Then I also did  interviewsfor three seperate rounds. The process itself was very time consuming, they left you waiting between rounds forever before letting you know if you would be called in for the next interview.", "Interview Questions": "They asked about how you would mesaure KPI's in the admissions call center. They asked how you would measure ROI of a career if someone asked. "}, {"date": "12 Apr 2021", "title": "Student Services Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University in Feb 2021", "Interview Descriptions": "Phone interview that lasted 30 mins. Interviewer even called the position a call center position that requires making phone calls 6+ hours a day. Also have to handle 100-200 new students every 2 weeks.", "Interview Questions": "Name a time where you had to overcome a difficult situation. "}, {"date": "27 Jan 2021", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "two people joined after an initial call with the recruiter. Clearly it's all sales based because the recruiter didn't listen to me when I said not interested in sales anymore and lied saying it's not similar.", "Interview Questions": "behavioral mostly and asking how I would deal with a situation without knowing their protocols"}, {"date": "25 Dec 2020", "title": "Senior Student Success Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "Interviewed three times... and then denied. Everyone made it seem like they were super interested and then at the end, the high level management denied my application. I am surprised because I was really hoping an answer, and the fact that they moved me to the 3rd interview and didn’t hire me, was a complete waste of time... oh well, whatever happens, happens for the good! Better try Walden or Pearson, Kaplan. Those are some of the good ones that give better responses and have a quick hire process.", "Interview Questions": "General questions and behavioral questions"}], [{"date": "2 Nov 2020", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "1 prescreen and 1 virtual interview. \nVirtual Interview was with two managers and they discussed the job. Very sales-like. We did some role-playing with no background provided. Seemed like they want someone who will obey to any metrics/quotas they have in place.", "Interview Questions": "\"Pretend I'm an adult interested in continuing in education, but don't have the financial resources to do so. How would you persuade me to move forward?\""}, {"date": "14 Aug 2020", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at DeVry University", "Interview Descriptions": "Poor candidate experience overall. I am glad not to proceed further with this institution as I received a glimpse as how to how they must treat their internal employee population.", "Interview Questions": "No questions were asked of me."}, {"date": "16 Apr 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at DeVry University (Joliet, IL) in Apr 2020", "Interview Descriptions": "After applying i received a phone call within a week and the lady was so sweet and nice and upbeat. We set up a phone interview 2 days later after the phone interview they set up the skype interview 2 days after that. A quick process i appreciated it.", "Interview Questions": "when was a time you were able to seal the deal. "}, {"date": "10 Jan 2020", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "The process started with a timed test to take before a phone interview with Talent Acquisition, then a meeting with the manager, then a third web interview with the Group Director", "Interview Questions": "Background info, what you would do in certain situations."}, {"date": "4 Oct 2019", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at DeVry University (Orlando, FL) in Sept 2019", "Interview Descriptions": "You have to first do a phone interview with HR and then you have to interview with the manager who is also a dean after that he got to decide how many more interviews he wanted you to do.", "Interview Questions": "Why are you interested in this job?"}, {"date": "28 Jul 2019", "title": "Student Support Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University", "Interview Descriptions": "I first had a phone screen and was then moved forward to the next step which an in person interview at the site. The recruiter told me one time and told the interviewer another time. He was busy for the rest of the day and was unable to make time for me. The recruiter tried to get me back in as soon as possible and I ended up interviewing with 3 more people. Throughout the process I felt like my time was wasted and giving a candidate the wrong interview time was unacceptable.", "Interview Questions": "Behavioral interview questions "}, {"date": "22 Oct 2020", "title": "Graduate Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at DeVry University (Arlington, VA) in Mar 2019", "Interview Descriptions": "Extremely friendly and welcoming. They directed me to the room where I would be interviewed. Two recruiters came and interviewed me and asked me about myself. They asked me my interests, hobby and things such as that", "Interview Questions": "Tell me about yourself. Why should we hire you?Extremely friendly and welcoming. They directed me to the room where I would be interviewed. Two recruiters came and interviewed me and asked me about myself. They asked me my interests, hobby and things such as that"}, {"date": "31 Jan 2019", "title": "Visiting Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "I received an email indicating that they were interested in my application that I sent months before. Asked for official MBA transcripts and set up a telephone interview. Individual from HR never called me and I emailed her 15 minutes after the interview was to take place thinking that I had gotten the information wrong and perhaps I was to call her, and she stated that the phone just rang with no answer. I was literally holding the phone in my hand waiting for the call, and I did follow up via email 15 mins from the time of the scheduled phone call. I was then told that she may have some time later in the day, and asked for a better number, I gave her a second number and never heard back. I emailed her several times to reschedule, but received no response to any of my emails. The level of professionalism is SEVERELY lacking here. I gave valid phone numbers, but if they dialed the wrong number, I am the one who was punished as not being available? I lost PTO time that day from my full time job to make sure that I had no interruptions for the telephone interview. I will never teach for this school, and I have years of teaching experience on site and on line. I am sad that someone who works in a Human Resources department failed to display the purpose of an HR department.", "Interview Questions": "None were ever asked"}, {"date": "17 Nov 2018", "title": "Student Services Representative I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University (Naperville, IL)", "Interview Descriptions": "Long wait between email about interview until I was actually interviewed. It was canceled saying that position was mo longer open and then 3 weeks later recruiter contacted me and stated it was open again. The interview itself was very dry and required a mock customer service call the following day. After long process no one sent any information regarding if I received offer or was rejected.", "Interview Questions": "Why should we hire you? What do you know about company? What type of customer service experience do you have?"}, {"date": "13 Nov 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "It was very easy. The first step of the interview was with a manager and the second interview was with the Dean. Overall, the interview was very easy for anyone.", "Interview Questions": "The interviewer asked strengths, weaknesses"}], [{"date": "10 Oct 2019", "title": "Senior Career Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University (Chicago, IL) in Nov 2018", "Interview Descriptions": "HR phone interview and two virtual interviews with the hiring manager. Everything happens virtually and over the phone. The position was a remote role and the home office is in IL. they have positions all over the US.", "Interview Questions": "Tell me about yourself? What experience do you have?"}, {"date": "27 Dec 2018", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University in Oct 2018", "Interview Descriptions": "Phone interview with HR and two phone interviews with two different hiring managers. After the first HR interview the interviewer wasn’t sure which available Marketing decision I would be a better fot for so they had me interview with two different hiring managers for two different positions. I got a good feeling about both interviews and then weeks went by. I decided to circle back with HR on an update of my candidacy and never heard a thing. No response to this day. I was completely ghosted. Waste of time.", "Interview Questions": "Tell me about yourself."}, {"date": "2 Oct 2018", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at DeVry University (Naperville, IL) in Sept 2018", "Interview Descriptions": "Reached out by internal recruiter, \r\nPhone interview \r\nIn person interview with two people within management \r\nthen a offer date was provided about two weeks after the in person interview", "Interview Questions": "what do you like about your co workers what do you dislike"}, {"date": "23 Aug 2018", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at DeVry University (Chicago, IL)", "Interview Descriptions": "I waited an unprofessional while until finally interviewing with two middle management women in admissions. They both asked thoroughly relative questions and was one was very friendly and conversational. I could tell the other liked my answers, but was trying to intimidate me. She tried using the fact that I had a traditional college degree from a big university against me-suggesting that I may not be able to relate to prospective students’ struggles.", "Interview Questions": "Since you went to a real college how are you going to relate to the non traditional student who doesn’t have that option?"}, {"date": "3 Jun 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University (Cleveland, OH)", "Interview Descriptions": "It was a long process. I had to take an assessment which lead to a phone interview with a recruiter. Then proceeded two more long hard interviews with management. And guess what- I never got feedback from the recruiter even though I was promised. I think they promoted from within which is fine. However, wasting my time was not appreciated. A simple phone call or email telling me I didn’t get the job would have sufficed!", "Interview Questions": "What are you passionate about?"}, {"date": "17 May 2018", "title": "Academic Affairs Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "I was first contacted by a recruiter and waited a couple weeks.  Then, I was invited to the main campus for interviews with a number of managers.  I also interviewed on one of the satellite campuses.", "Interview Questions": "Why do you want to work for DeVry?"}, {"date": "21 Mar 2018", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Irving, TX) in Feb 2018", "Interview Descriptions": "I was contacted by an HR person in Illinois who did an initial phone screening.  I was moved onto the in-person interview with the Dean, but it ended up being online through WebEx. I felt the interview went well. They asked very customer-focused and student focused questions and how you relate it to your past work experiences. Do not expect any feedback or a customized letter if you make it further in the interview process. I was told I would personally hear from HR whether they were moving me along or not and I got a generic rejection letter.", "Interview Questions": "Describe a time you received excellent customer service?\r\nWhy are you interested in working for DeVry University?"}, {"date": "25 Jan 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at DeVry University (Houston, TX) in Feb 2018", "Interview Descriptions": "Interviews are usually done through a panel of administration and other professors. It took about an hour including a demonstration and question and answer period. In addition, the staff will take you on a tour of the campus as well as a meet and greet with other staff and administrators.", "Interview Questions": "What is your teaching philosophy?\r\nHow many years have you worked in IT?\r\nHow many years have you worked in education?"}, {"date": "24 Jan 2018", "title": "Admission Counselor-undergraduate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at DeVry University (Naperville, IL)", "Interview Descriptions": "Applied on a Saturday and the following Monday I got a call to schedule a phone interview. Phone interview went really well and the person told me a person from the Naperville office will call me to set up an in person interview. The in person interview was with two managers both very nice. The questions they asked were trick questions and they asked the same questions just in different ways. Seemed like they liked me at the end. Got an email two days after saying I didn’t get the position.", "Interview Questions": "What would be the hardest thing to over come if a student is pushing back?"}, {"date": "12 Nov 2017", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at DeVry University (Long Beach, CA) in Nov 2017", "Interview Descriptions": "I went to a local career fair and spoke with a Devry representative. I expressed my desire to work in higher education. The representative stated that she would pass my resume on to several departments. Lo and behold, a few days later I received a call from a Devry recruiter trying to get me to enroll in their MBA program. Very deceptive.", "Interview Questions": "Are you looking to go back to school? (For the purpose of trying to recruit me into their MBA program)."}], [{"date": "20 Sept 2017", "title": "Student Support Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University (North Brunswick, NJ) in Sept 2017", "Interview Descriptions": "First I applied online. A day or so afterwards, a recruiter sent over an online assessment. It took about an hour. I eagerly filled it out. The next morning, the recruiter gave me a call, impressed that I had taken the assessment before he even called. We scheduled a phone screen for that following week. After the phone screen, he told me I would be going to the next level -- an in-person interview with the Student Central Manager. That interview occurred the following week.\r\nAfter meeting with the manager, I learned more about the role and felt it wasn't the right fit for me. I withdrew my candidacy after that interview.", "Interview Questions": "What was a time you received feedback from a supervisor that you disagreed with?"}, {"date": "20 Oct 2017", "title": "Student Support Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University in Sept 2017", "Interview Descriptions": "About two months after applying online, I received an email with an assessment which I completed the next day.  It took me about 40 minutes to complete, it was a combined personality and IQ test.  Immediately, the recruiter called me to set up a phone interview.  The phone interview went well and at the end of the call I was invited for the in person interview with the manager the same week.  The interviewing process was overall simple but the position was not a fit for me as I learned more about the role from the manager.  Seemed more like a numbers game than actual student advising or support.  The manager was also a bit condescending only half way answering my questions and snickering with the receptionist as I exited the office.   The only reason I am not down-rating the interview is because the initial recruiter and his assistant were very professional.  The following business day after the interview, I was sent an automated email that they would not move forward in the interviewing process and had selected another candidate.  However, the position has yet to be filled.  All is well, a week later I was offered a job at a well known university and began working immediately.", "Interview Questions": "What about the job description made you interested in this position?"}, {"date": "24 Aug 2017", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "Very straightforward. Met with two people on the initial day. Everyone was pleasant and very clear about the responsibilities of the position. It seemed to be a very organized office.", "Interview Questions": "I am okay with taking very specific direction."}, {"date": "21 Jun 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University in Jun 2017", "Interview Descriptions": "I had a phone interview.  This was the initial first step as a candidate. Then,  I had another phone interview and lastly a webex interview.  All three of these were like days apart from each other.  The process was fast.", "Interview Questions": " Name a time when someone started out excited about something and then further down the road changed their mind. How did you help them to refocus?"}, {"date": "3 May 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "they held a phone interview, followed by a group interview and then a one on one interview with different levels of management; the process was relatively quick and efficient.  follow up was also quick", "Interview Questions": "Tell me about your sales experience."}, {"date": "27 Apr 2017", "title": "Admissions Recruiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "multi-step process, had to jump through many hoops of interviews for just a entry-level position. So I thought it to be a bit much, but had a better understanding once I realized they wanted to gauge my expertise and comfort ability in sales.", "Interview Questions": "How to sell a pen? Want to know if I am a good sales-person. "}, {"date": "18 Mar 2017", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "The interview process was very comfortable. They were looking for the exceptional teaching qualities. They were also making sure the interviewee had expertise in the industry experience that support specific classes you can teach.", "Interview Questions": "How would you handle your classroom to ensure all students are getting quality service?"}, {"date": "16 Mar 2017", "title": "Admissions Advisor - Decatur, GA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University (Atlanta, GA) in Feb 2017", "Interview Descriptions": "Applied online, received an email for assessment about a week later, completed assessment received a phone call to set up for phone interview, phone interviewer stated they would pass my information and recommend for face to face interview. 2 weeks no response", "Interview Questions": "Tell me why you would like to work for this organization."}, {"date": "5 Dec 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University in Dec 2016", "Interview Descriptions": "It was an on-campus interview with the IT manager that lasted about 30 minutes. We discussed my major and prior work expereince. The manager was easy to talk to and it felt more like a discussion than an interview. He also asked about the classes I had taken and if I had any current experience in the IT field. It was about a week after when I heard back and was offered the job.", "Interview Questions": "Tell me about a time when you had to work with a difficult co-worker and how you handled it?"}, {"date": "6 Dec 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at DeVry University (Las Vegas, NV) in Nov 2016", "Interview Descriptions": "Long than average wait, and intense process. I didn't think they were interested because it took so long to her from a talent scout. I had a phone screen, two one on one interviews, a phone interview, and a video chat interview - then they contacted my references. Not that I was worried but, they don't do a drug screen. They do outsource for their background check. That company is a little intense. Overall, be ready with your sales pitch and be passionate about education.", "Interview Questions": "Are you aggressive or assertive? Explain."}], [{"date": "16 Dec 2016", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at DeVry University (Downers Grove, IL) in Nov 2016", "Interview Descriptions": "Applied on-line; received phone screen invitation via email; Initial phone screen with HR; phone screen with hiring manager; in-person interview with the hiring manager and the marketing director; in-person interview with the VP and Director;", "Interview Questions": "How would you handle a situation where someone thought that your data was wrong?"}, {"date": "12 Sept 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Colorado Springs, CO)", "Interview Descriptions": "It was a series of interviews by two people.  I was told by the first person who interviewed me to expect a phone call to get me setup for the next interview round and then they would make their decision and contact me with the results.", "Interview Questions": "Why did you apply to this position?"}, {"date": "20 Aug 2016", "title": "Operations Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "Quick seamless process from start to finish due to immediate staffing need.  Phone interview from HR went well and she painted a realistic picture of the position.  Second interview with hiring manager and third interview with panel.  Start to finish was less than two weeks but I understand this is not typical.  Standard questions.  No curveballs.", "Interview Questions": "What interested you in this position."}, {"date": "25 Jul 2016", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at DeVry University (Cincinnati, OH)", "Interview Descriptions": "Submitted resume\nWas emailed from Talent Acquisition to take an online assessment test. The test was math story problems and personality. \nAfter I took the assessment, I was was contacted via phone and had a mini phone interview. A face to face interview was set up during the phone interview. Interview was two days later. It lasted about 40 mins.\nThe following business day, they sent me an email stating they chose someone else.", "Interview Questions": "Name 3 things others would say about you?"}, {"date": "14 Jun 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Naperville, IL)", "Interview Descriptions": "I had a phone interview first.  I was the in an interview with 2 individuals.  I was offered the position.  I had to do a background check.  They also had me do a drug screening.", "Interview Questions": "N/A"}, {"date": "3 Jun 2016", "title": "Director of Community Outreach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at DeVry University (Los Angeles, CA)", "Interview Descriptions": "I had two interviews, over the phone.  Then I was asked to come in and interview with the HR Director, Campus President and the National Director of Community Outreach.  From there, I went to another location to interview with the Los Angeles Metro President.", "Interview Questions": "How would you increase the exposure and posture of the University in the community?"}, {"date": "24 Aug 2016", "title": "Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at DeVry University (New York, NY) in Jun 2016", "Interview Descriptions": "The interview process was a one-to-one where basic questions were asked about your work history, educational background, strengths, weaknesses, the most interesting project you have ever worked on, what was the biggest set back for you? How well do you take criticisms? What has been your greatest achievement? Where do you see yourself in five years time? What contribution can you bring to the company? What other business do you see yourself in other than the position you are applying for?", "Interview Questions": "How well do you handle stressful situations? Give an example"}, {"date": "21 Apr 2016", "title": "Full-Time Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at DeVry University", "Interview Descriptions": "The first interview was with two people from the department sat in a room each person asked a question, very stiff, very predictable. The second was with the Manager of that department, much more fluid and easy going.", "Interview Questions": "A most difficult situation"}, {"date": "16 Aug 2016", "title": "Student Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University (Chicago, IL) in Apr 2016", "Interview Descriptions": "Submitted resume\r\nWas emailed from Talent Acquisition to take an online assessment test. The test was math story problems and personality.\r\nAfter I took the assessment, I was was contacted via phone and had a mini phone interview. A face to face interview was set up three weeks after my first interview because the HR lady never got back to me via Email. After three weeks of playing phone tag, she finally set up an interview for me. She told me that I would hear back whether or not I got the job (Which is one of the reasons why she said the company was so great because they will actually get back to you with an offer or no offer unlike other companies that leave you hanging. I then had the in person interview with two people for 60 minutes and they told me they would get back to me with a job offer or let me know that I would not receive an offer because they're nice like that... Its been two months since the interview and I have not heard anything back from them. So, they straight up lied to my face. I tried contacting them and heard nothing back.", "Interview Questions": "Tell me about your self? "}, {"date": "16 Oct 2019", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University (Naperville, IL) in Apr 2016", "Interview Descriptions": "All about the good cop bad cop routine. They make you sweat the small stuff and take their jobs way to seriously for an online college. Not a challenging interview just something you need to get through. First phone screen the an in-person interview.", "Interview Questions": "Describe yourself in one word?"}], [{"date": "7 Apr 2016", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at DeVry University (Naperville, IL) in Mar 2016", "Interview Descriptions": "Heard about the position from a friend who was employed there. \r\nFirst call was an over the phone interview. \r\nAfter some time, they brought me into their Naperville campus for a meeting with the VP of admissions and another manager. Interview went on for an hour, followed by a brief 1-on-1 with one of the admissions members for some questions. \r\nReceived email about a week later informing me they are not moving on to hiring me.", "Interview Questions": "What issues or challenges do you foresee working in this position?"}, {"date": "11 Feb 2016", "title": "Director, Library ServicesDirector Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at DeVry University (Houston, TX)", "Interview Descriptions": "I went in and had a roundtable interview with people from all departments. They asked questions on background experience, their expectations, what the future of the library was for a library director. They were open ended questions, not right or wrong, but honest. It was very comfortable, like a graduate seminar.", "Interview Questions": "We discussed educational philosophy for adult learners and how library skill sets were equal to the outcome. There were not any questions that were banal.  The roundtable was very serious and professional.  After the interview,  met with president of campus who asked questions on the administrative qualifications and the overview of the campus and company."}, {"date": "3 Feb 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at DeVry University", "Interview Descriptions": "Hiring process was very long (almost 2 months) in my particular case because there was a role change in leadership. \n\nPhone interview\nStandardized testing: 2 Examinations\nIn-Person interview\nPhone interview\nIn-Person interview\n\nDuring the process the HR Generalist was very open and up-front and let me know I'd be moving forward after each interview.\nOffer was given 1 week later.\nExtensive background check\nNo drug test, started 2 weeks after I accepted the offer.\nGod bless and good luck to you all!", "Interview Questions": "Have you ever had to go against a manager's decision? if so, explain? if not, how would you handle it?"}, {"date": "31 Jan 2016", "title": "Operations Support Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "It was average basic questions, nothing really major, I had a phone interview first then I was sent for one interview and then got another interview elsewhere then you have to fI'll out all paper work and start after two weeks of getting your hire letter", "Interview Questions": "N/A"}, {"date": "7 Mar 2016", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Columbus, OH) in Feb 2016", "Interview Descriptions": "Contacted by corporate recruiter and had a phone interview that lasted approximately 40 minutes.  Interview covered previous work history as well as several behavioral questions that required specific examples.  Called for a second in-person interview with the Admissions Director.  Interview lasted about 45 minutes and included behavioral based questions as well as how well you would handle objections.  Got a feeling that this was a high-pressure sales environment.  Was called a week after my in-person interview and was told that they were restructuring internally and that the position would be filled in that manner.  Was told I did very well in both interviews and I would be kept in the pipeline for future openings.", "Interview Questions": "Name a time when you had to admit a mistake to a client/customer and how did you handle it?"}, {"date": "23 Dec 2016", "title": "Veteran Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at DeVry University (Chicago, IL) in Feb 2016", "Interview Descriptions": "The interview was informal, the interviewer was interested in my personal skills and understanding of responsibilities. They where also concern with my veteran status since the position was for veteran specialist.", "Interview Questions": "Are you familiar with V.A assistance programs and practices?"}, {"date": "15 Jul 2020", "title": "Group Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at DeVry University (Chicago, IL) in Feb 2016", "Interview Descriptions": "The interview process was extremely long. At least 5 different interviews with various parties and locations. Minimal communication between interviews and a long process to employment. I'd recommend a thorough review before they move forward.", "Interview Questions": "How did you hear about us?"}, {"date": "5 Jan 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at DeVry University (Oakbrook Terrace, IL)", "Interview Descriptions": "Started out with large group information sessions and whittled down to individual interview.  It was an average interview experience for a university admissions position.  They are looking for sales abilities.", "Interview Questions": "N/A"}, {"date": "9 Dec 2015", "title": "Student Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "Easy questions on how to handle the chain of command. Easy situational questions on how you would handle a student or professor. Very basic stuff. No experience needed. The position was for the IT department. Just need to show interest in the position and possible learning opportunities. And it was very flexible with class schedule. \r\nEmployee referred me to opportunity, received a phone call within a week just asking if I was still interested and when I could come in, and an in person interview 2 days after the phone call. Offered the job about a week after that. Very simple process.", "Interview Questions": "How would you handle a frustrated student."}, {"date": "9 Mar 2017", "title": "Academic Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at DeVry University (Paramus, NJ) in Nov 2015", "Interview Descriptions": "20 Min sit down to explain requirements. Being able to tutor every course and or sub part for your major. Maintain a 3.5 GPA. Get an A in each course thereby qualifying you to tutor that course to all new students in that field or similar interests.", "Interview Questions": "What is your GPA? What is your major?"}], [{"date": "29 Oct 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at DeVry University", "Interview Descriptions": "Went through 3 phone interviews, wonderlic, and in person interview.  The usual sales type questions/interviews. The live interview was with campus director & director of career services.  One interview by phone with district manager was while he was driving, so that was a bit distracting.", "Interview Questions": "How do you handle your stress at work?"}, {"date": "30 Oct 2015", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University (New York, NY) in Oct 2015", "Interview Descriptions": "It was a great interview process, but be prepared for the several round of interviews. It took about a month to complete all four interviews, and then another 2 weeks to start the job. It is best to apply if you are currently unemployed, and have the time available. A recruiter calls you first for a phone interview, if you pass, you will take an assessment online, and then you will get a call the next day to schedule an in person interview with the hiring manager. Depending on the position you're applying for then you have an interview with the president of the university, and last another phone or in person interview with another director. Everyone is very pleasant and outgoing, and they guide you on the process along the way. Some questions are character based, but very straight forward. They are not hard, but require you to fully answer with examples and anecdotes on past employments.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "29 Oct 2015", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University (New York, NY) in Oct 2015", "Interview Descriptions": "First you apply online take a small text really hard after that human resource calls you ask questions make sure you are flexible with time they will make you rotate shifts and they want you to be flexible they might l tell you 3 shifts but you will get the shift that they want to give you . After the phone interview is fave to face interview very easy just be flexible with time and you'll do good make sure you bring resume to interview don't want to make a bad impression with no resume", "Interview Questions": "What would you do differ in a certain annexation"}, {"date": "18 Aug 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "lengthy process-first resume and application, then a call from a recruiter following a phone interview, then an interview with the admissions manager, then an interview with the president (if the first two go well). After all of this- it still took another month before starting.", "Interview Questions": "Are you open and comfortable with weekly coaching?"}, {"date": "10 Aug 2015", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Rego Park, NY) in Aug 2015", "Interview Descriptions": "I applied online and got a call within a week from a recruiter on the phone. He was so nice and eager and made me want the job even more than when I applied for it. He told me I had to complete an online assessment (which was seemingly very hard) and he would pass my resume onto the next step and I was excited. Within a week I got a call from another recruiter to sent up an in person interview with the Dean of the Devry campus in Rego park. I set up the interview in a the same week and got a call back 2 days later from the same recruiter saying that the Dean asked her to reschedule because she was no longer available, I thought that was very unprofessional yet I agreed and changed the interview. I went into the building the following week all smiles, dressed very professionally. I arrived a half and hour early, yet i still had to wait a hour and a half. After waiting for a hour and a half another employee gave me a tour of where I would potentially be working, although it seemed very boring I was still very interested. The employee then took me back to the waiting room where I waited ANOTHER 30 minutes. Finally the Dean came out and took me into her office. She didn't seem to have any solid questions and just made things up as they went. She scribbled on the back of my resume which brought me to realize this was not a structured interview. I figured she already had a candidate in mind that she wanted to hire because at the end she said \"well I'm done with all interviews now.. heres my card\" as if dismissing me. I've never had a terrible interview but this just seemed to be very unorganized and all over the place. Everything does happen for a reason!", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "23 Aug 2016", "title": "Student Support Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University in Aug 2015", "Interview Descriptions": "First step in the hiring process was an online assessment, followed by an phone interview, then 3 on site interviews. Everyone I met with was very nice and candid about the fast paced work environment and company culture.", "Interview Questions": "Why should we hire you?"}, {"date": "20 Aug 2015", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at DeVry University (Rego Park, NY) in Aug 2015", "Interview Descriptions": "Applied online and received an email from an HR rep after 2 or 3 weeks.  HR rep wanted to know my work history, and why I applied for this position.  HR rep said that I would be contacted about a face to face interview after I completed an online assessment.  \r\n\r\nThe online assessment asked about how I would handle certain work situations.  It also asked questions like, \"If a train leaves Chicago at 1pm traveling at a speed of 20 miles an hour, how long would it take to get to NYC\" and, \"Mary works 9 to 5, and Jim works until midnight.  Everyone in shipping works past 5pm, which department does Mary not work in\".   \r\n\r\nHR rep called me back in a few days asking if I received an email about the face to face interview, I did not, and she immediately got the HR coordinator to get back to me.\r\n\r\nAt the face to face meet 1st with the other Operations Support Coordinator who told me what the day to day position is like.  Then met with the Center Dean.  She asked questions about how I handle different situations, asked if I had any questions.  Entire process lasted 1 hour.", "Interview Questions": "Name a situation where you went out of your way to help someone."}, {"date": "24 Jun 2015", "title": "Administrative Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at DeVry University (Oakbrook Terrace, IL)", "Interview Descriptions": "This was a long time ago and I don't remember all the details.  The face to face interview took about one hour.  I came there through a temp agency and was hired permanently after several months as a temp.", "Interview Questions": "They were primarily looking for someone with Power Point knowledge for a specific task so there were many questions around that particular software.  "}, {"date": "24 Jun 2015", "title": "Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at DeVry University", "Interview Descriptions": "It was internal because I already worked there. You met with other DOA's first then the Deans.  The final meeting was with the VP of enrollment. At the end of the day you have the job before you even interview for it so unless you totally tank the meetings you have you're in. If you do your job well then the opportunities will open up and/or they'll ask you to interview. I don't know if they still do this but I was an Assistant Director so I was getting coaching on how to be a DOA for months prior.", "Interview Questions": "They focus on how you plan to manage the team to drive activity and productivity. There are a few HR scenarios that were thrown in to make sure you knew what you were talking about. It's all about making sure your team hits it's numbers and as a sales manager you need to demonstrate that you're capable to making that happen."}, {"date": "4 Jun 2015", "title": "Academic Success Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "It was calm and friendly. Boss told me what the position was about and asked me questions to access my qualifications. I didn't feel pressure. The environment in the interview room made suspect that my boss may be an easy going person to work for", "Interview Questions": "What classes will you say you can tutor comfortably?"}], [{"date": "1 Jun 2015", "title": "Career Services Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Fort Washington, PA)", "Interview Descriptions": "Phone screening, initial interview with Department Director, presentation on interview skills.  The interview was informal and it was good to meet various people from the Department and Student Services", "Interview Questions": "How to get students involved with Career Services"}, {"date": "7 Jul 2015", "title": "IT Help Desk Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at DeVry University (Dallas, TX) in Jun 2015", "Interview Descriptions": "got a call to answer some questions, was told I would be inform of next steps to follow, after a week I called back, was told they got a different person handling the hiring and didn't know who had done what", "Interview Questions": "Questions were repeated for second recruiter, total waste of time as job was offered when skills, experience, and requirements were matched 100%, gave bogus excuses"}, {"date": "6 May 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at DeVry University (Naperville, IL) in Jun 2015", "Interview Descriptions": "Phone interview. A few Assessment. In person interview with 2 people. The recruiter first reach out to me via phone, he was a very nice guy. He talked about the company, pay, benefits, expectations and set up my assessments. After completing assessment set up my interview with Director of admissions and assistant director of admission.", "Interview Questions": "Why do you think you'll do good in this role?"}, {"date": "17 Jan 2018", "title": "Literacy Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at DeVry University (North Brunswick, NJ) in Jun 2015", "Interview Descriptions": "The interview process was simple and I interviewed with my school first. Then I interviewed with the library director and supervisor. What I did was I submitted my resume via email, got two rounds of interviews after the resume review, and got hired! I started within 2 weeks!", "Interview Questions": "What is my schedule like?"}, {"date": "4 Oct 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at DeVry University (New York, NY) in Jun 2015", "Interview Descriptions": "First interviewed by a recruiter and then 2 onsite interviews. There was also a skills review/personality test that was timed and produced a lot of pressure. They were very prompt in getting back to me with next steps.", "Interview Questions": "Experience as well as situation questions"}, {"date": "21 Apr 2015", "title": "Admissions Advisor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at DeVry University", "Interview Descriptions": "Very in-depth and behavior-based questions that requires the applicant to provide specific examples of how to deal with conflict and their views about service.  Requires a phone screen, face-to-face department manager interview, and assessment testing.", "Interview Questions": "Provide an example of a difficult conversation you had with a client and how you were able to overcome concerns."}, {"date": "3 Feb 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at DeVry University (Houston, TX) in Apr 2015", "Interview Descriptions": "I came recommended from a highly respected Statistics professor while attending Devry University.\r\nThe interview for me was more of a get to know me and here is what you will be doing conversation.", "Interview Questions": "What subjects do you know well enough to tutor?"}, {"date": "17 Mar 2015", "title": "Director of Career Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "Very organized and informational.  Multiple step process with phone screenings and in person opportunities.  \r\n\r\nBe prepared to discuss your resume in full detail as well as know information concerning the company.  Do you homework in advance so that you can answer any questions regarding the current status on the entire education group.  Be sure to also have multiple questions ready to go for each interviewer throughout the process.", "Interview Questions": "Direct, informational and extremely relevant.  \r\n\r\nOn point with job description posted online."}, {"date": "11 May 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at DeVry University (Chesapeake, VA) in Feb 2015", "Interview Descriptions": "Interviewing with DeVry was drawn out and a waste of time. They led me on for months and then denied me with a generic email stating that they went with another candidate. After a great interview (in my opinion) they took forever to make any progress with their hiring, despite telling me that I was a top contender for the position. After several emails and calls back and forth, they finally gave me the bad news. I wish it didn't take three months for them to come to that decision. Very unprofessional. In hindsight, I'm glad I didn't get the job. Working for them must be a similar experience.", "Interview Questions": "Very basic interview questions. Where do you see yourself in five years? etc."}, {"date": "12 Aug 2015", "title": "Operations Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University (Naperville, IL) in Feb 2015", "Interview Descriptions": "It was a bit lengthy in my opinion. Could have been quicker. It took about a month to get everything taken care of. I have phone interview, then moved onto in person and the decision took some time too.", "Interview Questions": "What are your strengths? How do you fit into this role? "}], [{"date": "10 Jul 2016", "title": "International Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at DeVry University (Chicago, IL) in Feb 2015", "Interview Descriptions": "I was quite prepared. I was interviewed by the Campus President and the Associate Dean. I had come in with a few ideas to help them increase International Students involvement.", "Interview Questions": "What ideas do you have to increase retention rate of International students?"}, {"date": "8 Jan 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at DeVry University", "Interview Descriptions": "VERY SMOOTH, INFORMAL. Interviewer was a very thorough, professional but very relaxed and approachable. Overall the place, the building, the atmosphere and facilities are top-notch. Only thing, it is not place for long term. No incentive to stick around. I guess they do not want to cultivate that kind of loyalty.", "Interview Questions": "N/A"}, {"date": "29 Jul 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at DeVry University (Addison, IL) in Jan 2015", "Interview Descriptions": "Received and email to give the HR rep a call. You have about a 30 minute conversation about why you would be a good fit, sales positions you had, customer service positions you had. Then they go over benefits and their standard pay that is non negotiable.  Then you get called into a interview with the Director and an Assistant  Director.", "Interview Questions": "When was a time that you had to deal with a difficult customer and how did you over come it?"}, {"date": "1 Dec 2014", "title": "Student Support Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at DeVry University (Decatur, GA)", "Interview Descriptions": "Applied online. I was contacted by HR and set up with a phone interview time. I then was asked to complete an online assessment and come in for a face to face interview. The interview went well, I believe. They said they would be in touch within a few weeks. After some time had passed I contacted them and was told a decision would be made that week. Two weeks late I contacted them again and asked for an update and was ignored completely. I have still not heard back and I must say I am very disappointed. Even if they chose someone else I would have expected to have been told. I think Devry would have been a great place to be!", "Interview Questions": "Questions were very natural and the interview was conversational. I felt well prepared and thought they liked my answers."}, {"date": "12 Nov 2014", "title": "Practicum Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "I had to take an assessment test, then I had tow interviews with the Manager and then the Director of student Services.. It took 2 -3 weeks for all that to happen and to get hired", "Interview Questions": "N/A"}, {"date": "30 Jan 2018", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at DeVry University in Nov 2014", "Interview Descriptions": "The library manager was very friendly during the whole interview. I had no job experience, so we discussed my skills during past classes at school. It's required to be a student at DeVry University to apply for this position.", "Interview Questions": "What difficulties did you face during group projects and how did you solve them?"}, {"date": "3 Jan 2016", "title": "Admissions Advisor I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University in Nov 2014", "Interview Descriptions": "Received an email from HR Rep our of Home Office in Chicago, scheduled phone interview with HR Rep, moved on to in-person interview onsite, then had phone interview with President of Metro. Overall took about 2 weeks.", "Interview Questions": "What makes you a good admissions advisor."}, {"date": "29 Oct 2014", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "The position in it self seemed pretty average, was interviewed by at least 3 people all seemed to ask the same questions just a bit different. Mostly talked about their roles and what they expected of the assistant. Once interview was over I was given an online assessment on basic questions such as If I had ever stolen from an employer, if I would ever tell on someone that was stealing and things of that nature. I remember there being a small math portion but nothing a calculator could not help out with.", "Interview Questions": "How would I communicate with a team member and what outlets would I use to do so."}, {"date": "22 Sept 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at DeVry University", "Interview Descriptions": "Submitted resume to a recruiter, and was sent an e-mail to complete two assessments - one was a quantitative reasoning assessment, and the the other was a \"judgment\" assessment. I was informed by the recruiter on the same day that I completed the assessments that, while I did extremely well on the quantitative reasoning assessment, I did not meet requirements on the \"judgment\" assessment, and I was given best wishes in my job search. I wasn't even told WHY or HOW I didn't meet requirements. I assume that one has to have a certain type of temperament or belief system to even be called in for an interview, and I suppose that mine just didn't fit, which is a shame, as I enjoy helping people and I have loads of experience in proprietary education.", "Interview Questions": "Didn't even get to the in-person interview step, so I don't have any questions to post."}, {"date": "28 Jun 2018", "title": "Student Finance Advisor II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at DeVry University (Chicago, IL) in Aug 2014", "Interview Descriptions": "There were 2 phone screens and 2 face to face with hiring manager and the lead of the team I would be joining if I were to get the offer", "Interview Questions": "How do you do under pressure and time constraints"}], [{"date": "28 Jun 2014", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University", "Interview Descriptions": "Had 3 phone interviews and they required a philosophy of teaching and a vision and values statement. They pay $1500 a course and only pay when the course is over. They wasted my time because the first two interviews said nothing about me having never taught online being problematic. The final interview was courteous, but once she learned that i never taught on line she finished the interview quickly. I hate companies that waste my valuable time.", "Interview Questions": "N/A"}, {"date": "3 Dec 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at DeVry University in Jul 2014", "Interview Descriptions": "It took my department two month to call me in for an interview. Another month to accept me as a new hire. I was trained in a few weeks and left on my own for the duration of my shift. There is potential for wage increase from the federal minimum but any one rarely gets it.", "Interview Questions": "Why do you see yourself working here?"}, {"date": "27 May 2014", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at DeVry University (North Brunswick, NJ)", "Interview Descriptions": "I was first interviewed for the position of a tutor.  After working as a tutor for two weeks, my manager forwarded my resume to the Chair of the developmental English  department. I was then interviewed by her.", "Interview Questions": "I dont think I had any difficult question."}, {"date": "1 Apr 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Naperville, IL) in May 2014", "Interview Descriptions": "Had interview over the phone with recruiter and then face to face interview. where i met with a manager and then her manager separately. I also had to complete a mock call since this was for their online services department", "Interview Questions": "Asked about pass history and behavioral questions. I also had to do a mock call"}, {"date": "17 Jun 2014", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University (Houston, TX) in May 2014", "Interview Descriptions": "I applied online. I got a call back from HR in IL a few days later. She wanted to set up a phone interview. I think I had to wait about a week until the phone interview. It was supposed to take about an hour and a half, but I think it took 20 min. Really easy questions: Do you like people, describe a situation where you had to choose who to help first, student or boss, stuff like that. I was just friendly and she immediately wanted to set me up for an in person interview. I found out later she interviews a bunch of people and then picks the top three to send in. She sent me an online assessment to do. It was dull. I had to wait over two weeks until someone was ready to interview me in person. She showed me around the area and everyone was really friendly. Some questions had to do with the situation they find themselves in right now; lay-offs, change of culture, etc. So she asked how I react to new co-workers/co-workers leaving, how I respond to students questions that seem stupid, etc. It's been a week now and I haven't hears back. I know I did well on the interview, but it's killing to not hear anything.\r\ntl;dr simple questions, nice atmosphere. Be nice and help students above all else.", "Interview Questions": "What do you do when you've finished your work but still have to be on the clock?"}, {"date": "17 Dec 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at DeVry University in Apr 2014", "Interview Descriptions": "It was pretty easy.  Simple and quick phone interview, then fairly low intensity in-person interview (how do you deal with student engagement, etc.), and a final 20 min teaching session (on topic of choice) for a couple deans.  Of course, the person who hired me left shortly after I got hired (turn over is really high) so things may be different for you!", "Interview Questions": "N/A"}, {"date": "13 Sept 2016", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at DeVry University (Phoenix, AZ) in Apr 2014", "Interview Descriptions": "I was asked the basic interview questions and answered to the best of my ability. The interview staff was friendly and made me feel comfortable as I was extremely nervous. I received a call a few days later.", "Interview Questions": "What are your stengths?"}, {"date": "26 Mar 2014", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "Applied online; received a call for a panel interview a couple of weeks later; received a call back for the position after a couple of months.", "Interview Questions": "There were no difficult questions. The panel was professional, however I felt comfortable speaking with them. "}, {"date": "1 Dec 2015", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at DeVry University (Chicago, IL) in Mar 2014", "Interview Descriptions": "It began with a resume submission.  This was followed up with an interview with HR for initial screening purposes.  After the HR interview, I met with the dean and conducted a teaching demonstration with several instructors/professors present.", "Interview Questions": "What is your customer service orientation?  How do you respond to changing work requirements?"}, {"date": "3 Jun 2015", "title": "Student Services Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Naperville, IL) in Mar 2014", "Interview Descriptions": "Spoke with someone in HR who set me up with a phone interview.  Phone interview went well, went on to an in person interview with 2 employees at DeVry who would essentially be my bosses.  Both people I interviewed with I found to be very unfriendly, making the entire process intimidating.  If i was offered a job, I most likely would have declined.", "Interview Questions": "Explain some sales techniques you've had to use in the past"}], [{"date": "7 Nov 2016", "title": "Academic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at DeVry University (Long Beach, CA) in Mar 2014", "Interview Descriptions": "Depending on the location, the qualifications may vary. Generally, you ask for an application in-person and will be redirected to a website to complete an application. However, completing an application may occur before or after the interview. The interviewer is always the boss/manager who'll be directly above you in the Learning Commons or Library. So, if you apply for the position in [insert location] campus, then you'll be interviewed by the boss/manager of that area's Learning Commons or Library. The interview is about 15 to 30 minutes long. Most questions asked is in regards to why you are choosing this position, and your expectations from the job.", "Interview Questions": "- What do you think you will gain if you get this job?\r\n\r\n- Why are you choosing this job?\r\n\r\n- How do you think you can contribute to the team?"}, {"date": "18 Oct 2015", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at DeVry University (Dallas, TX) in Mar 2014", "Interview Descriptions": "Assessment, phone interview, in person interview, PowerPoint presentation. Met with managers of different departments. Wait was long because they were interviewing other candidates. Everyone seemed very nice and tried to make the process smooth and unnerving. Asked a lot about experience and salary requirements as well as expectations. Be prepared to ask questions.", "Interview Questions": "Tell me about yourself"}, {"date": "12 Feb 2014", "title": "Admissions Advisor I Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "Phone interview, followed by a face to face interview with 2 or more people.", "Interview Questions": "giving equal attention to both interviews and answering both the questions. "}, {"date": "18 Apr 2015", "title": "Admission Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at DeVry University (Chicago, IL) in Feb 2014", "Interview Descriptions": "Absolutely worst interview experience in my life.  I was interviewed by two people at the same time.  They were both extremely rude and rushed the interview as if I was distracting them from work.  They were both late for the interview and left me sitting in the reception area for at least 10-minutes.  After the interview, I knew I did not want to work for that company.  I was more than happy that they didn't want me as well.", "Interview Questions": "Why did you leave your last job, are you wealthy? "}, {"date": "27 Jan 2014", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at DeVry University", "Interview Descriptions": "Telephone and 2 in person (One panel of 5 and one on one interview)", "Interview Questions": "N/A"}, {"date": "12 Jan 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University", "Interview Descriptions": "Initial phone interview with general background questions. \r\nOnline assessment with behavioral questions.\r\nTwo in person interviews at the location that focused on situational questions\r\n\r\nAfter I completed this process they decided there was no longer a need to fill the position. Everyone was very friendly throughout the process and I had a positive impression of those I encountered.", "Interview Questions": "N/A"}, {"date": "3 Dec 2013", "title": "Executive Admissions Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "In my opinion, they have a very professional pre-screening process.  There was terrific follow-up from the staff at headquarters.  The on-site interviewer, himself, who has apparently enjoyed great success at the institution, appeared uninterested in me as a candidate for the job, basically minimizing my credentials and past performance at a similar institution.  I was very disappointed with the way the interview went, but still hoped that things would work out somehow, as the staff at headquarters treated me very well.", "Interview Questions": "The apparently indifferent attitude of the interviewer towards my answers."}, {"date": "27 May 2015", "title": "Executive Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University (Houston, TX) in Dec 2013", "Interview Descriptions": "The interview consisted of basic questions with the hiring directors at the local questions. I was an employee referral. The hiring directors had varied styles so one focused on culture while the other focused on past experiences and skill contribution.", "Interview Questions": "How would you describe your past experiences as an admissions advisor?"}, {"date": "25 Nov 2013", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "Make sure your ideas and answers are clear and concise", "Interview Questions": "If I asked one of your colleagues about you what would they say negatively about you?"}, {"date": "26 Oct 2013", "title": "Student Finance Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at DeVry University", "Interview Descriptions": "Panel, behavior based questions", "Interview Questions": "Weaknesses"}], [{"date": "1 Oct 2013", "title": "Student Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at DeVry University (Portland, OR)", "Interview Descriptions": "Hiring and Interview Process was very professional and quick for me personally; however, judging by some of the other employees that worked here, I am constantly wondering how they managed to get a job at ALL, let alone with DeVry (they were VERY incompetent, unprofessional, and lacking critical thinking skills).", "Interview Questions": "There were no difficult or unexpected questions; they were all very \"standard\" and robotic."}, {"date": "17 Sept 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "Once the electronic rover has scanned your resume and human resources has vetted you, you'll have an in-person interview with the Director of Admissions, and then a second interview with the Campus Dean. There is an extensive skills test (math, logic, personality traits) If all of that is in your favor, then the background and drug test, and you're done.", "Interview Questions": "How would you sell an education since it is not something the customer can hold or readily see the effects that derive from it?"}, {"date": "10 Sept 2013", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Westminster, CO) in Sept 2013", "Interview Descriptions": "I was not particularly impressed by the interviewer who at the start of the interview indicated she was behind schedule (phone interview) so she wanted to push this call straight through.  As a prospective candidate, they are either interested in you or not, and this led me to believe she was just following a course that she was required to take.  Doesn't speak well of their hiring practices.", "Interview Questions": "One of the first questions of me was why I wanted to (continue) working?"}, {"date": "4 Jun 2015", "title": "Admissions Adviosr Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at DeVry University in Sept 2013", "Interview Descriptions": "Had to take a personality and IQ test.  A set of 3 interviews with a recruiter and upper management. After accepting the offer, had to complete a drug test", "Interview Questions": "Behavioral questions"}, {"date": "19 Apr 2016", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University (Naperville, IL) in Aug 2013", "Interview Descriptions": "It was a short phone interview which was actually the pre-interview for the real interview. I also took a test online before this mini interview over the phone. The person knew nothing about the position truly and when I asked her questions such as would I have to meet quotas to keep my job, she couldn't or didn't want to tell me. I passed the phone interview easily and was offered an in person interview within the next week or so. I ended up not going because I accepted another job offer.", "Interview Questions": "What is your experience in college admissions?"}, {"date": "21 Jul 2013", "title": "Academics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "There were three interviews. The initial one was with HR, and covered quite a bit of necessary information. The second was with the people working in the area where I would be, and was great both give and take. I was impressed with the quality of the people. The third, which should have been a caution for me, was that EVERY person for every position had to interview with the President of the campus. On a campus with hundreds of employees, this should have indicated a small-minded person who could not trust subordinates' judgment about employment.", "Interview Questions": "There were no difficult questions, and no gotchas. Some of the questions were obviously looking for rote answers, and were a part of a social norming process."}, {"date": "16 Jul 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Naperville, IL)", "Interview Descriptions": "I interviewed with the Director of Admissions and an Admissions Manager. They actually played \"good cop/bad cop\" to try and get me frustrated to see my reaction. I figured what was going on pretty quickly, and was able to handle it well. It turned me off to anything else these two women had to say for the rest of my time there. I was working within 2 weeks.", "Interview Questions": "The questions weren't difficult, typically customer service/sales pitch questions. Know that they are looking for you to be able to close the sale every time, through emotional manipulation if necessary. "}, {"date": "12 Jul 2013", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "Te hiring process consists of the initial assessment completed on a computer. It was the \"fastest & most accurate responses\" assessment that also measured problem-solving skills. If your results meet the needs for the position (whatever measurement they use) then you moved onto the interview process. For the SSC position, there were two parts to the interview process. There was a one-on-one interview with the direct manager for about an hour and a half. Then there was a panel interview of three to four DeVry employees from various departments for about an hour and a half. Both parts consisted of behavioral response-type questions, such as \"if you were in this situation, how would you respond\" or \"give me an example of a time where you had a challenging customer & how did you resolve it?\" Outside of the three hours total of interview time, the interviewee is complete. From there, the panel provides input on their perception of the individual and whether or not they would be a good fit for the team.", "Interview Questions": "\"When was a time you had to tell a customer \"no\" and how did you handle the situation?\""}, {"date": "10 Jul 2013", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at DeVry University", "Interview Descriptions": "basically they make you fill out a long form millions of questions then you do an inhouse group interview which is awkward followed by one on ones. It took HR a good 4 weeks to get back to me by which I was already employed with another company", "Interview Questions": "They were all off a white sheet of paper (skills/passions/goals) typical run of the mill"}, {"date": "27 Jun 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "Phone screen w/HR pretty standard situational questions....personality testing w/an algebra component. One on One interview with two people normally an assistant director (supervisor) and Director (manager). You will find a lot of the questions are sales oiented in nature but the terminology is tweaked slighty since this is not sales in theory. There will also be a drug and background check assuming you are offered the position.", "Interview Questions": "\"A student you interviewed calls back and says I want to hold off on school because I just got promoted and don't need it anymore\"....how do you get him/her to start classes anyway?"}], [{"date": "18 May 2013", "title": "Directon of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DeVry University", "Interview Descriptions": "Very simple but very detailed.", "Interview Questions": "What do you know about DeVry University?"}, {"date": "6 Jun 2013", "title": "Admissions Advisor I Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University (Orlando, FL) in May 2013", "Interview Descriptions": "This position was for the Online Programs Admissions Advisor I in Orlando,FL. First had a phone interview with someone for the IL headquarters. She called me 15 minutes late so I was pretty frustrated about that when she finally decided to call. The interview took about 30 minutes and she just asked standard behavioral questions, strengths and weaknesses, and asked me to go through my resume for her. About 15 minutes into the interview I heard dogs barking in the background. She freaked out and kept saying sorry that she was \"working from home.\" She told me someone would be calling in 2 days schedule a face to face interview. Didn't actually get a call until two weeks later.\r\n\r\nThe face to face interview wasn't that much better. I got there 10 minutes early for a 10AM appointment. I didn't get called in to see anyone until 10:45AM. Apparently the people at DeVry have no sense of punctuality. The interviewers (there were 2) were dressed in jeans and baggy t-shirts. One of them mentioned that it was casual Friday, but honestly if you know you're interview people you might want to dress a little nicer. The interview went well. They described the position and asked just about the same questions as during the phone interview. After the interview they put me with someone that was working to see what the a day working as an advisor would be like. They said they would get back to me in 3 buisness days and I still haven't heard back from anyone and it's been 2 weeks since I had my interview.", "Interview Questions": "What would you tell a student that told you no other university charges an application fee like DeVry does? "}, {"date": "26 Jul 2016", "title": "Full-Time Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at DeVry University (Irving, TX) in May 2013", "Interview Descriptions": "The interviewing process was a challenging but very positive experience.  I submitted my resume on a holiday weekend and surprisingly, got a telephone the following Tuesday morning.  The Recruiter was professional and was knowledgeable about the field of study I was pursuing as a professor.  The first question she asked was I sure I was prepared to relocate as my application indicated to save us both some time.  Recruiter was good at deciding if the conversation could proceed and jumped right in and said if was her responsibility to make me an offer I could not refuse! This I could not believe. This gave me the courage to dive in and ask some really hard questions early on and we chatted for a long time about things unusual on a first discussion, e.g. salary, title. In fact, she proposed a salary and I countered and she said ok. She proposed a title, and I countered and she said she had to get approval.  Approval came about 10 days later.  She asked key questions about my needs, wants and values along with explaining the process, i.e. telephone interview then face-to-face interview that involved travel to be interviewed by 6 others with a 20 minute presentation.", "Interview Questions": "Are you committed to relocating for this position?."}, {"date": "28 Mar 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at DeVry University (Arlington, VA)", "Interview Descriptions": "Interview process was streamline. Phone screening through HR Generalist. After phone screening was invited for a personal interview with the Director of Admissions following immediately by the Assistant Director of Admissions. Since I had nothing else to do that day, they pulled me directly into a Panel Interview with the Dean of Student Central, the Director of High School Programs, and Manager of Financial Aid.  I received a call the next day with the job offer.", "Interview Questions": "How would you regularly overcome an objection? "}, {"date": "22 Jun 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University (Philadelphia, PA) in Apr 2013", "Interview Descriptions": "The interview process was OK.  Could have been better....was a bit unorganized.  I liked all of the people I interviewed with, everyone was very nice.  The only issue I had was the confusion and lack of organization I experienced. the overall experience was just OK, I wasn't that impressed...but it might be a good fit for someone else, you never know.", "Interview Questions": "Asked me about work experience.."}, {"date": "12 Mar 2013", "title": "Senior Financial Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at DeVry University", "Interview Descriptions": "Quick...I was already working as a financial office assistant", "Interview Questions": "Why DeVry"}, {"date": "27 Feb 2013", "title": "Admissions Advisor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University", "Interview Descriptions": "Applied online\r\n1) Recruiter phone screen, job/responsibilities description, work hours then phone interview - \r\n30 minutes\r\n2) Personality and skills assesment test - 30 minutes\r\n3) 1:1 interview with direct report Hiring Manager- 45 minutes\r\n4) Phone interview with Regional Manager- 45 minutes\r\n4) 1:1 interview with campus Dean of Students - 1 hour\r\n5) Offer then background and drug screen\r\n\r\nHR staff was very professional, phone calls to set appointments followed up with email confirmations. Standard and behavioral interview questions based on customer service, problem solving and team work. Formal offer in writing with option to review benefits package before accepting offer. Very little room for salary negotiation.", "Interview Questions": "The usual interview questions, \"Walk me through your resume, Why do you want to leave your current employer, Why DeVry, What qualities do you bring to the team, What are your strengths, What are your weaknesses,Tell me about a time you had to deal with a difficult customer..."}, {"date": "12 Jul 2016", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at DeVry University (Atlanta, GA) in Mar 2013", "Interview Descriptions": "You have to teach in front of staff. I got hired pretty easily for this position.  They called immediately after I turned in my resume. It depends on what area you teach in. If you teach in IT or Sciences you will be more likely to be hired.", "Interview Questions": "Easy"}, {"date": "27 Jan 2013", "title": "Executive Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University", "Interview Descriptions": "Initial interview, was a group interview.  Second interview was a panel interview.", "Interview Questions": "N/A"}, {"date": "11 Dec 2012", "title": "Student Finance Consultant I Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at DeVry University (Fort Washington, PA)", "Interview Descriptions": "Phone,In-person interview and personality test.\r\nInterviews went very well but they promoted within, that is a good look to me because that shows they are loyal to there employees. I can respect that", "Interview Questions": "N/A"}], [{"date": "25 Jan 2013", "title": "Admissions Advisor I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University in Dec 2012", "Interview Descriptions": "I applied online on a monday, recieved a phone call from a recruiter the next day after I applied.  She set up a phone interview time for the following day. I spoke with the same person again over the phone. She asked question about my prior work experience and how I would handle different situations, the typical sales interview process. After the phone interview said somebody else will call me to set up an in person interview. She emailed me forms I had to fill out and a personality test, which I did right after the interview. A guy called me the next day to set up a interview time for the following day. I arrived for my interview that friday about five minutes early. I sat in the lobby and waited for about 15-20 minutes after my scheduled interview time, I didn't get offered any water or nothing. A guy and a girl finally came out to come interview me. They said they didn't know about the interview with me and that I didn't have a profile in the system which was bs because I did the forms on the computer the recruiter sent me 2 days prior. I had to give them my extra copies of my resume which I always have with me because I didn't have a profile. (so bring a bunch of resumes when you interview) The guy did pretty much all the talking while the girl wrote notes all over my nice resume. After the basic resume and experience questions he talked mainly about the University, what it had to offer as far as benefits,  and the training needed to perform the job, the girl would jump in randomly with a personality question or talk about how difficult the job is. She kept looking at the time while he was asking me questions and talking about devry. It was clear they weren't on the same page at all. Lol. When I was done she asked if I had any questions while she was cleaning up the interview table up, (stacking my resume and grabbing her pen) so I asked a  question directed towards the guy to waste more time since clearly it seemed like I was wasting hers. Lol. The guy said they will give me a call if I made the cut to interview with the dean of the school. We shook hands and the guy walked me to the entrance of the school while the girl left after we shook hands. I knew I wasn't going to get the job if she had anything to do with it. Lol. I got a rejection email about 2 weeks after that.", "Interview Questions": "They asked your basic sales interview questions like \"what coud you add to our team\""}, {"date": "17 Jul 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at DeVry University (Houston, TX) in Dec 2012", "Interview Descriptions": "I was required to demonstrate a 20 minute lecture to 6 full-time faculty members. \r\nSince, I was requesting to teach the psychology courses, I choose to give a lecture on Lance Armstrong and how he dealt with his diagnosis of testicular cancer during the Tour de France.  \r\n\r\nFocus:  Student centered, several methodologies, esp. technology.", "Interview Questions": "Why did you choose that topic for your lesson?"}, {"date": "29 Jul 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Philadelphia, PA) in Nov 2012", "Interview Descriptions": "Filled out application online.  Was interview over the phone then took personality assessment.  Met three separate times with different members of the team.  Typically interview questions, nothing out of the ordinary.", "Interview Questions": "What type of work environment do you exceed in?"}, {"date": "6 May 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at DeVry University (Tampa, FL) in Oct 2012", "Interview Descriptions": "Campus director interviewed me, set me up for an upcoming course, and provided me a sample syllabus and course textbook. She also let me know I had a week to prepare 9 weeks of lesson plans and bring them to her so she could review them. I was teaching this class within 4 weeks, and then taught it again and the follow-on course in the next term. Overall experience was okay, and I got hired!", "Interview Questions": "What experience did I have with teaching adult students in a higher education environment?"}, {"date": "14 Dec 2012", "title": "Associate Dean Business Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at DeVry University (Philadelphia, PA) in Sept 2012", "Interview Descriptions": "I applied online for the position. I received a phone call within 24 hours of my submission. I had an interview with HR which went well. I was then passed on the Dean, Associate Deans and Campus President. Each of these went well. I waited 40 days to get a non response as to whether an offer was forthcoming. I received 3 offers from competitors but wanted to see this situation to completion given i was interested in Devry. Finally, I called back HR and was disappointed that there was no decision. The HR person indicated to me that they were obviously in no hurry to fill the position. This was counter to the information given by the Campus President or Deans. After this I withdrew from the position an accepted an offer with another academic institution. Three days after I withdrew I received an email which didn't even have my name on it indicating they would be pursuing other candidates. Classy.", "Interview Questions": "The interview questions were behavior type questions."}, {"date": "29 May 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at DeVry University (Chesapeake, VA) in Jul 2012", "Interview Descriptions": "I received a call back in mid-July and interviewed with the Dean of Academic Affairs for a position that began in late August.  The first interview was 30 minutes, covering the basics - and there was nothing remarkable about it. I passed the screen. The second interview was a simulated classroom test, teaching to the Dean. He sought a highly interactive style of teaching in which every student would be asked a question at least once per session.", "Interview Questions": "Nothing was very difficult but I was asked to compute the CPI in the classroom session."}, {"date": "30 Nov 2015", "title": "PC Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at DeVry University (Chicago, IL) in May 2012", "Interview Descriptions": "The interview process basically covered over how to prep imaging a workstation. Support for Mac OSx as well. IT troubleshooting questions regarding PC failure, ram, blue screens, and customer support. There was a second interview with the director in charge that had questions revolving around Microsoft interview questions", "Interview Questions": "Why are manhole covers round?"}, {"date": "6 Jun 2012", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 months. I interviewed at DeVry University (Atlanta, GA) in May 2012", "Interview Descriptions": "Extended Interview and evaluation process with little communication between each successive step.  The people are very easy to relate to and work with and encourage you each step of the way.  The culture is definitely collaborative.  The standards for acceptance are high but not insurmountable.  The position being interviewed for was as an instructor for the Becker CPA Review course.", "Interview Questions": "Explain why you are interested in this position and identify the qualities that make you a superior candidate."}, {"date": "7 Aug 2012", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University (Downers Grove, IL) in Apr 2012", "Interview Descriptions": "I interviewed on site with several managers for two different positions in the HR department within a 3-month period.  No one got back to me.  I contacted the recruiters to politely ask whether the positions were filled and they did not respond at all.  Very unprofessional HR team!", "Interview Questions": "N/A"}, {"date": "9 May 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Naperville, IL) in Apr 2012", "Interview Descriptions": "3 interviews: The initial call screening (along with an online quiz), then there was the interview with the HR representative, and then an interview with two directors. This was really all to it.. it was not very complex or complicated but it did drag out for two weeks.", "Interview Questions": "behavioral based, they are all about what would you do if and how would you handle this, what have you done in situations like, etc."}], [{"date": "12 Oct 2012", "title": "Admissions Advisor I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at DeVry University (Bellevue, WA) in Apr 2012", "Interview Descriptions": "I applied online and a few days later recieved a phone call from a recruiter.  He set up a phone interview time.  I spoke with him again for the phone interview in which he asked me several questions about my prior experience and how I would handle different situations.  He was very nice.  He set up an in person interview for me with the director.\r\n\r\nI arrived for my interview with the director five minutes early.  I sat in a waiting room and could see her talking with someone else.  Fifteen minutes after my scheduled interview time she finally had time to talk with me.  She was nice but she asked questions that other interviewers don't normally ask such as what other schools was I applying to and if I was re-hirable at the last school I had worked for.  \r\n\r\nWhen it was my turn to ask questions, one question was whether or not they used a tiering system to distribute leads.  She acted like I was dumb and had just asked a stupid question.  Of course not!  Tiering is illegal and perhaps I needed to go home and do some more research on how things worked in this field.  (After I got home I asked an old co-worker if they were still using a tiering system at work.  Yes, they are.  So this director didn't know what she was talking about and she left thinking that I was the one who was misinformed.)\r\n\r\nWhen I was done she asked if I had any more questions.  I said no, that was in and she asked me if I was sure....twice.  It was as if she was trying to get me to ask something specific but I had no idea what I had missed.  \r\n\r\nI left knowing she wouldn't hire me but I sent the nice hand written thank you note anyway.  I heard nothing......from anyone.  I didn't even get a rejection email.", "Interview Questions": "Why do you want to work for DeVry over University of Pheonix?  (I wanted to say that either would do and really what I wanted was a job but I said something about their superior accreditation.)"}, {"date": "18 May 2015", "title": "Student Support Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at DeVry University (Pittsburgh, PA) in Jan 2012", "Interview Descriptions": "Basic interview process. First, a phone interview. Next a face to face interview. Basic questions. An assessment test was given as well as an IQ test. The entire process was relatively easy.", "Interview Questions": "What are your strengths? What are your weaknesses?"}, {"date": "23 Dec 2011", "title": "National Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 6 weeks. I interviewed at DeVry University (Phoenix, AZ) in Nov 2011", "Interview Descriptions": "Just be patient...  A week after I applied I had an initial phone interview with the recruiter (very nice and transparent) then met with the National Director a few days later.  I never felt I was in an interview, she made the atmosphere very relaxed and conversational.  We spoke for about 3 hours and I felt very comfortable with her, the various aspects of the position and the working environment.  Formal questions only dealt with the specifics of my previous position but the rest of the time we were able to get a good sense of each others character. \r\n It was refreshing to have such a relaxed interview after some of the other rigid formats I'd attended in the past. \r\nFew weeks went by (I'm sure they interviewed other candidates) I was offered a position with another company so I  called the recruiter with Devry, she got in touch with the National Director immediately.  She scheduled a phone call with me 2 days later, offered me the position and I accepted.  \r\n\r\nIntense background check, make sure everything is accurate on your application.  All of your references will be called.", "Interview Questions": "How many accounts were you required to close annually? "}, {"date": "1 Feb 2012", "title": "Student Finance Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DeVry University (Columbus, OH) in Nov 2011", "Interview Descriptions": "Everybody was friendly and very professional.", "Interview Questions": "What was a situation in which you had to deal with a difficult co-worker?"}, {"date": "30 Sept 2013", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at DeVry University in Oct 2011", "Interview Descriptions": "They ask behavioral interview questions.  There is a boacground check and drug screen.  They are hiring entry level Admissions Advisors for on line.  The on line division is the growth engine of Devry University.", "Interview Questions": "How would you deal with a co working that was not contributing to the team."}, {"date": "16 Jan 2014", "title": "IT Tech Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at DeVry University (Bethesda, MD) in Oct 2011", "Interview Descriptions": "They usually hire people who have connections within the company or you have to have extreme qualifications along with the grades", "Interview Questions": "What source would you use to give a student to find a laptop?"}, {"date": "20 Nov 2012", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University (Fremont, CA) in Oct 2011", "Interview Descriptions": "I applied normally through the library and had a recommendation from another worker so i got an interview immediately.", "Interview Questions": "What will you do when you do not have any work on hand to do?"}, {"date": "10 Jan 2012", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at DeVry University (Addison, IL) in Oct 2011", "Interview Descriptions": "Was called for a brief screen and set up a phone interview.  Phone Interview, which included situational questions and things like why devry? what are your strengths? How would you approach a situation in which the student was not interested? and the same ones others have posted here.\r\n\r\nWas told at the end of the phone interview that I would be set up with an on site interview with the director and assistant director of admissions.  The onsite interview was harder and more intimidating.  Director did most of the talking.  I knew in the middle of the meeting that I would not take the job if I got an offer.  Felt like the dude was nice because he had too not because he wanted too.", "Interview Questions": "What are your strengths?"}, {"date": "23 Jun 2014", "title": "Admissions Advisor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at DeVry University in Jul 2011", "Interview Descriptions": "Received an email from a recruiter. Spoke to recruiter in a phone interview. Took personality and basic math skills tests online.  Came in for in person interview - 2 people interviewed me at once. Had to get a drug screen test and they also had to verify that I had a Bachelor's degree. Got the offer a week later.", "Interview Questions": "What motivates you/how are you motivated? "}, {"date": "18 Sept 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at DeVry University (Orlando, FL) in Jul 2011", "Interview Descriptions": "Was referred by a friend and was told I would be called on a Wednesday. Didn't get the call until Friday. When I was called, the HR Generalist said my marketing background wasn't a fit for sales and customer service!? I literally had to explain how sales/CS is part of marketing and then explain how my resume was a fit for the job. It worked and I was brought in for an in-person interview.\r\n\r\nMy interviewer was super nice and made me feel very comfortable. I heard horror stories of other managers in the same office who were grilling candidates and asking them to \"sell them a pencil\" and overcome potential student objections.", "Interview Questions": "How would you handle an irate customer?"}], [{"date": "17 Jun 2012", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DeVry University (Miramar, FL) in Jul 2011", "Interview Descriptions": "It was a group interview consisting of the department head, the expected supervisor and a senior individual within the position", "Interview Questions": "What is you best strength?"}, {"date": "24 Jan 2013", "title": "Manager Local Accounts Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at DeVry University (Denver, CO) in Jun 2011", "Interview Descriptions": "Interview process was lengthy but lacked substance.", "Interview Questions": "N/A"}, {"date": "22 Aug 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at DeVry University in May 2011", "Interview Descriptions": "Started with phone interview, then invited in for group interview, then one-on-one with the Director.  The director was salesy as they come.  CHEESY.  I was initially so turned-off by him that I considered turning down the position. However, when I met with the team, I was told that he had little knowledge of how to do the job. They said that they would teach me, and protect me from his leadership.", "Interview Questions": "Tell me about a time when you helped influence a person do something"}, {"date": "28 May 2015", "title": "Admissions Advisor II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Henderson, NV) in Jan 2011", "Interview Descriptions": "Phone call with HR, group interview, interview with campus president, then with direct report. Long process. Tedious. Drug test required. Not relevant to real role. Very detailed screening. Online assesment is ridiculous.", "Interview Questions": "Strengths"}, {"date": "17 Jul 2015", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at DeVry University (Downers Grove, IL) in Jan 2011", "Interview Descriptions": "Laid back interview process with two multiple people in the room.  The interview was approximately twenty minutes long and the demeanor of the interviewers/future co-workers during the interview was true to their character.  I still enjoy working with them.", "Interview Questions": "Asked some problem-solving, scenario-type of questions"}, {"date": "30 Dec 2015", "title": "IT Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University (Henderson, NV) in Jan 2011", "Interview Descriptions": "Must submit online application and receive in person interviews (possible phone interviews as well with regional team management depending on service type and location). All positions are offered first internally and then public. Once publicly offered, all candidates must be reviewed even if previous experience in role. There is no favoritism and they are concerned with finding a good match for the DeVry Culture of Care as you will be working closely with a local team and skill set or experience at technical matters is not enough to win you the job. I recommend brushing up on conversation and performing practice interviews prior to process,.", "Interview Questions": "Why do you think you would be a good fit for our company\\position?"}, {"date": "29 Jul 2015", "title": "Operations Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DeVry University (Nash, TN) in Jan 2011", "Interview Descriptions": "I interviewed with the campus director and the leadership team. They asked multiple of behavior based questions. They asked me to tell them about myself and other interview questions. The interview lasted for about an hour.", "Interview Questions": "career goal"}, {"date": "23 Mar 2012", "title": "Admissions Advisor I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at DeVry University (Indianapolis, IN) in Jan 2011", "Interview Descriptions": "Behavioral based questions with a large emphasis on customer service and comfort level on phone.", "Interview Questions": "How would you feel about making 75 phone calls a day?"}, {"date": "8 Apr 2011", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at DeVry University (Long Beach, CA) in Oct 2010", "Interview Descriptions": "The interview process began with the normal scheduled phone interview with an HR representative. Easy enough since they seemed to be interested in a bubbly, outgoing personality. She immediately offered an in-person interview which she promised to call back and schedule by the end of the day. Three days later I had not heard from her, so I had to contact her. \r\n\r\nThe email I received to confirm my in-person interview was typo-ridden, which doesn't normally bother me. Except she misspelled her director's name, whom I was to call upon arrival to the site. So I essentially called the director (my interviewer) by the wrong name over the phone for a job that is heavily phone-based. Awesome.\r\n\r\nTypical interview with friendly office and staff. I was offered a group interview, but was notified a day before that they wish me luck on my career search elsewhere. \r\n\r\nIt got interesting when out of the blue three months later they call for a group interview which I attended. I was the only person who showed up. The HR rep seemed rushed and unfocused making me feel like I had completely wasted my afternoon. She concluded by saying that she would review my past interviews and contact me (aka \"Why didn't we like you before?\"). I received no contact whatsoever even after a interview thank you note and follow-up inquiry. Basically seems like the HR department might need to review their own performances.", "Interview Questions": "What do you know about the position?"}, {"date": "31 May 2012", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at DeVry University (Fremont, CA) in Aug 2010", "Interview Descriptions": "I applied for the position and was contacted. I had two interviews with different panel interviewers in each, asking a series of questions. The interview was pretty much like a regular interview, but they really want to know of your achievements and what you can bring to help the campus and company grow.", "Interview Questions": "This position requires the applicant to be available during shift work, how flexible are you with your schedule?"}], [{"date": "23 Sept 2010", "title": "Account Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at DeVry University (Chicago, IL) in Aug 2010", "Interview Descriptions": "Was called for a phone interview with an HR person that lasted about 30 minutes.  Then, took a skills test and a personality test, then was promptly emailed saying that they would like to interview me in person.  Went to the site, and interviewed with 2 managers at the same time.  I was told I would hear back in a week, heard back 2 weeks later that I was not chosen.", "Interview Questions": "Describe a time when you tried to reach a goal but failed."}, {"date": "20 Jul 2010", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at DeVry University (Chicago, IL) in Jul 2010", "Interview Descriptions": "I initially was referred to DeVry by a staffing company employee, because I had a good phone personality and sales skills.  I submitted my resume without having seen a job description, so I didn't know that I was under the min. experience level requested.  Initially I had to complete an online screening test, consisting of math (finance story problems) and a personality test.  Next, I had to send a follow-up email and leave a voicemail before getting an interview set up.  The HR rep later later told me that they want to see persistence and follow-up in their applicants.\r\n\r\nThe first part of the interview was with two lower management members.  They were suspicious that my desire to help people would interfere with my capacity to excel in the sales aspects of this position, which, if you haven't already guessed from reading the other reviews, is actually what the position is focused on.  The second part of the interview was with an upper management member who seemed disinterested in the whole thing.  Questions in both parts were very standard \"corporate interview\" fare.  These people take the idea of selling an education very seriously.\r\n\r\nSeveral days later, the HR rep contacted me and said they had gone with another candidate who met the experience criteria, but referred me to a different campus location to interview for a similar position.  This position, \"High School Admissions Recruiter\", appears to be the exact same job as the regular \"Admissions Advisor\" except that you specifically target high schoolers and their parents.  This position has less of an experience requirement, so they can pay you less money for doing essentially the same job.\r\n\r\nI went to a different Chicago location to interview the next day, and was told that the man I was supposed to interview with had left the office for the day already because there had been a miscommunication.  Instead, I met only with the HR representative, and was told I'd have to come back on yet another day in order to meet with the man who had left the office early.  I felt this was rather unprofessional and was annoyed by the whole thing.  Everything seemed very disorganized in the offices there (downtown location appeared to be much more professional).  \r\n\r\nBy the time I left, I decided I have no desire to work there and try and \"sell\" kids on an education that they can't actually afford.  I was initially drawn to interview with them because of the 39K starting salary and great benefits, which could really help me out.  The High School Admissions Rep starts at 35K, though, and while it would be worth it to me to do certain other jobs for that salary (I'm a recent college grad and it's hard to get that much at entry level in this economy) I just wouldn't be able to stomach doing this job.  \r\n\r\nIf you do decide to pursue this job, my advice is to follow-up a lot - they're looking for sales people, and will judge you on how persistent you are in selling yourself.", "Interview Questions": "How do you define hard work?"}, {"date": "14 Sept 2010", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at DeVry University (Chicago, IL) in Jul 2010", "Interview Descriptions": "Received a phone call and immediately had a phone interview, a few weeks after filling out an online application. An in-person interview was scheduled immediately. During that interview, I was asked a bunch of questions relating to my ability to work on a team / handle pressure on the job / etc. It seemed to go well and I was even advised that I shouldn't worry if I didn't hear back soon as the process takes time. I was given a business card and told to stay in touch. Around three weeks later, I received an email saying they were going with a different candidate.", "Interview Questions": "It seems like you're more than qualified for the position. How can we be sure you won't leave when something better roles around?"}, {"date": "19 May 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Fremont, CA) in Jun 2010", "Interview Descriptions": "The interviewing process consists of several phone and/or personal interviews. The applications are screened by internal recruiters and candidates must complete a behavorial assessment before the initial meeting with the hiring manager. Typically, once in the interview process a candidate will need to interview three different managers before an offer will be provided.", "Interview Questions": "All of the questions are situations based questions so it is important to go into the interview prepared with examples of real life situations where you were able to solve a problem or handle a specific situation."}, {"date": "21 Mar 2011", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DeVry University (Charlotte, NC) in May 2010", "Interview Descriptions": "It started with a phone interview with HR, then a face to face interview, with DA, then ADA. Then another face to face interview with the Dean of the campus.  Then I phone interview with the regional DA.", "Interview Questions": "I was asked to role play during the first interview, and convince the DA to attend the school"}, {"date": "10 Jun 2013", "title": "Registrar Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at DeVry University in Mar 2010", "Interview Descriptions": "Most of the time the interview process starts off with a phone interview/screening conducted by HR. Based on how that conversation goes, they may or may not invite you in for an in-person interview with the individuals who represent the hiring department. A hiring decision is made shortly after the round of in-person interviews.", "Interview Questions": "Questions are surprisingly basic/vague in the sense that they’re pretty much standard questions that could be used for any entry level position – most questions are based on skillsets that would be useful for the position but no questions in which were specifically based on the registrar position in the higher ed industry."}, {"date": "31 Mar 2010", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at DeVry University (Addison, IL) in Mar 2010", "Interview Descriptions": "DeVry found my resume online and proceeded to call me for a brief phone interview/screening.  I was invited to a group interview on a Saturday morning at their offices in Addison.  The interview consisted of an info session about the company, job details, benefits, etc.  This was about an hour long.  The second hour was spent going around the room and asking different interview questions to each person in the room, and answering them in front of the others.  We went through the whole room twice (two questions for each person, about 12-14 people in the group).  At the end we were instructed to leave a resume and fill out a form that detailed availability for a 1:1 interview if they decided to go that route, followed by a tour of the facility.  It seemed like a standard cubicle farm, but plenty of windows and it did seem to be a place with decent camaraderie cultivated by competition between small teams.  I was called 6 days later, the next Friday, and set up an interview for the next week.  That was a standard interview.  I heard back 4 days later by email from their head HR person that they would be going a different direction.", "Interview Questions": "Name three strengths and three weakness"}, {"date": "16 Apr 2011", "title": "Admissions Advisor I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at DeVry University (Phoenix, AZ) in Mar 2010", "Interview Descriptions": "As long as you act like you care about people and their educational goals then you will get the job... I had a friend get an interview here and the manager asked her to \"sell his watch to her\".. DeVry is really a joke, so I wouldnt even accept an interview, unless you were desperate.", "Interview Questions": "Tell me about a time that you tried to help someone and they were not happy with your service?"}, {"date": "24 Jul 2014", "title": "Online Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at DeVry University (Chicago, IL) in Mar 2010", "Interview Descriptions": "It was actually a pretty simple process.  I referred by a friend to a recruiter.  She forwarded my resume to him.  He liked what he saw.  Call and spoke to me about my credentials.  I interviewed in January and got the job in February and started training in March.  There is a lot of paperwork to complete.", "Interview Questions": "N/A"}, {"date": "26 Dec 2012", "title": "Student Finance Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DeVry University (Wood Dale, IL) in Aug 2009", "Interview Descriptions": "Met with upper management of all women who asked questions that are not out of the ordinary.  Easy to answer and prepare for.", "Interview Questions": "None"}], [{"date": "14 Jun 2011", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at DeVry University (Chicago, IL) in Jun 2009", "Interview Descriptions": "Recruiter called, I had to interview with her on the phone and in person. Then I did a group interview with other candidates. Then I did a 1:1 interview with a ADA and DA", "Interview Questions": "What role do you play in a team environment"}, {"date": "20 Mar 2009", "title": "Admissions Advisor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at DeVry University (Kansas City, MO) in Mar 2009", "Interview Descriptions": "Great interview.  The process was very clean.  I was scheduled and met with the appropriate personnel.  I did have an initial, very brief phone interview to gauge my interest.  The interview lasted a couple of hours.  Very professional environment. The culture is business professional, progressive, but very relaxed.  I was very impressed with the interviewer(s) and the staff who greeted me.", "Interview Questions": "Describe an experience where you failed."}, {"date": "4 Aug 2013", "title": "Student Finance Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at DeVry University (Wood Dale, IL) in Feb 2009", "Interview Descriptions": "I worked with a staffing agency who suggested the job for me.  She said I would have my own portfolio of students that I would help set up financial aid for.  I was told most of my communication would be via email and also phone (they didn't make it very clear that it's really just a call center and every phrase you have to say is determined for you - you're out of compliance if you deviate from the phrases they tell you to say)", "Interview Questions": "None were difficult.  All customer service based questions, such as \"explain a time you had to deliver difficult news to someone and how did you handle it?\""}, {"date": "27 Oct 2009", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at DeVry University (Chicago, IL) in Jul 2008", "Interview Descriptions": "You start with a basic phone screen and if meet teh basic qualifications you are you'll go in for a group interview with roughly 15 other candidates. If you stand out you are scheduled for a face to face interview and required to do an online skills assessment before hand. If you are successful with the face to face you will extended a conditional offer pending drug test and background check results.", "Interview Questions": "Why do you want to work at DeVry?"}]]