[[{"date": "31 Dec 2022", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Palomar Community College", "Interview Descriptions": "Emailed me with a schedule for when I could do a phone interview. Called me right on time. Answered a few basic questions, mainly relating to my availability and offered me the job over the phone.", "Interview Questions": "What are your available hours?"}, {"date": "5 Jun 2022", "title": "Speech Faculty FT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Palomar Community College", "Interview Descriptions": "Typical Academic Interview however the job posted stated that faculty may occasionally be asked to assist with the forensics team but almost every interview question was about literal coaching experience.  \r\n\r\nThis department is shady, they hired the wife of a full-time faculty member who's husband was on her hiring committee.  Nepotism much?", "Interview Questions": "Tell us about your coaching experience."}, {"date": "5 Sept 2022", "title": "Assistant Professor of English Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Palomar Community College in Apr 2022", "Interview Descriptions": "Very rigid interview structure. Went into a room for 15 minutes to prepare pre-selected 10 questions. Then, I was shown into a room with about 10 faculty members who read through the questions in order. No follow-up questions were asked. Part of the 10 questions was a fifteen minute teaching demo, which had to be done with absolutely no technology. I had use of the whiteboard and could provide a one-page handout. Overall, I had a positive experience, and everyone was very nice. I didn't make it to the second round, and I would have liked a less rigid interview structure. For instance, it would have been nice if any of the committee members would have offered follow-up questions; however, I understand that HR may not have allowed them to do that.", "Interview Questions": "Explain how you incorporate diversity, equity, and inclusion into your teaching style. (not the verbatim question/prompt, but this was the general idea)"}, {"date": "1 Mar 2022", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Palomar Community College in Jun 2021", "Interview Descriptions": "The interview was via zoom. \r\n\r\nThere was an initial overview and discussion of what they looked for and then asked if you had any questions. \r\nProcess involved overview of academic achievements, minimum GPA, questions on motives, and past experiences.\r\nThere seems to be a preference for students.", "Interview Questions": "Q: What is the most recent math courseyou have taken? What was your grade?"}, {"date": "31 May 2019", "title": "Student Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Palomar Community College", "Interview Descriptions": "The email describing the interview process deemed the interview rigorous, which led me to spend hours preparing not only personal documents (resume, etc.) but also a presentation (including a PowerPoint Presentation and a leaflet). The interview process included a written section to be completed on MS Word, 5 minutes to review interview questions, a 30 minute interview, and a final presentation. All of that would have been fine if not for the stale & disengaged interview committee. It seemed like no one wanted to be there and that they in fact already had a candidate whom they wished to hire. A huge waste of time! Do better, Palomar.", "Interview Questions": "What experience do you have using databases?"}, {"date": "14 Apr 2019", "title": "Admissions and Financial Aid Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Palomar Community College", "Interview Descriptions": "Committee of people. Questions were in regards to how to deal with students, what makes you qualified for the job, how to deal with stress and how much do you know.", "Interview Questions": "Why are you qualified for this job"}, {"date": "24 Oct 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Palomar Community College", "Interview Descriptions": "Application was submitted online in April, did not receive a call for recruitment until the end of September. My interview was scheduled 3 weeks later. Went in for first interview with 6 committee members as interviewers. They gave me a skills assessment and then 10 minutes to prep answers for about 16 questions. They said I would know that afternoon (this was a Friday) if I was picked for the second round. Received a call the next Monday for the final round interview and was asked to come in the next day because they said there was only one time to meet me. Had the second interview, this time with only 3 committee members. Again, I was told I would find out within 24 hours, but did not receive the final decision until 2 weeks later (I had to call and email HR, who only responded to one of my emails).", "Interview Questions": "Many questions, all specific to the position."}, {"date": "14 Jan 2018", "title": "Enrollment Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Palomar Community College", "Interview Descriptions": "Began with a written question and thirty minutes to complete. The interview was very rushed and did not give much a chance to go into depth about experience and knowledge outside of technical. Very strict and regimented interview. When I asked questions they were shrugged off without a answer, just 'you don't need to worry about that part of the job description' and similar reactions to any questions.", "Interview Questions": "Rate your knowledge and experience with job related software."}, {"date": "24 Aug 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Palomar Community College in Nov 2017", "Interview Descriptions": "The interview process was not lengthy or too challenging. The company was great to work for. HR made the hiring process fairly easy and straightforward. This job provided a great learning experience for me. My supervisor was great at preparing me for this position.", "Interview Questions": "Tell me about yourself.\r\nWhy Palomar College?\r\nWhat makes you a good candidate for this position?"}, {"date": "8 Jan 2018", "title": "Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Palomar Community College (San Marcos, CA) in Nov 2017", "Interview Descriptions": "Although the process took a long time from the application to the first interview, everyone in the process was extremely professional and after the first interview, things happened quickly. \r\nFirst interview was written test followed by panel interview. Second interview was just a panel with my questions (about 10). \r\nOverall, very positive experience with everyone in the process.", "Interview Questions": "Depending on the job, they will ask you some questions related to your experience with current role and the one you are applying to. Fairly easy, if you have experience in the role. "}], [{"date": "31 Jan 2018", "title": "Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Palomar Community College (San Marcos, CA) in Aug 2017", "Interview Descriptions": "I had a Panel Interview; received paper with questions  and had to do a presentation. Interviewers were friendly and approachable. Had a couple questions regarding presentation before but thats part of the creativity of the person.", "Interview Questions": "how do you deal with difficult coworkers?"}, {"date": "8 Jul 2018", "title": "Adjunct History Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Palomar Community College (San Marcos, CA) in Jul 2017", "Interview Descriptions": "I had my interview over Skype and it was relaxed. It lasted for about 1-hr and we basically just discussed history. What I want to teach it, what about it do I feel most comfortable. Very easy interview. The Interviewer was very easy going and I think that really took the pressure off of me. It was a historian talking to another historian so we talked more about history than the actual job, which I didn't mind at all.", "Interview Questions": "Why do you want to teach history?"}, {"date": "6 May 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Palomar Community College", "Interview Descriptions": "The department and HR seem pretty incompetent. They mostly just hire from the local colleges (hard to attract outside talent when you don't pay for interview expenses). The department required so much materials and I don't believe they actually looked over most of it.", "Interview Questions": "standard Qs"}, {"date": "4 Sept 2015", "title": "Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Palomar Community College", "Interview Descriptions": "I applied online and received a call from HR to set up an in-person interview with the hiring committee. The interview process is very organized. The HR person sent me a detailed itinerary for the interview, which included a 15 minute test, 10 minutes to review the interview questions, and 30 minutes for the actual interview itself. While organized, I felt like the entire process was extremely rushed. I checked in on the day of the interview, then was escorted quickly to a different building  and handed the test before I even had a chance to catch my breath. After the test and question review, I was then escorted to another area where I met with the hiring committee. When I entered the room, everyone looked extremely bored and no one even greeted me. I had to be the first to say hi and introduce myself. It was very off-putting. The interview itself was fine, they have the question list visible on the table in front of you, but each committee member goes around and reads the questions aloud. Before the interview started, they made a point of telling me that there was only 30 minutes for the interview, so I had to keep my answers fairly short. This made it difficult to actually share my qualifications to the full extent because I was so nervous about going over time. I understand that they had a schedule of interview to get through, but their unfriendliness and the fact that I was rushed through everything did not make it an enjoyable experience.", "Interview Questions": "How would deal with a co-worker you didn't like?"}, {"date": "7 May 2015", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Palomar Community College (San Marcos, CA) in Sept 2014", "Interview Descriptions": "It was a group interview and we were being questioned by one of the managers. At one point, since there were about 6 people in the group, everyone started repeating answers and running out of things to say. It became a competition of who could say the essential elements the fastest; those who didn't ended up looking like a fool because the manager was insistent that everyone talk.", "Interview Questions": "Did you have any previous customer service experience?"}, {"date": "22 Apr 2013", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Palomar Community College (San Marcos, CA)", "Interview Descriptions": "Overall, it was a good experience.  They allow the interviewee to review the questions to be asked for 10 minutes prior to the interview itself.  The questions depend on the position being applied for.  In my experience, they were not difficult.  A committee conducts the interview, which takes about 45 minutes.", "Interview Questions": "Describe a time when you had to compromise with a colleague.  When would you be unwilling to compromise?"}, {"date": "21 Jan 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Palomar Community College", "Interview Descriptions": "Found the job advertisement on their website and on craigslist. I faxed my application and was invited to a group interview where a set questions on a sheet are asked. They even share the sheet with you. Afterwards you take a English or Math test. Received a voice mail from the program's office lead that I should call for an update on my application. I called and was told by a receptionist I had not gotten the position but was also asked about being an alternate if interested. A week or so later I received a call from the program's office lead asking if I was interested in an opening they had and I accepted. Background check was highly time consuming. Shots had to be taken, finger prints had to be done, and paper work had to be submitted to HR.", "Interview Questions": "How would handle conflict with a supervisor?"}, {"date": "8 Aug 2012", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Palomar Community College (San Marcos, CA)", "Interview Descriptions": "depends on your field of expertise and degree.", "Interview Questions": "N/A"}, {"date": "6 May 2014", "title": "Information Services Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Palomar Community College (San Marcos, CA) in Aug 2010", "Interview Descriptions": "Bachelors in Computer Science required, Masters in Computer Science preferred.  As many professional certifications as possible.", "Interview Questions": "Specific technical questions to test your technical expertise."}]]