[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Wondeful, inspiring and caring place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Jul 2023", "job_title": "Legal Operations Manager in Cambridge, England", "duration": "N/A", "pros": "Inspiring company mission and ethical outlook Cares for its employees", "cons": "Parts of the organisation are old and/or have staunchly established mindsets and ways of working which can make it challenging to implement changes"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Riding on the brand", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "4 Jul 2023", "job_title": "Senior Operations Manager in Cambridge, England", "duration": "N/A", "pros": "Great office, nice plants, great food, some great people, good work/life balance", "cons": "Salaries lower than the market, (proven by my new role), very limited career prospects, management can’t make decisions, some really poor managers with under performance ignored, really difficult to make a difference no matter how hard you work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not the place it used to be", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "4 Apr 2023", "job_title": "Senior Project Manager in Cambridge, England", "duration": "N/A", "pros": "Wonderful people Nice food Good work life balance", "cons": "The merger caused a massive culture shift for former assessment employees who are now left feeling like the poor relative. Senior positions all seem to go to Press employees and there is very little attempt to bring genuine cohesion to the two organisations or acknowledge the damage that it is doing to the culture. It no longer feels like a place that cares about it’s employees, there is lip service from the c-suite execs but while they all benefit from their huge bonuses it is hard to feel they really care or understood what it is like for employees anywhere else. There was a feeling that merging would be easy so even though from a technical point of view it has happened from the human point of view it is more divided than it ever was meaning people feel left out and unwelcome in future direction for the organisation."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Mixed bag", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Jul 2023", "job_title": "Delivery Manager in Cambridge, England", "duration": "N/A", "pros": "Normal company perks at corporate level. Some REALLY great people.", "cons": "Systems are outdated, and there's a huge backlog of issues becuase of this. Constantly felt like we were fighting against snr management to get action taken and the merge of assessment and Press was a glacial activity. My manager was micromanaging everything I did, but others across the business were great."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Limited opportunities", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Mar 2023", "job_title": "Content & Digital Marketing in Cambridge, England", "duration": "N/A", "pros": "* Pay reasonable (for publishing) \r\n* Good colleagues \r\n* Good food & drink facilities \r\n* Close-ish to station", "cons": "* Highly silo'd structure, with major barriers between divisions and departments, e.g. between technology and publishing. \r\n\r\n* Inert, sometimes authoritarian senior management (one director in particular appeared to treat most other staff, male in particular, with something approaching contempt) \r\n\r\n* Keen to promote women - great if you're a woman but opportunities for men seemed limited. (This was quite overt: one time there was a communication more or less saying that in future we'll be looking to promote women first; a follow up reassured that it would all be done within the law regarding sex discrimination.)\r\n\r\n* Limited scope for substantive career dev't discussions, in my experience, even at annual review \r\n\r\n* Managers often seemed essentially uninterested in their staff \r\n\r\n* Bottom line: it's a turn up and do your work sort of place, not a place to have exciting ideas!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Organisation is not customer focused and doesn't care for lower banded staff's opinions!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Mar 2023", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "Good benefits. Nice buildings to work in. Diversity is excellent.", "cons": "Since the merging of the assessment and press side there is no cohesion between the two. I'm a customer service type employee and day to day I deal with more customer dissatisfaction than anywhere I've ever worked! CUPA have no interest in their customers nor sorting out their queries. When I try to make management aware of this, I have been basically told I'm too helpful, I care too much and I'm not to agree with the customer being justifiably frustrated with our organisations poor customer service. It was inferred I just need to be a type of robot with my replies (this being the case, they should just automate the system, if they don't want the human touch, which clearly they do not).  Therefore, they don't care about getting customer complaints. They don't train their employees properly. Poor senior managers get away with being bad at their job and seemingly have no accountability. My motivation is zero now. I have lost all respect for this organisation and cannot wait to leave as soon as I'm able to!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "We are there to make a profit for Cambridge University ....", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Apr 2023", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "There are hardworking people who care and make this place work A great office environment and mainly pockets of the organisation which truely support hybrid/flexible working Good gender balance in most teams, up to senior roles We treat each other with respect and value the skills and expertise diversity can bring We are moving more to an agile way of working outside of the Tech area (who have role modelled this for years)", "cons": ".... and therefore the validity of the Executive Board, People & Culture Team, Senior Leadership team and Internal communications is diluted. At the end of the day, we are being squeezed on headcount, budgets and as a result the ability to attract the skills we need, and this is led by University. The merger was a cost saving activity."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Lots of contractors", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Jun 2023", "job_title": "Software Developer in Gateshead, England", "duration": "N/A", "pros": "Interesting work and nice people.", "cons": "Too many contractors and not enough permanent staff"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great company, lovely office, hard to progress", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Mar 2023", "job_title": "Production in Cambridge, England", "duration": "N/A", "pros": "The new building is amazing and there are great benefits such as summer and winter events. It is also in a great location close to the train station. Lots of friends have worked there for years and it’s a fantastic place to progress your career from teaching. The salary is ok but not amazing.", "cons": "I would say there are a lot of know it alls and people desperately proving how intelligent they are. I think this was just my division. There is a lot of pressure due to the nature of the work and not enough staff to ease the work load. There are also a lot of big fish in a small pond desperate to prove how clever they are which is really boring after a while. Very little cultivation or training for staff or focus on career progression"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 May 2023", "job_title": "Publishing Executive in Cambridge, England", "duration": "N/A", "pros": "Flexible working, hybrid working, great team atmosphere, good management of workflow, great benefits. Company wide meetings to keep everyone in the loop. Free training provided with an encouragement to use work time for personal and professional development.", "cons": "Can go from very quiet to very busy quite quickly. Progression can be a bit limited. Because it's a big company, it's not always clear what the big picture is."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good place to work but many changes due to the Merge", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Jun 2023", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Good place to work, Cambridge office had great facilities but can be hard to get in and out off. Flexible working is advantageous", "cons": "Some pains due to the complexity of integrating 2 large organisations."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Depends what team you are in.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "8 May 2023", "job_title": "Assistant Director in Cambridge, England", "duration": "N/A", "pros": "USS Pension (though don't that that is now available to others) Reasonable work-life balance Some areas very flexible about remote and flexible working Some areas have a progressive and fresh working environment", "cons": "-Bonus is very small on pre-merger Assessment contract -There is a lot of good intention, but it is very hard to get meaningful change put in practice, a lot of steadfast cautious stakeholders -Processes take a long time to get approval /decisions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great facilities and people to work with", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Apr 2023", "job_title": "Senior Sales Operations Executive in Cambridge, England", "duration": "N/A", "pros": "The people: colleagues, manager, customers. Hybrid working. Great facilities at head office in Cambridge.", "cons": "The systems are clunky, the processes are baffling sometimes and the constant change is confusing. Also there is a lot of outsourcing to third party companies in countries with poor employment rights."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Amazing team and managers", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 May 2023", "job_title": "IT Helpdesk Analyst in Cambridge, England", "duration": "N/A", "pros": "The Helpdesk team I worked on were amazing. The overall manager was incredibly supportive and always aimed to empower the team", "cons": "The senior managers in the company aren't as supportive. There's a lot of top decisions that don't consider the needs of smaller teams"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Fine", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Apr 2023", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Good pub in the back garden.", "cons": "To be promoted one must bake a lot of cakes, and be enthusiastic about bouncy castles and games in the company pub."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Office politics dominated", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Apr 2023", "job_title": "Assessment Administrator in Cambridge, England", "duration": "N/A", "pros": "Good transport links, easy to move between departments, some teams are really positive to work within, pay is ok", "cons": "Lack of kitchen area made it difficult to bring lunches from home Very few roles available at band D, making progression difficult Chronic bullying is not addressed So much office politics"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Lovely place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 May 2023", "job_title": "Compliance Officer in Cambridge, England", "duration": "N/A", "pros": "Really nice culture at the company", "cons": "Progression is a bit difficult unless you are a teacher"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Still a tale of two (good!) companies", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Mar 2023", "job_title": "Editorial in Cambridge, England", "duration": "N/A", "pros": "The English department has a very respectable mission statement and the majority of people work very hard at all levels to fulfil that mission statement. The offices in Cambridge have a positive and friendly vibe when enough people are working in them, and I have made several friends for life by working here. The business is finally making a real push towards improvements in building a diverse and inclusive working culture. Management and colleagues were supportive and empathetic when I had debilitating health issues, and I have seen teams rally around other colleagues in times of need - on both a personal and professional level - which I've seldom seen in other organisations. Office facilities are generally top-notch and clean. Union presence is a great boon to the workforce. By far and away, the people we work with are the best thing about the business.", "cons": "It does sometimes feel like we're still in the teething period following our merger, which isn't especially encouraging a couple of years on! People still talk about the organisation as if there are two businesses, rather than one. Some colleagues are now unclear on what's expected of them day-to-day and long-term, whereas before there was clarity. There have been times in the last two years where morale across the business has absolutely plummeted, with no real engagement by leadership to listen and respond to concerns. This hasn't been helped by slim opportunities for career progression and stagnating salaries. A very meeting-heavy working culture, which would be fine if meetings actually resolved anything (which they don't always do... they just lead to more meetings!), and very old-fashioned working practices and processes. The fruits of our labour around EDIB aren't really reflected in our workforce yet, especially at senior management and leadership levels. There has been very inconsistent communication around hybrid / flexible working advice and policies, which has left a lot of colleagues feeling confused and worried, especially when travel, health and financial considerations need to be taken into account (and arguably, prioritised)."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 May 2023", "job_title": "Compliance Officer in Cambridge, England", "duration": "N/A", "pros": "Friendly and helpful staff Great building and work environment Amazing canteen", "cons": "It gets monotonous at times"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great experience, great team", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Apr 2023", "job_title": "Senior Assessment Manager in Cambridge, England", "duration": "N/A", "pros": "Flexible working Interesting work and opportunities Responsibility early on Fantastic line manager Wonderful team Good pay", "cons": "Poor decision-making at the top with little explanation Slow to change/behind other, smaller companies in the same field Focus on profit over quality in the last few years Pay cuts in real terms for the last few years Pay gaps (gender, disability, ethnicity) Secret redundancies"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Education Company that does not educate", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Apr 2023", "job_title": "I.T Analyst in Cambridge, England", "duration": "N/A", "pros": "Great people, Great Canteen, Great Location", "cons": "No Progression, Education Company that does not educate it's own staff, Staff Training very poor."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worse since the merger - taking our rights and cutting our pay", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "28 Jul 2022", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "A lot of colleagues there are great to work with. The work is interesting and can be quite varied.\r\nMiddle and upper middle management tends to be fairly decent. Training and development opportunities and efforts to be more inclusive are improving.", "cons": "Since Press and Assessment merged, there have been significant efforts to strip important terms and conditions from contracts and make it harder for unions to represent staff. We're also seeing significant real-terms pay cuts at a time when the company is doing well and the cost of living is rising.\r\nThe board seems keen to crush the last remaining morale and to ensure that staff joining the company in the future have a much poor deal than existing staff. If you're tired of being lied to and spat on by the government, you'll get the same treatment here by upper management.\r\nThere also seems to be an increase in pressure to return to the office, even though Covid numbers are high and the level of presenteeism means that you're likely to catch other viruses from put-upon staff who feel they have to be there."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Needs clearer direction", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "7 Feb 2023", "job_title": "Assessment Lead in Cambridge, England", "duration": "N/A", "pros": "Contributes to the success of students worldwide.", "cons": "The assessment and operations divisions lack investment and are taken for granted internally, even though general qualifications and English exam entries are the vast majority of our entries. More emphasis is put on exciting international projects, and the staff who work in those areas have much more fulfilling jobs. The core parts of the business lack investment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Design Team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jan 2023", "job_title": "User Experience Designer in Cambridge, England", "duration": "N/A", "pros": "Variety of designers with different backgrounds and specialisms. Great structure being created around the Agile approach. Lot's of training and support. Super company goals for the future.", "cons": "Like every big company, there are a lot of people to meet and find out what they do, which can be daunting for some people."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "25 Feb 2023", "job_title": "Senior Assessment Manager in Cambridge, England", "duration": "N/A", "pros": "Very nice colleagues with decent terms and conditions.", "cons": "Poor senior leadership decision making at times and a propensity to restructure departments."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Apr 2023", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "Lots of opportunity to move to other roles and progress", "cons": "Can take a while to make progress"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Mar 2023", "job_title": "Research Assistant in Cambridge, England", "duration": "N/A", "pros": "High level research, good work environment", "cons": "No parking as it was a city centre location"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Feb 2023", "job_title": "Teaching Fellow in Cambridge, England", "duration": "N/A", "pros": "Lot of freedom to explore new things", "cons": "No cons in my viewpoint"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good Place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Jan 2023", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "people were lovely, training was good and easy to understand. was able to work from home before i left", "cons": "there wasnt always support available when needed"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Good company to work in", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jan 2023", "job_title": "Project Manager in Cambridge, England", "duration": "N/A", "pros": "very friendly people and flexible", "cons": "Low salary compared to other companies"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Mission oriented", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Dec 2022", "job_title": "Operations Teamleader in Cambridge, England", "duration": "N/A", "pros": "Beautiful building, wellbeing is important, hybrid working, flexible, opportunities for development, and mostly the people", "cons": "Cost of living in Cambridge makes hybrid difficult for some."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Fair place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Dec 2022", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "Good balance of teams Hardworking people Really great new workspace", "cons": "Not very collaborative Senior leaders don’t feel accessible Hierarchy very apparent Not diverse at all Career development unclear/slow Work is repetitive"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Jan 2023", "job_title": "Programme Manager in Cambridge, England", "duration": "N/A", "pros": "Flexible Care for the employees Canteen", "cons": "Not much variety of projects"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Dec 2022", "job_title": "Finance Director in Cambridge, England", "duration": "N/A", "pros": "World famous iconic brand that cares about staff and educatione", "cons": "None that is worthy of note"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Loved working here", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jan 2023", "job_title": "Textbook Editor in Cambridge, England", "duration": "N/A", "pros": "Supporting their mission was the highlight", "cons": "Managers were not great at managing or support"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Finance Department", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Apr 2022", "job_title": "Royalties controller in Cambridge, England", "duration": "N/A", "pros": "Good holiday entitlement & on site facilities are also good.", "cons": "Many sadly.... I cant speak for other departments in the business but the finance department was (and as I hear still is) a complete mess. I couldn't in good conscience recommend anyone working there, certainly in the finance department. There is better out there & would strongly urge anyone applying for a role in finance (and especially within royalties) to look elsewhere. The salaries are not competitive either which also doesn't help the issue."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Well established company with great values. Pay could be better", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Aug 2022", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Flexible hours, remote working, great Academic Department, line managers are very understanding. Good company values.", "cons": "Pay could be better, it is low, in line with cost of living and compared to industry standard. Unite currently in dispute of par award. There is not much scope for me move forward other than team lead, which is not particualrly what I want to do."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great Mission, Great People,", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Nov 2022", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Great Mission Great People Good Cambridge Location Challenging workloads", "cons": "Challenging workloads Below market rate salary"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A newly merged organisation", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "31 Aug 2022", "job_title": "Business Analyst in Cambridge, England", "duration": "N/A", "pros": "Cambridge University Press & Assessment is a great place to work. There is a wide range of product areas and departments with various specialisms to base your career on. Friendly working environment and good people. Great canteen!", "cons": "The companies (Cambridge University Press and Cambridge Assessment) have recently merged, and there is a lot of work going on to align departments, systems, processes, and cultures. This is proving more tricky in some areas and will take some time to settle."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Antagonistic, deceptive management, excessive outsourcing and no progression", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "3 Nov 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Staff discount on books published by the organisation.", "cons": "Poor pay - This used to be offset by the press being a nice place to work, is now just unpleasant in every regard.\n\nAntagonistic, deceptive management - You have to fight for every little thing, whether it's resources, time or even a reasonable workload, upper management deliberately avoid direct contact with front line employees all the while pocketing excessive bonuses/wages.\nWhile doing this they tout how the \"people are important\" and \"just speak to us if you need extra resource\" while taking actions that are the opposite.\nWhen someone leaves it either takes months to advertise/replace or the role is outsourced to Manilla at a fraction of the cost/competence. \nThese are the sort of people that will spit in your face and tell you it's rain.\n\nNo Progression - self explanatory, lots of nepotism, where there is progression it's based on who knows who, not merit.\n\nThe organisation has changed a great deal over the last few years. I used to be proud to work here but now that management is filled with Yes men who's solution to any problem or issue is to ignore it and let it fester. \nHere's hoping the University proper intervenes soon, turfs these people out and restore the organisation to a fraction of its former glory."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": "N/A", "review_title": "Ready to change", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Oct 2022", "job_title": "Senior Manager in Cambridge, England", "duration": "N/A", "pros": "Great people to work with - and a fantastic mission", "cons": "Could be changing faster to keep pace with the market"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Weak C-Suite and direct reports leadership continues", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "19 Sept 2022", "job_title": "Senior Leadership Role in Cambridge, England", "duration": "N/A", "pros": "Facilities, flexible working , subsidised canteen", "cons": "Weak leadership in C-Suite and direct reports, a refuge for those made redundant by competitors"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Professional environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "28 Oct 2022", "job_title": "Research Assistant in Cambridge, England", "duration": "N/A", "pros": "flexibility, good holidays, location, diverse, full filing", "cons": "low salary, not easy to progress, depends how you report to, pension not so beneficial anymore"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Not what you would expect", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2022", "job_title": "Internal Sales Executive in Cambridge, England", "duration": "N/A", "pros": "Bonus scheme Cycle to work Hybrid work", "cons": "Bonus paid almost half a year after financial year finishes Low salary"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "People are amazing to work with", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Nov 2022", "job_title": "HR Advisor in Cambridge, England", "duration": "N/A", "pros": "People are great to work with. Canteen", "cons": "Culture creation for new organisation is still ongoing"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great employer", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Aug 2022", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Flexible working (location and hours)\r\nFantastic benefits including amazing maternity/paternity, healthcare, cost of living payments\r\nOpportunities to work on pioneering products and projects\r\nWorking for an organisation that makes a difference to people's lives through education and is driven by this mission", "cons": "Still very hierarchical which slows down innovation and will be a barrier to our digital future. This out of date controlling leadership style is from the very top, which means that leaders who want to create empowered teams are stilted by the controlling top."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Waste opportunity", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "26 Aug 2022", "job_title": "Delivery Lead in Cambridge, England", "duration": "N/A", "pros": "Heritage, CA office building and location", "cons": "Weak management\r\nNo direction\r\nNo motivation\r\nDisempowered teams"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company culture and people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Aug 2022", "job_title": "Marketing Executive in Cambridge, England", "duration": "N/A", "pros": "The culture is fantastic and my managers were always incredibly focused on my development.", "cons": "Sometimes difficult to get promotion within your own team due to lack of open roles."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place for opportunities", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Sept 2022", "job_title": "Business Applications Support Technician in Cambridge, England", "duration": "N/A", "pros": "Career progression opportunities are plentiful.", "cons": "Depending on what you like most, working for such a large company might be overwhelming."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": ".", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Sept 2022", "job_title": "Accounts Receivable Manager in Cambridge, England", "duration": "N/A", "pros": "Union . Salary . Holiday . People . Variety", "cons": "Merge. Lack of transparency from management: loss of structure"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Good intentions, very poor execution", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Mar 2022", "job_title": "Product Manager in Cambridge, England", "duration": "N/A", "pros": "Some very well meaning people and experts in quality learning content.", "cons": "Extremely top down and old fashioned ways of working. The recent merger has only exacerbated this further with product strategy being driven by the large and influential IT team. The current push is to introduce ‘product management’ across the business, what has been discussed is waterfall at its core. If you what to work with digital products for Cambridge be prepared for a lack of authority, slow decision making and the very much expected 5 year feature roadmap."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place to work but sallary ...", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "16 Aug 2022", "job_title": "Distribution Assistant in Whittlesford, England", "duration": "N/A", "pros": "A good place to work, safely stable employment.", "cons": "Salary well below the average in the area"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good employer but no progression", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Jan 2022", "job_title": "Assessment Lead in Cambridge, England", "duration": "N/A", "pros": "Fair employer; managed home working well. Almost has a de facto monopoly in some areas of English testing.", "cons": "Its a place for a job not a career. Small scale promotions do happen but the organisation doesn't support progression like an FTSE 100 company might. Management is a mixture but can be condescending. People who do the bread and butter work get limited reward beyond gimmicks and words. What they really want is opportunity for growth and development but most senior roles are external hires. The CEOs of all three awarding bodies are ex Pearson, for example."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Appalling senior management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "9 Jun 2022", "job_title": "Senior Assessment Manager in Cambridge, England", "duration": "N/A", "pros": "Nice office\r\nDelicious and subsidised canteen\r\nGood local and shopping discounts\r\nWell respected organisation\r\nFlexible working", "cons": "Senior leadership is terrible - incapable of making and communicating decisions well, or of accepting responsibility or being innovative\r\nPoor career progression opportunities\r\nPay progression is poor\r\nMission statement of the organisation isn't followed in reality"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Disjointed and lacking vision and direction", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Jul 2022", "job_title": "IT Manager in Cambridge, England", "duration": "N/A", "pros": "Life / work balance. flexibility", "cons": "Over directive management, little empowerment, disinterest in individuals"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great Place to Work for Some", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jul 2022", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Good benefits/pension\r\nGreat for job seekers closer to retirement", "cons": "Base salary is low compared to other companies"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The merger is a big challenge, and it is not clear that the group is up to it", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Jul 2021", "job_title": "Management in Cambridge, England", "duration": "N/A", "pros": "Some wonderful people, trying to deliver the best outcomes and service they can.\r\nThere is a big sense of responsibility for all the students who rely on the results - people really care .\r\nOpportunities to move and increase your skills with the large company.\r\nAmazing modern Cambridge building (now of course, mostly standing empty!)", "cons": "The merger is showing up some significant cultural differences and it does not feel as is these are being addressed - just brushed under the carpet.\r\nThere is a sense that the merged senior leadership team feel pretty 'male, pale and stale'.\r\nYou have to look out for yourself, because despite what the company says, HR are not there to support your career.\r\nThe group faces increasingly stiff external competition from digital companies who are leaner, smarter, faster and more agile - it is in danger of falling far behind.\r\nThere are no consequences - either for doing an outstanding job, or for doing a terrible one.\r\nA very political atmosphere which takes up much of the senior management time and effort"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Not as inclusive and divers as they to be portrayed as", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Apr 2022", "job_title": "Education Advisor in Cambridge, England", "duration": "N/A", "pros": "Adaptive environment - very careful and considerate of mental wellbeing", "cons": "Been told I cannot get an internal promotion because I am too young & I do not have enough years of experience\r\nProbably also because I am a woman."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good company", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Jun 2022", "job_title": "Events Coordinator in Cambridge, England", "duration": "N/A", "pros": "Flexible hybrid working options\r\nGreat catering in Cambridge office", "cons": "Lots of changes all the time\r\n\r\nCompany let's good people leave"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Anonymous", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jun 2022", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Great culture and lots of opportunities", "cons": "Integration makes the environment challenging"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jun 2022", "job_title": "Senior Marketing Executive in Cambridge, England", "duration": "N/A", "pros": "Friendly teams\r\nProfessional development opportunities\r\nGood pay\r\nGood management", "cons": "I can't think of any"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 May 2022", "job_title": "Education Manager in Cambridge, England", "duration": "N/A", "pros": "Wonderful colleagues. Much improved approach to flexible working. Good career options.", "cons": "Top-down leadership and decision making."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "The best benefits, but poor pay for the area", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 Dec 2021", "job_title": "Commissioning Editor in Cambridge, England", "duration": "N/A", "pros": "Generous pension scheme and benefits, opportunities for progression (if you're willing to apply for jobs), nice atmosphere, good colleagues, good work/life balance, flexible working, generous maternity leave, good engagement with diversity and inclusion.", "cons": "Pay rises are always below inflation, long service / high achievement in a role is not recognised financially, pay for each role is usually below the market rate for the area."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Marks", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 May 2022", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "Good place to work and opportunity to grow", "cons": "Nothing much as cons to tell"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 May 2022", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "Freindly and happy and cheerful", "cons": "There are no cons I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Apr 2022", "job_title": "Compliance Officer in Cambridge, England", "duration": "N/A", "pros": "Supportive of employees; stable employer who prides itself on the welfare of employees", "cons": "Salary could be more competitive compared to other companies around Cambridge"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "good", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 May 2022", "job_title": "Software Engineer in Cambridge, England", "duration": "N/A", "pros": "it is a good place to work", "cons": "no comments on this one"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good for childcare; bad for career promotion", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Apr 2022", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Flexibility, friendly working environment, good for childcare person", "cons": "bad for career promotion, low pay, slow process"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to work, terrible salary progression", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Mar 2022", "job_title": "Business Analyst in Cambridge, England", "duration": "N/A", "pros": "Work life balance is great, projects are interesting, food is briliant", "cons": "Budget for personal development and salaries are lower than you would find elsewhere"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jul 2021", "job_title": "Product Owner in Cambridge, England", "duration": "N/A", "pros": "I have been working here in total for over 18 months and I have loved almost every minute of it. The people are what really makes this company. Everyone is so motivated and proud to work here, and it makes everything so much easier. The company itself is very forward thinking which was a surprise considering they're over 500 years old, however the solar panels on top of the office, their inclusivity to all, the optional webinars that are organised, and the managers who always make you feel as if you can be 100% honest about your situation is amazing.", "cons": "Working in technology, our department as a whole is below average on pay. Considering the amount of work and effort that is put into making systems function, it can be slightly demotivating knowing someone else is doing the same (or less) and paid more in other companies."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Caring company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Apr 2022", "job_title": "Platform Manager in Cambridge, England", "duration": "N/A", "pros": "great culture, very friendly people. Good work life balance", "cons": "not many to be honest"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Apr 2022", "job_title": "Senior Project Manager in Cambridge, England", "duration": "N/A", "pros": "Great place to work and progress", "cons": "Can be a little bureaucratic at times"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Friendly", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Mar 2022", "job_title": "Brand Manager in Cambridge, England", "duration": "N/A", "pros": "Friendly and supportive with lots of opportunities", "cons": "Different teams and areas can be quite varied"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great from outside, questionable from inside.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Jan 2022", "job_title": "Csd in Cambridge, England", "duration": "N/A", "pros": "The company itself gives you opportunities to lots of benefits. Has a really good hybrid working policy.", "cons": "You may have the feeling that employees are not treated fairly across the company, there are huge discrepancies within departments."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Feb 2022", "job_title": "User Experience Designer in Cambridge, England", "duration": "N/A", "pros": "Excellent company, great upper management, they invest in our training, lovely colleagues, good collaboration", "cons": "Salaries could be higher in some fields"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Feb 2022", "job_title": "Administrator in Cambridge, England", "duration": "N/A", "pros": "Flexible working, development opportunities, good colleagues", "cons": "might be a bit low pay, skills you learnt there may not be transferable"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Mostly....BAD", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Nov 2021", "job_title": "Portfolio Manager in Cambridge, England", "duration": "N/A", "pros": "if you want to plod along, cash in your cheque and have little aspirations, that's your place. If you do too well, your manager will sideline you because achievers are seen as a threat. I experienced different part of the organisation and more or less it is the same old fashioned ultra-bureaucratic way.", "cons": "Cons.....well, nepotism, double standards, no innovation, old fashioned management style, bureaucracy bureaucracy bureaucracy and most of all the drive to lower salaries"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Great company culture", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Nov 2021", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "Work life balance, company culture and supportive management.", "cons": "Pay - difficult to get a pay rise as it often needs to be approved at multiple levels. \r\nIf you are lucky to get one, it will only be significant if you are getting promoted or changing roles/department."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "na", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jan 2022", "job_title": "Analyst in Cambridge, England", "duration": "N/A", "pros": "A very good environment to work in", "cons": "the location is hard to travel if you are on night shift and don't have a car"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Good Company, great values", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Jan 2022", "job_title": "Java Software Developer in Cambridge, England", "duration": "N/A", "pros": "flexibility and freedom in taking decisions", "cons": "low salary and not many growing opportunities"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Merger and Culture", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "18 Jan 2022", "job_title": "Solution Architect in Cambridge, England", "duration": "N/A", "pros": "The best in the company are the people.", "cons": "Lack of vision and chaotic enviroment to work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A Good Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Nov 2021", "job_title": "Product Manager in Cambridge, England", "duration": "N/A", "pros": "Family-Friendly, Intelligent workforce, stimulating, hybrid positive", "cons": "Not agile, reactive rather than predictive, high jargon employer, some areas of ineffective communication and processes"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jan 2022", "job_title": "PhD Student in Cambridge, England", "duration": "N/A", "pros": "I really like working there", "cons": "Could have a lot of pressure"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Dec 2021", "job_title": "Operations Support Administrator in Cambridge, England", "duration": "N/A", "pros": "Great Place Great People, Best place to work in Cambridge", "cons": "Nothing to declare, CAUP is a great place"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Jan 2022", "job_title": "Senior Manager in Cambridge, England", "duration": "N/A", "pros": "Great committed people, good benefits", "cons": "Difficult to progress once you reach a mid-senior level"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A company that genuinely looks after its employees", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Nov 2021", "job_title": "IT Manager in Hexham, England", "duration": "N/A", "pros": "Genuine concern for the wellbeing of its employees. Good, regular and honest communication with employees.", "cons": "It's a big company so has inevitable bureaucracy minefields for seemingly minor processes."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jan 2022", "job_title": "Teacher in London, England", "duration": "N/A", "pros": "Quality, standards, reputation, respected, prestigious", "cons": "Don't know yet have not been with them long enough"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "great company needs to modernise and is doing so", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Nov 2021", "job_title": "Senior Product Manager in Cambridge, England", "duration": "N/A", "pros": "great pension, great mission and good team ethos", "cons": "needs to be more focused and get the technology on track"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Some good intentions, but siloed and backwards", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Dec 2021", "job_title": "Data Scientist in Cambridge, England", "duration": "N/A", "pros": "Quiet pace; good purpose (education)", "cons": "Difficult to get things done. Still siloed and strange power dynamics frustrate those who would really drive change."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Generally good employer", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jan 2022", "job_title": "International Business Development Manager in Cambridge, England", "duration": "N/A", "pros": "Decent benefits and friendly colleagues", "cons": "Complicated organisational structure under review"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing experience! I enjoyed working with the team, I felt valued and respected. Good company benefits.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Nov 2021", "job_title": "Test Production Administrator in Cambridge, England", "duration": "N/A", "pros": "Work-life balance, company benefits, professional development opportunities", "cons": "No opportunity for internal promotion"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible toxic place", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Mar 2021", "job_title": "Senior Technology Manager in Cambridge, England", "duration": "N/A", "pros": "Academic publishing is changing everyday - it is an exciting field to be working in, but just not at the Press who are backwards thinking, heavily siloed business groups and not really interested in the charity aspect - it is more a money saving bonus.", "cons": "Too much to list. Bullying by upper management. Toxic environment. Huge numbers of staff off with stress. \r\n\r\nOld fashioned practices, lack of strategy and forward thinking vision. Tech leadership is terrible - the CTO is only interested in his own career creating a dog eat dog environment. Many people treated with lack of respect and back stabbing.\r\nIt is all hidden behind fake smiles. \r\nCurrently leadership are also very male and very white - inside conversations reflect this \r\nTerrible company - stay away if you value your health."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Good except for the merger", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Aug 2021", "job_title": "Assessment Manager in Cambridge, England", "duration": "N/A", "pros": "Friendly kind and committed colleagues.\nSo much intelligence and expertise across the organisation which is a pleasure to work with.\nNice office with really good subsidised canteen.\nInspiring work which makes a difference to people's lives.\nMostly a good work/life balance with good flexibility.", "cons": "The merger with CUP is bringing negativity and uncertainty which is a shame."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Nov 2021", "job_title": "Senior Educational Advisor in Cambridge, England", "duration": "N/A", "pros": "Good management, flexibility, very interesting and varied international work", "cons": "Can be extremely bureaucratic and some processes are extremely slow"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Exceptional employer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Nov 2021", "job_title": "Digital Communications Manager in Cambridge, England", "duration": "N/A", "pros": "Relaxed, equal, fair, collaborative, respectable", "cons": "Historical brand harder to innovate"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Oct 2021", "job_title": "Chemical Engineer in London, England", "duration": "N/A", "pros": "Good exposure to the educational world", "cons": "Very Stress to get everything spot on"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Traditional, Supportive, Slow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "20 Oct 2020", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Cambridge supports it's staff with good training and progression opportunities if you can demonstrate your abilities. There are always opportunities to innovate and improve, and often you are given the remit and autonomy to test, learn and enhance strategies, activities and processes. Most colleagues are collaborative and many are hugely skilled and intelligent. Open conversations about improving female and BAME representation across the business and at board level is encouraging. On-site gym and sports field, canteen and cafe areas are all a plus.", "cons": "Although the majority of teams and individuals are collaborative, responsible and supportive, it appears that performance management is a challenge. There are a handful of individuals at senior/director level who have repeatedly demonstrated behaviour that is unprofessional at best, and downright bullying at worst, who are still in the organisation and have been for multiple years."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Lots of changes, academic infighting and politics", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Oct 2021", "job_title": "Infrastructure Architect in Cambridge, England", "duration": "N/A", "pros": "leave, amount of work and confusion", "cons": "amount of work, confusion and pay"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A nice place to work but with downsides", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Apr 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "welcoming working environment\r\ngood training opportunities\r\nflexible working\r\nnumerous roles so many opportunties for progression\r\non-site gym and sports facilities", "cons": "slow, cumbersome and confusing processes\r\nunclear roles and responsibilities \r\nthe collegiate atmposphere can result in a lack of drive and ambition amongst the staff"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "HEadline", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Oct 2021", "job_title": "Project Assistant in Cambridge, England", "duration": "N/A", "pros": "Good company to work with", "cons": "temp contracts common, merged with CA"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Mostly excellent but worried for the cultural future", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jun 2021", "job_title": "Product Manager in Cambridge, England", "duration": "N/A", "pros": "Wellbeing focus\r\nWorking environment \r\nTraining opportunities \r\nPension \r\nHolidays", "cons": "Culture still very hierarchical \r\nTeams not empowered to make change \r\nToo many layers of decision making and political game playing."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Entitled staff, mediocre leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Jun 2021", "job_title": "Operations in Cambridge, England", "duration": "N/A", "pros": "Food is amazing, you’ll never find better at a works canteen", "cons": "Game-playing leaders who are weak, unable to make decisions and clearly miss the travelling perks (I suspect that’s why they joined). \n\nEntitled staff are exhausting to work with."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Oct 2021", "job_title": "Administrator in Cambridge, England", "duration": "N/A", "pros": "Good atmosphere and nice people", "cons": "None to note at the mo"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for - very innovative", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jun 2021", "job_title": "Human Resources Business Partner in Cambridge, England", "duration": "N/A", "pros": "Really care about the Employee Experience\r\nMaking significant changes to make work a great place to be\r\nValue everyone's opinion and listen to employees\r\nGreat employee benefits\r\nNice modern building with fabulous facilities\r\nSupportive Managers", "cons": "As with all organisations, there is some dead wood resistant to change"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A time of change", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jun 2021", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "Hard working and totally focused on getting the best opportunities and outcomes for pupils and schools", "cons": "Too much too soon - the timing of a merger on top of busting a gut to achieve new solutions at break neck speed is untenable"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work for the most part", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 May 2021", "job_title": "Quality and Compliance Coordinator in Cambridge, England", "duration": "N/A", "pros": "Great benefits, facilities, events and people. All walks of life and feels quite diverse. You can progress if you want to.", "cons": "A culture of presenteeism at times and too many hours. The systems were outdated and it is a big job to upgrade so very manual tasks can be time consuming. Could be a bit political,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jul 2021", "job_title": "Operations Administrator in Cambridge, England", "duration": "N/A", "pros": "Amazing company to work, a lot of opportunities, great people and a lot of diversity. Friendly atmosphere", "cons": "Low salary, inconsistent workload, there were very busy days and days when you had nothing to do."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jun 2021", "job_title": "Publisher in Cambridge, England", "duration": "N/A", "pros": "Great people, generous salary, plenty of opportunity.", "cons": "Frequent changes in systems and ways of working."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "CRM Systems", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "15 Jul 2021", "job_title": "Product Owner (PO) in Cambridge, England", "duration": "N/A", "pros": "Great office, good wellbeing facilities", "cons": "Needs to pay Cambridge salary rates"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A mission-led organisation that values its team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Aug 2021", "job_title": "Global Sales Director in Newcastle upon Tyne, England", "duration": "N/A", "pros": "Great people policies in place.", "cons": "Lacking some commerciality in key areas."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Jul 2021", "job_title": "Senior Consultant in Coventry, England", "duration": "N/A", "pros": "Brilliant company to work for. Great work culture", "cons": "Cant think of any. Best company i have worked for"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Overall great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jul 2021", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Flexibility, trust, No micromanagement, good staff benefits, well established company, career progression.", "cons": "A lot on temporary contracts, pay could be better,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Professional place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Jul 2021", "job_title": "Administrator in Coventry, England", "duration": "N/A", "pros": "Very fair to staff\r\nGood management\r\nGood money", "cons": "Limited progression opportunities\r\nLimited car park"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jul 2021", "job_title": "Facilities Manager in Cambridge, England", "duration": "N/A", "pros": "Exciting work and fun people to work with.", "cons": "None that I can remember at all."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Interesting work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jul 2021", "job_title": "Apprentice Data Scientist in Cambridge, England", "duration": "N/A", "pros": "Flexible hours, understanding staff, good training benefits", "cons": "Confusing company structure, muddled priorities"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great culture and place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Jun 2021", "job_title": "Software Engineering Manager in Cambridge, England", "duration": "N/A", "pros": "Worthwhile mission, great people, good facilities, open culture, social and sports, interesting projects", "cons": "The parking situation isn't great"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Old Fashioned", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Feb 2021", "job_title": "Chief Operating Officer in Cambridge, England", "duration": "N/A", "pros": "Part of a renound University", "cons": "Hierarchical, bureaucratic, leaders self serving and controlling, no career development and little chance of progression. No sense of urgency or drive to accomplish anything. No consequences for not delivering, no reward for exceptional work and achievement. Policies and leadership drives mediocrity."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Really good job", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Jun 2021", "job_title": "Exam Marker in Derby, England", "duration": "N/A", "pros": "Good pay, good people, chilled atmosphere", "cons": "Sometimes the managers in charge were quite rude for no reason"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Disappointed", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 May 2021", "job_title": "Internal Sales Executive in Cambridge, England", "duration": "N/A", "pros": "Good company, good benefits, intelligent people", "cons": "Very difficult to be promoted or to learn something new"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Work life balance and diverse culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Apr 2021", "job_title": "Business Analyst in Cambridge, England", "duration": "N/A", "pros": "Work life balance\r\nOpportunity to learn & train\r\nEmployee well being & health \r\nGood Pension\r\nDiverse culture", "cons": "Long time in taking decisions; Risk averse\r\nSenior management is traditional in approach"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jun 2021", "job_title": "Researcher in Cambridge, England", "duration": "N/A", "pros": "Decent company with highly competent people.", "cons": "Not many opportunities for career progression."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Good for upskilling", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Apr 2021", "job_title": "Senior Data Analyst in Cambridge, England", "duration": "N/A", "pros": "Opportunity to upskill and learn\r\nAbility to move within the company\r\nFlexible working", "cons": "Weak Leadership team\r\nVery low starting salaries for the area (Cambridge)\r\nVery low bonus"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Nov 2020", "job_title": "Senior Editor in Cambridge, England", "duration": "N/A", "pros": "Comfortable office, sports and social activities, diverse office community (lots of different nationalities), great subsidised canteen, excellent location", "cons": "Management a bit staid - difficult to be innovative, some older employees stuck in a non-digital way of working, but that might have changed since I left, pay decent but unfortunately not really 'enough' for Cambridge - an expensive city"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 May 2021", "job_title": "Anonymous Employee in Newcastle upon Tyne, England", "duration": "N/A", "pros": "nothing, fantastic place to work", "cons": "good career opportunities, training, well paid"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "good", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 May 2021", "job_title": "PhD Student in Cambridge, England", "duration": "N/A", "pros": "good research and great facilities", "cons": "not really anything bad to say"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "A nice place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Jan 2021", "job_title": "Senior Manager in Cambridge, England", "duration": "N/A", "pros": "The people who you work with day to day are really friendly.\nThere's no high pressure from the leadership team, which makes it \"comfortable\".\nThe pay is ok, flexible working and general benefits are good.", "cons": "The leadership team lack vision and drive which means that things don't change or get done quickly.\nThere's a lot of burocracy that can be frustrating, quite higherricical."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great company, great perks!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Mar 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Great office environment in Cambridge\r\nPeople development and career progression\r\nFacilities are top spec", "cons": "Hierarchy and leadership complex still a problem\r\nUnfair salaries compared to similar organisations\r\nSmall annual bonuses"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Nice place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Apr 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Culture, flexibility, people, location, parking", "cons": "Slow pace of progress and some outdated ideas."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "good company", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2021", "job_title": "Payments Manager in Cambridge, England", "duration": "N/A", "pros": "employee assistance programme very up to date", "cons": "inflexible working system in place"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great place to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "19 Apr 2021", "job_title": "Operations Excellence Manager in Cambridge, England", "duration": "N/A", "pros": "Good benefits, diverse team, flexible working", "cons": "Compex organisation structure that takes time to learn"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Once upon time a great organisation", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Apr 2021", "job_title": "Senior Manager in Cambridge, England", "duration": "N/A", "pros": "Flexible working, canteen, building facilities", "cons": "Poor, weak and inexperienced leadership"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Feb 2021", "job_title": "Customer Service Coordinator in Cambridge, England", "duration": "N/A", "pros": "Support their staff well, lots of benefits to working there", "cons": "None - working from home is harder as you don't get the benefits of being at the offices. However, this is the same everywhere and can't be helped"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Looks after people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "8 Apr 2021", "job_title": "Senior Operations Manager in Whittlesford, England", "duration": "N/A", "pros": "People are respected and looked after", "cons": "none that I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "HR and pay need to improve", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Feb 2021", "job_title": "Operations Administrator in Cambridge, England", "duration": "N/A", "pros": "Flexible working, generous holiday allowance, good location", "cons": "Pay is below average, HR is terrible"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Postdoctoral Research Associate", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Mar 2021", "job_title": "Postdoctoral Research Associate in Cambridge, England", "duration": "N/A", "pros": "good enviroment, a lot of facilities, very prepared people", "cons": "there were no cons, it is a great place to do research"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Process Oriented Company", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Mar 2021", "job_title": "Supply Planner in Cambridge, England", "duration": "N/A", "pros": "Nice and friendly colleagues, close relationships within the team, helps building communication skills.", "cons": "Very good at identifying process flaws rather than getting the issue fixed."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great organisation where you are encouraged to do what works for you", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Feb 2021", "job_title": "Administrator in Cambridge, England", "duration": "N/A", "pros": "Positive and inclusive environment\r\nFriendly\r\nLocation and facilities\r\nFlexible working", "cons": "Lack of parking available, commute is unreliable"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Mar 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Really smart and engaged colleagues.", "cons": "Less global publishing roles than other STM companies"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Good people to work with but not good to their people.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "6 Jan 2021", "job_title": "Sales and Marketing Director in London, England", "duration": "N/A", "pros": "reputable brand and organization. Acceptable level of autonomy. Quality products.", "cons": "Still very conservative and unfair pay scales. For an NPO, profits are all that matter."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "volatile teams system", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Apr 2021", "job_title": "QA Engineer in Cambridge, England", "duration": "N/A", "pros": "canteen, pension, holidays, friendly teams", "cons": "no hikes, whatsoever the performance."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Bog standard CS role", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Mar 2021", "job_title": "Senior Help Desk Analyst in Cambridge, England", "duration": "N/A", "pros": "introducing working from home finally", "cons": "treated unfairly \r\ndo way more work than management and get paid a lot less"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "OK company", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Feb 2021", "job_title": "Analyst in Cambridge, England", "duration": "N/A", "pros": "Relaxed Atmosphere, deadlines are ok to miss", "cons": "Politics needed to succeed, the people in higher positions do not make room for ambitious people from below to succeed"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Very good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Mar 2021", "job_title": "PhD Student in Cambridge, England", "duration": "N/A", "pros": "It's a very good university", "cons": "I don't think there are any downsides"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good employer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Mar 2021", "job_title": "Distribution Assistant in Cambridge, England", "duration": "N/A", "pros": "God stable work and environment.", "cons": "Not to high salary and bonuses."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "?", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Mar 2021", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "good very very good books", "cons": "none cons i can think of"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good employer", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Mar 2021", "job_title": "Research Officer in Cambridge, England", "duration": "N/A", "pros": "Good benefits, good work life balance", "cons": "Low pay, bureaucracy, slow decision making"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Hierarchical and slow moving but looks after staff", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "13 Dec 2020", "job_title": "Senior Manager in Cambridge, England", "duration": "N/A", "pros": "Good opportunities for learning and development, lots of talented and committed colleagues.", "cons": "Hierarchical, promotion is haphazard, and isn’t transparent. A lack of diversity, particularly at senior levels."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "good company ethos", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "2 Feb 2021", "job_title": "Lead Systems Engineer in Newcastle upon Tyne, England", "duration": "N/A", "pros": "company as a whole has a good ethos", "cons": "some departments has poor employee development plan"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work. Brilliant people", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Feb 2021", "job_title": "Marketing Manager in Cambridge, England", "duration": "N/A", "pros": "Great place to work. Brilliant people", "cons": "Can be slow to change with the times"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Generally good", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jan 2021", "job_title": "Administrator in Cambridge, England", "duration": "N/A", "pros": "Office is well equipped. Coworkers are friendly and helpful. Flexible working hours.", "cons": "A bit low paid and small increment each year."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "How mighty has fallen!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Jan 2021", "job_title": "Regional Sales Manager in Cambridge, England", "duration": "N/A", "pros": "Decent work life balance and flexible working hours.", "cons": "Game of Thrones of the favourites and those less fortunate ones to be a member of a preferred clique."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good place to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Feb 2021", "job_title": "Brand Manager in Cambridge, England", "duration": "N/A", "pros": "Great company, good benefits, flexible working.", "cons": "Limited career progression in specific fields."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Like a family; good and bad", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jan 2021", "job_title": "Project Manager in Cambridge, England", "duration": "N/A", "pros": "Successful products, committed people, good benefits", "cons": "Overly political and slow to modernise"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Interesting and supportive, but not appreciative or rewarding", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Dec 2020", "job_title": "Data Analyst in Cambridge, England", "duration": "N/A", "pros": "Interesting work and good support for personal development", "cons": "Hiring structure doesn't allow for progression based on contribution or knowledge, thus there is a lack of staff appreciation or reward."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jan 2021", "job_title": "Reception Services Assistant in Coventry, England", "duration": "N/A", "pros": "Very supportive work culture\r\nSupport progression", "cons": "None at all thoroughly enjoyed working for this organisation"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "a", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jan 2021", "job_title": "Education Advisor in Cambridge, England", "duration": "N/A", "pros": "Wellbeing is a key factor", "cons": "Sometimes the systems are very slow"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jan 2021", "job_title": "Examinations Assistant in Whittlesford, England", "duration": "N/A", "pros": "Great pay and location available", "cons": "Irregular work and long hours."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jan 2021", "job_title": "Credit Controller in Cambridge, England", "duration": "N/A", "pros": "The company is global and diverse", "cons": "There is not much room for promotion"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "High quality international Cambridge education", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Dec 2020", "job_title": "Administration in Tamworth, England", "duration": "N/A", "pros": "International education opens up many more opportunities for students.", "cons": "Not all families can afford to pay for an international education."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Good", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Dec 2020", "job_title": "Production Coordinator in Cambridge, England", "duration": "N/A", "pros": "A great team, and manager.", "cons": "Difficulty to progress internally, fairly static."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Awesome environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Dec 2020", "job_title": "Supply Chain Planner in Cambridge, England", "duration": "N/A", "pros": "Good healthy environment in which one will feel valued", "cons": "Salary not as competitive as in other companies"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "There are worse", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Dec 2020", "job_title": "Director in Cambridge, England", "duration": "N/A", "pros": "The people. Generally good, well meaning, dedicated.", "cons": "The bureaucracy, occasional politics, gender pay gap"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great role", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Dec 2020", "job_title": "Sales Representative in Cambridge, England", "duration": "N/A", "pros": "Great role and good career progression", "cons": "No cons to this role"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Lovely building, culture needs a lot of work", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Feb 2020", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Really nice building and lovely food. Some of my colleagues were really nice and supportive, but they were mostly in business and marketing. I enjoyed meeting stakeholders and the regional teams.", "cons": "Unfortunately the culture was not what I expected - there was quite a lot of negativity from colleagues in my team, a lot of resentment and tension and senior managers did not address this.  Some of this was personal - which I found inappropriate and unprofessional.  I had a pretty miserable year and found it very tough at times, but I would like to think that it was just my team and I was unlucky.  I heard that other areas of the business don't have the same issues.   A lot of people seemed to be on long term sick so I am not sure what that says about it as a place to work. The company does make a lot of noise about well-being and mental health though and is training its managers. Maybe they should address the causes of the stress though, which is often poor management and miscommunication."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": ".", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Nov 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Really nice people work here", "cons": "I can't think of any cons"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Nov 2020", "job_title": "Project Manager/Technical Delivery Lead in Cambridge, England", "duration": "N/A", "pros": "Great vibe \r\nGreat culture \r\nMany talented people", "cons": "None so far I’ve been working here 1.5 years"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Left the job", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Nov 2020", "job_title": "Product Manager in Cambridge, England", "duration": "N/A", "pros": "Work is generally interesting and purposeful", "cons": "Micro-management and disregard of individuals' strengths"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Staff come first (mostly)", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Oct 2020", "job_title": "Assessment Administrator in Cambridge, England", "duration": "N/A", "pros": "good pension, good salary, flexible working scheme", "cons": "like to change teams around, short notice of contract renewals if fixed term"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Mixed experience", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 May 2017", "job_title": "Editorial in Cambridge, England", "duration": "N/A", "pros": "Free gym access,  reasonable pension scheme. The people are lovely and senior editors in particular have a wealth of knowledge about publishing and their own subject matters, which makes them a joy to learn from. Depending on your manager, flexible working patterns are possible and overtime is rarely expected. There is a sense of pride in working for such a historic institution.", "cons": "The pay is low for Cambridge, and the pay rise system is geared against junior roles. Bizarre attitude to investment – several million pounds are being overspent on various internal technology projects which as far as I can tell, have made little improvement to the actual business of selling products. This is frustrating to see when reams of your colleagues are made redundant on a regular basis. There is also very little investment into relatively small expenditures like staff training, and, as others have said, it feels quite stagnant in terms of product or business development. Far too many meetings which don’t amount to any actual outcomes and too many things are done inefficiently ‘because that’s how they’ve always been done’."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent place to work. Good work/life balance.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Nov 2019", "job_title": "Operations Administrator in Cambridge, England", "duration": "N/A", "pros": "Real support system throughout the team. Good line management, with clear expectations set, while still maintaining a friendly and approachable manner. Never felt too stressed, and the work was distributed well between sub team members. The organisation frequently puts on great events, and encourages you to get involved. The new offices are amazing, and promote a great working environment.", "cons": "Workload isn't very balanced, but this is due to the intense summer working period, and quieter winter period. The workload didn't feel very steady, it was all at once or little. But this gave good time to work on other things and get organised. \r\n\r\nI found it a bit strange that I would constantly be emailing the same people each week in teams on the same floor as me, and I would never meet them in person, or know what they looked like. I think the departments should set up a meeting where everyone puts a face to a name, so it's more personable. This encourages better working relationships, and its less of a sterile interaction over email."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "draining the brand", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Sept 2015", "job_title": "Editor in Cambridge, England", "duration": "N/A", "pros": "Long history of sincere mission-led publishing. Lots of colleagues with integrity, brains, and drive, who take pride in good work. Great authors who are creating the ideas of the future. Surviving pockets of excellence. For someone at entry level, or just above entry level, provided you hit a pocket of excellence, it is still one of the best places to learn about high-quality publishing from smart people with a lot of experience.", "cons": "It's not clear how long any pockets of excellence can survive, and even now above entry level I would not recommend CUP to anyone with ambitions to publish high-quality, innovative content. In recent years, honest but somewhat sleepy management has been replaced with chancers out to drain the brand, treating it as bottomless well. IP is being handed over in ill-advised partnerships, and vast sums of money and time have been squandered on dysfunctional systems; to compensate, there are deep, damaging cuts where it most hurts: the development and production of content and marketing."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Chaos and frantic faffing about", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Apr 2016", "job_title": "Editor in Cambridge, England", "duration": "N/A", "pros": "Smart, curious colleagues. Top-notch, engaged authors. Although new management is trying to build a content farm, it's not there yet; so most things you'll work on are of good quality and can make a difference in the world. Underneath the constant spreadsheet wankery is meaningful work. And you can always hope the Syndicate will wake up and make a change. It happened before.", "cons": "Current upper management doesn't have a clue. They think that putting something in an MS Office document makes it \"work\". Elaborate restructuring planned in powerpoint, with no sanity checking against real work requirements, has been a disaster. Heedless repricing and rediscounting cranked through Excel, with no feel for the market, is a disaster. The most rewarded behaviour is the pursuit of meaningless internal targets. I'd wager good money that HR has been given the target of getting the Press to 2.5 stars before the fiscal year ends -- hence the laughable, barely written positive reviews that keep appearing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great place to work, that is working hard to make things even better", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Aug 2017", "job_title": "Web Developer in Cambridge, England", "duration": "N/A", "pros": "My line manager is excellent. She has encouraged my growth and confidence, as well as being flexible when the needs of my (young) family required.\r\n\r\nAlongside this, Cambridge Assessment has a real commitment to developing their staff. Whether that is through learning and development, wellbeing initiatives or of particular importance in my roll, access to relevant equipment and software.\r\n\r\nCollaboration is one of our values - and you see this in action all the time as people work hard together across the different parts of our business.\r\n\r\nI feel secure and supported at Cambridge Assessment.", "cons": "There are times when I think we could do things quicker.\r\n\r\nAs well as having offices in Coventry, and overseas we currently have many offices in central Cambridge which, whilst it has its advantages, is not always ideal. We are, however, due to move to a brand new Cambridge headquarters soon (Q1 2018).\r\n\r\nIt currently takes me about 45 minutes to travel to the office. It would be great to have a shorter commute."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Could be a truly great organisation but has work to do to achieve this", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Oct 2018", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Great colleagues, in particular those with great technical expertise and passion for education who are most closely involved in developing and delivering exams, curricula and teacher support worldwide\r\n\r\nGood products and brands, recognised globally\r\n\r\nSuperb market positions across the world. \r\n\r\nGood building and subsidised canteen", "cons": "Inability to deliver major IT projects - consume vast amount of time, effort and money and result in immense waste and frustration\r\n\r\nOperates as separate businesses who do roughly the same thing but who all try to do it separately\r\n\r\nOverstaffed in some areas with people who lack commercial expertise\r\n\r\nA culture that doesn't encourage people to raise concerns or issues\r\n\r\nNo real sense of being valued by Cambridge University\r\n'\r\nA reluctance to listen to people or recognise expertise  from outside 'education'\r\n\r\nParalytically slow decision making, an organisational structure that hasn't changed for 20 years"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A company that values and looks after their staff", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Feb 2015", "job_title": "Administrator in Cambridge, England", "duration": "N/A", "pros": "Free on-site gym, bar, exercise classes, canteen, day off each to volunteer, quarterly briefings from department heads, bi-annual briefings by CEO, regular newsletter updates with publishing schedule and a lot of filtering down of information to keep everybody informed, staff communities encouraged, active Union, take personal development and training seriously, lots of room for progression", "cons": "Things seem to move a little slow, publishing activities still seem to have huge lead-times, deadlines with freelancers seem easily pushed, it's taken a little while to catch on with digital. Recent push to introduce performance related pay has caused a standstill on pay-rises and progressions (including adjustments for cost of living)- Union and management unable to agree on how to move forward leaves those not involved with little idea of when things will get sorted."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "With a little bit of luck you can have a lovely career here", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Feb 2019", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Responsibility, flexibility, a changing work environment and business challenges keeping a job fresh and interesting.  There are some lovely and excellent people working here who make great colleagues.", "cons": "Frustrating if you end up tackling a group of people who resort to the ease of deferring decisions in favour of having another meeting. Things can take ages. Systems and the way they are managed sometimes hinder instead of helping. There's a satisfaction though of sometimes being able to cut through some of this stuff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "So far so good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Sept 2018", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "*great benefits\r\n*if you are working with a forward thinking manager, flexible working is a plus\r\n*good caliber of employees \r\n*good canteen (great staff prices)\r\n*great projects across the board\r\n*global work experience\r\n*well being center with great fitness classes\r\n*well functioning and resourceful new building\r\n*good location (10min walk from Cambridge main train station)\r\n(the cons listed below are gradually improving- to an extent, with new hire of employees in various different sectors with different mindsets)", "cons": "*some senior managers are not fit for their position but rather have stayed in the position due to seniority, not merit\r\n*some managers lack the courage to voice and propose robust ideas (fear of rocking the boat?)\r\n*a mixture of old school thinking and progressive innovations; resistance for change in some departments\r\n*many colleagues lack basic commercial awareness"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Weak leadership, entitled workforce - beware!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Jun 2019", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Food served is fantastic - great choice, quality and value. Over the top subsidy given it’s a part of publicly funded institution, but enjoy it.", "cons": "The hastily appointed 2nd choice CEO stated his favorite 3 things about the job are the food offering; the business-class travel (which is ridiculously excessive and has no oversight in this place); and then he finally remembered what he was there for: the opportunity to help people prove their skills to the world...  \n\nPitiful lack of business-sense with a bloated finance dept stuck in 1980s. OCR/CIE/Camb English spend entire time fighting each other - the competition must be laughing. \n\nAt one director’s leaving speech the CEO said “all the best senior employees leave after 2 years”!! Surprised he admitted that but he’s right - just weak leadership remain. \n10 out of 12 previous CEO’s reports have left within a year of this CEO starting, replaced with his friends: people who just smile and won’t dare challenge. \n\nSuch a shame: this place deserves better."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Main Asset overlooked", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "9 Jan 2018", "job_title": "Publicity Assistant in Cambridge, England", "duration": "N/A", "pros": "Onsite gym and restaurant (reasonable priced food).\r\nColleagues very helpful and friendly.\r\nReasonable site in City with parking and easy walking distance from train station, close to guided bus route.", "cons": "Lot of empire building by middle management, this results in the the main Asset (the people on the floor) being overlooked especially when certain managers know less about the job than those they manage.\r\nFear that if they continue in the way the business has in later years there will be an exodus of knowledgable and loyal staff."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Average beyond it's name", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Jan 2016", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Flexible working hours, On site facilities (such as Gym, Tennis/Football courts and Bar), Friendly atmosphere and People,", "cons": "Confusing Management Structure, Lack of opportunities to progress, Consultant culture, Email Culture, Below Average pay, Lack of clear direction from Senior Management, Confused product markets, Cutting Corners and Costs over Quality, Regular Outsourcing of Jobs, general lack of motivation for staff."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "White power", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Oct 2016", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Collegiate vibe is nice. \r\n\r\nWork/life balance is reasonable for most. \r\n\r\nSome genuine people with good intentions. \r\n\r\nCoffee is pretty alright.", "cons": "Overwhelmingly white - I cannot think of one single non-white person in the Cambridge branch with any real power. This is shameful. \r\n\r\nNasty blame culture permeates the entire place to the very highest levels. \r\n\r\nBullying also seems to be on the rise. \r\n\r\nToo much change for the organisation to absorb. \r\n\r\nToo many overpaid ineffective contractors and consultants who often make things worse. \r\n\r\nWeak out of touch leadership throughout - especially at the very top. \r\n\r\nHopeless HR department exist only to protect senior management. \r\n\r\nDisastrous SAP programme. How does the CIO still retain his job??"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Such a shame as it has potential", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Dec 2016", "job_title": "Project Manager in Cambridge, England", "duration": "N/A", "pros": "The people on the ground make this place.\r\nThe pension scheme, gym, canteen and coffee areas are also great.\r\nI really have a true circle of friends here who I miss.", "cons": "Senior Management are not engaged with the guys on the ground. They also do not take accountability for anything and almost blame those doing the real work.\r\n\r\nMeetings culture... I think the senior management need to analyse how much they waste on meetings after meetings.\r\n\r\nPeople on the ground are often disrespected and not listened to. I remember a meeting I had with the CIO where I had to raise my hand to talk."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Going through a difficult period", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "28 Jun 2016", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "The Press has a very well educated, friendly, committed staff and a mission that is worthy. It produces content to be proud of. I had many happy years working there.", "cons": "The Press is going through a difficult time which is to be expected given the demands that the digital revolution has put on the publishing industry as a whole. Additionally, a lot of the systems in place have needed updating which has put a lot of strain on budgets and staff. There have been a number of painful restructures and redundancies.\r\nIn recent years there has been a culture of micromanagement from the top down; most decisions are questioned by directors, making it impossible for teams to thrive and deliver. \r\nIn general, staff members feel underappreciated."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Proud of how we have pulled together", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Aug 2020", "job_title": "Senior Consultant in Cambridge, England", "duration": "N/A", "pros": "With the implementation of a new Values structure, the movement from the annual performance review to the agile 'Continuous Conversations' format, it feels like we are moving in the right direction.\r\n\r\nOur global organisation has been put to the test in these recent Covid times and the speed at which those who could perform their roles at home were deployed and supported was amazing. Our well being has been genuinely high on the agenda and communications have been human, supportive and timely.\r\n\r\nWe've also been able to embed the home working policy for all, and flexibility is now the norm. At no time have we felt pressured to return - it is a gradual and safe return, for those who feel comfortable doing so.", "cons": "Nothing worth noting in the scheme of things. We've really shown what we are made of."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great sense of history, with a sense of change for the future", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Jan 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "- The people are great, with a real mix of skills and expertise\r\n- The work is interesting and varied\r\n- Working at an internationally-renowned global brand helps career development\r\n- People who work here are generally really well looked after compared to other organisations\r\n- Good work/life balance\r\n- Supportive and approachable senior management team\r\n- Great sense of change at the moment, also in the publishing industry more generally (which brings with it both pros and cons)\r\n- Global reach\r\n- Well respected within the publishing industry\r\n- Digital transition\r\n- Responsible business who cares about doing the right thing, not just hitting targets", "cons": "- Decision-making can be slow at times, with not very clear processes in place\r\n- The level of change going on (also in the publishing industry more generally) can make it a challenging atmosphere at times"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "The culture is not for everyone", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Feb 2019", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "The site is large and pleasant. The free gym and subsidised canteen are clear benefits. The flexible hours come in very handy.", "cons": "If you don't have left-wing (perhaps even far-left) views, you could be in trouble if you ever get found out. You will be socially ostracised and blanked by people who walk past you. The culture, in reality, is very narrow. If there's tolerance, it's a one-way street. College campus-style activism is common and encouraged. \r\n\r\nDue to the fact most people at the very top are men, there is a drive to only promote and employ women at lower levels. That means men at the start of their careers will be overlooked because people who share their gender are already high up, meaning they can't be. In my department, a male hasn't been employed in years."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "No long term prospects", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Oct 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "subsidised canteen \r\ngym/running club on site \r\nFlexible working in some departments\r\nVarious lunch time events (organised by staff)\r\nLooks good on your cv.", "cons": "Amount of training offered differs amongst departments, always told there is no budget for external courses. \r\nLack of career progression throughout the company.\r\nNumber of services are now offshored which has on occasion resulted in job losses and reduction of quality.\r\nHR department are unhelpful and not approachable.\r\nImplementation of the SAP financial system has caused a huge disruption to th business. Despite the overspend, it takes twice as long to process anything and it's not fully installed yet. Absolute nightmare.\r\nLimited car parking spaces."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A values led organisation  really focused on the well being of its employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Aug 2020", "job_title": "Senior Manager/Head of Department in Cambridge, England", "duration": "N/A", "pros": "As a fairly recent joiner during the COVID pandemic, I have been really impressed by how the organisation supports its employees. Cambridge Assessment already had a strong focus on flexible working, but during the pandemic this has really shined through along with lots of additional support for employees to ensure their well being during this difficult time. \r\n\r\nIn addition, the organisation has recently launched a living our values framework which is being embedded across the organisation. While I've had little opportunity to experience them yet, the building and general facilities are also great, with fantastic catering, well being centre and great spaces to work and collaborate in.\r\n\r\nThe organisation also has a clear strategic vision and communicates this well to its employees so we all know how we are contributing.", "cons": "So far, i've been really impressed and have no downside to share"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Cambridge Press - be cautious", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Jul 2020", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "- initially welcoming\r\n- I'm lead to believe its a good name on a CV\r\n- there are some very nice people and departments, Education had some particularly nice individuals who made working at CUP bearable", "cons": "- this organisation has many angry people, some openly swear\r\n- there are many staff incapable of doing their job; because they 'get on' with management they are given a lot of slack\r\n- my manager was divisive, controlling and a bully (she bullied a number of people in the her team)\r\n- HR never supports employees below management level, they support tyrant managers by my experience and that of several employees I later found out\r\n- there is a level of racial discrimination - several of the caucasian treated Indian people from the SAP implementation partner were treated terribly (though they did do some sill things, but that no excuse to demean them or anyone)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A Plodder", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Oct 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "The gym, on-site restaurant, the support/services teams, the on-site parking, and definitely the people - the people are genuinely fantastic. You'll miss all of these if you leave.\r\n\r\nI was lucky to have a lot of input into my career development.", "cons": "- The HiPPO culture: fear of mid-managers to make their own decisions because senior managers can be outspoken and bullish, or just don't allow them to make them.\r\n- Legacy systems - innovation has been thwarted at times by having to incorporate old foundational technology that's not sexy enough to get budget to update/replace.. resulting in vast swathes of work-arounds and old tech exceptions."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This place will kill you!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Dec 2018", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "The staff is incredibly dedicated.  But everyone is overworked, underpaid, and most are working there because they believe in working for a non for profit - for the good of humanity, unfortunately, the senior management and the CEO do not hold the same values.", "cons": "Senior management is utterly useless - short-sighted, risk-averse, out-dated, unauthentic, wedded to old buzzwords and working models, unaware of the real world, and incredibly sexist. Even the Press board is siloed and are all working for different outcomes. It is a mess, and the staff and middle management are suffering. \r\nMost people are suffering from stress - my doctor told me that he sees 2 to 3 people a week from the Press for stress!!! It is shocking."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great for plodders - frustrating for high-achievers...", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jun 2010", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Final Salary Pension with flexible working arrangements commonplace.  Friendly people.  A culture of \"lifers\" with a very low staff churn rate.  Very stable and unbeatable job security.", "cons": "Not challenging.  Politics, politics, politics.  They want plodders who do what they are told - high-achievers will get frustrated.  Medium sized company with large company style red-tape.  The non-profit status allows some really large errors in judgment from senior management to occur without those responsible being held accountable.  Very poor remuneration within the IT sector of the organisation which is limited by company wide paybands"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Surrounded by great people who've turned a corner following lots of change in order to prep the biz for the future.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Dec 2016", "job_title": "Editor in Cambridge, England", "duration": "N/A", "pros": "Collaborative working environment; an Academic MD who genuinely cares about people as she moves the business forward; lovely work colleagues who care passionately about what they do; great content which makes you feel proud to work there; a can-do attitude.", "cons": "On-going changes in Editorial although necessary make author management harder; some senior managers need to understand that they're in a position to make positive changes (they need to learn to be brave!) Poor systems."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Avoid if you are passionate about Software Development", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jul 2010", "job_title": "Senior .NET Developer in Cambridge, England", "duration": "N/A", "pros": "The pension is fantastic and the fact that the office is open for only 12 hours a day means that you are unlikely to be doing too much work. The only real pressure is the pressure you put on yourself.", "cons": "It is my belief that the company does not actually like, or trust, the development department. The developers have been sidelined about how the development process should be changed resulting in an incredibly bureaucratic process that is going to stall development whereas agile development (in my opinion) would deliver significantly better results for them."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Appalling,  silo mentality,  hugely political.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Jul 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "There are management who try to stitch things together,  but the press as a whole makes this near impossible.  Flexible working hours.", "cons": "Meetings culture,  senior managers who really have no idea,  senior directors who should be taken out to the barn.  Criminally negligent,  appalling execution - systems that fail to connect,  impossible to drive business,  customer services stuck in the 1970s."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Good, but could be so much better!", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Nov 2017", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "- Rewarding work - your job benefits learners, teachers and schools around the world. \n- Friendly atmosphere. Everyone is so nice!\n- Great learning and development opportunities. They invest a lot in staff training and development which is great. \n- Flexible working - and they’re getting better.\n- Very open to job shadowing, mentor schemes and support networks.\n- Fantastic canteens and cafes - a wide range of food and drink options (inc. vegan and paleo).\n- New HQ being built and will open in early 2018, meaning all Cambridge-based employees will be under one roof. Exciting times!", "cons": "- Very bureaucratic, takes ages to make decisions and get things done.\n- Very slow on the uptake in terms of the use of technology to automate processes and support customers. There are still a lot of manual ways of doing things which can be very frustrating. \n- A good place if you want to ‘coast’ in your job and get by doing very little in your role. There are a lot of people who have been there for 10+ years. Long service seems to be rewarded more than hard work in many of these cases. \n- Very traditional and risk-averse. The outcome of the industry we are in I guess. \n- High-achieving staff are not rewarded or compensated for their efforts, so go elsewhere. There needs to be a better way to engage staff that perform above and beyond in their role. \n- Broken performance review model. It has changed a lot over the last few years. The current format does not lend itself to anyone wanting to exceed their job responsibilities. \n- Salaries seem to be dipping and getting lower by the year. Not sustainable when the cost of living in Cambridge is going up each year."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Some extremely unprofessional people at management level", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Aug 2016", "job_title": "Project Coordinator in Cambridge, England", "duration": "N/A", "pros": "The office is well located, the working conditions are comfortable. \nMost colleagues are pleasant and talented.", "cons": "There are some extremely unprofessional/unethical people at management level. This was flagged to HR (by several colleagues over several months) who has shown absolutely no will whatsoever to tackle the issue."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Don't judge an [academic] book by its positive-sounding cover", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Sept 2020", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Flexible working around some core hours, supportive of work/life balance if you have the right manager. Have invested a lot in the office environment. Good social facilities. Fairly relaxed working environment when things are going well. Some opportunities to move around different parts of the organisation. Pay increases each year. A sense of cameraderie in adversity.", "cons": "- Probably the most (negatively) political organisation I've worked for, though they deny this and pretend everyone is supportive and collaborative across the different functions of the Press. This makes everything slow down to a crawl and destroys trust.\r\n\r\n- Whilst there's lots of good, friendly, skilled, constructive people around the place at 'worker'/team level who want to get things done, most of the (many, many) Directors are generally out of their depth and wouldn't last 5 minutes in equivalent positions in commercial organisations. All they know how to do is continually cut costs, generally in the areas that's easiest for them regardless of the consequences. It's at middle-management level where the problem really lies though: it's so \"fat\" in the middle with ridiculous reporting lines and management waste, damaging cliques, and way too many passengers who seem to have a job for life regardless of what they do (or don't do).\r\n\r\n- The way to progress in your career at the Press is to be a 'Yes (wo)man' and not rock the boat or try to change \"how things are done round here\". If you do, be prepared for a viscious backlash as people protect their little fiefdoms and conspire to put you back in your place. Think your manager/Director will support you? Will they hell!\r\n\r\n- A few bad apples ruin things for the good people there, and the good people leave. HR are not interested until their feet are held to the fire but continue to brush these behaviours, including multiple complaints of ongoing bullying, under the carpet. Multiple people have been made seriously ill through this and the lack of support in addressing it. Senior management are equally cowardly and would rather avoid conflict than support their people, which perpetuates the problem but is ok by them as long as they're not making each others' lives difficult.\r\n\r\nSo by all means, join the Press if you're looking to coast through to retirement as a narcissistic middle-manager who enjoys sucking up to your fellow managers and blaming everyone else below you for your own and the organisations failings."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great organisation to work for and getting better.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2018", "job_title": "Business Development Manager in Cambridge, Gloucestershire, South West England, England", "duration": "N/A", "pros": "-The people who work here really make Cambridge Assessment great\r\n-I've progressed through a number of roles at Cambridge Assessment after starting on the graduate scheme\r\n-Flexible working has been an option for me\r\n-Provide a high-quality service and are industry leaders", "cons": "-Slightly conservative and slow moving / traditional ( but we are an exam board)\r\n-Very hierarchical (never been an issue for me but has for others)\r\n-No parity across the organisation in terms of flexible working - so depends on your line manager\r\n-Tendency to reward longevity rather than ability to perform within a role"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Get experience and go!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 May 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Great colleagues\r\nFree Twinings tea bags\r\nNice facilities staff to include catering BaxterStorey", "cons": "Internal email tennis\r\nConfusing processes\r\nPoor budget for reward/social \r\nBullying culture from management\r\nConfusing objectives\r\nPoor technology available\r\nPromotion by favouritism\r\nOvertime is not paid but overtime is expected/relied on"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Pays well, but work is monotonous and senior management are slow moving.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Mar 2015", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "Good salary and not really any pressure to work beyond your allocated hours. I don't take work home with me. Training is available but I find I have to push quite hard for it. Your job is likely to be very safe if you are employed here.", "cons": "Management is slow moving. You can work on a project only for it to be delayed by months at a time. Don't notice any positive feedback from senior colleagues."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Dysfunctional", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Sept 2015", "job_title": "Editor in Cambridge, England", "duration": "N/A", "pros": "Great location; some dedicated, bright, kind people; pride in working for a venerable and well respected institution with strong name recognition", "cons": "Awful, creaking systems waste lots of staff time; shocking waste of resources on badly managed IT projects; mid to low level staff under-valued and demotivated; too many managers and people over-promoted via Peter Principle; very haphazard and inconsistent management; terrible cheap office environment symbolises disinterest in staff welfare."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great, committed people at working level. Poor leadership and very bureaucratic", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Aug 2016", "job_title": "Project Manager in Cambridge, England", "duration": "N/A", "pros": "The people that work at Cambridge assessment are very friendly and committed\nGood values in principle. Collaboration, innovation, openness, responsibility\nWhat Cambridge assessment does is of great value\nCentral location", "cons": "The values often seem to be just words and not practiced, particularly by senior managers\nA large degree of micro-management and lack of empowerment below assistant director level\nPoor leadership \nMany of the most productive people end up leaving\nMany of the least productive people end up staying"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent Employer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Apr 2016", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Excellent Benefits. Having worked in finance and property - found it to be a refreshing culture  change. Good people to work with, empowering manager , plenty of university collaboration and even some fun.", "cons": "Only as good as you make it. There is some inertia so you have to push and therefore work a bit harder - but frankly  - that is to be expected in 500 year old publishing institution."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great team, great culture, interesting future ahead!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Feb 2019", "job_title": "Digital Communications Manager in Cambridge, England", "duration": "N/A", "pros": "Great new office facilities with subsidised catering\r\nFlexible working opportunities\r\nLots of social and charitable activities\r\nClear paths for progression, support for learning and development\r\nGood salary with clarity on banding", "cons": "Some areas of the business/teams are slower to catch up with offering things like flexible working\r\nIf you don't live in Cambridge or very nearby, the commute can be a challenge!\r\nThere is a lot of change which can be unsettling\r\nRecruitment process both for this role and for another I interviewed for subsequently was somewhat haphazard, with poor communication and last minute interview invitations or rejections which caused quite a bit of disruption to accommodate."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "In dire need of reflection", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Apr 2016", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "It promises so much and could deliver a great deal to its employees. There is potential to so much more. Lovely grounds and historic offices.", "cons": "CUP's HR department give advice to new recruits about the reviews on Glassdoor which speaks volumes about their attitude to the staff who are posting here desperate for someone to listen because management are not. Please stop doing this, it is known in the firm and it's utterly irresponsible, as is posting your own reviews to keep up the ratings."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Customer Services", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 May 2017", "job_title": "Customer Service Representative in Cambridge, England", "duration": "N/A", "pros": "Flexible working hours only the good thing.", "cons": "Management is really bad. None of them really want to carry this place to one upper level.  Most of them such a long year in this company and they have no clue about the competition out there.  Whenever you like to do something good for the company they say don't bother, be stick to the facts.  But the facts are sucks! \r\nPeople comes and goes no one happy here, everybody looking for a different job."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Not recommended", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Dec 2017", "job_title": "Customer Service Representative in Cambridge, England", "duration": "N/A", "pros": "Good work-life balance, good canteen, good outside premises, good environment with good people wanting to make the difference.", "cons": "Management is poor. From the Top down to spreading all over. I can only speak of Customer Services department that I found a bit of a mess. Lots of unknowledgeably people taking advantage of the ones who work hard in order to hide behind them doing nothing and getting paid at the end of the month. All needed to get by with this attitude would be become friends with the manager. Some managers are not up to the place as they can not serve as an example seeing their posture at work and the way they clearly treat colleagues. Some  being treated different from another. Decisions are made by whoever does not have a clue on what is deciding about. Not a Billion dollar company but always found a way to trow big money in hands of the vultures aka contractors that someday were full-time employees but learned the way and returned as contractors. This because wages poor and badly distributed. Bad management I blame it on. There is a lot of talent leaving the company in a constant basis but clearly judging by the feedback received from the ones still there \"they\" still don't learn the lesson. I do not recommend this company if you want to do serious work and make the difference and be paid accordingly."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Change is coming...thank goodness", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Sept 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "It seems change is coming but it is long overdue and may be coming too late?\r\n\r\n1 Hills Road is a convenient location, the subsidized canteen is a plus, the people who work there are (for the most part) dedicated and at times even friendly.", "cons": "Too many old dinosaurs in the business and hierarchy reigns supreme. Needs a thorough shake up!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great place to work, lots of benefits, IT opertunities limited", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Apr 2017", "job_title": "Tech Support Analyst in Cambridge, England", "duration": "N/A", "pros": "Great management, very laid back and don't have anyone breathing down your back. Very friendly atmosphere, lots of benefits such as on site gym, lots of social groups. Options of using Lynda to work on skills, and encourage personnel development and lots of opportunities to move internally. Flexi time is great if your a morning person or not.", "cons": "If you are looking into moving on into IT the press will not have many options , sadly the Press outsource there 1st line and 2nd line to Manilla and only 3rd line is based in the UK, so moving internally is not possible at entry level. I have had to look outside the press, its a shame as id liked to have stayed in the company. \r\n\r\nIn regards to my role, our team were understaffed for the majority of time I was there, and despite it was obvious we needed more staff nothing was really ever sorted,  documentation could not be updated and it was not possible to cross train each other due to high volume of tickets which resulted in one person dealing with one area but not able to deal with another and vice versa with a different member of staff, this resulted in certain tickets having to be assigned to a particular individual as they were the only person who knew how to deal with the  type of ticket, it also was an issue when someone was on holiday/sick it meant that some tickets would be put on hold until that person is back or they try and fix the issue despite not having the knowledge to fix the issue.  \r\n\r\nWhen we ask as to when we will get new staff we just get \"the management above are still \"rightsizing\" (basically deciding if they want to spend money on staff or not by analyzing every single bit of data they can find) Its quite clear to us we need staff, so im not sure what more they need to be convinced or why they are taking so long over making a decision, its quite poor that they have taken a good 8 months (still on going) and still nothing has been decided, I am now leaving which means the team will be even more understaffed. I hope that this is sorted for my team as soon as possible."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Nice Place to work If you get an offer , but the Interview process is very unfair", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Feb 2016", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "Nice environment\r\nNice benifts\r\nGood Staff's\r\ncantees in every branch and you have access to all the cantees in every branch.\r\nwell paid overtime.", "cons": "One of the worst interview process I have ever been.\r\nCEO never talks to Temporary, Contracted people or new staff.\r\nCEO always monitor for staff using Internet in work time.\r\nHR is not a professional Recruiter."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Great company to work for!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jun 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Good people to work & collaborate with\r\n\r\nThey are adapting to changes in the market and becoming more and more digital and innovative\r\n\r\nThey have an amazing history and legacy\r\n\r\nFree onsite gym, onsite bar, very green site with lots of trees- also very close to Cambridge Station and a Costas.", "cons": "After many years of the same practices being used, the change into more digital and modern practices is a hard change that the Press is slowly achieving. However there are teething problems.\r\n\r\nThe Press is a charity thus salaries are lower than normal but the amount of experience you get is very valuable."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Secure job", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Feb 2017", "job_title": "Coordinator in Cambridge, England", "duration": "N/A", "pros": "Job security, the company will invest into your training and development, parental leave package, good holiday allowance - 26 days+bank holidays plus some other staff benefits. Internal opportunities to move and and progress between different business areas and departments", "cons": "It is not the most exciting company to work for. Lack of leaders that would inspire you, that you wold want to look up to. Generally lethargicatmosphere in the offices. Some areas of the business are absolutely lacking opportunities for progression, especially if you are in finance/business services/facilities"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid completely if you can. Never accept any job offer at grade C or D.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jul 2017", "job_title": "Test Production Administrator in Cambridge, England", "duration": "N/A", "pros": "It is a job, you can say you are employed... \nFlexible working hours? \nPeople usually get fooled by its Association with the University of Cambridge", "cons": "Low ethics, poor management, very bureaucratic, a lot of old elephants, no career progression opportunities, nepotism and favouritism in promotion, unprofessional HR department with no power, work to death!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Place to work and a very good team!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Jul 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "I have been working for Press 1 year and 9 months on a Full Time basis. \r\n\r\nGood benefits available, flexible to your needs and weekly hours are very good. The environment is very friendly and everyone is very welcoming from the moment you walk through the doors. Colleagues are simply friendly and socialising comes at ease.  \r\n\r\nThe Salary expectation was good.", "cons": "From my experience, I don’t think there is a downfall of working for CUP."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Huge potential which is starting to be realised", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jan 2015", "job_title": "Marketing Manager in Cambridge, England", "duration": "N/A", "pros": "- A solid foundation, with lots of history and expertise\r\n- A new executive team and heads of business groups who appear to be keen to revolutionise the business \r\n- Nice people, lots of fresh ideas and a real passion for the business\r\n- Good work/life balance\r\n- Nice office and facilities - free gym etc", "cons": "- Sometimes decision-making is slow\r\n- The business needs to be bolder, make the difficult decision"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Outstanding place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Feb 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Cambridge Assessment has an award winning development team who run great learning programmes for staff.  The Aspiring managers programme for staff who want to become managers is amazing.  The staff benefits are good.  If you want to work for a progressive company who will invest in your development then join Cambridge Assessment.", "cons": "Like most organisations it can be frustrating at times and it can take time to get things done."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a good place to work anymore!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jul 2015", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "- Nice people\r\n- Good reputation", "cons": "- Experienced people are not valued\r\n- Pay raise is very bad, with the new system in place makes it even more worse \"your Manager is your God!\" outlook\r\n- If you have been here long, people take you for granted and wouldn't think about your professional growth.\r\n- Career progression is at snail pace!\r\n- Nobody knows what's going on in terms of process \r\n- having new people come in at higher position has made things worse even more, they don't understand what people in team have done or do and have no clue of the bigger picture!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great people to work with but can be slow-moving", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 May 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "- Great people, friendly colleagues and good work/life balance \r\n- Good benefits", "cons": "- Narrow-minded / out-dated thinking\r\n- Very wedded to structure and bureaucracy when it comes to progression, pay and promotion\r\n- HR feel very separate from the business as a whole so issues, complaints and well-known problem areas often get smoothed over"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Potential to be a great company to work for, ruined by awful management", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 May 2020", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Free coffee, nice people, pleasant office grounds", "cons": "Not enough actual work to go around leaving employees bored and demotivated, management consistently ignores ideas for improvement, constant micro-management and patronising attitude, limited opportunities for progression, forbidden from talking to other employees about *work related activities* (not even personal things) or collaborate with them about ideas, management contradicts themselves and leads with fear.\r\n\r\nI've also heard disturbing accounts of racism and homophobia and general ignorance from management."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Typesetter/Printer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "8 Apr 2016", "job_title": "Typesetter in Cambridge, England", "duration": "N/A", "pros": "A good company to work for, they looked after the Staff very well. The work was interesting, the Pension Scheme, excellent. A job no one wants to leave, unless they have too.. Like us we were made redundant, but wouldn't have left the company otherwise.", "cons": "It was hard work, but rewarding. They used to be a very good Company to work for"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Full of people who care and want to make a difference", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jun 2016", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Interesting stimulating work contributing to education worldwide. \nAmbitious plans that are exciting to be a part of. \nCambridge is a great city \nHigh quality heavily-subsidised food with great choice everyday: sounds a little thing but really makes each day pleasant", "cons": "There's so much to do that it can be frustrating getting fixed resource to achieve, but the will is there!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Gentle pace, very political no room to grow", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Jun 2016", "job_title": "Programmer Lead in Cambridge, England", "duration": "N/A", "pros": "Subsidised canteen \nCentral location \nNo push to work long hours \nChoice of pushing self \nDevelopment opportunities depending on dept", "cons": "Politics\nNo risk culture \nHard work not rewarded\nA few work shy personnel \nLack of performance management \nFew travel opportunities, only for select \nVery hierarchical \nWork ethics different from dept to dept"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Not a cultural fit for me.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Sept 2017", "job_title": "Project Manager in Cambridge, Gloucestershire, South West England, England", "duration": "N/A", "pros": "There is a lot of potential for the organization to do good, to be an industry leader and many fine people working there.", "cons": "Failures to hold people accountable, push to be better and to reconcile aspirations with the reality of working there today."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Fantastic place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Mar 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Really supportive, intelligent and committed colleagues. I was working on a small team so there was a lot of opportunity to have an impact. Opportunities to develop into areas above and beyond the job description.", "cons": "Mishandled incidents with redundancies and restructures last year left staff feeling afraid for their jobs."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Tough times at Cambridge", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Jul 2016", "job_title": "Marketing Associate in Cambridge, England", "duration": "N/A", "pros": "UK office has fantastic paid leave and a great benefits package but other offices struggle to maintain the same benefits packages.", "cons": "Management are extremely UK and internally focused with limited autonomy for international branches.  Technologically and strategically behind most publishers."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Its Cambridge's own version of BBC1's W1A", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Oct 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Working for an organisation that can trace its history back for 500 years is an amazing thing.\r\n\r\nThere are some immensely talented, imaginative and clever people working there - none in management roles unfortunately.\r\n\r\nThe site had a compus-like feel, that made the working environment pleasing. This will soon change however once building work starts on the new home for Cambridge Assessment.", "cons": "In my five+ years working there the organisation started on a road that I (and it seems many others) fear will see CUP collapse. Where once it stood for academic excellence and well-produced academic publishing, it now stands for dysfunctional management, appalling staff relations and a complete lack of  attention to its product. At the end of the day, the 'brand' survives on trust and respect of its customers, and how can the customers be expected to invest in that when the staff cannot?\r\n\r\nImaginative, clever and innovative staff have little to no means of progression. The organisation is laughably top-heavy, with so many levels of management that no decisions are ever taken in the interests of the long-term future of the company, but only ever in the short-term interests of the managers. Think the wonderful TV Series W1A and you have working at CUP in a nut shell!\r\n\r\nThere is no appreciation of staff. There is no respect of staff. There is no consideration of staff. It amazes me that management do not see that an under-appreciated, de-motivated, dissatisfied workforce that is coming in to work every single day fearful that there will be yet another round of 're-structures' and management desk-shuffling announced, is not likely to be willing or capable of producing good results. The best asset any company has is its staff, and CUP fail spectacularly to appreciate this. \r\n\r\nIt is an organisation where top management have no interest whatsoever in the long-term future of their staff. That means that talented and knowledgeable people, who CUP have 'trained' simply walk out of the door to other companies. That is an enormous waste, and is bleeding the company dry.\r\n\r\nThe lack of compassion and sensitivity shown is staggering. When the almost weekly 'restructures' are announced and people are yet again concerned for their jobs there is no sensitivity shown or understanding - it always communicated as 'in the best interests of the business'. Of course, it is always notable that what is 'best for the business' is for those on the lowest rungs of the ladder to lose their jobs whilst middle managers (and those higher up, where the biggest mistakes are made of course)  amazingly retain theirs. \r\n\r\nIf you wish to work in an environment where you are valued, look elsewhere. If you wish to work in an environment where your imagination and initiative will be rewarded, look elsewhere. If you want to work in an environment where you can be the best you can be, look elsewhere. (f you want to be miserable, over-worked, disrespected, ignored  and treated like an encumbrance to the life of your manager, then roll on up to The University Printing House, as the management   there would love to see you."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Shocking Incompetance on a Grand Scale", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Jun 2015", "job_title": "Project Team Member in Cambridge, England", "duration": "N/A", "pros": "The grounds man does a good job of looking after the cricket pitch.\r\nThe CIO's new office is plush.", "cons": "The amount of money wasted by the sheer incompetence of the SAP programme is breath-taking. The Charity Commission should consider the organisations status in light of the wasted expenditure."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Celebrating Mediocrity", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Jun 2018", "job_title": "Middle Management in Cambridge, England", "duration": "N/A", "pros": "An easy place to coast towards retirement with minimal effort.\r\nMuch improved investment in attracting and developing staff.", "cons": "Falls short of incentivising high performance. Claims to have a performance related pay scheme but in reality there is a 0.8% difference between a top and bottom rating. A number of longer serving colleagues appear to have become wise to this and do the absolute minimum required to get by. \r\nCertificates and paper weights are an appreciated and thoughtful touch for high achievers, but it's patronising not to back this up when claiming to offer performance related pay."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Enjoyable place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Aug 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "All the people really care about the work that we do. They also care about colleagues most of the teams including the one I work in are really helpful and considerate to each other.", "cons": "At certain times of the year the workload can really increase making a bit more stressful than normal. Having to travel to different buildings for meetings wastes a lot of time walking or in taxi's."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Used to be a great place to work - Lost its way", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "15 Nov 2014", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Friendly people\nNice site, easy parking\nReasonable benefits\nLong history and academic culture\nFlexible working\nConvenient location near the railway station", "cons": "Too many projects - many with low business benefit and poor prioritisation of projects.\nToo many senior managers. \nIT strategy is often confused, sometimes conflicted and poorly communicated.\nLarge open plan office has little privacy.\nLots of offshoring and outsourcing going on."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Interesting and challenging.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Feb 2015", "job_title": "Marketing Assistant in Cambridge, England", "duration": "N/A", "pros": "There is a variety of tasks for me to complete on a day to day basis. Everyone is very friendly and welcoming. Great flexi-time.", "cons": "No names on desks or desk numbers so very hard to find people/ your way around at the beginning!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Overall, a great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Jul 2019", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Very welcoming to non-UK citizens.\r\nFantastic colleagues. \r\nPositive atmosphere. \r\nInteresting and engaging work. \r\nBeautiful area to live.", "cons": "Salary not commensurate with Cambridge living expenses.\r\nWork hours mostly stable but would often lead to some unpaid overtime. (In comparison to other publishing work however, the work life balance was good.)\r\nOutsourcing to other countries felt like it was automating too much work and sometimes exploitative."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Chaos", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Apr 2016", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Nice offices, good canteen, good transport links. Great colleagues, who are always willing to do their best in a difficult situation.", "cons": "Where do you start. When I began working at CUP the job actually wasn't too bad. I had good training, but some of the workflows and systems could have been better, even staff who had worked there for years seemed a bit confused as to what they were supposed to be doing. But overall the workload was about right for a full-time job.\r\n\r\nWithin a few months the department was subjected to a restructure, which seems to have been very poorly planned and implemented by management, and has caused utter chaos. Many people found their job roles changed and were offered very little training to cope with their new responsibilities. Workloads that staff were expected to deal with rose to totally unmanageable levels, many book projects ground to a virtual halt. Staff have been left feeling very stressed and unsupported, and not surprisingly they have started to leave on a weekly basis, many of whom who had worked at the Press for years and had a wealth of experience (just the people you would want to be keeping). These are then replaced with younger and less experienced staff, brought in on short term contracts, who require training, and so it goes on with an endless cycle of new staff and training - nobody in their right mind would tolerate the current job roles for very long. Management have been very slow to respond, nobody seems to be willing to take control of the situation, little is being done to address what has rapidly become a crisis."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good company but not without its faults", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Sept 2020", "job_title": "Applications Analyst in Cambridge, England", "duration": "N/A", "pros": "Prestigous company, some good colleagues, benefits were good / interesting job", "cons": "Limited progression stunted by oversight from management at all levels / average pay / blame culture to some degree / pretending to be a modern staff wellbeing orientated company but are not."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "no training and terrible old fashioned hierarchy management structure", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jan 2020", "job_title": "Operations Administrator in Cambridge, England", "duration": "N/A", "pros": "benefits including 28 days hols and paid overtime at weekends - double pay sundays.", "cons": "bad management decisions, no support, senior management would not even speak to you, overworked with no work life balance (even though they promote this)\r\ni was offered no performance objectives and no career progression. \r\nweird culture - nobody talks to people everyone just skypes...."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Safe bet but won't set the world on fire", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Oct 2015", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Life is made very comfortable, but that's also a downside!\r\nMany people have had very long careers and progressed and I jumped off the ladder as it wasn't right for me. sensd that thr rigid grading system stands in the way if spotting, nurturing and retaining talent", "cons": "Very traditional & slow to change\r\nWrapped in cotton wool, not exposed to any risk or pressure but not challenging in any way.. Lots of money to through about with no desire to push for excellence\r\nVery structured / boring work environment, not very flexible \r\nBut a good safe bet if you're looking to coast"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Heavy stressful workload", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Aug 2020", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Great colleagues, approachable management. Good canteen and social centre. Very gentle atmosphere.", "cons": "Open plan noisy office space far from any natural light. The office culture involves a lot of unpaid overtime to meet very high expectations with schedules and deadlines. Many colleagues were having issues with stress which is why I left. There is huge pressure and responsibility in this job which is not reflected in renumeration."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Evidence of truly valuing good employees and working to retain them", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Aug 2017", "job_title": "Communications Manager in Cambridge, England", "duration": "N/A", "pros": "- Annual salary increases and bonuses\r\n- Robust and supportive performance review system\r\n- Great Cambridge location, with shiny new offices on the way!", "cons": "- Hit and miss senior managers\r\n- Pay grade culture"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Education and Assessment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Nov 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Good benefits, good social, academically interesting, scope for movement and secondment. Good food and lots of good CPD that cover everything you need to know about assessment. Thorough induction process.", "cons": "Group wide fear of change and of technology. \"We have always done it that way \" is used as an excuse to loiter in the past."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Experience varies greatly depending on department", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Feb 2017", "job_title": "Production Assistant in Cambridge, England", "duration": "N/A", "pros": "::reasonable salary\r\n::linked to the University of Cambridge\r\n::good cause", "cons": "::little incentive to stay\r\n::high turnover\r\n::experience varies greatly depending on department\r\n::CIE production department has low morale, few incentives\r\n::HR not informed by management of disruptive or problematic employees\r\n::managers prefer not to rock the boat rather than support bullied staff\r\n::little adherence to copyright law\r\n::workloads increase without a similar increase in staff"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Too many bosses and internal politics", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Jul 2015", "job_title": "Marketing in Cambridge, England", "duration": "N/A", "pros": "Gym and sports facilities\r\n28 days holiday\r\nBar and social club on site", "cons": "Too many bosses not enough staff\r\nSAP and GFFP project waste of money\r\nOutsourcing of staff\r\nSenior management travel expenses\r\nPeople being promoted to roles they are not qualified  for above other better people\r\nAdmin staff kept down \r\nFinance system is a mess\r\nLong working hours\r\nExecutive corridor - waste of money \r\nLast pay rise was 0.5 paid 6 months late"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Used to be great but poorly managed", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "25 May 2020", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Great people \r\nFlexible working \r\nSubsidised canteen", "cons": "Lack of career progression \r\nUnsustainable workloads\r\nConstantly changing procedures with a lack of structure\r\nPoor management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great employer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jun 2016", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Great team of talented and friendly people. Fantastic benefits and a good work/life balance. There is a lot of support in terms of training and opportunities to showcase your skills through new projects.", "cons": "There is a growing need to innovate more and change the traditional print-oriented mentality."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good overall, though can be quite traditional", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Aug 2017", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Large organisation in Cambridge, so lots of opportunities within the organisation to move / develop. Supportive employer with good benefits and nice colleagues.", "cons": "Can be quite risk averse due to core nature of the business (exams) and education lags behind other areas in terms of uptake of new technologies. This can be frustrating when trying to push forward new initiatives."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Mar 2018", "job_title": "Subject Specialist in Cambridge, England", "duration": "N/A", "pros": "Really interesting and dynamic work developing new qualifications and providing support for teachers. Amazing ambiance, great people to work with such an array of professionals.", "cons": "No real cons other than the difficult to getting to know others from different business streams due to the location of buildings. This will be solved by a move to the new building soon."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Stable place to work but no progression", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Oct 2016", "job_title": "Administrator in Cambridge, England", "duration": "N/A", "pros": "Safe, stable place to work with good communication from managers, annual reviews with performance related pay increases.", "cons": "Little to no opportunities for progression or development. Development activities and training feel tokenistic."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great environment, facilities and good people", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Sept 2011", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Relaxed work environment\r\nGood facilities\r\nCheap childcare fees because of association with the University\r\nVaried work assignments\r\nNever stands still\r\nGood anual social events", "cons": "Weak management and leadership\r\nPolitics always seems to get in the way of doing what's right\r\nValue academic background higher than commercial experience"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Friendly, studious environment for hard-working people who want to create high quality products", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 Nov 2019", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "A wealth of experience is available for those who want to learn about publishing", "cons": "Limited career development in certain areas, poor levels of IT support."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "balanced", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Oct 2017", "job_title": "Product Manager in Cambridge, England", "duration": "N/A", "pros": "Immediate colleagues and line managers very good. Acts ethically.", "cons": "Very few opportunities for development if in certain roles. Dead end career for the vast majority. Inefficient legacy processes leads to underemployment of many staff. Poor inter-departmental working. Extremely poor at communicating with customers, leading to widespread misunderstand and lack of transparency."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Wasn't what I think it would be", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Dec 2018", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Subsidised food. \r\nLot of documentation to do your work.", "cons": "Too much process orientated\r\nOrganisation too rigid\r\nNo place to grow\r\nNo parking\r\nI felt back at school while working there. You need to justify every movement and follow to the letter the procedure to your work. There is no place for innovation."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Good place to work, very slow to change", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Mar 2019", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Part of University of Cambridge, nice colleagues, interesting work depending on the project\r\nNice site with gym, tennis courts and small woods to walk aroud", "cons": "Growing pressure on employees, work satisfaction very depending on the team, not much space to grow, no recognition of achivements"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "could do better", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Oct 2015", "job_title": "Editor in Cambridge, England", "duration": "N/A", "pros": "flexible working hours, lots of training opportunities, good canteen", "cons": "hierarchical; meeting culture; Performance Related Pay; if you are a manager and earn above a certain figure, you still qualify for a bonus even if targets have not been met; colleagues continuously in competition with one another"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Big changes in publishing and also at CUP", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jun 2013", "job_title": "European Sales Executive in Cambridge, England", "duration": "N/A", "pros": "- digital product launch, \r\n- restructure of the company and it's 3 divisions (Academic, Journals, ELT) - exciting \r\n- 2500 publications every year", "cons": "- high level Academic product - limited number of buyers\r\n- lower salary than profit organisations which translates also to lower level of bonuses"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Lack of opportunities, detached management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Feb 2019", "job_title": "Distribution Supervisor in Papworth Everard, England", "duration": "N/A", "pros": "student discount card\r\npension is good", "cons": "not much else in terms of benefits\r\nsalary not great starting off"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Positive experience", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Nov 2015", "job_title": "Senior Assessment Administrator in Cambridge, England", "duration": "N/A", "pros": "Really good culture, very relaxed but productive", "cons": "Not enough clear career progression for me. People seem to be happy collecting a paycheck and working  9 -5, no clear senior management progression"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Oh dear!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Oct 2017", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "Good people at the working level. Subsidised canteen.  The strategy always sounds good.  Secure job to an extent. Reasonable working conditions", "cons": "Directors always fighting amongst each other. No clear leadership, in fact no leadership at all.  The people that produce results will almost certainly get lumped with all the work whilst others plod along and do very little."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Subject Specialist", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Dec 2016", "job_title": "Subject Specialist OCR in Cambridge, England", "duration": "N/A", "pros": "Working alongside colleagues who excel within educational field....inspirational place to work. Management allow lots of autonomy and ample opportunities to develop professionally and personally.", "cons": "Sometimes difficult to marry educational aspirational goals of company with profit making business model."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Exciting times", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jun 2017", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Friendly team\r\nCollaborative approach\r\nTrust and ownership\r\nGreat location and next year the Triangle!\r\nGreat work life balance and benefits", "cons": "None so far that I can consider worthy of mentioning."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Extreme innovation", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Mar 2018", "job_title": "Assistant Manager in Cambridge, England", "duration": "N/A", "pros": "Diversity\r\nOpportunity for development\r\nCompetitive Salary\r\nFocus on wellbeing\r\nfantastic HR team", "cons": "Big projects under-resourced and overfunded, wrong projects at the wrong times for the wrong reasons, some of the time."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Good Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Nov 2018", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Flexibility, Good Work Environment, Timely Paid", "cons": "Limited Growth in terms of Work and Money"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "This job consumed my life", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 May 2017", "job_title": "Sales Representative in Cambridge, England", "duration": "N/A", "pros": "Good money and good networking.", "cons": "Don't work here if you don't have experience, if you want to come home every day, if you have children, and if you want to have free time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A sad end to a great institution", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jun 2015", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "The people. Some of the best editorial staff around. Great support staff. I miss them and wish them well as the decline continues.", "cons": "Lousy Senior management who had never run a commercial business have driven a great company into the ground."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Nice place with nice people", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Nov 2015", "job_title": "Product Manager in Cambridge, England", "duration": "N/A", "pros": "people, willingness to share knowledge, flexi time, location, in site sports facilities and bar, one day voluntary work per year, holidays over Christmas", "cons": "underpaid, not a clear strategic direction, currently people feel that change is affecting everyone and overloading them with extra work"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Too many changes at one time.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Mar 2016", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Great people, great print material quality.", "cons": "Too many new systems at once.  Epic fail on all counts- CS move to Manila, new SAP integration-ordering, sampling, billing, stock systems all not functioning well.  Upper management very slow to respond, will take years to fix the mess.  Sales suffering badly as a result."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Operations", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Jan 2017", "job_title": "Operations in Cambridge, England", "duration": "N/A", "pros": "Friendly staff, decent benefits, flexible working hours.", "cons": "Lots of micromanagement, higher management is often not qualified for business roles. A strong lack of leadership and empathy."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Sales Support", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Feb 2019", "job_title": "Sales Support Academic in Cambridge, England", "duration": "N/A", "pros": "Friendly environment, lots of opportunity to progress and grow, supportive team, access to a gym, student card and a few other perks.\r\n\r\nExcellent work-life balance, flexi-time available.", "cons": "There aren't many, sometimes unnecessary beaurocracy is frustrating. Also the occasional overlap between departments sometimes causes confusion."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A bit dull", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Aug 2015", "job_title": "Anonymous Employee in Saffron Walden, England", "duration": "N/A", "pros": "Good benefits and good location. Training is very good.", "cons": "Has a soulless feel. Unnecessary red tape and protocols make for frustrating work."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Operations Manager", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Sept 2015", "job_title": " in Cambridge, England", "duration": "N/A", "pros": "Good work life balance, while colleagues are by and large friendly.", "cons": "Poor office environment, with a lack of atmosphere and low morale. \r\nSignificant micromanagement"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Interesting organisation at a time of flux...", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Oct 2018", "job_title": "Anonymous in Cambridge, England", "duration": "N/A", "pros": "Very interesting work\r\nVariety and a new surprise every day", "cons": "Too busy \r\nTechnology projects are a disaster\r\nNew CEO in the post, but the jury is still out..."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good company overall", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Apr 2019", "job_title": "Finance in Cambridge, England", "duration": "N/A", "pros": "Open plan modern office, discounted canteens, good pension, some flexibility", "cons": "Some managers are not motivated or enthusiastic to inspire their teams, work can be done very slowly as not clear who should take resposibility, outdated systems"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent employers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Jul 2017", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Great training, development opportunities, benefits and a great place to work", "cons": "Salary could be better, especially for living in Cambridge which is just as expensive as London"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "IT Technician", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Sept 2018", "job_title": "IT Technician in Cambridge, England", "duration": "N/A", "pros": "Friendly team, good manager, allowed to work independently. Good work life balance and fair pay packet.", "cons": "There is little career progression, most of the members of the team had been in the same role for a matter of years."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Work-life balance", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Mar 2019", "job_title": "Project Manager in Cambridge, England", "duration": "N/A", "pros": "If you are looking for a good work-life balance CUP is for you. Easy-going colleagues and slow paced projects make the working environment very pleasant.", "cons": "Not much professional development and a risk that skills stagnate if staying too long."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Good Company, no progression opportunity", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jul 2014", "job_title": "IT Engineer in Cambridge, England", "duration": "N/A", "pros": "Friendly, Close to Station/City, Good working hours, Historic company but works well in 21st Century", "cons": "No progression unless someone dies! Toooo many management layers they just keep adding more! low pay"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great company!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Sept 2013", "job_title": "Project Manager in Cambridge, England", "duration": "N/A", "pros": "Nice perks - gym, subsidised canteen\r\nBetter than average working hours and flexible working gives good work-life balance.\r\nOffices are nice, and close to the station.", "cons": "Progression is inconsistently administered across the company.\r\nDifferent departments work independently."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Unethical", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "8 Sept 2016", "job_title": "Manager in Cambridge, England", "duration": "N/A", "pros": "Reasonable working hours, some good people", "cons": "Double standards, failure to live up to their culture and values"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2020", "job_title": "Team Leader in Cambridge, England", "duration": "N/A", "pros": "Friendly place, great building, good business ethics, leader in its sector, work-life balance, flexible working, pilates and other wellness classes on site", "cons": "Lower salaries but great subsidised canteen for breakfast and lunch"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "S'alright I suppose", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "27 Nov 2015", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "On site gym, flexible working hours, mostly lovely people", "cons": "Total chaos with IT systems, lack of resources seriously inhibiting progress in all areas"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great organisation who really support their colleagues!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Feb 2019", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "* Supportive colleagues\r\n* Great work-life balance\r\n* Fantastic career development and progression opportunities", "cons": "* Can take a while for decisions to be made"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent Company Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Oct 2020", "job_title": "Compliance Officer in Cambridge, England", "duration": "N/A", "pros": "Business who cares about its employees. \r\nGood drives and initiatives to improve workplace happiness. \r\nFlexible working. \r\nGood management.", "cons": "Not too much room salary wise to advance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Architect", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 May 2017", "job_title": "Solution Architect in Cambridge, England", "duration": "N/A", "pros": "New architecture practice, excellent chief architect with strong style of leadership", "cons": "Slow pace of change, projects can take years to get off the ground"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A positive company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Aug 2017", "job_title": "Commissioning Editor in Cambridge, England", "duration": "N/A", "pros": "A friendly place to work with clear goals and expectations", "cons": "You have to accept that you're a small cog in a very large wheel"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good Company, Well Paid, Very Repetitive Work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Sept 2020", "job_title": "Marker in Cambridge, England", "duration": "N/A", "pros": "Well paid and fairly simple repetitive tasks", "cons": "no natural light or windows in a room you work in for 7hrs/day (you do get breaks though!)"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Been working here for nearly 2 years", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Aug 2019", "job_title": "Content Assistant in Cambridge, England", "duration": "N/A", "pros": "- Flexible working scheme\r\n- People\r\n- On-site bar and gym", "cons": "-Proprieties management over anyone else\r\n- Too many managers\r\n- Too focused on quantity rather than quality"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Varied and interesting place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Aug 2020", "job_title": "Principal Manager in Cambridge, England", "duration": "N/A", "pros": "Caring employer, wide range of jobs, great working environment, nice people", "cons": "Limited opportunities at higher levels, quite traditional behaviours and structure"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Mar 2020", "job_title": "Product Manager in Cambridge, England", "duration": "N/A", "pros": "Great place to work, great building, facilities and people", "cons": "A political quagmire with too many middle managers jostling for power"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "stressful at times but mostly very pleasant environment", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "14 May 2012", "job_title": "Examiner Helpdesk in Cambridge, Gloucestershire, South West England, England", "duration": "N/A", "pros": "good salary for the position,\r\ngreat work environment and location\r\nfriendly co-workers", "cons": "Lots of temps\r\nCost-cutting measures in place"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Stable but old fashioned", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Nov 2019", "job_title": "Head of Education Services in Cambridge, England", "duration": "N/A", "pros": "Stability, some learning opportunities but salaries 10-20% below average", "cons": "Old fashioned management, double standards, low salaries"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Cambridge Assessment", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Sept 2015", "job_title": "Project Management in Cambridge, England", "duration": "N/A", "pros": "Comfortable environment, final salary pension scheme, in Cambridge,", "cons": "Main building is quite old (like an old school), salaries not great, run like a public sector company"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Sept 2019", "job_title": "Assistant Account C in Cam, England", "duration": "N/A", "pros": "Restaurants, gym, bar, clean offices", "cons": "Parking, hard workers do not get the correct recognition"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It is a goof organisation to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jul 2020", "job_title": "School Administrator in Cambridge, England", "duration": "N/A", "pros": "difficult to develop in some jobs", "cons": "A big con is working for the university"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Busy but fun", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Dec 2019", "job_title": "Marketing Communications Coordinator in Cambridge, England", "duration": "N/A", "pros": "Great team, big company and senior management and HR are fairly open.", "cons": "Not many cons, can’t think of any right now."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Mar 2020", "job_title": "Operations Management in Cambridge, England", "duration": "N/A", "pros": "Amazing facilities, great perks and outstanding working ethos", "cons": "Could do with slightly stronger leadership. Lacks interaction with employees, compared to previous employeers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Sept 2020", "job_title": "Subject Specialist in Cambridge, England", "duration": "N/A", "pros": "Great benefits flexible and excellent facilities", "cons": "Difficult to progress once reached a certain level"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Operations Manager", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 Aug 2015", "job_title": "Operations Manager in Cambridge, England", "duration": "N/A", "pros": "A very good team around me.", "cons": "Elitist and hierarchical.  Conflicting priorities between business functions."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good experience", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Apr 2019", "job_title": "Content Manager in Cambridge, England", "duration": "N/A", "pros": "Colleagues are great and teams are super supportive. Flexi hours are really helpful too!", "cons": "Limited routes for progression in production/editorial specifically."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good not great", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Dec 2019", "job_title": "Examinations Officer in Cam, England", "duration": "N/A", "pros": "Name recognition \r\nBenefits \r\nCulture \r\nLocation \r\nGreat for entry level admin role", "cons": "Old fashioned \r\nDull \r\nRepetitive"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Technical Support Analyst", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Feb 2016", "job_title": "Technical Support Analyst in Cambridge, England", "duration": "N/A", "pros": "Good professional environment, flexible work schedule, good career prospects,", "cons": "Poor acclimatization building site, low salaries for some departments."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Working for CA", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Aug 2019", "job_title": "Administrative in Cambridge, England", "duration": "N/A", "pros": "Good to work for generally", "cons": "Can be too formal sometimes"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Oct 2020", "job_title": "Administrator in Cambridge, England", "duration": "N/A", "pros": "- Nice Offices\r\n- Collaborative Work environment\r\n- Good facilities - Large Canteen", "cons": "- Offers little room for flexible working"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good working environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Nov 2019", "job_title": "Customer Service in Cambridge, England", "duration": "N/A", "pros": "Good pay and work life balance", "cons": "Not much opportunity to move up"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good employer", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Aug 2020", "job_title": "Operations in Cambridge, England", "duration": "N/A", "pros": "Increased focus on wellbeing in recent years. Great office space and facilities.", "cons": "Inconsistency across different teams and management"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Very good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Aug 2020", "job_title": "Senior Education Advisor in Cambridge, England", "duration": "N/A", "pros": "Good benefits, stability, pension, facilities", "cons": "some lack of flexibility, a lot of bureaucracy"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Part time Admin", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jul 2016", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "Good salary, good work, good environment", "cons": "Upper Management, work life balance, not much"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Not for everyone", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Oct 2019", "job_title": "Project Manager in Cambridge, England", "duration": "N/A", "pros": "Highly experienced colleagues,  popular products, new offices", "cons": "Organisational complexity,  aging systems, risk aversion"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Poor pay and people are treated as disposable", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Jun 2020", "job_title": "Business in Cambridge, England", "duration": "N/A", "pros": "Charity organisation with a causing of spreading knowledge around the world. Great name with incredible history.", "cons": "Poor pay\r\nPeople are only valued on HR slogans \r\nLack of clear vision\r\nDigital strategy is all talk, but no walk"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "1 May 2020", "job_title": "Exam Marker in Cambridge, England", "duration": "N/A", "pros": "Pay is very good and workers understanding", "cons": "There aren't any cons to working here."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Old boys club", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 Sept 2018", "job_title": "Education Department in Cambridge, England", "duration": "N/A", "pros": "Office in Cambridge and OK gym", "cons": "Very dated management with little opportunities for women"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bureaucratic", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Mar 2020", "job_title": "Operations Team Leader in Cambridge, England", "duration": "N/A", "pros": "Career Progression Opportunities, Job Security", "cons": "Needs a cultural change where it values people"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Feb 2016", "job_title": "Publishing Assistant in Cambridge, England", "duration": "N/A", "pros": "Lovely facilities, pleasant office to work in. Supportive people.", "cons": "Lots of systems and duplication of work."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Customer Service Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Apr 2018", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Good benefits and work place", "cons": "shifting schedule and  needs more manpower"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Feb 2018", "job_title": "Exec in Cambridge, England", "duration": "N/A", "pros": "Good work/life balance, great training", "cons": "Lack of progression, and insular teams"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Nice Place", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jul 2020", "job_title": "SAP Test Manager in Cambridge, England", "duration": "N/A", "pros": "Nice place to work, very friendly", "cons": "Not much chance for progression"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Admin", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 May 2017", "job_title": "Administrative Assistant in Cambridge, England", "duration": "N/A", "pros": "It's a job, it pays a bit", "cons": "The managers view the admin staff as pure scum. The turnover for admin staff is a matter of months. Managers sit there for years and years, never managing"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst experience ever!!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Mar 2013", "job_title": "Systems Manager in Cambridge, England", "duration": "N/A", "pros": "Some good people around who are staying for good work life balance", "cons": "Highly political, very difficult to get something done.middle management highly incompetent about new technologies"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Selling mediocre books to rich kids since 1534", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Sept 2019", "job_title": "Anonymous Employee in Cambridge, England", "duration": "N/A", "pros": "Free tea and coffee", "cons": "Complete ineffective HR and stomach wrenching virtue signalling."}]]