[[{"date": "22 Feb 2023", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stevenson University", "Interview Descriptions": "It was a phone interview followed by committee interview on site. I was asked to prepare a project for review during my on site interview. In addition to the committee, I also met with the department I would be working with and the one-on-one with my supervisor.", "Interview Questions": "In what ways have you contributed to the success of your unit in your current job?"}, {"date": "31 Mar 2023", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Stevenson University (Baltimore, MD) in Oct 2022", "Interview Descriptions": "Grueling and cumbersome process; can be conducted in daylong format. Concerns regarding institutional desire for ethnically diverse representation among staff/faculty, as a predominately white (staff/faculty & student populations) institution, particularly in leadership roles.", "Interview Questions": "Standard questions regarding the role and leadership behaviors, but they were repetitive and excessive."}, {"date": "10 May 2022", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stevenson University", "Interview Descriptions": "The application was completed online. The hiring manager confirmed receipt of application via email within ~3 business days. The interview was conducted via phone. Offer sent via email, less than one week from interview.", "Interview Questions": "Can you tell me about a time that you challenged yourself?"}, {"date": "14 Apr 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Stevenson University in Apr 2022", "Interview Descriptions": "I have interview yet. But I heard that the interview process is pretty easy and straightforward. I’m looking forward to my interview this week and I hope it will go well. And I hope I will get accepted too.", "Interview Questions": "Why are interested in this job?"}, {"date": "20 Dec 2021", "title": "Resident Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stevenson University", "Interview Descriptions": "Great! It was fairly easy, and the interviewers were very nice and intentional about their questions and responses. Be prepared to share your experience with students and how you would use your talents and skills to help", "Interview Questions": "Describe a time where? \nHow do you plan on executing your ideas with your co-RA\n"}, {"date": "20 Sept 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Stevenson University", "Interview Descriptions": "The interview can be very long and tedious but it is very beneficial that you beat prepare for this interview so you have a great chance to be a good candidate", "Interview Questions": "What your goals for the future "}, {"date": "21 Apr 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stevenson University", "Interview Descriptions": "great detailed questions, on time, great scheduled , they asked about your exp and interested in higher education. Multiple panel interviews, with team and supervisor. Got to know the office very well, followed up by the end the week", "Interview Questions": "what is your experience in higher ed? working with students "}, {"date": "13 May 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stevenson University (Owings Mills, MD) in Mar 2021", "Interview Descriptions": "The interview process at SU was truly an easy process (for someone with Admissions Experience). The first interview (conducted via Zoom) asked approximately 20 questions by the members of the panel (Hiring Manager and two Admissions Counselors). The Second Interview (via Zoom) was taken in three parts; 1st - Search Committee Interview (Hiring Manager and various admissions representatives), 2nd - Presentation Skills Assessment, and 3rd - Individual Interview with the Vice President of Enrollment. Two weeks later, I received an offer.", "Interview Questions": "How confident are you using recruitment CRM systems? Please explain your proficiency."}, {"date": "1 Feb 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stevenson University", "Interview Descriptions": "Not that difficult, the standard questions you are faced with and only one round interview before I was picked. There were two people interviewing me and they were easy to get along with and very professional.", "Interview Questions": "What is the most difficult thing you had to deal with in a work environment"}, {"date": "17 Jan 2017", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Stevenson University in Dec 2016", "Interview Descriptions": "They seemed unprepared for the interview as the questions asked didn't pertain to the position at all. This is also because the interviewer had only had their position for less than 30 days. I have a feeling that they had already had someone internally that they'd like to go with but interviewed external candidates as a formality. They also had several positions open in the same department, so this was a red flag for me.", "Interview Questions": "I was nothing about my programming background but how do I decompress after a work day, how do I respond in crisis situations, etc. I was interviewing for Student Activities. Also, the point person who scheduled interview repeatedly pronounced my name wrong even after having been corrected at least 3x."}], [{"date": "24 Jun 2019", "title": "Assistant Director, Public Relations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Stevenson University (Owings Mills, MD) in Nov 2016", "Interview Descriptions": "Interview with direct manager, press release writing exercise, interview with two other team members. Interviews were easy. Interviewers talked about themselves the majority of the time which should have been a red flag to me to not accept the job as I wasn't challenged in this position nor did I learn anything.", "Interview Questions": "Tell us why you're leaving your current job"}, {"date": "9 Oct 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stevenson University (Baltimore, MD)", "Interview Descriptions": "If they are interested in you, a phone interview with be conducted first. A group interview or two will follow. The final interview for full-time employment will be with university president.", "Interview Questions": "Behavioral questions. Be prepared to tell stories."}, {"date": "13 Sept 2014", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stevenson University in Sept 2012", "Interview Descriptions": "It began with answering an ad. After chatting via email  several times, I was called in to interview with the Hiring Committee and the VP. All parties involved were kind, inquisitive, interested and welcoming.", "Interview Questions": "There wasn't anything difficult or unexpected."}, {"date": "17 Jun 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stevenson University (Stevenson, MD) in Nov 2011", "Interview Descriptions": "I asked 2 professors for recommendations and submitted my transcript online. A few days later, I got an e-mail to schedule an interview. There wasn't much of an interview; the hiring manager only asked if I had worked before and my answer was no. She told me about the position and then gave me paperwork to fill out after I accepted the job on the spot.", "Interview Questions": "What was your last job?"}, {"date": "15 Aug 2010", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stevenson University (Owings Mills, MD) in Sept 2008", "Interview Descriptions": "Met with department director and HR. Questions were basic and not highly technical. Entire process was smooth. Great place to intern if you can't find something off campus. Great commute!", "Interview Questions": "What are you looking for in an internship?"}]]