[[{"date": "2 May 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross (Geneva)", "Interview Descriptions": "The process includes an application round, a technical screening test and interview. They rescheduled the interview once due to schedule changes of the interviewers. The interview went smoothly like a conversation with the head of unit and coordinator.", "Interview Questions": "What do you find easily annoying at the workplace?"}, {"date": "13 Apr 2023", "title": "ICT coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Committee of the Red Cross (Geneva) in Mar 2023", "Interview Descriptions": "The interview was shared by 3 members, Talent Manager, Recruiter and Chief ICT . Duration about 45 min Questions Why do you want to join ICRC? What type of technologies you are familiar with?", "Interview Questions": "Why do you want to join ICRC?"}, {"date": "28 Feb 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Committee of the Red Cross", "Interview Descriptions": "They took awhile to provide any feedback or interest in my application. Once they did the interview processes moved very quickly, and though I did not receive the offer the team provided feedback on my application.", "Interview Questions": "Describe yourself and why you are interested in the mission of the ICRC. Describe your project management experience"}, {"date": "29 Sept 2022", "title": "Transformation Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross (Geneva) in Sept 2022", "Interview Descriptions": "Highly detailed job description, recruitment process seemed professional at first. During the interview I was asked random questions unrelated to the job (eg which city do I prefer living in). No further questions were asked about the specifics of the role / my direct experience on what was advertised. When asked for interview feedback, I was told the interview panel didn’t have enough time to narrow down and ask specific questions. Seriously?", "Interview Questions": "Which city is your favorite city?\r\nIf your manager is away, how would you tackle situation X?\r\nIf you don’t have information on Y, how would you proceed?"}, {"date": "24 Aug 2022", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Committee of the Red Cross", "Interview Descriptions": "Very nice process. The recruiters were very professional. I had to call to get feedback when I did not hear from them after six weeks, but overall a good process.", "Interview Questions": "Why do you want to work for the ICRC?"}, {"date": "14 Jul 2022", "title": "Delegate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at International Committee of the Red Cross (Geneva)", "Interview Descriptions": "the process included several language tests, one preliminary interview online, a full day in Geneva with group exercises and traditional panel interview. the whole assessment can take up to a couple of months. in case of positive outcome, it might take around the same amount of time to find a suitable match for a first mission in the field.", "Interview Questions": "Humanitarian motivation is extensively examined "}, {"date": "12 Feb 2023", "title": "Traineeship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross (Geneva) in Jul 2022", "Interview Descriptions": "The process typically involves an initial screening, a skills assessment, and multiple rounds of interviews with various ICRC team members. The interviewers may evaluate the candidate's qualifications, fit with the organization's mission and values, and ability to perform the duties of the role. The ICRC is known for its selective hiring process, and candidates who progress through each stage demonstrate a strong match for the role and the organization.", "Interview Questions": "what's your experience and how would you use it in your new role"}, {"date": "27 Apr 2022", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at International Committee of the Red Cross (Geneva) in Feb 2022", "Interview Descriptions": "There were two rounds of interviews: the first one was with the team and HR and lasted about an hour  and the second one with the director of the group  and its duration was half an hour..", "Interview Questions": "-Describe yourself\n- Questions relevant to the prior experience\n- Questions relevant to the position\n- Greatest achievement\n- One failure and lessons learned"}, {"date": "27 Feb 2023", "title": "Traineeship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross (Geneva) in Feb 2022", "Interview Descriptions": "After 5 days from the deadline of the application I received an email saying I got into the next phase which was a written exam. However the instructions of the exam were not clear at all.", "Interview Questions": "Online assessment with specific questions about the role"}, {"date": "8 Dec 2021", "title": "Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at International Committee of the Red Cross", "Interview Descriptions": "recruteur flexible et disponible durant toute la durée du process, \nl'équipe HR reste entièrement disponible \n\necruteur flexible et disponible durant toute la durée du process, \nl'équipe HR reste entièrement disponible", "Interview Questions": "quel a était votre plus gros challenge ?"}], [{"date": "30 Nov 2021", "title": "délégué terrain Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Committee of the Red Cross", "Interview Descriptions": "Malheureusement le processus de recrutement a été externalisé et ce sont des recruteurs externes \"juniors\" avec aucune expérience terrain et qui procèdent à l'entretien et ne posent pas des questions pertinentes au métier", "Interview Questions": "vos motivations pour partir à l'étranger?"}, {"date": "28 Nov 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at International Committee of the Red Cross", "Interview Descriptions": "It was a 1h interview with 2 people from the HR team with various questions about my background and my interest and what I wanted to see, learn etc.. Knowledge of the organisation is required", "Interview Questions": "Which area are you interested in the most and why?"}, {"date": "24 Jun 2021", "title": "Traineeship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Committee of the Red Cross", "Interview Descriptions": "Answer about 2 weeks after the application, interview in the following week. The interview went well, with nice and decontracted people. Not many questions about the ICRC, but more on the candidate's personality.", "Interview Questions": "Cite 3 qualities and 3 defaults of yours"}, {"date": "26 Mar 2021", "title": "Traineeship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Committee of the Red Cross", "Interview Descriptions": "Detailed about the organization, own strengths and weaknesses. It was with only one person via skype call.\nI would recommend seriously researching the organization and the role one is applying for, they will even ask about some of their publications.", "Interview Questions": "Why do you want to work here?\nWhat do you know about this organization?"}, {"date": "31 May 2021", "title": "Adminitrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at International Committee of the Red Cross (Geneva) in Apr 2021", "Interview Descriptions": "First there is an online test that lasted for 2-3 hours, after that there are 3 rounds of online interviews with different people from icrc, mainly from Geneve. Standard questions that everybody ask mainly", "Interview Questions": "describe the conflict you had with your manager"}, {"date": "9 Jul 2021", "title": "HR Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Committee of the Red Cross (Geneva) in Apr 2021", "Interview Descriptions": "Whole process took almost 2 months. First a screening call, then a video interview (quite difficult 8 questions), then a 45min call with 3 team members. Was called and given feedback on why I wasn't selected. In overall, very professional and pleasant process.", "Interview Questions": "Tell me about the situation when you had to take an initiative/faced tight deadline/you had a staggering question but your superiors were not around/etc."}, {"date": "21 Apr 2021", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Committee of the Red Cross (Geneva) in Feb 2021", "Interview Descriptions": "Ongoing conversation, from personal to professional. Be ready to discuss a lot of examples. Panel of minimum 4 people. Ongoing conversation, from personal to professional. Be ready to discuss a lot of examples. Panel of minimum 4 people.", "Interview Questions": "Strengths and weaknesses, why do you want this position, describe previous projects that you worked on, what would make you excel at your job, what is the best social media channel in 2021"}, {"date": "24 Jul 2022", "title": "Data Analysis Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross (Geneva) in Feb 2021", "Interview Descriptions": "Test before interview with two interviewers. The interviewers were kind and competent, and the interview  went smoothly. Unfortunately I wasn't the best match for this position as my technical skills were not what they were looking for.", "Interview Questions": "What relevant experience do you have in data analysis?"}, {"date": "27 Apr 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Committee of the Red Cross (Geneva) in Jun 2020", "Interview Descriptions": "Hiring process happened in three steps: a test on competencies and two video interviews. The process took roughly two months.\r\nQuestions are quite standard:  tell us about yourself, why are you a good fit for the position, why do you want to work for the ICRC ...", "Interview Questions": "Describe your strengths and weaknesses"}, {"date": "20 Dec 2021", "title": "Head of People Analytics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross in Feb 2020", "Interview Descriptions": "Excellente expérience d'entretien. Le processus total a duré un mois, depuis la candidature jusqu'à la décision. Les différents entretiens se complétaient les uns les autres et ils m'ont permis de me faire une bonne idée du poste.", "Interview Questions": "J'ai eu un cas pratique; une analyse à résoudre."}], [{"date": "4 Feb 2020", "title": "Head of Architecture Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at International Committee of the Red Cross (Geneva) in Jan 2020", "Interview Descriptions": "I had to do an exam test, prepare 2 x 15 mins presentations (Technical and Project Management) and 2 panel interviews. Having been through this long process (after ICRC obtained all this information) the ICRC  simply cancelled the process at the end  without hiring anyone and without any explanation.\r\n\r\nQuestions were not complicated - if I was cynical I would say that they used the process to obtain technical ideas/information from 4 experienced candidates before they cancelled the process. Very unethical.", "Interview Questions": "Questions were all easy"}, {"date": "15 Apr 2022", "title": "Communications Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Committee of the Red Cross (Geneva) in Apr 2019", "Interview Descriptions": "It was with two penalists and a CBT interview related to my previous similar experiences in Communications area. Overall it was a pleasant interview. I was contacted a week afterwards for the job offer.", "Interview Questions": "How did you manage to fix your mistake in the past?"}, {"date": "17 Jun 2023", "title": "Delegate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at International Committee of the Red Cross (Geneva) in Apr 2019", "Interview Descriptions": "At the time it was first a written test, then a personal interview and finally an \"assesment day\" which consisted in a group interview with other candidates: role plays, negotiation skills, patience, team building, social skills...", "Interview Questions": "How would I adapt to living in a war-torn country"}, {"date": "9 Dec 2018", "title": "Délégué Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at International Committee of the Red Cross (Geneva)", "Interview Descriptions": "Applied online in september, got an answer 3 months later, got my interviews in may, and a yes in september. I only got a first contract of 4 months, while being on a permanent contract with my former job, it was a choice to make. Then i endured looots of changes (pool managers changed 4x in a year) at the HR service during that period... showing that the situation was bad at the ICRC HR.", "Interview Questions": "strenght and weaknesses"}, {"date": "10 Dec 2017", "title": "Field Human Resources Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at International Committee of the Red Cross (Geneva)", "Interview Descriptions": "Online application followed by language tests, an online assessment, a HR interview, a technical interview and then finally an assessment day in Geneva.  Whole process was long winded but fairly straightforward. More of a verification of skills as appose to challenging interview questions - including hr questions to see how you would perform in the field in a potentially dangerous situation.", "Interview Questions": "How would you go about dealing with a reduction in Labor - addressing rumours and avoiding a walk out."}, {"date": "16 Feb 2018", "title": "Traineeship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Committee of the Red Cross (Geneva) in Oct 2017", "Interview Descriptions": "Online application (mid September 2017)\r\nEmail Contact for a Skype Interview with the Head of the Unit, Recruitment and Pool Manager (late October)\r\nRegardless of whether or not I got the offer, recruiters were nice and overall it was a nice conversation.\r\nHowever, one would expect a more correct and straightforward treatment from the recruitment of one of the leading humanitarian organizations.\r\n\r\nHead of the department explicitly mentioned I would hear back from them by the end of the week which dragged into over a month to provide an answer (no without even explaining why they regret not continuing with the application nor apologising for the late response) and did not care enough to respond (even with a no), to touch base or reply follow up emails.\r\n\r\nI understand how recruiters may be bombarded with many applications but once you have contacted candidates for the next stage of interviews, they owe a respectful and proper consideration to candidates' time and effort.", "Interview Questions": "Present yourself in a few words\r\nWhat do you know about the ICRC?\r\nWhat do you know about the particular Division's activities?\r\nWhat irritates you about a colleague? \r\nSeveral HR questions about weaknesses, strengths, personality and competencies relevant to the position"}, {"date": "2 Sept 2017", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at International Committee of the Red Cross (Geneva) in Aug 2017", "Interview Descriptions": "It was a bi-lingual interview with questions asked in English and German. Most questions were standard interview questions about motivation for the job, personal qualities and weaknesses etc.. Moreover there was a one hour written task.", "Interview Questions": "Describe a positive and a negative experience you had with teamwork and how you handeled it "}, {"date": "1 Oct 2015", "title": "Communication Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross (Geneva)", "Interview Descriptions": "Malgré la structure importante du ICRC, le processus fût assez simple. L'ICRC n'abuse pas des logiciels de tri automatiques, mais ce sont des humains qui reçoivent et évaluent la candidature. J'ai envoyé les documents habituels (motivation, cv, certificats) et après 2 semaines les RH m'ont appelé pour me proposer plusieurs dates pour mon entretien d'embauche. Une fois la date fixée, le tout m'a été confirmé par mail, avec soin et beaucoup de précisions, allant des noms et fonctions des personnes que j'allais rencontrer jusqu'aux informations d'accès en voiture ou transports publics.\r\nLe jour J je me suis présenté à l'accueil et fût rapidement prise en charge par les RH. Mon entretien a été conduit par 3 personnes, toutes en lien direct avec le poste et les responsabilités inhérentes (. Entretien plutôt classique sur 60 minutes, suivi par un test écrit de 60 minutes également. Les timings étaient respectés parfaitement et l'ambiance était agréable, cordiale, respectueuse. Mes interlocuteurs ont su me donner envie de travailler au ICRC.", "Interview Questions": "Questions très précises sur le poste et ses fonctions. Les responsabilités, les challenges, comment approcher les obstacles, comment réagir au stress etc."}, {"date": "10 Oct 2016", "title": "Leadership Development Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at International Committee of the Red Cross (Geneva) in Sept 2015", "Interview Descriptions": "It was a group interview including several of the matrixed leaders the position reports to and some peers. The questions asked went from basic to quite specific and technical and were pretty much all content-related and thought-provoking. The L&D team members and leaders are very knowledgeable and professional. The interview lasted about an hour, and although I wasn’t offered the job, it was a great conversation. I left with even greater admiration of the work that they do.", "Interview Questions": "What words would the people you worked with at your last job describe you?"}, {"date": "22 Mar 2016", "title": "Chef De Projet Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 months. I interviewed at International Committee of the Red Cross (Satigny) in Oct 2014", "Interview Descriptions": "Un entretien avec le sponsor et une de ses assistants. Cordial et souhaitant connaitre mon évolution vers ce domaine humanitaire alors que je viens du monde informatique bancaire. Explication donnée pour mes raisons qui principalement viennent d'un rendu sur l'investissement qu'avait fait sur moi en France la Croix-Rouge. De plus, les valeurs de cette entreprise correspondent pleinement aux miennes.", "Interview Questions": "Comment imaginez-vous votre rôle chez nous ?"}], [{"date": "28 May 2017", "title": "Leiter Health Care Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Committee of the Red Cross (Geneva) in Apr 2014", "Interview Descriptions": "it was a long process, with a lot of paper work, and many documents to be sent back and forth, however following that an interview was set, and a personal one on one interview was conducted with some technical questions, language testing , and assessment to detect how can you cope with stress when you face it.", "Interview Questions": "why do you want to join the organization?"}, {"date": "20 Aug 2015", "title": "Consultancy Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at International Committee of the Red Cross (Geneva) in Jan 2014", "Interview Descriptions": "Two 12-year olds playing 20 questions. Embarrassingly idiotic. Erodes my faith in humanity. Lament that they didn't provide pastries for the interview- would it kill them to invest 3 CHF in a croissant??", "Interview Questions": "Asked to tell them how to undertake the consultancy they were hiring for..."}, {"date": "11 Nov 2012", "title": "Délégué Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at International Committee of the Red Cross (Geneva)", "Interview Descriptions": "La procédure d'embauche est exténuante, vu qu'elle consiste en un processus d'entretiens de deux jours aussi bien face à face que groupaux (simulations), que vous devez faire à Genève (le voyage et l'hébergement sont à votre coût). Les exercices en groupe mesurent la négociation, la confiance en soi, la coopération et  la confiance en autrui. Les entretiens individuels incluent une simulation filmée d'une situation que vous pourriez trouver sur le terrain, ainsi que l'entretien traditionnel «pourquoi voulez-vous obtenir cet emploi». Il y a également un exercice écrit (quoique je ne me souviens pas de quoi il s'agit).", "Interview Questions": "La simulation vidéo est l'exercice où je me suis senti le plus «dans mes baskets», mais vu qu'il n'y avait pas de feedback, je ne sais pas comment je me suis sorti. Essentiellement, ils vous mettent en situation de négocier avec des interlocuteurs sur le terrain au sujet de quelque chose sur quoi vous n'allez pas être d'accord. Une fois que vous êtes embauché et en apprentissage, il y a un autre vidéo-exercice, dans lequel vous êtes interviewé par des journalistes...Éclairant pour le moins ! "}, {"date": "10 Oct 2015", "title": "Delegate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at International Committee of the Red Cross (Geneva) in Nov 2012", "Interview Descriptions": "A very long intensive 2/days recruitment process. You will be invited to Geneva for 2 days and the recruitment team will  squeeze your personality out and put you into all the possible tests to get to know what kind of person you are. \r\n\r\nBut no worries in a couple of years this system will not exist anymore.. if not a earlier than two years.", "Interview Questions": "N/A"}, {"date": "19 Aug 2015", "title": "Delegate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at International Committee of the Red Cross (Geneva) in Mar 2011", "Interview Descriptions": "The hiring process is very rigorous, in a good way. After all, you will probably end up visiting prisoners or being stuck in a compound with your future colleagues. Beyond the professional qualifications, most of the last stage of recruitment is based on personality, checking that the candidate is a good fit, a good team worker and easy to deal with even in extreme stress situation.", "Interview Questions": "They extensively test your language capabilities"}]]