[[{"date": "22 Nov 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stetson University", "Interview Descriptions": "The interview process was short and relatively casual. Interviewed with the person who would be the position's direct supervisor and the person above them. The experience might be different depending on the department.", "Interview Questions": "How can you apply what you are studying in your program to this position?"}, {"date": "27 May 2022", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Stetson University (Deland, FL)", "Interview Descriptions": "Very easy interview process with many opportunities to grow.  If you are able to join the team you will learn many things about the school, be able to add to your resume, and a bit of customer service experience.", "Interview Questions": "What is your greatest weakness?"}, {"date": "29 Aug 2021", "title": "Manager, International and Graduate Programs Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stetson University in Jun 2021", "Interview Descriptions": "A series of three interviews. A phone interview, sparklier video recording and a zoom meeting with three individuals from the department. All very nice and sincere. I didn't feel that they had the expertise to grow the program like their vision and because of that I wasn't the right fit for the role despite being offered an in person visit, with the offer to pay for travel expenses (flight) to take a tour and meet them in person.\r\nThey asked simple questions about how I could grow the program during Covid.I was off put by the dean who hardly spoke despite having a 1:1 meeting for thirty minutes. That was alarming as it seemed he was so far removed from the team, that he had such little input, direction or vision. Some may find that as an asset in a job but form past experience I found that to be alarming and lacked expertise necessary to drive change, something I look for in a great leader.", "Interview Questions": "where do you see yourself in 5 years?\r\n\r\nHow will you recruit students during the pandemic?\r\n\r\nHow will you connect with overseas populations?"}, {"date": "1 Sept 2022", "title": "Fitness Coach (Student) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Stetson University (Deland, FL) in May 2021", "Interview Descriptions": "Basic interview questions, such as strengths and weaknesses. What do you as a student want out of the process?  My interview was over the summer through zoom. It was super easy and simple.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "30 May 2022", "title": "Paint Crew Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Stetson University (Deland, FL) in Jan 2021", "Interview Descriptions": "The interview was extremely laid back. It was led by the boss, Julie as well as another member of the team. It was a casual experience and felt very welcoming from the jump.", "Interview Questions": "What made you choose paint crew?"}, {"date": "4 Jun 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stetson University (Deland, FL) in Mar 2020", "Interview Descriptions": "This was a very difficult process. I had a 10 minute screening, 30 minute hirevue (recorded answers then send it to HR), 30 minute zoom interview with a committee of 6, and All day zoom with multiple departments with no break", "Interview Questions": "Name a time where you had to work with people from different backgrounds."}, {"date": "21 Apr 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Stetson University", "Interview Descriptions": "30 minute zoom interview with 3 people, the director and two staff from other depts. Two other committee members were not there. The position was described and the interviewers took turns asking set questions. Final question was if I had any questions.", "Interview Questions": "As administrative support, how will you support/promote diversity and inclusion."}, {"date": "2 Jan 2019", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stetson University", "Interview Descriptions": "Quick process, hour interview with director and staff. Simple questions, did not require portfolio. Campus tour following interview. Hired within two weeks - HR was slow in getting paperwork. No negotiation.", "Interview Questions": "Background and experience with position details."}, {"date": "17 Sept 2018", "title": "Recycling Team - Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stetson University", "Interview Descriptions": "Interview with Recycling Coordinator in conference room.  It may have current staff interviewing as well to give the interviewer an opportunity to ask questions to another student.  Very welcoming & comfortable environment.", "Interview Questions": "Tell us about yourself & why do you want to join the recycling Team? "}, {"date": "20 Apr 2018", "title": "Compliance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stetson University (Deland, FL)", "Interview Descriptions": "Skype interview followed by on campus interview. During the on campus interview a presentation was required and a variety of questions were asked to gauge how I would fit in to the current dynamic.", "Interview Questions": "Describe a time you have had to make a difficult decision. "}], [{"date": "20 Feb 2016", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Stetson University (Deland, FL) in Nov 2015", "Interview Descriptions": "The questions were very basic (cookie-cutter) and did not touch on my skills or abilities. It was very one-sided. The interviewers seemed bored. I was not allowed to ask questions at the end and was actually rushed out the door. I was brought in for a \"second interview\" which turned out to be the job offer. The salary was firmly non-negotiable: take it or leave it.", "Interview Questions": "What is your greatest strength/What is your greatest weakness; Where do you see yourself in five years; Why do you want to work here, What do you know about Stetson"}, {"date": "14 Jan 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stetson University (Gulfport, FL) in Nov 2015", "Interview Descriptions": "I was called over the phone and asked questions about how I qualify for the job. This was through their HR department. A few days later I got a call requesting that I prepare a 5 minute presentation in 1.5 days. On the day of the presentation, I went to HR and they brought me to the library to meet the other members of the office and give the presentation. Before actually giving the presentation, they go to know me better. I elaborated on all my experience and passion for this particular field. The following Monday I got an offer. I started about two weeks later.", "Interview Questions": "Tell us about your presentation experience."}, {"date": "1 Nov 2014", "title": "Web Applications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stetson University in Oct 2014", "Interview Descriptions": "This was a panel interview. The questions were run-of-the-mill and read from a printed sheet. They included your greatest weakness, etc. No surprises. The second interview was the actual job offer. Salary is not discussed until the second interview. I was given a figure that could not be negotiated, which was odd.", "Interview Questions": "\"Why should we believe you won't leave after one year?\" "}, {"date": "28 Jan 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Stetson University (De Land, FL) in Jun 2014", "Interview Descriptions": "Intensive. Full day of interiews with various departments. Difficult to always know who I was talking to/why, but it was abundantly clear that there was cohesion among different offices. Was asked to give a presentation for a group of people from student life. Met with faculty, students, and coaches.", "Interview Questions": "Why do you feel you align with Stetson's values?"}, {"date": "8 Dec 2015", "title": "Lead Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stetson University (Deland, FL) in Oct 2012", "Interview Descriptions": "It was very casual since all the professors knew me and my work ethic. I just had to explain why I thought I would be best for the role over a fellow student", "Interview Questions": "How would I improve the Math Clinic?"}, {"date": "2 Nov 2015", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stetson University (Deland, FL) in Sept 2011", "Interview Descriptions": "The interview was run by the department supervisor and a student employee. The student employee was there for no reason and wasted time asking pointless questions. The interview was about half an hour long and very simple. The interview was not challenging and mostly consisted of the supervisor telling me how to do an online personality quiz.", "Interview Questions": "Have you ever used a computer"}, {"date": "23 Apr 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Stetson University (Gulfport, FL) in Apr 2010", "Interview Descriptions": "I was called and set up an appointment for an in-person intervene.  I met with what would be my immediate supervisor.  I was asked basic questions: tell me about yourself, your experience related to this job, where you see yourself in the future, what do you enjoy about this position.  Then we chatted briefly as we got along well.", "Interview Questions": "The questions were very simple and I didn't find any of them to be difficult.  Maybe where I saw myself in the future, probably because I was still young and wasn't sure. "}]]