[[{"date": "8 Apr 2023", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Mar 2023", "Interview Descriptions": "Interview was changed three times. No water or coffee offered. No follow up or response after the interview by the recruiter (an email would have been nice). Very disappointing for a so-called professional organization.", "Interview Questions": "1. What my typical day was like at current job 2. Did I feel comfortable in hospital or clinic settings 3. When could I start"}, {"date": "8 Mar 2023", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System in Mar 2023", "Interview Descriptions": "It was quick and brief. James was the one doing the interview process and it did not take long. He is very polite and likes to know little things about you.", "Interview Questions": "What do you like to do?"}, {"date": "2 Dec 2022", "title": "Cashier Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CHRISTUS Trinity Mother Frances Health System", "Interview Descriptions": "first is Phone interview going over resume, then interview with director to go over skills. hr makes an offer after the interview. you can negotiate after the offer for more money.", "Interview Questions": "what are your goals for future"}, {"date": "23 Nov 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CHRISTUS Trinity Mother Frances Health System", "Interview Descriptions": "I interviewed with the director and the charge nurse of the unit. They asked me about 10 questions which were simple and easy. Later tht day I then received a cal which was my job offer", "Interview Questions": "What made your ant to be a nurse"}, {"date": "22 May 2020", "title": "Unit Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Trinity Mother Frances Health System", "Interview Descriptions": "Apply online then a recruiter will call you. There are group interviews where you go from table to table then after that the recruiter will call you with the floors that offered you a job", "Interview Questions": "Why do you want to work on this floor "}, {"date": "26 Aug 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in May 2020", "Interview Descriptions": "It was a telephone conversation with the general hiring manager. They asked general questions about the kind of leadership I work best under as well as how I learn best. They also asked what my five year plan is and where I see myself in five years. They were very nice and welcoming. I asked a few questions back pertaining to the most common types of leadership styles that they see in their charge nurses.", "Interview Questions": "Qualities that I like in a leader?"}, {"date": "10 Aug 2018", "title": "MICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Jan 2018", "Interview Descriptions": "The interview was about 20-30min long. I interviewed with the hiring manager and had a one on one with her. She asked about situations where I took opportunities to learn and what if scenarios", "Interview Questions": "Describe a time where you handled a difficult patient, how did you resolve it"}, {"date": "3 Jun 2017", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in May 2017", "Interview Descriptions": "Extensive application process which included two peer and two professional reference letters, along with an essay. First interview is with the head of the extern program, the second with your desired unit.", "Interview Questions": "Why do I want to work in my preferred department?"}, {"date": "20 Aug 2018", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Oct 2016", "Interview Descriptions": "Went through 3 interviews over the process of 5 weeks. Interviewed with different levels of management. Interview set ups seemed slightly unorganized- one interview I showed up to, only to be rescheduled for 2 days later upon arrival.", "Interview Questions": "Describe revenue cycle"}, {"date": "20 Aug 2016", "title": "Medical and Clinical Laboratory Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX)", "Interview Descriptions": "I got a interview right away, did a phone interview theyou did a skpy  interview with those in charge. I got to speak with the medical director, lab manager and the lab director.  I got some idea of their personalities and vice versa.", "Interview Questions": "How many years have I been in the field? How many test in-house have I handled before? Why  was I interested in coming to Tyler?"}], [{"date": "11 Mar 2018", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Aug 2016", "Interview Descriptions": "Contacted by a talent acquisition specialist after submitting an application. He/she was helpful in navigating the process. No call back when job was initially filled with someone else; however my resume was kept on file and used for a later opportunity.", "Interview Questions": "How comfortable are you training adults in healthcare roles, specifically physicians?"}, {"date": "9 Feb 2016", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System", "Interview Descriptions": "Took about 4 weeks from filling out application to final interview. Be prepared to turn in work samples and to do an \"assignment\" to demonstrate skills... Overall, a really good interview process without being too exhaustive", "Interview Questions": "Varied "}, {"date": "16 Jan 2018", "title": "Applications Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Aug 2015", "Interview Descriptions": "Long and drawn out.  Interviewed multiple times for the same job despite being the only candidate.  Then took a programming test that was harder than anything I've ever taken.  Then delayed a full month before actual hire.", "Interview Questions": "What is a difficult situation you've been in and how did you handle it?"}, {"date": "5 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Mar 2015", "Interview Descriptions": "Applied online got call same day interview next day. Was very professional interview was told goals and vision of floor before interview started. Was interviewed by manager first, after he left I had a peer interview with 3 nurses that work on the floor", "Interview Questions": "How do you deal with stress. Tell of a time you did not agree with your boss "}, {"date": "15 Mar 2016", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CHRISTUS Trinity Mother Frances Health System (Jacksonville, TX) in Jan 2015", "Interview Descriptions": "Fist interview you meet with the leader of enviromental services, go over your resume, they get to know you, give you a tour and pick your uniform size. Second interview it's in Tyler, you sign papers, determine pay, schedule orientation and your tb test/shots.", "Interview Questions": "Are you squeamish?"}, {"date": "25 Oct 2016", "title": "Clinic Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Jan 2015", "Interview Descriptions": "It began with an initial phone interview with a Director followed by an in person interview with the same Director.  I then met what would be my staff, the physicians and CEO I would be working for and had lunch.", "Interview Questions": "How did you deal with a demanding physician?"}, {"date": "29 Jun 2014", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System", "Interview Descriptions": "Standard process - HR filters the potential candidates, someone then contacts you, an interview time and place is then set, interview then takes place, if you're the selected candidate an offer letter is sent, negotiations can then take place if initial offer letter is unacceptable, then candidate can either accept/deny job, etc.", "Interview Questions": "N/A"}, {"date": "11 May 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Nov 2013", "Interview Descriptions": "online application followed by a phone interview with HR, then interview with upper management at the location, then lower management, did have to take a couple of skills test also met with the doctor that i would be working with", "Interview Questions": "What are your certifications"}, {"date": "23 May 2013", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System", "Interview Descriptions": "Very easy interview process. I was called the day after I put in my application. Had my first interview with HR a few days later and my second interview about a week after that. After the 2nd interview it was just a drug test and that was it. I had an overall good time with it all except for having my hours changed on me.", "Interview Questions": "There was really nothing difficult about the interview, all questions were basically just asking about work exp. "}, {"date": "30 May 2017", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in May 2013", "Interview Descriptions": "I submitted an application and was called to set up and interview.  Interview was uncomfortable as I felt my age was an immediate problem with her.   Was not hired.   Found out years later she hired someone much younger than I without any recruitment experience.", "Interview Questions": "N/A"}], [{"date": "22 Aug 2015", "title": "Marketing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Mar 2013", "Interview Descriptions": "had interviewed before.  Saw posting on Facebook and a friend also alerted me.  Went though regular process: screen by HR and two interviews.  Friendly call from the VP as the offer was being prepared.  I was really excited to join.", "Interview Questions": "They asked a lot about practical experience.  Very specific skills"}, {"date": "15 Mar 2012", "title": "(Confidential) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Mar 2012", "Interview Descriptions": "I initially submitted my resume for a contract position I found posted on an internet job board.  I don't remember the time frame between my submission and when they contacted me, but it was a brief telephone interview outlining the timeframe of the contract, asked current salary/expectation, asked how my education/work history could would be beneficial to said position.  A couple days later my recruiter called back and said they wanted to schedule an interview, so we arranged a time. It was a 2-1 interview, rather than the 1-1 I selected above, but that option was not available as a choice on this site.  As someone who usually gets nervy in interview settings, it was very relaxed.  Two ladies asked situational questions, why I was interested in the position, etc.  They were very friendly and helpful.  From this interview I was very excited about the prospect of being an employee at such a well-organized company that asked relevant questions and seemed interested in making sure we were a good fit for each other.  Before I made it home, I received a phone call stating that they would like to bring me in for another interview, in which I would complete a presentation.  This was roughly a week and a half later, in front of about 12 people.  Again, very friendly.  I found out five days later I was accepted for the position and am super-excited, because I feel like I really fit in here and they have personalities!", "Interview Questions": "Why are you interested in the position?"}, {"date": "24 May 2013", "title": "Business Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System (Jacksonville, TX) in Jan 2012", "Interview Descriptions": "I submitted my application online and received a phone 1-2 days later from the department supervisor requesting an interview.  I came in to interview a few days later.  She then took me around the department and introduced me to several other co-workers.  After this, I was offered the position and was given a date to attend orientation. Orientation was a full day, but fairly entertaining and informational. Training in my department was substantial, with support set up for upcoming problems should they have arisen.", "Interview Questions": "\"Tell me about a time when you had to resolve an issue with an upset coworker...\""}, {"date": "5 Sept 2015", "title": "Unit Secretary of Labor and Delivery Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Apr 2011", "Interview Descriptions": "I met with the Director of the Department first and discussed the procedures and requirements of a Unit Secretary. We discussed my abilities and how I worked with others.  Talked about Labor and Delivery and what generally goes on day to day.", "Interview Questions": "How do you handle work under stress?"}, {"date": "6 Jun 2011", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Jul 2010", "Interview Descriptions": "The manager was somewhat rude, questioning every statement I made as to credibility. Did not allow me a window to communicate.", "Interview Questions": "I don't remember, she told, did not ask. "}, {"date": "15 Feb 2013", "title": "Biomedical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Nov 2009", "Interview Descriptions": "Worked as a contractor with them first, decided they would be a good fit.  Left my resume with the department team leader and director.  When a position came open, they called and I took the job.", "Interview Questions": "N/A"}, {"date": "15 Sept 2009", "title": "Echocardiogrpahy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at CHRISTUS Trinity Mother Frances Health System (Tyler, TX) in Sept 2009", "Interview Descriptions": "Still in process, so far a phone interview and flying to city", "Interview Questions": "discribe a situation in which you positivly effected patient care."}]]