[[{"date": "21 Feb 2023", "title": "PKF RN care coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Feb 2023", "Interview Descriptions": "The interview is at tech town and takes approximately 45 mins. You interview with the care coordinator manager. She is very knowledgeable and provides a comprehensive overview of the position. Since I do not have my BSN, she was honest with me at the beginning that she could not bring me onboard, but I wanted to continue with the process as I was very interested in this position.", "Interview Questions": "What is your five year plan? What is your favorite part about your job? What would you do in certain situations?"}, {"date": "20 Dec 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dayton Children's Hospital", "Interview Descriptions": "A phone screening, a private interview, a team interview and then an in person interview visit. Overall it was a pretty quick and painless process that only lasted about a couple weeks from the application date to the hire date.", "Interview Questions": "Why do you want to work here?"}, {"date": "26 Sept 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dayton Children's Hospital", "Interview Descriptions": "The first part of the interview was within a few weeks after applying and was with a Recruiter on the phone, and then in the following days if was hiring manager in person, peer group/staff interview in person.", "Interview Questions": "What was a difficult situation you have been in and how did you handle it/resolve? "}, {"date": "2 Dec 2022", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Sept 2022", "Interview Descriptions": "I got a phone call after and was asked simple questions like what my strengths are what my weaknesses are. How I deal with stress and how I manage it", "Interview Questions": "What is a challenge you faced in your recent jobs that you had to overcome and how did you do that"}, {"date": "4 May 2022", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dayton Children's Hospital", "Interview Descriptions": "The interview process was a phone call and this was for a college internship position during the school year it was a great position to have and it was a nice place to work", "Interview Questions": "N/A"}, {"date": "22 Jul 2022", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Dayton Children's Hospital (Dayton, OH) in May 2022", "Interview Descriptions": "The interview was very easy with simple questions that allowed me to talk about things other than myself and everyone was super nice! I think working here is a great starter or long-term option!", "Interview Questions": "What is one of your strengths?"}, {"date": "2 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dayton Children's Hospital", "Interview Descriptions": "Excellent process of face to face interview with nurse manager, educator,  and clinical team leader. Was able to job shadow and then offered the position once all interviews were complete.", "Interview Questions": "An example of a challenging patient situation and how it was handled. "}, {"date": "26 Apr 2021", "title": "Inpatient/Outpatient Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital", "Interview Descriptions": "It went very well. The manager & other coders were very friendly, asked many questions and answered some of mine as well. I was allowed to speak to one of the newer coders, to get an idea of the workplace environment and what it's like for new coders at the facility. Part of the interview process also included a coding test, which is norm for a position like this.", "Interview Questions": "I was asked about past experience and my expectations for the job."}, {"date": "18 May 2022", "title": "Student Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Dayton Children's Hospital (Dayton, OH) in Apr 2021", "Interview Descriptions": "Very thorough and detailed. Questions were centered around how you would engage with the community and patient families. Complex situations were given and you’d have to answer with how you’d handle the situation.", "Interview Questions": "How would you establish relationships with patient families?"}, {"date": "19 Jan 2021", "title": "Staff Safety Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dayton Children's Hospital", "Interview Descriptions": "I was onsite twice for a short amount of time. Each time I felt like it was prompt and organized which I appreciate. As these types of things typically happen while one has another job.", "Interview Questions": "Why do you want to work here. "}], [{"date": "17 Nov 2020", "title": "PCA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital in Oct 2020", "Interview Descriptions": "It was quick and easy. The interviewers were very nice and made it a lot less intimidating. Mine was done via Teams due to COVID, and I was still able to get a good feel for the job.", "Interview Questions": "Q: What can you bring to Dayton Children's?\nQ: Why do you want to work here?"}, {"date": "4 May 2022", "title": "Health Unit Coordinator (HUC) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital (Dayton, OH) in May 2020", "Interview Descriptions": "Very easy it was during COVID so it was on the phone. They were very nice and we talked for awhile about everything and she told me she would call back the following week if interested.", "Interview Questions": "Why do I want to work for Dayton Childrens Hospital. "}, {"date": "28 Oct 2019", "title": "Inpatient Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Dayton Children's Hospital (Dayton, OH) in Oct 2019", "Interview Descriptions": "Before even being scheduled for an interview I was asked to complete my bci/fbi background check to start my Ohio Pharmacy Tech license....that was $62. Then I was told to submit for my license to get the ball rolling on that, which was another $51. After submitting promplty, I was finally scheduled for my interview. I was told there would be a decision on the following Monday---did not hear anything, so I waited until Wednesday to call for a follow up and got an email that same day saying they chose another candidate. I was not offered re-embursment for the fees I paid to get the position and I currently cannot use the license at my current job, so I am completely out of this money and no job offer.", "Interview Questions": "How do you handle an escalated issue?"}, {"date": "15 Apr 2019", "title": "SLP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Dayton Children's Hospital (Cincinnati, OH) in Apr 2019", "Interview Descriptions": "Recorded video. Questions came up on the screen and you record the answer.  Each quesion has a timer and you must respond in the given time. There were 6 total questions. Most of them were general questions any interview would ask.", "Interview Questions": "Why would you be a good fit for this position? "}, {"date": "17 Jan 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dayton Children's Hospital (Dayton, OH) in Jan 2019", "Interview Descriptions": "Had a phone interview first.  There was a delay in scheduling an in-person interview due to the holidays.  In-person interview was a 2 step process.  Had a 2:1 interview then a panel interview.  I was taken on a tour of hospital to see the new renovations.  The interview was very professional.", "Interview Questions": "Why are you leaving your current job?  What do you know about this role?"}, {"date": "29 Apr 2018", "title": "PCA Float Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Apr 2018", "Interview Descriptions": "I applied online and a recruiter sent me an email soon after. I had a phone interview, where they asked a couple simple questions. I was then moved to interview with 3 RNs in person.", "Interview Questions": "My biggest strength/weakness, what will be my biggest adjustment, how do I handle stress, tell about my past work experience, how would I handle an upset parent, etc  "}, {"date": "23 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital in Mar 2018", "Interview Descriptions": "Easy to get in to interview. Long hiring process. HR tends to be on slow side, disorganized.  Appreciate the staff, all friendly and hard working team. Even when we were short nurses, everyone worked together and had good spirits.", "Interview Questions": "Why I liked working with children"}, {"date": "27 Jun 2018", "title": "PACU HUC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dayton Children's Hospital (Dayton, OH) in Mar 2018", "Interview Descriptions": "The job I applied for was a brand new position. The interview process was very professional. I interviewed with the director, assistant manager, and lead nurse from PACU.  They were very professional, and interested and willing to answer any questions that I had for them. They allowed me to come in to job shadow the Lead Nurse, and that was a great experience and opportunity.  HR recruiter was very well at keeping in touch with me during the process.", "Interview Questions": "What type of experience do you have in the medical field?"}, {"date": "6 Feb 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at Dayton Children's Hospital (Dayton, OH) in Dec 2017", "Interview Descriptions": "The interview process is not standardized.  Some Directors are promoted and/or hired without the job being posted.  Others have to go through multiple rounds of interviews.  My experience was the latter.  I was okay with the process, but was frustrated with the presence of a specific VP.  He/She was more focused on discussing themselves than learning about me as a candidate.", "Interview Questions": "What experiences you have revolving around the Dayton Children's Values"}, {"date": "11 Oct 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dayton Children's Hospital in Dec 2017", "Interview Descriptions": "Its a two to three step interview process.  First I met managers at a job fair where they asked preliminary questions.  Then I met with HR via telephone. Then once more an interview on the unit with two of the managers", "Interview Questions": "Why do I want to work here?  What are your weaknesses? "}], [{"date": "26 Mar 2018", "title": "Training Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Nov 2017", "Interview Descriptions": "I completed an online application that had several behavioral and essay type questions included. After that I received an automated email to submit an interview through a video-based recruiting system, where I had to record myself answering approximately 5 behavioral type questions and/or \"why are you a good fit for the job\" type questions.", "Interview Questions": "Behavioral based questions. Online app had about 4 - 5, one being \"Tell about a time you changed someone's mind.\" Video recruiting app had 5 questions, one being \"Tell about a time you were successful.\" Some had scenario based questions \"how would you handle...\" and others had more than one part to it, esp. the video-based app."}, {"date": "12 Oct 2017", "title": "Clerical Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital", "Interview Descriptions": "Intense and thorough interviewing process. You start off at HR where they ask you common \"about yourself\"  interviewing questions. If they approve you, you move on to the hiring manager of applied position. The manager interviews you and asks more job related questions and tells you more about the position. If the manager approves you then you  move on to a peer interview where your potential coworkers interview and ask you a range of questions.", "Interview Questions": "Tell me about yourself."}, {"date": "15 Oct 2017", "title": "Evs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Dayton Children's Hospital", "Interview Descriptions": "Applied online. phone interview took place. I was moved forward . Had a face to face interview with a group of five or more potential peers.  Got a small tour around potential area.", "Interview Questions": "How do you prioritize your day.?"}, {"date": "22 Feb 2018", "title": "Clerical Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Aug 2017", "Interview Descriptions": "The worst part is being unsure with the status of your application with their new career system \"Workday.\" The status updates have no information attached to them like their old system did.\r\n If you are a candidate, HR reaches out to you over the phone and phone interviews with you.  If your phone interview goes well, then the hiring manager reaches out to you to setup an interview at the facility.. usually that is with 2-3 people. In some departments, they do peer interviews where you will interview with employees within the department as well after you interview with the hiring manager. From that point, you wait and HR will reach out via email and let you know  if they have decided to pass on you... or if they will call you if they are wanting to offer the position.", "Interview Questions": "Name a time where you didn't do your best on a task, and what you did to improve your performance?"}, {"date": "7 Jun 2017", "title": "Major Gifts Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital", "Interview Descriptions": "Interviewed with CDO first.  Was invited to interview with Major Gifts Director, Development Team, and Foundation Board chair.  From there I was offered the job by the CDO.", "Interview Questions": "How have you solved a workplace problem?"}, {"date": "1 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Dayton Children's Hospital (Dayton, OH) in May 2017", "Interview Descriptions": "I met with Human Resources first and was then sent over to the hospital to interview with my current Manager and Educator. From there I did a urine drug screen and physical.", "Interview Questions": "What is most important to you when looking for a new job?"}, {"date": "14 Jun 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital (Cincinnati, OH) in Feb 2017", "Interview Descriptions": "VIDEO INTERVIEW using my computer with sight camera   after completing the online application , Phone call and email from human resources .  In person interview  at their HR office across the street from the Main Hospital,  drug test and background check", "Interview Questions": "Tell us about your experience and credentials"}, {"date": "20 Jun 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dayton Children's Hospital in Dec 2016", "Interview Descriptions": "The interview consisted of three steps, a phone screen, one on one interview, and group interview.  the hr staff were very nice.  The manager took a very long time getting back to me because there was alot of internal candidates", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "20 Feb 2019", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dayton Children's Hospital in Feb 2016", "Interview Descriptions": "Quick and painless, a phone call, a quick screening interview, then I met with staff. Overall it was a pleasant and gentle experience. The HR staff was professional. Followed initial interview with a follow up interview that included senior management staff", "Interview Questions": "N/A"}, {"date": "22 Jan 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Jan 2016", "Interview Descriptions": "I applied online and received a call about a week later to meet with HR.    My interview with HR was the standard questions. I was asked to describe myself and why I felt I would a good fit", "Interview Questions": "What my strengths are"}], [{"date": "13 Oct 2017", "title": "Lab Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Jan 2016", "Interview Descriptions": "I had a total of 3 interviews. First one was a video interview, second was with HR and third with the manager. It was pretty simple and unlike any interview I was in before but overall a fantastic experience", "Interview Questions": "Why I wanted to work for Dayton Children's"}, {"date": "26 Apr 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dayton Children's Hospital (Dayton, OH) in Jul 2015", "Interview Descriptions": "It's difficult to actually get an interview, I applied at least four times in the past and I never got a phone call back, despite being highly qualified. But after the call back, it was fairly easy.", "Interview Questions": "How do you deal with conflict."}, {"date": "26 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Dayton Children's Hospital (Dayton, OH) in Jun 2015", "Interview Descriptions": "I met with Human Resources first, and they had standard paperwork. The meeting was very straightforward, with friendly staff. The questions were generic, and had to do with what is important to the company, why you want to work there, and your experience. Staff was friendly. Met with staff of actual department after this meeting, questions were more specific, but still fairly general. Entire process took approximately 100 minutes.", "Interview Questions": "Questions were very standard. They allowed time for you to ask them questions, as well."}, {"date": "13 Jul 2017", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Dayton Children's Hospital (Dayton, OH) in Apr 2015", "Interview Descriptions": "Interviewed with office manager and director.  interviewed on how well I knew about the department functions and answering phones and relating to customers that we receive in the office.", "Interview Questions": "What do you  know about the position that you are applying for. "}, {"date": "13 Apr 2015", "title": "Pharmacy Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Sept 2014", "Interview Descriptions": "The interview process was easy, quick, group setting. I was well trained in my dept with in 60 days of hire. The orientation process was disorganized, and we hada  quasi overpopulated group for the small room that they did this in, but the company presented it's self well.", "Interview Questions": "hypothetical questions about socializing and job moral."}, {"date": "9 May 2016", "title": "Telecommunications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dayton Children's Hospital (Dayton, OH) in Jun 2014", "Interview Descriptions": "first interviewed by HR department. later interviewed by direct manager. quick and easy interview process. HR personnel were easy to talk with. very polite and friendly. very straight forward and clear as to explaining job responsibilities and description.", "Interview Questions": "is there anything on you record which we should know about?"}, {"date": "9 Dec 2014", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 7 weeks. I interviewed at Dayton Children's Hospital in Jun 2014", "Interview Descriptions": "Six interviews took about 1/2 day: HR, hiring manager, additional managers (2), coworkers, senior manager (hiring manager's boss). Interviews were in general laid back and were a combination of explaining the work they do and asking for examples of my experience. Unfortunately, I never got a call or follow-up letting me know they hired someone else.", "Interview Questions": "Describe how you would motivate a project team that doesn't report to you."}]]