[[{"date": "17 Apr 2023", "title": "Coach Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elmhurst University", "Interview Descriptions": "Straightforward, in-person, interview. Discussed the basic requirements for the role, approach to coaching, and my philosophy on athlete development. All-in-all it felt like a friendly, welcoming, environment. Felt more authentic than other interviews I've sat through", "Interview Questions": "What is your approach to athlete development"}, {"date": "26 Jan 2023", "title": "Director of Community Standards Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Elmhurst University (Elmhurst, IL) in Dec 2022", "Interview Descriptions": "Initial zoom meeting/screening. Was scheduled for 30 min, but it seemed to be going very well and we spoke for an hour. Next steps would be a panel zoom meeting, then an on-campus final interview. Pretty standard first round questions and review of the position. Despite my follow-up with a thank you message, no communication has been received back, not even a polite rejection letter. Just ghosted.", "Interview Questions": "Tell me about yourself. Are you willing to work in-person? Strengths? What are your salary requirements?"}, {"date": "8 Nov 2022", "title": "CES Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Elmhurst University", "Interview Descriptions": "The interviewing process was very demanding and time consuming. Was required to meet with various departments and leadership, went through multiple rounds of interviews with additional people. Lunch was provided.", "Interview Questions": "Where do you get your inspiration from."}, {"date": "5 Jul 2021", "title": "Groundskeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Elmhurst University", "Interview Descriptions": "It was a two step interview process meeting with the person that I would directly report to and a second interview with that person and his supervisor.  It was a similar to most other interviews.", "Interview Questions": "My background experience regarding tree care and turf care."}, {"date": "4 May 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Elmhurst University", "Interview Descriptions": "The search committee reached out three days in advance to ask for an interview. Interview had 5 questions and questions were very easy.   Interview was held over Zoom and lasted right at thirty minutes.", "Interview Questions": "Tell us about your background and how that makes you a good fit for this role."}, {"date": "9 Mar 2021", "title": "Data Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Elmhurst University (Elmhurst, IL) in Sept 2020", "Interview Descriptions": "General interview questions, previous job position inquiries, how one gained technical skills, degree type, and analytical questions. They asked personal questions as to what one likes to do during their spare time, and class schedule. They're very flexible.", "Interview Questions": "Have you worked with data before?"}, {"date": "15 Oct 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Elmhurst University (Elmhurst, IL) in Oct 2019", "Interview Descriptions": "There was an initial phone interview with hiring manager, then an in-person interviewed with a VP, a director, the hiring manager again and two other members within the department.   The interview questions were behavioral based.", "Interview Questions": "What new ideas do you have that you could bring to the team?  What is your management style?  "}, {"date": "20 Jan 2019", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elmhurst University (Elmhurst, IL) in Jan 2018", "Interview Descriptions": "In depth all day interview, I met with Dean, Students, Department and Non-Dept. Faculty.  The whole process took the entire day, including a presentation with faculty and students. Also included a phone interview before.", "Interview Questions": "What do you want to contribute to the College "}, {"date": "5 Mar 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Elmhurst University", "Interview Descriptions": "The whole process took about two months. Two interviews:  One for the athletic department/coaches, one for the academic program.  The application process is the most strenuous part.  I was offered the position during my 2nd interview (the academic one).", "Interview Questions": "How do you plan to balance the sports and the academics?"}, {"date": "10 Dec 2016", "title": "Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Elmhurst University (New York, NY)", "Interview Descriptions": "Pretty standard. First interview by phone with immediate supervisor and in-person interview with department head. Final step was a meeting with several other employees in the department. This lasted about an hour.", "Interview Questions": "Asked about my interest in and ability to keep accurate records"}], [{"date": "19 Apr 2014", "title": "Teacher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Elmhurst University (Elmhurst, IL)", "Interview Descriptions": "I was abroad and I could take the interview by Skype.\r\nShe was friendly and I felt comfortable.\r\nThey are really interested in your educational background, not so much in your professional experience.", "Interview Questions": "Nothing strange, they are interested in your studies mainly."}]]