[[{"date": "18 Mar 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Creative Support", "Interview Descriptions": "Easy and straightforward. Multiple questions about what would you do in certain situations, they ask you if you know about concepts like safeguarding. Staff really nice and approachable. Not a serious interview.", "Interview Questions": "Do you know what is safeguarding?"}, {"date": "17 Mar 2023", "title": "Support Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Creative Support", "Interview Descriptions": "The interview was really calm and overall a positive experience. The people interviewing were kind and relaxed. The whole process was really quick and stress free They gave me a response pretty quickly.", "Interview Questions": "What will you do to ensure the client's dignity is always preserved?"}, {"date": "1 Apr 2023", "title": "Social Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Creative Support (Stockport, England) in Feb 2023", "Interview Descriptions": "After I completed the interview Omar called me to say I have been accepted for the job but he wants to me to view the place I will be working at first. I went to the place and enjoyed the experience. I again accepted the job and I was told recruitment will be in touch soon. 1 month later recruitment never called. Omar wasted 2 days of my life by leading me on with no intention of recruiting me. It is soul destroying when you get accepted for a job and they then ghost you. Don't waste your time with this company it seems like nobody is professional and they do not respect you as a human being.", "Interview Questions": "Will you go home and think about the job and call me in a few hours?"}, {"date": "14 Jan 2023", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Creative Support", "Interview Descriptions": "Application form sent in. Telephone call to arrange interview. Had to write answers to a case study. Then did an interview with 2 people. Had to take ID so they could apply for DBS.", "Interview Questions": "Why did I want to work for company?"}, {"date": "22 Nov 2022", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Creative Support", "Interview Descriptions": "Very comprehensive, allowed to ask questions about the role and provide all necessary clarifications, which was much appreciated. Overall would highly recommend for anyone considering a job in the area of support work and working in care supporting vulnerable individuals.", "Interview Questions": "N/A"}, {"date": "20 Apr 2022", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Creative Support", "Interview Descriptions": "Face to face interview \r\ngreeted by a member of staff \r\n-introduce yourself \r\n-why would you like to work for Creative support ?\r\n-In your words what would this position involve ? \r\n-explanation of the position \r\n-What challenges might you face in this role ?", "Interview Questions": "How do you think you can balance your workload ? "}, {"date": "4 Apr 2022", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Creative Support", "Interview Descriptions": "I dropped a paper application at their office and I got a call inviting me to an interview almost immediately, the process was really quick. I attended the interview in Sale Manchester.", "Interview Questions": "Why did you apply for this role"}, {"date": "22 Jan 2021", "title": "Graduate Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Creative Support", "Interview Descriptions": "I had told them on the interview call and via email of my notice period but acted shocked when I reminded them of this. Felt like they had not prepared prior to the interview.  \r\nTwo staff interviewing while the manager inputted questions. Then an hour to do an excel task and a design task.\r\nThe manager was quite abrupt and critical of answers, did not present a great environment to work in. \r\nHad to come into a face to face interview despite pandemic- felt like it could have easily been done on Zoom.", "Interview Questions": "Q;Safeguarding\r\nQ: Organisation of tasks \r\nQ: greatest weakness "}, {"date": "7 Jul 2020", "title": "Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Creative Support (Wythenshawe, England) in Jun 2020", "Interview Descriptions": "Very unprofessional, had to wait for them to bring up the questions and print. Very dismissive before I had even spoke. Sat with their back to me staring at computer screen, even before typing up my answers.", "Interview Questions": "How would you respond to seeing a service user outside of work? "}, {"date": "8 Aug 2020", "title": "Recovery Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Creative Support (Manchester, England) in Jun 2020", "Interview Descriptions": "It was pleasant, nothing out of ordinary. it involved 10 questions among two interviewers who was taking notes the entire time of the interview. The questions were a mix of situation and skill based.Done through zoom and was okay.", "Interview Questions": "why apply for a job at creative support?"}], [{"date": "19 Feb 2020", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Creative Support (Stockton, East of England, England)", "Interview Descriptions": "Really thorough yet rewarding interview experience. I would definitely suggest revising and preparing as I found they were looking for specific answers and points for you to touch on. They would write and score your answers on a paper which made it much easier to think whilst they were busy writing notes. There was also a questionnaire beforehand hand about skills and general experience", "Interview Questions": "How would you describe a difficult client and what makes them difficult "}, {"date": "9 Sept 2020", "title": "Community Engagement Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creative Support (Liverpool, England) in Dec 2019", "Interview Descriptions": "Interview was approximately one hour.\r\nMainly scenario based questions. \r\nTwo interviewers. \r\nInterview experience was positive but the process afterwards was gruelling, waiting to start. It took approx 2 months despite already having a transferable DBS.  Miscommunication from HR, they took ages collecting references.", "Interview Questions": "what would you do if you attended a client's home and they said there was someone in their property who wouldn't leave?"}, {"date": "23 Feb 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creative Support (Liverpool, England) in Sept 2019", "Interview Descriptions": "I applied through a job board and I received a response from them within a couple of weeks, and I was invited for an interview. I got feedback by the end of the day and was offered the job.", "Interview Questions": "What do you know about safeguarding /confidentiality? "}, {"date": "10 Aug 2019", "title": "Recruitment Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Creative Support (Stockport, England)", "Interview Descriptions": "Straight forward process, easy interview, pleasant panel. Some applicants do not prepare for the interview - this shows. Prepare by looking at the job description and assessing how your skills fit.  If you pass, the hiring process is relatively straightforward -though they have to carry out DBS checks.", "Interview Questions": "Please describe how you would organise your workload"}, {"date": "29 Jan 2020", "title": "Recruitment Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Creative Support (Manchester, England) in Aug 2019", "Interview Descriptions": "10 question interview - had to answer situational questions and questions about previous experience - there were two people on the panel and they left a lot of time to answer and ask questions at the end", "Interview Questions": "What to do if you think there's been a GDPR breach? "}, {"date": "27 Jan 2018", "title": "HR Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creative Support (Manchester, England) in Jan 2018", "Interview Descriptions": "Company´s application form to complete online (2 weeks before deadline) and to send to the company email address. Received a letter to attend an interview 1 week later on a specific date and time. \r\n\r\nThe day of the interview: writing test for 60 minutes and then a formal interview with a panel of 3 members (30 minutes).", "Interview Questions": "What would you do if an internal customer that you are meeting starts to talk bad about one of your colleagues and they way he/she works?"}, {"date": "7 May 2021", "title": "Care Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Creative Support (Manchester, England) in Dec 2017", "Interview Descriptions": "Best interview I have attended for a care support worker. The interview process is strict as in not everyone is successful and I'm my opinion this is good as a care support worker not everyone is suited to the role.", "Interview Questions": "N/A"}, {"date": "9 Oct 2017", "title": "Mental Health Support Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creative Support", "Interview Descriptions": "At first there was a  written test based on personal attributes with industry related questions at the end based on a  case study. Second part was a group interview also based on a case study", "Interview Questions": "How would you handle a complaint?"}, {"date": "9 Sept 2017", "title": "Area Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Creative Support in Aug 2017", "Interview Descriptions": "Welcoming, friendly and fair.  From the beginning I was put at ease. The interview was basically set at the pace in how I responded  and the panel as recruiters did their best to get the best responses out of me.  As a recruiter myself but in the position of interviewee  I felt the attention and focus given to me was proportional in all aspects of recruitment.", "Interview Questions": "What attracted me to the job and the experience I could bring and encouraged me to answer in my own words. I knew then they wanted to hear from me and not the automatic jargon.  This was important for me to hear, because I knew they were genuinely interested in hearing from me."}], [{"date": "11 Oct 2017", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creative Support (Stockport, England) in Aug 2017", "Interview Descriptions": "Panel of three people, who all took turns answering questions. Quite formal but was made to feel very relaxed. The DBS form before the interview took a long time to complete, would reccomend writing down housing history in advance if its complicated.", "Interview Questions": "Tell us abit about your employment history "}, {"date": "23 Jun 2017", "title": "Facilities Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Creative Support (Stockport, England) in Jun 2017", "Interview Descriptions": "Interview with a panel of 3 , put at ease well conducted interview covering number of questions to do with the person specification. Able to get across my personality in the interview. Disappointing that I have not been told the outcome of the interview after taking the trouble to attend in Stockport.", "Interview Questions": "why do you want to work for creative support."}, {"date": "20 Jul 2017", "title": "Admin Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creative Support (Birmingham, England) in Jun 2017", "Interview Descriptions": "Interviewed by two people. They were expecting a lot of experience and skills but offering very little pay. I was asked nine scenario based questions. Contract job, uncertainty over whether they'd keep you on after the nine months. They need to offer a fair salary to people and not just pennies above the minimum wage. This is unprofessional and they can only expect a high staff turnover.", "Interview Questions": "How did you deal with a member of a team who wasn't doing their full share of work?"}, {"date": "10 Jun 2017", "title": "PR, Marketing and Communications Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Creative Support (Manchester, England) in May 2017", "Interview Descriptions": "The interview process was very long, considering the low salary. \r\nI applied and was selected to attend a group interview. In the group interview, there were ten of us (quite a large number!) and we broke off into two groups. We were given 8 descriptions of videos, and had to to detail how we could gain publicity for each one. We then fed back to the group. \r\nStrangely, we then had to fill out essentially another application form again, independently. We were only given 20 minutes to do this, and the interviewer was pressurizing us all to hurry up and finish writing every so often. It was a very lengthy form-we had to describe why we wanted the role, what experience we had etc. Unsure why as I had already done this in my initial application form! Some of the questions in this form were unusual, and did not allow people to show themselves in the best light. E.g. Name three weaknesses? (one would be fair enough but three?!?! ) Name something that would affect your ability to do this role (I wouldn't have applied if I thought I couldn't do the role?)\r\nWe then moved on to do an independent proof reading task. This made more sense for the job role, proof reading a letter. We had half an hour to do this.\r\n\r\nIF we were successful at group interview, we'd then be invited to a second interview! (I wasn't)\r\n\r\nOverall, I found the interview to be very full on indeed! I felt that from the off we were under a great deal of time pressure, and by the end my hands were aching because we had to do so much writing! I thought filling in another application form was pointless, and I thought considering some of the ten of us had traveled far to be at the GROUP interview, we should have done more group work. \r\n\r\nIn every other PR role that I have applied for, they have been for higher salaries, and have involved a simple individual interview, with a press release writing task. Unlike every other interview I have attended, Creative Support have  not provided any interview feedback.", "Interview Questions": "Name three weaknesses"}, {"date": "7 May 2017", "title": "Waking Nights Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Creative Support (Stockport, England) in Apr 2017", "Interview Descriptions": "Very intense interview with written questions after initial interview but very friendly team.Would say it is good for support worker roles to be offered with no experience so it gets the best caring people in the profession of support working roles.", "Interview Questions": "What would you do if you saw a service user out of work?"}, {"date": "25 Sept 2018", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Creative Support (Manchester, England) in Dec 2016", "Interview Descriptions": "The manager kept looking at her phone during the interview and took a personal call.\r\nVery unfriendly and rude. \r\nI would advise you to avoid this company. \r\nOnce getting the job it took months for anything to be sorted.", "Interview Questions": "What would you do if a service user became distressed whilst out in the community?"}, {"date": "6 Apr 2017", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Creative Support (Manchester, England) in Nov 2016", "Interview Descriptions": "It was an online application process, following which i was invited to a group interview at headquarters. There were about 8 others in the group interview, it was easy to get drowned out when speaking about the scenarios they told us. They encourage everyone to talk. I managed to speak, but i'd probably suggest trying to input information at every round. There was a section of this interview where you had to fill in a form of questions for twenty minutes.The group interview lasted about an hour and a half.\r\nI was then emailed that i had progressed from the group interview and invited to another interview in the residential house i would be working in. This interview lasted for an hour and included being asked questions by a service user.", "Interview Questions": "Scenario based questions."}, {"date": "19 Nov 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Creative Support (Camden Town, England) in Nov 2016", "Interview Descriptions": "*This review if just for the first interview of the two interview process*\r\nThe first interview is a 'group discussion'. This is a 2 hour interview and they seem to forget to tell you this so prepare for a lengthy session. The first hour is all about writing. You have 25 minutes to fill out a packet of questions all about you and another packet about your personalities. The second packet is used to match you up with a service user in the event that you are selected for the position. Be aware of time! I personally did not have the time to finish the section about myself and was forced to hand in the packet when only half of the questions were answered. Following this you get a case study and have 25 minutes to answer 4 questions regarding the case study. This was enough time to complete the all the questions. The next hour is about the case study you all just read. There are about 10 questions (different than the written questions) in which you all discuss what you would do in each scenario.", "Interview Questions": "Tell me 3 weaknesses that would hinder your success in this role at Creative Support"}, {"date": "29 Sept 2016", "title": "Office Job Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Creative Support (Manchester, England)", "Interview Descriptions": "Panel interview with three people including a service user.  Good interview quite relaxed.  Interviewed not by our department manager but luckily I get on with the manager anyway .  I would have liked to have met them at interview.pre employment checks took a long long time and they didn't confirm my salary until I was given a start date and then I handed in notice.  ended up starting months after initial interview", "Interview Questions": "Usual questions about prioritising, planning workload etc. Nothing too surprising"}, {"date": "23 Sept 2016", "title": "Administration Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Creative Support", "Interview Descriptions": "Already working in the position. Had to apply to go from temp to perm. Still wasn't offered the job even though I'd be doing it and practically running the team for 12 months.", "Interview Questions": "What do you think your best qualities are"}], [{"date": "17 Jan 2016", "title": "Mental Health Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2+ months. I interviewed at Creative Support (Manchester, England)", "Interview Descriptions": "group interview  with lots of written exercises  than more in depth group discussion after dinner\r\nyou were put into the groups which you applied for i applied for mental health  or learning disability \r\nmental health we were asked questions on our field   which we new   at the end of the group interview you were told that you would recive a letter to say you would be invited for a second interview at one of the projects or you have not  got the job i was one of two people who got through to the second interview and we were both hiredthat was 2007 am i still at creative support after more than 8.5 years", "Interview Questions": "what would do if you saw a service user being abused by one of the staff what course of action would you take  all this is to be written down ask as many questions you can but read your mental capaity act and sova  before going to the interviews  i belive they have changed the interviews a little since mine  but still read as much about your chosen subject as possible and ask for feedback on the interview "}, {"date": "16 Apr 2016", "title": "Graduate Development Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Creative Support (Manchester, England) in Nov 2015", "Interview Descriptions": "A long winded application form which took time and dedication to complete. Shortlisted to group interview, which would then be followed by a 1:1 interview.\nThe group interview was very bizarre. Initially, there were questions to be answered on paper, roughly 5, which were related to the role. \nAfterwards, they asked us to debate 6 questions in an hour and it was up to us as a group to ensure we times the questions well.  \nThe interview was an intense couple of hours.", "Interview Questions": "N/A"}, {"date": "24 Aug 2015", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Creative Support", "Interview Descriptions": "group interview first which rules out a lot of suitable and good candidates who may just not be good public speakers.  Interview questions very difficult and at times irrelevant.  Individual interview focussed on strange questions.  Service user input into the individual interview appears to be a very tokenistic approach.", "Interview Questions": "person centred"}, {"date": "3 May 2016", "title": "Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Creative Support (Manchester, England) in Aug 2015", "Interview Descriptions": "An informal discussion followed by two interviews. One with HR manager and director. \r\nThe second interview was with the CEO and HR manager. The 1st interview had approximately 10 - 15 questions. The second interview was more of a discussion and an opportunity for the CEO to meet me.", "Interview Questions": "I found the interview a bit strange. The questions asked were more what I expected for a Registered Manager or home manager. \r\nQuestions on managing staff, medication discrepancies."}, {"date": "16 Jun 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Creative Support (Manchester, England) in Jun 2015", "Interview Descriptions": "Group interview-see how you interact others-group discussion-sanarios test \r\nIf successful after this stage you go for a interview with manger of the project you are going to work at. Usually Find out on day if sucsessful on second interview", "Interview Questions": "How do recognise abuse?\r\nHow Would you react to...\r\nEqual opportunity question\r\nHow to diffuse a situation \r\nComplaining question"}, {"date": "23 Apr 2015", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Creative Support (Manchester, England)", "Interview Descriptions": "Group interview then individual interview, idea right but i don't see how you can be assessed in a group of 12 people all trying to talk over each other.  Individual interview was straight forward enough", "Interview Questions": "Why work for Creative Support"}, {"date": "11 May 2016", "title": "Senior On Call Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Creative Support (Manchester City Centre, England) in Feb 2015", "Interview Descriptions": "Excellent interview process, relevant questions, none judgmental I have a disability and they were very understanding and supportive. They gave me an option to ask any questions and made the interview as relaxed as it could be. I was interviewed by a Director Debbie Craddock and a Team Leader, they made me feel at ease and were clearly experienced.", "Interview Questions": "Please tell me your experience"}, {"date": "15 Feb 2016", "title": "Relief Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Creative Support (Telford, England) in Jan 2015", "Interview Descriptions": "Professional and fair. It felt like a good attempt to assess your attitude and values which is absolutely essential for care and support work. It was a welcoming environment and I felt like the interview had a good variety of ways of assessing for job suitability.", "Interview Questions": "Why want the job and why suitable. Career ambitions. Situational scenarios i.e. family disputes, attitude to changes in the routine of a service users. How respect dignity. Communication. Equal opportunities questions. Relevant experience. Group activity."}, {"date": "14 Mar 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Creative Support (Manchester City Centre, England) in Jan 2015", "Interview Descriptions": "There was a group interview first with around 12 participants. We were split into smaller groups and had to discuss how we would act in certain situations.  After successfully passing this interview there was an individual panel interview. the individual interview asked standard interview questions such as what are your strengths, why do you want this job, tell us about a time when.. etc.", "Interview Questions": "Why do you want this job?"}, {"date": "16 Jan 2015", "title": "Community Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creative Support in Dec 2014", "Interview Descriptions": "People in interview and test room seemed OK but the person who originally invited me for an interview after reading my CV, then decided that although I have had over 15 years experience as a Home Carer, being a Carer was \"probably not for me\".\r\n\r\nArrogant amateurish and comical beyond belief.", "Interview Questions": "Most questions were a bit difficult for me as I have not been through the process of seeking work for many years and this was all a bit new to me.\r\nWas a question about helping people with Downs Syndrome which caught me by surprise..."}], [{"date": "1 Jun 2017", "title": "Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Creative Support (Scunthorpe, England) in Feb 2014", "Interview Descriptions": "a panel of three senior managers (one of whom used to do the role). Panel style questions and an assessment.  there were around 10 questions, positive prompts and support, i then heard back straight after offering me the role. I was contacted by phone to book the interview and was kept in the loop throughout dbs checks and so on.", "Interview Questions": "safeguarding/managemnet style/preparing for inspections"}, {"date": "9 Mar 2016", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Creative Support (Warrington, North West England, England) in May 2013", "Interview Descriptions": "Very pleasant people interviewing made to feel comfortable throughout. Allowed time to think and answer. Knowledgeable panel all queries answered. Lots of information given about job and expectation of staff. Went to a group interview then was Asked back for individual interview", "Interview Questions": "Why I wanted the job"}, {"date": "13 Nov 2014", "title": "Office Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Creative Support (Leeds, England) in Jul 2012", "Interview Descriptions": "Agency contract that was converted from temporary to permanent post once funding confirmed. I was advised at short notice that post was available but there would be a change to working arrangements and time split between locations not easily accessible by public transport. Interview details sent to work email address whilst I was on on leave and only found out on return to work with less than an hour's notice!", "Interview Questions": "N/A"}, {"date": "4 May 2015", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Creative Support (Blackpool, England) in May 2011", "Interview Descriptions": "very basic group interview was left down stairs for an hour\r\nsat with a lot of other staff who were being interviewed and we all thought then what type of company is this as were lefty downstairs for an hour then we were interviewed by some senior support worker in a cap and the area manager", "Interview Questions": "basic stuff"}]]