[[{"date": "2 Jul 2022", "title": "Staff Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UNITE HERE", "Interview Descriptions": "After a great Interview I was asked to come in for a day long “test” that was unpaid and featured numerous fictional tasks that involved engaging actual businesses and vendors.  I’ll confess it was off-putting and the fact that it was essentially voluntary seemed inappropriate for a Union (I’m from a 3 generation union family).  Afterwards I spoke with a senior member of the Union who told me it everyone does it and it’s a test of “humility”.  I was also told that if I wouldn’t be getting an offer I would hear nothing.  The whole thing struck me ver unprofessional.", "Interview Questions": "Honestly it seemed like a loyalty test "}, {"date": "8 Mar 2019", "title": "Data Entry Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNITE HERE in Oct 2018", "Interview Descriptions": "The process was very simple and great. Had to take a Microsoft Excel and simple math test. During the interview, there were over 5 managers some in remote locations. It was a very easy process, most of the questions were referring to previous experience. Overall it was simple and very direct. Until today no word if I was decline or got the job or not. The only response I get, the managers still haven't decided yet. Very unprofessional.", "Interview Questions": "What do you know about United here?"}, {"date": "11 Jun 2018", "title": "Campaign Researcher Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNITE HERE (Chicago, IL) in May 2018", "Interview Descriptions": "I found a listing for Campaign Researcher in Chicago and submitted my resume and a thoughtful cover letter. Two weeks later, I was invited to have a phone interview, and I felt like it went really well. I was told that I would hear about their decision by next Wednesday regardless. I heard nothing, despite having reached out with a thank you and follow up information. On Monday of the following week I recieved an email asking me come to meet this Wednesday. I said yes, and asked for more information, excited that they decided to continue me in the hiring process, since it seemed like an important and exciting organization. \r\n\r\nHowever, when he called me he told me that I did not have enough campaign and research experience for the position, but wanted to meet me about a apprenticeship program. I expressed gratitude for his honesty and interest in connecting me with the program.  I told him was hesitant at the word apprentice as I am looking for full time professional work, but wanted to hear more in advance. He revealed that as a “campaign apprentice” I would work get a hospitality job and organize my coworkers, basically being a low-wage plant with two jobs, one of which is extremely risky and the other which seems to be unpaid labor. \r\n\r\nTo me, this feels like a total bait and switch. I regret the time that I spent learning and writing about Unite Here. While I enjoyed my phone screening, this is a manipulative and hypocritical recruitment tactic. Just be honest about what you are looking for! At least from the beginning of the phone call. This was very disappointing, and gives me a less hopeful view or the organization.", "Interview Questions": "N/A"}, {"date": "13 Nov 2018", "title": "Campaign Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNITE HERE (Los Angeles, CA) in Apr 2018", "Interview Descriptions": "I was contacted by an senior organizer based in San Francisco for an initial phone screening. Then, contacted by a Los Angeles organizer for another phone screening. I was given a writing exercise and then asked to come in for an in-person interview with a group. \r\n\r\nThe in-person interview was not particularly hard. They had a list of questions and made sure to go through all of them. I quickly realized that it wasn't going to be a good fit personality and culture-wise. I found one of the interviewers to be pretty rude from the beginning, but it might have just been their interview tactic to see how I reacted under pressure. Nonetheless, I found it unnecessary. \r\n\r\nUNITE HERE is a labor organization that prides and promotes itself as a radical, militant union that represents mostly immigrant women of color. What I found strange was that I was interviewed entirely by white people. They were transparent about the fact that their main goal is to build their membership and that they are hierarchical meaning you're expected to execute orders from above and not push back. \r\n\r\nThey're not really at the vanguard of movement-building so I'd suggest to look elsehwere if you're seeking more mind-expanding work. They seem like a good training ground, though.", "Interview Questions": "How would you feel about having to canvass for a Republican candidate the union has endorsed? "}, {"date": "13 Feb 2018", "title": "Organizer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNITE HERE (Boston, MA) in Jan 2018", "Interview Descriptions": "Posting for position was very misleading, turns out you don't work for UNITE HERE at all. Rather, you need to get hired by a hotel, restaurant, etc. and work to recruit people to UNITE HERE union. I'm not into doing unpaid labor, so I didn't accept the offer. Basically, you're expected to work for UNITE HERE while also working for another company and recruiting people to the union while not being paid by UNITE HERE and risking your job security at the company you work for. DO NOT BE FOOLED BY JOB POSTING.", "Interview Questions": "What social movement are you passionate about? "}, {"date": "8 Jul 2016", "title": "Campaign Researcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNITE HERE in Jul 2016", "Interview Descriptions": "I spoke to an HR representative who asked about my interest in labor unions and social justice. I was also asked about my background in research and my ability to manage competing deadlines. It was a pretty standard screening interview.", "Interview Questions": "Describe an organizing experience, describe your background in research"}, {"date": "24 Dec 2015", "title": "Campaign Researcher Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNITE HERE", "Interview Descriptions": "The interview was very laid back. They asked a lot of probing questions regarding my political and personal philosophies. It felt less like an interview and more like a conversation with friends. The interview format itself was fantastic, unfortunately, it took them until the end of the interview process to ask me to remind them which position that I was applying for. When I told them, they told me that they weren't actually hiring for this position (nor were they aware that they had that position available) although I had seen advertisements for that position an hour before going to the interview, and again an hour after returning home. \r\n\r\nThen they told me that the position that they were hiring for was to actually go into these locations that are known to have tough and potentially dangerous working conditions, work for those companies, build trust of the other employees, encourage them to unionize, then volunteer for the labor union for an additional ~20-30 hours per week gratis. They weren't interviewing me for a job, they were interviewing me to give up my current job to *volunteer* for them.\r\n\r\nThis was a total *bait and switch.* As a union, their function is to fight against unethical situations  in the workplace... yet their own hiring practices are deceptive and unethical. This is a shame, because they really do seem to be involved in good work that aligns with my core values... but 2 wrongs definitely don't make a right, no matter how you slice it.", "Interview Questions": "What motivated you to apply for this job?"}, {"date": "3 Dec 2015", "title": "Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNITE HERE (Dallas, TX)", "Interview Descriptions": "It was informal. I got hired through the AFL-CIO apprenticeship program so I had no actual sit down interview. Basically they just put me on the job for 5 months and hired me on at the end. It was a little bit sink or swim but the other organizers helped me out. The job is really tough and you have to be committed to workplace justice or it won't work for you.", "Interview Questions": "N/A"}, {"date": "28 Jan 2014", "title": "Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UNITE HERE", "Interview Descriptions": "Phone interview, then in person shadowing of an employee, and finally an interview with a high ranking superior on the phone.", "Interview Questions": "None.  Pretty standard questions."}, {"date": "12 Dec 2012", "title": "Organizer Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNITE HERE", "Interview Descriptions": "Wonderful organization. However, the jobs that they post do not exist. I reposed to a post that said they had a organizer position open. I had a phone interview that was very basic and then was brought in for a interview. They then told me that the potions were posted just to see who in the area shows interest in the organization. The job opening they posted does not exist. They then asked me to volunteer for an unpaid internship. The labor movement in wonderful and I may end up working with them anyway. But, I am very turned off that their recruiting method is to \"trick\" young job seekers into applying for jobs that do not exist.", "Interview Questions": "Wanted to know a lot about my political philosophy. "}]]