[[{"date": "17 Nov 2022", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "For the soft questions, I had an amazing panel interview with challenging questions that tested if I knew the material I was going to tutor. Also, took a test afterwards and passed it to show I was academically prepared.", "Interview Questions": "Can you teach us something from Physics?"}, {"date": "15 Dec 2022", "title": "Full-Time Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valencia College (Orlando, FL) in Nov 2022", "Interview Descriptions": "15 Minute 10 minutes of lecture 5 minutes of questioning Questions consisted of how you would handle teaching, students who were failing and how you feel about racial disparities. It was intimidating as a panel was there to review your work and how you answered questions. I recommend practicing interview questions and knowing your lecture inside and out.", "Interview Questions": "How would you handle a student who was failing?"}, {"date": "15 Oct 2022", "title": "Program Corodinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "Video interview. Interview was conducted over zoom. Connection was great. Felt very comfortable. Was asked basic question about my field and where I would fit in this position. Would recommend.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "7 Sept 2022", "title": "Assessment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL) in Sept 2022", "Interview Descriptions": "Zoom interview panel. The first interview was a lady that conducted a written test on writing a proper E-mails based on a scenario they gave. Then shortly after I had a panel of 6 people from almost every Valencia college location. I forgot to add they called me to set up the Zoom interview  so make sure you answer you phones.", "Interview Questions": "What does diversity and inclusivity mean to you?\nHow have you muti-tasked?\nHow have you worked alongside technology?\nDo you have any questions?\nHow do you work accurately and precisely?  \n"}, {"date": "10 Jun 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "Friendly, open interview process with a small committee of employees.  Be prepared to talk about your experience and how it applies to higher education.  Creativity is highly valued, as is openness to new ideas and approaches.", "Interview Questions": "What does diversity mean to you?"}, {"date": "28 Mar 2022", "title": "Part-Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valencia College", "Interview Descriptions": "Great interview experience with two of the deans at Valencia. One was from East and the other one was from West campus. Both had great feedback, and the overall process was easy.", "Interview Questions": "Q) How would you contribute to the position. "}, {"date": "7 May 2022", "title": "Coordinator, College Transitions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valencia College (Kissimmee, FL) in Mar 2022", "Interview Descriptions": "Communication from HR and from the hiring team was prompt, courteous, and friendly. The interview was smooth and the questions were posted in the Zoom chat as well ask asked out loud, which as a visual learner I really appreciated.", "Interview Questions": "What would other people say are your weaknesses as an employee?"}, {"date": "22 Feb 2022", "title": "Member Of Technical Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "Two interviews with the team. It's a good opportunity for them to get you and also for you to get to know them a bit more and learn about the culture of your department/team.", "Interview Questions": "Describe a professional achievement that you're most proud of."}, {"date": "2 Nov 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "Was invited for a Hirevue interview. \nThen was reached out to for an interview with 3 employees through Zoom.\nWas then asked to provide references.\nOverall, a lengthy process. Applied late May, signed the offer letter in August and started working at the end of August.", "Interview Questions": "How do you handle multiple tasks simultaneously? "}, {"date": "19 Apr 2022", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valencia College in Nov 2021", "Interview Descriptions": "Applied online and then received an email for a one-way interview, which already is a bit of a red flag since you don't get to communicate with anyone. E-mailed HR a few later since I hadn't heard anything and a few days later I received a pretty general rejection email.", "Interview Questions": "What makes you the ideal candidate? \nIdeal work culture?\n"}], [{"date": "9 Jul 2022", "title": "Manager, Laboratories Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valencia College (Orlando, FL) in Jul 2021", "Interview Descriptions": "Initial video interview  where you record yourself answering general questions, followed by two more additional separate “quizzes” that took 30min each to complete within the work week( very short notice and difficult for those of us already working full time), and then a final video interview with a panel of science professors. All of the quiz questions I’m pretty sure were not even reviewed before the final interview. Complete waste of applicant’s time.", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Apr 2021", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "The interview process was very straightforward.There were two parts. The first was an online screening. You record yourself answering questions and it is timed. The second was in-person. It required presentation and panel-style questions. Questions were very typical; tell us about yourself, why this role, and situational based questions.", "Interview Questions": "Tell us about yourself\nWhat would you do if...\nAsked about the experience working in diverse environment"}, {"date": "1 Apr 2021", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Valencia College", "Interview Descriptions": "I was tasked to review a writing sample and simulate a tutoring scenario. I needed to be able to describe which areas were my more immediate concerns and which were more lower-level concerns", "Interview Questions": "They asked why I wanted to work at the specific campus I applied to"}, {"date": "25 May 2021", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Valencia College (Kissimmee, FL) in Mar 2021", "Interview Descriptions": "They use an app to record your interview. The candidate can have multiple attempts to practice with similar questions. When you feel confident, access the real questions and record your answer in a video clip. Easy to use.", "Interview Questions": "Are different for each candidate and related to trends in higher education."}, {"date": "21 Feb 2021", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL) in Feb 2020", "Interview Descriptions": "A lot of questions over 20 of them. Three people were asking by turns. For most of the questions, it’s not related to the job. Kind of annoyed because it took almost an hour for an admin position", "Interview Questions": "Strength and weakness, how to overcome"}, {"date": "29 Mar 2022", "title": "Student Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL) in Nov 2019", "Interview Descriptions": "Interview was smooth and to the point, interviewer went into detail about job responsibilities and expectations. Most questions involved what I learned in related classes, where I see myself in 5 years, and how I would aid their team in student success.", "Interview Questions": "How will you apply the knowledge gained in your coursework to this position? "}, {"date": "6 Oct 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College", "Interview Descriptions": "Large panel interview, very intimidating, lots of stares, questions laid out on paper in front of you, each panel member ask you a question last about 20 min. Some people very friendly, others super intimidating. Questions did not really make sense for the position.  It took place in executive office conference room in the afternoon", "Interview Questions": "Describe a time where you handled a budget"}, {"date": "2 Jul 2021", "title": "Answer Center Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Valencia College (Orlando, FL) in Oct 2019", "Interview Descriptions": "I had to send emails, be there in person to get the address, in the interview everything was very professional and easy. I got an offer but I refused.", "Interview Questions": "What were my previous professional experiences?"}, {"date": "10 Apr 2022", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL) in Sept 2019", "Interview Descriptions": "I had to take a chemistry test for this position. It was very basic one if you are a science major.  The interview was a fair game. They contacted me after finishing all the interviews.", "Interview Questions": "They asked about my major.\r\nThey asked why I picked this position.\r\nThey asked me what I am planning to do for the future. "}, {"date": "16 Jul 2019", "title": "Student Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL) in Jul 2019", "Interview Descriptions": "computerized process that takes 30 min for you to answer. You will have to look into your camera and read the questions and focus on the time while answering questions. it is a bit much to have to focus on. you cant see anyone", "Interview Questions": "describe how you dealt with a difficult situation"}], [{"date": "21 May 2019", "title": "Professor Music Industry Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL) in May 2019", "Interview Descriptions": "After applying I received an email saying I was selected for an \"interview.\" But it was a computerized screening where I had to talk to the webcam. It was so dehumanizing and impersonal I decided not to go any further. If this is how they treat applicants, they don't deserve to hire good people. There is no excuse for this kind of treatment; I put a LOT of time and thought and care into my application and I deserve to talk to a PERSON, not a computer.", "Interview Questions": "What is your background blah blah."}, {"date": "13 Mar 2019", "title": "Assessment Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "I was called to schedule an interview about a week after I applied. The interview was actually a really enjoyable experience - the interviewers were super friendly people who genuinely seemed interested in my background. I was given a list of questions and we went down the list and I gave them my answers to each. I then asked them some questions about the position. I got a call back a week later and they said that unfortunately I wasn't a good fit for this position but that they would keep my resume in case another position opened up in the department I had more experience working in. Very friendly people.", "Interview Questions": "Tell us about a time you had to confront a client/customer in order to enforce a policy at your current position."}, {"date": "25 Oct 2018", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "First I had to take a 15-min written test alone in a room which involved some math. The interview was held in a room and three employees in the department interviewed me. No other applicants present. There was a list of questions I had to answer.", "Interview Questions": "What are three words to describe yourself? "}, {"date": "15 Oct 2018", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valencia College", "Interview Descriptions": "Online interview through Hireview. Hireview was five questions in which to record your answer, questions were about personal experiences with events. Sixth question was a written portion to come up with a timeline and budget list for an event. 10 question interview in person with committee.", "Interview Questions": "Q: Give an example in how you've personally dealt with diversity in a professional situation."}, {"date": "14 Aug 2018", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valencia College", "Interview Descriptions": "The interview process was long (but that's always the case in higher education). First I had a hirevue with 3 questions and an essay, then I had a panel interview, then I had a one-on-one interview with my potential supervisor.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "29 Oct 2018", "title": "Talent Acquisition Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valencia College (Orlando, FL) in Aug 2018", "Interview Descriptions": "I applied online for a Recruiter - Talent Acquisition position and after one week, I received a link for a digital interview (Hire Vue). I did it after 5 hours and I have never heard back from them.", "Interview Questions": "What was the most difficult hiring process I had in my career"}, {"date": "16 Mar 2018", "title": "Program Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valencia College (Orlando, FL) in Feb 2018", "Interview Descriptions": "(East Campus) There was two interviews. The first one required a presentation & on the final round of interviews on a different day, the academic dean was present. They said they would notify us at the end of the week if we got the job or not however that wasn’t true because I never heard anything back, not even a rejection letter from HR. It was a waste of time & unprofessionally handled. They began calling job references before the final interview which was odd because usually that isn’t done until a potential offer is being extended.", "Interview Questions": "What’s your experience with diversity?"}, {"date": "22 Jul 2021", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valencia College (Orlando, FL) in Jan 2018", "Interview Descriptions": "Most interviews regardless of title in administrative roles will put you through a HireVue video recorded interview. There are no retakes and then if you are selected for a second then there will be a panel interview up to 5 people with about 10 questions. And a 3rd interview maybe with the supervisor and dean over the department. Could be a little stressful if you aren’t prepared for the panel interviews but not to bad when you know there is one. Just always remember you give attention to throughout to everyone and greet everyone individually has always been a good rule of thumb before COVID-19 but definitely try to remember everyone’s name.", "Interview Questions": "What does diversity mean to you and how can you apply it in the academic setting?"}, {"date": "15 Dec 2017", "title": "Program Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Valencia College (Orlando, FL) in Nov 2017", "Interview Descriptions": "The same as the previous person's post. You apply and if you're selected, you do an digital interview with HireVue. It is an online recorded interview with several questions and two to three answer responses. A few of them have writing responses but that you can do from your mobile device or computer with keyboard. If you pass the online interview, there is the in-person interview which is held with a panel of at least 10-12 people. The interview was 30 minutes long and a presentation was required with learning objectives and outcome of those objectives.", "Interview Questions": "What are some of the challenges students face while in college? "}, {"date": "13 Oct 2017", "title": "Campus Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College", "Interview Descriptions": "Submitted application and received email days after closing date inviting me to record a video interview. Recording a video interview is not easy as it adds an extra layer of anxiety.", "Interview Questions": "Three to four questions. Questions anywhere from how would you do ______ to tell us about a time when you ______. "}], [{"date": "30 Nov 2017", "title": "Coordinator, Program Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Valencia College (Orlando, FL) in Oct 2017", "Interview Descriptions": "After the application process, if you are selected for an interview, you will have to do an online recorded interview with several questions and two to three answer responses. If you pass the online interview, there is the in-person interview which is held with a panel of at least 10-13 people. The interview was 30 minutes long and an interactive session/presentation is required at the beginning. You are given a prompt in order to be able to hold the interactive session/presentation.", "Interview Questions": "For the online interview, tell me about yourself."}, {"date": "13 Aug 2017", "title": "Professor Full-Time Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Valencia College", "Interview Descriptions": "Applied and did not even get an interview. Re-applied less than 6 months later (I changed my resume and essay questions lately, but neither my experience nor education change during this time) and received an e-mail invite to complete an online asynchronous video-recorded \"interview\" by HireVue. This invite was nearly FOUR MONTHS after I'd applied. Flexible timing for completing this task. Dressed business appropriate from waist up. Broad, predictable interview questions were posted on the screen and you were given a time limit to answer. Three questions probably took less than 15 minutes.  \n\nWithin a week, received an email to come to campus for an interview.  Interviewed by about 10 people, mostly faculty, some administrative, including the dean. They interviewed them selves briefly and then took turns asking me predetermined questions which they thankfully also printed out and put in front of me. Beforehand, I was told to prepare a 5-minute teaching presentation on a specific topic. Valencia's interview process makes it clear that their goal is to hire those who will be creative & interactive in the educational experience. So, be original & include your interview panel in whatever you do, pretending they're your students. It's unnatural... but it got me to the next level. \n\nWithin a week or so, I was invited for a final on-campus interview with the dean & the president of that campus. I was told that there were still many candidates and to prepare a 5-minute presentation on any topic.  I was told I could use the same topic as in my prior interview since the president hadn't seen it. Knowing the dean had seen it, however, I chose another topic & a completely different interactive experience for them.", "Interview Questions": "Weaknesses?"}, {"date": "18 Aug 2017", "title": "Staff Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valencia College (Orlando, FL) in Aug 2017", "Interview Descriptions": "Panel Interview with 3 people from the office. About 30 minutes long with 11-12 questions. The atmosphere was professional but welcoming. Make sure you have questions to ask them once the interview is over. That's very important.", "Interview Questions": "What is your experience with diversity?"}, {"date": "30 Aug 2017", "title": "Accounts Receivable Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL) in Aug 2017", "Interview Descriptions": "It took almost two months to be contacted after online application. First step, was Hirevue interview where you record the answers of questions then the next step is a panel interview of 5 people within the accounts receivable department. Overall, was a great experience, I will keep applying.", "Interview Questions": "Why valencia? Tell me about your experience? Do you think your a good fit? Where do you see yourself in 5 years? Why the tennis ball has fuss on it? "}, {"date": "6 Aug 2017", "title": "Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "Slow process as you move from online video interview which was very easy to am in person interview at the Orlando campus.   Panel of twelve people which is overkill.  It was obvious that the person who interviewed before was well known as laughter and jovial sounds came from the room.  when I entered,  the atmosphere deflated.   Softball and sometimes silly questions from this group and a presentation that went over their heads.  When there is an inside hire,  you should be told there may be an inside hire.   Everything else is a waste of time.", "Interview Questions": "What have you done to make yourself an expert in your field?  "}, {"date": "13 Jun 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valencia College", "Interview Descriptions": "I was brought into an office-ish room with a whiteboard in the back. I was interviewed by 2 supervisors and they asked about 10 questions. Most of the questions were situational or personality type of questions (if that makes sense). At the end of those questions they asked me to pick a math problem from a slip of paper and teach them as if they were students. The problems on the slip of paper went from Intermediate Algebra (I think a little before that) to Differential Equations.", "Interview Questions": "When was the last time you tutored / assisted someone in math?"}, {"date": "26 Oct 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL) in Jun 2017", "Interview Descriptions": "The application process consisted of an online application, including essay questions, recommendations, etc. The initial screening interview was conducted through an online HR platform, which consisted of a digital interview (recorded and timed) to a set of pre-selected questions.", "Interview Questions": "One of the questions I was asked was to describe my experience with diversity and inclusion."}, {"date": "2 Jun 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL) in May 2017", "Interview Descriptions": "I applied online was received a call for an interview withing a week. The interview was scheduled for 2 days later. Before the interview, there was a 30 minute written prompt, which was actually 3 administrative \"tasks\" to complete. After, there was a panel interview with 4 people from the department.", "Interview Questions": "Describe a time when being a multi-tasker worked for you and one where it worked against you."}, {"date": "6 Jun 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valencia College (Orlando, FL) in Feb 2017", "Interview Descriptions": "Applied in January 2017. Received an invitation to complete the HireVue recorded interview within 2 weeks. Received an email from the VP of the department to schedule an in person interview. Interviewed with a panel of about 4 people. Very nice, attentive people. Typical interview questions but also very tailored to how I would handle different scenarios. Received a call from HR within a week with an offer. Side note: all offers have a negotiable range. The person who called me originally offered the lowest end of the salary range. I counter-offered for the higher end and she said she only had permission to go up to 3k more from the original offer. I stayed firm and she said she would have to call me back. The following day, she called back with a new offer 1k less than my request, which I of course accepted. So always negotiate!", "Interview Questions": "Tell us about yourself. "}, {"date": "9 Dec 2016", "title": "Graphic Designer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valencia College (Orlando, FL) in Nov 2016", "Interview Descriptions": "A group meeting. Not too exciting like a typical interview about yourself and show your work. Then they ask you a few questions about your past jobs and what skills will you bring to the table if you do start working.", "Interview Questions": "What type of web work did  you do?"}], [{"date": "30 Nov 2016", "title": "Graphic Design Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valencia College (Orlando, FL) in Nov 2016", "Interview Descriptions": "You are sitting in a room with a view people around you asking some basic questions about your skill self and your personal self, ask to see your work, and talk about your job experience.", "Interview Questions": "What inspires you, did you do any video editing, what's your process. "}, {"date": "16 Oct 2016", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valencia College (New York, NY)", "Interview Descriptions": "Online application and then an interview with the supervisor and another employee. They were both very nice. I was quizzed in Excel and in writing an email and then I did the one on one interview.", "Interview Questions": "Where do you see yourself in 5 years? When do you feel the most accomplished? Was quizzed in Excel. "}, {"date": "11 Aug 2016", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Valencia College", "Interview Descriptions": "Talk about your resume and your previous math courses. Discuss your personality and what you're interested in. Discuss some of your skills in math, and what makes you want to be a tutor, and how you might be able to hand a situation where you have multiple students asking multiple questions at the same time.", "Interview Questions": "What are your grades in your math classes? Show transcripts."}, {"date": "8 Aug 2016", "title": "Staff Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "Panel/Group interview with about three people, two typicaly from the department you will be in and one from a different department. Applied online. Found opening through indeed but many are posted on the Valencia website.", "Interview Questions": "Tell me a little about yourself."}, {"date": "1 Jun 2016", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "Lengthy interview process including an on the spot writing sample, panel interview/presentation, and more. Be prepared to spend several hours on site for the final steps of the selection process. You will be presented with behavioral interview style questions as well as skills/knowledge check questions. Depending on the department you are interviewing for you may be asked to provide work samples or a presentation of your skill set.", "Interview Questions": "What is your personal philosophy?"}, {"date": "8 Jun 2019", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL) in Jun 2016", "Interview Descriptions": "Panel interview with 4 members of management. Each interviewer asked two questions. The questions were printed out and given to me to read from as they were being asked. No pressure.", "Interview Questions": "Tell me about yourself."}, {"date": "13 Jun 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL) in May 2016", "Interview Descriptions": "Applied online. A week later I received an invite to completed the Hirevue interview. After submitting the Hirevue video, I received a call for an in person interview. The following week, I completed the in person interview which was fairly easy, the questions referenced to my experience, educational background, philosophy and diversity. Shortly after, I was notified that they wanted to move me forward to the final round of the interview. Completed the final interview, which was easy. The questions were more situational and they wanted to see how quickly I could think on my feet. Shortly after, I was offered the position. The process moved quickly which was great!", "Interview Questions": "Tell me about your experience with diversity?"}, {"date": "6 May 2016", "title": "Functional IS Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL) in Apr 2016", "Interview Descriptions": "First interview was a one-way, 30-minute digital interview with six questions including one written via a company called HireVue who specializes in video interviews. Your interview is recorded and can be viewed by multiple people. You have 20-30 seconds to think about what you want to say and then two minutes to answer. You do not have to use the entire time. For the written question, 15 minutes was allotted to answering a question about developing and maintaining technical documentation. Second interview was 30 minutes in person with a committee of six who took turns asking 10 questions, which were also taped to the table. Most of the questions were situational.", "Interview Questions": "This position requires you to handle multiple tasks/projects at one time. Tell us what criteria you use to prioritize tasks/projects. Why?"}, {"date": "13 Apr 2017", "title": "SGA Chief of Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Valencia College (Orlando, FL) in Apr 2016", "Interview Descriptions": "The review and interview process was painless and simple, and didn't require much work on my end. I found it to be in my best interest while doing it to take my time, and even then the whole process took only about an hour. Painless, Efficient, and didn't take too much time!", "Interview Questions": "What is your outlook on the future of education?"}, {"date": "15 Mar 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College", "Interview Descriptions": "LONG. Be prepared to have up to three interviews for ANY position you apply for. There were many folks in the panel and some were kind but most had the meanest look on there face. Get prepared because that will speak loudly later on.", "Interview Questions": "Very organized questions, typical example approach."}], [{"date": "12 May 2016", "title": "P/T Enrollment Services Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valencia College (Orlando, FL) in Mar 2016", "Interview Descriptions": "Six member panel interview - supervisors and potential co-workers.  A sheet of paper with the same set of questions to be asked of all candidates were taped to the table in front of me.  More stressful than I expected for a part-time position.  Unfortunately, I was relatively new to job-seeking after a long tenure at my previous employer, so I was not as prepared/equipped with interview skills as I should have been.", "Interview Questions": "Is it better to be perfect and late or good and on time?"}, {"date": "4 Mar 2016", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College in Feb 2016", "Interview Descriptions": "I applied for the position on their website. I received an email notification that my application was received. Three weeks later I received an e-mail stating that I was selected for a video interview. It was through a company called HireVue. It was a one way video/audio interview that lasted 10 minutes. Two weeks later I was notified that I was not selected to move further along in the process.", "Interview Questions": "The asked me a total of five questions which I was allotted two minutes to answer. It was extremely stressful."}, {"date": "16 Nov 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Valencia College", "Interview Descriptions": "You had to have a masters degree to be considered for a position and the interview were in 3 stages. Once you pass the 1st screening the director will call you for a phone interview. The third interview is a meeting with dean and director. I liked the interview, was asked a few questions", "Interview Questions": "How would you handle a situation if a student does not understand a topic?"}, {"date": "28 Nov 2015", "title": "Lab Assistant II –Biology Lab Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL) in Nov 2015", "Interview Descriptions": "I had applied online through their website, where I made an account. It took about 2 weeks to process the document and asked for my transcripts. I got an email that the interview would take place on Nov 6, 2015. In addition that the interview was divided into 2 parts: a writing sample (approx 30 minutes) and a formal Q & A interview with committee members (approx 30 minutes). The written part was testing your basic math and knowledge on general chemistry and biology done on the computer. The second part had 4 committee members asking me 4 questions and gave me to ask questions about the college and position.", "Interview Questions": "Q and A formal interview: When are you available and when can you work (eg morning/ evening/ days/ time)? What instrumental have you worked with and list them? What was a difficult situation you have experienced and how did you handle it?  "}, {"date": "19 Dec 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL) in Aug 2015", "Interview Descriptions": "Was invited to come interview in person almost immediately after submitting application materials (within same week). Gave a \"mock lesson\" to the deans present; answered questions about availability and classroom management skills. I felt over-prepared for the interview.", "Interview Questions": "Why do you want to teach at a community college?"}, {"date": "19 Aug 2015", "title": "Faculty Developer/Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL) in Aug 2015", "Interview Descriptions": "The application is submitted online.  The initial interview was via HireVue.  This is a video interview that is a recording of the applicant answering some questions.  I was called a week later for a face to face interview.  I couldn't afford to fly down to Orlando on such short notice (Orlando in August on a week's notice).  They didn't supply any travel allowance for this position, so I couldn't go for the interview.", "Interview Questions": "What in your background, experience qualifies you for this position?"}, {"date": "28 Jul 2015", "title": "Functional IS Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL) in Jul 2015", "Interview Descriptions": "The interviews were a multi step process:\r\n1: Received a phone screening by one of the HR personnel and asked to complete a \"writing sample\" which was more of a logic puzzle. \r\n2: Was asked to conduct a skype interview with 5 persons including a number of team members in the department. This was very professional and the questions were fairly standard mix of technical and business related questions. \r\n3: Was brought in for a face to face interview with the manager of the IT team and the director of the department the IT team supported. Again a very professional interview and the questions seemed more to gauge the fit of the person within the organization rather than technical. \r\n\r\nThe total process took only a couple weeks from initial contact to decision.", "Interview Questions": "Solve the problem:  A park ranger is on an island that will be submerged by flood waters due to the approaching storm.  On the island with the ranger are three items: a bushel of lettuce, a goat, and a wolf.  The ranger has one boat large enough to hold the ranger and one of the three items to make the trip from the island to the mainland.  The problem is, if left alone on either the island or the mainland, the goat would eat the lettuce, and the wolf would eat the goat.  How can the ranger get all three items off of the island and onto the mainland intact, or is this task impossible and if so what item(s) should be saved?  Explain in detail how you came to your decision."}, {"date": "8 Mar 2018", "title": "Facilities Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL) in Apr 2015", "Interview Descriptions": "Video interview was very convenient.  I would have preferred an interview with an actual person, over this type of static, recorded video interview.  But I understand the efficiencies of doing so.  And there was adequate time between question and answer to think about / prepare my responses; actually, more than one would receive in a face-to-face interview.", "Interview Questions": "Describe how your past responsibilities have prepared you for this position."}, {"date": "16 Feb 2015", "title": "International Student Specialist (PT) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College", "Interview Descriptions": "I got call 3 weeks after my application online. I was asked pretty general questions about my background and job requirements. I don't think the interview was particularly hard, but they required 2 references, which I didn't have.", "Interview Questions": "Tell us about yourself. How would you perform in this role?"}, {"date": "21 Mar 2015", "title": "IT Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valencia College (Orlando, FL) in Feb 2015", "Interview Descriptions": "Interviewed by 6 people at one table. They gave me a list of questions, and each person asked one or two. They went around the table asking questions. They did give me the questions about ten minutes prior, so they were not a surprise. Be sure you mention what you learned from your mistake.", "Interview Questions": "SQL questions, errors in previous jobs."}], [{"date": "19 Oct 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL) in Feb 2015", "Interview Descriptions": "It was an easy interview process and did not take a lot of time. Every one is very nice here. I have no complaints about the interview process. Took quizzes about my subjects to see if i was competent.", "Interview Questions": "What are your future goals?"}, {"date": "10 Dec 2015", "title": "Laboratory Aide II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Valencia College (Orlando, FL) in Oct 2014", "Interview Descriptions": "The interview itself was very easy. Mostly just explained what the job was and what it required and gave both pros and cons of the work environment. We mostly discussed computer competency and scheduling.", "Interview Questions": "How comfortable are you around computers?"}, {"date": "19 Sept 2014", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "Concise, direct and very comprehensive interview with department Deans. Review of my relevant experience and interest in teaching. Very professional, friendly, and easy interview. Jobs reflecting my passion were offered and accepted.", "Interview Questions": "N/A"}, {"date": "15 Jul 2014", "title": "Learning Assistant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Valencia College", "Interview Descriptions": "Knowledge of tutoring subject. Gave a demonstration of tutor capabilities. I wasn't nervous because I was comfortable tutoring the subject to the panel. Visual, Kenesthetic, and Auditory learners are out there, so I had to emphasize on teaching them all to create independent learners.", "Interview Questions": "N/A"}, {"date": "3 Mar 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Valencia College (Orlando, FL) in Jul 2014", "Interview Descriptions": "Normally the people interviewing you will ask you pertinent questions about what you would do if faced with a difficult situation, such as a student bad mouthing a professor (you should never ever agree or bad mouth professors along with students), and then they'll have you hold a mock tutoring session where they'll act as difficult students. Some pointers are, never take a student's pencil, even if they throw it at you, etc.", "Interview Questions": "What would you do if a student bad mouths a professor?"}, {"date": "4 Apr 2014", "title": "Mathematics Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "Very straightforward.", "Interview Questions": "Tell me a time when you had a conflict and how did you resolve it."}, {"date": "28 Jan 2016", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Valencia College (Kissimmee, FL) in Jan 2014", "Interview Descriptions": "New hires have to answer some questions about the subject they are trying to tutor. But if you know someone that knows someone then you will most likely get the job.", "Interview Questions": "Varies depending on subject"}, {"date": "12 Apr 2015", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valencia College (Orlando, FL) in Jan 2014", "Interview Descriptions": "Sat in lobby an then called to a office to take a test. Once I completed the questions, I was ask numerous scenarios and what I would do under each situation.", "Interview Questions": "If you saw a sink hole in the middle of the parking lot , what would you do?"}, {"date": "1 Oct 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valencia College (Kissimmee, FL)", "Interview Descriptions": "I applied during an adjunct fair job post. I received an email letting me know details of the fair where we got split up in groups by department. I interviewed with one of the department coordinators, and had to follow up in order to receive my next interview.", "Interview Questions": "Standard academic job questions. "}, {"date": "1 Dec 2016", "title": "Staff Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL) in Sept 2013", "Interview Descriptions": "Once selected for interview - received an email with instructions to interview online via Hire Vue. Once signed in you are able to do test questions/ answers to make you less nervous as this is a video interview in where you are able to see yourself as you answer the questions.", "Interview Questions": "What is your experience working with a diverse group of people?"}], [{"date": "15 Aug 2013", "title": "Building V, Second Floor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "Students are important, Students come first. Mean your business. Get to know people. Diversify your portfolio. Prepare and do not be nervous. Minorities do not put your hopes up. You might get a chance if you apply for the one position that they will release to a minority to cover the bias that is present that Valencia", "Interview Questions": "N/A"}, {"date": "2 Aug 2013", "title": "Audio Visual Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Valencia College", "Interview Descriptions": "Apply online. call you right after. very easy interview. know what AV is.", "Interview Questions": "N/A"}, {"date": "15 Jul 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Valencia College", "Interview Descriptions": "I was contacted by the discipline chair in the department, not someone in HR. I had a short phone interview and then was asked to come in for a face to face. That meeting was an interview, but also a bit of an orientation to the job and the office. I was hired that afternoon. The tone of the interview was casual but professional, and they were more interested in my interest in the job than my experience. I left feeling happy to be a part of the team, and relaxed about my boss.", "Interview Questions": "There was no syllabus for the section that I was going to teach - and I was asked how I'd go about getting that together. Having never taught before, that was a bit of a challenging question."}, {"date": "10 Jul 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Valencia College", "Interview Descriptions": "The interview process always consists of a panel of at least 5 people, usually more.  One person on the committee usually represents HR, while the rest are typically comprised of individuals from the area in which you are applying.  The panel typically gives candidate an opportunity to tell about themselves and then will begin asking questions.  Usually each panel member will ask 2-3 questions. The questions will vary from the standard interview questions to those more specific to the job or division to which you are applying.  Finally, you will have the opportunity to ask questions.  There may be a typing test or writing sample required.  If the committee forwards your name, you will typically be asked to come in again to interview with the head of the department to which you applied.  If selected for the position HR will make the offer, not the people with which you interviewed.", "Interview Questions": "There will be some question about diversity that sometimes takes people by surprise, such as What does diversity mean to you?"}, {"date": "25 May 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Valencia College (Orlando, FL) in May 2013", "Interview Descriptions": "My qualifications as an M.D. was drawn to the attention of the Dean, who was actively looking for someone to teach that particular class.\r\nOnce I presented my qualifications,  I was offered the position. I had taken my resume and a cover letter just in case, and they were added to my application.  There was an online application aspect as well, which I was allowed to fill out whilst I was there on their computer.", "Interview Questions": "No interview as such."}, {"date": "28 May 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Valencia College (Orlando, FL) in Sept 2012", "Interview Descriptions": "Interviews are done by committee, and they are formal and structured.  They have a list of questions that are asked related to the position.  Each committee member asks are question.  There is a preset amount of time as most interviews are scheduled closely together so you need to stay focused and wander off-topic.", "Interview Questions": "They always want to know about your experience with diversity."}, {"date": "15 Aug 2012", "title": "Security Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valencia College (Orlando, FL)", "Interview Descriptions": "Applications must be submitted online.  Be sure to fill out all required questions, or your application is automatically kicked out of the interview candidate pool.  Also, attach a resume and cover letter.  Applications missing a resume are almost always discarded, and no cover letter means an even higher chance of getting kicked out.  For better results, be sure to attach letters of recommendation if possible.  Next, prepare for a lengthly wait while they select candidates to interview.  Almost all full-time positions will require a second interview as well.  After the interview, you can except a phone call the same day or the next if you are selected for a position.  If you are not called right away, except an e-mail in two or more weeks that thanks you for taking part in the interview process....  Last, you will be required to submit to a drug test before Human Resources can formally offer you the position.", "Interview Questions": "Note: All questions will be based upon behavioral interviewing, so Google this and you will get a better idea as to the questions you will be asked.\r\n\r\nDiversity Questions -- You can except EVERY interview to feature a diversity question.\r\n\r\nTell Me Something About Yourself -- This is your time to SHINE, so sell yourself.  Don't sell yourself short by not saying anything...\r\n\r\nTell Me About A Time You Had to Assist A Difficult Customer(Student)\r\n\r\nIf a coworker finds that you made a mistake, what would you want them to do?"}, {"date": "13 Jul 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Valencia College (Orlando, FL) in Jan 2012", "Interview Descriptions": "Group Interview. They held a job fair and interviewed everyone in a class room setting. They went over your transcripts and asked if you had previous experience. It went pretty quickly because they would eliminate you if you didn't have the proper credits for the course you wanted to teach.", "Interview Questions": "What courses did you take in Grad school?"}, {"date": "16 Sept 2014", "title": "Adjunct Instructor of Spanish Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valencia College (Orlando, FL) in Dec 2011", "Interview Descriptions": "It was difficult getting in touch with the administrative assistant of the department at first, but once I did, things moved smoothly.  I met with the dean and a full-time instructor, and they basically just asked me questions about my teaching experience/philosophy.", "Interview Questions": "Questions regarding my teaching philosophy put me on the spot a bit.  "}, {"date": "27 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valencia College (Orlando, FL) in Jul 2011", "Interview Descriptions": "1).  Telephone Interview with HR Recruiter;  2).Telephone Interview with Supervisor;  3).Typing/\r\nWriting/ Research/ Excel Testing on Campus;  4). In-Person Interview with Supervisor & Department Leadership on Campus; 5). In-Person Interview with Supervisor and Campus Personnel on Campus; 6). Fingerprinting and Background Check at another Campus; 7). Drug Testing at Private Facility;", "Interview Questions": "How do you handle working with people and students from diverse backgrounds?"}]]