[[{"date": "8 Jun 2023", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical City Plano (Plano, TX) in May 2023", "Interview Descriptions": "You meet with two employees in the field you are applying for and they ask you a set of questions for about 30 minutes. Then you meet with two supervisors who ask you another set of questions for about 30 minutes. It is pretty informal and relaxed.", "Interview Questions": "Some scenario based. Talk about a time you made a mistake and how you corrected it. Describe a time when you had to be particularly innovative to provide care for a patient."}, {"date": "15 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Plano", "Interview Descriptions": "Easy interview, more like talking to a friend that being interrogated. Basic questions that are very standard in all nursing interviews. Quick turn around time from interview to offer for me, varies by unit and manager.", "Interview Questions": "Describe a time you had a conflict with a patient or family member and how you resolved it"}, {"date": "29 Jul 2022", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Plano (Dallas, TX) in Jul 2022", "Interview Descriptions": "Came in for a panel interview where they had two of your peers and an office manager in the interview they asked a series of questions. What would you do with an angry patient. Tell me a time where you had to deal with a conflict.", "Interview Questions": "N/A"}, {"date": "18 May 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Plano", "Interview Descriptions": "Only a single interview. With department leadership, followed by peer interviews asking the same questions.  Typical interview questions - strengths, weaknesses, situations, etc.. I think it took about 2-3 weeks for me to hear back.", "Interview Questions": "Name a conflict you were in and how you resolved it."}, {"date": "18 Apr 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Medical City Plano", "Interview Descriptions": "Phone call with Manager\r\nVideo call with 2 supervisor, then immediately - \r\nVideo call with 2 more supervisors from another department asking behavioral questions. \r\nThen, wait about 2 weeks to hear back. \r\nBoth video interviews were 1 hour each and back to back- total of 2 hours.", "Interview Questions": "Basic Interview questions. Practice a lot. Look up STAR format questions. Google Behavioral Questions. "}, {"date": "30 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Plano", "Interview Descriptions": "Since I worked as a nurse extern previously on this floor, the recruiter coordinated with my manager for this interview. Interviewed with the manager, assistant manager, and a charge nurse.", "Interview Questions": "What experiences have you had in your clinicals that would be of value to this unit?"}, {"date": "4 Apr 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Plano", "Interview Descriptions": "Was friendly but prefer meeting more staff.  Interviewer was inexperienced at interviewing.  I did like the friendliness of the team.  Would consider employment at later date.  Looking for a critical care position.", "Interview Questions": "Can you Tell me about yourself"}, {"date": "4 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Plano", "Interview Descriptions": "Over the phone with HR then in person with 2 managers and 2 employees. Basic questions about experience and patient care examples. Everyone was personable and welcoming. There were no hard questions, they just wanted to get to know me and my nursing style.", "Interview Questions": "How long have you been a nurse?"}, {"date": "15 Dec 2020", "title": "Nursing Interview Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Plano", "Interview Descriptions": "Easy. They did a phone interview through facetime with the hiring manager and two other nurses. Most of the questions are behavioral. Overall it was pretty relaxed and not stressful.", "Interview Questions": "why did you want to become a nurse"}, {"date": "7 Oct 2020", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Plano", "Interview Descriptions": "first a phone interview then in person interview with 3 of the full time dietitians and the intern. it was a structured interview that I believe all of the Medical City teams use. Series of situational questions \"tell me a time when\"", "Interview Questions": "how do you handle stress"}], [{"date": "7 Feb 2021", "title": "Speech Pathology Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Medical City Plano (Plano, TX) in Oct 2020", "Interview Descriptions": "one interview with two SLPs. it lasted about 30 minutes. A separate interview coordinator set up the time for me. i found out about a week later. I interviewed for acute care.", "Interview Questions": "Tell us about yourself, please. "}, {"date": "4 Jul 2021", "title": "Host/Hostess Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Plano (Plano, TX) in Sept 2020", "Interview Descriptions": "It was simple I met with the super visors answered basic interview questions, and got to talk and get to know them, basically you're hired if they like you and your personality", "Interview Questions": "What is your availability, and can you work weekends?"}, {"date": "24 Sept 2020", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Plano (Dallas, TX) in Sept 2020", "Interview Descriptions": "The whole process from first contact to offer happened very quickly over a few days. I Interviewed with two unit managers over FaceTime and it was very low pressure. The questions seemed to be more behavioral rather than clinically based.", "Interview Questions": "What was your favorite area of nursing when you were in nursing school?\r\n\r\nWhy do you want to work in this unit?\r\n\r\nWhy do you want to work at Medical City?"}, {"date": "10 Nov 2020", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Plano (Plano, TX) in Sept 2020", "Interview Descriptions": "It was okay, interviewed over the phone with one hiring manager. She seemed nice, asked questions about patient priorities.  It didn’t take very long, I thought I did well but didn’t end up getting the job.", "Interview Questions": "Why did you want to become a nurse "}, {"date": "8 Mar 2020", "title": "Certified Sterile Processing Tech Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Plano (New York, NY)", "Interview Descriptions": "Everything went great except that they offered me low rate for  a deep night shift! They moved me from 4:00pm-12:30AM to 10:30pm until 7AM. that was the reason I declined their offer.", "Interview Questions": "what can youTell me about your self ?"}, {"date": "9 Jan 2020", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Medical City Plano in Nov 2019", "Interview Descriptions": "The interview process is hectic and disorganized. You have no control over what areas or units that you are applying for, the recruiters hand out interviews that seem like luck of the draw. The recruiter for McKinney's hospital is notorious for initiating interviews but not confirming them in time, leaving you missing out on an opportunity. (Which has unfortunately happened multiple times to multiple people)", "Interview Questions": "Name a time you had to think on your feet."}, {"date": "15 Oct 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Plano", "Interview Descriptions": "The interview was very relaxed, and the manager was SO NICE. The hiring process was very slow, and required a lot of follow up from my end. But once I got hired on and my dates set up it all went well!", "Interview Questions": "Why do you want to work at Medical City"}, {"date": "3 Aug 2019", "title": "PC Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical City Plano (Dallas, TX) in Jul 2019", "Interview Descriptions": "Very professional and relaxing process.  You meet with a manager, then you also meet with a fellow PCT. Its a very relaxing way to interview with several different people without the typical anxiety.", "Interview Questions": "They keep it relaxed and try to get a sense more of your personality than your resume."}, {"date": "11 Nov 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Medical City Plano", "Interview Descriptions": "Phone interview,  in person with manager, then peer interview. Process was quick and easy. I was an internal transfer so possibly that was why it was so simple. My initial interview years ago was similar. 3 parts and pretty quick.", "Interview Questions": "Tell us about a time you encountered a difficult patient/family. "}, {"date": "26 Sept 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Medical City Plano (Plano, TX) in Apr 2018", "Interview Descriptions": "I was interviewed by the manager of the unit and was then asked a few questions by one of the charge nurses. It was relatively casual, but still professional, and lasted about 30 minutes.", "Interview Questions": "When was a time you made a mistake and how did you fix it? "}], [{"date": "28 Oct 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Plano", "Interview Descriptions": "Panel interview with 1 clinical educator and 2 nurse/unit managers, average behavioral based interview questions, very short interview- lasted less than 15 minutes, felt like they were not invested in their interviewing process", "Interview Questions": "What do you think of this statement, \"It's not my job\"?"}, {"date": "26 Aug 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Plano (Plano, TX)", "Interview Descriptions": "Met with a manager and director initially. I was then interviewed  by other staff nurses and given a tour of the floor.  The interview process lasted approximately an hour and a half.", "Interview Questions": "Situational questions asked"}, {"date": "3 Jul 2017", "title": "Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Plano in Jun 2017", "Interview Descriptions": "I applied online for the RN Internship in the OR and was selected for a video interview 2 days later. Two weeks later I received a request for an in person interview. When I went in for the interview I met with two of the managers. The interview was standard and not difficult at all. I then met with two potential colleagues. Everyone was friendly and was interested in learning more about you and explained the unit very well.", "Interview Questions": "What interests you about the OR? Other than that they were standard behavioral questions. "}, {"date": "21 Aug 2018", "title": "OR Supply Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Plano (Plano, TX) in May 2017", "Interview Descriptions": "Interviewed by peers.... people I was going to be working around and director of department. Interview was straight forward. If you have experience in supply chain you have a good chance", "Interview Questions": "How do you had stress "}, {"date": "24 Feb 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Medical City Plano (Plano, TX) in Jan 2017", "Interview Descriptions": "Applied online and scheduled an interview within a week. My interview was at HR. 4 people interviewed me, 3 of which were RNs from the department to which I had applied. The interview went by quickly. One guy who asked most of the questions was really nice and the others looked like they did not want to be there. I heard back on the status by email within a week.", "Interview Questions": "Tell us about yourself.\r\nWhat do you do for fun?\r\nWhat do you know about this hospital?\r\nWhy do you want to work in this department?\r\nWhat do you do when facing a difficult situation?\r\nWhat was your favorite area to work during clinical rotations? Why did you like it?\r\nWhat is customer service to you?\r\nWhat do you do when you have a very opinionated patient?\r\nWhat do you say to a coworker when they say that they do not want to do their job?\r\n\r\n"}, {"date": "11 Sept 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical City Plano (Frisco, TX) in Jul 2015", "Interview Descriptions": "Easy interview with operating room manager. She was very chatty and was pleasant. Asked specifics about my operating room experience. 12 suite OR. However, facility was just bought by Medical City Plano causing huge downshift in culture.", "Interview Questions": "Typical"}, {"date": "24 Oct 2018", "title": "Compliance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Medical City Plano (Dallas, TX) in Nov 2014", "Interview Descriptions": "Very relaxing atmosphere. Staff was very engaging and encouraging. The interview was conducted over Skype with several upper level staff. It was my first experience being interviewed this way however, it went very well. They were more interested in what I would bring to the table and how I would fit in with the hospital's mission, vision and values. A wonderful experience.", "Interview Questions": "How will you improve the operations of the hospital and live out excellence always."}, {"date": "9 Aug 2015", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Plano (Plano, TX) in Aug 2014", "Interview Descriptions": "Dept manager was fine. But HR very rude , disrespectful, biased. I did very well in the interview with dept manager but then the HR employee came in and said they are considering an internal employee for that position. That HR employee didn't like me . So she found an excuse not to consider me even though I met the criteria.  She doesn't deserve to be in HR dept. This is purely racial discrimination.", "Interview Questions": "Experience "}, {"date": "17 Mar 2017", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Medical City Plano (Plano, TX) in Jul 2013", "Interview Descriptions": "Applied online and was contacted by HR. HR conducted a phone interview. Mostly personality type questions. Peer interview with supervisors and some staff. Asked random therapy application questions. Peer interview was a mix of supervisors and staff.", "Interview Questions": "General practice questions, such as type of ventilators have you worked with"}, {"date": "18 Aug 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Plano (Plano, TX) in Oct 2012", "Interview Descriptions": "I was asked questions about empathy and what I would do in certain emotional situations. I was asked about my experience and what I thought I could bring to the unit. I was warned that it was a difficult job and a difficult unit. The manager was nice and seemed like she was really there for her employees.", "Interview Questions": "What I would do in an emergency situation."}], [{"date": "12 Jan 2012", "title": "Quality Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Plano (Dallas, TX) in Dec 2011", "Interview Descriptions": "I found their HR to be very rude and probing. Their nurse manager did not tell me about what a major component of the job would be their job description had one line about it. I don't have experience in that specific function and I said I could learn but had they worded their job description right we would have not wasted time. When I asked the interview panel how they wild describe the culture of their organization they avoided the question.", "Interview Questions": "Technical question"}]]