[[{"date": "12 Nov 2022", "title": "Tennis Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City Parks Foundation", "Interview Descriptions": "Asked about tennis experience and coaching style. Interviewer had a lot of energy and wanted to hear about how I would work with kids of different ages. Very straightforward questions", "Interview Questions": "What qualities did you like in previous coaches?"}, {"date": "22 Feb 2022", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at City Parks Foundation", "Interview Descriptions": "There were three interviews including a short phone screen. The interviews went well and I was a final round candidate. They sent me an offer by accident although it wasn't supposed to go to me - highly unprofessional.", "Interview Questions": "How does your past experience relate to the role?"}, {"date": "6 Jan 2022", "title": "Manager of Corporate Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City Parks Foundation (New York, NY) in Dec 2021", "Interview Descriptions": "Very straightforward and easy. It took a few weeks to hear back after applying. I had 2 interviews and an offer within a week after they checked in with references.", "Interview Questions": "How would you go about finding a partner for a new program?"}, {"date": "24 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City Parks Foundation", "Interview Descriptions": "Got an interview the day after I applied and it was very informal. They asked straightforward questions regarding why I wanted the job and will be a good fit. They go over the responsibilities and tell you about any details you may need to know in advance.", "Interview Questions": "Q: How do you handle abrupt behavior?"}, {"date": "8 Jul 2021", "title": "Social Media Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Parks Foundation", "Interview Descriptions": "Very friendly! Asked about background knowledge of the organization and how I would use my experience to help within marketing. Overall it was a positive experience and the interview process was nothing to worry about.", "Interview Questions": "Do you know the different branches of the organization? "}, {"date": "20 Apr 2021", "title": "Salesforce Systems Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at City Parks Foundation", "Interview Descriptions": "Had initial phone/video screen with HR representative, who did not have a technical background.  After going through my resume was told that the organization was looking for someone with more experience.", "Interview Questions": "Can you walk me through your resume?"}, {"date": "20 Nov 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Parks Foundation (New York, NY)", "Interview Descriptions": "Initial communication for scheduling was via email. Two round of in-person interviews with the same person. Extremely informal and unorganized in terms of setting and questions. The office space was cluttered and unventilated. There was no human resources representative present during the interviews.", "Interview Questions": "Describe a challenging event and how you resolve it. "}, {"date": "15 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City Parks Foundation", "Interview Descriptions": "Spoke with the person who would be my manager on the phone for about 10 minutes. No tough questions. Basic about experience and very generic personality questions. Received an offer about a week later and accepted. No complications.", "Interview Questions": "What's your biggest weakness?"}, {"date": "7 Oct 2018", "title": "Summer Events Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Parks Foundation in May 2018", "Interview Descriptions": "I sent in resume and cover letter. About two weeks later I received an email directly from the interviewer to set up an interview. The interview took about 30 minutes. It was more like a conversation than a panel. It took place in the building and room where the interviewee would potentially work, and the interviewer was the direct boss.", "Interview Questions": "What can you contribute to City Parks?"}, {"date": "12 Dec 2016", "title": "Director of Marketing and Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at City Parks Foundation (New York, NY) in Nov 2016", "Interview Descriptions": "Met directly with Executive Director for an hour to go over my experience. We went over in detail my job history, what organizations I've worked closely with that have similar programs as well as where their organization is looking to be in 2017.\r\nA week later, I was brought in to meet the rest of the senior team. We went over my experience in less detail this time. Senior staff asked questions such as my experience working with a development team and fundraising. We reviewed my observations on a marketing wrap-up document I was sent over a few days earlier. I noted issues and asked a number of questions and then offered my recommendations for 2017.", "Interview Questions": "Why do I want to work there? What relevant experience do I have? What marketing recommendations would they have after reviewing the last few years results? Do I have any media contacts I can bring to the table for this role?"}], [{"date": "15 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at City Parks Foundation (New York, NY) in Mar 2016", "Interview Descriptions": "The interview was over the phone and very laid back. They asked me about what I was studying and why I was studying that, what I wanted to do, why this internship would be helpful/make sense. The interviewer was personable and it felt very conversational.", "Interview Questions": "When is a time you worked as part of a team?"}, {"date": "12 Jul 2014", "title": "Staff-Financial Accounting & Reporting () Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at City Parks Foundation", "Interview Descriptions": "really fast and quick. i really like the places but not for me. go for it if u have the chance. its located in the city •\tExecute ad-hoc projects to assist the finance department", "Interview Questions": "•\tReconciled accounts by identifying inconsistencies and taking corrective action"}, {"date": "15 Jun 2015", "title": "Borough Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at City Parks Foundation (New York, NY) in May 2014", "Interview Descriptions": "nothing special. just a very short informal interview with the program manager that took around 30-40 minutes. Asking about my experiences as well as talking what job requires and how to handle 50+ kid on the court", "Interview Questions": "how would you handle a conflict in the workplace. how do you deal with young kids and what has been your experience teaching big groups of young kids."}, {"date": "19 Feb 2014", "title": "Director of Arts and Cultural Programs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City Parks Foundation", "Interview Descriptions": "A friend told me about the position.  I submitted my resume and was interviewed.", "Interview Questions": "How would you reshape this list of programs?"}, {"date": "10 Dec 2013", "title": "Seasonal Summer Tennis Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at City Parks Foundation (Flushing, NY) in May 2009", "Interview Descriptions": "Interview is comprised of a basic in-office interview where they get a feel for your personality with some basic questions. Next, you and a group of other candidates move onto the tennis court to do some light hitting and then some drills in which they assess your level as a player. After that, the group is asked to participate in a mock tennis lesson where each individual is given an aspect of tennis (forehand, backhand, volley, overhead, serve, etc) to teach to the others whilst pretending they are a group of small children.", "Interview Questions": "Surprisingly, they give you a silly exam at the end of the process to test your knowledge of tennis fundamentals (i.e. grips)  with some curveball questions such as, \"Who won Wimbledon this year?\""}]]