[[{"date": "13 Mar 2023", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNM Hospitals (Albuquerque, NM)", "Interview Descriptions": "One interview with the hiring manager, a director, and a financial analyst. The hiring manager was really nice. She started by talking about the department and what they expect from the selected candidate.", "Interview Questions": "Have you used SQL before?"}, {"date": "21 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals (Rio Rancho, NM) in Jun 2022", "Interview Descriptions": "It was pretty straight forward. Emotional intelligence and clinical questions by the department manager. Great place to learn and get your feet wet. Friendly people and staff who are willing to teach and walk through with you Great support", "Interview Questions": "Describe a situation where you had conflict with with a coworker and how you resolved it"}, {"date": "9 Apr 2022", "title": "Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNM Hospitals", "Interview Descriptions": "Please note that all salary figures are approximations based upon third party submissions to Indeed. These figures are given to the Indeed users for the purpose of generalized comparison only. Minimum wage may differ by jurisdiction and you should consult the employer for actual salary figures.", "Interview Questions": "Tell me about a time you had conflict"}, {"date": "12 Nov 2021", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNM Hospitals", "Interview Descriptions": "The interview process was very professional with quick responses. The training was good, with compensating pay while completing courses. Competent instructors. I would recommend to anyone who wants a smooth interview process.", "Interview Questions": "What was a difficult situation you experienced? "}, {"date": "6 Aug 2021", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNM Hospitals", "Interview Descriptions": "standard interview process, not too difficult.  It was a professional interview.   A smooth process, enjoyed the interview, they made me comfortable.   Behavioral question based.  Give examples of your experience and you will be fine.", "Interview Questions": "Situation Task/goal Response and Result"}, {"date": "3 Aug 2021", "title": "PCT/IV Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals (Albuquerque, NM) in Aug 2021", "Interview Descriptions": "Smooth and was asked the usual interview questions.  They reviewed my resume and qualifications and gave me a tour of the unit. There were two interviewers during this interview.  It was a pleasant experience.", "Interview Questions": "What do I know about UNMH? And what do I know about the unit?"}, {"date": "17 May 2021", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals in May 2021", "Interview Descriptions": "Received a call from a supervisor after application. Interviews was via zoom with two supervisors and two staff from the department. They said they would discuss their feelings after the interview and let me know about proceeding or not the following day.", "Interview Questions": "What drew you to this position?"}, {"date": "10 May 2021", "title": "Employee Recognition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals (Albuquerque, NM) in Apr 2021", "Interview Descriptions": "I was contacted to schedule an interview. No screening interview. Hour long interview was through Zoom, with mostly behavioral questions. The job turned out to be more events-focused. There was no guidance or expectations set about a second interview or next steps. When I contacted the hiring manager for feedback, I was ghosted.", "Interview Questions": "Tell me about the best team you worked with."}, {"date": "18 Mar 2021", "title": "RN Coordinator ORTHOPEDIC CARE 15385961 Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNM Hospitals (Albuquerque, NM) in Mar 2021", "Interview Descriptions": "5 nurses (one was charge)  in a very small room asking me questions from a piece of paper.  Then I followed up by phone once a week to see if there were any decisions made. After 4 weeks the charge told me they hadn't found what they were looking for. I respectfully asked how I could improve for future interviews. She was very critical and unprofessional in her responses. I would expect constructive criticism from someone in a leadership position.", "Interview Questions": "They went around the room asking many questions. None of them very memorable. They later told me I took too long to answer and distracted from the questions. They apparently score these question sheets and told me I scored low."}, {"date": "15 Feb 2021", "title": "Staff RN ED Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals (Albuquerque, NM) in Feb 2021", "Interview Descriptions": "I applied online, was called within days, had an online interview. That same day, I was sent a request for references and the Applicant Assessment. However, apparently they sent those emails by mistake, as when I tried to enter my references, literally that evening, it said my application had been removed from consideration. When I emailed HR to ask if I indeed had been removed so quickly from the selection process, I got no response. I tend to interview terribly because I become very anxious, especially in frontof a camera. I just kindof feel badly about the whole experience. I have a good job currently, I just really need more of a challenge.", "Interview Questions": "Why do you want to work here?"}], [{"date": "23 Aug 2020", "title": "Ultrasound Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals", "Interview Descriptions": "Standard interview questions about patient care and work experience. The ultrasound scanning portion of the interview was 30 minutes. Managers, technologists, and other radiology staff members were present. Took a week for call-back.", "Interview Questions": "How would you describe your work ethic?"}, {"date": "27 Aug 2020", "title": "Pediatric Sedation/Infusion Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals in Aug 2020", "Interview Descriptions": "45-minute Behavioral Interview with 2 RN Managers and 2 Unit Staff Members. Was given the opportunity to ask many questions at the end of the interview. I have not yet received word on if I will be selected for the position.", "Interview Questions": "-How would you describe teamwork and how do you embody it?\r\n-What would your current manager say about you? Both positive and negative."}, {"date": "3 Mar 2020", "title": "Physical Therapist Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNM Hospitals (Albuquerque, NM) in Feb 2020", "Interview Descriptions": "Online profile creation and resume upload, then an online personality questionnaire, then face to face interview. The face to face interview was about 20 minutes with many technical questions and personality questions followed by time for me to ask them questions.", "Interview Questions": "Why where you interested in working for UNMH "}, {"date": "21 Aug 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UNM Hospitals (Albuquerque, NM) in Jun 2019", "Interview Descriptions": "Asked good questions but seemed disinterested in the answers. They tend to have formality interviews, they have someone else in mind to hire. Not a fair practice, lots of nepitisim and hiring of friends.", "Interview Questions": "If you have a issue with a co worker, how do you deal with it?"}, {"date": "27 Mar 2018", "title": "Social Worker/Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNM Hospitals in Feb 2018", "Interview Descriptions": "Interviewed by a panel of supervisors, social worker case managers, nurse case managers and a Case management assistant. They were very respectful and kind. They asked questions using set protocol and gave me a copy of the questions to review.", "Interview Questions": "What are the things a patient must have in order to be discharged from the hospital?"}, {"date": "30 Jul 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals (Albuquerque, NM) in Jul 2017", "Interview Descriptions": "Small panel interview with charge nurse and nurse manager.  Interview lasted about a half hour.  I was told many people were being interviewed.  Decision was made and relayed when stated.", "Interview Questions": "Husband is making medical decisions for middle aged wife who is competent to make own decisions and is reluctant to have procedure.  How do you handle?"}, {"date": "12 Sept 2017", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNM Hospitals (Albuquerque, NM) in Nov 2016", "Interview Descriptions": "Director and hired contractor interviewed for the first round with basic questions such as what makes you qualified for the position. After the first round, I went to a second interview with the medical director, administrator, and another senior director.", "Interview Questions": "Describe a situation where you had to convince another party to change their decision."}, {"date": "11 Sept 2016", "title": "Safety Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at UNM Hospitals (Albuquerque, NM) in May 2016", "Interview Descriptions": "The interview went well. The over all process took 6 months because it was a part time position and they were to change it to a full time posisiton. It was charged to full time and I was the canidate for the position.", "Interview Questions": "N/A"}, {"date": "22 Feb 2018", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNM Hospitals (Albuquerque, NM) in Apr 2016", "Interview Descriptions": "Standard interview, standard questions; why you want to work there, what's your health care experience, what are your goals, etc. Very laid back interview for entry level job, make sure to present yourself cleanly.", "Interview Questions": "What is your experience?"}, {"date": "3 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNM Hospitals (New York, NY) in Jan 2016", "Interview Descriptions": "The interview process was simple and laid back, very flexible with times. Company kept in close contact with me during the hiring process, and was easy to get a hold of questions.", "Interview Questions": "Weaknesses/Stregths"}], [{"date": "21 May 2015", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNM Hospitals (Albuquerque, NM) in May 2015", "Interview Descriptions": "The application process is easy, and I was called for an interview within two weeks. I was interviewed by the nurse manager and a nurse educator. They were friendly and professional. The questions were fairly standard, such as what are your career goals, why do you want to work there, and why they should hire me. I didn't get an offer, but I didn't expect to as working there didn't really align with my career goals.", "Interview Questions": "How I developed relationships with co-workers."}, {"date": "17 May 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNM Hospitals in Jan 2014", "Interview Descriptions": "Applied for the position online and received a phone call a few weeks later.  The interview was a peer interview, where everyone asked general questions.  Everyone was extremely nice and easy to talk to.  Exactly two weeks after the interview I received a phone call offering me the position.  I took a few days to think on it (the whole thing was very unexpected) and eventually accepted the position a few days later.  This was by far the easiest interview process I have ever been through.  I had previously worked at a competitor hospital who's interview process was horrific, consisting of multiple interviews with different departments.  This one was a breeze compared to that!.", "Interview Questions": "Have you ever had to deal with a difficult patient?  If so, how did you handle them.  (not word for word, but something along those lines)"}, {"date": "30 Sept 2013", "title": "Patient Services Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNM Hospitals (Albuquerque, NM)", "Interview Descriptions": "I had 1 interview with the hiring manager who was also a charge nurse. It took about half an hour. She asked basic questions-- prior work experience, how would you handle conflict with a peer, etc. Very friendly. My perception of the work atmosphere during my interview was that she was extremely busy due to the intense nature of the department. I didn't feel like she was rushing me or anything; rather, I felt like she was being generous by setting aside half an hour for me. The interview was extremely easy and comfortable. Appearances definitely count, so I am glad I dressed professionally in business-professional attire.", "Interview Questions": "All questions were easy and standard-- what is your greatest weakness and how are you working to improve it."}]]