[[{"date": "30 May 2023", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CentraCare", "Interview Descriptions": "It was a very laid back interview. Interviewers did not have a pencil or notepad to write down my responses. I met with current employees before the formal interview, so that they might have expressed that I was a good fit before the interview.", "Interview Questions": "Why do you think you are the best fit for the role?"}, {"date": "6 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CentraCare (Sartell, MN) in Feb 2023", "Interview Descriptions": "It was a one-on-one , somewhat informal interview in the patient lounge. I felt comfortable. The interviewer put me at ease and had a good sense of humor. She asked some difficult, but fair questions.", "Interview Questions": "Why I wanted this position"}, {"date": "25 Jan 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CentraCare", "Interview Descriptions": "Slow, did not get a call back for interview until two weeks had passed. Did virtual interview with the two managers for the unit. Started by going over the details of the job applied for. It was a good interview as it felt like a conversation and it ended with some scenario questions.", "Interview Questions": "Tell me about a difficult situation, how you handled it, and the outcome"}, {"date": "22 Mar 2023", "title": "Patient Access Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraCare in Jan 2023", "Interview Descriptions": "Very personable learning about the individual. They were basic interview questions but truly followed your resume making questions based on that. Would not be worried but be open to being yourself through the process.", "Interview Questions": "How you handle conflict with customers"}, {"date": "30 Sept 2022", "title": "Patient Access Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CentraCare", "Interview Descriptions": "It was very smooth, I received a call back within two days of my interview, drug tested within a week start day 2-3 weeks out from hire date. Questions were basic and easy. ", "Interview Questions": "Previous employment history? What would your previous supervisors say about your previous history with them?"}, {"date": "10 Sept 2022", "title": "Registered Nurse CVICU Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CentraCare (Saint Cloud, MN) in Aug 2022", "Interview Descriptions": "There was a zoom interview process, it lasted about 50 minutes long. Very simple questions, some about personal life/hobbies. No references were checked, and an offer was sent via email by the recruiter the next day.", "Interview Questions": "How do you handle or manage stress?\nTell me about your hobbies outside of work?\nWhat sets you apart from the other candidates?"}, {"date": "31 May 2022", "title": "Desktop Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CentraCare", "Interview Descriptions": "Fairly easy interview via Teams. Ask about experience mostly, if you have used Active Directory and SCCM console tool before. If you have any customer service experience as well. Overall, laid back interview and a positive experience.", "Interview Questions": "How many ways can you find a needle in a haystack"}, {"date": "6 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CentraCare", "Interview Descriptions": "Video interview, phone interview, manager interview. As you move on the questions get more focused on your job title specifically. Practice questions ahead of time to be more prepared. Know the vision and values of the company.", "Interview Questions": "How will your work align with the companies values? "}, {"date": "20 May 2022", "title": "Claims Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CentraCare (Saint Cloud, MN) in Mar 2022", "Interview Descriptions": "Zoom interview with 3 people and it was a little uncomfortable. I would prefer interviewing with one person at a time. Set up a second interview for another person. It’s nerve racking", "Interview Questions": "What about would make an employer say she is definitely the one i need to hire?"}, {"date": "15 Nov 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraCare", "Interview Descriptions": "The interview process was easy going. Asked fair questions about what to do in different scenarios.  Made you feel comfortable in the interviewing process. They contacted me about the job by the next day", "Interview Questions": "Scenario questions such as if a patient asked me something how I would respond. "}], [{"date": "12 Oct 2021", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CentraCare", "Interview Descriptions": "Received a call from HR for an interview for a coordinator position. There were 3 dates to choose from and due to COVID it would be a \"Virtual\" interview. I selected a date and an email was sent with a link for the virtual interview.", "Interview Questions": "How do you prioritize your day to day tasks?"}, {"date": "29 Sept 2021", "title": "Scheduling Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at CentraCare in Sept 2021", "Interview Descriptions": "Receive a phone call from a recruiter to set up an interview through Webx (online). Interview went really well. The individual who led the interview was very upbeat and friendly. Unfortunately the offer was too low for me.", "Interview Questions": "Tell me about a time you were told to do something outside of your job?\n\nHow do you handle a difficult co worker?\n\n3 things you look for in a new job"}, {"date": "1 Dec 2021", "title": "Senior Data Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CentraCare in May 2021", "Interview Descriptions": "The interview was scheduled as a zoom meeting with about 4 other data engineers. Questions were relatively easy but didn’t make it to the final round. They seem pretty nice and easy with the interviews", "Interview Questions": "Describe inner join using a real world scenario"}, {"date": "9 Apr 2021", "title": "Project Manager, IS Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraCare", "Interview Descriptions": "Virtual videos were recorded first.  Then there was an interview with HR.  Then an in-person interview with the applicable manager of the department area.  Many questions regarding my experience and what I can do differently from other applicants.", "Interview Questions": "Q: What makes you different from other project managers applying for this position?"}, {"date": "23 Mar 2021", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at CentraCare", "Interview Descriptions": "The HR team was great to work with. They made sure I had all the details of the interview,  who I would be meeting with, etc. I didn’t ultimately get the job but it was one of the best hiring process experiences I’ve had in my career.", "Interview Questions": "Why are you interested in the position?"}, {"date": "17 Jan 2021", "title": "Caregiver, CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraCare in Dec 2020", "Interview Descriptions": "I had a Zoom interview with the core charge nurse for unit (normally in person but not with Covid). The interview lasted for 1 hour. I was notified of a decision after 1 week.", "Interview Questions": "Tell me about a time where you had to work with a difficult coworker. "}, {"date": "21 Jun 2021", "title": "Patient Access Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CentraCare (Willmar, MN) in Jul 2020", "Interview Descriptions": "I had 2 interviews— an initial online interview I did at my own pace and a video interview with my supervisor and her boss. My supervisor’s boss did not end up showing up. The interview went well. She was very open about the position and what i would be doing. In hindsight, I wish I had asked more about the training protocol and job description, as I had issues with those after accepting an offer.", "Interview Questions": "Recall a time when you overcame adversity"}, {"date": "13 Dec 2019", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraCare", "Interview Descriptions": "I was called and asked questions and then I was told I would receive call the next week if they were going to extend an offer. Was contacted by email to send copies of CMA and BLS certifications. Very nice folks. Have not missed a beat when it came to answering any questions or concerns I had.", "Interview Questions": "Tell me about a difficult time and how you handled that situation?"}, {"date": "1 Mar 2021", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CentraCare (Saint Cloud, MN) in Nov 2019", "Interview Descriptions": "Starts with a Videotaped via Webcam Interview where you answer 3 or 4 questions and you have the ability to retake the question once if you did not like the outcome of your video.  Once passed you move into the in person process", "Interview Questions": "Why did I apply for this position"}, {"date": "17 Dec 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CentraCare in Sept 2019", "Interview Descriptions": "Straight forward interview process. Interviewed 3x and was then offered the position. Great company to work for, but requires some leadership changes at the mid-management level. Overall, the interviews went very well and being recruited was a seamless process.", "Interview Questions": "Name a time where you faced difficulty in one of your projects, and what did you do to overcome this challenge?"}], [{"date": "13 Jun 2019", "title": "Customer Contact Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at CentraCare", "Interview Descriptions": "You will be called by a HR intern. Than will interview with HR first than you'll have another interview with the hiring manager. Took about 2 weeks to hear anything back. Got hired and took the job.", "Interview Questions": "Basic interview questions "}, {"date": "18 Apr 2018", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CentraCare (Saint Cloud, MN) in Jan 2018", "Interview Descriptions": "First was the application, second the online video interview, third was a phone interview and lastly was  a in person interview.  After all were done which took a couple weeks between each one I was offered a job approx. 2 weeks following the in person interview.", "Interview Questions": "Most area of work that I needed improvement on from former job. "}, {"date": "28 Jan 2020", "title": "Laundry Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CentraCare in Mar 2017", "Interview Descriptions": "You will be asked to record your answer online in a video and submit it. Questions are related to Behavior and some real-life scenarios.  After that, you will be called for an in-person interview.", "Interview Questions": "Tell me the difficult situation and explain how did you overcome that?"}, {"date": "16 May 2017", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CentraCare (Saint Cloud, MN) in Jun 2016", "Interview Descriptions": "The hiring process took close to two months to complete. Once I started working they added on responsibilities that they said were covered in the interview. They never were. I'd take what they say to you with a very big pinch of salt.", "Interview Questions": "How can you benefit centracare"}, {"date": "12 Jun 2016", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CentraCare (Saint Cloud, MN) in Jun 2016", "Interview Descriptions": "It took about 2 weeks for them to contact me and call me for an interview over the phone. It's been a week and I haven't heard back yet. But I'm keeping my fingers crossed. The interview was great. I had a great conversation with the recruiter.  They try to ask about other jobs you applied for if you have multiple applications in. so that you don't  have to interview like 6 times", "Interview Questions": "Why am I interested in this position"}, {"date": "14 Jun 2017", "title": "Mental Health Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CentraCare (Saint Cloud, MN) in Apr 2016", "Interview Descriptions": "The interview process was simple, and short. I met with an HR employee for general questions, and then met with the charge nurse of the unit to go over more specific mental health questions. The interview process went well, but it was clear they did not like my availability as a student and the interview ended abruptly following that.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "5 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at CentraCare (Saint Cloud, MN) in May 2015", "Interview Descriptions": "very short interview. Took over a month to get hired. Asked the basic interview questions. Two interviews. One with HR and then one with the manager of unit. Very friendly and professional place to work. Orientation for a day and drug screening and background checks must be passed in order to get hired.", "Interview Questions": "Basic interview questions."}, {"date": "15 Nov 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CentraCare (Monticello, MN) in Feb 2015", "Interview Descriptions": "It was a panel of people interviewing with the manager. Each person asked questions to see if you were the right fit for there team. They really care if your willing to pick up hours or work night shift. If you like night shift they will love you.", "Interview Questions": "How do you work as a team?"}, {"date": "18 Jan 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at CentraCare (Monticello, MN) in Oct 2014", "Interview Descriptions": "I filled out an application and they called me back within two days. Before the interview started a lady from HR and I filled out paperwork in the Heartfelt Gifts sitting area. The paperwork took around 10 minutes to complete. Then the lady from HR and I went to interview with the Director of Nursing. The interview didn't last more than 15 minutes. Then the lady from HR and I went to Lab and I did a Urinary Analysis. They told me they would call me back to let me know if I passed and if I got the job. They called me back within 24 hours and said I was hired! Then you go to Orientation and fill out more paperwork and get a manitou and a flu shot. You go on a tour of the facility and they give you your schedule with all your training days on it and then you're officially hired!", "Interview Questions": "What makes you stand out from the other applicants?"}, {"date": "26 Jan 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at CentraCare (Melrose, MN) in Jul 2013", "Interview Descriptions": "Interview was real informal with the DON as I was working with a company doing clinical liaison work for the insurance company that had residents at this particular nursing home.", "Interview Questions": "Why do you want to work for us?"}], [{"date": "7 May 2013", "title": "Staff Psychotherapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CentraCare in Apr 2012", "Interview Descriptions": "I applied at the beginning of the month and was called to come in to meet with the HR rep and then two mangers, the interviews were scheduled for the same day, three weeks out. The HR department was fantastic and the facility is beautiful", "Interview Questions": "\"Why are you switching careers?\"  "}]]