[[{"date": "8 Sept 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Harrison College", "Interview Descriptions": "I had 1 phone interview followed by 1 panel interview with 3 members of the department. I was offered a job very quickly. Very smooth process. No complaints from me about the interview.", "Interview Questions": "Tell me a bit about yourself "}, {"date": "18 Feb 2018", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Harrison College", "Interview Descriptions": "I got an email to come in and meet with a member of HR. She ended up getting tied up in something else, so I met with the director instead. She was very nice, and we went over some situational examples I could run into. Then, out of nowhere, she excused herself and did not return for several minutes. The interview ended abruptly with her saying they would reach out to me “eventually” if they were interested. It was quite bizarre.", "Interview Questions": "Tell me how you would call someone inquiring about enrollment."}, {"date": "23 Sept 2017", "title": "Dean of Students Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Harrison College", "Interview Descriptions": "Practice Professional Development and meeting with all departments and students. Interaction with students was very important. Knowing current data was important.  Offering unique education strategies was important.  I did a phone interview and was very peppy. I interviewed with school and company personnel and then interviewed with chairs and had a question and answer with students and instructors.", "Interview Questions": "What can you do to support instructors?"}, {"date": "10 Mar 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Harrison College (Indianapolis, IN) in Feb 2016", "Interview Descriptions": "Submitted resume. Brief phone interview. Two in person interviews. All held at the campus. Met with director of enrollment and senior director of enrollment. All very brief interviews. Didn't ask too many questions. Basically wanted to know if you have a pulse.", "Interview Questions": "What's your biggest strength "}, {"date": "6 Sept 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Harrison College", "Interview Descriptions": "Series of interviews and a cattle call information session. Wasn't a professional session with a few who walked out. The 1:1 came after the session. Felt unmotivated and disorganized. Few weeks later both managers resigned. Seems to be in a little directionless stage right now. Going through a series of management changes and looking for direction across management.", "Interview Questions": "Why do you want to do this?"}, {"date": "6 Oct 2015", "title": "Financial Aid Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Harrison College in Sept 2015", "Interview Descriptions": "First, a phone interview was conducted. \r\nAfter a week, a panel interview was conducted. \r\nNow I am scheduled for a third interview with the campus director and the financial aid director.", "Interview Questions": "Can you tell us about a time when you or one of your coworkers were able to turn a negative experience into a positive one? How was this achieved?"}, {"date": "22 May 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Harrison College", "Interview Descriptions": "I'm still in the process of the interview, but has had 2 thus far. I have never been to an interview that was so honest. They speak to you directly about what they're looking for and the qualities you need to possess in order to be successful in this position. If you don't like sales, marketing, helping others or you can't handle criticism or sometimes angry hang-ups, they don't want you to accept any position. Very clear and very honest.", "Interview Questions": "Why do you think you'd be a good fit for this position?"}, {"date": "22 Jun 2017", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Harrison College (Indianapolis, IN) in Jan 2015", "Interview Descriptions": "I quickly spoke with the IT manager and less than 24 hours later I was scheduled to speak with the VP of IT. The entire process was very straightforward and generalized questions were asked.", "Interview Questions": "General IT background questions and background information on Harrison College."}, {"date": "1 Aug 2014", "title": "Student Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Harrison College", "Interview Descriptions": "Applied online and got a call about a week later for an on-the-spot phone interview. A few days after the phone interview I got a call to schedule a face-to-face interview. Met with the Hiring Supervisor, someone else in the same position, and the Campus President. Questions were mostly about my experience and how would I handle certain situations with students and faculty. Recieved an offer at the end of the week.", "Interview Questions": "How would you approach a faculty member whose student was having issues with them?"}, {"date": "14 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Harrison College (Grove City, OH) in Jul 2014", "Interview Descriptions": "I saw a position posted online for an adjunct.  I applied for the position.  I was called and asked to come in for an interview.  I was not really 100% what they were looking for in that position, but my background and education matched with another position they had open and asked me if I was interested in teaching a different class.  They sent me the syllabus for the class to review, I let them know that I was interested, and I started teaching the following quarter.", "Interview Questions": "Did I have teaching experience and why did I want to teach?"}], [{"date": "6 May 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Harrison College (Grove City, OH)", "Interview Descriptions": "The interview process was very informal. Basic questions were asked about my experience, strengths and weaknesses, and why I feel I would be good fit for the position.", "Interview Questions": "N/A"}, {"date": "9 Dec 2013", "title": "Director of Instructional Design and Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Harrison College", "Interview Descriptions": "Interview process involved a short phone screening, followed by a face-to-face interview with seven people. Most were in person, but there were two participating via phone. The individuals included the incumbent job holder, a direct report, and leaders form other areas with which the position interacted. Oddly, the hiring manager did not participate in the interview. I was asked a very wide range of questions depending on the perspective of the person asking the question. Most of the focus was on my current job and some of the changes that I had implemented in that position. This past experience was very relevant to the job I was interviewing for. The interview wasn't to terribly challenging because I just had to talk a lot about my past work and describe some of the details on how I did what I did and what drove my decision making. The position I was interviewing for also involved people management responsibilities, so I was also asked questions about my people management style and practices. They were clearly concerned with getting someone who would manage people in a manner consistent with the organization's values.\r\n\r\nAfter the face-to-face interview there was about a month where things didn't move forward. Harrison expressed interest in moving forward, but it didn't happen quickly. Eventually, I had a phone interview with the hiring manager and a second phone interview with his manager. The second interview was conducted on a Saturday morning to fit it into the Provost's schedule. The hiring manager called me immediately after that interview and made an offer via phone.", "Interview Questions": "I didn't really find any of the questions very difficult, but the two most detailed ones were about my experience implementing operational systems in my current position and a question about my management style. In both cases, I was asked for specific details and examples that showed how I approached the situations. We spent a lot of time talking about both of these topics and I was asked a number of clarifying questions from different members of the interview panel. Each had their own perspective that they wanted to explore. I didn't really find the questions difficult, because I just had to talk about my experiences. For others interviewing, you should be prepared to talk about past  work in detail, not just at a surface level. Also be prepared for behavioral interview questions where they ask you to give an example of a time when..."}, {"date": "14 Oct 2013", "title": "Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Harrison College in Oct 2013", "Interview Descriptions": "Email communication. Initial phone interview 35 minutes with one person. Additional online interview & presentation with two people. Quick response time.", "Interview Questions": "How do you prioritize assignments from different constituencies with different deadlines? "}, {"date": "22 Apr 2013", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Harrison College (Indianapolis, IN) in Mar 2013", "Interview Descriptions": "You will likely have a phone screening and one in-person interview for a manager position. Questions are very detailed, no behavior type trick questions.", "Interview Questions": "Why should we hire you today?"}, {"date": "23 Apr 2013", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Harrison College (Fort Wayne, IN) in Oct 2012", "Interview Descriptions": "Hiring manageer emailed me a VERY brief email telling me a time and date to be there to interview 3 months after I submitted an application.  When I said I could not make that date I was told to check back for other opportunities online.  Very unprofessional and unrealistic.  Offered to do a phone interview since I am out of town on business and was told thanks anyways.", "Interview Questions": "N/A since they were so unflexable.  If I was qualified enough to offer an initial interview you should work to make one happen."}, {"date": "6 Jan 2016", "title": "College Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Harrison College (Indianapolis, IN) in May 2012", "Interview Descriptions": "Did a test teach where I had to teach a subject to other instructors and the dean of the school.  I spoke on how to create a business plan for a new small business owner.", "Interview Questions": "What is the benefits of having a business plan?\r\nHow is knowing about a business plan important to college students.\r\nShould a business plan be updated and revised in the future?"}, {"date": "7 May 2015", "title": "Student Affairs Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Harrison College (Indianapolis, IN) in Mar 2011", "Interview Descriptions": "Took tour of the campus, met with campus president and dean (who clearly didn't communicate on what the position actually did and what questions they would ask), and didn't hear anything for weeks.  I than received a call from director in which we chatted for 30 minutes about for profit education.  He did most of the talking.  Afterwards, got a call about the job, all together took about 3 months from applying to receiving an offer.", "Interview Questions": "Tell me how you would handle a difficult student situation"}, {"date": "24 Jul 2014", "title": "Dean of Online Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Harrison College in Nov 2010", "Interview Descriptions": "Interview is completed in three steps one is resume review and prelim phone call second is a meeting with the committee who is hiring third is one on one with manager", "Interview Questions": "How would you handle a disgruntled employee"}, {"date": "31 Mar 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Harrison College (Indianapolis, IN) in Jan 2010", "Interview Descriptions": "The process takes forever.  You have individual, group, and more individual interviews.  All sorts of weird hypothetical questions are asked.  I have been through many interviews, and this was the strangest.  There were people involved in the process who had no relationship to the position for which I was interviewing.  I had no idea how I did.", "Interview Questions": "If you were an ice cream cone, tell me how you would spend your day?"}, {"date": "2 Feb 2010", "title": "Online Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Harrison College (Indianapolis, IN) in Jan 2010", "Interview Descriptions": "When I applied online, everything was fine. They sent out this questionairre (which I hate, if you wanna know about me, stop trying to prescreen me first) and we had to complete that with salry requirements. The day of the interview, they give you a brief packet explaining about the founding of the school, blah, blah and a description of the position. In a nutshell, you would be working long hours and it is mainly on sales", "Interview Questions": "What do you like and what would you improve about www.harrison.edu?"}], [{"date": "10 Apr 2013", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Harrison College (Elkhart, IN) in Jan 2009", "Interview Descriptions": "Was interviewed by the Dean and was hired on the spot.", "Interview Questions": "None"}]]