[[{"date": "24 Feb 2023", "title": "Multimedia Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at University of Galway (Galway)", "Interview Descriptions": "Easy. Phone call followed by zoom call. During lockdown so interview and job all online. Was a short contract so the interview was informal and swift. Enjoyed the interview process", "Interview Questions": "Is there anything you find daunting about this position?"}, {"date": "29 Aug 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Galway in Oct 2021", "Interview Descriptions": "When doing your CV, make sure you list all your technical skills in a list, these will be critical to be selected for the next round of interview. For the face to face interview, you will need to prepare a presentation to show your previous research. Three interviewers will be present. Questions are related to previous research conducted and technical expertise.", "Interview Questions": "Previous research conducted\r\nHow I faced ta difficult technical situation in the past"}, {"date": "27 Nov 2021", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Galway (Galway) in Jul 2021", "Interview Descriptions": "i made an application online via the website and vacancies portal. \nI was then called for interview\nthere was 4 interviewers on the panel\neach interviewer took a section\nThe interview  took approximately  1 hour from start to finish.", "Interview Questions": "teaching strategies\nresearch output\ncurriculum review process "}, {"date": "11 Sept 2020", "title": "Sr. Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Galway", "Interview Descriptions": "Proposal submission and review followed by an interview on skill set. The interview was online and very friendly. I got a positive reply within 2 weeks. Th offer letter arrived later after another two weeks with continuous communication for documentation required.", "Interview Questions": "Future plans, Loop holes in proposal and time line for finish"}, {"date": "15 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Galway (Galway) in Oct 2019", "Interview Descriptions": "Emailed the professor of the lab my updated CV and cover letter. Upon review, I was called for one interview with a panel of 4 members after which I was offered the job.", "Interview Questions": "Why I wanted the job?"}, {"date": "17 Jul 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Galway", "Interview Descriptions": "Already had an established relationship with hiring manager and they were aware of my previous internship history. There was no formal interview for the position based on their knowledge of my work history and activities.", "Interview Questions": "What course was I pursuing currently"}, {"date": "31 Jan 2019", "title": "Placement Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Galway (Galway)", "Interview Descriptions": "The interview was intimidating, even for someone very experienced like myself. The reason it was this way is because i was left waiting in a hallway for over 40 minutes - the only contact anybody made with me were some friendly folks passing by. \r\n\r\nWhen i was finally called for my presentation and interview,  i immediately felt like i wasn't welcome. I was rushed through everything, only one person on the panel seemed friendly and the others seemed like they were going through the motions. Somebody even mentioned that they were running into their lunchtime - message received.\r\n\r\nThe most unfair and upsetting element of this process was that my interview took 30 minutes - longer than i was sitting outside and clearly longer than the candidate before me. \r\n\r\nMy presentation was great and i was well prepared, I have years of experience that i was not asked about clearly because the interviewers were hungry. \r\n\r\nI am not easily stressed by interviews.... this was a truly awful experience\r\n\r\nI would never raise this directly with the university because i could never apply for a job there again if i went on record about this unprofessional interview.\r\n\r\nPlease treat people with respect, those being interviewed are trying to change their lives and work for a prestigious university.", "Interview Questions": "How i would secure placements for students and what methods i would use"}, {"date": "16 Apr 2019", "title": "Design and Manufacturing Engineer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Galway (Galway) in May 2018", "Interview Descriptions": "The interview process was straight forward. A breif overview of background up to date was given. Then typical questions of experience and skills.  Further question where asked regarding skills related to the job. Finally, closing question from the candidate where expected", "Interview Questions": "What is your 5 year plan?"}, {"date": "15 Jan 2022", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Galway (Galway) in Apr 2018", "Interview Descriptions": "It was a virtual interview via skype asking general questions and some technical questions. I applied for Hardiman scholar and did not get the scholar but got another scholarship in the same university.", "Interview Questions": "General questions related to my research area in the masters and why I want to do the PhD from this specific university and country."}, {"date": "20 Sept 2018", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Galway (Galway) in May 2017", "Interview Descriptions": "applied online. Got mail and asked to attend interview. Prepared with general data available in  internet for the post of CRA.  Learned about research and GCP. Asked about GCP, data collection, monitoring , patient safety . Also on CV, past experience in the filed", "Interview Questions": "GCP"}], [{"date": "14 Jun 2020", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Galway (Galway) in Dec 2016", "Interview Descriptions": "Absolute joke on an interview. Flew 6000 miles to deliver a 20 min lecture to interview panel on subject that was preselected and not my subject area. Then a half an hour interview. Was in town several days. No tour of campus. No meal. No meet and greet. Just one hour of contact. Never even saw the department. Interviews had empty lunch plates and waste strewn across their table and one fell asleep. Only half my expenses reimbursed, and even they were several months late. Felt very disrespected. Job went to internal candidate, who, surprise surprise, was expert on topic I’d been asked to prepare lecture on. Went back to my home institution with incredibly bad perception of the department and university.", "Interview Questions": "How could you bring in the department money from industry. "}, {"date": "26 Apr 2014", "title": "Lecturer Below the Bar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Galway", "Interview Descriptions": "They requested a 20 min presentation on a preselected topic related to the job interview with a Q&A session on the presentation, my research interests and general views on teaching and research", "Interview Questions": "where do you see the role of this school in the overall future of the university"}, {"date": "23 Jan 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Galway (Galway) in Mar 2014", "Interview Descriptions": "Paper application including CV and cover letter. Formal interview by boss-to-be, other stakeholders, HR staff. Fair and thorough interview with questions from various stakeholders. Received notification of selection for interview and job offer in a timely fashion.", "Interview Questions": "Experience"}, {"date": "13 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Galway (Galway) in Feb 2013", "Interview Descriptions": "Panel of 2. Usual chat about work experience and the like. Told them about education experience in the university and about my cell culture experience. Pretty low level position so not too much pressure.", "Interview Questions": "Experience in college "}, {"date": "30 Oct 2015", "title": "Senior Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Galway (Galway) in Sept 2011", "Interview Descriptions": "Application by CV and interview form, interview held a few months later - comprising 8 senior staff and external independent reviewers - I had to give a presentation on a pre-set topic and interviewed immediately afterwards for approximately 40 minutes. I was asked a wide range of questions on all aspects of my employment history and goals. On comparing notes with other candidates afterwards, we were asked very similar questions in the same order.", "Interview Questions": "Hardest question was on my view of the current publishing policies of academic journals in my area"}, {"date": "23 Nov 2015", "title": "Archivist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Galway (Galway) in Feb 2011", "Interview Descriptions": "Very structured, 5 people on the panel: Head librarian, Deputy head librarian, Sub-Librarian who manages the post, one academic and one external person.  No one from HR. The structure of the interview followed the job spec in the advert very closely.  A fairly straight forward effort to access your suitability for the job.", "Interview Questions": "How do you deal with a colleague not pulling their weight"}]]