[[{"date": "1 Nov 2022", "title": "Nutrition care partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaineGeneral Health", "Interview Descriptions": "Different because I was remote but involved a quick intro phone call from a direct supervisor telling me about the position. Then a scheduled phone call interview answering questions for 30 minutes by my supervisor and 30 minutes from my would be coworkers.", "Interview Questions": "They asked how I reflected company values in the past like respect."}, {"date": "30 Jul 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at MaineGeneral Health", "Interview Descriptions": "I rated as difficult mainly due to the lengthy process.  The office that hired me was trying to fill an immediate \nopening, and even moving through the interview  process as quickly as possible,  it still  took a full month from the 1st interview to my start date.\n\nI had a quick phone screening interview that led to scheduling a one on one interview with a Lead PSR.\n\nAfter  passing  both initial interviews,  I had a panel interview with three employees from different departments. (a Peer Interview) \n\nThe second and third interview were fairly lengthy.  They seemed to want detailed,  well thought out examples of some past work experience.  \n\nThe staff I interviewed with were all kind and respectful. \n\nThe questions and vibe are pretty obvious for a patient service role.  You will be working the public in a medical setting,  so can you be empathetic,  polite and professional while safeguarding patient information?  \n\nExpect to provide examples of times  you have worked with difficult  people and helped to deecalated a situation to achieve a positive outcome. These situations are very common in the medical world and it was clear that they were looking for a candidate that could navigate them appropriately.", "Interview Questions": "Tell me about a time that you had to help a customer/patient but they did not have the outcome they they were looking for?  \n\nEach person on the  peer interview panel can ask their own personal  questions as well. They are usually trying to get a sense of how you will work with the existing group of people at their practice. "}, {"date": "26 Apr 2023", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaineGeneral Health (Waterville, ME) in May 2019", "Interview Descriptions": "First interview is with hiring manager and another manager. Second interview with group of peers. They ask questions given to them directly from Human Resources. Most are basic like difficult time working with a co-worker. How do you work with a team...", "Interview Questions": "tell me about a time when you had a conflict with a co-worker or supervisor. how did you handle it."}, {"date": "25 Jan 2019", "title": "Practice Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MaineGeneral Health", "Interview Descriptions": "The process was great. I enjoyed the peer interview process. HR was great working with as well. The facilities were nice. People were nice. Food was great. Questions were easy. Training was great", "Interview Questions": "Team work"}, {"date": "31 Mar 2018", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MaineGeneral Health (Augusta, ME) in Mar 2018", "Interview Descriptions": "The interview was set up promptly via telephone contact with the department manager.  It was very professional.   The Human Resources department, on the other hand,  is an entirely different story.  The process to actually get hired is lengthy and the applicant has to jump through hoops regarding the on-line survey that is sent to the applicant's references of which they require (4).  All of whom you have to hope and pray that they are willing to complete it and email it back via the email link sent by health Source.   This is something the applicant has absolutely no control over but this will prevent you from being hired if they don't complete it.   It would be much more efficient and faster if the Human Resources Department could call/contact the references themselves.  Placing the applicant in the middle of things just leaves a bad impression and could ultimately lead to the applicant being hired by another employer because the process is taking too long.", "Interview Questions": "Explain an example of a time when I went beyond normal every job duties for the benefit of my patients. "}, {"date": "10 Oct 2017", "title": "Clinical Applications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaineGeneral Health (Augusta, ME)", "Interview Descriptions": "Phone interview with chance to ask questions understand the role. \r\nThen manager in person interview ,\r\nIf good fit followed by Peer review. \r\nBehavioral  interview , group appraoch . Team engages . Background check and health screening after job interview", "Interview Questions": "If you could be any kind of super hero , who would you be and why ? "}, {"date": "5 Sept 2016", "title": "Urology Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MaineGeneral Health (Waterville, ME)", "Interview Descriptions": "You'll first have a phone interview. If you pass this part, you'll have a face to face interview with the manager. If you pass this part, you'll have a peer interview. The peers will help decide whether or not to hire you.", "Interview Questions": "Tell us about a time you were unable to complete your tasks "}, {"date": "17 May 2018", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaineGeneral Health (Augusta, ME) in Oct 2014", "Interview Descriptions": "Very thorough interview process with ample time to ask questions and assess for a good fit for the interviewee and the interviewer:  initial phone screening interview, followed by face to face interview with manager. Selected candidates are then interviewed by a panel of peers that make the final decision.", "Interview Questions": "Name a time when you went above and beyond for customer service."}, {"date": "24 Feb 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MaineGeneral Health (Augusta, ME) in Aug 2014", "Interview Descriptions": "Typical interview with management followed by a surprise interview with CEO. CEO was late and was an overall jerk throughout the entire 'interview'. Spent the entire hour griping about the previous financial analyst. Made no attempt to 'sell' the hospital or the position. This was a prime example of what was to come working with senior leadership.", "Interview Questions": "Describe your previous experience"}, {"date": "12 Apr 2014", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MaineGeneral Health (Augusta, ME)", "Interview Descriptions": "On-line application. Phone interview. Manager interview. Group interview.", "Interview Questions": "You have a lot of education, why do you want to work here?"}], [{"date": "7 Feb 2013", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MaineGeneral Health", "Interview Descriptions": "About an hour interview. Not very professional . Felt more like a little gab session. The interviewer talked about herself more the job.", "Interview Questions": "What are you most proud of?"}, {"date": "6 Nov 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at MaineGeneral Health (Augusta, ME) in Nov 2012", "Interview Descriptions": "The initial interview with unit manager was quick & easy to get. If you are a top candidate, expect at least one other 'peer interview\" with 2-4 co-workers. My peer interview was with 2 charge nurses, but not the charge nurses I would be working with. Peer interviewers are given a set of questions to ask each interviewee. Most are about working as part of a team, customer service, worst customer experiences, how you handled a difficult situation.", "Interview Questions": "None of my questions in the interview threw me for a loop. Most were of the same caliber as other interviews. I will say I wish I had asked one question of my interviewer \"What is the best and worst aspect of this unit's culture?\" "}, {"date": "22 Apr 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MaineGeneral Health (Waterville, ME) in Nov 2012", "Interview Descriptions": "First interview is with the unit manager, then there is a peer interview with 2-4 staff from the unit. Unit Manager has selected questions given by HR followed by candid information about the unit, hours, nature of the work. Peer interview questions are selected by HR and given to the peer interviewers.", "Interview Questions": "Tell me about a time when you were faced with a difficult situation; how did you handle it?"}, {"date": "12 Jan 2012", "title": "Senior Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MaineGeneral Health (Augusta, ME) in Dec 2011", "Interview Descriptions": "I was contacted over the phone to interview for the position.  After an interview with the Director of IT and Director of the PMO I was asked to participate in a group interview via skype.  Since this position required relocation I suggested a face to face.  I was required to pay for my own flight and accomodations for the interview and a week later I was offered the position at a salary less than was discussed during the first interview and a significant amount less than I was making previously.  I initially accepted the position and was then subjected to a pathetic and incompetent HR department which among othere things informed me that I had to fly in a week before I started to take a picture for my employee bage.  After several polite requests to do it the day I was hired they firmly said no.  I then declined the position as I have never seen an organization that requires you to come in a week early (at your own expense) to take a picture.  There were many other issues including several doctor's visits for physicals, hearing and eye tests, TB tests - all done on personal time and not reimbursed.", "Interview Questions": "There was nothing difficult or unexpected about the questions."}, {"date": "24 Aug 2013", "title": "Patient Service Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MaineGeneral Health (Augusta, ME) in Jul 2010", "Interview Descriptions": "The interview process has completely changed since I was hired", "Interview Questions": "N/A"}, {"date": "9 Jan 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at MaineGeneral Health (Waterville, ME) in Feb 2010", "Interview Descriptions": "Asked me if I wanted to work.", "Interview Questions": "\"what's your favorite scary movie?"}, {"date": "14 Sept 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at MaineGeneral Health (Waterville, ME) in Apr 2008", "Interview Descriptions": "Online application, face-to-face traditional interview.", "Interview Questions": "I do not remember.  I started working there at least 10 years ago."}]]