[[{"date": "22 Mar 2023", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New York Blood Center", "Interview Descriptions": "Pretty standard interview, good feeling with employer who was natural and nice. Regular interview questions, no unusual or unexpected questions or remarks from interviewer. Interview was done through video call.", "Interview Questions": "Tell me more about yourself. Are you familiar with X platform."}, {"date": "30 Sept 2022", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York Blood Center in Sept 2022", "Interview Descriptions": "There is a video interview followed by an in person interview. If you are a good fit you will receive a job offer in less than 2 days after interview \n", "Interview Questions": "Why a non profit ?"}, {"date": "15 Sept 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Blood Center in Jun 2022", "Interview Descriptions": "A phone screening with HR and then one 45 minute interview over Zoom with the supervisor. Both interviews were fairly easy.  After the second interview, I received no follow up and assumed I wasn't chosen. \n\n", "Interview Questions": "Why this role? \nWhere do you see yourself in 5 years? \nWhy nonprofit?"}, {"date": "7 Jun 2022", "title": "Account Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Blood Center in Apr 2022", "Interview Descriptions": "The first call was with their recruiter, standard information sharing and gathering.  Followed by an impromptu call with the hiring manager.  Explained company structure, job role and requirements, also answered questions about training processes, scheduling and compensation.", "Interview Questions": "Why do you want this job?"}, {"date": "26 Aug 2021", "title": "Registered Nurse RN BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York Blood Center", "Interview Descriptions": "It was a really bad experience. They did a video interview with two managers and the video was off so you could not see who you where interviewing. Also they wanted me to be licensed in NYNJ,CT and Pennsylvania. They will also ask for you to do on call as well. They expect way too much.", "Interview Questions": "They asked me if I was licensed in other states like CT, NJ and Pennsylvania."}, {"date": "27 Sept 2021", "title": "Vice President, Ventures & Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at New York Blood Center in May 2021", "Interview Descriptions": "The interview process was fairly standard: it started with a phone screening interview with HR, then a video interview with the hiring manager, and was concluded with a two-hour video interview across a panel of five NYBC senior executives.\r\nFielding unrelated uncoordinated questions from a panel of complete strangers would be difficult for any one; but after all that investment of time and effort - and for a senior position of Vice President, I was completely ghosted. Never heard from the Company again. Beyond unprofessional.", "Interview Questions": "Being on the receiving end of a firing squad of questions, there was no time to take notes."}, {"date": "15 Mar 2021", "title": "Research Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at New York Blood Center in Aug 2020", "Interview Descriptions": "The interview process is fairly easy and straight forward. They are interested in learning about your interests and how you will succeed in the position. Everyone is very friendly and seemed to like their jobs.", "Interview Questions": "Tell me about yourself\r\nWhy are you interested in the position?\r\nMore specific questions related the qualities you can bring to the projects. "}, {"date": "15 Oct 2021", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Blood Center (Elmsford, NY) in Sept 2019", "Interview Descriptions": "Before the interview process there was a plentiful of paper work that you had to send to HR. Also there was an assessment that had to be completed beforehand as well.", "Interview Questions": "Wasn't really your typical interview. It was very laid back. Mostly was told about the company and what they stand for. "}, {"date": "11 Apr 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New York Blood Center (New York, NY) in Feb 2019", "Interview Descriptions": "First a phone call with the hiring manager followed by an interview and a meeting with HR.  Very polite and helpful throughout the interview process. Interview took about an hour.", "Interview Questions": "Work experience, education, work style "}, {"date": "19 Dec 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Blood Center (New York, NY)", "Interview Descriptions": "Applied online and received an interview a few days later. It was pretty straight-forward. Around half an hour, went through your resume, especially the projects you did. Do prepare yourself before the interview, good luck!", "Interview Questions": "Basic statistics questions"}], [{"date": "26 Sept 2016", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Blood Center (New York, NY) in Jul 2016", "Interview Descriptions": "I was called by the individual that I would be reporting to and he was very quick to make sure that I understood that the role would be challenging. Once I explained that I was capable of handling the responsibility, an onsite interview with scheduled. The individual didn't take any time to ask questions about my background, work or current employment status.\r\n\r\nDuring the 1st onsite interview, I met with the person who called me. Once again, there were no questions about my work experience, my management history, my strengths or shortcomings. Instead it was filled with the same lines that I had heard over the phone; that the role was going to be challenging and they needed someone who could handle the load. Again, I explained that I felt capable of stepping up to the challenge.\r\n\r\nOn the 2nd onsite interview, I was introduced to the VP of HR and the interview was far more cordial. Her questions were engaging and relevant to my experience and she took time to speak with me about the responsibilities, the perks and the culture; all concepts that the first interviewer failed to discuss. \r\n\r\nThat was my last encounter from the New York Blood Center. I never got a call saying 'thank you for your time but we're going with someone else'. They're unprofessional behavior carried them all through this interview process. It's clear that the Talent Acquisition/HR lacks organization and leadership. I hope whoever got this role has the patience to work in such a chaotic atmosphere.", "Interview Questions": "Are you sure you can handle this work?"}, {"date": "1 Oct 2016", "title": "Immunohematologists Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at New York Blood Center (Long Island City, NY) in Jun 2016", "Interview Descriptions": "The overall interview process was smooth and comprehensive, and all questions asked were that position-specific, I feel comfortable to answer all that questions from best of my professional experience and knowledge. I met with the administrator director first, then the technical director and manager afterwards, they are very professional and polite about how I prepare this position, but unfortunately, I never hear them back! I did feel that the position is quite fit for me.", "Interview Questions": "Tell me about your job flow? "}, {"date": "14 Oct 2013", "title": "Donor Relations Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at New York Blood Center", "Interview Descriptions": "I had to enter an application to HR, which took about 5 days to get back to me. I then had a phone interview with a talent recruiter, then an in person interview with the director of collections. I was then emailed and told that I had receiver the position.", "Interview Questions": "Why would you want to work in the non profit industry for a company that is manufacturing a biologic?"}, {"date": "12 Oct 2013", "title": "Account Manager Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at New York Blood Center", "Interview Descriptions": "First in line...gets the job.", "Interview Questions": "There was no vetting...got the job offer because I was the first one to apply"}, {"date": "16 Sept 2013", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Blood Center", "Interview Descriptions": "Very easy. They were mostly telling me about the position and its mission. I met with three different staff members including the VP. Just prepare for this interview and make sure you ask really good questions about the position and the company.", "Interview Questions": "Nothing too difficult just questions about my experience and my knowledge about the position.  "}, {"date": "6 Feb 2017", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at New York Blood Center (Westbury, NY) in Mar 2013", "Interview Descriptions": "The hiring and interview process was quick. As soon as you get the necessary paperwork in order,  you should hear from then within the week. Questions are straightforward, nothing to complicated.", "Interview Questions": "Are you aware of the shift,  and will it be a problem. "}, {"date": "18 May 2013", "title": "Information Systems Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at New York Blood Center (New York, NY) in Dec 2012", "Interview Descriptions": "need to take two days off from work. I met up to six people, two of which were ad hoc.", "Interview Questions": "was reporting to another manager in a position that was basically a conflict of interest."}, {"date": "27 Feb 2014", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Blood Center (Westbury, NY) in Jul 2010", "Interview Descriptions": "Called in for initial interview.  Second interview had to make a presentation to a group. \r\nOffered the job.", "Interview Questions": "None, typical interview questions."}, {"date": "26 Mar 2014", "title": "HLA Laboratory Technologist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at New York Blood Center (New York, NY) in Jun 2010", "Interview Descriptions": "You get a call from HR for a 1:1 interview and if you pass it you get to be interviewed by the Manager the following week. If everything goes well then you get a 3rd interview with HR which is when they'll discuss and offer the job to you. As for interview questions they ask something like: describe yourself, strengths/weaknesses, describe a difficult work situation and how you positively handled it  etc", "Interview Questions": "i think behavioral questions are the most difficult which you need to prepare yourself for."}, {"date": "24 May 2013", "title": "Lab Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Blood Center (New York, NY) in Jan 2010", "Interview Descriptions": "Interview with HR followed by interview with lab director and manager", "Interview Questions": "Mostly not difficult questions"}]]