[[{"date": "N/A", "title": "Caregiver, CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at USC Verdugo Hills Hospital (Glendale, CA) in May 2022", "Interview Descriptions": "Interview was remote through zoom. They got back to me within 2 weeks of applying, and was offered within 2 weeks after my interview. Process was relatively easy and the interview was 1:1", "Interview Questions": "Describe a time when you were busy and feeling stressed at work and how did you handle the situation"}, {"date": "20 Jan 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at USC Verdugo Hills Hospital (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "Hr called me to screen Interview set up for in person interview In person panel interview with charge nurse, manager, director Got offer 2 days later via email by HR", "Interview Questions": "Why USC Describe a time you felt uncomfortable with a doctor's orders"}, {"date": "17 Oct 2020", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at USC Verdugo Hills Hospital (Glendale, CA) in Sept 2020", "Interview Descriptions": "I was called for an interview in September 2020. I interviewed with a gentleman who asked me some pretty straight forward questions. Then I was asked to stay for another round of interviews. I interviewed with three other managers who were all very nice. I was called for a pharmacology exam the next week.", "Interview Questions": "Please tell me about yourself "}, {"date": "27 Sept 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at USC Verdugo Hills Hospital (La Canada Flintridge, CA) in Sept 2020", "Interview Descriptions": "I applied in August and interviewed in September. The interview was with multiple managers and one director for Med/Surg, TCU, and Tele. There were two rounds of interviews and then I was called in to take a pharmacology test the following week.", "Interview Questions": "What are the three most important nursing roles"}, {"date": "8 Nov 2020", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at USC Verdugo Hills Hospital in Sept 2020", "Interview Descriptions": "There were employees from different units. You are asked to approach them. Ever table asks from 4-6 questions. Mostly behavioral questions, or  questions about past experience. There were questions how to prioritize as well.  They are very nice", "Interview Questions": "What problem you had and how you overcomed?"}, {"date": "28 Oct 2022", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at USC Verdugo Hills Hospital (Los Angeles, CA) in Aug 2020", "Interview Descriptions": "The interview was fairly laid back and basic. Everything was on time and as scheduled. I met with the Lab Manager at the time and he was very kind and respectable. He put my worries at ease and gave a tour of the lab. Employees were all nice and welcoming.", "Interview Questions": "What made you want to me an MLT?"}, {"date": "12 Apr 2019", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at USC Verdugo Hills Hospital (Glendale, CA)", "Interview Descriptions": "Overall great experience. Very friendly manager, also I got a chance to meet the unit staff.  Interview went great overall, currently waiting on the offer.  Hopefully will get it in the next week or so.", "Interview Questions": "where do you see yourself in 5 years."}, {"date": "17 Nov 2017", "title": "Patient Financial Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USC Verdugo Hills Hospital (Glendale, CA)", "Interview Descriptions": "Great interview!!! I enjoyed meeting with the two ladies, they asked basic questions tell me about your last jobs, do you know about this job, when have you not gotten along with an employee .   \r\nBut for USC here's the note for you,\r\nHere's were it's concerning the pay is $14 an hour!!! UCLA pays almost $7 more.  We are in Southern California there's no way someone can live off of $14 an hour.   I declined the job right away.  If USC decides to do a pay huge raise I wouldn't mind going back to work with those ladies!!!", "Interview Questions": " What do you know about this position?"}, {"date": "6 Oct 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at USC Verdugo Hills Hospital (Glendale, CA)", "Interview Descriptions": "Interview took place with Director, Unit manager, and clinical manager. Responded well to bringing a portfolio, used it to guide questions specific to area of interest and experience. Each interviewer asked questions related to their purview and all asked questions that let them know how I would fit into the facility/unit culture.", "Interview Questions": "Tell us about yourself. Do you see yourself remaining in this specialty? "}, {"date": "20 Jun 2012", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at USC Verdugo Hills Hospital (Glendale, CA) in Mar 2010", "Interview Descriptions": "Recruiter reviews applications.Assessment.Hiring manager interview.Back ground checks.", "Interview Questions": "what do you find most rewarding about being a nurse?"}]]