[[{"date": "N/A", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scottish Rite for Children", "Interview Descriptions": "Quick and Easy. The staff were very nice and easy to talk to. They asked a series of question and then let me ask a couple. I got an offer and started not even two weeks later.", "Interview Questions": "Are you proficient in Word and Excel?"}, {"date": "1 May 2023", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scottish Rite for Children (Frisco, TX)", "Interview Descriptions": "There were 3 rounds of interview. The first two rounds were short and over the phone and final round was in person where I met with a group of 4 doctors and people currently in the position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Sept 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scottish Rite for Children", "Interview Descriptions": "It was great! I got a tour and everyone is so friendly, you have a 1:1 with the department manager, after the interview process they let you know when they will call you.", "Interview Questions": "Tell me about yourself, what type of previous experience you have "}, {"date": "3 May 2019", "title": "Summer Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Scottish Rite for Children", "Interview Descriptions": "I know some areas had different types of interviews (ex. panel, two on one, Skype, etc), but mine was a one on one interview, at the facility in Dallas. Very friendly and open, explained the process of what would happen afterwards. Asked how I would handle certain situations, why I chose nursing, etc. After applying heard back around a month after about interviewing, set up online. After the interview process, it was about 1-2 weeks before receiving an email asking to call regarding the position, at which point I was told I was selected and accepted my position.", "Interview Questions": "Have you ever experienced a conflict with a  difficult mentor/day in clinical rotations? Explain what happened."}, {"date": "14 Oct 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scottish Rite for Children (Plano, TX) in Apr 2018", "Interview Descriptions": "I interviewed at the North campus for sports medicine and fracture clinic.  There were 3 people, the director, nurse manager, and nurse. They were all friendly and nice, making the interview smooth.", "Interview Questions": "Why do you want to be nurse?"}], [{"date": "17 May 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scottish Rite for Children", "Interview Descriptions": "Interview process was fairly simple. You apply online and if they think you're a good fit then you are scheduled for an interview, after that you're scheduled for a drug test and depending on how that goes and how your background is you'll get an offer for employment.", "Interview Questions": "Normal interview questions."}, {"date": "1 Jul 2017", "title": "Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scottish Rite for Children in Apr 2017", "Interview Descriptions": "They asked for you to bring a list of objectives of what you wish to get out of the program and your unofficial transcript. They sent an email with a link to sign-up for an interview time. There were two managers and one clinical coordinator. They were nice and so were the volunteers for the hospital.", "Interview Questions": "If we asked your best friend what two of your best qualities (and two you need to work on), what would they say?"}, {"date": "28 Jun 2015", "title": "Summer Nurse Externship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scottish Rite for Children (Dallas, TX)", "Interview Descriptions": "I was interviewed by 2 managers. It was in small office and casual. They asked me many questions to figure out my experiences and my personality. They asked specific questions with patient scenarios. \r\n\r\nI had met both of them at the open house for the program. Overall, it was a great learning experience.", "Interview Questions": "Why I want to work for them"}]]