[[{"date": "3 Dec 2022", "title": "Content Writer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Helio Health", "Interview Descriptions": "Multiple interviews with various Human Resources and department representatives. The process was over two months. There were also multiple writing and editing tests. The tests were easy; all information needed was provided by the company. Communication between interviews was non-existent.", "Interview Questions": "What is your ability to multitask"}, {"date": "28 Feb 2023", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Helio Health in May 2021", "Interview Descriptions": "Many questions about modality preferences/experience. There was one interviewer who was yawning, another who sat in Nebraska….so far away I could not make out facial features. Overall, even now that I have more experience etc I would never work there. Also, the position I interviewed for never even got off the ground.", "Interview Questions": "What is your experience with CBT?"}, {"date": "25 Jun 2019", "title": "Counselor I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Helio Health (Binghamton, NY) in Jun 2019", "Interview Descriptions": "I recieved a call to schedule a phone interview. The phone interview went well, aprox 25 minutes. Was prompted by info would be sent to my local office and contacted for a face to face interview. Within 35 minutes, I had a call from my office setting up an interview for Monday. Went for my face to face and was brief, but seemed to go well. Left feeling positive. Recieved an email from my phone interview associate. Said she would hear in 2 business days. 10 minutes later, was informed I'm not a fit for their faculty. However, upon asking for a critique of my interview, they never responded back.", "Interview Questions": "If you had a client ready to discharge, and they were excited to be moving to the next step but didn't have a suitcase, would you give them one of yours from home you no longer use?"}, {"date": "7 Sept 2018", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Helio Health (Oswego, NY) in Mar 2018", "Interview Descriptions": "Interviewing is very lengthy and time-consuming usually spread over a month or longer expect a lot out of you without even making a job offer they also ask discriminating questions as what is your age and health related questions.  Very generic and textbook interview questions no opportunities to get to know you", "Interview Questions": "Tell me about yourself"}, {"date": "4 Feb 2018", "title": "Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Helio Health (Syracuse, NY)", "Interview Descriptions": "I went online, picked a job that matched my qualifications, wrote a cover letter and resume and writing sample, sent it into hr, followed up several times, and finally showed enough initiative to get an interview. I was polite and confident yet humble and courteous. I listened and asked questions. I was professional and engaged with light humor. I was given a tour on the spot.", "Interview Questions": "What are your best qualities? "}, {"date": "21 Jan 2019", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Helio Health (Syracuse, NY) in Dec 2017", "Interview Descriptions": "I had a phone interview with someone in HR, and it was a typical phone interview, although she spent an awful lot of time \"selling\" me on the company.  At the end I was told that she would be sending me an application to fill out and to send it back ASAP, whereupon I would be contacted by the person running the department I was applying.  The application never showed up, so I followed up via email with no response. It was during the holidays, so I waited and followed up a second time just after Christmas. Still no response. I finally followed up a third time after January 1st, again with no response. About a month after that I received a form email saying that they had chosen someone else. I was very frustrated and annoyed that I never received any responses to my polite querying about the situation, and it has made me view the organization in a negative light.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Nov 2021", "title": "Counselor Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helio Health (Syracuse, NY) in Dec 2017", "Interview Descriptions": "I interviewed at two different programs within Helio Health. The interviews were very different. One was with 3 different people and felt more formal. The interviewers did not seem very warm or friendly. \r\n\r\nThe other interview was with one person and felt more like a free flowing conversation. The interviewer was very welcoming and friendly. That being said, that interview was originally supposed to be with another person who ended up calling out sick that day and did not make me aware of that. So, when I showed up to the interview, the staff at the front desk scrambled to figure out whether or not there was still someone to even interview me that day.\r\n\r\nI ended up accepting a position with them after the second interview, but I do think the interview process could be smoothed out a little.", "Interview Questions": "Why do you want to work for Helio Health?"}, {"date": "19 Sept 2017", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Helio Health", "Interview Descriptions": "I was contacted  for a phone interview about a day after submitting my application. The phone interview went well and I was brought in for a face-to-face interview. Again it went well. I was told that I was wanted on board and my paperwork would be sent to human resources. We discussed pay, I was given a brief tour, and introduced to my future coworkers. I was notified by my references within a week that they had begun contacting them.  I was contacted repeatedly for one \"missing\" thing or another that needed to be filled out to \"complete\" my application and send it to the hiring manager. This meant filling  out a form for the background check, submitting transcripts,  ect. I was thanked by HR for being patient throughout the onboarding process because they are not generally this disorganized.  A week or so after not hearing from anyone  (at about this point my then-present job's notice had already ended) I called. My prospective supervisor never returned my call. HR did not return my call. I eventually spoke to HR who told me the programs where making final decisions about candidates at the end of the week and I would know then.  If they decided to hire me, I would be asked to complete a drug test and undergo fingerprinting. This was confusing because I had been told I got the job AND that I was in the final stages of on boarding and I was \"set to go\". Well, lo and behold, I received an email HR on a Friday saying they chose another candidate who met the job requirements. Needless to say, I was beyond frustrated that I wasted all that time, resigned from my job, and even turned down another job for this opportunity. While I am hopeful that they are more professional once hired, this experience alone has made me very leery of this agency. Good luck to the rest of you!", "Interview Questions": "What skills do you have that would make you a good fit for this position?"}, {"date": "2 Jul 2017", "title": "Counselor II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 5 weeks. I interviewed at Helio Health (Rochester, NY) in May 2017", "Interview Descriptions": "Very long process. Company requests information documents references fingerprinting signatures individually instead of at one time. Have difficulty returning calls will follow up with email after a few days to one week. The interview was wonderful and they were thorough with asking and answering questions did a full tour but avoided salary", "Interview Questions": "Why should we pick you over other candidates"}, {"date": "25 Aug 2017", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Helio Health (Syracuse, NY) in Jan 2017", "Interview Descriptions": "The interview process is long and cumbersome. 2-3 interviews and poor communication  time.   It will take you 4-5 weeks to get hired and thats after the offer is made.  Make you jump through hoops to pay you low.  Finger printing, background check, references, drug test, selling your first born the list goes on.  If your not in a rush to get a job then go for it but if you need a job ASAP go somewhere else.", "Interview Questions": "How old are you ?"}]]