[[{"date": "6 Jul 2023", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "the procedure included two interviews. in the first one I introduced myself as well as shared some ideas regarding how I would tackle the project. the interview was in person. in the second interview I got to talk to some more people from the group and it was less formal", "Interview Questions": "how would you tackle the project"}, {"date": "14 Jun 2023", "title": "Junior Policy Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Delft University of Technology", "Interview Descriptions": "I was invited for a first interview and asked to prepare a 5 minutes pitch on why I was a good fit for the role. There were 3 people in my interview, including the department head. They were all very friendly and asked questions about my experience. I also got a reply only 2 days later from the department head on why I wasn't selected for a next interview with feedback and good advice on how to improve.", "Interview Questions": "Have you ever been in a board or done policy work before"}, {"date": "24 May 2023", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Delft University of Technology", "Interview Descriptions": "Two interviews. One online. one in-person Two presentation for teaching and research You need to teach for 20 mins and give a presentation on your research vision. It also depends on the department", "Interview Questions": "Why do you want to come to TU Delft?"}, {"date": "2 Apr 2023", "title": "Engineering Position Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delft University of Technology (Delft) in Feb 2023", "Interview Descriptions": "The interviewers were very friendly and had some sense of humor and was empathetic. I really enjoy the interview itself. There are two stages of the interview, first stage is a presentation of my previous experience, then continues with a discussion with the close supervisors; second stage is panel interview with additional members from the department.", "Interview Questions": "What are you looking for, most importantly in the new job? What do you see yourself in the next 5-10 years? Would you like to stay long-term and in future lead a team?"}, {"date": "6 Dec 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "Twee rondes. In de eerste ronde werd er gescreend op passende cv en goede motivatiebrief. Voor de tweede ronde volgde het uitwerken van een aantal opgaven en een kort fysiek gesprek.", "Interview Questions": "Voorbeeldvragen uitwerken voor de groep recruiters"}, {"date": "21 Oct 2022", "title": "Support Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delft University of Technology (Delft) in Aug 2022", "Interview Descriptions": "Friendly, was able to talk about my expertise and past experience and was listened to professionally. Grateful for the time that was allocated for my interview, hope they are always this thorough with who they hire.", "Interview Questions": "Where do I see myself in 5 years."}, {"date": "1 Jul 2022", "title": "Project Manger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delft University of Technology (Delft) in Jun 2022", "Interview Descriptions": "Er waren 2 rondes met verschillende medewerkers: de eerste ronde online via teams en de tweede ronde on-campus. Daarna verliep het contact met HR via teams en telefonisch. Alle gesprekken ervoer ik als prettig: het waren stuk voor stuk interessante mensen om te spreken en de omgang (ook met HR) was zeer respectvol. Dat heb ik op andere universiteiten wel anders ervaren.", "Interview Questions": "- Stel je moet een project managen waarbij je *geanonimiseerd* in moet voeren. Hoe zou je dit aanpakken?\r\n- Kun je iets vertellen over de scope van de projecten waar je eerder aan gewerkt hebt?\r\n- Waarom wil je bij je huidige bedrijf weg?\r\n- Hoe ga je om met tegenslag of medewerkers die niet mee willen in een project of verandering?"}, {"date": "21 Mar 2022", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "CV filter firts and then two Interviews. The first one online, and the next one physical in their facilities. The interview was about my previous experiences and what I would do in some cases.", "Interview Questions": "What did you study before?"}, {"date": "3 Jul 2022", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delft University of Technology (Amsterdam) in Mar 2022", "Interview Descriptions": "Asked me about my experiences in numerical modeling and AI networks. Seemed interested and then sent me an email telling me that they will let me know about the decision but then they didnt contact me. It is months now that I am waiting. I know they didn't select me but at least they could let me know.", "Interview Questions": "What is you level of proficiency in working with Python."}, {"date": "18 Feb 2022", "title": "Adviseur recruitment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delft University of Technology (Delft) in Dec 2021", "Interview Descriptions": "In de vacaturetekst staat het sollicitatieproces goed omschreven. Ik voerde twee gesprekken en afsluitend een klikgesprek en arbeidsvoorwaardengesprek. Aan het begin van elk gesprek werd de inhoud van het gesprek nog even doorgenomen en aan het eind werd het vervolg in de procedure nog verder toegelicht. Kortom, ik wist goed wat ik kon verwachten en waar ik aan toe was.", "Interview Questions": "Waarom heb je voor de TU Delft gekozen? "}], [{"date": "3 Nov 2021", "title": "Graduate Student Researcher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "Application procedure was smooth and very direct. It was made clear in all the aspects of requirement to expectation. Most the question were relevant to technical skills and motivation.  Keeping confidence would be the key", "Interview Questions": "Most the question were relevant to technical skills and motivation "}, {"date": "28 Jan 2022", "title": "PhD Candidate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology (Delft) in Nov 2021", "Interview Descriptions": "It was a good interview with panel members from the department. A short 20min presentation of previous research experience was expected. \r\n\r\nOverall good presentation although the decision timeline was not clear", "Interview Questions": "Why did I get a particular low grade in a subject in my bachelor's degree?\r\n\r\nWhat could I add to the project with my previous experience "}, {"date": "28 Oct 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delft University of Technology (Delft) in Oct 2021", "Interview Descriptions": "It was a school market for student to take a look at the different studiest. It contained i formation about the school program, study load and requirements to get accepted", "Interview Questions": "Do you have wiskunde b and physics"}, {"date": "18 Aug 2021", "title": "Graduate Student Researcher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "It was a 3 step process that looked at the competencies and past projects. Following this, future directions for research were discussed. A plan of execution was asked for that ha d to be handed in within a week.", "Interview Questions": " Future interest in domain and how it links to existing work"}, {"date": "11 Jun 2021", "title": "Student assistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "Teams gesprek, geen moeilijke vragen, aardige mensen. Ik kon me goed voorbereiden op het gesprek en het duurde ongeveer een halfuur. Ze gingen niet heel diep in op de inhoud en vooral enthousiasme was belangrijk naar mijn inschatting.", "Interview Questions": "Wat zou jij als eerste doen als jet voor het zeggen had aan de TU?"}, {"date": "30 May 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "Online review by sending the portfolio and resume. Once the professor like the profile, there was a interview with the demonstration of skills and then we discussed the number of hours I can work and salary is already allocated.", "Interview Questions": "how do you make the custom material for rendering?"}, {"date": "21 May 2021", "title": "Career Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology", "Interview Descriptions": "The application procedure at Delft TU is racist against foreigners (even though they make up most of the students who pay the school). Told my Dutch wasn't good enough for an English position so they canceled the interview. The woman (Claire), called me for an interview on Friday, which I prepared for by Monday, then canceled the interview. Treated very poorly and inhumane. Lacked professionality too.", "Interview Questions": "Do you speak Dutch by someone who clearly did not speak enough English to accommodate foreign students. Foreign students benefit from a fluent English speaker"}, {"date": "25 Apr 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "I already knew the supervisor since I had worked under him, hence based on my CV and motivation I got selected for the position.\r\nBut the process is simple. And depends on the position , supervisor and your study loads", "Interview Questions": "What is your motivation for the position? and they also judge if your experience aligns with the position"}, {"date": "7 Apr 2021", "title": "PDeng Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology", "Interview Descriptions": "First round with CV, recommendation and motivation letter check. Second round where you need to present a recent work like a master thesis. Here, you are questioned about technical details and personal motivation. The interview is done with 3 people from PDEng staff team", "Interview Questions": "Why do you choose PDEng over PhD? "}, {"date": "2 Apr 2021", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "First a written motivation with CV attached. Two interviews, with an assignment after the second one. \r\n\r\nInterview was unpleasant, did not get the chance to ask questions. Also did not call me as promised but emailed.", "Interview Questions": "I.e. about how to solve problems with suppliers."}], [{"date": "28 May 2021", "title": "Ph.D. Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology (Delft) in Mar 2021", "Interview Descriptions": "Greetings and presentation of the board, asking about health and social context, questions from interviewrs related to interests, previous work, family composition, discussion about accomplishments and previous results, extra questions space, good bye", "Interview Questions": "Why do you want to pursue a PhD, Tell us about yourself, please describe your current family situation"}, {"date": "16 Jan 2021", "title": "Junior Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "I found the job position online at academic transfer, then applied with CV and motivation letter. I was invited to an interview and after that got a proposal from them.", "Interview Questions": "Could you explain your master's thesis work?"}, {"date": "4 Aug 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Delft University of Technology (Delft) in Sept 2020", "Interview Descriptions": "it was very good since they already knew me from the programme, but it's hard if it is your first time trying to get this position, once you become a TA you can do that over and over very easily", "Interview Questions": "what were your past experiences"}, {"date": "1 Jul 2021", "title": "Technisch assistent Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Delft University of Technology (Delft) in Feb 2020", "Interview Descriptions": "Erg makkelijk, ik werd eerst online gecontacteerd via het online systeem waarna de vacature beschikbaar was. Vervolgens heb ik gereageerd en ik kon eigenlijk al best wel snel langskomen. Dat was echt super, verder is er van alles en nog wat goed regels. Dus op zich vond ik het best wel top, helaas heb ik afgehaakt. Overal heb ik een heel erg goed gevoel bij de TU Delft ben ik ben blij dat ik hier sollicitatie ervaring heb opgedaan. In de toekomst zal ik hier zeker vaker proberen te solliciteren, want het was erg fijn.", "Interview Questions": "Wat denk je ons te kunnen bieden?"}, {"date": "6 Mar 2021", "title": "Teamleider Backoffice Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Delft University of Technology in Feb 2020", "Interview Descriptions": "Voor dit proces heb ik alleen het Online interview gehad. Ik ben niet verder gekomen dan het eerste gesprek met een externe recruiter. \r\nAfgewezen door een recruitment assistant telefonisch met goede uitleg dat ik te weinig relevante ervaring had voor de rol. Maar wel een interessant profiel.", "Interview Questions": "Waar verwacht jij complexiteit in de rol? "}, {"date": "31 Jul 2019", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "You need to check the vacancy page and apply through that page. The supervisor will check your CV and if it is good enough you will be invited to an interview.", "Interview Questions": "Why do you want to do a PhD at TU Delft?"}, {"date": "14 Apr 2019", "title": "Professional Doctorate in Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology (Delft)", "Interview Descriptions": "Document submission online. \r\nInterview in Delft with three interviewers - 1-2 teachers and 1-2 coordinator. If applicant is outside Europe interview is done via Skype.\r\nApplicant must do a short presentation on MSc thesis or similar relevant scientific work.", "Interview Questions": "Describe a difficult situation faced while working in a team"}, {"date": "13 Mar 2019", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delft University of Technology", "Interview Descriptions": "Initial psychological, numerical and logical reasoning exam followed by a HR interview, skype interview and finally presentation/ interview in person. Initial conducted by an agency and latter with the academics involved. It was a long but enjoyable process.", "Interview Questions": "What motivates you?"}, {"date": "16 Mar 2019", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Delft University of Technology (Delft) in Feb 2019", "Interview Descriptions": "I was invited there for a 2-day stay. They paid for everything. The schedule was full and I had a great time getting to know all the people there. I had to give a presentation on my master's project in front of 20 people.", "Interview Questions": "How much computational experience do you have?"}, {"date": "7 Feb 2022", "title": "Student-assistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology (Delft) in Feb 2019", "Interview Descriptions": "Eerst contact opgenomen via email na een vacature op de site van de TU Delft gezien te hebben en daarna een kort gesprek. Je moest ook je CV meesturen maar was erg gemoedelijk allemaal.", "Interview Questions": "Wat is je interesse in materiaalkunde"}], [{"date": "13 Nov 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Delft University of Technology in Nov 2018", "Interview Descriptions": "It was short and to the point. My knowledge of the subject was tested and that was followed by a HR round where we discussed my availability to teach sessions. It was professional", "Interview Questions": "What is the stress strain diagram"}, {"date": "24 Jul 2018", "title": "PhD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Delft University of Technology (Delft) in Jul 2018", "Interview Descriptions": "35-minute interview starting from general questions regarding my studies, courses relevant to the PhD topic and technical questions for some aspects of the topic. Also wanted indirectly to show my motivation in pursuing this position.", "Interview Questions": "Why do I want to do a PhD and what is my view of the specific subject? "}, {"date": "14 May 2018", "title": "PhD Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delft University of Technology (Delft) in Apr 2018", "Interview Descriptions": "Full day interview where I had to read the research proposal and discuss it. This was followed by lunch with the group members and then I had to present my master thesis. And finally I had an interview with all the professors and prospective supervisor.", "Interview Questions": "What motivates you to undertake a study"}, {"date": "13 Jan 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Delft University of Technology (Delft) in Mar 2018", "Interview Descriptions": "In het gesprek kwam naar voren dat de functie toch erg afweek van de beschrijving in de vacature. Daardoor afgehaakt. De uitleg er omheen klopte ook niet naar mijn idee.", "Interview Questions": "Wat wilt u in deze functie bereiken?"}, {"date": "26 May 2019", "title": "Student assistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Delft University of Technology (Delft) in Feb 2018", "Interview Descriptions": "Een gesprek met degene die de afdeling leidt. Heel informeel en prettige sfeer. Goede interesse in mij en in de functie die ik ging volbrengen. Hoorde snel dat ik was aangenomen. Dat was fijn.", "Interview Questions": "Waarom ik geschikt ben voor de baan"}, {"date": "31 May 2022", "title": "Laboratory Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology in Jan 2018", "Interview Descriptions": "recruiting participants for running the lab, filling forms, administrative tasks, oraganizing events, communicating with professors and stuents, networking, collaborations with assistant professors. interviewing, explaining the experiment process, writing job descriptions, post job boards", "Interview Questions": "main questions asked during interview"}, {"date": "29 May 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Delft University of Technology (Delft)", "Interview Descriptions": "Sent application to Section head with Resume and a prior thesis work.\r\nMeeting with Section head in their office.\r\nIntroduction to the research group for about 1 hour. afterwards got a tour around the campus. \r\nIntroduction to project.\r\nAn offer was made on the same day.", "Interview Questions": "Tell me details about previous project work you completed."}, {"date": "19 Mar 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "You should apply for an existing job offers (can be found of the website of the university or on the web at academictransfer, for example) and be good at interview. Normally they invite for 1-1 interview to the location and will pay all related costs.", "Interview Questions": "Give a presentation about previous work"}, {"date": "24 Feb 2020", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Delft University of Technology (Delft) in Feb 2017", "Interview Descriptions": "First I applied via CV and cover letter. Then I had a 1 hour interview via Skype and after two weeks I got invited for a personal interview in Delft. Interview lasted 4 hours and was  quite stressful.", "Interview Questions": "Motivation for doing the PHD project. Why I think that I am a suitable candidate. How my master thesis can relate to the PHD topic"}, {"date": "9 Jan 2017", "title": "Ph D Candidate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Delft University of Technology", "Interview Descriptions": "I had one interview session with the work-package leaders. They asked me about my life as an expat in the Netherlands. In particular, they wanted to assure that I would stay here. They also want to be sure that i can handle a family life along with my PhD research. I was working for this project before applying for the PhD, therefore, they did not go through my technical skills.", "Interview Questions": "They asked about my purpose of doing a PhD and a few questions about related to the project."}], [{"date": "3 Dec 2019", "title": "PDeng Trainee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Delft University of Technology (Delft) in Jan 2017", "Interview Descriptions": "Firstly you present your thesis or a design project you have done. Questions are asked on it. If you pass the first phase you have to complete a second round of personal questions", "Interview Questions": "Intense questions regarding the presented topics. They want to make you reach your limits"}, {"date": "1 Jun 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Delft University of Technology in Nov 2016", "Interview Descriptions": "Setup a personal inteview with the head of the research group. We had a great discussion about my previous research work, my expperiences at the companies I have been in as intern, the work I have done and how those qualities can be used in this project. Then more about the personal stuff, skills and qualities to succeed as PhD etc etc.", "Interview Questions": "Describe your last research work"}, {"date": "25 Feb 2020", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delft University of Technology (Delft) in Sept 2016", "Interview Descriptions": "Cv en brief per email sturen, eerste sollicitatie gesprek met begeleider en twee collega's, contact via email over diploma's en verwijzingen, uitgebreide contact met verwijzingen, tweede sollicitatie gesprek, afspraak met HR", "Interview Questions": "Waarom wil je hier werken?"}, {"date": "10 Sept 2017", "title": "PostDoc researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delft University of Technology (Delft) in Sept 2016", "Interview Descriptions": "The interview took three times. The first two times were the online interview and we wre talking about my previous investigation with supervisor and the cooperation partner and the last time is on-site interview and I show a presentation to the groups of the  target department", "Interview Questions": "Questions regarding to my previous research in detail. "}, {"date": "26 Jan 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Delft University of Technology (Delft) in Jun 2016", "Interview Descriptions": "- Interview was about 10 minutes, very informal. \r\n- You don't have to wear a suit, a nice shirt will suffice. \r\n- They don't ask any technical questions, most questions are behavioral, questions like: what would you do if... etc.\r\n- They may sometimes ask questions about your CV or grades.", "Interview Questions": "How would you handle a student who is not working during project hours but who is always on facebook or playing on his phone?"}, {"date": "1 Aug 2017", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Delft University of Technology (Delft) in Apr 2016", "Interview Descriptions": "The interview process for a PhD at TU Delft starts with an application with a cover letter for the advertised position. They invite you for a first interview (face-to-face/Video/Tele) depending on your availability and the interviewers. The first interview involves discussion about the job position. Might involve technical questions. You get a call for a second round of interview if selected. The second round involves more relaxed discussion about your interests and why you want to do this phd. You can also ask questions about the job such as benefits and other employment related questions.", "Interview Questions": "Why do you want to do a PhD and what do you want to get out of it?"}, {"date": "4 Dec 2018", "title": "IT Service Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delft University of Technology (Delft) in Jan 2016", "Interview Descriptions": "Op basis van motivatiebrief en CV geselecteerd voor sollicitatiegesprek. Erg vriendelijk gesprek gehad waar ik mijn ervaringen met IT en klanten moest omschrijven.  Daarnaast enkele situaties moeten naspelen betreffende problematische klanten.", "Interview Questions": "Met welke IT programma's heeft u ervaring?"}, {"date": "17 Sept 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Delft University of Technology (Delft) in Jan 2016", "Interview Descriptions": "None. It is a teaching assistant position. There are flyiers around the whole place, just pick one. Or approach people responsible for it (ask professors, they shall point you in the right way.)", "Interview Questions": "Did you finish the course X?"}, {"date": "15 Feb 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Delft University of Technology (Delft) in Sept 2015", "Interview Descriptions": "During a cup of coffee with the Director and a current colleague, I was asked about my background. Also the position and the work was discussed. I added my ideas and we made a plan how to approach my work. This was all done within 30 minutes and I was accepted for the job.", "Interview Questions": "My story behind my cv (many different study backgrounds)"}, {"date": "15 Nov 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delft University of Technology (Delft) in Aug 2015", "Interview Descriptions": "Very smooth and friendly. Yet, very competitive. \r\nAfter applying for a position that usually has a pool of 60-80 applicants, 10-15 will be shortlisted for the second interview.  Then 3-5 will be shortlisted for the final evaluation.", "Interview Questions": "Presenting a research paper\r\nExplaining the background"}], [{"date": "31 Dec 2015", "title": "Postdoctoraal Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delft University of Technology (Delft) in Mar 2015", "Interview Descriptions": "The interview was very informal. I met the senior researcher interested in hiring me and we chat about what I liked about his previous research and how I could contribute to his group. There was no negotiation regarding salary, I understand that it is regulated at the university level as a function of the number of years of postdoctoral experience.", "Interview Questions": "What do you like about my previous research?"}, {"date": "13 Sept 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delft University of Technology in Jan 2015", "Interview Descriptions": "You are invited for a 2-3 day visit, meet all lab members through individual meetings. You are asked to present your MSc work or other relevant projects, in an open talk to the public. You are invited for dinner/drinks with the lab. An offer might follow a few days later.", "Interview Questions": "N/A"}, {"date": "20 Nov 2014", "title": "Postdoctoraal Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delft University of Technology (Delft)", "Interview Descriptions": "Na het indienen van een online sollicitatie, bestaande uit CV, motivatiebrief en referentielijst naar een doctoraat. opening, kreeg ik een e-mail voor een telefonisch interview. Na 30 minuten van het telefonisch interview, werd ik uitgenodigd voor een groep presentatie en panel interview. Na het voltooien van alle rondes, werd mij de baan aangeboden. Het gehele proces van solliciteren tot het ontvangen van een aanbod duurde minder dan 2 maanden. De mensen die mij interviewden en later mijn dagelijkse begeleider en doctoraat. promotors bleken te zijn, waren erg aardige mensen zowel professioneel als persoonlijk.", "Interview Questions": "Hoeveel tijd zou je toekennen aan plannen, presteren en het analyseren van een experiment."}, {"date": "14 Nov 2014", "title": "Postdoctoraal Onderzoeker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delft University of Technology (Delft)", "Interview Descriptions": "Ik solliciteerde online naar de functie. Sollicitatiebrief, CV, referentie brieven, diploma en cijferlijsten moesten als sollicitatie worden ingediend. Op basis van de ingediende documenten werd ik binnen een paar weken uitgenodigd voor het gesprek. Het gesprek bestond uit de technische/scriptie presentatie, gevolgd door de algemene sollicitatie vragen.", "Interview Questions": "De technische presentatie duurde veel langer dan verwacht. De andere vragen waren niet lastig. "}, {"date": "5 Jul 2014", "title": "PhD Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Delft University of Technology", "Interview Descriptions": "A normal interview where I had to give presentation of my master thesis to two professors and two post-docs of the group. The presentation lasted only 30 minutes. After it, they asked some general questions. Their question were mostly about my presentation and my cv. All in all, it was an expected process.", "Interview Questions": "how do you deal with a non-contributing team member ?"}, {"date": "12 Jul 2015", "title": "PDeng Trainee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delft University of Technology (Delft) in Apr 2014", "Interview Descriptions": "1. Online application: CV, motivation letter (1 page) \r\n2. One or two interview, depending on needs. \r\nUsually the process is proceeded quickly. A friend of mine only took a week from interview invitation to admission announcement.", "Interview Questions": "What obstacles have you met in your previous experience?\r\nWhat do you expect yourself to be in five years?\r\nWhat is your work content?\r\nWhat design method do you use?"}, {"date": "29 Mar 2014", "title": "PDeng Trainee Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delft University of Technology", "Interview Descriptions": "focussed on team work and fit with other batch mates", "Interview Questions": "how do you deal with a non-contributing team member"}, {"date": "7 Oct 2018", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Delft University of Technology (Delft) in Apr 2014", "Interview Descriptions": "I had a total of 4 interviews with people from the group: one with the prospective supervisor and an assistant professor, one with a full professor and an associate professor, one with two assistant professors, and one informal talk with two PhD candidates from the group.  It was a nice opportunity for me to get to know the research group better.", "Interview Questions": "There were also questions about how I would handle challenging situations that are common in a PhD. "}, {"date": "17 Dec 2013", "title": "Postdoctoraal Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delft University of Technology (Delft)", "Interview Descriptions": "De eerste communicatie was via e-mail en twee interviews werden gehouden in een periode van twee maanden. De interviews waren technisch en ik moest mijn eerdere werk presenteren aan de leden van de groep waar ik mee zou gaan werken. Ik vond de mensen heel open, de werkcultuur was heel doelgericht (4 peer-reviewed artikelen zijn verplicht bij het afronden van de PhD).", "Interview Questions": "Er werd mij gevraagd om een voorbeeld te geven van succes dat ik bepaald had als een individu en als een team en ik moest kiezen welke van de twee beter was."}, {"date": "14 Sept 2017", "title": "PhD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology (Delft) in Oct 2013", "Interview Descriptions": "Full day, will be exhausting, be well prepared. This is just an exercise in asking the right questions on may subjects. Make sure it is a good fit for you as well.", "Interview Questions": "It's not so much what they ask you but what you can ask them"}], [{"date": "15 Mar 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Delft University of Technology (Delft) in Jul 2013", "Interview Descriptions": "Three full professors attended my interview via Skype. I presented for 30 minutes on my MSc research. During my presentation I was asked to clarify few aspects of research. After my presentation, I was asked exploratory-type questions to check how I approach a scientific question. I was also tested on my knowledge about fundamentals. All in all, a pleasant and interactive experience.", "Interview Questions": "Present any previous research I have done."}, {"date": "14 Jun 2016", "title": "PhD Candidate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delft University of Technology (Delft) in Jul 2013", "Interview Descriptions": "The atmosphere was pretty relaxed. The conversation went over the current research in the group. I gave a presentation on my master thesis research. The rest of the day spent in getting to know the group, a visit to the facilities, taking with everybody etc. We went for lunch and drinks together.", "Interview Questions": "How well do you know your broader area of expertise?"}, {"date": "30 Mar 2015", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Delft University of Technology (Delft) in Jan 2013", "Interview Descriptions": "In general when positions open, there is a tendency to fill them with former Master students of the university (or someone that the professor already knows, e.g. an intern etc). If nobody is found, then the positions go public. I was one of the first cases so the interview process went smooth for me because I had two years to prove what I deserve from my class performance and my Master's thesis. From what I know, if the person is external there is typically a phone interview and, sometimes, a face-to-face interview. Note that this depends a lot on the professor you are going to work with.", "Interview Questions": "Why do you want to do a PhD with us?"}, {"date": "25 Jan 2016", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delft University of Technology (Delft) in Apr 2012", "Interview Descriptions": "It went very smoothly, first sent in application with CV and cover letter, and received a reply very soon and was requested to write a personal view on the research. Very soon was invited to have an interview in person, and at the same day was done deal to occupy the position.", "Interview Questions": "introduce yourself, especially on the experience dealing with laser"}, {"date": "15 Jul 2012", "title": "Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delft University of Technology (Delft) in Mar 2012", "Interview Descriptions": "Eerst moet je solliciteren naar een functie. Dan zullen ze je CV te bekijken. Als ze het goed vinden stellen ze je aan als kandidaat en zullen ze contact met je opnemen om een afspraak voor een interview te maken, dat is het belangrijkste onderdeel van het proces. Het interview kan meerdere stappen hebben en meerdere keren worden gedaan.", "Interview Questions": "De uitdagingen en de beste aanpak van het project!"}, {"date": "10 Aug 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Delft University of Technology (Delft) in Nov 2011", "Interview Descriptions": "got asked for this particular position, because  was doing a master project in the gfroup, professor liked me, so he asked if i was interested in the PhD project.", "Interview Questions": "N/A"}, {"date": "25 Nov 2013", "title": "Postdoctoraal Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Delft University of Technology (Delft) in Mar 2011", "Interview Descriptions": "In het geval dat een positie wordt aangekondigd op de webpagina van de universiteit van de afdelingen, kan men daarop solliciteren. Als hij (zij) gekwalificeerd is, nodigt de persoon die de leiding heeft hem uit voor een interview en daarna beslist een commissie of ze hem inhuren of niet.", "Interview Questions": "Ze vragen je meestal over alles wat je in je CV hebt genoemd. Je moet goed weten wat je in het verleden gedaan hebt."}, {"date": "3 Jun 2014", "title": "Postdoctoraal Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delft University of Technology (Delft) in May 2010", "Interview Descriptions": "Een normaal sollicitatiegesprek waar ik een presentatie moest geven over mijn afstudeerscriptie aan twee professoren en twee postdoctorale researchers van de groep. De presentatie duurde maar 30 minuten. Hierna stelde ze wat algemene vragen. De meeste vragen gingen over mijn presentatie en mijn CV. Alles bij elkaar was het de verwachte procedure.", "Interview Questions": "N/A"}, {"date": "30 Jan 2012", "title": "Postdoctoraal Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Delft University of Technology (Delft) in Jan 2010", "Interview Descriptions": "Om het eerste contact te maken, belde ik de professor van de groep. Na mijn CV verzonden te hebben, spraken we een datum af om de groep te bezoeken. Het eigenlijke gesprek vond plaats in de ochtend. De professor, de dagelijkse begeleider en ik hadden een twee uur durende discussie. We praatten over mijn achtergrond (kort), over protentiele projecten (grootste deel van de tijd) en wat bureaucratische dingen (kort). \n\nDaarna vergezelde een PhD student die net zijn proefschrift af had mij bij mijn lunch en deelde ervaringen over het leven binnen de groep. In de middag kreeg ik de kans om veel andere PhD studenten te ontmoeten en hun projecten te leren kennen. Dit waren meestal een op een gesprekken dus ik kreeg een goed gevoel over de cultuur binnen de groep. Later in de middag vierde een medewerker zijn verjaardag dus de groep en ik werden uitgenodigd voor taart.\n\nUiteindelijk heb ik meer dan zes uur binnen de groep besteed dus ik kreeg een goede indruk van wat er gebeurt. De mensen daar waren bijzonder vriendelijk en bereid om tijd te spenderen met een potentiele PhD student.", "Interview Questions": "We hebben gepraat over het potentiele project en mij werd gevraagd hoe ik de taak zou benaderen."}, {"date": "4 Apr 2013", "title": "Postdoctoraal Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Delft University of Technology (Delft) in Jul 2009", "Interview Descriptions": "Na mijn online sollicitatie, kreeg ik een e-maal waar ze me vroegen voor een telefonisch interview. Ik heb twee telefonische interviews gehad. Eentje was met een promoter over algemene vaardigheden en de andere was door de supervisor over technische academische vaardigheden. Na deze interviews, werd ik uitgenodigd voor een interview op de universiteit. Alle kosten werden door de universiteit gedekt. Na een succesvol interview, kreeg ik de PhD-positie aangeboden.", "Interview Questions": "Vragen over sociale vaardigheden waren moeilijk"}], [{"date": "11 Oct 2010", "title": "Onderzoeker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delft University of Technology (Delft) in Feb 2008", "Interview Descriptions": "Ze kijken gewoon naar je CV en achtergrond met je scores en publicaties en kijken of je ambitieus bent.", "Interview Questions": "Wat ga je doen nadat je klaar bent met je Phd?"}, {"date": "26 Aug 2009", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Delft University of Technology in May 2007", "Interview Descriptions": "The interview was not an interview as such, as I have also done a bachelor and master degree at this university. During my final master project, a PhD position continuing that work was offered to me. After some disucssion, and weighing alternatives, I decided to accept it. After that, the paperwork was very limited and things were fixed rapidly.", "Interview Questions": "Do you want to do a PhD?"}]]