[[{"date": "14 Feb 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cleveland State", "Interview Descriptions": "Since I applied during the pandemic I had a group interview over zoom, they had all of us in one group to share information and then for questions they split us into two different groups.", "Interview Questions": "What research experience I had"}, {"date": "30 Apr 2023", "title": "HRIS Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cleveland State (Cleveland, OH) in Feb 2023", "Interview Descriptions": "Talent Acquisition Coordinator conducted a phone interview, approximately 10 minutes, then contacted me to schedule a virtual interview with the screening committee, behavior based ten questions, scheduled for 60 minutes", "Interview Questions": "How do you set project goals?"}, {"date": "19 Jan 2023", "title": "Structured Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cleveland State", "Interview Descriptions": "I met with the director of TASK at Cleveland State, and answered some questions. Then, they hired me after several rounds of interviews with varying faculty and other relevant staff.", "Interview Questions": "Tell me about yourself and your journey."}, {"date": "27 Feb 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Cleveland State in Dec 2022", "Interview Descriptions": "During the interview process I was asked of my scientific interests, gpa and what I felt most comfortable teaching. I was also asked of my future goals, my time at CSU and why I wanted to become a TA.", "Interview Questions": "What is your research interest? What is a class you'd like to teach? What is your previous experience teaching ?"}, {"date": "16 May 2022", "title": "Janitor/Cleaner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cleveland State", "Interview Descriptions": "Great and a real great experience that was being great. It was so great I can only say how great it was. Have I said great enough to hit the 30 word minimum ?", "Interview Questions": "Easy ....... How hard can you work after 5 pm"}, {"date": "4 Oct 2022", "title": "Grad Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cleveland State (Cleveland, OH) in Oct 2021", "Interview Descriptions": "One interview with dept. chair and dept. administrator. General questions. Only took about 10-15 minutes. Took place in-person at University. They supplied a full list of duties and expectations. World Language Dept.", "Interview Questions": "Have you ever done this before? Will the hours work? How comfortable are you with other cultures?"}, {"date": "29 Sept 2021", "title": "Engineering Peer Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cleveland State", "Interview Descriptions": "2 interviews with a current experienced employee and then the head. The interview consists of general standard questions about yourself and why you applied to this position. There are also different scenario questions that may arise.", "Interview Questions": "Q: What are your strengths?"}, {"date": "12 Jan 2019", "title": "Student Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Cleveland State", "Interview Descriptions": "The hiring process is very simple. Discussed with the manager and supervisor. Sat down and had a conversational type interview. Very brief and to the point. Just looking for what kind of person you are.", "Interview Questions": "What is your leadership style like?"}, {"date": "10 Mar 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Cleveland State (Cleveland, OH) in Sept 2018", "Interview Descriptions": "I saw a flyer asking for biology tutors from my biology class, so I asked for a letter of recommendation from my biology professor. Then, I met with the tutoring center leadership and basically started the process of onboarding almost immediately.", "Interview Questions": "What experience or qualifications do you have to become a tutor in this field?"}, {"date": "29 Jan 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Cleveland State (Cleveland, OH)", "Interview Descriptions": "Showed up for a 20 minute interview. Basic questions. I applied for the position online and got the interview about one week later. I got hired 2 days after the interview.", "Interview Questions": "Describe yourself as a person"}], [{"date": "1 Apr 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Cleveland State (Cleveland, OH) in Dec 2017", "Interview Descriptions": "I was told  to send my resume and unofficial transcripts to the professor. Since I had scored  A grade in both his courses Power Systems Analysis and Power Systems-II Relay Protection and Control I was able to get the job without any formal  interview", "Interview Questions": "My overall GPA and my Academic schedule\r\n "}, {"date": "15 Sept 2017", "title": "GA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Cleveland State", "Interview Descriptions": "It wS a quick experience and felt more like a formality than anything. I would recommend a more thorough process next time. Or something more centered on meeting more of the team you'd be working with.", "Interview Questions": "N/A"}, {"date": "26 Jul 2017", "title": "Event Staff Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cleveland State (Cleveland, OH)", "Interview Descriptions": "Supervisors called a couple of days beforehand with little to no information leading up to the interview, which was conducted with multiple applicants within the same room. The interview consisted of simply telling the applicants about the job, then taking them on a tour of the facilities.\r\nForms were filled out, and no questions were asked aside from on the forms. After that, I heard nothing back from the supervisors for a couple of months, leading me to believe that the offer had been made to others. Then later in the month a couple of months later, I finally heard back from them with the expectation that I knew I had been hired and simply needed to accept what shifts to work.", "Interview Questions": "Can you do the physical work required for this position?"}, {"date": "23 Sept 2017", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Cleveland State (Cleveland, OH) in May 2017", "Interview Descriptions": "I actually did not interview at all, which was amazing. I was offered this package after being accepted into my program. My package provides a $1,300 stipend and pays for 10 Fall credit hours, 9 Spring credit hours. As far as I know, other students have not been required to undergo interviews for graduate assistant positions either, merely applied with their resume during their application process for the graduate program of their choice. I am in the Political Science department.", "Interview Questions": "On my application for graduate school, I was asked to provide my five-year goals, what I intended to do with the degree, and how my educational and professional background made me suitable for the program. "}, {"date": "4 Jul 2017", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cleveland State (Cleveland, OH) in Apr 2017", "Interview Descriptions": "The interview process was standard and as expected for those in higher education. Basic questions about conflict resolution/problem solving, use of student development theory and understanding of the advising process.\r\n\r\nThe first of two interviews took place very shortly after the job posting had closed; the second interview and final interview was within a week and a half or so of the first interview. The hiring manager indicated the anticipated hiring timeline, which the school unfortunately did not follow at all. Approximately two months after the final interview the posting was updated to \"Job Canceled\" with no notice from the department and/or university. Having been a finalist for this position, I found that extremely unprofessional.", "Interview Questions": "N/A"}, {"date": "25 Mar 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Cleveland State (Cleveland, OH) in Apr 2017", "Interview Descriptions": "Brief and easy Interviewer was very friendly thanks to my friends for recommending me and my professor for providing me with letter of recommendation.  I had a great time in the interview it was very friendly. Brief and easy Interviewer was very friendly thanks to my friends for recommending me and my professor for providing me with letter of recommendation.  I had a great time in the interview it was very friendly", "Interview Questions": "How do manage your calender?"}, {"date": "28 Jul 2018", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Cleveland State (Cleveland, OH) in Jan 2017", "Interview Descriptions": "It was pretty straightforward, a lot wasn't asked of me the role and responsibilities were just explained to me. Was expected to memorize an introduction to participants and manage my own scheduling", "Interview Questions": "Do you have experience? What do you do now?"}, {"date": "28 Apr 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Cleveland State (Cleveland, OH) in Aug 2016", "Interview Descriptions": "Interview includes 3 sessions - personality quiz, IQ test, personal Interview\r\npersonality test includes questions that determine ones way of thinking, dedication towards the work and the management skills.\r\nComing to the personal Interview - one would be dealing with a student to test the teaching skills and to see how good one has hold of the subject", "Interview Questions": "How would you manage high stress at work?"}, {"date": "15 Sept 2017", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cleveland State (Cleveland, OH) in May 2016", "Interview Descriptions": "It was a summer coder position where I have showed my previous coding assignments and explained my approach to solutions to achieve the tasks of the position. Interview was mostly technical", "Interview Questions": "Explain the technical aspects of creating a new API endpoint / downloading data feeds from existing APIs ? And how data analysis should be done to get an insight into the data feeds ?"}, {"date": "12 Nov 2016", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cleveland State (Cleveland, OH) in Apr 2016", "Interview Descriptions": "Submit your application through Chronicle Vitae. Followed by a Skype group interview.\r\nFollowed by an On-campus interview that involved the following: presentation and rating by a class, meeting with the department hiring committee, meeting with the department chair, and meeting with the dean. Overall, it was polite and smooth. Retention and rate of graduation are concerns and they seek candidates who care about their students.", "Interview Questions": "Standard---what will you bring to the department that they don’t already have? what types of relationships do you have with your past students and how do you foster and mentor them? supporting the students is key."}], [{"date": "27 Jul 2016", "title": "Commuter Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in Feb 2016", "Interview Descriptions": "Apply via online from the college website and then a personal interview is conducted with respective head of department. Most of the questions are based on what you mention in your resume and also based on he qualifications needed for the position. How you base your answer depending on the type of questions plays an important role in determining whether you will be given a job offer or not?", "Interview Questions": "Why should we select you for this position?"}, {"date": "20 Mar 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Cleveland State (Cleveland, OH) in Feb 2016", "Interview Descriptions": "There two officials one was who would be going to be my supervisor if i was selected and other being the director of the Career Services department. the interview went very smoothly, it was purely about my past experience and they were really interested to get an international student on board. Finally they asked if i had any questions for them. I had few suggestions for the events which they conducted which impressed them more.", "Interview Questions": "They asked to briefly tell about my self and my experience working in an office environment."}, {"date": "23 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cleveland State", "Interview Descriptions": "My skills, experience and hours available. My take on duties of being in charge. My course of plan for studies. How much computer knowledge do you have? How long I was planning on studying at the university. If I was able to work during the summer semester hours and the break week hours.", "Interview Questions": "Questions about my computer and IT knowledge."}, {"date": "11 Apr 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cleveland State (Cleveland, OH) in Sept 2015", "Interview Descriptions": "The first interview was a phone interview with a committee and then the second interview is one on one with the hiring manager.  Interviewers asked general common interview questions.", "Interview Questions": "Describe a challenge at work and how you handled it."}, {"date": "16 Sept 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in Aug 2015", "Interview Descriptions": "Head of my department took my interview and asked me about my past academic as well as professional experience. I was familiar with the IS&T department where i was supposed to work and he asked me about the IS&T department's experience.", "Interview Questions": "Academic experience"}, {"date": "24 Oct 2016", "title": "Teaching Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in Aug 2015", "Interview Descriptions": "I was studying in Cleveland State University and I came to know about one teaching Assistance position in our department. I went over there and submitted my profile and resume to professor and dean of the department. they conduct my  interview and i was selected for the position", "Interview Questions": "what do you about Power System??"}, {"date": "11 Sept 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Cleveland State (Cleveland, OH) in Aug 2015", "Interview Descriptions": "The interview was taken in-person. Professor asked about my knowledge on green infrastructure practices and its applicability in residential areas. He reviewed my undergrad project which I have done on green infrastructure practices. He also reviewed my GPA of undergrad and first semester of graduate course.", "Interview Questions": "they asked regarding green infrastructure practices like low impact development."}, {"date": "31 Jul 2015", "title": "CIS Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Cleveland State", "Interview Descriptions": "Very laid back; asks about GPA and some fundamental computer science questions; also seems like an assessment of character, since the position requires meeting and talking to students/pupils and helping them with computer science related thinking and assignments.", "Interview Questions": "How would you respond if I was a student and I asked you to do my assignment for me?"}, {"date": "22 Jul 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Cleveland State (Cleveland, OH) in Jun 2015", "Interview Descriptions": "It was not that hard. My boss got my resume and called for an interview. Nothing difficult, just some personality questions. The work environment is weird as hell though. I regret taking this job, I hate my coworkers", "Interview Questions": "DO you like working here?"}, {"date": "4 Mar 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cleveland State (Cleveland, OH) in Mar 2015", "Interview Descriptions": "simple and routine and the interview was on the skype. The process was simple. I was called through skype and they asked me several questions about my pas experiences and skills. fortunately the orocess ws routine and acceptable and successfull.", "Interview Questions": "why you are interested in this position"}], [{"date": "14 Apr 2015", "title": "Computer Science Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Cleveland State (Cleveland, OH) in Jan 2015", "Interview Descriptions": "There was only one In person Interview. It was an informative interview, nothing formal. No questions asked besides my grades. They only look at your grades to decide whether you are eligible for the position or not.", "Interview Questions": "How are your grades?"}, {"date": "20 May 2015", "title": "Student Teacher Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in Aug 2014", "Interview Descriptions": "A friend of mine who was already employed suggested I apply.  I wrote a letter of interest, received a letter back immediately and scheduled an interview for 5 days later.  I met with the Director, and she asked me general questions about my teaching background.  She gave me possible scenarios and how I would handle them.", "Interview Questions": "What are you proudest of as a teacher"}, {"date": "14 Dec 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Cleveland State (Cleveland, OH) in Mar 2014", "Interview Descriptions": "Applied online and took 3 days for final decision. Interview was easy and asked only general and technical questions. I would say interviewer were very supportive; they will try to know your willingness to learn new things and how you will implement it in real world.", "Interview Questions": "General behavioral questions and also job related technical questions were asked.  "}, {"date": "5 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Cleveland State (Cleveland, OH) in Feb 2014", "Interview Descriptions": "Brief only wanted to know if you are organized, efficient, and discrete. The interviewer was very nice and laid back, only asked questions to really get to know me. They were very keen on getting an individual that was a good fit because they handle at risk students.", "Interview Questions": "What if a client is a classmate and they had serious problem, how would you handle that?"}, {"date": "17 Oct 2013", "title": "Director, Continuing Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cleveland State (Cleveland, OH)", "Interview Descriptions": "Phone interview, then two group or panel interviews and a 1:1 interview. From the time I applied to when I started - 4 months.", "Interview Questions": "Nothing I couldn't answer. I couldn't understand why one interviewer kept focusing on one particular area of the job - a part I thought was the easiest part. "}, {"date": "11 Aug 2013", "title": "Audit Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Cleveland State", "Interview Descriptions": "two person do the interview", "Interview Questions": "reseme-based questions"}, {"date": "20 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in Aug 2013", "Interview Descriptions": "Presentation of my background and previous research and future academic plans why i chose this school and want to continue my education in higher levels. Why I chose that specific subject for my reserach and how reated to my knowledge and skills", "Interview Questions": "About my background and previous research"}, {"date": "10 Mar 2017", "title": "Math Learning Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cleveland State in Aug 2013", "Interview Descriptions": "The interview was basic mathematical questions and a small pre-test. Then we discussed my passion and interests. Once we finished that we then, discussed on what software I've used with the math courses here.", "Interview Questions": "How do you find the slope of a function?"}, {"date": "18 Feb 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in Dec 2012", "Interview Descriptions": "The professor asked my background and he was pretty cool so he gave me a project of my choice that I was most comfortable with. He additionally explained to me what was required for the project and that I was required to read papers and learn and perform techniques.", "Interview Questions": "My background and how it was related to the work in lab"}, {"date": "19 Sept 2013", "title": "Senior Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Cleveland State (Cleveland, OH) in Nov 2012", "Interview Descriptions": "Networking.", "Interview Questions": "Dealing with impatient customers"}], [{"date": "10 Oct 2012", "title": "Meta Data Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in May 2012", "Interview Descriptions": "On site interview and get the result on the next day. Basically no difficult question, ask questions like how much you can contribute to the work related to the experiences.", "Interview Questions": "Basically no difficult question, ask questions like how much you can contribute to the work related to the experiences."}, {"date": "7 Dec 2016", "title": "Administrative Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cleveland State (Cleveland, OH) in Jan 2012", "Interview Descriptions": "Began with microsoft office applications. It tests you basic knowledge of word excel powerpoint. Then an interview with the department. Very friendly and insightful. Typical questions and conversation about my background and the responsibilities of the role.", "Interview Questions": "What are you interested in this position"}, {"date": "17 Mar 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cleveland State (Cleveland, OH) in Aug 2011", "Interview Descriptions": "The interview process was very simple. First, there was a very brief phone interview of just over three minutes with the assistant director of the department. After clearing that part of the process, I was invited in for a formal interview. The interview was non-intimidating, and consisted of an informal sit down and discussion with the assistant director and director of the department. They were very nice and there was never any nervousness or hostility. The interview was simply a twenty minute talk to determine if I had the skills to perform the job.", "Interview Questions": "They were pretty basic. The only question that required any serious thought was the standard of telling a time of a disagreement between yourself and a co-worker and how you resolved it."}, {"date": "9 Oct 2015", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cleveland State (Cleveland, OH) in Aug 2011", "Interview Descriptions": "Very easy.  Filled out the online application and got the job.  I didn't even. have to come in and talk to anyone.  When I got there, everyone was very friendly.", "Interview Questions": "What is your GPA?"}, {"date": "4 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Cleveland State (Cleveland, OH) in Jan 2011", "Interview Descriptions": "Met with prospective employer, we both showed interest. Reviewed the job description and my past positions. We worked out a schedule around my classes.  Discussed salary, shown around campus and I was offered the job. It was easy.", "Interview Questions": "Why I came to Cleveland State."}, {"date": "16 Aug 2011", "title": "Business Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Cleveland State (Cleveland, OH) in Dec 2010", "Interview Descriptions": "Very straight forward and full history of the dept.  Questions about how you would handle class room issues/ things and about different teaching methods that have been used.", "Interview Questions": "Explain some methods used to assit students who are not able to complete their assigned tasks/homework/exams."}]]