[[{"date": "19 Jun 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Jun 2023", "Interview Descriptions": "My interview process was very thorough and direct. Has an Open door policy which makes for a great working environment. Very approachable manager and clinical educator. I also got to meet the CNO during the interview and he was just as great as the person's interviewing me!", "Interview Questions": "Name a time that you modified your care for a patient to be compliant to nursing care"}, {"date": "14 May 2023", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida (Jacksonville, FL)", "Interview Descriptions": "The first in-person job interview is typically a one-on-one interview between the applicant and a hiring manager. The interviewer will ask questions about the applicant's experience and skills, work history, availability, and the qualifications the company is seeking in the optimal candidate for the job.", "Interview Questions": "Experience working in the healthcare industry"}, {"date": "19 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL)", "Interview Descriptions": "First you contacted my HR to set up an interview time and date. I’ve met with the ICU Manager from two different departments, clinical manger and clinical educator. Immediately after I had a peer interview.", "Interview Questions": "How would you handle conflict with another coworker?"}, {"date": "10 Apr 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL)", "Interview Descriptions": "interview was fairly brief. They asked about three to four questions (non clinical). And then proceeded to describe the department I was interviewing for and then answered some questions I had and that’s it.", "Interview Questions": "have you ever dealt with a difficult patient?"}, {"date": "2 May 2023", "title": "Senior Analyst, Business Intelligence Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Healthcare System - South Florida in Apr 2023", "Interview Descriptions": "Two rounds of interviews, one with the Hiring Manager and a panel interview with the team. The interview was primarily a process to discuss my skills and experience. The panel interview was a combination of a discussion of my experience along with some behavioral questions. Everyone was very friendly and made me feel comfortable. I enjoyed the interview.", "Interview Questions": "Why do you want to work for Memorial Health?"}, {"date": "1 Mar 2023", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "It was a Panel interview: manager, clinical manager, and nurse educator. Very relaxed environment. Plus a phone interview with the manager. They all go around asking questions and trying to sell the unit", "Interview Questions": "Describe your style of teamwork"}, {"date": "2 Feb 2023", "title": "IT Helpdesk Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "The interview process at Memorial Healthcare System consists of: Initial phone call: The candidate will have an initial phone call with an HR representative or a hiring team member to discuss their background and qualifications for the position. Interviews through Cisco Webex: After the initial phone call, the candidate may have one or two interviews through the Cisco Webex platform with different members of the hiring team. This allows for a more in-depth discussion of the candidate's experience and qualifications and to assess their fit for the role. Note: The specific number of interviews and the format of the interviews may vary depending on the position and department, but the process aims to thoroughly evaluate the candidate's qualifications.", "Interview Questions": "Why are you interested in working for this company?"}, {"date": "26 Jan 2023", "title": "Value Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Memorial Healthcare System - South Florida in Jan 2023", "Interview Descriptions": "Surprisingly didn’t get the role even though I felt like I aced the interview. But everything happens for a reason and I am still looking to join the health system.", "Interview Questions": "Three words to describe yourself"}, {"date": "1 Nov 2022", "title": "HR Shared Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Professional , excellent, long process, Three interviews, recruiter, hiring manager and peer reviewed. Behavioral and situational questions. Good technology. Food people. Earm Welcome. Very professional. Amazing people . Very professional, amazingly", "Interview Questions": "Situational questions Hiw would you help your peer in a difficult situation?"}, {"date": "11 Nov 2022", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Miramar, FL) in Nov 2022", "Interview Descriptions": "Interview went great & it was straight to the point. I was asked scenario based questions & I felt very confident in answering each question throughly. Overall , I felt as though I made the right impression and I felt like I belonged in that facility.", "Interview Questions": "1. Are you a leader? 2. Where was one time when you took blame?"}], [{"date": "20 Nov 2022", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Oct 2022", "Interview Descriptions": "There was an online hiring event, I talked to the manager then she scheduled me for an interview. The pharmacy peers were great. I was super nervous, but they tried their best to make me laugh. They asked a lot of questions. Every question I answered led to another question. I learned from them. It wasn’t a bad experience.", "Interview Questions": "Q: Tell me about yourself? Q: Tell me about a time where you had a disagreement with your boss? How did you handle it? Q: Tell me about a time you had a difficult customer? How did you handle it?"}, {"date": "15 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Straight forward interview process. Basic interview questions. Positive experience with interviewers. Culture and expectations of the unit truthfully answered to what I have experienced as an employee. Reasonable time frame of applying, reaching out for interview, and call back offering position.", "Interview Questions": "5 year plan\nWhat I bring to the unit\nOther common interview questions "}, {"date": "13 Sept 2022", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Initially I was contacted by a recruiter who then asked my availability for the week. She then reached out to the respective unit directors to confirm dates and times. The managers decided to interview me at the same time via Webex.", "Interview Questions": "Tell me about a time when you had to escalate up the chain of command. What process did you use?"}, {"date": "8 Sept 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Very involved. I met with multiple different staff members and healthcare providers who later became my coworkers. I think it was a mutually beneficial technique, as I was able to get a feel for the work environment before accepting the job offer. It also showed me that they weren't just hiring another position, but it felt like they truly wanted to hear about my past experiences and abilities.", "Interview Questions": "Describe a time where you had a conflict with a coworker, and how did you manage it?"}, {"date": "3 Sept 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "In the interview they mainly went over my resume and asked me to elaborate on it. They asked why I wanted to volunteer at Memorial Hospital and where I would want to volunteer at. Fairly easy, just make sure to be positive and outgoing.", "Interview Questions": "they asked me why I wanted to volunteer at memorial hospital "}, {"date": "27 Aug 2022", "title": "Community Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "There were a three step interview involved. I did all of mine on the same day. Took about 2 hours in total for all three interviews. I heard back within the same week. Three step interview- peer, supervisor, manager", "Interview Questions": "Experience relating to the job"}, {"date": "5 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "It was short, sweet, and to the point. You get asked the normal interview questions with nothing too difficult. I was nervous, but I was myself. I answered truthfully and I tried not to ramble.", "Interview Questions": "Ok tell me about yourself "}, {"date": "3 Oct 2022", "title": "Imaging Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Memorial Healthcare System - South Florida in Aug 2022", "Interview Descriptions": "Participated in 1 and 1/2 hour interview. Pleasant interview with informative details and expectations of position provided.  I was advised in detail at end of interview that I would be contacted with next steps or outcome within 2-4 weeks, 8 weeks passed and no updates or closure occurred. Lack of follow-up and follow-through is disappointing.", "Interview Questions": "Tell me about your work experience."}, {"date": "1 Jul 2022", "title": "Diagnostic Radiography Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Memorial Healthcare System - South Florida (Miami, FL) in Jul 2022", "Interview Descriptions": "very easy, not a lot of question made. People there are very nice be aware you must do a peer interview. The do not give you a proposal right away they wait for hr to review everything", "Interview Questions": "why do I want to work in memorial?"}, {"date": "26 May 2022", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "I despise the interview system. I despise the panel interview. It drives my anxiety to have like 3 people in front of me asking strict questions instead of having a conversation with me.", "Interview Questions": "N/A"}], [{"date": "6 May 2022", "title": "PFSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Great but a little lengthy great company  to work for and plenty of opportunities to grow great insurance team work is a must have quality first interview with team lead then peers then manger after that he contacts you", "Interview Questions": "Basic interview questions that pertain to the job title "}, {"date": "25 May 2022", "title": "Patient Financial Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Memorial Healthcare System - South Florida (Miramar, FL) in Apr 2022", "Interview Descriptions": "Due to Covid the interview process was virtual. They do an extensive background check every job, criminal record throughout the U,S. They have you submit to a complete physical and drug test. the whole process takes about a month and a half.", "Interview Questions": "typical questions. scenario/response\r\nbackground qualifications and so on"}, {"date": "18 Feb 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Feb 2022", "Interview Descriptions": "Everyone was very nice and seems like a great place to work. Very impressed with their facilities. They have multi steps to their interview process and took over two months", "Interview Questions": "Tell me about yourself. Tell me about a time you went above and beyond "}, {"date": "22 Jan 2022", "title": "Scholarship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Panel of 8 interviewers, occurred during Covid pandemic so interview held via webcam, very nice and friendly interviewers, make sure that your lighting is on point, not sure how interviews are held now", "Interview Questions": "Describe a time where you had to change the way you communicated"}, {"date": "12 Feb 2022", "title": "Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Nov 2021", "Interview Descriptions": "Very relaxed great team.  They seemed like they were aligned with each other and could tell they have a strong team work oriented culture. Created a positive environment during the interview", "Interview Questions": "Leadership skills, behavioral, experience and fit questions "}, {"date": "8 Oct 2021", "title": "Speech Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "The interview was challenging and thorough as they truly want to ensure a good fit. They are open to hiring new graduates who are eager, self-motivated, and readily driven if they display the right attitude. I was hired with little experience but the opportunity to grow my skills.", "Interview Questions": "“If you did not agree with the physician’s recommendation, what would you do?”"}, {"date": "23 Sept 2021", "title": "New Grad RN Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "due to COVID some interviews were in person some were virtual.  Interviewers ranged from two to six people in a session with one new grad.  Very friendly and truly want to get to know you to see if you'd fit with the rest of the group on the floor.", "Interview Questions": "Why this hospital and/ or floor? "}, {"date": "25 Sept 2021", "title": "Director of Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Aug 2021", "Interview Descriptions": "HR informed they were unsure they would be able to match my current salary and set up in-person interview during pandemic. Hiring manager informed no room for growth which is why position is now vacant. Did not mention his team until probed.", "Interview Questions": "What is your weakness?\nWhy are you looking to leave?\nPersonal questions unrelated to posting\nWhat does your spouse do for a living?\nIn-direct questions about race and culture\n"}], [{"date": "6 Apr 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "The interview process was a two part interview. The first was is with both operations manager and the second is with the technicians. I did the interview on Monday and was hired on Tuesday. Was quick process.", "Interview Questions": "What would you do if a different situation appeared and how would you handle it?"}, {"date": "20 Mar 2021", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "You meet with many other physicians and leaders of the organization.  The atmosphere is friendly. Everyone seemed to be very happy. The stress is minimal. There is nothing surprising or out of the ordinary.", "Interview Questions": "Tell me about one of your weaknesses."}, {"date": "3 Mar 2021", "title": "Patient Financial Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Manager interview and then attend a peer interview. Peer interview was with three people. A little intimidating but they were nice and gave me some time to ask my own questions.", "Interview Questions": "Q: Tell me a time when you had to work with a difficult customer. What happened?"}, {"date": "18 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Within two weeks of submitting my application, I received phone calls to schedule interviews at the units I had applied to. The nurse manager directly calls you to ask what time works for you for an interview. It is a two panel interview with the nurse manager and one other employee (either a staff nurse or a charge nurse.)", "Interview Questions": "What is a time that you’ve had a conflict with a patient, doctor, or coworker, and how did you resolve it?"}, {"date": "12 Oct 2021", "title": "Maintenance Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Memorial Healthcare System - South Florida (Jacksonville, FL) in Jan 2021", "Interview Descriptions": "Tedious, drawn out and ridiculous. HR person was unprofessional, had to go to the bathroom while I was on hold. Most difficult interview I've ever been a part of in my life.. absolutely ridiculous", "Interview Questions": "HVAC systems, electric and generator stuff"}, {"date": "25 Jan 2021", "title": "Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida in Jan 2021", "Interview Descriptions": "It was good and they were very friendly. When she came and got me I was nervous but after talking to her for just a moment it was easy. I was interview by the nurse manager and the department manager", "Interview Questions": "They asked about conflict with a coworker and how it was handled"}, {"date": "21 Jan 2021", "title": "Pharmacy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Memorial Healthcare System - South Florida (Miami, FL) in Jan 2021", "Interview Descriptions": "Group interview. Each person introduced themselves first and then the interviewee. They asked about job experiences, if any. Real case scenarios. How you manage your school and work responsibility. It was a great interview with 4 directors. Lasted around 40 minutes.", "Interview Questions": "What is the ideal workplace for you?"}, {"date": "19 Feb 2021", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Jan 2021", "Interview Descriptions": "I have had interest in applying for this position for well over a year. I finally received the credentials needed and was quickly contacted for a phone interview, however, the recruiter was not very responsive. She asked to speak with me and disappeared. I followed up via email and there was no response. Then, the following week, she surfaced again and we spoke. She asked if I was familiar with a particular task, something that I’m sure is easy to train on, then referred me to another position she was recruiting for. When I looked at the position recommended, I was clearly overqualified as the position had minimal requirements. Finally, two weeks later, I received an email from Memorial stating that my application was closed. I contacted the recruiter to ask for feedback and addressed whether the specific task that came up was part of the decision. Of course, she declined and said it was based on other skills I did not possess. When I asked her to elaborate or expand on that  because I would like to re-apply in the future and am truly interested in expanding my knowledge, she didn’t reply at all. Very unprofessional and disappointing. I have previously been turned down for two other opportunities with Memorial due to them deciding to move forward with an internal candidate. I am well qualified for this position and would not be surprised if this was all a formality for them promoting from within again. I am not sure my efforts of applying in the future. So much rejection and very poor feedback.", "Interview Questions": "Why do you want to get into Healthcare?"}, {"date": "26 Sept 2020", "title": "Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Miami, FL)", "Interview Descriptions": "series of Zoom interviews  and application standard interview process during pandemic .  Very long process , so be sure you have the time and desire to go through the process.", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Aug 2020", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Memorial Healthcare System - South Florida (Hialeah, FL) in Aug 2020", "Interview Descriptions": "Had like 4 interview with different departments, i enjoyed each of them and i am talking about within a year, but guess what?  Stay positive !! My last interview was last week 3 days later i got the offer letter i was waiting for many years! Awesome and a quick process, if is for you and you really want it , you will get it, just be patient..", "Interview Questions": "How di you handle a Difficult time at your past job."}], [{"date": "19 Apr 2021", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Miramar, FL) in Apr 2020", "Interview Descriptions": "had 3 interviews amongst several candidates (they had a hiring event) and met several leaders of the hospital. the interview was more like group interview and was asked basic questions as to why i’d like to work here, what was my pros and cons", "Interview Questions": "Give a situation where you found something was unfair in the workplace and what did you do? "}, {"date": "26 Feb 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "it took about a month from the time I applied until the time I received an offer from the human resources department. Overall it was a fairly simple but lengthy process.", "Interview Questions": "Describe yourself in 3 words"}, {"date": "9 Feb 2020", "title": "Patient Financial Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Memorial Healthcare System - South Florida (Miramar, FL) in Feb 2020", "Interview Descriptions": "I applied online, got a call a few days later. Had a phone interview. They were interested, so invited me to do a typing test. Passed the typing test and was scheduled for a peer interview. Interview went well, was over 45 minutes.", "Interview Questions": "How do you handle an irate customer?"}, {"date": "27 Jan 2020", "title": "Food Service Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "I was called in for an in-person interview on site at the hospital.  I was taken back to the administrative offices of the food service area.  This is where I met with the hiring manager.", "Interview Questions": "How would you handle an employee who is not performing up to standards?"}, {"date": "5 Dec 2019", "title": "Rehab Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "The interview process was simple and easy to apply. Phone interview first and then on-site interview after. Called me within one day with their decision. Friendly and respectful staff.", "Interview Questions": "Where do you see yourself in 3-5 years? "}, {"date": "12 Nov 2019", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Interviewed by 3 people. Applied online. Was called by unit manager to interview the same week. Over three weeks later I get call with job offer, now waiting for formal offer and details.", "Interview Questions": "Getting to know me type of questions, a few what would you do if patient..? "}, {"date": "17 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Apply, then wait... Phone screening, then wait.  In-person interview with the department manager reviewing your experience and history. Then finally a Peer panel interview with current staff.  Only then will you get an offer if the staff approves.", "Interview Questions": "Your work experience, personal goals, personality questions, Situational Clinical questions."}, {"date": "24 Sept 2019", "title": "Nure Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL) in Sept 2019", "Interview Descriptions": "I applied online within 1-2 months. I received a email from the manager to conduct a face to face interview with the 2 managers followed by a panel interview with 5 nursing and 1 pharmacy representative. I would not recommend employment here at this institution. I underwent 2 interviews with the company for a nursing position. Interview number 1 was catty; the women talked about prior hires that didn't work out and their attitudes. I didn't feel this was pertinent to me but I listen anyways to be polite. They kept saying they cant wait til they find a replacement because they were so tired of doing the work.  Interview number 2 was a joke. They made me sit through a panel interview with 6 individuals that only read from a checklist. They were so unorganized it was upsetting. They ( the first 5) conducted a interview with me only, to have one individual show up late to tell them in front of me I didn't even have a certification that was required for the job. They then proceeded to finish the interview with more questions which I felt was unnecessary, especially if I didn't have the required certifications. At that time, I felt defeated and didn't want to participate in the interview anymore. That certification was NOT listed in the job description and I shouldn't have gotten to interview number 2 if I cannot be hired without it. They were very unprofessional of a cancer center. It turned me off from this company.  I never expected such treatment from such a well known facility.", "Interview Questions": "Tell us what you know about the company?"}, {"date": "12 Jul 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Memorial Healthcare System - South Florida (Wellington, FL) in Jun 2019", "Interview Descriptions": "Online application and interview with 3 team members. A lot of situational questions with time to write a sample documentation note as well. Very friendly staff, duration about 1hour", "Interview Questions": "A lot of situational questions, like what would you say to a parent who isn’t ready for their child to be discharged?"}, {"date": "24 May 2019", "title": "Collections Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Easy and typical interview. Basic questions regarding knowledge of collections/ billing/ coding and other duties required for this position were asked. Smooth process. Called back within two days with an offer.", "Interview Questions": "What did your day to day work flow consist of?"}], [{"date": "8 Dec 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL) in Apr 2019", "Interview Descriptions": "Not bad\r\nPeer reviews are big. Appearance matters it of course. Dress professional\r\nHR reaches out to make the offer not the manager. Interviews are good but to get into memorial it's all about who you know more than what you know.", "Interview Questions": "Tell me about a situation in which you went above and beyond for a patient "}, {"date": "18 Sept 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Memorial Healthcare System - South Florida in Jan 2018", "Interview Descriptions": "I was Interviewed by a nurse manager,  a floor nurse, and a clinical educator. The interview Lasted  about fourty five minutes and included a lot of behavioral questions such as “what would you do if you had a conflict”", "Interview Questions": "Tell me about a time you had to deal with a “difficult” patient "}, {"date": "26 Jun 2017", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 days. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Charge nurse was very nice. I didn't feel nervous. Couldn't have asked for a better person to interview me. They ask all of the basic questions any place would and end it with you selling yourself to them. Good luck!", "Interview Questions": "What do you know about this hospital?"}], [{"date": "24 Sept 2016", "title": "Patient Financial Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL) in Sept 2016", "Interview Descriptions": "The entire process took 3 weeks. I was called to schedule a typing test and then a week later, I was called to schedule the interview. I was greeted by one of the managers and she informed me that I would be interviewed by her and another manager. Overall I was a little nervous at first, but they were both really nice so it wasn't a difficult interview. The manager liked me so she scheduled the second interview in 20 minutes. The second interview was even more relaxed because they were actual PFRs so it was more of a peer interview. I felt really good after leaving and then a week later I got a job offer from my favorite hospital. :)", "Interview Questions": "Why should we hire you?"}, {"date": "8 Sept 2016", "title": "Patient Financial Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Memorial Healthcare System - South Florida (Miramar, FL)", "Interview Descriptions": "I was involved in a group/panel interview with about 5 supervisors. Questions about previous experience and how those experiences would benefit me for the applicable position. Requests on specific situations where exceptional customer service was provided.", "Interview Questions": "How did you demonstrate exceptional customer service at your previous job? Give a specific example."}, {"date": "13 Sept 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Aug 2016", "Interview Descriptions": "I applied to all open nurse practitioner positions within the system because I was not being call for the positions that I was qualified for. I reached the hiring manager myself using a connection. It was then that I received two invitations to interview and the experience totally changed into a positive, rewarding experience.  I was impressed by the team spirit during the interviews as well as by the team members. I was offered both positions the same day that I interview, from there the hiring process was smooth and professional.", "Interview Questions": "What is your biggest weakness?"}, {"date": "10 Oct 2019", "title": "New Graduate Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL) in Jul 2016", "Interview Descriptions": "Initial interview by Human Resources Representative. Second interview with manager, then peer interview by trained cohorts and management on unit. Nurse manager from floor provided me with an unannounced test on cardiac strips as it was a cardiac floor, told it would not be taken into account of being hired. Once cleared by all of the above, offered hourly wage by Human Resources. Physical, drug, and urine screening completed once position is accepted.", "Interview Questions": "Tell us one experience you had in handling a challenging situation. What did you do and what was the outcome?"}, {"date": "6 May 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL)", "Interview Descriptions": "Initially, there was a phone interview where they asked about availability and hours for the position that I applied.  Then, several weeks later, there was a separate interview with the department director followed by the peer interview.", "Interview Questions": "How do you deal with difficult people?"}, {"date": "1 Sept 2016", "title": "Patient Financial Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL) in Apr 2016", "Interview Descriptions": "Applied online took about 2 months to get a call for an interview. Typing test is required. Interview was done by 3 employers. Questions are your basic interview questions. For example, what would you do in this situation, name a time you didn't agree with past supervisor and how did you get through that.", "Interview Questions": "Why ae you a good candidate for this position?"}, {"date": "30 Mar 2016", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Memorial Healthcare System - South Florida (Fort Lauderdale, FL)", "Interview Descriptions": "It was for a contract position so they did not go in depth about the company or culture. The interview lasted no more than 10 minutes. They basically wanted to verify I had experience using certain software", "Interview Questions": "What is your proficiency with InDesign? "}, {"date": "8 Dec 2016", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL) in Jan 2016", "Interview Descriptions": "Interview process was probably the easiest part of getting the job.  The interview was smooth and all questions were answered. Walked out of the interview knowing I had got the job, the ladies I interviewed with were who I would be directly working with and were very kind.  A few hours after I left the interview, I received a call from HR with the job offer.", "Interview Questions": "Describe a time when you had to work under pressure."}, {"date": "30 Nov 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL)", "Interview Descriptions": "Interview typical and average. Showed capabilities, talked prior experience, what to expect, what job entails.  Emphasis put on professionalism and discretion, integrity and ability to relate to various personalities in sensitive situations, or with upper management.", "Interview Questions": "This was a contract per job/Freelance position.  Does not entail the same interviewing process as one who would work at the location full time.  All questions revolved around work experience, morals and ethics due to sometimes sensitive nature of job details."}, {"date": "8 May 2015", "title": "FT Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Apr 2015", "Interview Descriptions": "1 week process. I interviewed with the nurse manager and the charge nurse the next day they offered the position. A great interview because it was very conversational. I found the entire process to be extremely user friendly and I can't wait to get started at Memorial.", "Interview Questions": "What can you contribute here at Memorial?"}], [{"date": "16 Mar 2017", "title": "ER Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Memorial Healthcare System - South Florida (Miami, FL) in Apr 2015", "Interview Descriptions": "Group panel interview. You will meet the Nurse manager and the director first and then some regular staff with the Charge Nurse will ask you some questions. Basically, they will ask about your work experience and your current job. They will also ask about your plan in your career.", "Interview Questions": "how do you handle stress?"}, {"date": "5 Dec 2016", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Mar 2015", "Interview Descriptions": "It took me about 2.5 month from getting first interview and to start. You will have about 3 interviews, first with recruiter, then with manager of  the department and then with workers of the department you've applied. They will check all your background, even if you came from different country.", "Interview Questions": "How will you handle rude person? Explain your meaning of teamwork?"}, {"date": "18 Feb 2015", "title": "Telecommunications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Memorial Healthcare System - South Florida (Miami, FL) in Feb 2015", "Interview Descriptions": "I submitted my resume and then received an email to have a phone interview.  The client called my at the exact date and time of interview.  She wanted to know my background experience; how much telecommunications billing analysis; did I have experience in order and configuring telco circuits; do I work well under pressure.", "Interview Questions": "Do you have extensive experience in telco billing analyses?"}, {"date": "28 Nov 2014", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "The entire process from application to job offer took about three weeks. I met first with the department manager for the first interview and then was scheduled for a peer interview shortly after. The manager asked questions pertaining to my strengths, weaknesses, handling conflict, etc. (typical questions that come up during interviews) but also my role and my relationship with other co-workers and boss at my last job. The peer interview consisted of four therapists already working there and they asked about me, my past experience, and three case scenarios. Overall, very reasonable questions and felt like they really wanted to get to know me as a person.", "Interview Questions": "N/A"}, {"date": "19 Nov 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Nov 2014", "Interview Descriptions": "Very easy. Great experience. Wouldn’t change anything about the process. Would do it all over again. Wonderful place to work. Have opportunities to grow. Benefits are excellent. Staff and managers were great to work with. Clean environment. Constantly educated and up to date on the growing healthcare.", "Interview Questions": "What are the 4 pillars "}, {"date": "2 Dec 2014", "title": "Volunteer-Human Resource Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Oct 2014", "Interview Descriptions": "I applied numerous times and received disappointing emails of rejection. I spoke with a hiring representative and she informed me that my resume was submitted to the hiring manager.  Unfortunately, they hired someone with more experience.", "Interview Questions": "I was asked to name a situation where I had to deal with an irate customer and what was the outcome?"}, {"date": "28 Aug 2014", "title": "Patient Financial Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "It seems to be hard to get in this system. Sometimes it is about who you know, unfortunately, I love working here and I am considered an outstanding employee, but people with less credentials, education, and experience get the job because of who they know and the politics. There is typing test and 2 interviews - one with hiring manager and the second with a interview panel with peers. The called me about two days after the peer interview.", "Interview Questions": "How would you handle a difficult client?"}, {"date": "6 Jun 2014", "title": "Patient Financial Services Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Memorial Healthcare System - South Florida (Miramar, FL)", "Interview Descriptions": "The interview process was very standard. Many questions on customer service. Are you able to multi-task? Are you a fast learner? Are you familiar with Microsoft Office? Is your schedule flexible? Do you have a way to get to work? What skills do you bring to the team?", "Interview Questions": "Are you willing to relocate?"}, {"date": "12 May 2014", "title": "Patient Financial Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL)", "Interview Descriptions": "2 interviews, first with manager, second peer interview, they were not very difficult questions. You do have do a typing test to be able to qualify for the interviews. I do know the salary range depends on experience but the range is 14.10 to 24 dollars I believe.", "Interview Questions": "Examples of certain situations applying to your job"}], [{"date": "25 Apr 2014", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Memorial Healthcare System - South Florida (Pembroke Pines, FL)", "Interview Descriptions": "People were nice and interview was average", "Interview Questions": "Panel Interview.They ask the usual questions"}, {"date": "11 Feb 2014", "title": "Director Level Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "The interview process involved meeting not only HR and my manager, but Memorial also conducts peer interviews, where you meet with some of the individuals you will be working with. Throughout the process, I was encouraged to ask questions and was given candid feedback regarding the position, the environment, the rewards and challenges.", "Interview Questions": "Nothing was unexpected. They use behavioral interviewing and will ask specific questions about your experience."}, {"date": "28 Nov 2013", "title": "Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL)", "Interview Descriptions": "Panel interview than perr interview. They do a background check via right right where all you perious jobs are called", "Interview Questions": "N/A"}, {"date": "30 Jul 2015", "title": "RN-III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Jun 2013", "Interview Descriptions": "I was called a day or two after submitting my application. The nurse manager asked a few simple questions to get to know me then scheduled an interview. Once I arrived, the nurse manager led me to a room where a panel of 4 nurses were waiting to interview me. They all asked several questions but it wasn't anything too intimidating. Very typical interview questions.  It lasted about 30 minutes. Two days later I received a call with a job offer from Human Resources. They emailed me the benefits/pay rates and once accepted, we scheduled my physical & drug test and my orientation date which was about a month later.", "Interview Questions": "Name your strengths/weakness, Name a time when, describe your previous work experience, why the switch to NICU, etc"}, {"date": "6 May 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "Called in for an interview. Very simple and fast if they want you.", "Interview Questions": "What brings you to Memorial"}, {"date": "2 Mar 2013", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Memorial Healthcare System - South Florida", "Interview Descriptions": "The interview process that is used is a panel interview.  This allows for multiple team members to assess the candidate and provide their feedback.  Be prepared for behavioral and situational questions.  Provide a good structured response and they tend to move on to the next item (little follow up.)  \r\n\r\nIt did take them several months to contact me after the initial online application submission.", "Interview Questions": "Describe yourself with 5 adjectives - I was not an Arts major:)"}, {"date": "30 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Memorial Healthcare System - South Florida (Miami, FL) in Mar 2013", "Interview Descriptions": "I was immediately greeted by one of the Regional Managers on my first interview. I was a bit nervous however they were very patient and understanding with a young intern like myself.", "Interview Questions": "What is it that attracts you to a place such as this? (Memorial Regional Hospital)"}, {"date": "19 Sept 2017", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Jan 2013", "Interview Descriptions": "The interviewers were very welcoming and kind. They asked pertinent questions and were inquisitive and interested in my personal experience not only professionally with skills sets but also with encounters in challenges with fellow employees. They  allow time for me to ask them questions.", "Interview Questions": "Where do I see myself in their organization in 5 years."}, {"date": "9 Sept 2013", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Miramar, FL) in Nov 2012", "Interview Descriptions": "Professional.", "Interview Questions": "N/A"}, {"date": "18 Mar 2014", "title": "Mammography Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Jan 2012", "Interview Descriptions": "Three stage- First Human resources screens, then supervisor, then peer review.", "Interview Questions": "What is a difficult situation and how did you handle it."}], [{"date": "10 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Oct 2011", "Interview Descriptions": "Lengthy. First got a call from Uman recourses. Than interviewed with the manager. Second interview with a panel consisting of 5 People. The unit secretary, the manager, the supervisor, a patient care assistant", "Interview Questions": "Name a company that you considered to be successfull and why do you think it's successfull"}, {"date": "23 Oct 2009", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Memorial Healthcare System - South Florida in Oct 2009", "Interview Descriptions": "My hiring and interview process is not typical, as I had worked at Memorial previously as a Nurse Tech. Since my nurse manager already knew me, the interview process was a piece of cake. Like most places, it's easiest to get a job if you can bypass HR completely with connections to managers doing the hiring.\r\n\r\nWhen interviewing for the Nurse Tech position, I applied online several times and heard nothing from the HR department. After several weeks, a friend introduced me to the manager–and I was hired on the spot.\r\n\r\nYour mileage may vary.", "Interview Questions": "How do your values align with Memorial's values?"}, {"date": "14 Sept 2009", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Memorial Healthcare System - South Florida (Long Beach, CA) in Aug 2009", "Interview Descriptions": "I was first contacted by a recruiter.  I had a phone interview with them, which basically just reviewed my resume.  They then forwarded my resume to the hiring person.  The recruiter called me within a couple days to setup the phone interview with the hospital.\r\nIt was not a organized interview she went directly into explaining what they were doing, where they were at.\r\nThe overall feel of the interview was a little depressing when she was through?  I think she wanted to make sure the applicant got a real feel for what the position entailed but it ended being more of a negative.  Had I not understood what she was doing, meaning someone fresh out of college probably would have went running in the other direction?", "Interview Questions": "Do you have experience creating the appropriate security build in Epic for document imaging."}, {"date": "1 Dec 2012", "title": "NICU RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Memorial Healthcare System - South Florida (Hollywood, FL) in Feb 2008", "Interview Descriptions": "The overall process went well.  It took almost 3 weeks before I heard back from human resources after applying on line. From that point on, everything else went smooth.  I had my first interview with Human Resource and I was then scheduled for an interview with the nurse manager.", "Interview Questions": "The interview felt more like having a conversation about my experience. I did not encounter any difficult or unexpected questions. "}]]