[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Feb 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Supportive and helpful colleagues and Management, good company culture, big focus on diversity inclusion and mental health, flexible working options", "cons": "Work from abroad policy needs to be improved"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "It’s ok", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jul 2023", "job_title": "Manager in London, England", "duration": "N/A", "pros": "WFH is great and you can do it every day", "cons": "Senior Leadership Team is dire and refuses to be honest about pay"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Jun 2023", "job_title": "Scrum Master in Devoto", "duration": "N/A", "pros": "Great boss who helped me grow.", "cons": "Silos of work in certain areas. Some people have been there for too long, and are not being challenged."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A bad place to work if you aren't a sociopath or a coward. Especially bad if you aren't incompetent. Bad for minorities", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Oct 2021", "job_title": "Senior Software Developer in Buenos Aires", "duration": "N/A", "pros": "It was so bad that it made me appreciate the next job more.", "cons": "I worked there back in 2019 because I thought the fact that they were paying a higher salary than I'd asked for meant that they might not hate black people or women. The salary was actually very low for the position itself but at the time I would have been under-qualified for the role in a normal company. I quickly learnt that the pay was little more than hush money and that there'd be plenty of hate to go around. I had to endure verbal abuse from a violent, misogynist and probable-narcissist in the department (he was also alleged to have hit a member of staff half his size and was apparently a gun enthusiast). Later I suffered physical abuse from a white woman on staff who seemed to resent black team members, particularly when we were half-decent at our jobs. It wasn't unusual for managers to do next-to-nothing when their staff were abused in front of them or even go as far as to help cover up such incidents.\r\n\r\nI considered taking the Royal Pharmaceutical Society to court over the way in which repeated abuse and discrimination was handled there (long story short: if you complained about abuse, you could expect HR to make you a target and eventually treat you worse than they treated the aggressor). All I'd really wanted was an apology and some sort of commitment to do better in the future. The problem is, I think a lot of people at the RPS lack self-respect which is why they enjoy working in an unsafe environment with bad people who mistreat them. A lot of the staff there *were* the bad people. I used to feel a little sorry for some of my colleagues because they were so servile - back when I thought that they didn't know any better. But it isn't simply ignorance that keeps people at bad companies like this.\r\n\r\nI dropped my Employment Tribunal case in the end, in part to focus on more interesting pursuits. Being the only person willing to call out bullying and discrimination in an organisation that already selects for cowards who will defend bad behaviour can be quite tiresome. The legal team at the RPS foolishly made a costs order after the case was dropped. When this failed and the judge sided in my favour, a number of pharmacists within the membership body found out just how poorly the RPS had behaved up until that point. An article in the Independent Community Pharmacist magazine was even published about their failure.\r\n\r\nDuring negotiations, the RPS demanded that I agree to waive my right to a subject access request in order to obtain an apology. As demanding this of me was borderline illegal and the case was eventually dropped without a deal anyway, I made the subject access request. This revealed that the RPS was probably aware of some shares I owned in another company. I believe they'd acted in an inflammatory way towards me in part because they had overestimated the value of said shares. If I'm correct, their reliance on litigation as a source of revenue seems quite risky as some of the other data I found in the DSAR suggested to me at least that I probably would have won that tribunal case had I gone through with it. Funnily enough, had they not insisted on asking me to waive a right that I'm entitled to under GDPR, it wouldn't have occurred to me to request this data from an employer in the first place!\r\n\r\nWhen the RPS lost their costs order, a sick individual (or possibly a group of such individuals) mysteriously started posting libel about me on social media. This individual(s) claimed to work for the RPS at one point but also claimed to work at my previous employer. I suspect it was someone either employed by the HR or Legal teams or with close ties to them as they retold details of the abuse that I had suffered whilst working there (abuse that HR and Legal were informed of) but then pretended that I was the aggressor. Often this was done in ways that didn't make much sense. The trolls claimed that an incident in which I'd suffered unprovoked verbal abuse from a colleague was a story that I'd somehow fabricated at a previous job even though a number of RPS staff had witnessed the incident and given evidence to HR. The RPS has not officially denied that I suffered discrimination on that occasion, I suspect because it was not a first-time offence for the misogynist at the centre of it and he was likely fired as a result of his actions. The troll at one point regurgitated my own accounts of when I was targeted by a white woman in the team but because their intention was to present me as the attacker (and it should be stressed that, in reality, I was the victim), they produced a bizarre story in which somehow a black woman on staff was the one physically attacking other women of colour. It's worth noting that, quite on the contrary, a number of the other people of colour that I'd worked with at the RPS are on record as saying how sorry they were about how I was treated when I left. Attacking other members of staff isn't in my nature and the person who wrote those posts, most likely knew that at the time.\r\n\r\nOf course the Royal Pharmaceutical Society denies posting the defamatory messages. However, this actually isn't the first time something like this has happened there. I've heard of a similar harassment campaign launched against a pharmacist in the membership body after she'd spoken out against the bullying she'd experienced. Earlier this year I was in touch with a pharmacist who was accused of all sorts after he'd tried to draw attention to financial irregularities within the organisation. The latter case is interesting in that its conclusion actually called into question whether the RPS should retain its chartered status.\r\n\r\nI believe that the Royal Pharmaceutical Society has hired a company (or multiple companies) to stalk me online since then, specifically on LinkedIn where increased traffic from dodgy marketing companies is most obvious. I've seen evidence of a fake news peddler swarming around the scandal though whether that individual was also employed by the Royal Pharmaceutical Society is unclear. Pretty unfortunate that they would waste their members' money in this way if this is the case but perhaps anyone paying the RPS more than the absolute bare minimum just deserves to get scammed at this point.\r\n\r\nThe ultimate joke is that the Royal Pharmaceutical Society is a nothing company that doesn't really need to exist in its current form!\r\n\r\nFrom an engineering perspective, the tech team is mostly selected for perceived incompetence. The objective isn't so much to get work done as it is to maintain the appearance of work so that senior management can say that they have a tech team. On the off-chance that they ever needed to do anything, they knew that they could just hire contracting agencies or buy software off the shelf. Waste of time as far as career progression is concerned because no-one there actually knows what they're doing. You really are just better off working for a real tech company.\r\n\r\nAs for the rest of the business, I suppose the publications themselves are useful to medical professionals. I'm unconvinced that they made enough money to be sustainable however which at the very least would explain the doomed costs order. It's hard to believe that the poor management within the Pharmpress team isn't reflected in the product itself. Indeed, knowing what I know, it genuinely wouldn't surprise me if those things were littered with mistakes at this point (though I'll concede that I'm not a pharmacist and so couldn't say one way or the other). All in all, I suspect that they'll struggle to find talented people willing to work with them in the coming years.\r\n\r\nThe membership body isn't a regulator like the GPhC so it mostly functions as a talking shop for credulous liberals (you know, the sort of people who lack substance but think \"representation matters\"). I didn't see many born-leaders or innovators at the RPS either so it seems laughable that one would look to them for any sort of leadership. Just another waste of money from that perspective.\r\n\r\nSo to conclude, I would say that if a disillusionment with your industry has led you to consider working for the Royal Pharmaceutical Society, it's definitely not worth it. It is a miserable, stagnant, place to work and ultimately none of the people there will be worth your time or patience. Whilst there, I remember feeling really hopeless about finding another job and worried that there just might not be anywhere in the tech industry for minorities unwilling to completely sell-out. Then I found my current job. I have to say that after dealing with the awfulness and the violence at the Royal Pharmaceutical Society, it felt good to finally work somewhere where people not only treated each other with respect but actively looked out for one another. I hope to write more about that experience soon. Good companies are out there, the Royal Pharmaceutical Society just isn't one of them and it never will be."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Pharmaceutical Journal", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Oct 2021", "job_title": "Anonymous Employee in Buenos Aires", "duration": "N/A", "pros": "Salaries are not bad and the building is nice.", "cons": "Great job if you want to sit, do nothing and get paid. If you want to learn then do not apply. \n\nToxic work culture, dictatorship style leadership, very primitive programing and tools. Overall very behind the industry."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Nov 2021", "job_title": "Corporate Communications in London, England", "duration": "N/A", "pros": "Culture and values. RPS is a great place to work. Fantastic employee benefits, flexibility and openness to change. People are open to new ideas. It's a supportive and caring environment.", "cons": "Not many opportunities for career progression"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good company to work for.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jan 2021", "job_title": "Junior Software Engineer in London, England", "duration": "N/A", "pros": "RPS has one of the best cultures I have ever seen. My colleagues and overall everyone are collaborative, helpful and kind, in summary really good people to work with. My manager is empathetic and resourceful, he looks to make me grow and he has been willing to resize wrong objectives. The company cares about wellbeing, mental health, the gender gap, Inclusion and Diversity, and many more topics are on the agenda.\r\nI love we have the chance to do pairing and mob programming sessions, we also teach to intern students from University. We responsibly faced the pandemic, and I had the chance to touch different technologies from front end to back end. Plus some AWS.", "cons": "Because we tend to be a non profit organization it may be hard to escalate in a bigger role. Someone may have to leave in order to take that opportunity. Personally, I would love a stronger technology department (always space for improvement)"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Review", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jul 2021", "job_title": "Marketing Executive in London, England", "duration": "N/A", "pros": "Flu jab, flexible hours, nice building", "cons": "Disorganised, lack of process, small marketing budget"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Feb 2021", "job_title": "Head of Professional Services in London, England", "duration": "N/A", "pros": "I worked at RPS for almost 5 years and absolutely loved it. Great culture and colleagues. I progressed quickly and made very good connections. The building and the canteen is amazing too. I had 3 different line managers and they were all great. Very supportive and inspiring.", "cons": "There used to always be issues with AV in the London building but that’s all I can think of!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jun 2021", "job_title": "Clinical Writer in London, England", "duration": "N/A", "pros": "flexitime, good managers, good culture", "cons": "paid less than pharmacists generally"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A really nice place to work with lots of great and friendly colleagues.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Feb 2021", "job_title": "Delivery Manager in London, England", "duration": "N/A", "pros": "Cares about it's employees. Big focus on well being and offers good flexibility.", "cons": "Lack of career progression pathways due to a relatively flat structure."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Friendly workplace", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Feb 2021", "job_title": "Clinical Writer in London, England", "duration": "N/A", "pros": "Friendly staff and accomodating work environment.", "cons": "Limited opportunities for growth within the company"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good starting point but no career progression", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 May 2016", "job_title": "Membership Officer in London, England", "duration": "N/A", "pros": "Initially I had lots of exciting projects and challenges to work on when the membership body de-merged from the regulator. Nice food in the canteen (back when the office was based in Lambeth). Some great people and a really diverse environment.", "cons": "Absolutely no career progression, my role actually demoted steadily even though my performance reviews were great.  My line manager once said they didn't like to give the top score in the reviews because it suggested you were in the wrong job. Well then I began earning the top score across the board.  When I raised the issue that my job had become very basic, I wasn't being invited to meetings and I wasn't getting any progression the response was on par with a shrug.  Not good for pay either, (never got a raise in over 2 years) especially for the amount of work I was expected to do with no support.  I moved to somewhere new on good terms with my manager and colleagues.  But I was also bullied and belittled quite badly by one colleague to the point it started to affect my health and not much was done about it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great employer", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Oct 2020", "job_title": "Membership Officer in London, England", "duration": "N/A", "pros": "Competitive salary, great people, nicely challenging", "cons": "No space for progression to senior management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good work life balance", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Apr 2017", "job_title": " in London, England", "duration": "N/A", "pros": "Most people leave at 5 and working late is rare, making for a good work life balance. The culture is pretty friendly and supportive. HR, middle &  some senior management are good however the board can make any change glacial.\r\n\r\nCanteen, regular work socials, gym discounts, bike to work scheme, \r\n\r\nOverall I'd rate this place pretty highly, can be a good place to work for a few years before moving on to something more challenging. Or it can be a good place to work later on in", "cons": "High staff turnover due to little scope for internal career progression"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Really lovely place to work, very flexible and very welcoming", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jun 2020", "job_title": "Business Development in London, England", "duration": "N/A", "pros": "Friendly people - easy to get to know everyone in a short space of time\r\nFlexible - flexible working, working from home (when not in a pandemic)\r\nKeen on developing skills - lots of opportunities to go outside your job role and work with other teams and up skill yourself\r\nLots of social activities", "cons": "Pay rises are limited\r\nLack of diversity in some areas"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Professional services", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Apr 2018", "job_title": "Professional Services in London, England", "duration": "N/A", "pros": "Good location, looks lovely on the outside, nice reasonably priced staff restaurant with good choices and opening times, each floor has a staff refreshment area, good set hours", "cons": "Poor support, poor training structure, lacks a good atmosphere, very high turnover of staff, no one really knows the RPS is meant to be and so it’s difficult to know what we are trying to do"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "3 years at RPS", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Jun 2020", "job_title": "Administrative in London, England", "duration": "N/A", "pros": "The people are amazing. It is easy to form bonds and everyone is keen to help each other. \r\nThe flexible working provides a great atmosphere and support system for teams. There is a great work/life balance.", "cons": "There can be a divide across different sectors of the company. Though they work hard to try and minimise this it seems certain sectors are not keen to do so."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Awful and, at times, violent bullying culture in the Technology team. Worst engineering department I've ever seen", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Jan 2020", "job_title": "Senior Software Developer in London, England", "duration": "N/A", "pros": "There were a few lovely people on the team who made working there seem worth while. **Some** members of management are actively trying hard not to repeat the same mistakes over and over again. \r\nAs well, from what I saw, the smaller .NET team seemed to have a much better culture than the Scala team.", "cons": "I'd say this was one of the worst places I've ever worked and that the Pharmpress team in particular was the worst team I've worked in as a developer. I had to complain to HR about a number of people on the team in the eight months I worked there. One got the impression that the Pharmacists there were probably doing all right but in Tech there was a horrible bullying culture within which members of staff who screamed misogynistic abuse during meetings and threatened others with assault were tolerated for years, people who otherwise might have been talented developers became too apathetic to care about improving anything and others just seemed to really hate being challenged. Along with sexism, class discrimination and, in one case in particular, an undercurrent of racism, were problems that you could find within the team quite easily. It was an unsafe team in which mediocre members of staff would physically push their colleagues and could be expect to be protected by HR when they did so. Of course this all took place maybe a month after the team had been given a \"Dignity in the Workplace\" training course by HR.\r\n\r\nAs well, this is essentially one of those companies where people who complain about bullying run the risk of being punished by HR for doing so . In fact that team were more than happy to persecute victims of bullying for the most spurious reasons. Their grievance procedure is a complete joke and for some reason involves having managers whom they know will be hostile to the person who has raised the grievance actually run the investigation.\r\n\r\nOn the subject of mediocrity, the codebase was complete trash - a lot of it is legacy code riddled with poor choices, poor documentation, pull requests from four years ago that looked like the authors and reviewers had never even seen a PR before. Infrastructure written by someone who clearly had no idea what they were doing but was never held accountable for any of it. Flagship products hosted on servers so old they ought to be criminal! There isn't a clear enough distinction between the work of the software developers and that of IT technicians so you do regularly see members of the dev team fixing what are essentially printing issues.\r\n\r\nAnd of course there was middle management more generally. To be fair, I did think that there were members of the management team who were really trying to change things for the better: they weren't perfect but they were trying the hardest they could in an organisation that, up until maybe a year ago, didn't seem to understand why it even needed an engineering team. There was however managers who would actively enable bullying from members of staff do nothing when it happened in front of them. Staff were discouraged from reporting such incidents to HR for fear that it woul reflect badly on management. Middle management even sabotaged a grievance raised against a bully in one case. This was a place where bad management would mean a lot of dev time was sunk into maintaining systems that anyone with eyes could see should have been replaced at least ten years ago. When that didn't work it was easier for those in charge to blame the failure on the way in which the customer had written the ticket rather than the Pharmpress team's inability to adequately support non-technical editorial staff. I felt in particular that parts of middle and senior management behaved horribly to staff whom they knew were planning to resign or had given negative feedback in what was supposed to be an \"anonymous\", internal \"Workbuzz\" survey.\r\n\r\nWhen I applied, they inexplicably offered me a more senior role than the one I'd actually applied for and I suspect that that was because the coding challenge itself was unusually simple and my manager, got easily confused during the interview. They told me that I would get all the support I needed to grow into the role but I wasn't surprised when that turned out to be untrue. More generally it often felt like professional development was an after-thought - they only ever had five licences for Pluralsight and one account for the old version of Safari Books (it wasn't even compatible with the current android app!). One of the agencies that they work with (who were actually quite good) did offer AWS training which was pretty cool but it was very much a great thing that the contractors did as opposed to something planned by RPS or the Pharmpress team.\r\n\r\nTooling was terrible. We all had to use laptops that were so heavy, carrying them home would give you back problems because they couldn't be bothered to spend money on a macbooks. The laptops only had an hour of battery life so there was never any point taking them into meeting rooms. They kept pretending to be a Linux team even though they knew that IT was unwilling to support Linux users which caused unnecessary conflict when it came to things like viewing remote presentations, &c. In fact, working remotely was always a problem as no-one seemed to know how to connect to projectors and microphones in the meeting rooms consistently which meant there were loads of meetings where remote users were just stuck looking at a random team member's face the entire time, would be expected to follow slides in a separate window or just wouldn't be able to hear anything.\r\n\r\nNone of this is to say that there weren't good people on the team - there were some decent people there who were probably the main reason I didn't just leave during my probation period like I should have done. If anything it's why the fact that there were so many bad actors among them always seemed a little shocking. My pay was good but not worth the trauma - it was apparently better than that of many of my colleagues at the time which I think is saying something. Anyone thinking of joining should really consider working somewhere else until they sort out their horrible culture."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great benefits but typically corporate", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Oct 2016", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Reward scheme and benefits, management academy training,  Good reduce, reuse and recycle scheme and wellbeing support.", "cons": "Teams work in silos. Decision making reliant on a slow working Board, executive process which can limit opportunity for creativity and leadership."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Happy employee", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 May 2017", "job_title": "Pharmacist in London, England", "duration": "N/A", "pros": "Good colleagues and networking opportunities. Good outlook on professional landscape and workforce planning. Good opportunity to understand challenging landscape in pharmacy.", "cons": "Poor work life balance and changing work priorities. High staff turn around with whole teams disappearing. HR could be better."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Breath of fresh air", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Aug 2019", "job_title": "Employee in London, England", "duration": "N/A", "pros": "- Flexible and trusting working environment\r\n- Not afraid to be challenged and to innovate\r\n- Friendly colleagues\r\n- Great inclusion & diversity\r\n- Willingness to listen", "cons": "- Quite a young company relatively in this space so still trying to consolidate its vision"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Jun 2020", "job_title": "Director of People and Culture in London, England", "duration": "N/A", "pros": "RPS cares about it's employees and genuinely wants to do the right thing.", "cons": "Change can be a little slow to implement, partly due to our governance and partly due to the fact that we try to do too much."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Very supportive company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jul 2020", "job_title": "Art Editor in London, England", "duration": "N/A", "pros": "Open to change after input from staff. Modern building in nice location.", "cons": "Limited advancement for Art Editor position (not unusual for this position outside of traditional magazine/publishing companies)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to start a career", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2016", "job_title": "Sales and Marketing in London, England", "duration": "N/A", "pros": "Great Environment - Great People. Exciting times", "cons": "lots of different departments that don't always try to work with each other."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jun 2020", "job_title": "Content Director in London, England", "duration": "N/A", "pros": "Engaged and talented colleagues; ambitious objectives; collaborative culture; and a strong sense of mission.", "cons": "I don't see any cons worth flagging."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Nov 2017", "job_title": "Intern in London, England", "duration": "N/A", "pros": "Friendly team passionate about improving medicines information. Flexible working hours available.", "cons": "Structure of the company wasn't as flat as I'd hoped."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Head of Assessment and Credentialing", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Jul 2020", "job_title": "Assessment Coordinator in London, England", "duration": "N/A", "pros": "Work flexibility and great colleagues", "cons": "Not much career progression and low remuneration"}]]