[[{"date": "24 Oct 2022", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MGH Institute of Health Professions", "Interview Descriptions": "talked about job role and qualifications for expected duties discussed how i could help better their operations and help their team Reviewed my history and past experiences as well as different aspects of the systems that could help my employer in the new role", "Interview Questions": "What can you bring in a position of integration and team leadership"}, {"date": "25 Oct 2022", "title": "Data Analyst Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MGH Institute of Health Professions (Boston, MA) in Sept 2022", "Interview Descriptions": "three rounds in total: phone call, video, final group interview. Phone call is self introduction and position requirement. I may fail in seconed round even I answer all the questions.", "Interview Questions": "SQL queries questions including using join, subquery etc"}, {"date": "11 Jul 2022", "title": "Clinical Research Coordinator I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MGH Institute of Health Professions", "Interview Descriptions": "It was very friendly and welcoming. I was emailed for an interview soon after. I had to reach out again after sending my availability but they appreciated that since it showed initiative.", "Interview Questions": "Why ware you interested in working with us? "}, {"date": "21 Oct 2021", "title": "Research Enrollment Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at MGH Institute of Health Professions in Oct 2021", "Interview Descriptions": "The first round consisted of meeting with Project Manager. Should the initial screening go well they will then redirect you to one of the specific sites so that they may better understand whether you will fit better at that specific location.", "Interview Questions": "What are your goals and aspirations?"}, {"date": "27 Sept 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at MGH Institute of Health Professions (Boston, MA)", "Interview Descriptions": "Group interview directed at your resume in an informal capacity. Three students and one faculty are asked individual questions. Interview process is split into two groups followed by and orientation day.", "Interview Questions": "Who is your Professional role model? "}, {"date": "21 May 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MGH Institute of Health Professions", "Interview Descriptions": "The initial interview was via phone call. They just wanted to introduce the position, answer questions and get to know your background and future goals/what you are looking for in the position to ensure it’s a good fit for you. The second part of the interview process consisted of in-person interviews with four of the current members (beginning with the main hiring manager, which was the longest interview). Each person asked the same questions", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "27 Sept 2021", "title": "Youth Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MGH Institute of Health Professions (Boston, MA) in Apr 2021", "Interview Descriptions": "They were welcoming, accepting, and nice. They took their time asking questions. I talked about my experiences at school and I talked about what classes I took. Everything went well.", "Interview Questions": "Why did you apply? Why are you interested? "}, {"date": "19 Apr 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MGH Institute of Health Professions in Mar 2021", "Interview Descriptions": "I interviewed with HR first and then my second interview was with two individuals via Zoom at the same time. They were all very kind and professional and it was a good experience.", "Interview Questions": "About myself and my work history"}, {"date": "16 Apr 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MGH Institute of Health Professions", "Interview Descriptions": "The interview process included two meetings with the boss, then an subsequent offer over email. I got this interview by word of mouth, but was impressed by the work environment.", "Interview Questions": "Tell me what experience you've had working in the field."}, {"date": "17 Jul 2018", "title": "User Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MGH Institute of Health Professions (Boston, MA) in Jun 2018", "Interview Descriptions": "I applied for a position mid-May and was contacted for an initial screening by the first week of June to include a courtesy follow-up email which was crucial as I missed the original email. Led to about a 30 minute standard call with HR. Was contacted and scheduled quickly for a follow-up the next week. Single interview with one of the two directors. Open interview style 60% conversational / 40% structured (*pleasant). Didn't move past that stage but was contacted about a month later. Overall a pleasant experience. Br**n R**S and Jo**e Sa****a were great.", "Interview Questions": "Standard Interview Questions"}], [{"date": "13 Jan 2021", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at MGH Institute of Health Professions (New York, NY) in Dec 2017", "Interview Descriptions": "Straight forward , asked relative simple questions about relative experience and professional background. People were friendly and polite, and from mixed gender. Highly recommended interview process.  Nothing else to add. thank you for the opportunity.", "Interview Questions": "Why now? what is your motivation "}, {"date": "13 Nov 2015", "title": "User Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MGH Institute of Health Professions (Charlestown, MA) in May 2014", "Interview Descriptions": "Short phone screen with HR. Was asked to come in for interview with Assistant Director of IT. Asked questions on the individual's knowledge and personality.", "Interview Questions": "What are the types are encryption softwares you're familiar with? What type of work environment was your previous job?"}, {"date": "29 Jun 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MGH Institute of Health Professions (Charlestown, MA) in Nov 2012", "Interview Descriptions": "Hiring through Bulfinch Temp Agency. Interview process by the department . I got hired by the department and then referred to Bulfinch for paper work. I had volunteered at an event where I got to meet with the department head. He asked me to come see him in his office. Asked for my background, interests, skills and time commitment. After which he hired me to work closely with staff at the.", "Interview Questions": "Why MGH ??"}]]