[[{"date": "12 May 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mitacs", "Interview Descriptions": "The process is rather long but they do it to ensure serious applicants want the position. This does result in a company with many intrinsically motivated people. Phone interview with HR recruiter, Video interview with the actual hiring manager, group interview with hiring manager and select team members.", "Interview Questions": "What do you think this role does for the company? Why do you want this role? Tell me about the Mitacs mission in your own words. What does it mean to you?"}, {"date": "13 Mar 2023", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mitacs", "Interview Descriptions": "It was relaxing and very easy to answer, try to express your opinions. During the interview, demonstrate your ability to communicate complex ideas in a clear and concise manner and also demonstrate your passion for research.", "Interview Questions": "Describe two social events/activities you would want to plan for your students *"}, {"date": "1 Jul 2022", "title": "Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mitacs", "Interview Descriptions": "3 stages\r\n1. general question, my background and experience\r\n2. role play, i failed in this stage. imagine you are in the event on the way back meet a person in elavator and want to market for Mitacs\r\n3. interview with the manager, i was supposed to present a powerpoint", "Interview Questions": "About my background and how my background matches the position"}, {"date": "1 May 2022", "title": "Business Development Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mitacs (Vancouver, BC) in Apr 2022", "Interview Descriptions": "There was a short intro call with HR followed by a call with the district manager and another BD Director from the region. The calls were all done via telephone with no video call service. Total time for both calls was just over one hour.", "Interview Questions": "What are some of the organizations values that you identify with most closely?"}, {"date": "3 Mar 2022", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mitacs (Toronto, ON)", "Interview Descriptions": "Applied online and I received an email to schedule a 15-min phone call. The call according to me went pretty well. This was going to be followed by 3 video call interviews. A week later I emailed for a follow-up and received no reply. If you don't intend to proceed with a candidate, let them know so. I was very excited about what the company does.", "Interview Questions": "I was asked about what I'm looking for, where I want my career to go and why I want to work for them. "}, {"date": "9 Jul 2023", "title": "Business Development Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mitacs (Montreal, QC) in Jul 2021", "Interview Descriptions": "Applied online, first round with HR, then with the hiring manager, finally with the whole BD team with a presentation to describe my experience. The whole process took about 4 weeks.", "Interview Questions": "How do you a cold call on a client?"}, {"date": "25 Jun 2021", "title": "Policy Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mitacs", "Interview Descriptions": "The interview process is really long. Pretty sure it’s not necessary to have more than 3 interviews. At that points you’re just stringing people along. In the end, I emailed them asking for feedback on why I wasn’t selected and they never replied.", "Interview Questions": "What data analysis tools are you able to use?"}, {"date": "11 Jul 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mitacs (Toronto, ON) in May 2021", "Interview Descriptions": "What they don’t tell you in the interview is that the hours are odd - 9-5:30 with a half hour break. This really isn’t standard. Then HR will tell you at your onboarding and then smile while saying a VERY toxic line - “if you’d like to end at 5 just skip your lunch hour altogether”. Big red flag.", "Interview Questions": "What do you know about Mitacs"}, {"date": "24 Jun 2021", "title": "Business Development Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Mitacs (Toronto, ON) in Apr 2021", "Interview Descriptions": "I applied online over 20 times in the past few years. I meet all requirements 100%; however, never get an interview. Reason: Someone inside the system MUST know you or you do not waste your time.", "Interview Questions": "Tell me about yourself?\nWhy do you think you are a good fit for this role?\nWhy do you want to work with MITACS?"}, {"date": "26 Apr 2021", "title": "Globalink Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mitacs (Montreal, QC) in Mar 2021", "Interview Descriptions": "The interviewer was so kind and asked questions regarding my experience and behavioral, situational questions. It took about 45 minutes. An interview was held in Microsoft Team. They sent me 3 questions when they invited me to an interview to think about them. There question was: \r\n1. What ideas do you have for staying in contact with your assigned students? How will you keep in touch and stay engaged with your students? \r\n\r\n2. Please describe ideas for one or two potential virtual social events/activities you could run. Keep in mind students may be in different time zones. \r\n\r\n3. Do you have a specialty, certification, or skill that you plan to share with the students? How will you share your skill or interest with your students?", "Interview Questions": "1.what was your past experience as a leader?\r\n"}], [{"date": "25 Jan 2021", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mitacs", "Interview Descriptions": "It happened over the phone and I felt that the interviewer was both friendly and enthusiastic. I was well prepared for the interview and took the opportunity if asking questions which were promptly answered. It was a good experience overall", "Interview Questions": "Why do I want this job?"}, {"date": "22 Feb 2022", "title": "Program Assistant, Program Pilots Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mitacs in Oct 2020", "Interview Descriptions": "Completed several rounds of interviews. I was not successful but never heard back from the company or any of the people who interviewed me.  A simple rejection email would have taken a few minutes to write which makes it extremely rude to never follow up. \r\n\r\nGhosting candidates is unprofessional and looks bad on your company.", "Interview Questions": "many questions were asked and I spent a lot of time prepping for this one. "}, {"date": "31 Mar 2020", "title": "Business Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mitacs", "Interview Descriptions": "Very positive - hiring committee was extremely warm and welcoming.  I was given the opportunity to put together a presentation, explaining my background and presenting examples of the sort of collaborative projects that I would propose once in the new position.", "Interview Questions": "How would you perform outreach to a new company? How would you convince them that Mitacs is a good company to work for?"}, {"date": "22 Jan 2020", "title": "2018 Globalink Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Mitacs", "Interview Descriptions": "Skype interview with the professor. He was nice, kind and easy-going.  He asked about my study and previous lab experiences, including some technical questions. Be prepared with the specific project that you are applying to.", "Interview Questions": "What are your previous lab experiences?"}, {"date": "14 Nov 2019", "title": "Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mitacs", "Interview Descriptions": "The first stage was a Skype interview with multiple  employees on the Communications team. The in-person interview was a few hours long. Was interviewed by most current employees and completed the interview process with a presentation.", "Interview Questions": "Standard"}, {"date": "3 Nov 2019", "title": "Business Development Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mitacs", "Interview Descriptions": "phone interview with the manager of mitacs in Edmonton was very unprofessional, he was in the cafe and I was hearing lots of sounds, I was not able to focus for 45 minutes of interview. I did not get any feedback after 1 month of waiting. I contacted them and they said they did not accepted me.", "Interview Questions": "Lots of scenario question that do not make sense."}, {"date": "9 Oct 2019", "title": "Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mitacs", "Interview Descriptions": "Phone screening, phone interview with hiring manager, final presentation interview in front of the team. background check by the recruiter. Overall it was a very lengthy interview process. got an offer 2 weeks after my presentation", "Interview Questions": "what challenges did you face in your previous position"}, {"date": "30 Jul 2019", "title": "Full Stack Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Mitacs (Vancouver, BC) in Jul 2019", "Interview Descriptions": "It was like a 2-round interview in one day. First, the VP and a senior full-stack engineer asked you about your experience and project. We talked about many details and they really cared about your past experience.", "Interview Questions": "How to authenticate users? "}, {"date": "31 Jan 2019", "title": "Business Analyst Part-time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mitacs", "Interview Descriptions": "asked several questions in terms of previous experience in data analyst and resume, especilally focused on past experiences with application to what I will do in the future. they also provided me with everything I need to do in a day to ask me if that fits my expectation", "Interview Questions": "what did you do in last job?"}, {"date": "29 Jan 2019", "title": "Business Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mitacs", "Interview Descriptions": "I was contacted by email by someone from HR who set up a phone interview with a  Business Development director. I didn't hear back from them after the phone interview.", "Interview Questions": "Are you familiar with your local research/technology/business landscape?"}], [{"date": "21 Aug 2018", "title": "Business Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Mitacs", "Interview Descriptions": "I had a first phone call of 10 min to review why I wanted to work for Mitacs and about my previous experience. Then second interview with two business directors. Finally, a presentation giving insights about my research of the field and opportunities.", "Interview Questions": "Why do you want to work for Mitacs?"}, {"date": "25 Oct 2019", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mitacs in Jul 2018", "Interview Descriptions": "One phone interview with human resources asking mostly screening questions. Invited for an in-person interview with the managers and other team members. Finally, before hiring, there was another phone touch-in with a few questions to make sure I was still interested in the position.", "Interview Questions": "Standard questions. What your previous teammates or colleagues say about you?"}, {"date": "17 Aug 2018", "title": "Grant Management Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mitacs (Vancouver, BC) in Jul 2018", "Interview Descriptions": "Applied through a co-op program, and got an interview within 3 days, then I went in for an interview on UBC campus. I was interviewed by a Grant Management Teamlead and 2 employees. They were very friendly throughout the process.", "Interview Questions": "What is your ideal work environment?"}, {"date": "14 Apr 2018", "title": "Grant Management Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Mitacs (Toronto, ON) in Mar 2018", "Interview Descriptions": "It was quite a long process. Applied through a staffing  agency:\r\nSubmitted my resume\r\nHad phone interview.\r\nGot a call two days later for the interview in their office in Toronto.\r\nWent in and had my interview with 4 employees. took  an excel skills test as well.\r\nDidn’t hear back for a while . Had to find out that I didn’t get the job by the company reposting that position", "Interview Questions": "Typical behavioral questions like biggest weakness\r\nGreatest accomplishments?\r\nWhere do you see yourself in 5 years \r\nWhere do you see yourself in 10 years?\r\nHow would  your past experience help you in this position?\r\nWhat do you think this position duties are?\r\nMore questions that I can’t remember  Sorry😐 "}, {"date": "11 Mar 2018", "title": "Business Development Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mitacs", "Interview Descriptions": "Applied and got a 45-minute interview phone call. Still in the progress of applying to this position. The job will be located in Hamilton. Hoping to get the job.", "Interview Questions": "What are your views to achieve a better development plan?"}, {"date": "30 Oct 2018", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Mitacs (Toronto, ON) in Feb 2018", "Interview Descriptions": "The first round interview was over the phone, it took a while to hear back from them but they were flexible accommodating the time of the interview. The call was with the team leader and another manager and lasted almost an hour. I didn't get the job, but enjoyed chatting with them regardless.", "Interview Questions": "Prepare a 30-second elevator pitch "}, {"date": "25 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mitacs (Toronto, ON) in Sept 2017", "Interview Descriptions": "I applied online. Received an email within a few days asking to confirm a time for a phone interview.After a few days received a  30 minute  phone interview with head office. Got a call back next day and was asked to attend in-person interview at Toronto office the following week. The interview was 90 minutes in total.  It included two Skype interviews (30 minutes each ) with head office and with one international partner and than a 30 minute interview with manager ( and another executive) in person.", "Interview Questions": "How would you maintain coordination between this office and international and out of office executives ?"}, {"date": "20 Oct 2017", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Mitacs (Vancouver, BC) in Jun 2017", "Interview Descriptions": "submit the resume and cover letter first. Got a chance to have face-to-face interview with the manager and the team lead after the screening. The interview was not quite long but they will ask you questions both technically and generally. And then they will give you response likely within a week.", "Interview Questions": "some basic questions about sql"}, {"date": "9 Oct 2018", "title": "Business Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mitacs (Montreal, QC) in Mar 2017", "Interview Descriptions": "I had two interviews with Mitacs: one by phone and the other in-person.  While the phone interview was a little awkward (as phone interviews tend to be), I did well enough to advance to the in-person interview. This interview, like the phone interview, was done in English and French, and the interviewers were professional and courteous.", "Interview Questions": "Imagine you are speaking with a prospective client and they tell you they only have five minutes to talk to you. What do you tell them in your sales pitch? How do you get them interested?"}], [{"date": "24 Sept 2020", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mitacs (Vancouver, BC) in May 2016", "Interview Descriptions": "This interview will always stand out as the worst, most pretentious interview I have ever done in my life. After a phone interview, I had to do a PowerPoint presentation about myself and then several panel interviews, followed by a written interview. You do not need the entire company involved in the hiring of an entry level candidate, whom you are offering a 45k salary. Of course the company is about 'collaboration' which they took entirely too far. It was an absolute embarrassment on both sides.", "Interview Questions": "Make a 10 minute power point presentation about yourself, and anyone in the company is welcome to watch. "}, {"date": "10 Aug 2018", "title": "Grants Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mitacs (Montreal, QC) in Jan 2016", "Interview Descriptions": "Applied on line, got an interview after 3 weeks, 2 interview by phone and one by person. 5 persons present and 3 by conference call. Of course, there is not too much question for 8 persons so the same question again and again and again. one excel exam just putting the grant infos in a form of excel and 2 word exams , one French and one English. Writing emails responding the questions about grants. You can use their site.", "Interview Questions": "why want to be a grant manager, why mitacs, how to communicate with students , internal stakeholders and external, you prefer  email or phone or in person,  how to prioritize your work, how to arrange the emergencies and other staff"}]]