[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jun 2019", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "I work with amazing people and feel like I'm contributing to the mission of our organization. CAQH makes giving back to the community a priority. We have regular company parties and happy hours. Our office is an open and bright space with free beverages and healthy snacks. We have electric standing desks and an onsite fitness facility (equipped with Peloton bikes and a sauna). CAQH offers one work from home day per week and we have 12 holidays off per year (13 when July 4 falls on a Tuesday or Thursday, as we are given Monday or Friday off). We have excellent benefits including an extremely generous 401k. Employees are recognized for great work and are rewarded for achievements!", "cons": "Managers should continue to promote an open door policy to their staff."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Salary", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Feb 2023", "job_title": "Assistant Product Manager in Washington, DC", "duration": "N/A", "pros": "Remote Small Company Nice Employees", "cons": "hard communications between different teams at time"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Stable, but monotonous", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Dec 2022", "job_title": "Product Manager in Washington, DC", "duration": "N/A", "pros": "Flexibility Fun retreats Stability CEO is really awesome", "cons": "Stuffiness A lot of leadership changes (not CEO)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to start out", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jul 2022", "job_title": "Senior Associate in Washington, DC", "duration": "N/A", "pros": "- good work/life balance\n- unique work with all healthcare stakeholders", "cons": "- small company\n- limited opportunities"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Na", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jul 2022", "job_title": "Product Manager in Washington, DC", "duration": "N/A", "pros": "Good company culture\nGood direction", "cons": "Sometimes it’s difficult to make progress"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Senior Business Analyst", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Nov 2017", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "\"It’s your ATTITUDE not your APTITUDE that determines your ALTITUDE\"\r\n\r\nI Joined CAQH as a Senior Business Analyst in 2017 and was hesitant if this company would be a right fit for me. Soon I realized that the company has a great work culture with a positive and vibrant environment. The leadership has great attitude with plenty of positivity and enthusiasm. The senior executives set the right stage and strategic direction to the company. The mistakes are treated as great opportunities for the company to succeed not allowing the blame culture to flourish.  This is where the right attitude makes a real impact on the culture.\r\n\r\nAs a Senior Business Analyst, I have the opportunity to do what I always wanted with proper accountability. The work is very creative and at the same time challenging.  People collaborate and help each other to succeed. The work is flexible and managers are very cooperative. The compensation and benefits are great! \r\nThe key to real success is an ability to adapt to changing environment.  There is always a constant effort from every individual to executive management to accelerate the business to the next stage of its journey in healthcare through collaboration and innovation!\r\n\r\nI feel honored and deeply committed to take part in CAQH’s transformation.", "cons": "None that I can think of"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Jan 2018", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Growing quickly and having an impact on healthcare industry\r\nGreat employees\r\nMission-focused\r\nExcellent benefits\r\nManagement values employees", "cons": "This is not so much of a \"con\" or disadvantage, but the organization is going through a culture change.  I have worked in several companies that experienced very rapid growth and change.  It can be challenging to incorporate new employees, new ideas, new methods, etc.  Employees with longer tenure may often have difficulty adapting to changes and it may take newer employees a while to adapt to the existing culture and fit in.  The best companies try to take the best of the old and new and position an organization to handle rapid growth and change.  In my opinion, the pros greatly outweigh the cons.  I am able to speak with my manager about anything at any time.  During these periods of change, open, honest communication is the key.  My advice to everyone is to address the issues head-on in a constructive way.  Speak with your manager.  If we can't communicate directly, it's impossible to move forward.  Change is necessary as companies grow.  It's important to participate and provide direct feedback and help to shape the culture you want to see at CAQH."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Work in Progress", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Feb 2016", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "-Tries extremely hard to value employees and be inclusive.\r\n-Small company allows people to have interactions with all levels within the organization.\r\n-Many internal processes, policies and functions are new and evolving as CAQH grows.  For people who like growth, change and variety....this is a great place.\r\n-Amazing benefits and work environment.\r\n-For people who can come in, take charge of your function, make a positive contribution and push CAQH forward in a constructive way, there are great possibilities for recognition and advancement.", "cons": "-CAQH is evolving from a small, mission-focused non-profit start-up to become a larger, well-run, effective, (still mission-focused) company that manages mission with operational excellence.  There have been bumps and it may not be for those who need complete structure and certainty at all times.\r\n-CAQH is working hard to fill many newly-created positions and move away from heavy reliance on external consultants.  Finding the right balance and managing the transition of knowledge is an evolution that is taking some time to complete.\r\n-There are some areas were managers are old-school and struggling to let go and adapt, so change has been uneven within CAQH."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Mission oriented organization at the heart of health administration", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Sept 2017", "job_title": "Senior Product Manager in Washington, DC", "duration": "N/A", "pros": "- The company values experience, so the team is composed of people across all functions with multiple years of experience in health care.\r\n- As such, you'll be working with a team that is ready to go, and ready to get the job done. If you're smart and ready to roll up your sleeves, this is the place.\r\n- Unparalleled access to thought leaders and decision makers in the industry. Each of the solution areas meets with early adopters and industry leading customers on a monthly basis - multiple times a year onsite. We truly collaborate with the industry to solve some of the most intractable administrative problems.\r\n- Innovative and entrepreneurial. Interesting adjectives for a not-for-profit? Perhaps. CAQH is the new model of mission-oriented organization. Other not-for-profits are gradually adopting some of CAQH's best practices.", "cons": "Minor growing pains as the market is demanding increasingly more from the organization. A good problem to have, and the team is rising to the occasion!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Transformed over the past four years into something great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Aug 2017", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "The organization has quadrupled in size since I came, and has brought in great talent in IT, business/finance, sales, govt affairs, marketing, customer service, HR, etc. Also  more reliance now on smart mid-level managers to provide leadership, instead of just a few people at the top. They can now compete with the big guys, and rely less on consultants. Good news is that they have managed to sustain a culture of cooperation and genuinely nice, helpful colleagues.  You will have all the responsibility you can handle, opportunities to present new ideas, and there are no slackers - come with your A game. Fun stuff like happy hours, birthday parties, company-wide events. Beautiful office.", "cons": "Mission-driven non-profit means no equity/stock for employees. But good salaries and benefits mostly make up for that. Too many meetings."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inclusive Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Sept 2018", "job_title": "Solutions in Washington, DC", "duration": "N/A", "pros": "Innovative, flexible, thought leader, inclusive", "cons": "Rapid growth, changing industry landscape"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company doing great things!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Nov 2014", "job_title": "Sales Manager in Washington, DC", "duration": "N/A", "pros": "The organizational culture is none I have ever experienced.  It's a \"think out-loud\" kind of company without the repercussions I have experienced in other organizations.  The office space is beautiful and people seem genuinely happy to be here. If you like thinking \"big\" about healthcare and how to transform the system, this could be the place for you.", "cons": "As with most \"thinking\" organizations, directions and priorities can shift rapidly.  If you are the type of person who like to feel \"rooted\" with your daily tasks, CAQH might not be for you."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst possible place to work in DC", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jul 2015", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Dedicated communications team, despite leadership and agency turnover.", "cons": "The US spends $361 billion annually on health care administration — more than twice its total spending on heart disease and three times the spending on cancer. According to the IOM, fully half of these expenditures are unnecessary. CAQH efforts are a drop in the bucket against this problem. Staff efforts are laudable, but there's no vision at the top, coupled with insane micromanagement by the ED. Changing IT platforms every couple of years won't make CAQH, its member plans, doctors and hospitals more efficient. It's just re-arranging deck chairs on the Titanic."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inside sales associate", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Mar 2019", "job_title": "Inside Sales in Washington, DC", "duration": "N/A", "pros": "Meaningful work, best and brightest staff. Amazing benefits!", "cons": "No cons at all a dream opportunity!"}]]