[[{"date": "3 Nov 2022", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Westwood College", "Interview Descriptions": "Professional and smooth process. Everyone was friendly and genuine. Office was clean and environment was engaging. Professional and smooth process. Everyone was friendly and genuine. Office was clean and environment was engaging.", "Interview Questions": "What are your career goals?"}, {"date": "21 Nov 2020", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Westwood College", "Interview Descriptions": "Submitted application online before getting called in for interview with one person, the hiring manager,  and then an additional interview with the entire team. Interview process was pretty straightforward with no curveballs.", "Interview Questions": "How do you do with metrics?"}, {"date": "11 Sept 2019", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westwood College in Jun 2015", "Interview Descriptions": "Advertising on social media for new hires. Taking the chosen one through and multiple step interviews. Understanding their motivations, background and education level. Phone interview, in person interview,  background check and drug test.", "Interview Questions": "Why did you choose Westwood as a company to work for?"}, {"date": "30 Mar 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Westwood College (Arlington, VA) in May 2015", "Interview Descriptions": "The interview process was fairly quick. I applied within the college it was a 1.1 interview with the head of the Finical aid office. The process from begin to end took only 2 hours,", "Interview Questions": "Tell me a little bit about yourself?"}, {"date": "8 Mar 2015", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Westwood College (Woodridge, IL) in Feb 2015", "Interview Descriptions": "I was run around the building to the registrar, campus president, and externship director.  All had the standard interview questions that you would expect.   All typed in a screen as I answered them and barely made eye contact.   They all were rushed and seem to just want to pass me along to the next person.\r\n\r\nThere were no students on campus at all, despite the fact that it was in the middle of a week day.  Hard to believe all of their students are night students.\r\n\r\ni asked some questions about Westwood in general and found out that no one that I had been talking to that day had been there for more than a year, except for the campus president.  Most were re-tread employees from other for-profit schools.   I was told there was a major \"house cleaning\" in the past year and that everyone that was now there was performing the responsibilities of several former employees.    It did not sound like that campus would be around much longer.\r\n\r\nI sent them all nice thank you note after the interviews, but never heard a word from them after that.", "Interview Questions": "How to improve their program? \r\n\r\nHow to attract high quality adjuncts, since they have no full time professors? "}, {"date": "1 Feb 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Westwood College (Chicago, IL) in Dec 2014", "Interview Descriptions": "I was called by the director of admissions for a telephone interview.  About 10 days later I had a face-to-face interview.  I was contacted three days later and received a job offer.", "Interview Questions": "What was my track record regarding meeting and exceeding metrics?"}, {"date": "7 Oct 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Westwood College in Sept 2014", "Interview Descriptions": "Applied online and received a phone call 2 weeks later.  Scheduled an interview that lasted about 45 minutes. The hiring manager was very kind and explained processes as thoroughly as possible.  No work-from-home option for the ID position which I found odd since most ID work can be done remotely.", "Interview Questions": "What would you do if the CEO or major stakeholders of the company wanted to roll out a new program that you knew would not be successful?  Would you tell them or keep it to yourself and go along with it anyway?"}, {"date": "2 Aug 2014", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westwood College", "Interview Descriptions": "called after submitting resume online, had brief interview, Director asked lots of questions about my previous employer. Very uncomfortable interview after 3 weeks received an email from their on boarding  office that I had not been selected for the position", "Interview Questions": "Was asked about information about my previous employer, very uncomfortable and unprofessional."}, {"date": "21 Mar 2014", "title": "Program Chair, Information Technology Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Westwood College (Chicago, IL)", "Interview Descriptions": "Initial interview: telephone with HR rep. \r\nA week later: an in person interview with \"Academic Dean\". \r\nA week later: an in person panel interview with 5 \"Program Chairs\".\r\nA week later: an in person interview with the \"Acting Campus President\".\r\nTwo weeks later: received an offer letter.\r\n\r\nAs far as the hiring and interviewing process goes: it was my impression that most Westwood people I met with did not know what to do in the interview situation. I often had to lead the interview progression during my time with them...amazing! It seems that Westwood employees do not understand the importance of the interview process...most didn't have questions to ask, nor were they prepared to answer questions.  In general, Westwood employees seemed preoccupied with something else, appeared uneasy, or perhaps their displeasure of working at Westwood came out, or even worse: felt guilty that I might be getting myself involved in the problem, like they are... \r\nThe \"Program Chairs\" gave me the impression that they were line employees rather than leaders of programs. Some of their displeasure about the \"leadership\" at Westwood leaked out during the panel interview. In addition, nobody really ever offered a real reason for me to come to work for Westwood College. They did offer many negatives like \"something's always broken here\" and \"we've never had good leadership in these programs\". My interview included a \"campus tour\" which was a brief walk around the floor. There were very few classes going on, and the area had a \"adult high school\" feel to it. At the end of the interview, they just kind of leave you at the elevator and press the \"down\" button without walking you to the door...", "Interview Questions": "No good questions. The toughest being \"use a word to describe yourself\""}, {"date": "4 Apr 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Westwood College (Washington, DC) in Mar 2014", "Interview Descriptions": "You will have to teach a mock-lesson. \r\nPrevious experience is a necessity.This will be very helpful because it shows that you have classroom management skills and have taught before.", "Interview Questions": "Do you have any previous experience in teaching at the college level?"}], [{"date": "7 Jan 2014", "title": "The Process Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Westwood College (Anaheim, CA)", "Interview Descriptions": "First interview was with the head of the department. Second interview was conducted as a panel interview with the entire department. Third was interviewing with eh campus President. Lastly was the presentation. The propose of the presentation was so that can see how I would do conducting presentations in class rooms.", "Interview Questions": "I would say the most difficult thing for me was that I had to do a presentation. even though I had done presentations before it has never been done for a job interview."}, {"date": "28 Jan 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Westwood College (Los Angeles, CA) in Jan 2014", "Interview Descriptions": "First step is a phone interview with the Hiring Director ( Director Of Admissions), then I was invited in for a one on one interview. If they like you, we will be sent an email to take an assessment. Then offer or interview with Regional.", "Interview Questions": "What would your wife and kids say about you. "}, {"date": "23 Jul 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Westwood College", "Interview Descriptions": "I was contacted by a recruited from Career Builder. He screened me initially and then forwarded my resume to the Director of Admissions. I had one quick phone screen and was invited in for an in-person interview. I came in two days letter, met the DA and knew that this was the type of position I was looking for. I needed to meet with the DA's boss but he lives across the country and wouldn't be back to this campus for a few weeks. So I scheduled another interview for the following week to come in and do a Skype interview with that manager. They offered me the job on the spot, I submitted my paperwork, and about 8 days later was my start date. \r\n\r\nSuper quick. Super easy. Very professional.", "Interview Questions": "Who was the worst manager you've ever had and what did you dislike about them?\r\n\r\nWho was the best manager you've ever had and what did you like about them?"}, {"date": "12 Oct 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Westwood College (Los Angeles, CA) in Jun 2013", "Interview Descriptions": "3 interviews including one with Director. It was nice to see the campus and meet various people in the office.  It was pretty positive.  The carpets could be cleaner and the walls could be cleaner too, but the staff was very nice.  I chose to work here because the Admissions staff seem experienced and genuine about helping students.", "Interview Questions": "How I would handle being on the phone a lot and how I would motivate students."}, {"date": "13 Feb 2013", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Westwood College in Feb 2013", "Interview Descriptions": "Initially I applied on the company website. One week later I received an e-mail asking for a phone interview. This was a standard screening interview where I was asked about my qualifications. We also spoke about the job itself. I passed and the following week was invited in for an in person interview. Three people interviewed me for 20 min. I was not impressed with the interview and we did not connect.  The questions appeared random and I felt I was not a serious candidate immediately.", "Interview Questions": "One interviewer asked to unrelated questions together. Something like: what manager do you work best under and tell me about a time you communicated effectively. Otherwise they were standard questions."}, {"date": "4 Dec 2012", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Westwood College (Denver, CO)", "Interview Descriptions": "Preliminary phone interview, face to face with director of admissions. Final interview with Vice President of Admissions", "Interview Questions": "Why would you leave your current company?"}, {"date": "21 Dec 2016", "title": "Copy & Print Center Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Westwood College (Atlanta, GA) in Nov 2012", "Interview Descriptions": "I heard that they needed a student to fill a part-time position in the print center, so I went to the hiring manager and asked for the position. He explained to me the hours and days that he needed to fill.", "Interview Questions": "Can we count on you?"}, {"date": "3 Aug 2012", "title": "General Employment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Westwood College (Chicago, IL) in Jun 2012", "Interview Descriptions": "First step is a 30 min phone interview with someone in HR.  Next, I interviewed with a panel of 4 people at the location the position was for.  I was difficult because some of the interviewers would jump in randomly and interrupt with a non related question.  The interviewer and would be future manager did not dress professionally.", "Interview Questions": "What excites you? "}, {"date": "29 Dec 2015", "title": "Student Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Westwood College (Los Angeles, CA) in Apr 2012", "Interview Descriptions": "I was not really interviewed. We were all moved around. All front desk and student services were put together to make one department. Everyone had to teach and train everyone. No one got pay raises just title changes. Some people did not like the change but they had no choice. We were all moved without being offered more money or even asked what our opinions were.", "Interview Questions": "N/A"}, {"date": "27 Aug 2012", "title": "Program Chair (Director) School of Healthcare Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Westwood College (Denver, CO) in Dec 2011", "Interview Descriptions": "Initially hired through the Westwood Online campus as a Career Service Advisor. Contacted by Dean of current campus offering this position. I had recently applied there for Career Services Director but was offered this position as soon as it became open. Overall about 4 interviews, one group, one with campus president, district manager Campus Dean.", "Interview Questions": "How to handle current employee that were also applying and what would be the best way to still work with employee if they had to work under you."}], [{"date": "26 May 2015", "title": "Customer Service Representative/Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Westwood College (Denver, CO) in Nov 2011", "Interview Descriptions": "It was a half hour in length. I was asked questions about my work experience. I was granted a second interview. I was asked about my interest in the job. I was offered the job.", "Interview Questions": "How many years I had in customer service jobs."}, {"date": "22 Nov 2011", "title": "Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Westwood College (Atlanta, GA) in Aug 2011", "Interview Descriptions": "I received a email Sunday evening for an Interview on Tuesday at 5:30 pm, when I arrived there was a panel of 8 plus about 15 other applicants in a board room. The Interview consisted of all of us applicants standing up one at a time answering questions and giving a presentation about ourselves.", "Interview Questions": "To give a speech about yourself in front a of broad audience. "}, {"date": "7 Oct 2014", "title": "Full-Time Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Westwood College in Jun 2011", "Interview Descriptions": "The process was rather quick, informal and friendly. I went from submission of my resume for the position to getting hired in 4 weeks (light speed!) You had to also present a brief 15 minute block of instruction in your core area.", "Interview Questions": "How do you deal with marginal (or below average students)"}, {"date": "12 Nov 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Westwood College (Denver, CO) in May 2011", "Interview Descriptions": "quick and easy - they were hiring people like crazy when I interviewed in 2009. Asked a bunch of questions to see what my motivation was and use it. Try to use incentives to wow me.", "Interview Questions": "Why do I want to work there"}, {"date": "24 Jun 2011", "title": "Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Westwood College (Chicago, IL) in May 2011", "Interview Descriptions": "I had a short telephone interview with a faculty member before I was invited to an interview on May 31st for a librarian position. The 3 + hour interview consisted of 3 one-on-one interviews, a panel interview, and a tour. I did not meet with any HR reps. While everyone I met with was interesting and polite, getting a response after the interview has been difficult. I was told a decision would be made within the week. When I didn't hear from anyone, I called and found out that they were still in the process of interviewing and it would be another week. That was over 2 weeks ago and I have not heard from anyone since. I have tried emailing and calling, but am being ignored. I feel that after such an intense interview process, not responding to an applicant is very unprofessional.", "Interview Questions": "What would you change about the library?"}, {"date": "19 May 2011", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Westwood College (Anaheim, CA) in Apr 2011", "Interview Descriptions": "I was interviewed by two people separately. Both individuals were quite unorganized and were not taking any notes or referencing my resume/application. They seemed as if they had already selected a candidate and were doing a courtesy interview. One manager went into great detail about the position and her love for working with students but when I spoke of my same passion and achievements she seemed uninterested. My best advice would be to express your passion and love for student over quantitative and measurable achievements.", "Interview Questions": "What do you know about nontraditional students?"}, {"date": "23 Sept 2013", "title": "Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Westwood College (Anaheim, CA) in Feb 2011", "Interview Descriptions": "Interview process was short, anyone could tell that the manager was pre-occupied with something else, not the interview.", "Interview Questions": "The unexpected question was a joke, the position was already offer to someone else, just wasted my time and energy. "}, {"date": "10 Oct 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Westwood College (Denver, CO) in Jul 2009", "Interview Descriptions": "Positions were opened so I dropped off my resume at the office where the hiring manager and HR dept were.  I then asked for and got the HR rep's name.  I called her 3 times in 2 weeks for an interview and they interviewed me.", "Interview Questions": "Not really anything out of the ordinary.  Admissions is sales.  Show you understand the sales process."}, {"date": "6 Apr 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Westwood College (Annandale, VA) in May 2009", "Interview Descriptions": "I submitted a resume and cover letter. I met with the program chair for an in person interview. I returned for a 30 minute teaching demonstration which I performed for faculty and staff in my teaching area. I chose the topic. Faculty acted as \"students\" with questions and typical interruptions. This was four years ago, and I understand the process is now very different.", "Interview Questions": "Salary requirements"}, {"date": "21 Aug 2012", "title": "Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Westwood College (Denver, CO) in May 2009", "Interview Descriptions": "I interviewed with seven people in one day. The interview was way too long and by the 7th person, I was completely sick of being asked the same questions, by every person. Getting my expenses reimbursed was a ridiculous process and it took the excellent work of an executive assistant to finally get my money back.", "Interview Questions": "None."}], [{"date": "13 Dec 2012", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Westwood College (Denver, CO) in Jan 2009", "Interview Descriptions": "Fast process, had to do a mock teaching session for staff.  Quick offer and fast start but very little in te way of on boarding.", "Interview Questions": "N/A"}, {"date": "15 Jul 2011", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Westwood College (Anaheim, CA) in Jan 2009", "Interview Descriptions": "The first step is over the phone. They ask you about your experience.   Your work style and drive for the position.  After phone interview you speak to Regional manager and from there we meet in person!\r\n\r\nThey drill you on what you can bring to the team and why?  My perception of the people they are uptight and not that excited about students just keeping a job!", "Interview Questions": "How do you handle rejection?"}, {"date": "28 Jun 2010", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Westwood College (Denver, CO) in Mar 2008", "Interview Descriptions": "First you will have a face to face interview with the director of admissions \r\nMormally asking you questions about your sales positions in the past and why you would be a good fit \r\nPhone Interview with VP \r\nAnd last interview offering you the job", "Interview Questions": "how do you sell a pen?? Or sell this pen to me?"}]][[{"date": "3 Nov 2022", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Westwood College", "Interview Descriptions": "Professional and smooth process. Everyone was friendly and genuine. Office was clean and environment was engaging. Professional and smooth process. Everyone was friendly and genuine. Office was clean and environment was engaging.", "Interview Questions": "What are your career goals?"}, {"date": "21 Nov 2020", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Westwood College", "Interview Descriptions": "Submitted application online before getting called in for interview with one person, the hiring manager,  and then an additional interview with the entire team. Interview process was pretty straightforward with no curveballs.", "Interview Questions": "How do you do with metrics?"}, {"date": "11 Sept 2019", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westwood College in Jun 2015", "Interview Descriptions": "Advertising on social media for new hires. Taking the chosen one through and multiple step interviews. Understanding their motivations, background and education level. Phone interview, in person interview,  background check and drug test.", "Interview Questions": "Why did you choose Westwood as a company to work for?"}, {"date": "30 Mar 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Westwood College (Arlington, VA) in May 2015", "Interview Descriptions": "The interview process was fairly quick. I applied within the college it was a 1.1 interview with the head of the Finical aid office. The process from begin to end took only 2 hours,", "Interview Questions": "Tell me a little bit about yourself?"}, {"date": "8 Mar 2015", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Westwood College (Woodridge, IL) in Feb 2015", "Interview Descriptions": "I was run around the building to the registrar, campus president, and externship director.  All had the standard interview questions that you would expect.   All typed in a screen as I answered them and barely made eye contact.   They all were rushed and seem to just want to pass me along to the next person.\r\n\r\nThere were no students on campus at all, despite the fact that it was in the middle of a week day.  Hard to believe all of their students are night students.\r\n\r\ni asked some questions about Westwood in general and found out that no one that I had been talking to that day had been there for more than a year, except for the campus president.  Most were re-tread employees from other for-profit schools.   I was told there was a major \"house cleaning\" in the past year and that everyone that was now there was performing the responsibilities of several former employees.    It did not sound like that campus would be around much longer.\r\n\r\nI sent them all nice thank you note after the interviews, but never heard a word from them after that.", "Interview Questions": "How to improve their program? \r\n\r\nHow to attract high quality adjuncts, since they have no full time professors? "}, {"date": "1 Feb 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Westwood College (Chicago, IL) in Dec 2014", "Interview Descriptions": "I was called by the director of admissions for a telephone interview.  About 10 days later I had a face-to-face interview.  I was contacted three days later and received a job offer.", "Interview Questions": "What was my track record regarding meeting and exceeding metrics?"}, {"date": "7 Oct 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Westwood College in Sept 2014", "Interview Descriptions": "Applied online and received a phone call 2 weeks later.  Scheduled an interview that lasted about 45 minutes. The hiring manager was very kind and explained processes as thoroughly as possible.  No work-from-home option for the ID position which I found odd since most ID work can be done remotely.", "Interview Questions": "What would you do if the CEO or major stakeholders of the company wanted to roll out a new program that you knew would not be successful?  Would you tell them or keep it to yourself and go along with it anyway?"}, {"date": "2 Aug 2014", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Westwood College", "Interview Descriptions": "called after submitting resume online, had brief interview, Director asked lots of questions about my previous employer. Very uncomfortable interview after 3 weeks received an email from their on boarding  office that I had not been selected for the position", "Interview Questions": "Was asked about information about my previous employer, very uncomfortable and unprofessional."}, {"date": "21 Mar 2014", "title": "Program Chair, Information Technology Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Westwood College (Chicago, IL)", "Interview Descriptions": "Initial interview: telephone with HR rep. \r\nA week later: an in person interview with \"Academic Dean\". \r\nA week later: an in person panel interview with 5 \"Program Chairs\".\r\nA week later: an in person interview with the \"Acting Campus President\".\r\nTwo weeks later: received an offer letter.\r\n\r\nAs far as the hiring and interviewing process goes: it was my impression that most Westwood people I met with did not know what to do in the interview situation. I often had to lead the interview progression during my time with them...amazing! It seems that Westwood employees do not understand the importance of the interview process...most didn't have questions to ask, nor were they prepared to answer questions.  In general, Westwood employees seemed preoccupied with something else, appeared uneasy, or perhaps their displeasure of working at Westwood came out, or even worse: felt guilty that I might be getting myself involved in the problem, like they are... \r\nThe \"Program Chairs\" gave me the impression that they were line employees rather than leaders of programs. Some of their displeasure about the \"leadership\" at Westwood leaked out during the panel interview. In addition, nobody really ever offered a real reason for me to come to work for Westwood College. They did offer many negatives like \"something's always broken here\" and \"we've never had good leadership in these programs\". My interview included a \"campus tour\" which was a brief walk around the floor. There were very few classes going on, and the area had a \"adult high school\" feel to it. At the end of the interview, they just kind of leave you at the elevator and press the \"down\" button without walking you to the door...", "Interview Questions": "No good questions. The toughest being \"use a word to describe yourself\""}, {"date": "4 Apr 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Westwood College (Washington, DC) in Mar 2014", "Interview Descriptions": "You will have to teach a mock-lesson. \r\nPrevious experience is a necessity.This will be very helpful because it shows that you have classroom management skills and have taught before.", "Interview Questions": "Do you have any previous experience in teaching at the college level?"}], [{"date": "7 Jan 2014", "title": "The Process Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Westwood College (Anaheim, CA)", "Interview Descriptions": "First interview was with the head of the department. Second interview was conducted as a panel interview with the entire department. Third was interviewing with eh campus President. Lastly was the presentation. The propose of the presentation was so that can see how I would do conducting presentations in class rooms.", "Interview Questions": "I would say the most difficult thing for me was that I had to do a presentation. even though I had done presentations before it has never been done for a job interview."}, {"date": "28 Jan 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Westwood College (Los Angeles, CA) in Jan 2014", "Interview Descriptions": "First step is a phone interview with the Hiring Director ( Director Of Admissions), then I was invited in for a one on one interview. If they like you, we will be sent an email to take an assessment. Then offer or interview with Regional.", "Interview Questions": "What would your wife and kids say about you. "}, {"date": "23 Jul 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Westwood College", "Interview Descriptions": "I was contacted by a recruited from Career Builder. He screened me initially and then forwarded my resume to the Director of Admissions. I had one quick phone screen and was invited in for an in-person interview. I came in two days letter, met the DA and knew that this was the type of position I was looking for. I needed to meet with the DA's boss but he lives across the country and wouldn't be back to this campus for a few weeks. So I scheduled another interview for the following week to come in and do a Skype interview with that manager. They offered me the job on the spot, I submitted my paperwork, and about 8 days later was my start date. \r\n\r\nSuper quick. Super easy. Very professional.", "Interview Questions": "Who was the worst manager you've ever had and what did you dislike about them?\r\n\r\nWho was the best manager you've ever had and what did you like about them?"}, {"date": "12 Oct 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Westwood College (Los Angeles, CA) in Jun 2013", "Interview Descriptions": "3 interviews including one with Director. It was nice to see the campus and meet various people in the office.  It was pretty positive.  The carpets could be cleaner and the walls could be cleaner too, but the staff was very nice.  I chose to work here because the Admissions staff seem experienced and genuine about helping students.", "Interview Questions": "How I would handle being on the phone a lot and how I would motivate students."}, {"date": "13 Feb 2013", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Westwood College in Feb 2013", "Interview Descriptions": "Initially I applied on the company website. One week later I received an e-mail asking for a phone interview. This was a standard screening interview where I was asked about my qualifications. We also spoke about the job itself. I passed and the following week was invited in for an in person interview. Three people interviewed me for 20 min. I was not impressed with the interview and we did not connect.  The questions appeared random and I felt I was not a serious candidate immediately.", "Interview Questions": "One interviewer asked to unrelated questions together. Something like: what manager do you work best under and tell me about a time you communicated effectively. Otherwise they were standard questions."}, {"date": "4 Dec 2012", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Westwood College (Denver, CO)", "Interview Descriptions": "Preliminary phone interview, face to face with director of admissions. Final interview with Vice President of Admissions", "Interview Questions": "Why would you leave your current company?"}, {"date": "21 Dec 2016", "title": "Copy & Print Center Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Westwood College (Atlanta, GA) in Nov 2012", "Interview Descriptions": "I heard that they needed a student to fill a part-time position in the print center, so I went to the hiring manager and asked for the position. He explained to me the hours and days that he needed to fill.", "Interview Questions": "Can we count on you?"}, {"date": "3 Aug 2012", "title": "General Employment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Westwood College (Chicago, IL) in Jun 2012", "Interview Descriptions": "First step is a 30 min phone interview with someone in HR.  Next, I interviewed with a panel of 4 people at the location the position was for.  I was difficult because some of the interviewers would jump in randomly and interrupt with a non related question.  The interviewer and would be future manager did not dress professionally.", "Interview Questions": "What excites you? "}, {"date": "29 Dec 2015", "title": "Student Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Westwood College (Los Angeles, CA) in Apr 2012", "Interview Descriptions": "I was not really interviewed. We were all moved around. All front desk and student services were put together to make one department. Everyone had to teach and train everyone. No one got pay raises just title changes. Some people did not like the change but they had no choice. We were all moved without being offered more money or even asked what our opinions were.", "Interview Questions": "N/A"}, {"date": "27 Aug 2012", "title": "Program Chair (Director) School of Healthcare Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Westwood College (Denver, CO) in Dec 2011", "Interview Descriptions": "Initially hired through the Westwood Online campus as a Career Service Advisor. Contacted by Dean of current campus offering this position. I had recently applied there for Career Services Director but was offered this position as soon as it became open. Overall about 4 interviews, one group, one with campus president, district manager Campus Dean.", "Interview Questions": "How to handle current employee that were also applying and what would be the best way to still work with employee if they had to work under you."}], [{"date": "26 May 2015", "title": "Customer Service Representative/Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Westwood College (Denver, CO) in Nov 2011", "Interview Descriptions": "It was a half hour in length. I was asked questions about my work experience. I was granted a second interview. I was asked about my interest in the job. I was offered the job.", "Interview Questions": "How many years I had in customer service jobs."}, {"date": "22 Nov 2011", "title": "Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Westwood College (Atlanta, GA) in Aug 2011", "Interview Descriptions": "I received a email Sunday evening for an Interview on Tuesday at 5:30 pm, when I arrived there was a panel of 8 plus about 15 other applicants in a board room. The Interview consisted of all of us applicants standing up one at a time answering questions and giving a presentation about ourselves.", "Interview Questions": "To give a speech about yourself in front a of broad audience. "}, {"date": "7 Oct 2014", "title": "Full-Time Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Westwood College in Jun 2011", "Interview Descriptions": "The process was rather quick, informal and friendly. I went from submission of my resume for the position to getting hired in 4 weeks (light speed!) You had to also present a brief 15 minute block of instruction in your core area.", "Interview Questions": "How do you deal with marginal (or below average students)"}, {"date": "12 Nov 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Westwood College (Denver, CO) in May 2011", "Interview Descriptions": "quick and easy - they were hiring people like crazy when I interviewed in 2009. Asked a bunch of questions to see what my motivation was and use it. Try to use incentives to wow me.", "Interview Questions": "Why do I want to work there"}, {"date": "24 Jun 2011", "title": "Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Westwood College (Chicago, IL) in May 2011", "Interview Descriptions": "I had a short telephone interview with a faculty member before I was invited to an interview on May 31st for a librarian position. The 3 + hour interview consisted of 3 one-on-one interviews, a panel interview, and a tour. I did not meet with any HR reps. While everyone I met with was interesting and polite, getting a response after the interview has been difficult. I was told a decision would be made within the week. When I didn't hear from anyone, I called and found out that they were still in the process of interviewing and it would be another week. That was over 2 weeks ago and I have not heard from anyone since. I have tried emailing and calling, but am being ignored. I feel that after such an intense interview process, not responding to an applicant is very unprofessional.", "Interview Questions": "What would you change about the library?"}, {"date": "19 May 2011", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Westwood College (Anaheim, CA) in Apr 2011", "Interview Descriptions": "I was interviewed by two people separately. Both individuals were quite unorganized and were not taking any notes or referencing my resume/application. They seemed as if they had already selected a candidate and were doing a courtesy interview. One manager went into great detail about the position and her love for working with students but when I spoke of my same passion and achievements she seemed uninterested. My best advice would be to express your passion and love for student over quantitative and measurable achievements.", "Interview Questions": "What do you know about nontraditional students?"}, {"date": "23 Sept 2013", "title": "Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Westwood College (Anaheim, CA) in Feb 2011", "Interview Descriptions": "Interview process was short, anyone could tell that the manager was pre-occupied with something else, not the interview.", "Interview Questions": "The unexpected question was a joke, the position was already offer to someone else, just wasted my time and energy. "}, {"date": "10 Oct 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Westwood College (Denver, CO) in Jul 2009", "Interview Descriptions": "Positions were opened so I dropped off my resume at the office where the hiring manager and HR dept were.  I then asked for and got the HR rep's name.  I called her 3 times in 2 weeks for an interview and they interviewed me.", "Interview Questions": "Not really anything out of the ordinary.  Admissions is sales.  Show you understand the sales process."}, {"date": "6 Apr 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Westwood College (Annandale, VA) in May 2009", "Interview Descriptions": "I submitted a resume and cover letter. I met with the program chair for an in person interview. I returned for a 30 minute teaching demonstration which I performed for faculty and staff in my teaching area. I chose the topic. Faculty acted as \"students\" with questions and typical interruptions. This was four years ago, and I understand the process is now very different.", "Interview Questions": "Salary requirements"}, {"date": "21 Aug 2012", "title": "Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Westwood College (Denver, CO) in May 2009", "Interview Descriptions": "I interviewed with seven people in one day. The interview was way too long and by the 7th person, I was completely sick of being asked the same questions, by every person. Getting my expenses reimbursed was a ridiculous process and it took the excellent work of an executive assistant to finally get my money back.", "Interview Questions": "None."}], [{"date": "13 Dec 2012", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Westwood College (Denver, CO) in Jan 2009", "Interview Descriptions": "Fast process, had to do a mock teaching session for staff.  Quick offer and fast start but very little in te way of on boarding.", "Interview Questions": "N/A"}, {"date": "15 Jul 2011", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Westwood College (Anaheim, CA) in Jan 2009", "Interview Descriptions": "The first step is over the phone. They ask you about your experience.   Your work style and drive for the position.  After phone interview you speak to Regional manager and from there we meet in person!\r\n\r\nThey drill you on what you can bring to the team and why?  My perception of the people they are uptight and not that excited about students just keeping a job!", "Interview Questions": "How do you handle rejection?"}, {"date": "28 Jun 2010", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Westwood College (Denver, CO) in Mar 2008", "Interview Descriptions": "First you will have a face to face interview with the director of admissions \r\nMormally asking you questions about your sales positions in the past and why you would be a good fit \r\nPhone Interview with VP \r\nAnd last interview offering you the job", "Interview Questions": "how do you sell a pen?? Or sell this pen to me?"}]]