[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work & make a difference!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Apr 2023", "job_title": "Medical Practice Manager in Rockford, IL", "duration": "N/A", "pros": "I have been with Rosecrance for over five years and have been afforded excellent opportunities for growth. I feel that my hard work & work ethic is acknowledged and appreciated. I feel empowered to bring about positive change and this is such an important thing. Each supervisor I’ve reported to over the past several years has consistently taken the time to acknowledge the value I bring to the company and respects my thoughts and opinions. As a Registered Nurse, I feel supported as a member of the nursing team and Rosecrance does a great job of consistently working to improve working conditions and work-life balance for nursing staff. Even on my most challenging days, I’m left feeling certain that I have made a difference for others that day, whether that be for our clients or my peers. I am so proud of the work Rosecrance does and feel blessed to be a part of it.", "cons": "The field of behavioral health is a challenging field, made even more so by the impact of Covid. It can be emotionally draining at times, as it’s impossible to not be affected by some of our client’s struggles with their mental illness or addiction. This is not unique to Rosecrance though."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "No communication", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jul 2023", "job_title": "Recreation Therapy in Champaign, IL", "duration": "N/A", "pros": "I love how rewarding the job is", "cons": "No one communicates at all"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Stepping Stone Job", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "28 May 2023", "job_title": "Case Manager in Rockford, IL", "duration": "N/A", "pros": "Rosecrance strengthened my spine and gave me the opportunity to work on standing up for myself and the program I worked in. The clients are what kept me working there for so long. I wanted to quit for years but the question of who will take care of them when I’m gone always remained in my mind. I developed a thicker skin and resiliency while working here.", "cons": "Where to even begin… - The productivity expectations are incredibly unreasonable. It’s never taken into consideration when you are out sick, are given supervisory responsibilities, and have no one to put on the schedule. I understood the reason for productivity but there was always such a focus on the numbers and never a focus on what can be done to improve the numbers. There was never a solution focused conversation; you’re just told to be better. - There are no opportunities for work/life balance. You will be asked to give your life to Rosecrance. If you’re burned out? No one cares. You’ll ask for help and you’ll never get it. Administration and HR will literally laugh in your face when you bring concerns to them. There’s always conversations and training on “self care” but you never have the opportunity to use PTO to actually work on self care. If you do, you’ll get in trouble for not reaching your productivity standard. The pay out was nice when I left due to having so many hours of unusable PTO. - The turnover might very well be the highest I’ve ever seen before. - There’s never any real problem solving going on. There will be meetings to talk about the problems but that’s where it ends. There’s never any follow through or actions to address the issues."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Absolutely not", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Dec 2022", "job_title": "SA Counselor in McHenry, IL", "duration": "N/A", "pros": "Positive experience with coworkers, that’s about it.", "cons": "- minimal pay with either no raises or 2 cent raise - demanding on call schedule. it was not listed within my job description that I would be on call, as I wouldn’t have accepted a position with that responsibility. As a student who was also working full time, I was being woken up several times throughout the night. - poor communication with management. I was managed remotely by my supervisor from a different location, and I was more or less out of the loop on anything and everything. - asking for help or clarification was out of the question - after inquiring about a program at a facility I didn’t work at, I was informed to “manage my own case” by a higher up. - favoritism among higher ups and HR regarding who could work remotely for what reason. I was informed WFH was temporary only for those with FMLA or other illness related issues. However, several people I knew worked from home indefinitely. When my car broke down, I was forced to come into the office and more or less threatened with being written up."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Honest job review", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Mar 2023", "job_title": "Anonymous Employee in Crystal Lake, IL", "duration": "N/A", "pros": "Rosecrance offers fair pay to their employees. Plenty of PTO.", "cons": "Terrible leadership team. There were many inappropriate male staff and their actions seemed to be encouraged instead of reprimanded. Higher management held everyone to an unrealistic standard. It’s unfair that some staff were allowed to work from home but others were required to go in no matter the circumstance. Staff came and went as they pleased as long as they were liked by management. It was impossible to reach the director the majority of the time. There was no regard for staffs safety. People would be threatened and it was not taken seriously until the director felt like they were being threatened. Holidays are not given off, you must use your own PTO to be off even if the office is closed. This isn’t mentioned during the interview process nor orientation. It’s a revolving door."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Opportunity for Growth", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Mar 2023", "job_title": "Director in Rockford, IL", "duration": "N/A", "pros": "Compensation, ongoing education, career path, promotes within, willing to look at all sides of issues in order to resolve them, continuing to evolve and grow.", "cons": "Some processes not in place, which might be expected to be of an organization with a robust history. Staff and management are proactively working on defining, refining, and improving processes as the organization continues to grow."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Okay place to start if you like consistent stress", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Feb 2023", "job_title": "Mental Health Clinician in McHenry, IL", "duration": "N/A", "pros": "Pay is okay for nonprofit. Telehealth is allowed.", "cons": "Hours, pay does not match the amount of work, human resources is completely separate from Rosecrance Health making employees feel neglected and disengaged, most management is disconnected from the mental health piece and makes productivity top priority while encouraging and enforcing numbers of clients to be therapists’ main goal over advocacy and compassion for clients. Clinical supervision is limited, it took almost a year to start supervision. Benefits suck. You are required to use your pto for holidays, which they omit from the interview. Healthcare packages are not that great and do not offer HMO."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good place to gain experience!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Feb 2023", "job_title": "Recovery Specialist in Chicago, IL", "duration": "N/A", "pros": "Really great place to gain experience in the fields of psychology/social work. Freedom to create programming and contribute ideas. Lots of interaction with terrific clients. Responding to relapses and mental health crises is challenging but you learn a lot. Fun to work as a team! Positive upbeat environment.", "cons": "Treatment focuses too narrowly on surface level cognitive behavioral approaches, so too many clients relapse and die. This place is part of a larger societal treatment system that in many ways does not help clients and families address the root cause—the emotional pain, childhood trauma, and dysfunctional family patterns underlying clients’ addictive behavior."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poor management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 Mar 2023", "job_title": "Team Lead in Rockford, IL", "duration": "N/A", "pros": "Coworkers and clients are great!", "cons": "Upper management has no idea how to be leaders. They are not supportive and the company proved time and time again that they don’t care about their employees"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Great Mission", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Feb 2023", "job_title": "Nurse Practitioner in Rockford, IL", "duration": "N/A", "pros": "Help with addiction and mental illness. Non-discriminatory. Great employees", "cons": "The pay scale is too low and the workload is very busy."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Not a good company-only cares about bottom line-$", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jan 2023", "job_title": "Recovery Specialist in Chicago, IL", "duration": "N/A", "pros": "-Experience -Nice office/facility -Great trainings -Decent pay -Benefits are okay", "cons": "-Management/HR not great -Co-workers-bullying -Favoritism -Expect you to take clients to places -Clients can treat you however they feel like"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DO NOT WORK HERE!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "23 Feb 2023", "job_title": "Primary Counselor in Rockford, IL", "duration": "N/A", "pros": "Helped me to develop resiliency", "cons": "Poor management, lack of professionalism, no support and low pay"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Don't waste your time", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Feb 2023", "job_title": "Counselor in Champaign, IL", "duration": "N/A", "pros": "The clients and population you work with.", "cons": "Management, HR, pay increase, communication, training, supervisors"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Uncertain Job", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Dec 2022", "job_title": "Therapist in McHenry, IL", "duration": "N/A", "pros": "My coworkers were amazing and supportive.", "cons": "Difficult work environment with overly high expectations."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not for me", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Sept 2022", "job_title": "MH Clinician-SASS in McHenry, IL", "duration": "N/A", "pros": "I was able to familiarize myself with the area as it is a community based job.", "cons": "Poor management style. I had 2 supervisors that communicated poorly with one another. I was micromanaged into a state of depression and quit so keep my mental health intact."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Rosecrance KILLED everything good about Jackson Recovery", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Aug 2022", "job_title": "Medical Billing Specialist in Sioux City, IA", "duration": "N/A", "pros": "I worked in the billing department from 2016 through End of 2019. While the pay was never very good, I was hired when Iowa Medicaid outsourced to 3 major insurance companies. Claims were rejected and unpaid for years. They did away with End of Year Bonuses that year, and they never returned. My promised pay increase after 90 days was not honored, nor did I EVER receive more than a standard 3% pay increase (nothing for first 2 years). Bachelor degree, student loans, and making $15 an hour with no cost of living adjustments, and rising benefit premiums… it was not sustainable to make so little, while everything gets more expensive. \n\nHaving said that- I really loved working for Jackson Recovery prior to the Rosecrance merger. I loved my job, and I took pride in it. I made a lot of personal sacrifices to stay, hoping to merit a large raise, and move into management. That all went away by June of 2019 with the merger.", "cons": "Really Bad Pay!!\nNo Student Loan repayment Program\nLong difficult hours, no flexibility, terrible management\nWhere did all the Bullies come from! \n\nRosecrance was promoted as being a great opportunity for current employees. It became clear very quickly that the patients didn’t matter, just the bills Lea. My job description no longer fulfilled me. I was a glorified data entry clerk, no longer using my skills and in any way. Any hope for advancement disappeared immediately, as did any opportunity to stand out. \n\nGossip and bullying became prevalent among all staff, as did back stabbing. The culture became TOXIC, and anyone of value quickly left for greener pastures . Mandatory “fun” paid for by employees ($5.00 is a lot to ask when you pay skilled educated employees less than entry level production workers) was a laughable attempt to promote team building. \nEmployee programs that existed to help employees in times of hardship (death of immediate family member) were quickly erased. Everything that made Jackson stand out as a caring employer vanished. \n2.5 years later, I make almost double what They paid, have fun and kind coworkers, and am much happier than I was at Rosecranse. It’s sad really how bad things have gotten. Rosecrance poisons every company they take over."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "High Stress", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Oct 2022", "job_title": "MH Clinician in McHenry, IL", "duration": "N/A", "pros": "There are a lot of opportunities to learn here.", "cons": "Higher ups need to listen to staff more."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great coworkers and job experience, poor upper management", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 May 2022", "job_title": "Case Manager in Champaign, IL", "duration": "N/A", "pros": "Great, passionate and competent coworkers, okay starting pay, great on-the-job experience", "cons": "-Upper management is greedy and only cares about maximizing billing\r\n-Upper management is out of touch with actual employee needs\r\n-Using PTO is pretty much a lose-lose because you put yourself behind schedule and have to make up the work when you go back in, upper management does not adjust for PTO when counting your billable hours.\r\n-Work-life balance is difficult but manageable if you're passionate about the job"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Lacks compensation", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Sept 2022", "job_title": "Access Specialist in Rockford, IL", "duration": "N/A", "pros": "Supportive coworkers . . .", "cons": "Low pay/ minimum raises\nburnout of current staff due to large amount of stars quitting"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Rosecrance is Incredible", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Feb 2022", "job_title": "Marketing Assistant in America, IL", "duration": "N/A", "pros": "Rosecrance is by far the best place I've ever worked. Everyone is extremely kind and welcoming; the CEO, Dr. Gomel, is super involved and down to earth; the mission is impactful; and it's one of those rare companies where it's obvious just how much people care. There are so many opportunities for inclusivity, diversity, and learning, which go to show how genuine this organization is. Suggestions for change are always listened to and even encouraged by the executives. This is a company where you feel you are actually making a difference.", "cons": "If you are not on the clinical side of Rosecrance, opportunities for growth are a bit hard to come by. Also, Rosecrance is a not-for-profit organization, so salaries are not outstanding."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Only a stepping stone job, not a career", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Jun 2021", "job_title": "Nurse in Rockford, IL", "duration": "N/A", "pros": "The people who work there are great and passionate.\r\nLower level management is pretty personable.\r\nCan be a rewarding job.\r\nHas several “employees appreciation “ events, walks and cookouts.", "cons": "HR does not appreciate longevity and seniority is not a term used there. The company almost discouraged more than 5-7 years experience with them. After that, the only benefit you have over a new person is your merrit increases, but they find a way to erase them too (such as “across the board raises” that exclude employees who have been there longer - they will say they are happy with what they are already paying you), thus, giving you a pay decrease and punishing you for working there longer than others. This causes the company to be severely understaffed, sometimes having to close units or buildings in order to keep running. In turn, that leaves the people who stay with them more stressed and working harder while earning less and less when faced with inflation. Then more people quit and it becomes a viscous cycle.\r\nCan also be a very emotionally taxing job also."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "JOIN THE TEAM OF MISERABLE PEOPLE!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jun 2022", "job_title": "CD Counselor in Sioux City, IA", "duration": "N/A", "pros": "Patients are worth it.But all are court ordered.", "cons": "Too much, with too little time.Numbers are more important than care."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": "N/A", "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Unreasonable expectations", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 May 2022", "job_title": "Registered Nurse in Rockford, IL", "duration": "N/A", "pros": "Great teamwork and collaboration. Staff truly care about patients", "cons": "The workload is dangerous for staff and patients. They understaff on purpose which causes high burnout and turn over"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Work place culture", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "19 May 2022", "job_title": "Unit Technician in Rockford, IL", "duration": "N/A", "pros": "The night supervisor is nice.", "cons": "Most of the people who work there day in and day out are doing the bare minimum. Work place culture is weak."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Complete trash", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Jun 2022", "job_title": "Therapist in McHenry, IL", "duration": "N/A", "pros": "Absolutely nothing at all! Sorry", "cons": "Complete Trash. They treat you like trash, walk on you like trash and if you don't hit production you will be thrown away like trash. \r\nVery trashy place."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Money not clients", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Dec 2021", "job_title": "Counselor in Champaign, IL", "duration": "N/A", "pros": "I had an amazing supervisor and awesome coworkers", "cons": "Low pay for large amount of work. Not caring for employees mental and physical health. Paying people different wages for the same job. Extremely low pay for comparable jobs. Focused more on how much money they could make by taking on as many clients as they can and forcing group work as they make more money on groups than individual sessions."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Rosecrance Ware Center", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2022", "job_title": "Medical Assistant in Machesney Park, IL", "duration": "N/A", "pros": "Good people. Great bosses, great hours, fair pay", "cons": "Away from taking son to and from school,"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor management support, unprofessional, and somewhat unethical", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 May 2022", "job_title": "Unit Specialist in Champaign, IL", "duration": "N/A", "pros": "Coworkers, clients, decent pay, PTO", "cons": "Management, lack of transparency, overworked, lack of support, role confusion"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Culture Shift And Team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Oct 2021", "job_title": "Software Developer in Rockford, IL", "duration": "N/A", "pros": "I am finally on a team where everyone's role helps complete the common goal and everyone works together as a team to support each other's individual goals.\nThe management team has done an excellent job in reinvesting in staff!", "cons": "Sometimes making sure everyone that needs to be communicating during a project from all of the different business areas allows details to be overlooked. Thankfully, management is working on how to increase communication across the different teams!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Dec 2021", "job_title": "SAP Counselor in Chicago, IL", "duration": "N/A", "pros": "Team, trainings, time off, ability of overtime.", "cons": "Salary increases, lack of advancement"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Don't do it", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Oct 2021", "job_title": "Primary Counselor%2C Substance Abuse in Rockford, IL", "duration": "N/A", "pros": "Co-workers , starter job for college graduates", "cons": "Dangerously understaffed, poor pay for the amount of work, constant turnover at every level"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Fair", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Nov 2021", "job_title": "Administrative Assistant in Chicago, IL", "duration": "N/A", "pros": "There is a sense of community", "cons": "Health insurance benefits could be better"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "depends what department", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Aug 2021", "job_title": "Anonymous Employee in Rockford, IL", "duration": "N/A", "pros": "hard to think of anything. really dont seem to care about employees. below industry standards but its a paycheck", "cons": "lot of turnover with high level leadership positions, management is unstable. everything changes for the worse once youre hired. pretty grim place"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good temporary first job", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Oct 2021", "job_title": "Case Worker in Rockford, IL", "duration": "N/A", "pros": "Clients are great. Good benefits", "cons": "Leadership. Not paid properly for overtime"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great team", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Jun 2021", "job_title": "Access Counselor in Crystal Lake, IL", "duration": "N/A", "pros": "Great place to learn. Good co workers. Clients are challenging but rewarding. Direct supervisors do the best they can to support frontline staff.", "cons": "Employees are expendable. Productivity is more important than morale. Turnover is high. Training is poor. Overall, the company is unwilling demonstrate how they value long term, licensed employees."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "DON'T WORK THERE!!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Oct 2021", "job_title": "Human Resources Assistant in Rockford, IL", "duration": "N/A", "pros": "Nothing! If you have kids, they don't care about family!", "cons": "This place promotes mental health care but employees are made to put the company first. Just stay away! They work you to death then disregard you!!!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Recovery specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "20 Aug 2021", "job_title": "Recovery Specialist in McHenry, IL", "duration": "N/A", "pros": "It is a good place to work", "cons": "It has good opportunities within"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Absolutely horrible", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Nov 2021", "job_title": "Unit Specialist in Rockford, IL", "duration": "N/A", "pros": "Free meals and decent insurance", "cons": "Understaffed, underpayed, high work load."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Works if you work it", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Sept 2021", "job_title": "Recovery Specialist in Champaign, IL", "duration": "N/A", "pros": "Collegial atmosphere with experienced team", "cons": "Understaffed and stays that way"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Sept 2021", "job_title": "SASS Therapist in Rockford, IL", "duration": "N/A", "pros": "Working with the children was such a rewarding experience.", "cons": "Low pay compared to workload. No work/life balance. Transphobic/homophobic company. Unethical practices and will do anything to make a dollar."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Undervalued, Overworked", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 May 2021", "job_title": "Administrative Assistant in Rockford, IL", "duration": "N/A", "pros": "you learn a lot about the mental health industry and network with a lot of key players", "cons": "stressful as management has unrealistic expectations for lower staff and does not have much knowledge to help out with problems when they arise. undervalued and over worked."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "21 May 2021", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "Hire great coworkers, good benefits", "cons": "Terrible leadership, terrible pay, high workload, high expectations. Toxic culture - higher management will talk about employees. They lost their mission years ago. They bring in new management to sweep out staff and ignore when said management gets arrested."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Unhealthy work environment/Questionable practices", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jun 2021", "job_title": "Mental Health Counselor in Champaign, IL", "duration": "N/A", "pros": "Reasonable pay, health, dental and eye insurance.", "cons": "The volume of work is unreasonable. Counselors are salary. You will never work 40 hours a week. You will work 50+. The administration in Rockford makes questionable decisions for the Central Illinois locations. It is clear that money is more important than quality of care. \r\n\r\nNo paid holidays. You must use PTO if you want paid for a holiday. I would never recommend anyone working here."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Decent", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Jul 2021", "job_title": "Anonymous Employee in Champaign, IL", "duration": "N/A", "pros": "It’s a full time job", "cons": "The benefits are not great"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place to work and gain experience in the social service field.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Apr 2021", "job_title": "Case Manager in Rockford, IL", "duration": "N/A", "pros": "Great coworkers, Great teamwork, Love the administration!", "cons": "Need better compensation for what is expected."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Rosecrance Unit specialist", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Apr 2021", "job_title": "Unit Technician in Champaign, IL", "duration": "N/A", "pros": "Supportive management staff and supervisors", "cons": "Typically low staffed and higher turnover rates"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2021", "job_title": "Crisis Counselor in Rockford, IL", "duration": "N/A", "pros": "Good Goood Goooood GOOOOOD GOOOOD", "cons": "Fine it was fine like just fine"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "It’s great as a first stepping stone....", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Feb 2021", "job_title": "Access Counselor in Champaign, IL", "duration": "N/A", "pros": "Friendly environment\r\nGreat entry level experience", "cons": "Little opportunity for growth\r\nPoor upper management\r\nClient care sometimes takes a back seat"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Don't Work for Rosecrance!!!!", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Dec 2008", "job_title": "Performance Improvement Specialist in Rockford, IL", "duration": "N/A", "pros": "They paid for employee's benefits, at least when I was there.  I left in 2002", "cons": "Everything.  Very political.  Had some incidents with the CEO where they were trying to blame the \"black client\" that was in the office for theft.  They didn't stop to think that it could have been anyone.  Lack of training for position.  I pretty much had to train myself in my job.  My supervisor gave me a low rating for teamwork because I was in a location that was not with my team.  Like that is my fault!!! I will never forget that unfair remark.  For that, I only got a 1% raise and never received the other 2% as promised.  I hated working at the adult facility.  I wished they would have kept me at the adolescent facility. Too many clicks and butt kissing at the adult facility.  My boss moved me to be with my team and I disliked it.  I did my work and stayed in my office.  She told me that I should mingle and make friends.  When I did, she told me that I get paid by the hour when I tried to \"mingle\".  She couldn't make up her mind!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Would not reccommend", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Mar 2021", "job_title": "Primary Counselor in Rockford, IL", "duration": "N/A", "pros": "co-workers, health insurance, 401 K, clients, dental, vision", "cons": "poor leadership, no support, toxic work culture, over-worked,"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Co workers are fantastic", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Dec 2020", "job_title": "Unit Counselor in Rockford, IL", "duration": "N/A", "pros": "Co workers, working with clients and PTO", "cons": "Pay, lacking support from leadership, staffing"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Rosecrance Has a Great Mission!!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 May 2015", "job_title": "Anonymous Employee in Rockford, IL", "duration": "N/A", "pros": "Working for an organization with the resources and talent to address substance abuse, behavioral health and co-occurring disorders is a wonderful way to give back to the community.  It is extremely busy and runs with as lean an organization as possible but there are tremendous rewards.  Rosecrance facilities and properties are top-notch and the organization is growing both in its geographical areas of service and in client population.  With this comes a slower rate of staff growth, but there is staff growth to meet the ever-growing demand.  The work is challenging and varied, and opportunities for professional training and growth exist.  The culture tries to keep overtime demands as low as possible, but there is overtime and it is managed.  Benefits are good and HR works hard at keeping the employee contribution portion as low as possible.", "cons": "Being a non-profit, salaries are lower than anyone would like.  Some of these pay issues really need to be addressed because the attrition low pay causes hurts the organization and it mission."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Values money more than the agency's mission.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Aug 2017", "job_title": "Case Manager in Chicago, IL", "duration": "N/A", "pros": "Clients, coworkers. Services the agency provides is great and has dedicated people. Staff truly care about the work they are doing and only stick around as long as they do because of the clients. But everyone has a breaking point. Training department was fantastic and actually something I miss at my new job. Very organized and helpful and ensured credentials were maintained.", "cons": "Unrealistic expectations of time management to manage extremely high case loads, money hungry, doesn't value employees, benefits only look good on paper, horrible HR department, management encouraged to give employees low scores on evaluations to avoid full raise, doesn't know how to boost morale, negative attitude from HR/management, doesn't value front line staff and sees them as warm bodies to generate billable services (which equals money). Wastes money on keeping up appearances."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Counselor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "1 Nov 2017", "job_title": "Counselor in Rockford, IL", "duration": "N/A", "pros": "Amazing and dedicated coworkers.  Powerful mission that motivates.  Benefit packages are wonderful, especially for a long term employee.  Well kept facilities.", "cons": "Top heavy in regards to executive leadership pay vs the salary range for direct care and lower management positions.  Significant disparity between what is marketed as best practices and what is actually practiced in treatment settings.  Best practices are compromised for financial gain.   Cliques and politics are webbed into the dysfunctional culture.  If you are not with the “it” crowd, then you are not good enough no matter what your bring to the team."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Success Based on Productivity NOT Recovery", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Apr 2019", "job_title": "Varied in McHenry, IL", "duration": "N/A", "pros": "Great co-workers. Great clients.  Good benefits,. You will love this company if staff  turnover, huge workloads, and little to no job training are your idea of insuring your job stability and career opportunities. The middle managers try, but are mouthpieces for executive leadership who may have stated, out loud they are, \"not so good with people relationships or empathy.\"", "cons": "Staff often speak in whispers. But worst of all, the workload and often the computer system  makes your job difficult every day to be competent in supporting client recovery causing compassion fatigue. Management treats compassion fatigue with lip service by ignoring the cure: manageable work loads."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "counselor", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Oct 2018", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Benefits, competitive pay, training opportunities (CEUs)", "cons": "No awareness of staff being overworked/burnt out. Lack of training to complete job duties, favoritism is often shown, no or little chance of advancement if you are not the favorite. Supervisors (not all but some) can be a little malicious and not trusted. Also, there is ALOT of pettiness, laziness amongst the staff if one doesn't want to do it, it can be passed to the next. Lastly, just because you are hired for one position doesn't mean that it will be the only thing you do, this is when you become burnt out"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unhealthy company", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Nov 2019", "job_title": "Mental Health Therapist in Rockford, IL", "duration": "N/A", "pros": "Great coworkers and direct supervisor is great.", "cons": "The company’s priority is making money which causes a high stress, high pressure, low moral work environment. Meeting productivity is primarily what they talk about and how they make decisions on the care they provide. That causes staff retention to be really high and results in clients getting passed around from one clinician to the next, cutting programs and groups."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best place I've ever worked, enjoy going in everyday", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Mar 2015", "job_title": "Environmental Services Department in Rockford, IL", "duration": "N/A", "pros": "Great coworkers, great benefits, purpose, all make for a rare work environment you enjoy being in every day. The company likes to promote from within so there's room for advancement. They value their people and show it by consistently hosting company events and giving back to the employees.", "cons": "Challenge of dealing with the client issues everyday makes it a tough job to do. The salary tends to be on the lower side but that's to be expected at a non-profit company"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Mental Health Therapist", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Aug 2018", "job_title": "Mental Health Therapist in Rockford, IL", "duration": "N/A", "pros": "Majority of the co-workers I had, which were many due to turnover, were amazing individuals and were probably the best co-workers I will ever have.  Seriously I still keep in touch with a handful of them and wish we could all work together again, just not at Rosecrance. Direct supervisors were always supportive.", "cons": "Pay is low, which is expected working at a community mental health facility; however, when the company has a for profit feel and the employees know that the CEO makes well over 6 figures is entirely too frustrating. This is especially true for employees who have standards that, although are achievable with working over 40+ hours or having a 90 plus client caseload, are too high for wanting a healthy work/life balance or providing exceptional client care.  Due to the lack of concern in regards to their employees work/life balance burnout happens frequently and quickly. Anyone who I worked with over two years there was burn out, and although the benefits in regards to PTO aren't horrible, the company does not create a culture that promotes a healthy balance. I had a former co-worker call the place a \"factory\" due to the heavy work load and expectations."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "believe the company and CEO ratings - you probably don't want to work at Rosecrance, especially downstate Illinois", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Oct 2019", "job_title": "Anonymous Employee in Champaign, IL", "duration": "N/A", "pros": "the mission of the organization, at least as stated, is laudable (charitable non-profit providing substance abuse and mental health treatment)\r\neveryone on the staff in downstate Illinois was great", "cons": "Profoundly dysfunctional, incompetent, abusive, soul-crushing management in Rockford that is driving the organization into the ground\r\nlow pay (it is a non-profit, after all, so that generally comes with the territory)"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxicity from the top down", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Mar 2020", "job_title": "Substance Abuse Counselor in Rockford, IL", "duration": "N/A", "pros": "Decent pay, consistent schedule, enjoyed the population I worked with", "cons": "Management was belittling. Used scare tactics (e.g. you can be replaced easily). Policies(at times) were hindering not only to the clinician but also to clients. Advocating for clients behalf would not alter policies.  \nWas forced to go to \"listening sessions\" every year where employees could voice their grievances.  This was a trick, because when you did voice a grievance, you were attacked or pulled into the big boss's office. You knew going to listening sessions, you were supposed to keep quiet.\nPay wasn't ideal, but they would supply you with ice cream on fridays?? I would give all the ice cream up in the world in order to be treated as a human being rather than an employee number."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "The Devil in Disguise", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Mar 2019", "job_title": "Treatment Specialist in Champaign, IL", "duration": "N/A", "pros": "They occasionally have success treating adults for alcoholism and drug addiction.", "cons": "The management creates a toxic environment in a attempt to induce competition. The thinking is this behavior will make employees put out more noting aka billing etc... Roscrance has come to Champaign and absorbed most of the behavioral health businesses and other social non profits. After acquiring these companies they systematically push out 100% of the older staff members and replace them with company robots. Feel free to ask around, addict or employee will say they same thing. It is an evil company masking profit driven motives with a christian moral facade."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Cult-like environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jul 2018", "job_title": "General in Champaign, IL", "duration": "N/A", "pros": "Most of the Champaign people left over from Community Elements and Prairie Center were really nice.", "cons": "Very secretive and big brotherish company. CEO seems oblivious and the people waiting to take over for him are not much better. Upper management is out of touch and rude to employees and quite frankly don't care."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Feb 2019", "job_title": "Recovery Specialist in Rockford, IL", "duration": "N/A", "pros": "Most employees are wonderful to work with, some campuses are amazing at helping clients.  Great training opportunities.", "cons": "Many changes to management and bosses get worse and downright incompetent at times. Supervision is absent. Boss comes in when he feels like it and gets a bruised ego whenever someone comes to him with possible solutions. The company adds responsibilities beyond education, experience, or proper training of employees."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Unit Technician", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Nov 2016", "job_title": "Unit Technician in Rockford, IL", "duration": "N/A", "pros": "There are some good people to work with. They're few and in between but they're there nonetheless.", "cons": "No room for growth. Work expectations exceed compensation. Low compensation. No work/personal life balance. Entry level workers aren't heard at all by upper management. The blame game is very popular here. Promising PTO but always gets denied the day before, day of (very inconvenient), day after (yes I've been notified the denial the day after before) scheduled request."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Rosecrance has lost their mission.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Feb 2020", "job_title": "Unit Specialist in Rockford, IL", "duration": "N/A", "pros": "PTO, Work Experience , Good benefits", "cons": "Low pay, selfish management, very high overturn rate with staff, lack of staff, stressful work environment, 1 staff to 14 adolescents (sometimes more) with behavioral/emotional issues with different needs, no breaks for unit staff."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Rosecrance is a great place to learn and advance your career in substance abuse counseling", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Sept 2008", "job_title": "Primary Counselor in Rockford, IL", "duration": "N/A", "pros": "Regular opportunities for in-service and networking,\r\nmanagement help in career path,\r\nlots of top down communication,\r\nemployee appreciation is strong, creative and refreshing", "cons": "Management expects regular unpaid overtime,\r\nemergency situations seem to be a regular thing"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not serious about recovery or life", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 May 2018", "job_title": " in Champaign, IL", "duration": "N/A", "pros": "The unit specialists pour their hearts into trying to help the clients. With little to no training, there wasn't anything the unit specialists wouldn't do to try and save the clients life. It would be better if some of the upper management were recovering addicts as to better help the clients who are slipping through the cracks daily.", "cons": "Since the buyout from Rosecrance from the previous owners, the current director has absolutely no clue what the clients need, the unit specialist need, nor the counselors. It is pure chaos as the director only tries to impress the higher ups for Rosecrance. With little to no experience with actual addiction nor what it is like to be an addict, the director and the cohorts lack empathy and respect for the sanctity of human life. The director is always unavailable, has no interest in training future employees with such a serious issue as addiction. The clients are left alone majority of the time slipping through the cracks due to inadequate employee numbers because the turn over rate is extremely high at the champaign site. Employees are hired as cattle to fill spots instead of being cared for and trained with a heart and mind of how to save these peoples lives. If you care about your loved one, find a better place for their safety, recovery and a hopeful future. With addiction it is about getting rid of chaos not creating more for such a vulnerable human being who is learning how to live for the first time in their life."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "My experience....", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Aug 2016", "job_title": " in Champaign, IL", "duration": "N/A", "pros": "My initial overall impression was how great it was for the client to have so many options to help them with his/her recovery process (mainly in the Rockford area).  That is the \"beast of Rosecrance\" and both a pro and a con.  The direct line staff I interacted with appeared to be very committed to his/her clients and truly were invested in providing the best services possible.", "cons": "Our existing company was bought out by Rosecrance which required much restructure, new titles, new everything.  I learned very quickly the executive management had no interest in being a team player, rather they operated similar to a dictatorship.  They created undue chaos despite being warned, begged, respectfully requested to slow a time line down to initiate new programming.  The whole experience quickly revealed the values and belief systems of the company.  Outwardly, they present much concern for the client.  Internally, our program was told, time and time again, to reschedule and cancel client's appointments to further the executive management's agenda.  Their agenda will override any and all client or employee's concerns.  This is important to know, not only from an employee perspective but also as a client.  Bottom line is:  the propaganda Rosecrance puts out about their values, etc. is NOT congruent with current employment relations and practices.  I guarantee you Rosecrance would not want an employee to talk to a \"commercial client\" (one who has private insurance $$$$$) like I have witnessed executive management talk to and treat his/her employees.  \r\nIt is less than professional to say the least."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Money means the most to Rosecrance, staff and patients come in distant 2nd", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Sept 2011", "job_title": "Unit Staff Detox in Rockford, IL", "duration": "N/A", "pros": "Has pretty good insurance. And there is much to me learned from patients.", "cons": "Long hours and half the time no breaks (but you will always have to punch out or HR gets on you and will deduct the half hour pay anyway). Usually dangerously understaffed. High turn over (average employments for staff with direct contact with patients is about a year and a half). No communication from management, but when staff does not know of changes management is quick to blame staff for the error(changes in policies happen almost weekly). Disrespect and direct insults from management. Unit staff has no back up from management when it comes to patient behavioral issues, if the patient had insurance there will be NO repercussions no matter how well documented, unit staff has no authority to deal with inappropriate behaviors . Management/HR lies about raises (often promises 50 cent raise after 6 months and yearly.) Fact is at best you will only get a 33 cent raise yearly and thats if you are VERY well liked, most get much less. SOPs very much out of date. One was just \"updated\" this year saying that staff should wear gloves when changing diapers on the family unit, that unit has been gone for over 4 years. However management will be quick to ask you when you ask a question (that they usually don't know the answer to) \"What does the SOP say?\". The computer system is terrible and there is NO training on how to use it, it's all trial and error. Also the system goes down often with no other patient chart back ups for emergencies. Training in general is lacking, at best you get 2 or 3 days of training when about 2 weeks is required,"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Low salary", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Apr 2017", "job_title": "Case Manager in Rockford, IL", "duration": "N/A", "pros": "There are plenty of opportunities for training and a culture that embraces ongoing learning and education. The work hours were okay.", "cons": "The rate of pay is low in comparison to jobs of its equal. For a company that treats substance abuse, there were zero testing done here post hire, but a need is present."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Tech", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Feb 2016", "job_title": "Tech in Rockford, IL", "duration": "N/A", "pros": "Friendly staff, Nice working environment, Great benefits!", "cons": "Low pay, lots of politics, stressful, and supervisors will add more work to you and expect it done in same amount of time. Lots of turnovers!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Highly worked and underpaid", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Sept 2016", "job_title": "Therapist in Rockford, IL", "duration": "N/A", "pros": "Peers helped make the environment fun and inviting; however, with so much turnover it was hard to get used to anyone for long.", "cons": "Administrators make incredibly lofty salaries while the worker bees barely make enough to live on."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not great but not a horrible place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "9 Oct 2019", "job_title": "Registered Nurse in Rockford, IL", "duration": "N/A", "pros": "Great coworkers. Rewarding work. 12 shifts available. No on call for non-management positions. Overtime usually available if wanted.", "cons": "Corrupt high management. HR is not employee friendly. It is all about the bottom line. Minimal salary growth potential."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Wish the pay was higher", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Feb 2018", "job_title": "Access Specialist in Rockford, IL", "duration": "N/A", "pros": "they do fun things for their employees and clients. They also have a great policy for taking mental health days since it is a stressful work environment", "cons": "way too low of pay especially for having a Bachelor's Degree"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Clerk", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 Feb 2017", "job_title": "Clerk in Rockford, IL", "duration": "N/A", "pros": "Healthcare benefits and 8 hours PTO every pay check.", "cons": "Very low pay and office politics. High turn over rate."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "It was good I did house keeping", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Feb 2020", "job_title": "Intern", "duration": "N/A", "pros": "Good pay good work and people", "cons": "Short time not sure what to do with the future"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great environment to work and learn", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Sept 2014", "job_title": "Unit Technician in Rockford, IL", "duration": "N/A", "pros": "Friendly employees, good benefits, above average benefits", "cons": "Some of the clients, but it's not really something they can do much to change"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Coordinator", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Apr 2018", "job_title": "Coordinator in Rockford, IL", "duration": "N/A", "pros": "Great team work, great mission, leadership is educated and competent, a lot of employee incentives.", "cons": "As in all behavioral health jobs, there is a lot of paperwork."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Assessment Counselor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "31 May 2016", "job_title": "Psychiatric Assessment Counselor in Selinsgrove, PA", "duration": "N/A", "pros": "The employer is expansive in extended its services and networkl", "cons": "employees frequently feel unappreciated and expendable"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful place for growth!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Sept 2014", "job_title": "Unit Technician in Rockford, IL", "duration": "N/A", "pros": "CO Workers, Helping kids, Going fun places with clients. Learning new things.", "cons": "Hard emotionally dealing with troubled kids."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great place to start out clinical career", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Apr 2019", "job_title": "Anonymous Employee in Champaign, IL", "duration": "N/A", "pros": "Great experience for clinicians right out of school.", "cons": "The pay is not that great for clinicians."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Meaningful work but emotionally draining", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Sept 2019", "job_title": "Unit Counselor in Rockford, IL", "duration": "N/A", "pros": "-Great coworkers\r\n-Meaningful work\r\n-Can be a fun atmosphere", "cons": "-You'll have to work overtime\r\n-Emotionally draining\r\n-Not great pay"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great company to work for.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jun 2015", "job_title": "Addiction COunselor in Rockford, IL", "duration": "N/A", "pros": "Very personable, many different opportunities and a great envirnoment.", "cons": "Under paid for work that is done."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Sept 2019", "job_title": "Recovery Home Staff in Rockford, IL", "duration": "N/A", "pros": "Residents, Coworkers, House Manager, Group Outings, Food", "cons": "Relapses when clients leave"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mental health clinician", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Oct 2020", "job_title": "Mental Health Clinician in Rockford, IL", "duration": "N/A", "pros": "Love helping this population in need. Very rewarding job", "cons": "High amount of turn around."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Mh clinician", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jun 2016", "job_title": "Anonymous Employee in Rockford, IL", "duration": "N/A", "pros": "Ok benefits flexible hours decent pay", "cons": "Time consuming poor work life balance"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Mental Health Clinician", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Sept 2016", "job_title": " in Crystal Lake, IL", "duration": "N/A", "pros": "Efficient agency, good client care.", "cons": "Poor Leadership, and inconsistency with values."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Counselor", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Jul 2019", "job_title": "Counselor in Rockford, IL", "duration": "N/A", "pros": "Gained insight as to how NOT to run a company, learned to advocate for myself", "cons": "Poor management , bullying mentality , poor benefits , no appreciation , lack of professionalism, lack of training , no consideration for employee well being"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor Workplace", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Oct 2019", "job_title": "Anonymous Employee in Rockford, IL", "duration": "N/A", "pros": "Large Desks \r\nNo required overtime", "cons": "Gossiping- including upper management \r\nLow pay"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Solid company...great benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 Oct 2019", "job_title": "Recovery Specialist in Rockford, IL", "duration": "N/A", "pros": "Great supervision and good benefits", "cons": "Low starting pay and under staffed"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "No professional development", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Mar 2020", "job_title": "Anonymous Employee in Champaign, IL", "duration": "N/A", "pros": "Friendly co-workers. Lots of potlucks.", "cons": "Poor leadership, no professional development."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Clerical", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Jun 2019", "job_title": "Clerical Support in Rockford, IL", "duration": "N/A", "pros": "Very nice people work there.", "cons": "I do not have any cons."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Blah blah blah", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jun 2020", "job_title": "MHT in Champaign, IL", "duration": "N/A", "pros": "The unit specialists were hard working", "cons": "The staff at the recovery house are all on a different page"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Good therapists leaving declining company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 May 2019", "job_title": "Addiction COunselor in McHenry, IL", "duration": "N/A", "pros": "Good pay and benefits, great coworkers, though they are leaving for better organizations", "cons": "Leadership and upper management care more about the bottom line than about client care or employee satisfaction."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Abysmal place", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Sept 2019", "job_title": "Unit Tech in Rockford, IL", "duration": "N/A", "pros": "Dress Policy was probably the best thing about it", "cons": "Work environment,  higher ups,  pay, hourly schedule, organization, clients, treatment program"}]]