[[{"date": "20 May 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ThedaCare in Apr 2023", "Interview Descriptions": "Applied online, received a quick request for a phone interview days later. Typical phone interview exploring my skills and the role details. Next, verbally was told I’d be emailed regarding an in person interview to be set up. Received a request for references at this stage before the in person interview. Never seen a request for references at this stage and was uncomfortable sharing them due to my current position. I drove two hours for the in person interview where the interviewee was late. The interview was scheduled for 1.5 hours. I met with the first person for 1.5 hours and then was asked if I was still able to meet with a second person. I agreed but had to literally stop and coordinate childcare because I wasn’t going to be home as planned. The interview was easy going and flowed more conversation like and I felt comfortable with both interviewers. Went weeks without hearing an update, which definitely meant one thing, but believe that this company would have ghosted me had I not asked for an update on my own. Overall, the experience was negative but easy interview with questions relating to my current role, things I enjoy doing as an EA, etc.", "Interview Questions": "What do you enjoy about being an EA?"}, {"date": "24 Feb 2023", "title": "Epic Application Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ThedaCare in Sept 2021", "Interview Descriptions": "It starts with a phone interview with a recruiter, then a supervisor connects for more conversation or informal interview, then panel interview with analyst from multiple applications and other leaders. They decide if you are a good candidate and then what application that has an open position would be a good fit.", "Interview Questions": "What experiences do you have that would make you successful in this role?"}, {"date": "31 Aug 2021", "title": "Clinical Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at ThedaCare (Appleton, WI) in Feb 2021", "Interview Descriptions": "Recruiter reached out about a week after applying. Interview questions and process was typical. No complaints.\n\nThe only negative aspect of the hiring process is they REQUIRE you to give 3 references, preferably 2 being previous managers, if you wish to be still considered for the role regardless if they actually intend to hire you or not. As soon as the interview is over, they tell you to expect an email asking for references and it needs to be provided within 24 hours otherwise your application is canceled. Per a source who applied at Thedacare, they also asked him/her for references but did not receive an offer or additional interest for further interviewing. Recruiter told this person they always ask for reference and they keep it on file for 1 year in case you apply again\n\nAfter providing references, they receive an email to complete an online survey with various questions regarding their experience working with you. I imagine it would take anywhere from 15-30 minutes to complete, which is quite lengthy for someone who's doing you a favor being a reference. \n\nI would advise anyone applying at Thedacare to carefully consider giving your references after an interview unless you feel confident (or don't mind wasting your references' time) that you may get the position. In my opinion, an organization that wastes your references' valuable time doesn't have any professional respect for you or anyone else's time, and not worth working for.", "Interview Questions": "What do you know about Thedacare?"}, {"date": "16 Feb 2021", "title": "OD Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ThedaCare in Jan 2021", "Interview Descriptions": "The recruiter sent out interview notes to me on accident along with a calendar invite to send me a decline letter. Not a great candidate experience or representation of the company.", "Interview Questions": "Very high level screening questions. "}, {"date": "24 Jan 2020", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ThedaCare", "Interview Descriptions": "What you are told in your interview is not what the job ended up being. The mgr that did the i terview ended up not to be the same mgr you worked for. In interview they were so pleasant, but after your hired, the tones and attitudes of mgmt changed.", "Interview Questions": "Will you help create this new position?"}, {"date": "28 Apr 2019", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at ThedaCare", "Interview Descriptions": "First was a phone interview, then in person interview. They seemed to want to know who I was as a person to see how well I would fit in with the team, as well as to make sure my qualifications and experiences were relevant.", "Interview Questions": "What is your previous experience?"}, {"date": "3 May 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ThedaCare in Apr 2018", "Interview Descriptions": "Telephonic interview with HR, then in person interview with department manager.  Standard interview.  Behavioral type questions which are standard these days in healthcare. HR was very nice and interview went smoothly.", "Interview Questions": "Why do I want to work there"}, {"date": "17 Dec 2017", "title": "Registered Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ThedaCare (Oshkosh, WI)", "Interview Descriptions": "Difficult to remember has been 17yrs ago, but recently interviews have been in a group style setting which is always nerve wracking. Very specific questions relating to past jobs and why I was terminated. Felt on display and could tell right away they weren't going to high me. No hiring process as no hiring in my workplace choices.", "Interview Questions": "Where do you see yourself in 5 or 10yrs\r\nPros and cons of my work ethics"}, {"date": "18 Aug 2017", "title": "Childcare Teacher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ThedaCare (Appleton, WI) in Aug 2017", "Interview Descriptions": "The interview process was typical with a 1/2 hour classroom observation added. What is very disappointing is that after 2 weeks, I have not heard a word for follow-up. The director indicated that she would be contacting me the next week, but has yet to do so after 14 days. I sent a brief email after a week asking if there was anything more I could contribute or clarify about my experience or background, and was never even given the courtesy of a reply. I think this is very unprofessional and rude and that I at least deserved some kind of communication about my status as a candidate when it was promised. It helped me to realize that I would never want to work at an organization where their word is no good and where follow-up is not considered a priority. I was amply qualified for the position and thought the interview went well, but I can accept that I was not their choice. What I can't accept is not getting a phone call, letter, or email telling me of their decision. I do not trust organizations or management that don't use correct business etiquette or apparently have enough consideration for others to offer closure to the interview process. Very unimpressed.", "Interview Questions": "How to relate to parents who are having a difficult time at drop off."}], [{"date": "10 Jul 2016", "title": "Clinical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ThedaCare (Appleton, WI) in Jun 2016", "Interview Descriptions": "I interviewed 2 weeks ago- they told me 2-3 weeks, but it's nice because they have a website that I can check the status is my progress.  It sti states that I am being reviewed by the hiring manager.  So that is good", "Interview Questions": "Why I chose Theda to apply to"}, {"date": "9 Feb 2016", "title": "RTR, RMDS, CT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at ThedaCare (Waupaca, WI)", "Interview Descriptions": "Smooth, direct to point regarding the employment. Department manager kind and easy to speak with. Willing to completely show the Radiology department and the complete Hospital. The RMC was bought out vis Theda care. During the time I was employed there 20 plus years, it was a local city hospital.", "Interview Questions": "Willingness for advancement with continuing education. Willingness to also work on-call emergency."}, {"date": "9 Feb 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ThedaCare (Appleton, WI) in Feb 2016", "Interview Descriptions": "-1 Phone Interview 15-25 minutes - It was more of a behavioral interview, they asked a lot of \"give me a time\" \r\n-1 In-person Interview with Management + Supervisor. very professional setting and asked for a lot of scenarios and always asking for you to share a past experience. Which I didn't have a problem with. \r\n-Job Shadowing", "Interview Questions": "A lot of \"Give me a time when... you disagree with a coworker / (vice versa)\""}, {"date": "23 Sept 2015", "title": "Hospital Informationist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ThedaCare (Appleton, WI) in Sept 2015", "Interview Descriptions": "The first stage in the screening telephone interview.  It was about 20-30 minutes.  The interviewer was comfortable to talk to.  I hope I am still in the process.", "Interview Questions": "Tell me about yourself. Why do you want to work for ThedaCare?  What are your salary requirements. Do you have any questions?"}, {"date": "28 Jul 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ThedaCare (Appleton, WI) in Mar 2015", "Interview Descriptions": "My interviewer was very responsive.  I could tell that she was engaged and not just checking things off a list.  They want to hire people that have the right personality, not just credentials.  I knew I had probably gotten the job when I left the office, which was meaningful to me because I hate that long waiting game and the uncertainty that comes with it.  She asked about my previous work, what drew me to that work, and what I was interested in doing now with my career.", "Interview Questions": "They gave me a list of 4 different needs that a patient might have and asked me to prioritize them."}, {"date": "16 Jul 2018", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ThedaCare (Appleton, WI) in Sept 2014", "Interview Descriptions": "First there was a 30 minute phone interview with a recruiter. The second interview was face to face with a group of seven analysts and a manager.   During the interview each analyst asked a different question. The manager moderated the meeting.", "Interview Questions": "How do you handle working on multiple projects at one time and then added to an urgent project that needs to be completed quickly!"}, {"date": "4 May 2013", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ThedaCare (Appleton, WI)", "Interview Descriptions": "I filled out an online application. Was then contacted by human resources to schedule a job shadow followed by an interview. (job shadow tues, interview was on thurs) Interview was a panel of three. Lasted 1/2 hour. I was called 1/2 hour after the interview ended and was offered a job!", "Interview Questions": "Lots of situational questions. Be prepared with lots of scenarios in your head & how you would handle them. "}, {"date": "4 Sept 2014", "title": "RN Triage Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ThedaCare in Mar 2013", "Interview Descriptions": "I was hired the day after my initial interview .  The interview was with two men and one woman (supervisors)  which was a little intimidating .  Prior to that I had a phone interview with HR at Thedacare", "Interview Questions": "I was many \"what would you do if ?\" type questions.  I found this slightly difficult, since I had nevr been a phone triage RN before"}, {"date": "9 Jun 2016", "title": "Manager of Public Relations Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ThedaCare (Appleton, WI) in Mar 2012", "Interview Descriptions": "The process was very slow beginning to end taking months.  Consisted of multiple phone and one-on-one interviews, Then the big one was four back-to-back peer sessions in one morning. Groups asked repetitive, traditional behavioral questioning", "Interview Questions": "Tell us about a time when you had to work with and overcome objections"}]]