[[{"date": "28 Dec 2022", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Abington Jefferson Health in Dec 2022", "Interview Descriptions": "It was pretty good it went fast I had an interview on a Friday and got the offer letter Tuesday just waiting for the drug test kind of nervous for that", "Interview Questions": "Tell me about a time where you encountered a difficult situation"}, {"date": "20 May 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Abington Jefferson Health", "Interview Descriptions": "I did a phone interview with the recruiter, discussed my employment history and salary expectations. Confirmed I am tobacco free and had my HS diploma. Following our phone interview she scheduled me to meet with the director with whom I interviewed with. We reviewed my employment history, job descriptions, etc.. Showed me around the hospital. A week or two later, I received an offer.", "Interview Questions": "Q: Tell me about a time you encountered a difficult patient and how did you handle it."}, {"date": "23 Feb 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Abington Jefferson Health", "Interview Descriptions": "Quick. Not too many questions, simple process. Woman conducting the interview was attentive and kind. Smooth process with little hiccups go to the site and you. Not much else to report.", "Interview Questions": "What is your most relevant experience "}, {"date": "18 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Abington Jefferson Health in Feb 2022", "Interview Descriptions": "Process was pretty quick. I applied and was contacted by HR a couple days later. I was scheduled for a zoom interview with the unit manager a week after that. The interview felt like more of a conversation. I was asked a couple basic interview questions. If I didn’t ask any questions the interview would have lasted maybe fifteen minutes. Overall, a very positive experience.", "Interview Questions": "Tell me about yourself.\r\nWhat are some of your strength and weaknesses."}, {"date": "9 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Abington Jefferson Health", "Interview Descriptions": "The interview process was easy. HR was quick to contact and helped me through navigating the next steps with everything. They allowed me to ask my questions and address any concerns I might have had. They were receptive to all that I had to say.", "Interview Questions": "What are your strengths and weaknesses. "}, {"date": "18 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Abington Jefferson Health", "Interview Descriptions": "very responsive HR and interviewers, there was an HR call, an interview with a manager and then a follow up and an offer was created. easy process, but felt put on the spot to accept at that moment", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "22 Feb 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Abington Jefferson Health in Apr 2021", "Interview Descriptions": "There is five professional references needed and two interviews needed from human resources and the direct manager from the department you are trying to work on. Be prepared for possible questions", "Interview Questions": "What made you choose Abington? "}, {"date": "6 Jun 2021", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Abington Jefferson Health (Abington, PA) in Jan 2021", "Interview Descriptions": "Straight forward with HR, 15 minute phone interview. Reviewed qualifications on resume, answered a few questions. Was very relaxed. Moved onto an interview with hiring manager about a week later.", "Interview Questions": "A time you dealt with a difficult patient"}, {"date": "3 Jul 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Abington Jefferson Health", "Interview Descriptions": "Very automated HR processes. Just follow through with their steps. Eventually interviewed on the unit with the manager and some staff. AT his point is was more relaxed and questions were welcomed.", "Interview Questions": "Basic interview questions like strengths and weaknesses. Tell us about yourself etc."}, {"date": "22 Aug 2018", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Abington Jefferson Health", "Interview Descriptions": "Quick process once you get your resume viewed. Very nice HR employees. Orientation should be adjusted . Some may need more but also lacking seniority due to RN's leaving.", "Interview Questions": "Are you a team player?"}], [{"date": "5 Jun 2018", "title": "Clinical Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Abington Jefferson Health (Abington, PA) in May 2018", "Interview Descriptions": "Interviewed with two nurse managers.  They were down to earth and made interview comfortable. Each nurse manager gave details about each of their units and what the description of the job in detail.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "22 Dec 2017", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Abington Jefferson Health (Philadelphia, PA) in Dec 2017", "Interview Descriptions": "I had a interview with HR then 2 head nurses. Very nice and respectful. Normal questions. Heard back in a week with offer and then have to go for physical, get fingerprints done for background check then orientation", "Interview Questions": "Why did you become a cna? What would you do if someone said they have chest pains? What do you hate and love about this profession?"}, {"date": "3 Aug 2018", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Abington Jefferson Health (Abington, PA) in Feb 2017", "Interview Descriptions": "application was to be completed online. Human resources department seems to be short on staff due to the very long wait before hearing anything back. Wait time was about 2 months which seems to be a long time when so many jobs are posted", "Interview Questions": "No questions were difficult, everything that was asked is the same thing you are asked on any other job interview"}, {"date": "14 Dec 2017", "title": "Moa Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Abington Jefferson Health (Abington, PA) in Feb 2017", "Interview Descriptions": "Went in for interview and immediately went into a second interview. Office manager, clinical manager, and regional manager sat in. They were all very friendly and welcoming. They asked about my goals and why I wanted to be in the health care industry.", "Interview Questions": "What kind of experience I had, future goals."}, {"date": "2 Nov 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Abington Jefferson Health (Abington, PA)", "Interview Descriptions": "I first met with HR, then met with someone in the department, then met with the manager of the department.  The HR portion was challenging for me as this was my first interview in about 8 years.  I answered as best I could, but probably gave a little too much information.", "Interview Questions": "N/A"}, {"date": "24 Feb 2018", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Abington Jefferson Health (Abington, PA) in Nov 2016", "Interview Descriptions": "I applied online and received an email for a video interview where I would film myself answering questions. Then I was called in for an actual interview. First it was one on one, then in front of three or four people. Several applicants were present for interviews, which was kind of intimidating. Interviewers were kind and accommodating.", "Interview Questions": "Describe a time when you didn't agree with a colleague "}, {"date": "6 Nov 2018", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Abington Jefferson Health (Abington, PA) in Apr 2016", "Interview Descriptions": "Apply online, complete a phone screen, go on site to HR, then on site to the office location of the job to complete a panel interview. The panel interview was good in that it showed the both the culture and group dynamics the person in the position would be dealing with.", "Interview Questions": "Willingness to troubleshoot basic equipment (i.e. printers) in the hospital. "}, {"date": "12 Apr 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Abington Jefferson Health (Abington, PA) in Mar 2016", "Interview Descriptions": "I interviewed in March of 2016.  HR was extremely unorganized.  They even told me the wrong date to come in (thank goodness I followed up to confirm date and time!). HR and Nurse manager with both late.  It seemed like I was an inconvenience to them in the HR department.\r\nThe nurse manager was extremely friendly.  I almost wish she hadn't been.  She kept emphasizing the need for nurses, and the wonderful new grad program that I'd do great in.  She seemed super excited to be talking to me and I thought we got along well.  It was my FIRST RN interview EVER, so I was nervous, which may have shown and may have hurt me.  But she kept filling me with so much hope. Abington was my first choice... So of course I was so crushed when I never heard back.  Even after several follow ups.", "Interview Questions": "Nothing too complicated.  The usual nursing scenario questions."}, {"date": "20 Mar 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Abington Jefferson Health (Abington, PA) in Nov 2015", "Interview Descriptions": "Varies. Some interviews are panel style with all nurse managers who are hiring at the time. Some interviews only consist of a one on one interview with the manager for position you chose to apply for. Typical interview questions.", "Interview Questions": "What are your greatest strengths"}, {"date": "23 Jan 2016", "title": "Documentation Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Abington Jefferson Health (Abington, PA) in Oct 2015", "Interview Descriptions": "Rigorous process of 3 round interviewing. \r\n1. HR manager (day 1) if you pass her then,\r\n2. Documentation Specialist Department Manager  (Very nice & approachable woman. She gave me  pointers for the third interview.  She asked clinical questions and the typical strengths and weaknesses, describe yourself, how would others describe you, & several similar questions that kind of catch you off guard all based on describing yourself thus aiming at figuring out strengths, self-articulation, & character. So, know your synonyms to describe yourself and be thought provoking & ingenious in your answers.\r\n3. Documentation Specialists on staff (group interview of about 6)-They also ask clinical questions & self-description questions.", "Interview Questions": "Q: What lab is done 3 times, one of which is in the ED, when a person is admitted with an MI?"}], [{"date": "12 Oct 2015", "title": "Patient Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Abington Jefferson Health (Abington, PA) in Aug 2015", "Interview Descriptions": "Panel interview for new nurses went early in the morning so I only had 3 nurse managers where other people had 8 nurse managers which is unfair in my eyes they each asked a bunch of reasonable questions and we're all very nice, but there was a lot of people interviewing for the positions", "Interview Questions": "When was a time you went out of your way for someone"}, {"date": "8 Jan 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Abington Jefferson Health (Ambler, PA) in Jul 2015", "Interview Descriptions": "Office manager asks about experience or schooling information. Then you are introduced to members of the office and describes briefly what your specific duties may be. If chosen then have to apply for background check and do a physical and drug screen at the hospital.", "Interview Questions": "Do you know how to take vitals, Imm, and venipuncturr?"}, {"date": "24 Mar 2015", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Abington Jefferson Health", "Interview Descriptions": "Easy interview, only call when they are interested for the most part. Very friendly and easy going staff who made you feel comfortable. Be prepared to highlight your skills and discuss what you bring to the team. It is a great experience.", "Interview Questions": "Something in your past experience that highlighted your leadership skills"}, {"date": "6 Jan 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Abington Jefferson Health", "Interview Descriptions": "The interview process very pretty informal. First, there was a very short interview with HR that had generic behavioral and situational questions related to nursing and otherwise. Next, I met with two nurse managers. It was very unprofessional. One of the nurses was wearing a sweatshirt and was texting when I walked into the room. She continued to do so even after I sat down and began to answer the other nurses' questions. I questioned whether they really wanted me there in the first place or if they were interested in what I had to say at all. I was disappointed as I thought very highly of Abington Memorial Hospital before this experience.", "Interview Questions": "A few situational/behavorial questions"}, {"date": "17 Oct 2014", "title": "Team Coordinator Nursing/Charge Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Abington Jefferson Health in Sept 2014", "Interview Descriptions": "4 step interview process. First with Human Resources, then Director of the Unit on the same day. I came back again for second step: Interview with other Managers and the peer interview. The Managers asked the same questions the Director asked. The questions from peer team were more  about how I would  fit in with them. The peers gave accurate picture of Job: schedule, flexibility, work load, acuity of the unit, benefits, support system and work culture.", "Interview Questions": "The questions are thorough, do your homework. The  benefits are expensive. I did not expect to pay for my own parking for a Job interview especially when parking is in the campus. During the peer interview, many questions that the peers raised  created holes in the disclosure of the job requirement. Basically, the peers painted the reality of the Job as opposed to the fairy tale of the HR and Director. "}, {"date": "7 Feb 2014", "title": "Patient Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Abington Jefferson Health", "Interview Descriptions": "interview with HR then the department. second interview is with peers or subordinates you managed", "Interview Questions": "You have not been in the filed in over 10 years, can you jump back in?"}, {"date": "17 May 2013", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Abington Jefferson Health", "Interview Descriptions": "I was first called for a screening interview and then brought in for an in person interview. Because of time constraints I met with the entire team at once (a little overwhelming, but a good experience). Once I was done meeting with the team I meet with HR. I was called soon after an offered a position.", "Interview Questions": "N/A"}, {"date": "18 Jul 2014", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Abington Jefferson Health in Apr 2013", "Interview Descriptions": "2 interviews, hired quickly, good communication. Very impressed by my future boss. It is definitely one of the best outcomes considering that I was part of a group of acquired employees. No regrets at all!", "Interview Questions": "none that I can think of"}, {"date": "15 Mar 2017", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Abington Jefferson Health (Lansdale, PA) in Jan 2013", "Interview Descriptions": "Asked about customer service. Asked how you did in stressful environments. Examples where you worked as a team. Examples of when you took a leadership role. Do you enjoy talking to people, or helping people. Can you handle being told what to do?", "Interview Questions": "What are your hobbies?"}, {"date": "7 Jan 2017", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Abington Jefferson Health (Abington, PA) in May 2012", "Interview Descriptions": "I did not get hired when first interviewed.  After a year of looking for another opening to come up, I contacted director to express my desire to be part of organization.  I was given Offer  after second interview with management team and peer interview.", "Interview Questions": "Where do I see myself in five years"}], [{"date": "28 Aug 2015", "title": "Human Resources Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Abington Jefferson Health (Abington, PA) in Mar 2011", "Interview Descriptions": "Professional, well thought out process.  Organized and set up well but recruiter was not prepared and ran over 45 min late to start the interview.  She did not have very professional questions to ask - more of a conversation.  You could tell she was not prepared and had was not familiar with my resume prior to the interview and could not \"find\" it during the interview.  Waste of my time.  Would not want to work for a HR dept. that cant get the interview process right.  Other areas of the hospital may be better but not this HR dept.  I was also warned by others that this HR dept was less than professional", "Interview Questions": "Tell me about you backgroud"}, {"date": "16 Oct 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Abington Jefferson Health in Nov 2009", "Interview Descriptions": "2 interviews", "Interview Questions": "Nothing difficult"}, {"date": "15 May 2009", "title": "Clinical Information Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Abington Jefferson Health (Abington, PA) in Apr 2009", "Interview Descriptions": "Received an email from their HR department asking me to set up a time to interview. Was told I would be interviewing with two people, one from HR and the other from Health Information Systems (HIS). They were very flexible on times and dates, and from then on it was just waiting about a week for the interview itself.\r\n\r\nWell, I come in at 2:00 when my interview is at 2:30, and had been told to show up about 10 minutes early to fill out paperwork. Pre-interview paperwork takes about 25 minutes, despite my materials being on-hand, and then I'm called into the actual interview. Instead of a group interview, it turns out to be consecutive interviews with the two individuals, with the HR representative going first. The whole process took 3.5 hours, and both people covered similar territory. Neither had read the online application I submitted, so there were issues right away with compensation, which is never posted on their website. The HR person asked me standard questions like \"list three adjectives your former boss would use to describe you\" etc., while the HIS person asked more probing, detail-oriented tests surrounding critical thinking and experience.\r\n\r\nMany details about the position were not included in the job description, including mandatory on-call time and the campus at which I would be working, which would have impacted my desire to go on the interview in the first place. The organization seems to be going through a major change, with the HIS department totally gutted and hiring on people for AMH itself and a satellite hospital they recently acquired. Was not impressed with the facilities, nor the opacity of the actual interview process. No one ever emailed me back to let me know the status of my employment, except to say that another position which I had not interviewed for was filled.\r\n\r\nI would not recommend this organization.", "Interview Questions": "What are examples of prior projects you have worked on that were similar to those being undertake at our organization?"}]]