[[{"date": "5 Apr 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Palo Alto Medical Foundation (Los Altos, CA)", "Interview Descriptions": "Basic interviewing process. I had a phone screen interview with the recruiter and was passed through the next stage. I interviewed with the hiring managers and answered basic behavioral questions. I heard back from HR ~2 weeks after.", "Interview Questions": "Why are you interested in joining PAMF?"}, {"date": "22 Feb 2022", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "They will first contact you to schedule an interview with them. Due to covid, the interview will occur via Zoom or Microsoft Team. There will be 3 - 5 interviewer ask you questions for about 30 minutes.", "Interview Questions": "Can you tell us about yourself?"}, {"date": "30 Sept 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "Got a phone call to schedule an interview. Had an In-person interview with both department supervisor and manager. They were very easy going, mind you it was for a temporary position, but I got a call within 1 hour that I got the job.", "Interview Questions": "Tell me, why would you like to work for this organization?\nTell me about a time you went above and beyond for customer service?"}, {"date": "9 Mar 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "Two people interview with scenario questions. Give a lot of information and what they expect from the new hire. They also let me ask questions and give availability. They also walked potential hire through their lab and give a brief introduction", "Interview Questions": "what would you do if you and your coworker get in afight "}, {"date": "11 Mar 2021", "title": "Technical Support Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at The Palo Alto Medical Foundation (Dallas, TX) in Feb 2021", "Interview Descriptions": "The interview was a three stage process and after the last stage,  i was promised that  I was going to hear back from them within 24 to 48 hours on the final decision. It is three weeks now and nothing, I have written to the recruiter for updates, no response.", "Interview Questions": "about SSL Handshake, IPSEC vpn , TCP/IP, OSPF routing protocol, "}, {"date": "26 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Palo Alto Medical Foundation (San Jose, CA) in Aug 2020", "Interview Descriptions": "I had 2 phone interviews. I with the manager and the other with the manager and the team. They asked me about my experience as a nurse and what I thought my strengths were.", "Interview Questions": "Why are you interested in this position?"}, {"date": "20 Nov 2019", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "Did a phone interview a week after applying and the face to face interview scheduled for the following week with the supervisor and manager.  Had a chance to informally meet the team.", "Interview Questions": "Why did you leave your last position?"}, {"date": "10 Jan 2020", "title": "FNP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Palo Alto Medical Foundation in Nov 2019", "Interview Descriptions": "3 Interviews total. First one 1:1, then panel, followed by meeting the providers of the team. Clinical questions were asked in the first one. Second one mostly behavioral and third one mostly a meet and greet.", "Interview Questions": "Why this organization?"}, {"date": "10 Feb 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Sept 2019", "Interview Descriptions": "short. manager wil lead you into answering the right questions, and focus on what the job is about. MD in charge was a part of the interview to see if candidate is a good fit.", "Interview Questions": "what would you do if you get a call about a client's poop looking black and tarry?"}, {"date": "11 Apr 2019", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Palo Alto Medical Foundation (Dublin, CA)", "Interview Descriptions": "Screening phone, then in person with 3 people. Format was answering questions in conference room. Laid back environment, interviews were scheduled back to back. Took a while to hear back about final decision.", "Interview Questions": "What do you know about Sutter?"}], [{"date": "8 May 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Feb 2019", "Interview Descriptions": "Got called in for an interview months after I had initially applied online. The interview was quick and simple, but we started 15 minutes after my scheduled time. Never received any communication after the interview.", "Interview Questions": "Give an example of a time you went above and beyond at work."}, {"date": "5 Sept 2018", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Sept 2018", "Interview Descriptions": "Panel interview with 5 people from the company interviewing me. They discussed the open positions and how many people they were hiring. After the interview, one of the coordinators walked me out and showed me the call center.", "Interview Questions": "What is your 5 year plan?"}, {"date": "26 Jul 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "I had an initial phone screening. Followed by a panel interview which consisted of 3 interviewers including me. There were a lot of situation questions related to empathy and patient care priority. \r\nInterview took about 45 minutes.", "Interview Questions": "If you saw your co workers gossiping and you were next to them, how would you react or what would you do? "}, {"date": "15 Feb 2022", "title": "PSR III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Jan 2018", "Interview Descriptions": "It's really easy and nothing to worry about just relax and you'll do fine.  All you have to do is remember that patient care is the number one priority of this company", "Interview Questions": "What makes you a good fit for the company?"}, {"date": "12 Dec 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at The Palo Alto Medical Foundation (San Carlos, CA) in Dec 2017", "Interview Descriptions": "I unfortunately didn’t get hired, my experience with the interview was intense. It was a group interview with 3 of us and 3 people asking questions. It was a lot of questions asked. They advised me it’s a month turnaround time for hiring Process", "Interview Questions": "Tell me what you would do if you had a co worker that had a problem with work task and what would you say to them?"}, {"date": "6 Oct 2017", "title": "MARP Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation (Mountain View, CA) in Oct 2017", "Interview Descriptions": "Applied online, was emailed a week later to choose a time to interview. Went into HR office, selected top 5 locations to work and met 1:1 with LVN. Basic interview as well as a knowledge assessment and scenario questions. Received an offer the next day.", "Interview Questions": "How do you describe success?"}, {"date": "20 Apr 2017", "title": "MARP Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Palo Alto Medical Foundation (Felton, CA) in Apr 2017", "Interview Descriptions": "I had my interview this morning and it was very different than the typical interviews I am used to. This interview was scenario based rather than questions on your skills and experience. I can see why they conduct their interviews this way; it keeps the interview process very competitive. I had applied to this program last week on Tuesday, and I got a call that same day for an interview, about 2 hours after I had submitted the application. Now I have to wait to get a call back within this next week to see whether or not I got the position. Fingers crossed!", "Interview Questions": "Interview questions are to be kept confidential to keep it competitive but since it was scenario based it was questions such as, \"what would you do if..\" \"what would you say to a patient if..\""}, {"date": "2 Mar 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Palo Alto Medical Foundation (Sunnyvale, CA) in Mar 2017", "Interview Descriptions": "The interview took approximately 31 minutes long. I was interviewed by three people. It was conversational. They asked me questions and I had the opportunity to ask them questions. I provided all three interviewers with a resume. Once they asked me the general questions, they asked me questions that were related to my resume that I provided them.", "Interview Questions": "What do you know about PAMF?"}, {"date": "28 Jun 2017", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Mar 2017", "Interview Descriptions": "Process was easy. Applied online, got a call for interview, came in interviewed and was invited back for a 2nd interview. After the 2nd interview I was offered the position .", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "17 Jan 2017", "title": "Health Promotion Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Palo Alto Medical Foundation (New York, NY)", "Interview Descriptions": "After quite a few weeks, I was called to an interview with a supervisor. Once, that was completed, I got another call to attend a team meeting - interview, where the whole team introduced themselves, described what their main assignments are, and they were all given a chance to ask me any question they wanted. It was a warm, welcoming atmosphere. They promised to notify me within a week, whether the position was mine, I got a call an hour later from the HR making an offer, starting the whole process.", "Interview Questions": "What about health promotion is important to you?"}], [{"date": "2 Dec 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at The Palo Alto Medical Foundation (Mountain View, CA) in Dec 2016", "Interview Descriptions": "I was called while I was a temp for the flu clinic. I met with the manager in her office during my break overall it was pretty casual and easy.", "Interview Questions": "How are you with customer service, and time management"}, {"date": "23 Aug 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Palo Alto Medical Foundation (Mountain View, CA) in Aug 2016", "Interview Descriptions": "I applied online through the PAMF career portal and was called by a HR coordinator a few weeks later, she mentioned it was for a MA position but there were several open.  When I arrived for the interview she asked me to pick my 3 top locations to work and said one of those would be my starting point.  For MA its a pool then you get hired into the clinic.  It was very fast for me.  I interviewed 1:1 with an RN and with HR.  I was offered the role pretty quickly.  The process is quick.  Just be yourself and honest. Dress professionally, all the normal interview etiquette applies!", "Interview Questions": "What is your 5 year plan/goals?\r\nHow do you handle stress?\r\nLots of situational questions\r\nSome medication questions\r\nSome vital questions\r\nSome discussion around your work habits"}, {"date": "16 Aug 2016", "title": "Medical Assistant II MARP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Palo Alto Medical Foundation (Mountain View, CA) in Aug 2016", "Interview Descriptions": "Sent resume and received a call the same day. Interviewed 2 days later. I Completed a form with my top 3 locations, then interviewed. After I was asked to stay to speak with HR where I was offered the position. \r\n\r\nMy advice is to come fully prepared to answer clinical questions and describe what you would do in different scenarios. Also, dress professional, there were 2 other applicants that were not invited to meet with HR and they were wearing colored jeans....", "Interview Questions": "What are your goals?"}, {"date": "1 Aug 2017", "title": "HCC Risk Adjustment Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Palo Alto Medical Foundation (Sunnyvale, CA) in Aug 2016", "Interview Descriptions": "Panel Interview and then follow up for job offer, once the offer was made I had a few days to decide on whether or not I wanted to accept the position", "Interview Questions": "Tell us something we don't know about you."}, {"date": "3 Jul 2016", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "Applied for the position through the online Sutter Health job site. The supervisor of the department called me for a phone screen first. Shortly after the phone screen, I was invited for a 1:1 with the supervisor. I was then invited for a second interview to meet upper management. The panel interview was in a conference room with upper management and the 2 lead physicians of the department. I was offered the position pending a full background check,medical clearance, and drug test.", "Interview Questions": "Why do you want to work in this department?\r\n\r\nWhat do you think your last manager would say about you?"}, {"date": "29 Jul 2016", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Jun 2016", "Interview Descriptions": "The interview process is great. The interviewers are often very friendly and are very good at making you feel at ease. The only drawback is how long it takes to get the interview in the first place.", "Interview Questions": "What is your greatest weakness?"}, {"date": "27 Jan 2016", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Palo Alto Medical Foundation (Mountain View, CA)", "Interview Descriptions": "Applied sometime in June 2015, didn't get a phone call for interview until October.  At that point, I forgot I even applied for the position, but I agreed to interview since I was interested.  The interview was three rounds, the longest 4 hours.  After the first interview, I didn't hear back for two weeks so I followed up myself.  They forgot who I was but since I expressed interest they scheduled me for more interviews.  It was easy- simply met with all providers in the department.  They asked questions such as \"why are you switching jobs, why are you interested in this company, what's your past experience, etc.\"  \n\nI was able to tour the department and get insight to the providers' schedules.  They were quite busy and jam packed with patients.  During the interview, one of the providers even expressed how she was stressed and overworked.\n\nThey offered me the job, but in the process they contacted my current employer even though I explicitly asked them not to do so.  They asked my current employer why I was leaving!  This put me in an uncomfortable situation since I hadn't told my employer I was job hunting.", "Interview Questions": "Why are you interested in this position?"}, {"date": "16 Dec 2020", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Feb 2016", "Interview Descriptions": "testing and then interview. testing was basic math and measurements ensuring you know how to do injections properly and adjust dosages.  You will not move on unless you pass a test. I then met with 3 supervisors and was shown around the unit", "Interview Questions": "3 attributes\na difficult time you have had with a patient"}, {"date": "14 Jan 2016", "title": "Float Pool Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA)", "Interview Descriptions": "It was an accelerated, straightforward, and clear process. It was evident that the current department manager sought to staff quickly, efficiently, and provide training (including preceptorship) for all aspects of the job to ensure everyone was ready to hit the ground running.", "Interview Questions": "I was asked about what my impression and understanding of how a float pool may function within a department."}, {"date": "26 Jan 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Palo Alto Medical Foundation (Sunnyvale, CA) in Jan 2016", "Interview Descriptions": "I was interview at the site, it seemed positive, then I never received a call back from anyone at all.  No email, no call, no notice that the position had been filled.", "Interview Questions": "It was conversational, asking about my experiences at the company."}], [{"date": "10 Oct 2017", "title": "PACU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Palo Alto Medical Foundation in Dec 2015", "Interview Descriptions": "Panel interview with manager and 3 friendly but forward staff nurses.  Asked direct questions and gave a good representation on what the job would entail.  Their questions were not designed to trip up the interviewee but rather to initiate a conversation.", "Interview Questions": "How to determine the need for Phase 1 or Phase 2 recovery."}, {"date": "16 Apr 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation (Burlingame, CA) in Jul 2015", "Interview Descriptions": "Had a preliminary phone interview and then was invited to meet with the hiring manager. The interview was one on one and consisted of basic interview questions, strengths/weaknesses, etc, plus some questions about certain clinical situations that might arise and how I would react to them.", "Interview Questions": "What would you do if a patient came in having a STEMI?"}, {"date": "23 Jun 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation (San Jose, CA)", "Interview Descriptions": "It was very professional from what I remember. I received a call from HR, then met with the manager of the clinic at the time, was given a tour of the clinic. I was then offered the job a few days later.", "Interview Questions": "How would you treat a patient that suddenly fell unconscious? "}, {"date": "5 Nov 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation (Santa Cruz, CA) in May 2015", "Interview Descriptions": "Very simple process, asked my why PAMF, what my goals with the company were and why I was changing careers.  We discussed the potential position, discussed the benefits package, and how my day to day reporting structure would look.", "Interview Questions": "Why PAMF?"}, {"date": "8 May 2015", "title": "Pateint Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Palo Alto Medical Foundation (Mountain View, CA) in May 2015", "Interview Descriptions": "I applied online,3 weeks later i  get a email from the office manager. I came in to the interview it went well really easy. 5 days later I get an email from the manager stating I will get a call from HR with a job offer. I'm still waiting for the call.", "Interview Questions": "Tell me about yourself?"}, {"date": "5 Apr 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Palo Alto Medical Foundation in Oct 2014", "Interview Descriptions": "Applied online, received a phone call for an interview the following week for an in-person interview. Met with clinical manager and PSR coordinator early in the morning. Long interview, but things went smoothly. Was given contingent offer the very same day.", "Interview Questions": "Why did you choose PAMF? What can you bring to the team? And a LOT of situation questions."}, {"date": "5 May 2014", "title": "Policy Creation Specialist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "Initial communications happened through the website and I ended up being pushed towards a position that didn't actually exist yet, but one they were trying to create in the department. First I was led through 2 phone interviews and then an in person after which I was offered the position.", "Interview Questions": "They asked for a writing sample. As I hadn't done any relevant writing up until then, this was hard to provide to them. "}, {"date": "21 Aug 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation (Mountain View, CA) in May 2014", "Interview Descriptions": "I was called for an interview a couple of weeks after applying.  There was a 45 minute interview with a senior research scientist and then I was called a few days later with an offer.", "Interview Questions": "The questions were not overly difficult, mainly about why I wanted this position and what drew me towards a career in health research"}, {"date": "25 Jun 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Palo Alto Medical Foundation (Redwood City, CA) in Feb 2014", "Interview Descriptions": "Toughest interview I've had to go through only because there were a lot of \"tell me about a time\" questions which definitely puts you on the spot. People who I interviewed with were very friendly and not intimidating.", "Interview Questions": "Tell me about yourself."}, {"date": "1 Mar 2016", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in Jan 2014", "Interview Descriptions": "You start the process by building your profile through their online portal, including work history, education history, cover letter, and resume.  Your CPR must be approved by the AHA! You first apply to the Medical Assistant Residency Program (MARP) which is a requirement prior to being hired into any position in the organization. They test, interview and hire in waves, so be prepared to stand out, especially as a new grad.  Be confident! Once you successfully complete and PASS the MARP program you are given 45 days to apply and be hired into one of their part time or full time medical assistant positions. If you are not already certified you will be required to obtain your certs within 1 year of your hire date. It does come with a pay increase as well.", "Interview Questions": "What are your goals?"}], [{"date": "26 Sept 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Palo Alto Medical Foundation (Sunnyvale, CA) in Sept 2013", "Interview Descriptions": "Walked into Human Resources Office on El Camino Real explained that I worked for Sutter in Sacramento and I relocated and was looking to work for PAMF. They were very accommodating. Took my information and a week later received a call for two difference PAMF medical centers.", "Interview Questions": "Tell us about yourself?"}, {"date": "20 Jul 2013", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation (San Jose, CA)", "Interview Descriptions": "take the clinical test, must pass 90%, pass the HR interview and pass the doctor's/ manager's interview", "Interview Questions": "basic interview, not so difficult"}, {"date": "20 Aug 2013", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Palo Alto Medical Foundation in Jul 2013", "Interview Descriptions": "I had an interview offer within a few days after applying for the position. In attendance of the interview were the regional manager and the treatment team who really wanted to find the best fit. I felt at ease and really enjoyed the interview process. I was given an opportunity to do a follow-up interview with the surgeon team and was shortly offered the position. I accepted and really look forward to being a part of the team.", "Interview Questions": "Please describe a stressful situation at your workplace and how you resolved it."}, {"date": "31 Jul 2013", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Palo Alto Medical Foundation in Jul 2013", "Interview Descriptions": "It was a wonderful interview process. The people there are all incredibly friendly. However, the interview was a bit stressful, given that it was a group interview. Yet, I felt like it went well and I would love to work there!", "Interview Questions": "Role Play"}, {"date": "28 Mar 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Palo Alto Medical Foundation (Palo Alto, CA) in May 2013", "Interview Descriptions": "one interview with 2 people, basic questions, then hr called with offer letter and i started the process. they worked with my schedule and it was very easy. overall it was smooth", "Interview Questions": "what are your strengths "}, {"date": "20 Aug 2015", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at The Palo Alto Medical Foundation (Dublin, CA) in Mar 2013", "Interview Descriptions": "Its more of who you know and not so much what you know. I had to submit the application on line then i had to email my resume then i had to do 2 interviews one with my current supervisor and then the actual office.", "Interview Questions": "What is your weakness?"}, {"date": "25 Feb 2013", "title": "Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Palo Alto Medical Foundation", "Interview Descriptions": "I applied on-line. I received a call from HR department. Came in for an interview with HR. Interviewed the same day with dept. manager.", "Interview Questions": "What are your work ethics ?"}, {"date": "26 Oct 2013", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Palo Alto Medical Foundation (Fremont, CA) in Jan 2013", "Interview Descriptions": "A very formal interview.", "Interview Questions": "Situational questions that you have to come up with on the spot."}, {"date": "25 May 2014", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Palo Alto Medical Foundation (Fremont, CA) in Jun 2012", "Interview Descriptions": "Applied through Indeed.com, contacted via phone for an in-person interview. Interview panel of two people, Supervisor of PSRs & HR, hiring process took about a month, orientation and training is held in Palo Alto and Mountain View.", "Interview Questions": "Explain your weaknesses"}, {"date": "28 Mar 2012", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at The Palo Alto Medical Foundation (Redwood City, CA) in Mar 2012", "Interview Descriptions": "The hiring process was a group/panel interview. There was a total of 3 candidates including myself that was going to get interviewed for the position. The location was on top of a Bank of America and everyone seemed to love AND enjoy their jobs. The two woman that I meet with were very friendly after asking the typical interview questions the Manager showed all three of us around the office. My advice is to be yourself and relate to the job and especially make a connection with the managers. The office was medium size built and everyone appeared to be happy at what they do.", "Interview Questions": "If you were to be an animal what would you be?"}], [{"date": "30 Sept 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at The Palo Alto Medical Foundation (Fremont, CA) in Nov 2011", "Interview Descriptions": "Phone interview was with Human resources, they provided me with all the information regarding the interview process. The manager I had my actual interview was very personable and kind so it made the interview less-nerve wrecking.", "Interview Questions": "Provide a scenario where you had to deal with an upset customer and how did you handle it."}, {"date": "14 Nov 2015", "title": "PBX Phone Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Palo Alto Medical Foundation (Sunnyvale, CA) in Apr 2011", "Interview Descriptions": "Started with a telephone interview.  Then went to in person interview and was hired.  The first person to interview me was the department manager and was extremely nice.  I felt that I was abel to give her a good idea of my skills and previous job experience.  My in person interview was with an HR person and they were business and easy to deal with.  I found the ease of application and interviews as well as paperwork to get started very streamlined and not difficult.  I had to watch a short video in HR as well as fill out paperwork.", "Interview Questions": "What kind of customer service skills do you have?"}, {"date": "26 Mar 2014", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Palo Alto Medical Foundation in Jan 2010", "Interview Descriptions": "Years ago, I had a great interview with recruitment and was poised to accept a job offer they had \"verbally\" given me. I followed up and never heard back.  No follow up on the part of the person who opened her mouth too soon and she was without enough integrity to let me know she made a mistake.", "Interview Questions": "N/A"}]]