[[{"date": "17 Oct 2022", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Washington Regional Medical Center", "Interview Descriptions": "One hour interview with the director, zoom interview or in person. Behavioral questions and talk about your work experience to see if being a case manager is something you want to do.", "Interview Questions": "Why do you want to work as a case manager?"}, {"date": "17 Sept 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Washington Regional Medical Center in Aug 2021", "Interview Descriptions": "panel interview for 30 mins, people introduced themselves first and then let you talk. Nice , friendly.  You get positive feedback when you have a good impression to them. Let you know the result the same day or two days later. Then schedule another video interview", "Interview Questions": "Tell me about you self\r\nTell me how you handle a difficult situation"}, {"date": "21 Feb 2021", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Aug 2020", "Interview Descriptions": "very nice, great interaction, I got asked a few behavioral interview questions and I got hired that same day! They were very friendly and I felt like they really wanted to get to know me and make sure I was a good fit for the company.", "Interview Questions": "- Why do you want to work on this floor?\n- what experience do you currently have?"}, {"date": "19 May 2019", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Washington Regional Medical Center", "Interview Descriptions": "One on one with the department director and one staff nurse. The interview was done in the director’s office. It was a very friendly and welcoming setting and tone of interview. They reviewed my resume together with me and then asked some questions. After the interview, there was a tour of the department. Overall it was very well done and I felt they were very professional.", "Interview Questions": "What strengths do you bring to the team?\r\n"}, {"date": "13 Feb 2022", "title": "Certied Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Washington Regional Medical Center in May 2019", "Interview Descriptions": "The interviews I have experienced at Washington Regional Medical Center have all been very similar! I recommend being prepared to discuss patient scenarios, ratios, and  your experience. In addition to my resume, I brought my portfolio to add to my answers.", "Interview Questions": "How will your care of patients differ from that of a different CNA? "}, {"date": "13 Jul 2018", "title": "Admission Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Washington Regional Medical Center", "Interview Descriptions": "I received a call to schedule an interview. The one negative experience I had was that I received an email saying the position was filled the following day and the original number used to offer me the interview never answered when I called to clarify.", "Interview Questions": "Why are you qualified for this job?"}, {"date": "18 Jun 2018", "title": "SNIP Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Washington Regional Medical Center (Fayetteville, AR)", "Interview Descriptions": "I was interviewed by 5 floor managers, each from a different floor. They were all very kind and made me feel comfortable. The enter view was quick and easy. Most of the time they just went around telling me about thier selves and what kind of parients thier floor gets.", "Interview Questions": "They only asked me to tell them about myself and where I was at in school. "}, {"date": "26 Sept 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Apr 2018", "Interview Descriptions": "I applied online and was quickly contacted by HR to schedule an interview. After the interview, I heard back within two weeks. The on boarding process was quick and easy!", "Interview Questions": "Name a time that you had to work as a team."}, {"date": "14 Oct 2016", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Washington Regional Medical Center", "Interview Descriptions": "I got a call from the department supervisor to set up an interview. The interview was in her office on the pediatric floor. She asked me basic interview questions and then took me on a tour of the pediatric and L&D floor. I was told that I would hear from HR about whether or not I got the job. A week and a half later I still hadn't heard back, so I called the department supervisor and was told that I got the job, HR was just doing the paperwork.", "Interview Questions": "Tell me about yourself. "}, {"date": "1 Nov 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Oct 2016", "Interview Descriptions": "Intimidating initially due to the panel interview set-up but the interviewees were really down to earth and the interview felt more like a conversation of friends meeting after not seeing each other for a while. I was able to articulate the knowledge, skills and abilities that I possess feeling secure that I was heard", "Interview Questions": "What and how have you dealt with a task that you were assigned that you were not quite sure of?"}], [{"date": "31 Jul 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Sept 2015", "Interview Descriptions": "I sat in a meeting with several nurses who asked me questions about my experience as a social worker. in a hospital setting    We sat in chairs in a circle.  The employees of the hospital took turns asking the questions.  The questions lacked detail and so did the description of my job.  I was not told the amount of work I would be responsible for when I asked this question.  I was not told what part of the hospital I would be assigned to or introduced to anyone of the social workers or RN case managers who work on the units.", "Interview Questions": "What experience do you have working in medical hospitals?\r\nWhat do you do to relax?\r\nWhat type of management style do you prefer?"}, {"date": "20 Aug 2015", "title": "Phleotomy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Sept 2014", "Interview Descriptions": "One on one interview. I was hired on the spot. It went well. My appointment was in the morning. We had conversations about what's going on at the hospital and a little bit personally. Why did I choose to apply at this job.", "Interview Questions": "Do you like phlebotomy? How long have you worked in this field? Are you a hard worker?"}, {"date": "2 Sept 2014", "title": "Business Administrative/Data Entry/Coder Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Washington Regional Medical Center in Nov 2013", "Interview Descriptions": "Group interview process at the time I was hired,usually decided upper management although sometimes co workers will be allowed  to sit in on interview. I believe current management does a skills test involving 10 key, typing & Microsoft Excel knowledge.", "Interview Questions": "N/A"}, {"date": "9 Oct 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Jan 2013", "Interview Descriptions": "Fast, internal review so I didn't have much to answer. Moved to an analyst position. They didn't ask much as they already knew me. I had been doing this job.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "22 Aug 2017", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Jan 2013", "Interview Descriptions": "The interview process was thorough and offered a tour of the facility and the department I was to work in. It really gave me good insight regarding the work environment and I believe it was a very detailed and thorough interview process.", "Interview Questions": "Tell us about your work history?"}, {"date": "26 Jul 2014", "title": "Admitting Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Sept 2012", "Interview Descriptions": "I applied for the position and received a call a week later. I had one interview with the Admitting Specialist Director that lasted around 30 minutes. The interview quetions \" What are your strenghts/weaknesses?\" \"Where do you see yourself in 5 years?\"", "Interview Questions": "What would you do if a patient is brought by ambulance with no name and no family is with him. What steps would you take?"}, {"date": "5 Aug 2015", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Washington Regional Medical Center (Fayetteville, AR) in Aug 2011", "Interview Descriptions": "The process was easy. It was a one on interview that was not very lenghty. Fairly easy, non challenging. I did get to tour the facility and was able to sk any question that I needed. There were several days tht went by efore I received a call back.", "Interview Questions": "Goals and expectations"}]]