[[{"date": "6 Jun 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "Very easy to interview. It was during covid so it was performed over the phone . The hr team was very helpful and information sent via email. Their response to my questions were prompt.", "Interview Questions": "Experience teaching in the area"}, {"date": "15 Apr 2023", "title": "Research Assisatant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "The interview process went pretty smoothly, and nothing was surprising about it. The PI asked questions about myself, my reasons for applying to the position, my skills, my relationship with my prior PIs, etc.", "Interview Questions": "Can you tell me a little bit about yourself? Why this lab? How was carrying your research project out in the previous institution? What statistical tools do you use, and what analyses can you plan, run, and interpret? Etc."}, {"date": "5 Nov 2022", "title": "Associate Dean Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Long Island University", "Interview Descriptions": "The interview process took a very long time, and when I finally got an offer it was for a different role. They don't have their act together and I got the feeling it was a very sad place", "Interview Questions": "Tell us about your experience working with students from low income families"}, {"date": "16 Sept 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "Very fair interview process - with extremely kind faculty. Met with all levels of the department before receiving final offer letter. Went through resume and then questions asked were straightforward.", "Interview Questions": "Tell me about your prior experience."}, {"date": "3 Aug 2022", "title": "Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Long Island University (New York, NY) in Jul 2022", "Interview Descriptions": "Applied through their website. Received a phone call for a screening to get to know me better. Was redirected (second round I guess) to higher ups at the location/department that was suited. Interviewed with two people who work directly with admissions. I was basically asked the same question in 20 different ways. To be honest, they are not looking for people who are pushing for admissions and want to see students thrive educationally. They are looking for sales-driven people who know how to trick people. Imagine that. Tricking students into coming to a school that could care less about their students. Read the student reviews on this school, people. One of the interviewers made the interview so difficult for no reason at all. With these types of people in charge, this school will never thrive. Ultimately, I was ghosted. I was never followed up with in regards to my interview. No email. No phone call.", "Interview Questions": "Do you feel comfortable making calls in regards to students’ progress in being admitted?\nWhat are the key takeaways from this interview? \nWhat brings you to higher education/admissions?\nWhat are some ways you completed outreach to the community? "}, {"date": "17 Nov 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "Phone screened with the HR representative who then set me up to be interviewed with the department I'd be working under. I was sent an offer letter within a weeks time. Was able to onboard in about 2 weeks. The entire process took about 3 weeks.", "Interview Questions": "Tell me about your previous experiences and how it relates to this position. "}, {"date": "5 Oct 2021", "title": "Account Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "the interviewer didn't know what I was applying for and didn't know my job description. They seemed very flustered and unprofessional.  we spent 10 minutes trying to find the correct job description I would not recommend.", "Interview Questions": "What are you applying for? "}, {"date": "18 May 2021", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "Applied through linkedin. I sent in full cv, cover letter and writing samples. I was asked to send in potential dates for interviews. I had a virtual panel interview. Was asked various questions and they asked me to explain some experiences displayed in my cv.", "Interview Questions": "why are you interested in this positioin"}, {"date": "20 Sept 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Long Island University (New York, NY) in Jan 2020", "Interview Descriptions": "It is smooth and good. They are very clear and precise about what questions they need to ask about the position. They also explained about the projects that I am going to work. Overall the interview was good.", "Interview Questions": "N/A"}, {"date": "5 Jun 2019", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Long Island University", "Interview Descriptions": "The marketing team is so desperate for employees that they will contact you on LinkedIn, unprompted, telling you that your credentials are impressive and they'd like to meet with you. That is literally how most of the team was hired - no one specifically applied, but had someone reach out to them requesting an interview.\r\n\r\nThey do a good job of making positions as this university seem almost too good to be true - because they are. They presented a picture perfect package of the marketing role, including the month of vacation time, benefits, and free education after two years of working there but failed to mention the actual realities of the position. The interview process was a phone interview, two in-person meetings, and a video session with the President of the university (which should have been a red flag). Nothing too difficult to handle, but please know that they were not being truthful or upfront about the position. I wish I had read Glassdoor before accepting this offer.", "Interview Questions": "What was your biggest professional accomplishment?"}], [{"date": "12 Jul 2017", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Long Island University (New York, NY)", "Interview Descriptions": "Overall interview process went well. It started with a phone interview and later an in-person interview. They wanted to know why I would make a good fit with the company and explained a lot of new changes heading their way.", "Interview Questions": "What are your strengths?"}, {"date": "20 Nov 2019", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Long Island University (New York, NY) in Mar 2017", "Interview Descriptions": "Long process with not much communication. Initially after my application I received an interest call then a month later a phone interview. After this another month and then a video conference doing a pitch about the university. Also an IQ test was required.", "Interview Questions": "Give a pitch about the university"}, {"date": "10 Sept 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Long Island University (Brooklyn, NY) in Nov 2016", "Interview Descriptions": "interview process was easy at first, but the hiring process took months it was a horrible experience. Interview was fairly easy not many questions. Asked basic question about job experience and why you would be a good fit for the position.", "Interview Questions": "why do you want to work at LIU"}, {"date": "5 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "Unqualified personnel sits with you for about five minutes and chats about life because it's that unprofessional. Some staff members are illeterate and lacking in mental capacity. I wish I was never hired in the first place.", "Interview Questions": "N/A"}, {"date": "10 Aug 2020", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Long Island University (Brooklyn, NY) in Jul 2016", "Interview Descriptions": "A couple of rounds.  HR followed by technical round. People were very professional and made me feel comfortable. People were very friendly and supportive. Respected interviewee's time and didn't make anyone wait.", "Interview Questions": "Which tools you work on?"}, {"date": "6 Mar 2018", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Long Island University (Brookville, Nassau, NY) in Jun 2016", "Interview Descriptions": "I was a interviewed fairly quickly. The decision-making process was the longest, being held up by the HR department. They changed the position from Sr. Administrative Assistant to Administrative Assistant and dropped the salary down $5000.", "Interview Questions": "What are your strengths and weaknesses? Give an example of when you handle=d a difficult situation."}, {"date": "12 Feb 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Long Island University", "Interview Descriptions": "NO interview conducted, because the entire hiring is based on student's GPA and academic performance. once you get good GPA you will be automatically considered for the position. but, for tutor positions, you got to do interviews.", "Interview Questions": "N/A"}, {"date": "13 Dec 2015", "title": "University Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Long Island University (Brooklyn, NY)", "Interview Descriptions": "After waiting for the interviewer for about 30 minutes,  I was interviewed for about 30 minutes. The student who serving as a receptionist had no idea where the administrator was.   He seemed to have forgotten that we had an appointment.   Once we got started,  he was very nice and non-chalant.", "Interview Questions": "How long I had been in the field."}, {"date": "14 Aug 2016", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Long Island University (Old Brookville, NY) in Oct 2015", "Interview Descriptions": "Very nice, short and informal interview process.\r\nThe interviewer was very comfortable to talk to.\r\nThe interviewer did not ask any hard questions, just very basic ones. Did not ask anything about strengths/ weaknesses.\r\nA huge plus if you already know someone that can recommend you for the job.", "Interview Questions": "Are you used to working in a hectic work environment?\r\nHow many hours a week can you work?"}, {"date": "6 Sept 2015", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Long Island University", "Interview Descriptions": "I wasn't asked any questions and was immediately hired..This is largely because the program I was in was so desperate to hire graduate students than professors so that they can save money, that the position was basically HANDED to me. Nothing about my actual skills were asked.", "Interview Questions": "Why do you want to go here?"}], [{"date": "29 Nov 2016", "title": "Practor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Long Island University (Brooklyn, NY) in Jan 2015", "Interview Descriptions": "Very easy going. Handing my CV and answering few questions. After few days I received a call for the second interview.After second interview the director of testing center approved my employment to start working in a week", "Interview Questions": "Are you comfortable giving speech for a big group?"}, {"date": "16 Sept 2014", "title": "Audio Visual Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Long Island University", "Interview Descriptions": "Typical normal question best trait worst how do you handle stress have you ever used a mixer mic do you have a clean driving record desired salary wiling to work overtime", "Interview Questions": "how do you wrap a mic cable"}, {"date": "6 May 2014", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Long Island University", "Interview Descriptions": "Hiring and interview process is straightforward. Staff will review skills and techniques as well as the safety measures and precautions looked at a laboratory setting", "Interview Questions": "Expect questions regarding incompatibilities and incompatibilities of chemicals "}, {"date": "27 Feb 2014", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Long Island University (Brookville, Nassau, NY)", "Interview Descriptions": "Was interviewed by one person--this person knew me--so I was hired on the spot without a formal interview process---of course, this took place over 10 years ago.  That's not the hiring practice now.  Now, there is a strict formal interview process that HR oversees and no one gets hired without a thorough screening.", "Interview Questions": "The most unexpected question was, how soon can you start?"}, {"date": "15 Nov 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Long Island University (Greenvale, NY) in Jan 2013", "Interview Descriptions": "Met with key leadership and peers; they were all very nice and seemed very dedicated to the university. Once the new president came in nearly all were eliminated, but not because they didn't know what they were doing.", "Interview Questions": "Experience and strengths"}, {"date": "12 Mar 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Long Island University (Greenvale, NY) in Aug 2012", "Interview Descriptions": "I was contacted by the professor running the program for the semester and was asked about my prior tutoring experience. It was a short process, and after a review of my past tutoring, my education, and my new class load as a graduate student, I was hired.", "Interview Questions": "How many credits are you taking this semester?"}, {"date": "15 Dec 2015", "title": "Educational Coordinator Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Long Island University (Brooklyn, NY) in Jan 2012", "Interview Descriptions": "They asked to look at my resume and cover letter. I was asked a series of questions, had to o a senerio write up and had to do and intense back-round check", "Interview Questions": "How can we best utilize your skills?"}, {"date": "9 Jan 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Long Island University (Brooklyn, NY) in Jan 2012", "Interview Descriptions": "The chair contacted my current department about an opening they needed filled. I sent him a resume and cover letter, then the next week met in person and had a brief conversation with him. No teaching demonstration was required.", "Interview Questions": "Have you worked with diverse populations of students?"}, {"date": "12 Apr 2011", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Long Island University (Brooklyn, NY) in Apr 2011", "Interview Descriptions": "I was recently contacted by LIU-School of Business for an interview for the Secretary IV position.  The interview went well, and the atmosphere was very pleasant.  The first interview was a group interview, and although this was my first time in a group interview setting, I found it to be very comfortable and informative.  The second interview was with the Dean of the Department and it as well was pleasant, the questions asked were your typical interview questions, and the dialogue between myself and the interviewers was great.  I haven't heard from them regarding the position as of yet, I was told within in the next week, I really hope that I nailed it and receive an offer, it is the perfect position for me, and in a University setting, which is what I have been looking for for quite some time.", "Interview Questions": "How will this position prepare you for your long term goals?"}, {"date": "21 Jun 2015", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Long Island University (Brooklyn, NY) in Feb 2011", "Interview Descriptions": "Had a contract job at the division of the IT department. And applied for a full time job as one became available. That may be the reason why the process was simple. I was interviewed by the lead engineer and head of IT department.", "Interview Questions": "Just regular questions about relational databases, ERP and C# programming."}], [{"date": "26 Oct 2011", "title": "Director of Campus Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Long Island University (Greenvale, NY) in Jun 2010", "Interview Descriptions": "Getting the interview was a straightforward process. I simply e-mailed my resume to the designated e-mail address on the Job Posting. I was called for an Interview within a few days. The Interview consisted mainly of the typical questions. \"How would you handle a difficult employee?\" \"What are your biggest Strengths/Weaknesses?\" After the Interview, I was told that I would receive a call in a few days.", "Interview Questions": "What are your biggest strengths & weaknesses?"}, {"date": "8 Apr 2014", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Long Island University (Brooklyn, NY) in May 2010", "Interview Descriptions": "Interviewed with three members of current department  including director and academic coordinator", "Interview Questions": "How do my  plans for next five years work with mission of HEOP?"}, {"date": "26 May 2011", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Long Island University (White Plains, NY) in Apr 2010", "Interview Descriptions": "The interview process was a week long. It consisted of various presentations on topics that were assigned. It also consisted of a group and individual interview. It was a very tedious process but well worth it. I simply was honest and respectful yet assertive.", "Interview Questions": "How do you perceive diversity on this campus?"}, {"date": "10 Feb 2010", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Long Island University (Brooklyn, NY) in Oct 2009", "Interview Descriptions": "Great interview experience. First you get an phone screening which is almost like a real interview. If you succeed you get invited to an interview with 3 different people from the department. Fill out the application, sign consent for background check. A personality test assessment will be given as well.", "Interview Questions": "What personal qualities can you bring to the table as an admissions counselor. very average question."}, {"date": "23 Dec 2013", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Long Island University (Brooklyn, NY) in Feb 2009", "Interview Descriptions": "Opening through temp agelncy", "Interview Questions": "N/A"}]]