[[{"date": "5 Jun 2023", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University (Richmond, VA)", "Interview Descriptions": "It was a very straight forward interview. I heard back with an offer within a week. They noted it was nice to see a grad student dressed professionally for the interview process, so apparently that made me stand out from others who treated it too casually.", "Interview Questions": "They asked a good bit about customer service skills (helping other students) and relevant experience. One question that stood out to me was \"How do you handle stressful situations and days with heavy workloads?\""}, {"date": "1 Jun 2023", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University (Richmond, VA)", "Interview Descriptions": "One interview after cover letter submission. Did not advance to further rounds, but it is likely they picked a candidate after the first round of interviews. Multiple people involved in an interview via Zoom.", "Interview Questions": "Can you tell me about yourself and your story?"}, {"date": "8 May 2023", "title": "Imaging Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University (Richmond Heights, VA)", "Interview Descriptions": "Pretty basic, run of the mill interview. Not real fond of the people doing interviews. Very rude and stuck up. I can understand why they have such a shortage of technologists", "Interview Questions": "Name a situation with a coworker that was stressful"}, {"date": "3 May 2023", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University (Richmond, VA)", "Interview Descriptions": "Easy flexible interview process one on one with two different managers. Managers were very friendly and described the job and work tasks. I was offered the job the next day.", "Interview Questions": "Basic questions about previous work experience"}, {"date": "9 Feb 2023", "title": "Computational Biologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Friendly interviewer. Was asked more classic interview questions as opposed to technical questions. Interviewer explained their expectations well, and mentioned their goals for the position. Interview hinted at working overtime.", "Interview Questions": "How do you like to work?"}, {"date": "2 May 2023", "title": "Director Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Feb 2023", "Interview Descriptions": "Got through the initial Zoom panel interview and was invited to the half-day in-person interview, but I was called by another candidate's name in an email and they confused my meeting time with yet another candidate's, and couldn't understand that I wasn't available on the day she wanted me to visit. She offered me three dates, I pick one , she agrees and two days later, \"Sorry, that is no longer available\". Could I come in on yet another day? I explain that I can't visit on her chosen date and provide her with no less than five other dates that would work for me. Crickets. She GHOSTED me because higher ed requires that you meet in-person with no less than 10 people and \"herding those cats\" to be in the same place at the same time is difficult (I know, I used to do it, and do it well). Why don't employers write you to tell you that they are pursing other candidates and at least tell you that you aren't in the running any longer??", "Interview Questions": "What experience have you had with student success?"}, {"date": "22 Mar 2023", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University in Jan 2023", "Interview Descriptions": "2 round interviews essentially with scenario questions. The first round is more general questions while the second is deeper. Lots of what would you do in this situation type of questions", "Interview Questions": "how will you implement diversity equity and inclusion"}, {"date": "28 Dec 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "I had two interviews one by phone and one by zoom. Everyone was kind. I was told would be told the status in two weeks. However I never heard back regarding the position.", "Interview Questions": "Tell me about yourself and background."}, {"date": "13 Dec 2022", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "The MMI style can be relaxed and is very fair. Obviously, brush up on your ethics, and make sure you you are confident in your answers. The rest stations are great for relaxing in between questions.", "Interview Questions": "The obvious why medicine. But this question is allotted a longer time than the other questions."}, {"date": "18 Jan 2023", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Dec 2022", "Interview Descriptions": "I applied online and received a callback from a recruiter a few days later for the Talent Strategy Coordinator role. I did the phone screen with her, and it was amazing. She even told me what type of questions to expect. She passed me along to the hiring manager, and the hiring manager was kind and very responsive, and I had an interview two weeks later due to the Christmas break. She sent me an invite for an hour-long interview, but it was only twenty minutes. She seemed rude and cold and it was not the demeanor I expected. She also cut me off and rushed me to respond to answer questions to the point that I said \"I need to think\" if I didn't open my mouth after one second. She said she would get back to me by mid-next week and never did. I checked my application status online and it wasn't touched at all. It has been a week after the time she said she would get back to me, and I withdrew my application.", "Interview Questions": "What do you know about VCU HR and VCU?"}], [{"date": "14 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "good overall. Asked few questions regarding research and teaching experience and approved my scholarship following the conclusion of the interview. Highly recommend reaching out to advisors through email. Thank you", "Interview Questions": "What is your research experience"}, {"date": "18 Aug 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Spoke with researcher and colleagues. Talked about research program, pros and cons. Short term and long term positions in the department.  Reviewed clinical and laboratory research. Discussed publications and goals.", "Interview Questions": "Background, interests, and  long-term career goals "}, {"date": "12 Aug 2022", "title": "Dental Hygienist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "It was a very thorough interview with thought provoking questions that were fair yet challenging. It is a great school and company to work with. I enjoyed the interview process here", "Interview Questions": "What unique quality can you bring to our program"}, {"date": "14 Jul 2022", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Brief phone interview to discuss the position and confirm interest. \r\nInterview with management in person. Standard questions. Where do you see yourself in five years? What are your strengths? What are you weaknesses? The usual. \r\nInterview with HR to finalize details.", "Interview Questions": "Describe a time you faced conflict and how you handled the situation. "}, {"date": "15 May 2022", "title": "Business Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Filled out an app online, someone reach out to set an interview \r\nInterview with a panel if 5 people with a rotation if questiob\r\nOffered job neg pay and then \r\nStarted within 30 days", "Interview Questions": "Tell us about a time questions"}, {"date": "4 May 2022", "title": "Intervention Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "The interview process was very personal. Laidback individuals asking you real questions. Translating your prior work duties and or experience to what is being asked of you is helpful when interviewing.", "Interview Questions": "What is your experience working with underserved communities?"}, {"date": "31 Mar 2022", "title": "Digital Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "very easy and i felt very supported by everyone during the process. It was a nice process and I felt like they answered any questions I may have had at the time", "Interview Questions": "1. tell us more about your previous work environment "}, {"date": "26 Mar 2022", "title": "Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "It was great, provided a lot of information and was helpful in understanding the work process for VCU. I would definitely recommend working at this university and would continue to advocate for them", "Interview Questions": "Why did you decided to apply here?"}, {"date": "21 Mar 2022", "title": "Job Captain Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Very easy interview and it was great to talk to them about the position and benefit opportunities. They offered me the job but I had to decline because another place offered more money.", "Interview Questions": "Why do you want this job?"}, {"date": "11 Mar 2022", "title": "Communications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Really negative experience and I'll probably never apply to a VCU job again. I was ghosted after being personally invited to apply to the position. \r\n\r\nI had a first round interview and was told I'd hear about next steps in a week. I've sent several emails requesting a status update that have all gone unanswered.\r\n\r\nI don't mind that I didn't get the role. But some courtesy in sharing a documented rejection goes a long way. If you look through some of these reviews, you'll see this behavior is becoming common for VCU. It's a poor practice.\r\n\r\nIt's been four months and I still haven't received any notice. I found out that someone was hired after seeing their contact information listed on the department's website.", "Interview Questions": "Share an example of a communications strategy you've developed."}], [{"date": "10 Feb 2022", "title": "Graduate Assistant for Marketing & Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "I attended one in-person , on-site interview with two different department coordinators at once. They asked standard design & marketing questions and asked for presentation of work in my portfolio.", "Interview Questions": "Explain design decisions behind the work on your portfolio."}, {"date": "20 May 2022", "title": "Communications Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in Feb 2022", "Interview Descriptions": "Over 3 rounds with staff and leaders along with exercises to demonstrate expertise. Made it to the final round where they eventually selected someone with a more academic background. Wasted my time and strung me all along when they already had a candidate in mind. The exercises take time for a position which you will not get.", "Interview Questions": "Describe a past experience where you dealt with difficult communications for a senior leader."}, {"date": "15 Apr 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Commonwealth University in Feb 2022", "Interview Descriptions": "A telephone interview served as the initial screening call. It was followed by multiple Zoom interviews.  Each one was fabulous with the interviews each stating, “you had rave reviews from the previous interviewer”", "Interview Questions": "Would I drop my minimum salary requirement ($60k)?"}, {"date": "28 Jan 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Talk for 30 minutes, and send me the email about the requirement, then  introduce about the salary and benefits, and then HR will help you with the registration process. Then everything is done", "Interview Questions": "Would you like to be a TA"}, {"date": "17 Feb 2022", "title": "Assistant Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Commonwealth University in Dec 2021", "Interview Descriptions": "The interview went well (I thought) in late 2021, just before the holidays.  I was told I'd hear back given the urgency for filling the position.  The position was filled with an internal candidate in January 2022, which is OK. Sadly, I was ghosted.  I found out on my own by visiting the VCU department staff website. VCU appears to be a great place to work but experiences like this one may not help give a good impression to prospective applicants.  I truly hope that VCU makes an effort to train hiring committees to follow through  with interviewed candidates with a courtesy notification that the candidate was not hired.", "Interview Questions": "Many questions focused on the use of data for decision making."}, {"date": "16 Oct 2021", "title": "Doctoral Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "one on one  interview with one profesor whhere they asked a series of questions about myself, my background, education, experience. things like what brought me to OT and more and why i want to be an OT and what my goals are", "Interview Questions": "why i chose a doctorate program "}, {"date": "29 Sept 2021", "title": "CRA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "2 interviews. One with direct management and one with PI. They ask questions directly pertaining to your resume. It was not too difficult. They usually make you come in for two interviews which is not bad but not necessary in my opinion.", "Interview Questions": "What is your biggest professional challenge "}, {"date": "27 Sept 2021", "title": "MD-PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "The interview process was great-- they're very accommodating and answer any questions you have. Be prepared to talk about research experience and meet lots of people! It's a long two days because you do the MD interviews separately, but overall it gives you a great feel for the school.", "Interview Questions": "Research experience and projects that you've worked on"}, {"date": "24 Sept 2021", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "A fairly average difficulty teleconference, very personable. I had to follow up a week or so later because they were in a busy season but it was wonderful overall. Very happy after this interview", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "14 Sept 2021", "title": "Phlebotomy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Zoom interview with two department heads, both asking a series of questions. The one lady looked completely uninterested with the interview, which made me even more nervous. She never once cracked a smile, the second lady was very friendly and welcoming", "Interview Questions": "How many sticks have I done within my time of being a Phlebotomist ? "}], [{"date": "9 Jul 2022", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Aug 2021", "Interview Descriptions": "Very Easy Interview Process. Applied through Handshake and got a response within a week. The key is to apply right before the semester. The middle of August is the best time to apply for a work study position.", "Interview Questions": "1. Tell me about a time you were faced with a challenge and what you did to overcome it."}, {"date": "8 Jun 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Twenty minutes on Zoom with four people. It began without any additional information about the job - making it difficult to frame answers - and felt incredibly rushed. I got approximately 3 minutes to ask one question.", "Interview Questions": "specifics about experience with marketing plans "}, {"date": "6 May 2021", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Very welcoming and easy to talk to the interviewers. Felt prepared and confident based on grad program and practice beforehand. Researching the university helped me get a grasp on the kinds of questions they might ask.", "Interview Questions": "Tell me a bit about yourself."}, {"date": "14 Apr 2021", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Very professional and excellent follow up.  Everything went as scheduled.  Very pleasant recruiter.  Made me want to be employed there.     Excellent benefits and covid responsible.  Hopefully, someday I will be.", "Interview Questions": "N/A"}, {"date": "6 Apr 2021", "title": "PhD Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Normal. Meet with current students and had lunch. Got to meet with professors as well. Student's seemed very relatable and normal and didn't seem like there was any negative type of competition.", "Interview Questions": "What type of research I am interested in. "}, {"date": "11 May 2021", "title": "Mail Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Virginia Commonwealth University in Mar 2021", "Interview Descriptions": "Online process, concise and casual. The process is pretty much tailored to students. I would just make sure you dress appropriately and have basic answers prepared for the interview questions.", "Interview Questions": "What experience do you have with diversity and inclusion?"}, {"date": "28 Feb 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "1:1 interview with faculty member. Very straightforward, It pertain to my academic experience My technical ability and a few questions about my hours. The faculty member that I interviewed with was very laid-back and straightforward with respect to the job that I would be performing.", "Interview Questions": "Why are you interested in this job?"}, {"date": "8 Dec 2020", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "It was very interesting and the people who interviewed me were very nice. They asked simple questions and only lasted about 10-15 minutes. You are asked to be sent into a room where you sit in front of two of the hiring managers. Overall, it was a great experience.", "Interview Questions": "Name a time you've helped someone"}, {"date": "25 Nov 2020", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "first is conversation about background information including the research you've done, introduction of the position an the project; then a phone interview with behavioral questions; finally an presentation and meeting with members of team", "Interview Questions": "How do you coach an undergraduate student in the lab?"}, {"date": "9 Apr 2021", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2020", "Interview Descriptions": "Everyone was super friendly and collaborative.  I interviewed with six faculty members in different fields and at different levels. I researched each person before interviewing with them and prepared questions ahead of time. I mostly had conversations with faculty versus being drilled with scientific or classic interview questions.", "Interview Questions": "Research experience in my doctoral work. "}], [{"date": "6 Aug 2020", "title": "Assistant Resident Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "I had two online interviews. Both were on zoom. First one being a voice call and the second one being a video call. Both interviews had 2 people from the Housing Office interviewing you.", "Interview Questions": "What experience do you have dealing with diverse communities?"}, {"date": "15 Jul 2020", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "The interview had three rounds. The first round was a phone screening with the department's HR manager, the hiring manager, and another committee member. The second round was an interview with the full committee. The third round was with a senior level manager.\r\n\r\nThe interviews went very well and because they were hiring 3 people, I anticipated that I had a good chance when I made it to the final round. They told me they hired someone else (singular), but urged me to check back with them as they were hoping to add more people in the future. It was a strange response.", "Interview Questions": "How would you work with a faculty member that was resistant to teaching online?"}, {"date": "10 Jul 2023", "title": "Junior A/V Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2020", "Interview Descriptions": "An about hour long interview with two managers. Follows the Virginia state structure for the interview. Some personality questions followed by some pretty simple technical questions. Managers asked alternating questions.", "Interview Questions": "Identify common A/V type cables and their purposes."}, {"date": "24 Jun 2020", "title": "IT Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jun 2020", "Interview Descriptions": "I was interviewed by two RN’s who basically ask only ask one questions. One question was “tell me about yourself” and that’s it. They did not make any effort to ask any additional questions. One of them mention they had just gotten my resume 20 minutes before the interview. I don’t think they we’re too interest in doing their job or me.", "Interview Questions": "Tell me about yourself ..."}, {"date": "17 Jul 2022", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Feb 2020", "Interview Descriptions": "was very easy. asked basic questions. It was about an hour. very friendly staff. gave offer the same day. Accepted it. was very easy. asked basic questions. It was about an hour. very friendly staff. gave offer the same day. Accepted it.", "Interview Questions": "Explain about Software life Cycle?"}, {"date": "13 Jan 2020", "title": "Disability Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA)", "Interview Descriptions": "Only in-person interview, offered no travel reimbursement . A few 1:1 interviews and a few panel interviews. Communication throughout the hiring process was lacking. Not much communication after in person interview", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "21 May 2021", "title": "Clinical Research Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jan 2020", "Interview Descriptions": "There was several managers on Zoom who sat down and spoke with me and asked several different questions. They don't necessarily dig into specific questions, its kind of like they just want to know if you are a likable person, driven, and willing to learn.", "Interview Questions": "How do you manage multiple projects at once?"}, {"date": "20 Dec 2019", "title": "Finance Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2019", "Interview Descriptions": "Recruiter reached out on Linked In. We emailed back and forth a few times. Then, held a phone screen  interview.  Search committee reviewed submitted resumes. Resulted in an in-person panel interview a few weeks later.", "Interview Questions": "Tell us a time you created a diverse and inclusive team"}, {"date": "17 Sept 2019", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "The video panel interview seemed like they brought a bunch of random people to interview who didn't know much about the position. One of the interviewers was texting on her phone the whole time. Was told I'd hear back the following week either way. I've reached out to two different people involved in the process for a follow up and have not heard back about anything. The interview was almost two months ago. Very unimpressed with the unprofessionalism both in the interview and since.", "Interview Questions": "What does diversity mean to you?"}, {"date": "19 Mar 2021", "title": "Student Engagement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Virginia Commonwealth University (Richmond, VA) in Sept 2019", "Interview Descriptions": "Very comfortable and intimate discussion centered around personal development, undergraduate leadership, and opportunities at VCU. I was posed a series of questions centered around my personal and academic interests and how these things relate to my interest in becoming a part of the VCU REAL Team.", "Interview Questions": "How and why do you resonate with the vision of the REAL Initiative?"}], [{"date": "19 Aug 2019", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Commonwealth University in Aug 2019", "Interview Descriptions": "I applied online and was contacted for an interview two weeks later. The interview was very easy and pleasant, and I was basically offered the job in the middle of it. I received an official offer letter two hours later.", "Interview Questions": "Do you have any experience working with students?"}, {"date": "25 Jul 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Took a while, but it a formal and professional, multi-stage process with a search committee. My on campus-interview involved a presentation of a case that was given to me. Everyone was wonderful and welcoming!", "Interview Questions": "case; various behavioral questions & getting-to know your interests and expertise in more detail. "}, {"date": "24 May 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "After I applied the hiring manager emailed me to schedule an in person interview and gave me a few dates and time to pick from. Had one short and easy  in person interview, they emailed me within the next few days off offering me the job.", "Interview Questions": "Tell me about yourself"}, {"date": "3 Mar 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Feb 2019", "Interview Descriptions": "Interviewer was very easy going and asked the typical questions. Overall, the interview took 30 minutes where the interviewer described what she did and the asked questions about how I would be able to contribute to her work.", "Interview Questions": "where do you see yourself in the long-term"}, {"date": "9 Feb 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jan 2019", "Interview Descriptions": "Everyone was warm and friendly. The interview itself was very standardized. I had a panel of 3 interviewers in the first interview, then met with the department chair and interim dean.", "Interview Questions": "Be ready to discuss your thoughts and experiences with DEI in the classrooms and review their Mission, Vision, and Values"}, {"date": "15 Nov 2020", "title": "Visual Media Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2018", "Interview Descriptions": "You met with three supervisors, one being your direct manager. Asked about why you were interested in the position, how you came to find it, as well as familiarity with the gym. Then asked about proficiency with different Adobe programs and your experience with them, or in previous positions.", "Interview Questions": "Q: What is your proficiency with Adobe [Photoshop, Illustrator, Indesign, Lightroom]?\nQ: What interested you in this position?"}, {"date": "22 Sept 2018", "title": "Information Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "It was pretty relaxed.  Just sat down with one of the supervisors and another Information associate while they asked questions had a friendly chat.  They were transparent with what the job would entail and what to expect.", "Interview Questions": "Why did you apply for the position?"}, {"date": "7 Aug 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA)", "Interview Descriptions": "I was referred directly to the position by a former professor. After reaching out via email I was referred to the formal application process and heard back within a week.", "Interview Questions": "Why VCU?"}, {"date": "4 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University in Jun 2018", "Interview Descriptions": "Applied online through VCU's job portal. Received an email to come in for an interview. Interviewed with Principal Investigator and Office Manager. The process took about a month. I received an offer after references were checked.", "Interview Questions": "How do you manage multiple deadlines? "}, {"date": "28 Feb 2019", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in May 2018", "Interview Descriptions": "I was called to schedule a phone interview  1 month and 10 days after I submitted my application for the job. The phone interview was about 25 minutes. I was on a speaker the search committee (4-5 individuals) asked me questions. A few days later I was offered an on-campus interview.  My on-campus interview was about 4 hours long. I met with the search committee, my department, and my supervisor (1-on-1) and then I had to present for 30 minutes on a topic that was provided to me.", "Interview Questions": "Describe a time where you had to manage multiple projects at a time."}], [{"date": "30 Apr 2019", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University in Apr 2018", "Interview Descriptions": "It was with my supervisor on Skype. It was a friendly conversation  and he asked me about my experimental skills for conducting research in the lab. He explained the facilities in his lab and his research. He asked me how much my knowledge can help their research.", "Interview Questions": "What was your previous experience in working with materials characterization?"}, {"date": "27 Sept 2019", "title": "College Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Apr 2018", "Interview Descriptions": "Good interview and had alot of fun and they really helped me understand what the college was like and it helped me get a better idea.nice nice nice nice nice nice nice nice nice nice nice nice nice nice nice nice nice", "Interview Questions": "Describe a time where you had to face difficulties?"}, {"date": "13 Feb 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "I met up with the Social Media Strategist, Megan Schmidt, at Barns and Nobles right behind the office. She asked to see my website, which contains most of my design projects. We talked about my strength and weakness. It was casual. She was very friendly and showed interests in the things I have to say about my work.", "Interview Questions": "How do you deal with multiple projects at the same time?"}, {"date": "26 Jan 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "The interview will depend entirely on your GPA and how well you did in the professor's class. The interview only took a few minutes. It is important to get it on paper that you are applying for an internship, my supervisor tried to change 6 months of internship work into 6 months of volunteering work (internships are required for graduation and he knew it).", "Interview Questions": "What were you grades in my class?"}, {"date": "2 Jan 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Was brought into the office of the Tutoring Coordinator. Very informal and relaxed, which was nice. This was not my first interview, but as I understand it was a lot of others first interviews, so this was a great thing to have going for them. She asked me some typical interview questions, then moved on to describing me the job.", "Interview Questions": "What was a problem you had to overcome?"}, {"date": "29 Jun 2018", "title": "HR Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Dec 2017", "Interview Descriptions": "I applied for the job at the end of October and got called in for an interview in December.  The interview was pleasant, it was a group interview with a couple members apart of the HR team. The questions were basic and the flow of the interview was smooth.", "Interview Questions": "What is your greatest strength?  A weakness that you want to change/ improve? What type of ATS did I use during my previous employment? "}, {"date": "23 Jul 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2017", "Interview Descriptions": "Pretty straight forward, however more rounds than necessary. The questions were as expected and engaging. They look more into how you are as a person more than your qualifications. There were multiple rounds and you would be interviewed at the same time as many others. Best piece of advise would be to not pay attention to the other interviews and to focus on yours.", "Interview Questions": "My experience with working with different cultures. "}, {"date": "27 Sept 2017", "title": "Assistant Director of Payables Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Commonwealth University (Richmond, VA) in Sept 2017", "Interview Descriptions": "The interview process was very smooth with very pointed questions to weed out qualifications.  There was a lot of information about the position and how my skills would fit in. A lot of detail of the type of work was given as well.", "Interview Questions": "Could I easily transition to this role? "}, {"date": "12 Aug 2017", "title": "Communications Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Very casual and conversational, my manager asked about my past experiences before I realized he was actually interviewing me. He asked about my relevant skills and level of comfort using those programs, my work process and style, asked about understanding or capabilities to help out in other areas.", "Interview Questions": "How do you think you can grow this department?"}, {"date": "22 Mar 2021", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2017", "Interview Descriptions": "The process is typical of a university setting. First there was a phone screening of 30 minutes with a panel of 4 people. Next, there was an in-person interview with a panel of the same 4 people. Finally, there was a 1:1 interview in-person with the supervisor.", "Interview Questions": "They asked about my philosophy of counseling with students, especially a diverse student body. "}], [{"date": "5 Dec 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2017", "Interview Descriptions": "Interview process was easy. I exchanged several emails with the hiring manager and we met a few times as well. I was actually a little surprised at how little rigor is putting into hiring adjunct professors. I'll have to think about this when I send my kids off to university.", "Interview Questions": "Tell me about your professional experience."}, {"date": "14 Aug 2017", "title": "Multimedia Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2017", "Interview Descriptions": "Very simple. I submitted an application online to the Department of Alumni Relations and about a week later I received an e-mail inviting me to the interview. The interview itself was very comfortable and relaxed, the interviewers were friendly and weren't intimidating. I was asked to film a brief mock interview with a 'VCU alumnus' (really just one of the interviewers) which was very quick and simple. They then took me around the office to meet everyone else there, which falsely led me to believe I was going to be offered the job. About a week later I received an e-mail telling me another candidate had been chosen. I suspect that as with many schools and universities in the end they may have just hired someone internally.", "Interview Questions": "Tell us 3 positive things and 3 negative things your previous co-workers would say about you."}, {"date": "11 Apr 2018", "title": "Junior Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2017", "Interview Descriptions": "I met with the immediate supervisor of the provision and showed him my portfolio documents. We talked through the day to day responsibilities of the job and he let me know that he would make a decision by the end of the week. He was a very prompt and efficient interviewer", "Interview Questions": "Tell me about your workflow in creating a publication/document. "}, {"date": "6 Jun 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "panel interview multiple hours.  Interviewed by multiple professions.  Went on multiple interviews. and and and and and and the interview process was long and this is annoying me", "Interview Questions": "I do not remember"}, {"date": "27 Apr 2017", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Fairly straight forward. Interviewed via Skype. The RN Manager was easy to talk with, great conversation, asked lots of questions. She asked about nursing behavioral questions and then gave clinical scenarios afterwards", "Interview Questions": "Tell us about a time when you had a difficult patient and you weren't able to get through to them. How did you handle that? Tell us about a time where you provided excellent customer service?"}, {"date": "9 Jun 2017", "title": "Ra Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Feb 2017", "Interview Descriptions": "First had an interview with two current RAs then group interview where leadership and teamwork abilities were tested where we were given scenarios and various arising conflicts, and had to create a program with random items", "Interview Questions": "How would you describe community"}, {"date": "10 Jul 2018", "title": "Contract Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Feb 2017", "Interview Descriptions": "HR person emailed me to set up an interview,  I scheduled the interview for a week later.  HR advised it would be a panel of three with behavioral  interview questions..", "Interview Questions": "Give me a time when you had to work with a difficult employee, and how did you handle it?"}, {"date": "29 Apr 2017", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jan 2017", "Interview Descriptions": "When you arrive, you will meet your selection board (usually two or three people, including the supervisor of the position and a representative of Human Resources). The team leader will tell you what to expect, and will explain that the board will be recording your answers for later review. Don't let this recording process distract you—it’s a normal part of the interview and necessary to make a complete assessment later on.", "Interview Questions": "The board will then begin asking you a series of questions to assess your knowledge, abilities and personal suitability. These may include:\r\n\r\n    Closed questions that demonstrate your knowledge by requiring a specific factual answer.\r\n    Open-ended questions that are broader in scope and require you to work through the answer.\r\n    Situational questions that describe a hypothetical situation and ask how you would proceed in those circumstances.\r\n    Behavioural questions that ask you to describe a time in your own history when you dealt with a certain situation, and to explain how you dealt with it.\r\n"}, {"date": "8 Feb 2017", "title": "Diversity and Inclusion Communications Director Process Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Dec 2016", "Interview Descriptions": "Requested to do a Skype interview. Interviewed right before the holidays.  Still waiting to hear a response. I have sent follow up emails and thank you notes. In theory, I am still waiting to hear response, although it is public knowledge that other candidates have moved forward. The lack of response seems disrespectful and unprofessional, especially at a university.", "Interview Questions": "How do you incorporate Diversity and Inclusion in your life?"}, {"date": "4 Jan 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in Dec 2016", "Interview Descriptions": "Got referral first. Then your skills were asked and your resume was reviewed. Then we use email to communicate recruit detail. At last, the starting time was discussed. Generally speaking, it was a relaxed interview.", "Interview Questions": "Introduce yourself."}], [{"date": "8 Feb 2017", "title": "Student Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2016", "Interview Descriptions": "First I had a phone interview. A few weeks later I met with both bosses in person. (In this position you will be working with the Administrative assistant and Account services.)", "Interview Questions": "Basic interview questions and seeing if you have any office experience "}, {"date": "25 Feb 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2016", "Interview Descriptions": "I sent in my resume and I was asked to come in for a interview where I was automatically handed over employment paperwork. My interviewer was kind of late and the interview was not worth the hour drive I took up to Richmond. I am glad I did get the job though.", "Interview Questions": "How would you deal with a unmotivated tutee. "}, {"date": "18 Mar 2019", "title": "Front Desk Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2016", "Interview Descriptions": "It was friendly. It was based on the STAR method. I didn't find any challenging questions. Just be confident and answer with confidence. Mainly questions related to customer service and organizational skills.", "Interview Questions": "Tell me about yourself."}, {"date": "17 Jan 2016", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jan 2016", "Interview Descriptions": "Wàiting for response to see when and if they can put me on the schedule. Asked about furthering education,availability,skill set. Did i mind fliating to different units.benefits are good but parking is not. Good place to learn more skills.", "Interview Questions": "Availability"}, {"date": "26 Jul 2016", "title": "Event Planner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Dec 2015", "Interview Descriptions": "I was chosen to interview out of a pool of 100+ along with 3 other applicants.  There were 4 interviewers that asked me a variety of questions about my experience and skill set, including a question about a software program I had never used.  This software was not mentioned in the job description, but I sensed that it put me at a disadvantage.  They asked me to describe a time when I came through in a pinch, and I blanked even though I actually have plenty of examples", "Interview Questions": "Have you used event planning/conference planning software?"}, {"date": "8 May 2016", "title": "Animal Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Virginia Commonwealth University (Richmond, VA) in Nov 2015", "Interview Descriptions": "The interview was a panel interview with four people. I was read the job description and had to answer a series of \"yes\" or \"no\" questions. The way the questions were asked there was not really any way to expound on the answer. For example: \"Can you lift over 50 lbs\" or \"Are you able to work weekends\", etc. After they asked their questions I took the time to ask a few questions, but my interviewers didn't seem interested in answering my questions. They were short and gave me some clear body language signals that they were done with the interview even though I was not. \r\n\r\nWhen I looked at the clock when I entered my interview it was 2:00pm. After I left I looked at the clock and it was exactly 2:07pm. My interview was a total of seven minutes long. I honestly thought I had messed up the interview or that they weren't really interested in me. \r\n\r\nI was offered the position a week later and accepted it. I have learned a lot about the department and wish that I had had taken more time on the interview to learn about the management's work ethic, \"disciplinary\" styles, and the general happenings of the department.", "Interview Questions": "How much can you lift?\r\nCan you work weekends? \r\nBasic yes or no questions. "}, {"date": "4 Feb 2018", "title": "Animal Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in Nov 2015", "Interview Descriptions": "My interview was quite unusual. It was scheduled for 2pm in the afternoon and I arrived 15 minutes early. They brought me in, read me the job description, asked me about 5 questions (all yes or no questions), said thank you and I left. I looked at my clock and 8 minutes went by. I tried expounding on the questions they asked me, but it was very difficult because they were all Yes or No. \r\n\r\nI did get the job. \r\n\r\nI think it was this way because the department - Department of Animal Resources (DAR) - was in a rush to hire new positions. All they cared about was if you had a college diploma, if you could lift 50 lbs, and if you could follow \"orders\".", "Interview Questions": "Can you lift 50 lbs?"}, {"date": "2 May 2016", "title": "Media Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Nov 2015", "Interview Descriptions": "The interview process was relatively simple. Slow-moving. Interview came about a month after submitting application. One day interview process. Basic questions about technical capabilities. Had a short review of my reel and some short demonstration of skills. I didn't feel as though the interview panel had a solid idea about what exactly my tasks would be as a media specialist.", "Interview Questions": "What was your undergraduate education?"}, {"date": "21 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Sept 2015", "Interview Descriptions": "The interview process may be rigorous depending on the level you are applying for. Some questions will focus on your aspirations and you may have to work through some scenarios and gice responses that apply.", "Interview Questions": "What are your long term goals and where does this role fit?"}, {"date": "6 Nov 2015", "title": "Business Intelligence Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Sept 2015", "Interview Descriptions": "Interview process was very formal. Team of people took interview. They asked about analytics, finance, sql , subject matter questions. They had much information about me because I was working on same University. First round is phone interview. Second round is technical interview, where team of people will ask different technical questions. Last round was HR and behavioral.", "Interview Questions": "have you worked on dashboard?"}], [{"date": "25 Aug 2015", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Aug 2015", "Interview Descriptions": "Interview 15 mins asked a series of questions on Vcu required answer . Later that day I received a phone call to call my boss and also received a reference check email completed that as soon as possible. I wonder does anyone know the next step", "Interview Questions": "Do you know anything about health insurances?"}, {"date": "21 Mar 2016", "title": "Storage Processing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in Aug 2015", "Interview Descriptions": "My boss and my supervisor both interviewed me in the storage building and hired me on the spot. They were very kind and not intimidating and the interview was easy", "Interview Questions": "Are you a quick learner"}, {"date": "21 Sept 2016", "title": "Junior IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Aug 2015", "Interview Descriptions": "First we had to submit an application online, which was then vetted and I was called two weeks later for an in-person interview.  I met with three supervisors who asked questions about previous IT experience, how to help a confused customer, how to handle a stressful situation, and our basic work ethic/culture.   There were definitely a few scenario questions about what we would do if we were helping somebody who couldn't speak english, or if we were on the phone with somebody and we did not know about the system which they needed help with.  Basically, they are looking for people who are confident with good social skills, and can learn.  The big thing is not being afraid to learn, and not being afraid of handling stressful situations.", "Interview Questions": "Which systems are you comfortable with? Blackboard, MathLab, etc..."}, {"date": "4 Nov 2018", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jun 2015", "Interview Descriptions": "The interview process was a sit down with other interviewees' in the same room. But depending on when you apply, you might be the only one being interviewed. They ask simple questions really.", "Interview Questions": "What would you do in a certain situation (customer/resident get angry..etc)?"}, {"date": "13 Mar 2016", "title": "Tech Squad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jun 2015", "Interview Descriptions": "one technical interview with manger and one tech squad was there , very general questions about what time u can work are u flexible to work in shifts, u have to wear pants and shoes.\r\nthey look into my resume asked few other questions", "Interview Questions": "tell me about pins in hdmi and vga"}, {"date": "5 Mar 2015", "title": "Administrative Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "I had dinner with search committee the night before.  Because I had previously worked at the university I did not take a tour of the university.  I had a full day interview which included a one hour presentation on my area of work.  The interview process was very smooth, and I had time for breaks.  They also provided lunch for me and the current employees.", "Interview Questions": "Why are you interested in working here?"}, {"date": "15 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Feb 2015", "Interview Descriptions": "It took awhile to hear back from HR after you send your application but the first thing they do is contact you and ask when would be the best time for an interview. I had a panel interview where there were multiple people from the facility who interviewed me. Only one person asked the questions, who was the director, and everyone else also wrote down notes on their thoughts for your responses. About 2-3 weeks after the interview, I was able to start.", "Interview Questions": "Have you had any experience in customer service?"}, {"date": "25 Jan 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "I applied in the first week of December, contacted the HR manager and followed up on the application. I called to find out when the position was getting filled and if I could schedule an interview. The HR manager asked me what position I applied for, I responded and hadn't heard back. I resent the email detailing the position I applied for and never heard back. It's been almost two months since I applied and I hadn't been contact so I emailed her. Very rude and inconsiderate to not notify anyone. Today I checked the position and it has been filled... for two weeks, despite me checking last week. They forgot to update the log and wasted two weeks of my time. The worst part is, I went to college here- beautiful how they treat their alumni like a paycheck and don't both to help. I will never pay alumni fees to them again nor will I recommend the school to ANY potential employee or student. VERY INCONSIDERATE HR TEAM.", "Interview Questions": "What position did you apply for?"}, {"date": "24 Aug 2015", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Nov 2014", "Interview Descriptions": "Efficient. Asked about past experience and knowledge relevant to working with people with disabilities. Felt like a conversation more than anything. Fairly informal in terms of setup. They needed staffing ASAP so I don't know if this is the norm for them.", "Interview Questions": "Asked questions that related to different theories used in rehabilitation counseling; asked about past experience and some difficulty you have experienced; asked about future goals"}, {"date": "4 Sept 2014", "title": "Finance Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Board interview of at least four people.Generic panel questions where they have to write answers to your questions and submit to hr. IF you don't get hired, won't tell you what you are lacking.", "Interview Questions": "Where you see yourself in years to come"}], [{"date": "27 Oct 2014", "title": "Web Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Virginia Commonwealth University in Aug 2014", "Interview Descriptions": "Very smooth interview process that started with a request for interview after I submitted my application and resume online. The interview was the traditional panel type interview with basic questions ranging from \"Why I want to work there\" to \"What to you know about online security\". Nothing too difficult. Very friendly interviewers that made atmosphere fun and encouraging.", "Interview Questions": "Why do you want to work with VCU?"}, {"date": "2 Dec 2016", "title": "Copy Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Aug 2014", "Interview Descriptions": "Everyone I met with was pleasant, and more than happy to describe the department's particular set up. It was a pleasure, but I believe their inclination to assign you somewhat odd homework can lose you the job.", "Interview Questions": "Am I comfortable in a developing creative department?"}, {"date": "18 Aug 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Aug 2014", "Interview Descriptions": "I was asked to be a TA by a different professor and assigned to a new instructor. We went over course materials and expectations as to what I would do. The actual workload was more than advertised as weekly assignments were project based.", "Interview Questions": "Will you TA the new python course?"}, {"date": "10 Sept 2015", "title": "Aviation Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jun 2014", "Interview Descriptions": "The interview was conducted under the Mayor's Youth Academy program. It was a fairly easy process because of the program. The interviewer asked me some general questions about my resume and what made me qualified for the internship. I was then given the job and I met my advisor, who gave me my tasks for the internship.", "Interview Questions": "What makes you qualified for the position?"}, {"date": "26 Jul 2017", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Virginia Commonwealth University (Richmond, VA) in May 2014", "Interview Descriptions": "There was a 30 minute phone interview with a committee and then an on campus interview that began with a dinner and lasted the entire next day. The day was a combination of interviews with staff, campus partners and students, and required I give a 30 minute presentation in my area of expertise. Following the on campus interview, the Director called for an additional time of clarifying questions prior to offering my the role. The entire process from application to start took nearly six months.", "Interview Questions": "Why are you interested in this role? "}, {"date": "27 Mar 2016", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Apr 2014", "Interview Descriptions": "Gave a scientific seminar to the lab advisor and lab group, met with the lab group individually to assess my fit and the lab culture, met with the advisor individual, did a group lunch as a collective", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Mar 2016", "title": "Career Services Office Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Mar 2014", "Interview Descriptions": "I was contacted for a phone interview within 1-2 weeks of applying. Within a few days of completing the phone interview, I was contacted with an itinerary (a full 8 hours) for an on-site interview/trial with various sectors of the department. There, I did a few 1:1 interviews, and two group interviews--one conducted by the work study students I would be overseeing in this role, the second by the career counselors. It was then that I was told that I was one of three candidates remaining to be considered. I was told when I should expect a call, and it came a week or two later than that. Unfortunately, I missed it, but returned the voicemail within five minutes. No one ever answered or returned my call thereafter.", "Interview Questions": "If you could be any utensil, which would you be?"}, {"date": "21 Feb 2014", "title": "Fiscal Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Very bureaucratic.  They have to interview at least three people even if they know who they want to hire.  All employees must be asked the exact same questions.", "Interview Questions": "There were only questions pertinent to the job itself."}, {"date": "5 Jan 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "You have to meet a specific criterium and fill out an application. Next, you sit with the coordinator and have an interview. I felt it was pretty easy going and straightforward.", "Interview Questions": "Situational examples. "}, {"date": "22 Nov 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Virginia Commonwealth University", "Interview Descriptions": "Referred by faculty. Had to submit resume and cover letter. Made it through initial screening, met with employer and had a half an hour interview. It was not as stressful as regular job interview because there was just one interviewer and she was quite nice and amicable. About a week after the interview, I was notified that me and 2 other students had made it to the final round and would be required to attend a meeting with the group. After the meeting, each of us was interviewed separately by group members. This was a bit more stressful since they basically went round the table asking questions.", "Interview Questions": "Give an example of when you were in a team of people with wildly different personalities and work styles, and how did you handle it. Couldn't think of any examples, instead of giving up immediately i stumbled through a pooorly-worded answer that i can't even remember anymore"}], [{"date": "17 Jan 2018", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2013", "Interview Descriptions": "Met with my future supervisor in his office.  We had a conversation about why I wanted the job.  After our conversation he offered me the job provisionally.  After this I accepted the job", "Interview Questions": "Do you have work study?"}, {"date": "16 Dec 2014", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 9 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in May 2013", "Interview Descriptions": "Got introduced to the position from an employee. Met with the hiring manager before the position had been posted. Once the position was posted I applied and had an \"actual\" interview with the same lady.  Then I was moved on to meet the head of the dept.  After the final interview I hadn't heard back in about 3 months and was finally informed the position had been restructured and I would have to wait for it to be posted again.  5 months later the position was re-posted, I applied, and had to interview with the same lady, again.  This time I did not have to meet anyone else and she said I should be moving forward.  I was denied the position from HR and the hiring manager said she had no idea.\r\n\r\nThey strung me along for way too long just to say no,", "Interview Questions": "No unexpected questions"}, {"date": "5 Oct 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Virginia Commonwealth University (Richmond, VA) in May 2013", "Interview Descriptions": "Completed a phone screen\r\nNotified of tall steps in the hiring process and hiring timeline during the initial phone screen\r\nAnswered relevant and thought provoking questions \r\nExtraordinarily organized interview process\r\nCompleted a job appropriate assessment", "Interview Questions": "N/A"}, {"date": "27 Aug 2015", "title": "IT Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Mar 2013", "Interview Descriptions": "The interview process for very chill. First thing they did was review my resume and ask me basic questions like do you know how to connect to servers. The person who interview me was very welcoming. The interview was done in the managers office. After asking me some behavioral questions and technical questions, the person was open to questions. At the end, I was offered the job on the spot. It caught me off guard but I guess they like to offer ASAP if they like you enough. Overall the interview process was very easy.", "Interview Questions": "Do you have any knowledge of computers/servers?\r\n"}, {"date": "28 Jul 2017", "title": "Junior IT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University in Jan 2013", "Interview Descriptions": "The application is found online. Upon selection, there is only 1 round of interview and a background check. The interview consisted of behavioral and situational questions. There was only one technical question about IP address.", "Interview Questions": "Behavioral questions"}, {"date": "27 Oct 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Virginia Commonwealth University in Jan 2013", "Interview Descriptions": "I think that the overall interview was brief and friendly. Just talked about previous experience and what was required for the job. Oveerall felt pretty casual. It was a positive experience.", "Interview Questions": "What kind of precious experience do you have?\r\n"}, {"date": "28 Oct 2015", "title": "Videographer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2012", "Interview Descriptions": "Interviewed with connie, She was very friendly and made the interview as stress free as possible. She will want to see your work so come prepared for that. You also tend to interview with another student in the field you are applying for. It was a very fast interview to see what skills you have. Overall it was fairly simple and fun for an interview", "Interview Questions": "What made you want to work for recsports?"}, {"date": "24 Oct 2012", "title": "OMFS Post Doc Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in Oct 2012", "Interview Descriptions": "4 interviewers, very conversational and relaxing", "Interview Questions": "Where else are you interviewing"}, {"date": "21 Feb 2016", "title": "Event Planner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jun 2012", "Interview Descriptions": "The interview was a full-day event, with individual meetings with the Associate Director and the Director, as well as two group interviews with event production staff and other event planners. Questions were pretty standard, ranging from my previous event planning experience to giving solutions to potential issues and customer complaints.", "Interview Questions": "You've been planning an event XYZ for a few months, when a week before the date of it, the customer wants to change multiple elements of it. However, you know it will simply not be possible for logistical reasons. How do you communicate this to the customer, who will definitely be upset about this fact."}, {"date": "29 Sept 2014", "title": "Information Technology Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jun 2012", "Interview Descriptions": "Hiring process takes a long time. They are a state organization but the HR department seems slower than most state organizations. The actual interview is average. They ask a series of questions to determine your basic skills both social and technical.  Knowing someone to give you a recommendation will almost guarantee you an interview with most departments.", "Interview Questions": "I did not have any unexpected questions. It is a relatively straightforward processes. If you have a high level of confidence you should be fine."}], [{"date": "29 Jun 2012", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jan 2012", "Interview Descriptions": "Everyone around campus said it was hard to find research that pays, mostly this is true, but not if you go search at the MCV campus. I just walked into a research building and they asked if I was there for the lab tech interview, I said no. However, even with no knowledge or experience they asked if I wanted to work there because they were in urgent need of a lab tech. I got hired after 2 interviews (about a 2/3 week period). The first interview was over the phone to get background and basic information. The second interview was to come in and meet the faculty at the lab, tour, and a skills test.", "Interview Questions": "What experience to do you have working in a lab such as this one?"}, {"date": "29 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Sept 2011", "Interview Descriptions": "The interview process for the part time administrative assistant position started with a half-hour phone call that started with the basic questions about previous related experience and my professional attitude. A week later, the department followed up with an in-person interview at their office that went over similar topics with a panel style interview. Other interviews with VCU showed they really like the panel style interview, which I am OK with, it keeps me from repeating the same information over and over again.", "Interview Questions": "The interview questions ranged from the general questions you normally get asked, to basic role specific questions. The phone nor panel interview really threw any curve balls."}, {"date": "14 May 2013", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2011", "Interview Descriptions": "Applied online, didn't hear anything for a month or more then I got an out of the blue phone call.  Did a quick phone interview, just basic questions was told that I'd hear back if they were interested. Heard back a week or so later, went in for an interview about a week after that. \r\n\r\nInterviewed with one of the supervisors. Interview was fairly strait forward, was told that my references would be checked and they'd get back to me. All of my references were checked (though I believe they we're unable to reach at least one), and I was told to come back in for a background check (finger prints etc). After the background check I sort of assumed that I \"had\" the position but I didn't hear back for another 3 weeks. I contacted them several times and was told that certain HR people were on vacation and that was delaying the process. Finally got a call back and was told that training would take place in two weeks, I was also told that i would need to do a drug test before training (I was never explicitly told that I had the position during this time period). \r\n\r\nOverall a very poor hiring experience. Time from application to hiring was at least 4 months, time from first contact to hiring was at least 3 months. Communication during the process was poor. I think it's worth mentioning that all of this was a for a part time position paying $8.25.\r\n\r\nHiring practice varies enormously from department to department, this occurred within the VCU Police Department.", "Interview Questions": "What's you're greatest weakness (I can't believe people still ask this stupid question)."}, {"date": "30 Oct 2015", "title": "Student Worker/Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in May 2011", "Interview Descriptions": "The interview process was professional and brief, and afterwords I was greeted by several of the advisors whom I would later come to work with. I was later shown around the office and the general area which made up the Transfer Center on the second floor of hibbs hall, this was a very clean, calm, and overall very positive work environment.", "Interview Questions": "What were some of my previous employers and prior work experience?"}, {"date": "12 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Virginia Commonwealth University (Richmond, VA) in Apr 2011", "Interview Descriptions": "Just an informal interview with the PI of the lab. I had found out about the job through a friend. He invited me in just to talk about my career goals, research experience, and why I thought I would be a good fit for the position. Pretty standard interview experience, and there were no other people I had to interview with.", "Interview Questions": "Why do you want this job"}, {"date": "15 Aug 2010", "title": "Shift Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Virginia Commonwealth University (Manassas, VA) in Aug 2010", "Interview Descriptions": "Asked questions based on area of expertise, which course you liked the most/least, why Micron ?, tell me about yourself etc.", "Interview Questions": "How will you check if the fuse is working perfectly "}, {"date": "30 Aug 2010", "title": "Laboratory and Research Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia Commonwealth University (Richmond, VA) in Jul 2010", "Interview Descriptions": "Interviewed with a research group at VCU's Massey Cancer Center. Immediately following the interview I received a phone call to confirm that I had received the job and am their selected candidate. Additionally, I would be receiving my offer details from Human Resources shortly. A week later, they changed their mind and opted for another candidate without any intimation. Human resources gave ambiguous responses and the researchers I worked with didnt respond to any correspondences. Highly unprofessional behaviour. I would not recommend this employer for anyone looking to establish a career in science.", "Interview Questions": "Interview experience at VCU?"}, {"date": "20 Jul 2010", "title": "Clinical Applications Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in May 2010", "Interview Descriptions": "The interviewers were very rigid.  I really could not get a feel for how they were receiving the answers I was providing.  The phone interview lasted about 30 minutes, and it was a total disaster.  The took the majority of the questions from the 10 questions they sent for me to elaborate on.", "Interview Questions": "Describe your experience with Cerner Surginet Anesthesia or other Anesthesia applications?"}, {"date": "7 Jul 2013", "title": "Lecturer/Speaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Virginia Commonwealth University (Radford, VA) in May 2010", "Interview Descriptions": "Lectured for the Rehabilitation Research and Training Center and Partnership for People with Disabilities at the RU West Campus building (May, 2010).", "Interview Questions": "N/A"}, {"date": "18 Apr 2011", "title": "Group Exercise Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Apr 2010", "Interview Descriptions": "Make sure your application ends up in the right hands. Mine was lost. I filled out another one and then was called in. I was given a panel interview by 3 student assistants. Then on the spot without warning they asked me to do a mock workout. They invited students in the building by announcing it over the loudspeaker. I started a routine with about 12 students who had come down for the class and before the warm-up was over (5 mins) another instructor showed up to teach a class, so we had to stop and leave 11 students with an incomplete workout. I was then hired on the spot. Strangest thing I ever went through.", "Interview Questions": "What is your background in health and fitness"}], [{"date": "23 Jun 2012", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Virginia Commonwealth University (Richmond, VA) in Mar 2008", "Interview Descriptions": "The hiring and interview process was thorough determining if the candidate was a good fit for the department.  They asked tough, but fair questions to truly get a sense for the applicant", "Interview Questions": "What kind of research experience do you have?"}]]