[[{"date": "29 Sept 2022", "title": "Senior Campaigner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at 350.org (Cape Town) in Aug 2022", "Interview Descriptions": "The position had 3 screening/interview stages. The first stage was an initial quick screening phone call. The second stage involved a skills exercise. The final stage involved a formal interview with a panel of about 5, including the Team Leader and the HR Manager.", "Interview Questions": "If a fellow co-worker had something negative to say about you in the professional context, what would that be?"}, {"date": "4 Aug 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at 350.org in Jul 2022", "Interview Descriptions": "I did two interviews for an interim role. This included an interview in the evening to accommodate the schedule of the hiring manager and a five-person panel interview. The panel interview was recorded (without asking for my consent) in order for even more staff to watch and comment on. After going through this extremely onerous process for what was a 12-month interim contract, I was ghosted. I waited several weeks then chased them, and was then sent a generic rejection email with no offer of feedback. I found this really disrespectful of them after jumping through so many hoops and would not apply again for another role.", "Interview Questions": "How would you influence people who disagree with you, how would a colleague who doesn’t like you describe you, how would you implement a strategy and what animal would you liken this process to, how would you deal with negative feedback or mistakes, what would you do if a team member disagreed with the team strategy."}, {"date": "10 Aug 2022", "title": "Interim Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at 350.org in Jul 2022", "Interview Descriptions": "Initially straightforward with the departing Director.  A panel interview was then held with staff globally. Most were relatively quiet outside of one person who seemed to want to one-up each of my responses, it seemed as if it was more of a competition than an interview. A written test followed the panel, which focused on staff interactions as opposed to the role itself.", "Interview Questions": "What animal represents you? What is your experience working with Boards? How do you handle conflict? How will you handle conflict remotely with your team? "}, {"date": "11 Jan 2021", "title": "Finance Campaigner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at 350.org", "Interview Descriptions": "Past work experience, information about the activities of 350.org, examples of past successful campaigns were discussed.  The committee was friendly and showed enough empathy for the candidate. The interview took approximately half an hour.", "Interview Questions": "Details of my past experience "}, {"date": "17 Jan 2021", "title": "Head Of Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at 350.org (Chicago, IL) in Dec 2020", "Interview Descriptions": "Applied online and received an invite about a week later for an initial 1/2 hour phone screener with a HR recruiter. Then moved on to a one hour zoom panel interview .\r\nI noticed some annoyance at my question as to what was the catalyst for unionizing?\r\nTwo interviews and then ghosted. This was a senior role. \r\nSadly, this was a disappointing experience. Based on my interaction with them, I fear that I will not be recommending 350.org to any future applicants or donors.", "Interview Questions": "What is your reason for applying"}, {"date": "22 Feb 2019", "title": "Campaigner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at 350.org", "Interview Descriptions": "At the application stage, instead of writing another generic cover letter, they asked to answer some questions about how I matched-up against the job requirements, which was clever. The second stage was a short test, and I was asked to send it back with answers within 3 days or so. The questions were about the job, and some about my leadership style. The next stage was a 1h long online interview with 3 staff members. Next they also asked for 3 references before they made the offer.", "Interview Questions": "Asked me about one campaign I worked on which was a success, and how I helped achieve it."}, {"date": "8 May 2018", "title": "Fundraising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at 350.org (Brussels) in Jan 2018", "Interview Descriptions": "The application procedure was incredibly slow. I attended 3 interviews, with a fortnight between each. I had to chase the organisation each time to see if I made it through to the next round. After my third and final interview with the CEO, I waited nearly a month to find out if I got the job. Turns out, they had decided to pause on recruitment. Communication was terrible throughout the process.", "Interview Questions": "Do you have any experience in taking part in environmental campaigns?"}, {"date": "18 Dec 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at 350.org (Austin, TX) in Nov 2017", "Interview Descriptions": "I applied online. About 3 weeks later I received an e-mail asking to set up a phone interview. I was thrilled as I care deeply about environmental issues and have done extensive volunteering with my local affiliate of 350.org. The phone interview was relaxed and I thought it went very well. At the end my interviewer told me they would be moving fairly quickly with the selection process and to feel free to contact her if I had any further questions or wanted an update. I sent two follow up e-mails to my interviewer over the next two weeks. No response. Obviously I knew I didn't get the position, but I found this extremely disrespectful and frankly unprofessional. I don't understand what is so hard about sending the candidates you interview a polite, brief rejection, ESPECIALLY if you ended the interview by saying \"don't hesitate to contact me\".  I was sitting on the edge of my seat for the next week and half, because I was so excited this would have literally been a dream job for me. Its not a way to treat volunteers who give their free time to your cause, and I honestly wish I hadn't interviewed with them at all because this whole experience left me with a bitterness towards an organization I really admire and respect.", "Interview Questions": "How do you feel about the concept of being a \"gatekeeper\" as an executive assistant?"}, {"date": "18 Jul 2017", "title": "Digital Campaigner Sênior Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at 350.org (Curitiba)", "Interview Descriptions": "Entrevista fácil, porém extremamente repetitiva. Cada pergunta da entrevista na verdade são 5 perguntas, e com 2 pessoas ao vivo e outras 2 pessoas (em cidades diferentes) no Skype. Ou seja, creio que eles estão testando o candidato em situações de estresse ou de \"pressão\".\r\n\r\nEles testam o nível de inglês e de espanhol do candidato.\r\n\r\nAntes da entrevista foi solicitado a realização de 2 testes, extremamente trabalhosos, em que tinha que se criar uma campanha anti-fracking primeiramente em inglês e depois outra campanha em espanhol, com criação de vídeo, post para redes sociais e estratégia de campanha completa, com criação de cronograma de ações.\r\n\r\nFui finalista com outros 2 candidatos e no final não recebi a proposta de emprego. \r\n\r\nSoube que o candidato escolhido recebeu a proposta no final de abril, em 17 de maio (mais de 2 semanas depois) eu não hacia recebido retorno nenhum.\r\n\r\nAchei extremamente desreipetosa a postura da 350.org com o trato com os candidatos. Eu entendo que hoje em dia é tudo muito \"corrido\" porém se eles pediram a 3 candidatos testes extremamente trabalhosos que tomam muito tempo, o mínimo de RESPEITO e CONSIDERAÇÃO com o candidato seria oferecer um retorno.\r\n\r\nAchei frustrante (pra não dizer humilhante) eu ter que solicitar um retorno para esta organização.\r\n\r\nDa para perceber que eles prestam muito atenção no \"macro\",ou seja, em campanhas grandes, viagens, eventos, imprensa, ou seja, tudo o que mexe com o ego deles e os fazem se sentir \"importantes\". Porém com o micro, como o respeito individual aos candidatos finalistas, não estão na pauta. \r\n\r\nPostura nada condizente para uma instituição que diz que quer um mundo \"melhor\".", "Interview Questions": "Eles perguntam ao candidato qual foi a sensação do candidato com relação às estratégias visuais e de marketing da  empresa, o que não deixa de ser uma um de consultoria gratuita vinda de um público externo."}, {"date": "12 Jul 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at 350.org", "Interview Descriptions": "I first had a phone interview, which went well. This was followed by a timed written skills test and then a \"final\" Skype interview with several people. I was never invited to meet anyone in person.", "Interview Questions": "What kind of experience do you have working in an international context?"}], [{"date": "11 Apr 2016", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at 350.org", "Interview Descriptions": "Interview process was pretty relaxed. It was only one round. They asked a few questions that didn't strike me as too hard. The main thing they look for is past activism experience. Also diversity is a major factor in their hiring process.", "Interview Questions": "Do not recall, but probably asked about activism experience."}, {"date": "2 Dec 2014", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at 350.org in Nov 2014", "Interview Descriptions": "This organization wasted my time, no doubt about it. I should have known that something was amiss, given the convoluted hiring process. Typically an HR rep will initially screen by phone or schedule an interview outright. The former happened, which led to a second phone screening with the department supervisor overseeing this position. We already seem to be at one too many steps. I specified that I was not a Skype user, so the second screening took place by phone. Then a skills assessment was requested, to be submitted via email. Upon completing it, I was granted another interview with a different HR rep and the supervisor. Normally I would have concluded contact with the HR department by then. Development informed me that this would be a Skype interview, though we already discussed my use of the technology. Apparently this would occur whether I had the app or not. The shift from asking to telling was swift. The organization does lots of business this way. I have no problem with it, but a preference was established and there's no telling what could have been gained by meeting in person first. They do have a physical office location, after all. Because the HR rep suddenly fell ill, the joint interview was postponed twice (mere minutes before the first attempt, to boot). The other HR rep wound up taking over.\r\n\r\nThe Skype session went as well as I or the interviewers should expect. There were multiple times when I was complimented on my answers. To have been rejected afterward was a source of great confusion, given the reasons provided to me. Skills, a lack of in-depth answers nor passion for their mission were cited! This is after excelling at a skills test, receiving kudos for my answers and getting this far in the process without explicit environmental experience. If the latter mattered so much, it stands to reason that I shouldn't have been interviewed at all. I sent credentials that they could pick over well before this started, and this seems like a tactic to depict \"equal opportunity.\" The kicker is that the first HR rep called me about another position that I'm just as (if not more) qualified for and wouldn't go any further in considering me, due to a stringent requirement of longevity. Meanwhile they have staff with no environmental background who've held multiple jobs in a few years time. This is a glaring inconsistency in hiring procedures which should be reported to an appropriate party. So how does something regarded as a \"plus\" and not a requirement eliminate me from the development job when I have plenty of other plusses? I received an explanation, but not one that makes sense. Only one can be chosen, and arbitrary means will best all other comers. Having to wait through a holiday weekend for that news after previous schedule adjustments was an inconvenience as well.", "Interview Questions": "N/A"}]]