[[{"date": "22 May 2023", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rowan University (Glassboro, NJ)", "Interview Descriptions": "It was a smooth process, I was asked why I wanted to be a peer tutor. It was a phone interview. The interviewer was clear and concise with her questions and the minimum requirements of the job such as grades strictly determine whether or not you're selected! Good luck!", "Interview Questions": "Why do you want to be a peer tutor."}, {"date": "22 Apr 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rowan University", "Interview Descriptions": "After applying, I had a phone interview, and then a flyout where I gave both teaching and research presentations to show my work and its relevancy to the department, as well as interviews with most of the faculty within the department. Felt like the interview went well, but I never heard back from them, found out later that someone else had gotten the position, and it took months to get reimbursed for my flight. Also no one in the department responded to my thank you letters.", "Interview Questions": "Don't remember any offhand, but most were likely about my teaching and research interests."}, {"date": "12 Apr 2023", "title": "Lecturer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Rowan University (Glassboro, NJ)", "Interview Descriptions": "It was a nice open ended discussion with hiring manager and two colleagues. Asked questions about teaching experience. Gave me time to ask questions about the role and the program and responsibilities. Very well done process.", "Interview Questions": "Q: Tell me about your teaching experiences."}, {"date": "11 Mar 2023", "title": "Campus Recreation Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rowan University", "Interview Descriptions": "the interview process was really simple and easy! the entire process was over zoom and they made me feel very comfortable. it was about 20 minutes long and we had a really good conversation.", "Interview Questions": "tell us a little about yourself"}, {"date": "3 Mar 2023", "title": "Undergraduate Admissions Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rowan University", "Interview Descriptions": "After completing the online application, you will receive an email stating you have an interview. It is very simple and is largely based on your ability to interact well with others as this is the nature of the job.", "Interview Questions": "Why do you want to be an admissions ambassador?"}, {"date": "31 Jan 2023", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rowan University in Dec 2022", "Interview Descriptions": "Interview was via Zoom with faculty search committee. Invited to campus talk about three weeks later. It was a great experience and all involved were collegial and kind in their interactions with each and me.", "Interview Questions": "Why do you want to work at Rowan (insert department name)?"}, {"date": "27 Apr 2022", "title": "Admissions Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rowan University", "Interview Descriptions": "The interview process started with a google form with questions and then asked for your resume. I was then chosen for the next round of group interviews. I finally finished with a solo interview.", "Interview Questions": "What do you love about Rowan University?"}, {"date": "26 Mar 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rowan University", "Interview Descriptions": "I had a good relationship with a professor and worked under him. They wanted me to continue work over the break so I got paid during this time. There was no formal interview.", "Interview Questions": "N/A"}, {"date": "27 Jul 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rowan University", "Interview Descriptions": "A demo lesson followed by a series of questions from a five-person search committee.  In total, the interview took approximately one hour.  Very friendly committee, and I received a relatively quick response.", "Interview Questions": "If I remember correctly, they asked about strengths and weaknesses."}, {"date": "21 Jan 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rowan University (Glassboro, NJ) in Dec 2020", "Interview Descriptions": "I had an on-campus interview for an assistant professor position. This involved a teaching demonstration and multiple meetings with faculty and admin. Everyone was kind and accommodating. It is helpful to prepare a lot of questions because you will have time to ask them.", "Interview Questions": "Where do you see yourself in 5 years?\n\nHow do you see your research fitting in?"}], [{"date": "23 Feb 2021", "title": "Management Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rowan University (Glassboro, NJ) in Sept 2020", "Interview Descriptions": "Pretty easy going, they ask you to come in and speak with the head of the department. He then asks some simple questions such as background and prior work experience.", "Interview Questions": "Tell me a bit about yourself "}, {"date": "30 Mar 2020", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rowan University in Mar 2020", "Interview Descriptions": "Phone interview via Webex, 3 people. Friendly and nice. Asked me my legal status to work; why I am interested in the U and position; my teaching philosophy; courses I would like to teach; how I would ensure cultural inclusiveness.", "Interview Questions": "Asked me my legal status to work; why I am interested in the U and position; my teaching philosophy; courses I would like to teach; how I would ensure cultural inclusiveness. "}, {"date": "11 Nov 2019", "title": "Staff Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rowan University (Stratford, NJ) in Nov 2019", "Interview Descriptions": "Interviewed for two different positions, one last year and one recently. Both times, I did not receive a call for an interview until 4 weeks after I applied. For the first time, the panel was very nice, but provided no updates or response after thank you emails, and eventually received the generic email a month later. For the recent one, I had a phone interview that left me with a bad taste. They seemed uninterested and robotic from the beginning, asked no relevant questions about my resume and re worded the same questions. It was bizarre. Should've known when I scheduled it, because the secretary was completely flustered and never sent me a confirmation email. Then I did get called for a in person interview the next day and declined.", "Interview Questions": "Experience writing letters, why did you apply, what makes you qualified."}, {"date": "2 Jan 2020", "title": "Tenure Track Assistant Professor, Exercise Science Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rowan University in Nov 2019", "Interview Descriptions": "15-minute phone interview with a the search committee. They asked me questions along the lines of the application materials. They were friendly but vague about when I would hear back about an in-person interview.", "Interview Questions": "What is your experience in the field?"}, {"date": "15 Mar 2021", "title": "Instructional Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rowan University (Glassboro, NJ) in Sept 2019", "Interview Descriptions": "past employment experiences and then what would you do scenario-based questions.  The last 10 minutes consisted of me interacting with the student body. Very easy and straightforward. Enjoyed the social aspect of meeting some of the students that I would be working with. Arrived on time and got started right away with no interruptions or distractions from the staff member who interviewed me.", "Interview Questions": "They asked what do I have to offer?"}, {"date": "6 Aug 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rowan University (Stratford, NJ) in Jun 2019", "Interview Descriptions": "I was called within a few days for an interview. I met with 3 people and they were very nice. They asked questions to get to know me and I felt respected.", "Interview Questions": "Do you prefer to work alone or with others?"}, {"date": "8 Oct 2018", "title": "Staff Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rowan University (Stratford, NJ)", "Interview Descriptions": "They emailed me a few days after I applied for an interview. Then a few days after the first interview to set up a second one. Really quick response. Though after a week and a half passed I called to check up on the status and left a voice mail and no one returned my call. A week after that I emailed and they say they chose someone else.", "Interview Questions": "They asked pretty simple questions you can find online.  Why do you want to work here, what makes you more qualified, etc. "}, {"date": "1 Sept 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rowan University in May 2018", "Interview Descriptions": "Over the phone, was about 15 minutes on previous experience.  There was a possibility that it could be in person but it never came down to that.  Was a easy process.", "Interview Questions": "Why do you want this job?"}, {"date": "17 Dec 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Rowan University in Apr 2018", "Interview Descriptions": "You will have a group interview with about 5 academic advisors as well as the department supervisor.  Each advisor will ask you a series of questions. There is only one interview associated with this position.", "Interview Questions": "How would you help a student that has no idea of what major they should choose?"}, {"date": "7 Nov 2017", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rowan University", "Interview Descriptions": "The interview process was extremely simple. The office just wanted to know what subjects I was interested in teaching and my grades in them. After they confirmed my grades, they asked my availability", "Interview Questions": "What subjects do you have A's in?"}], [{"date": "16 Apr 2019", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rowan University (Glassboro, NJ) in Nov 2017", "Interview Descriptions": "I got interviewed by four senior technicians who made the process quite friendly. Asked me about my past working experience and my expectations coming in at Rowan as student Technician.", "Interview Questions": "Where have you worked in the past?"}, {"date": "12 Jan 2018", "title": "Faculty of Practice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rowan University (Glassboro, NJ) in Aug 2017", "Interview Descriptions": "Panel Interview of  PhD's.   The panel made it clear that they were impressed with and respected  my experience and career accomplishments.  The panel employed efforts to put me at ease and created a relaxed but professional environment.", "Interview Questions": "Name one weakness or opportunity for improvement"}, {"date": "11 Apr 2021", "title": "Director of Energy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rowan University (Glassboro, NJ) in Feb 2017", "Interview Descriptions": "The interview process was very easy and straight forward.  I met with three top people in the facilities and administration departments for a relaxed conversation about the position and qualifications.", "Interview Questions": "How would you describe your management style?"}, {"date": "5 Aug 2018", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rowan University (Stratford, NJ) in Jan 2017", "Interview Descriptions": "After applying online, It took a while before they called. An interview was scheduled for the following week. The manager of the department conducted the interview. She was very friendly. She felt I was overqualified for the position and would not be happy.  Otherwise there would have been a second interview, but I don’t know with whom, since it never came to that.", "Interview Questions": "Are you proficient in Excel and Microsoft Office?"}, {"date": "23 Dec 2016", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Rowan University (Cherry Hill, NJ) in Dec 2016", "Interview Descriptions": "Professional, talked about my experience teaching groups and they explained the course and curriculum. I was able to ask my own questions about the course I was assigned. I was asked to explain how I remediated a student who had difficulty during a previous job at a college.", "Interview Questions": "What is the most important thing about being an instructor?"}, {"date": "5 Oct 2016", "title": "Veterinarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rowan University (Philadelphia, PA) in Oct 2016", "Interview Descriptions": "This was an initial, screening, telephone interview.  The faculty introduced themselves, explained the interview process and the position, gave me the salary range, asked me questions, then gave me a chance to ask them questions.", "Interview Questions": "1- Why do you want to work at this establishment and in this position?\r\n2- Tell us about your recent employment.\r\n3- Tell us about a situation where you and upper management disagreed, and how you handled it."}, {"date": "8 Sept 2016", "title": "HRIS Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Rowan University (Cherry Hill, NJ)", "Interview Descriptions": "It was somewhat rushed, the interview scheduled called gave one day as an option and did not give any further details besides location of building. I did not know who was doing the interview etc. I arrived and was surprised with a panel interview, would have been nice to know that. Also they were interviewing one day only and had to make a decision in two days. Leads me to believe someone is in mind, needless to say it's been 5 days and I haven't heard anything so I'm assuming I wasn't chosen", "Interview Questions": "What type of HR reporting do you handle?"}, {"date": "1 Feb 2018", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rowan University (Glassboro, NJ) in Sept 2016", "Interview Descriptions": "I applied online. A few days later, I was notified that I had a phone interview scheduled. I completed the phone interview and then was offered the job several days later.", "Interview Questions": "What does philanthropy mean to you?"}, {"date": "13 Jul 2016", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rowan University (Stratford, NJ) in Jun 2016", "Interview Descriptions": "Applied online and was asked to come in for 2 face-to-face interviews. interviews seemed very positive and I was told I would hear back in 2 weeks. I sent thank you emails for both interviews. Then sent 2 follow-up emails after 2 weeks. I received no response to my emails, not even notification that they may still be interviewing, are busy, are still deciding. No one got back to me at all. This is very unprofessional, especially when having someone come in for not 1, but 2 interviews. Be courteous and respectful of the candidate's time! It takes time and money to prepare for interviews. The least that could be done was to respond to follow-up. Also, when someone asks what hours your team prefers for the position, that is what they are asking, nothing more. Please do not assume they are asking for work from home or flex time, as it is too presumptive. This experience did reflect poorly on the department I interviewed with, and I now do not have a good impression.", "Interview Questions": "How would you handle working with doctors?"}, {"date": "11 Apr 2017", "title": "Recording Studio Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rowan University (Sewell, NJ) in Dec 2015", "Interview Descriptions": "Easy questions and setup, polite faculty, Human Resources organized paperwork efficiently, upper level faculty allowed for questioning and helped me understand the role more in depth, hardest part was finding out from Financial Aid office about the hours I was alotted", "Interview Questions": "Do you know the various studio components we offer?"}], [{"date": "1 Oct 2017", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rowan University (Glassboro, NJ) in Aug 2015", "Interview Descriptions": "The hiring process included few questions which were in the form of situations. It isn't that difficult if you answer honestly. The questions are easy to answer if you are a helpful person who understands the ethical ways of imparting education.", "Interview Questions": "How would you help a student who asks you for help with homework?"}, {"date": "6 Aug 2019", "title": "III/IV Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rowan University (Glassboro, NJ) in Apr 2015", "Interview Descriptions": "Applied online was called for to phone interview then invited to campus for an in-person interview. Interviewed with search committee and then other faculty members. I received the offer letter later on and started with short notice.", "Interview Questions": "teaching experience"}, {"date": "19 Mar 2015", "title": "Staff Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Rowan University", "Interview Descriptions": "Office and people to work with seemed very happy and positive. The hiring and interview were fairly quick- 30'minute interview and more about the position than about yourself. Was overall a fair experience", "Interview Questions": "Are you comfortable with MAC"}, {"date": "20 Jul 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rowan University", "Interview Descriptions": "The Resident Assistant (RA's) hiring procedure is posted on the \"Residential Learning & University Housing\" website. There are four main stages in the hiring process. \r\n\r\nThe first stage requires all interests applicants to attend an information sessions. Be sure to attend, and more importantly sign-in! The session itself has a panel of current RA's and professional staff members that describe what the job entails. A majority of the information session is a Q&A. \r\n\r\nThe second stage is the application itself. The application package consists of a form, a cover letter, a resume, and two recommendation letters. The application form gives some specifics questions that should be addressed in the cover letter. Out of the two recommendation letters, one of them has to be from a Rowan Professional Staff member (so don't get two recommendation letters from two current RA's). \r\n\r\nThe third stage is to attend two workshops. These workshops vary from topic to topic. Just go into these workshops with an open mind. They are structured similar to the training the hired RA's go through. Again, be sure to attend and sign-in!\r\n\r\nThe fourth stage is the interview. The interview is set up with a panel of 3 to 6 members. The panel can consist of current RA's and professional staff members. The interview questions are structured to understand how you would perform in different situations that RA's go through. It doesn't hurt to know the policies, but it is not the most important thing. It is more important to talk about your personal experiences and strengths that you think are beneficial to fulfill the role.", "Interview Questions": "A few questions are about diversity. It may catch you off guard because even if you encounter on a daily basis, you don't think about it very often. "}, {"date": "24 Feb 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rowan University", "Interview Descriptions": "Took 3-4 month to get iterview. Interviewed by committee", "Interview Questions": "Had to make a presentation"}, {"date": "9 Sept 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rowan University (Glassboro, NJ) in Jul 2013", "Interview Descriptions": "I saw the opening at monster.com but applied through university website. They responded quickly and scheduled an in person interview the following week. It was an hour long interview with a panel. It was technical and non-technical both. There were also some sample coding questions. Overall, you needed to know your stuff to go through.", "Interview Questions": "Code samples"}, {"date": "15 Aug 2014", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rowan University (Jersey City, NJ) in May 2013", "Interview Descriptions": "She asked me to introduce myself ,then about my thesis ,and few simple questions .she made me so comfortable. Paper work started in a week .great place to work.easy interview ,better compensation than other places.we can learn a lot", "Interview Questions": "Nothing hard"}, {"date": "8 Nov 2012", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rowan University (Glassboro, NJ) in Jan 2012", "Interview Descriptions": "I got this job through a reference from a staff member. I had a bilingual background which was useful to a new project a department was launching. After being refered to the director, I got a brief interview asking about my background and my resume. THen I got the job several days later with an email notice.", "Interview Questions": "Everybody kinda doing everything in my office, so you have to be a fast learner. otherwise, you would need to ask someone else for help."}, {"date": "26 Mar 2012", "title": "Adjunct Physics Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rowan University (Glassboro, NJ) in Dec 2010", "Interview Descriptions": "Interview consisted of a chat with the Dean of the physics department. We talked about research and then she told me I had the job.", "Interview Questions": "Tell me about your research."}, {"date": "20 Aug 2013", "title": "Senior Management T Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Rowan University (Stratford, NJ) in Jun 2009", "Interview Descriptions": "A paperwork nightmare ... Multiple interviews with HR staff that clearly. Does not respect or like senior leaders.", "Interview Questions": "N/A"}]]