[[{"date": "9 Jun 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "initial phone call for hr related questions, followed by a meeting with a higher ranking person, mainly a casual conversation, then a conversation with an executive which is also mainly about resume and casual conversation, then a meeting with other directors where they ask bunch of non-technical questions. Overall i would tell you not to consider UMGC for any position, because it is such a disorganized place. They email you that done with interviews, and later on they email again to set you up with a final one. People that i talked there seriously made me question of \"how did you get here?\". i firmly believe that none of them desire those titles. none of them had a higher degree nor extensive experience nor willingness to learn new things. They just want someone like themselves who is not going to change anything around, certainly not going to challenge anyone. so, stay away", "Interview Questions": "mainly behavioral, resume discussion, and about job description."}, {"date": "18 May 2023", "title": "Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus (Savannah Beach, GA) in Apr 2023", "Interview Descriptions": "First phone call with recruiter and then an hour long interview with leadership. Interview process was streamlined and learned a lot about role. Conversational interview and felt comfortable sharing experiences and asking questions.", "Interview Questions": "How would you handle multitasking?"}, {"date": "15 Feb 2023", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Global Campus (Los Angeles, CA) in Feb 2023", "Interview Descriptions": "Straight forward and made it very comfortable to speak and provide your answers. Thought they did a great job and explaining and clarifying questions. Kept the conversation going and focused on position requirements.", "Interview Questions": "Why are you interested in this position?"}, {"date": "12 Dec 2022", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland Global Campus (Remote) in Dec 2022", "Interview Descriptions": "Was straight forward with introductions and moved into a few situational based questions and some follow up questions for each question. Was a panel interview with two people doing the interview and was a nice and friendly group. The interviewers provided time for me to ask questions and then it concluded.", "Interview Questions": "Handling a distributive student. Building on integrative technology. Changes that may be warranted on a syllabus."}, {"date": "6 Jul 2023", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus (Largo, MD) in Aug 2022", "Interview Descriptions": "Awesome interview process , extremely quick & normal , the standard questions were asked throughout the interview depending on the department is broken up into two parts one with the hiring team and another with the department manager", "Interview Questions": "What can you contribute to the organization"}, {"date": "14 Jul 2022", "title": "Success Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Applied application via website, but didn't receive email back for many weeks. Afterwards, process was very quick. First correspondence was 15 min. phone call. Second round was Zoom conference with director and assistant for 60 minutes but was cut short by 10 minutes. Was only able to ask 1 question at the end.", "Interview Questions": "Tell us about yourself. \r\nHow do you deal with change.\r\nEmphasis on using STAR method of answering questions."}, {"date": "29 Mar 2022", "title": "Student Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "The process took about 45 minutes to an hour and it was with one person. They asked questions and went over the job description salary and day to day operations", "Interview Questions": "What can you contribute to our department "}, {"date": "14 Apr 2022", "title": "Adjunct Instructor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Maryland Global Campus (College Park, MD) in Jan 2022", "Interview Descriptions": "Months after applying, I received an email from a recruiter asking to schedule an interview.\r\n\r\nOnline interview with a list of questions, asking about teaching background and teaching philosophy. Interview with k mg one person.", "Interview Questions": "What is  your teaching philosophy?\r\n"}, {"date": "23 Jan 2023", "title": "Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Maryland Global Campus (Baltimore, MD) in Nov 2021", "Interview Descriptions": "The interview was about 50 min with 2 directors of student success. They asked various questions in regards to experience, how to manage time management, lots of scenario questions. Emphasis on what to expect in the job.", "Interview Questions": "1. Tell us about your background 2. How do you manage multiple tasks? 3. How do you handle conflict?"}, {"date": "19 May 2021", "title": "Associate Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "I recieved a phone call to prep for the real interivew and to see if I am still interested in the position. Then a zoom interview was set up. I recieved an emai with a zoom link and the interivew lasted for 40mins.", "Interview Questions": "What experience do you have in a call center?"}], [{"date": "28 Feb 2021", "title": "Instrcutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "2-3 Quick interview with direct surpervisor. Talked about past experience and how I was fit for thee position. Ways i could be challenged in the role. Overall really great experience!", "Interview Questions": "Qualifications and how they stood up to the positon. "}, {"date": "3 Jun 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus (Castleton-on-Hudson, NY) in Mar 2021", "Interview Descriptions": "Easy interview and thought that it went great. I was told I would hear back with an offer and never received a reply. I tried to follow up with the recruiter but did not receive a reply. I never received any additional follow up.", "Interview Questions": "Could I work an alternative schedule? "}, {"date": "21 Nov 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Interview process was very nice. Interviewer was professional and personable. Made an effort to make interviewee comfortable during the interview. Provided all the information needed so that there were no questions once the interview ended.", "Interview Questions": "Job experience, interests, expectations of job, "}, {"date": "17 Nov 2020", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Easy, flexible and organized.I liked the experience.The HR person was friendly and efficient in explaining everything over the phone.Setting up the interview was also easy and efficient.I had to pass an online assessment.", "Interview Questions": "There was an online assessment.The assessment was timed. It was around 200questions."}, {"date": "4 Aug 2020", "title": "Admissions Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus (Albany, NY) in Jul 2020", "Interview Descriptions": "1) submitted online application\r\n2) Completed a virtual simulation of the job\r\n3) 5 minute phone screening\r\n4) 40 minute interview with 2 managers\r\n\r\nHonestly felt very disappointed in the level of transparency and trust in this company,\r\n\r\nUpon receiving an offer they would not allow me to view any written offers with out verbally accepting. That was a red flag. I knew this position was going to be a step down from my previous role however they made me feel very sub-par and did not acknowledge my previous working experience nor that I had my Masters.\r\n\r\nOverall I would not recommend working with them.", "Interview Questions": "Do you have any remote work experience?"}, {"date": "18 Apr 2021", "title": "Success Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus in Jul 2020", "Interview Descriptions": "There was an initial screening interview with the recruiter followed by a panel interview with three different individuals.  They had a series of prepared questions and took turns asking the questions.", "Interview Questions": "Tell us about a time where you encountered a difficult question, what was the question and how did you answer to customer?"}, {"date": "20 Jun 2019", "title": "Adjunct Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Maryland Global Campus in May 2019", "Interview Descriptions": "Friendly phone call, but that was not the issue. I was offered the job, accepted, then began the paperwork. The hiring process was disproportionately convoluted for an adjunction position background checks and official transcripts I understand, but this level of past employment verification, required previous years tax forms, having to go to a Notary public. Plus, I am still waiting to learn what the compensation would have been. I've had full-time jobs with less invasive on boarding. It sent up a huge red flag and I rescinded my acceptance.", "Interview Questions": "How did I handle difficult online learning situations?"}, {"date": "26 Mar 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "I was brought in for a 2+ hour interview with multiple people on the team and to review skills needed for the job. Had a bit of a test but was not difficult to do. Didn’t really describe the position well.", "Interview Questions": "What interested you in the position?"}, {"date": "25 Mar 2020", "title": "Academic Program Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Global Campus (Largo, MD) in Feb 2019", "Interview Descriptions": "The interviewer  were not professional questions were easy. The final interview was over complicated for a redundant job. Higher management seems to like to hear himself speak and most questions where about “communication” and seemed to not know his own job which should have been a red flag for me.", "Interview Questions": "Why do you want to work at UMGC?"}, {"date": "26 Nov 2018", "title": "Executive Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Maryland Global Campus (Adelphi, MD) in Nov 2018", "Interview Descriptions": "A recruiter found my resume on the internet. He called me and asked me a  few questions about my background. The salary for this position was already set (60 K)  .  The recruiter had me fix my resume and they submitted it for review. I was called for an in person interview a couple days later.  She asked why I have a degree in science and made a comment that people with PhD's make 40 K.", "Interview Questions": "Why do you have a Master's degree in Science and applying for Executive Coordinator ?\r\nHow would you handle a co worker asking you about confidential information?\r\n\r\n"}], [{"date": "21 Sept 2018", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Maryland Global Campus in Aug 2018", "Interview Descriptions": "Was first called by a recruiter and spoke with her for about fifteen minutes and that went very well. Then another recruiter emailed me to see when I would be available to have a second interview. Now in this message there was very misleading information: 1. She called it a \"WebEx interview\". 2. She said it was a \"business professional interview\" 3. She said \"the team looks forward to meeting you. These three items lead me to believe I was having a video interview with several people and it would take some time. I researched how to be successful in one of these video interviews because I had never had one before, and the biggest piece of advice way to have a very good microphone, so I went out and purchased one. Three day before I set up lights, and the morning of I did my hair, my make up, and dressed up. It ended up being a phone call which threw me to be honest, and then this person was saying she only wanted to talk to me for twenty minutes, when I was expecting an hour video call with several people. On top of this I know the woman only had her new manager position for two months as I looked her up online, and I believe she had never conducted interviews before and she did not do a good job with me. So, not only was I mislead on what kind of interview I would have, I was the likely the first interview of the day for the very first interview by this woman. She did not do as good job starting things off and I think I was who suffered for it, which is really disappointing.", "Interview Questions": "Tell me about yourself."}, {"date": "12 Jul 2018", "title": "Ask Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Interview process was swift and quick! Thoroughly enjoyed talking to current staff and felt like they wanted me to success from the first initial interview. Questions asked were appropriate and I could tell they had taken the time to view my resume and portfolio!", "Interview Questions": "What drew you to this position? "}, {"date": "14 Jan 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Global Campus (University Park, MD) in Jul 2018", "Interview Descriptions": "Somewhat long interview process but went by pretty quickly. Training is the longest part, your training for a few months until you are full fledged advisor. Was hired in July and finished training in September. It is more of a call center than a school.", "Interview Questions": "How do you put students first?"}, {"date": "26 Jul 2018", "title": "Military Education Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus (Fort Benning, GA) in Jul 2018", "Interview Descriptions": "I received a phone call to discuss pay and benefits of the position. The phone recruiter said I appeared to be a good fit and recommended me for a face to face interview. I had that interview one week later. I didn't hear anything back for two weeks, at which time I received an email informing me that the position had been filled.", "Interview Questions": "1. How do you view your relationship with clients? "}, {"date": "3 May 2018", "title": "Financial Aid Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Maryland Global Campus (Largo, MD) in May 2018", "Interview Descriptions": "Applied on Monday and by that Friday I had received a call from HR to do a phone screening.  Afterwards he said he would forward my information to someone and I should receive a call to schedule face to face interview. 4 days later I had my interview with a 3 person panel. They ask generic questions and I felt I answered them all with confidence. We all joked and laughed about things we could relate on so it wasn't super intimidating. At the end they let me know that they are still conducting interviews and would let me know within a week or two. I got a general email that next day saying I didn't get the job without stating why. Very disappointing!", "Interview Questions": "N/A"}, {"date": "24 Feb 2018", "title": "Security Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "I got a phone call asking a couple questions about “tell me a time you did this?” “Tell me a time you made a mistake and fixed it?” They were very polite on the phone and then I got a job offer as soon as the interview was done", "Interview Questions": "Tell me a time where you had to face a difficult task"}, {"date": "25 Jan 2018", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "I first had a phone interview. The person asked me to tell her about myself in terms of how many years experience I have, etc. They went over a few things about the company (the history and things like that). They went over the benefits package like paid time off, insurance, tuition remission, etc. They advised the date I'd be starting if I get offered the position. At the end, they advised they would submit all the info to someone else and they would decide whether or not to bring me in for an in-person interview. It wasn't long until someone got back to me and scheduled an in-person interview. I was interviewed by 2 people and was asked very standard interview questions. After the interview, I was shown around the office I would be working (which is almost always a good sign you're going to be hired) and met a few of the other advisors and managers. I was offered the job a few weeks later which was 3 weeks before I started working.", "Interview Questions": "Tell us about a time you did something wrong on the job and how it was handled."}, {"date": "23 Oct 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Phone interview was followed by a verbal offer, then a referral to HR.  After the phone interview, there was very little personal contact.  Most of the correspondence is by email.", "Interview Questions": "N/A"}, {"date": "23 Sept 2017", "title": "Assistant Regional Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "I applied for this job and hear back about a month later. They set up a short phone interview and asked about 12 pre-made questions. They also had me submit a writing portion where I answered a general question, just in a written format.", "Interview Questions": "When was a time you had to work with a difficult supervisor and how did you handle the situation?"}, {"date": "11 Oct 2017", "title": "Senior Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Maryland Global Campus (Boston, MA) in Sept 2017", "Interview Descriptions": "I applied in May and finally was invited to a Skype interview in September. Almost immediately I got the vibe that I was wasting my time as these two women couldn't have appeared less interested in talking to me. The one woman first asked me if I have any military experience. When I answered no, she got downright nasty, lecturing me about how that's a problem because they're on a military base, she rambled on and on about this which I thought was rather bizarre -- if having military experience was a requirement, then I shouldn't have been able to apply, much less be interviewed. And, really, what does it matter? I'm a grown adult and I think I can handle pretty much anything at this point in my life, so unless the applicant must learn to rise at 5am with the bugle then I saw no point to this issue. \r\n\r\nThe remainder of the interview didn't go much better. I use the word \"interview\" loosely, as a successful interview is supposed to be a discussion, not a \"game show\" -style question and answer, which is what this was. They each had their printed out list of generic questions which they read word for word, and each time after I answered they had zero follow up comments which might have drove it towards more of a discussion. Overall, I got the impression that they just didn't care. After an hour of this, they said I'd have to submit a design test where I had to design a poster within one hour. Normally, I avoid places that make you take these \"stupid until proven smart\" tests/assessments as they are insulting and indicative of a poorly trained hiring manager/team, but, after four months of waiting I decided to give them the benefit of the doubt despite all the red flags I was seeing. Today, I finally received a rejection email from them. I have a suspicion I was only interviewed to check off a box on the EEO compliance report.", "Interview Questions": "Have you ever worked with the military before"}], [{"date": "6 Jun 2017", "title": "MEC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Basic interview same usual questions no strange or unusual questions. Interviewer was nice and cordial everyone was attentive.  The job interview gave a look into what the job was going to entail. If you had issue with the interview questions then perhaps the job isn't best suited for you.", "Interview Questions": "What would you do with a difficult customer? "}, {"date": "9 May 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Maryland Global Campus (New York, NY) in May 2017", "Interview Descriptions": "Submitted for position online and received request to schedule a phone interview a few days later. Interview took one hour that was a casual conversation. Offered the position after the interview.", "Interview Questions": "Why do you want to teach?"}, {"date": "5 May 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus (Largo, MD) in Apr 2017", "Interview Descriptions": "I got an email stating my application was succesfully sent. Then within 5-7 business days I got an email stating someone wanted to speak to me for a phone interview. I scheduled the phone interview, than had two more face to face interviews and was hired for the job.", "Interview Questions": "What does customer service mean to you? What do you bring to a team? What is your greatest accomplishment this year? Why do you want to work for UMUC? Why do you want to be an Academic Adviser? Can you handle being micromanaged?  Can you tell us a time something you did had a bad affect? Do you know the role you are applying for?  Are you willing to work Saturdays, and days that you were intended to have off? Tell us a time you felt that you accomplished something at work? "}, {"date": "6 Jun 2017", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus in Apr 2017", "Interview Descriptions": "The preliminary phone screening interview was in response to an online application.  After the application was completed, I was contacted to discuss the position and my interest.  It was then left up to me if I was intersted in the specifics of this job before being considered for an in person interview.", "Interview Questions": "Why are you in the market for a new position?"}, {"date": "7 Nov 2018", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Maryland Global Campus (Largo, MD) in Apr 2017", "Interview Descriptions": "One phone interview\r\nTwo In-person interview\r\nThe first interview you have at a hiring event that you are invited to once you fill out the app online. Then you will be invited to a second interview will a panel of assistant directors, etc. After that your're pretty much in.", "Interview Questions": "Give an example of a time you disagreed with your supervisor?"}, {"date": "14 Feb 2017", "title": "Financial Aid Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "After submitting online application; you may get a pre-screen phone call from the HR team in which they discuss the bare minimum details about the position (including salary, gauge your interest level and discuss the day to day of the job). After pre-screen phone call, you do another phone screen (15-20 minute call ) with department Associate Director. You are notified by email if you move forward with face to face interview. You will have face to face interview with multi-person panel; lasts approximately 30-45 minutes and you are notified via email if you are offered a job or not.", "Interview Questions": "Why did you want to work at UMUC and what interests you about Financial Aid/ Federal Aid Programs? "}, {"date": "3 Mar 2017", "title": "Transcript Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus (Largo, MD) in Feb 2017", "Interview Descriptions": "Met two people panel. General interview questions about precious experience. Some questions about the job requirements, detail oriented and good communication skills. Had to do a skills test on transcripts evaluation after the interview. Generic interview questions.", "Interview Questions": "How are u detail oriented for this job?"}, {"date": "24 Jun 2021", "title": "Undergraduate Advisor Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Maryland Global Campus in Jan 2017", "Interview Descriptions": "It really came down to who you know. If i wasn't working there already i dont think i would have gotten the job. I was fine position at the time. That helped me.", "Interview Questions": "Name 3 strengths you have"}, {"date": "27 Sept 2016", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland Global Campus (New York, NY)", "Interview Descriptions": "Contacted by HR via email for a quick screen, then Webex interview. I did amazing in the interview and they told me I'd move to the next round (probably happening the next week). I wait two weeks and drop them a line to get an update, and I'm told the interviewer is busy but that I should hear back the next week. That week comes and goes, another half week goes, and still nothing.\r\n\r\nI understand people get busy, but at a certain point it just becomes poor time management on the part of the interviewer, not \"busy\".", "Interview Questions": "How would you drive enrollments?"}, {"date": "30 Mar 2017", "title": "Transcript Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus (Adelphi, MD) in Jul 2016", "Interview Descriptions": "it was easy to apply to multiple positions online. First they called me for a phone screen process then said they would pass my information along to the hiring manager who would call me the next week. The hiring manager called the next week and we spoke.", "Interview Questions": "What salary are you expecting?"}], [{"date": "12 Jul 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Maryland Global Campus (Baltimore, MD) in Jul 2016", "Interview Descriptions": "Phone call interview, with a submission of a resume and cover letter before hand.  Focused on providing hands-on experience within my professional realm.  More of a discussion about what UMUC is all about.", "Interview Questions": "Do you have experience teaching?"}, {"date": "5 Mar 2016", "title": "Field Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "I had an interview with the regional manager. The manager asked me the normal questions, why I wanted the job, what were my strengths and weaknesses and how I could bring myself apart from the other candidates. It was a 30 minute interview and it was pretty straightforward.", "Interview Questions": "Why do you want this job?"}, {"date": "14 Jan 2017", "title": "Project Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at University of Maryland Global Campus (College Park, MD) in Jan 2016", "Interview Descriptions": "Long, 3 interviews over 2+ months with a phone screen, and multiple panel interview days.  Long wait from initial interview & phone screen for a decision.  Many questions about people and navigating difficult culture, which turned out to be true.", "Interview Questions": "How do you lead people & project teams?"}, {"date": "14 Jul 2016", "title": "Operations Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Maryland Global Campus (Largo, MD) in Nov 2015", "Interview Descriptions": "Applied and was contacted the next day for a phone interview with HR. Conducted the phone interview and was moved on to an in-person interview. Interviewed with 4 different managers and was called back the next day to interview with 2 higher level managers. Overall, many questions about background and ability to work with data and analysis.", "Interview Questions": "1. Do you have experience with extracting data and manipulating the data?\r\n2. Explain your experience with writing and communicating business processes and procedures?\r\n3. Provide background in working with CRM systems, specifically Salesforce?"}, {"date": "9 Oct 2015", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Maryland Global Campus in Aug 2015", "Interview Descriptions": "I applied online and was contacted within 3 business days via email to schedule a phone interview. I emailed back letting the recruiter know what times I had available. She called me later that day for a brief interview. She told me that she would forward my answers over to the hiring team and let me know if they wanted to move forward. I got a call the next day from that recruiter letting me know that they wanted to move forward with an in-person interview. About a week later I interviewed at their campus in aldelphi because they couldn't get me cleared or something to interview on base where I would be working. It was a 3 person panel interview. It lasted about 40 minutes. It went well and they didn't ask any questions I didn't know the answers to. After 2 weeks i followed up with the recruiter because I had not heard back, and she told me they ended up going with an internal candidate (hate when that happens). She apologized that she had not let me know sooner, but said it was because the hiring team liked me and wanted to try to create another position for me. She said she would continue to keep in touch to give me a timeline on that process. I haven't heard back since, so I am assuming it's a no.", "Interview Questions": "What would you do first if you came in for your shift in the morning and you  have voicemails to answer, 100s of emails, and a student in the lobby waiting to meet with you?"}, {"date": "4 Nov 2015", "title": "Team Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus (Largo, MD) in Aug 2015", "Interview Descriptions": "Applied to this job, and heard from them three weeks later. Interview and communication was conducted via e-mail only. A week later, I waited a half-hour for my interview to begin. While annoyed, the time gave me insight re: the work culture. Very unfriendly workers; some condescending staff; and a lot of employees are on edge (the reviews here are spot on). Needless to say, noticing the lateness and vibe, I wasn't too interested in working here. \r\n\r\nHowever, I proceeded with the group interview, knowing my answers and personality wasn't a good fit. Naturally, I wasn't surprised that I never heard back from them...", "Interview Questions": "What type of work environment do you like? How do you handle difficult situations or people? What are your greatest strengths and weaknesses? "}, {"date": "6 Jul 2015", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Global Campus in Jun 2015", "Interview Descriptions": "The process took a few weeks, interview questions were mainly concerning sales. This is a phone center environment. Interviewers were nice. The interview felt right, but received a email directly after saying I didn't get the job", "Interview Questions": "Tell me about yourself"}, {"date": "13 Nov 2018", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Global Campus in Jun 2015", "Interview Descriptions": "Spoke with a representative on the phone for screening about two days after applying online.  Official interview was with a panel of three employees (two managers and another employee in a separate financial aid department). Interview lasted less than 20 minutes and had about 12 questions.", "Interview Questions": "Was working in customer service filed prior to starting this job and was a recent college graduate."}, {"date": "13 Jul 2015", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus (Largo, MD) in Apr 2015", "Interview Descriptions": "I was contacted by HR a few days after applying to set up a phone interview with HR. This phone conversation was very basic; a typical phone screen; seeing how your experience lines up with what the hiring manager is looking for. I then met with the person who was hiring for the position. The interview was very casual and conversational; she encouraged questions throughout. After that was to be a panel interview.", "Interview Questions": "Describe a challenge you've overcome in the workplace"}, {"date": "24 Jun 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Maryland Global Campus (Adelphi, MD) in Mar 2015", "Interview Descriptions": "Submitting through the employment portal was frustrating and non-responsive. Had to physically print out application, visit a UMUC site and have local staff forward materials to the hiring manager before there was any forward movement. After that, the hiring process was easy, consisting of two interviews, a verbal offer, and a written offer within one week.", "Interview Questions": "What are some ideas you have for improving the online learning experience?"}], [{"date": "29 Jan 2015", "title": "Assistant Vice President, Retention Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "These folks cannot pull the trigger!\r\n\r\nAfter a 3 month interview process, including half a dozen rounds, with group interviews, presentations, one on ones, etc. they could not make a decision once they got down to 2 candidates (from an original pool of 85).  My first interview was with the VP who was the hiring manager, everything else I was put through was to seek \"alignment\" with other team members.\r\n\r\nVery weird organization...", "Interview Questions": "No difficulties, just endless interviews"}, {"date": "24 Nov 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "I was contacted by the HR person after 2-3 months of applying and she asked if I am available for an interview at the advisor career fair. I was told to bring my resume, cover letter and a writing sample. They gave me two choices for the writing sample. The interview was okay. They asked a lot of questions about different job situations and how would you handle it. two people interviewed me", "Interview Questions": "How do you respond in a previous job when you had to perform a job function and you are waiting on the manager to give you instrctions?"}, {"date": "12 Nov 2014", "title": "Field Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "After seeing a local posting for a Field Representative position, I submitted a paper application in person and scheduled an interview with the Senior Field Representative when I dropped off the application. The interview was straightforward and fairly easy. There were basic questions about my job history. The Senior mentioned she hired me because of my history of working with adult students. Be sure to understand the dynamics of UMUC Europe before the interview (non-traditional/military students, overseas sites, etc). They definitely wanted to know if I knew how UMUC Europe was different than other universities.", "Interview Questions": "Describe a situation where you had to deal with a difficult customer. "}, {"date": "27 Oct 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "The hiring process was excellent.   I had an interview and talked with several faculty and staff for them to figure my management and leadership capabilitites. From there I waited for a bit ewhen I got a call for an offer.", "Interview Questions": "N/A"}, {"date": "16 Jun 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Maryland Global Campus (Largo, MD) in Nov 2014", "Interview Descriptions": "All those brought in for interview are sitting in chairs waiting to be called forward. 8 sets of two current supervisors in the specific department will conduct interview. They ask 3-5 questions related to position and judge answers and past experience. If you pass the initial review they will have a team of current advisors take you on a brief tour of the departments and where you would be working.", "Interview Questions": "Tell us about a time when you were dealing with a frustrated student and what you did to ease their anger and fix the situation?"}, {"date": "4 Nov 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus (Largo, MD)", "Interview Descriptions": "Good interview. Basically questions on handling customers and students. Very relaxed interview that made me feel comfortable throughout. Tour of the facility was nice and met the staff. The staff was very informative on what was expected of the job.", "Interview Questions": "What is the most difficult situation you faced?"}, {"date": "26 Aug 2014", "title": "Administrative Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Everything was done on the phone (this is a remote position). I was interviewed by the director and assistant director (both have been replaced since-- moved on to other jobs). The director had a list of questions about my experience at this job and my education, but then departed from the list to ask more specifically about my philosophy of education. That was interesting. The assistant director was quiet, but added some questions about my sense of the mission of education and specifically online education. \r\nIn the first interview, there wasn't much explanation about the salary and actual work. The second interview (when it was pretty clear they were going to offer me the job), they were more open about that. Of course, both left a year later, and the new administrators had their own way of assigning work, so we had to learn as we went. I had no contact with HR until it came time to fill out the many employment forms.", "Interview Questions": "They asked in the first interview what about the mission of the organization I thought fit my personal mission, and I had to quickly google to find what the mission statement was! (I should have prepared better.) "}, {"date": "21 Jul 2014", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "3 interviews: 1hour interview on the phone. 2 three hour interviews in person with a group of peers and hiring manager. The questions were read from a list.  The interviews felt more like interrogations  rather than a conversation.", "Interview Questions": "Although we are an educational institution, we don't have any formal training for our employees, how would you go about learning the requirements of the job? "}, {"date": "16 Jul 2014", "title": "Senior Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Multiple phone and onsite interviews spread out over three days and spanning several months.  Would go weeks without contact, was told an offer would be coming, but no offer ever came.", "Interview Questions": "None.  Relatively easy interview."}, {"date": "6 Aug 2014", "title": "Organizational Development Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at University of Maryland Global Campus (Adelphi, MD) in Jul 2014", "Interview Descriptions": "UMUC posted the position on LinkedIn.  I did a series of panel interviews--one with their HR leader, another with two folks from the Training department and another with three members of the HR team.  The process was three hours and quite draining as the interviewers all asked the same questions....three times in a row.  Imagine being asked three times why you are looking for a new job, what your strengths are, what your weaknesses are and what makes you the best person for the job.  The interview portion with their HR leader was horrible.  Imagine someone asking you to validate every item on your resume--it felt more like an inquisition than an interview.  I should have left after the first hour.  By the time I was done, I felt completely unwelcome there.", "Interview Questions": "What was the last book you read and why?"}], [{"date": "18 Jun 2014", "title": "Collegiate Professor and Program Director of Strategic Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Initial telephone interview, followed by on site interview with selection team, then follow-up with the Executive Director of Executive Programs. Ending with discussion of salary requirements, over several iterations resulting in agreement.", "Interview Questions": "Would I relocate to Maryland?"}, {"date": "29 May 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "Asked a variety of questions and they was not your typical interview questions. It was about 3-4 pages of questions and there was a panel of 3 people going back and forth asking you different questions.", "Interview Questions": "If hired, what would you do in a difficult situation?"}, {"date": "4 Jul 2014", "title": "Collegiate Faculty Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland Global Campus (Adelphi, MD) in Feb 2014", "Interview Descriptions": "Phone screening and two interviews in person with a search committee consisting of faculty, administrators, and staff. There were no signs during the interview process that the position would be canceled before anyone was hired.", "Interview Questions": "How would you handle a student complaint knowing the university's goal to improve student retention?"}, {"date": "23 Nov 2013", "title": "Marketing Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Global Campus", "Interview Descriptions": "There were several screenings prior to the actual interview.  Though the culture seemed to be very driven by camaraderie, the stress level in this environment is highly questionable due to the constant change in direction.   It seemed it would be very difficult to meet the requirements of leadership when they are constantly changing.", "Interview Questions": "If hired, which skills would you need to develop?  "}, {"date": "21 Nov 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland Global Campus", "Interview Descriptions": "relaxing and friendly", "Interview Questions": "Use four adjectives to describe yourself."}, {"date": "11 Mar 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus (Largo, MD) in Oct 2013", "Interview Descriptions": "The interview was very thorough. They asked a lot of scenario based questions and even had me do a mock phone call with a student. I interviewed with one person and was given a tour of the building.", "Interview Questions": "They asked how well I work under pressure with difficult situations. "}, {"date": "14 Apr 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of Maryland Global Campus (Largo, MD) in Jul 2013", "Interview Descriptions": "Was offered an interview about a month after applying. From there, came to interview in person and was offered the position about two weeks later. The interview was conducted by a panel of assistant directors who asked me a series of very standard interview questions.\r\n\r\nI smiled often, played up my collegiate student affairs background, and talked at length about how I was interested in higher education. I was not taken on a tour of the office, and the whole interview itself took about 30 minutes. \r\n\r\nOverall there was a lot of uncertainty between application - interview and interview- offer.", "Interview Questions": "Why do you want to work here?\r\n\r\nWhat is your experience and background with higher education?\r\n\r\nAre you comfortable with speaking on the phone?"}, {"date": "22 May 2013", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at University of Maryland Global Campus (College Park, MD) in May 2013", "Interview Descriptions": "Fast response from resume submit\r\nInterview with too many people that have no clue", "Interview Questions": "How much would you outsource the department"}, {"date": "7 Apr 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland Global Campus (Largo, MD) in May 2013", "Interview Descriptions": "I was called for a phone interview. After passing that I was called in to speak with two Assistant Directors (ADs) in a panel-like interview. They then took me on a tour of the place and made sure that I knew it was a call center environment. I heard back from them 3 weeks later letting me know I got the job.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Nov 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Global Campus (Adelphi, MD) in Feb 2013", "Interview Descriptions": "Phone interview was held  for an hour.  There were three academic directors involved. Main interviewer was MBA program director, others were HR director, and one more  unknown director. They asked question one by one, and I have explained to them about my academic as well as company executive experiences.  Main director offered me an adjunct faculty as a full professor considering my 11 years of university faculty experience, and I have accepted right away.", "Interview Questions": "Why do you apply to our job?  What kind of teaching experience do you have?  How can you teach adult students effectively? etc."}], [{"date": "28 Oct 2017", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Maryland Global Campus (Rockville, MD) in Jan 2013", "Interview Descriptions": "My interview process started out after I had been a student with the same professor for a few classes. My interview went very well, it was done in person on campus. The interview was very informative on what I needed to do.", "Interview Questions": "Was I available to work"}, {"date": "18 Mar 2013", "title": "Associate Vice President, Retention Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Maryland Global Campus (Largo, MD) in Dec 2012", "Interview Descriptions": "Interviewed 6 times over 2 months, made it to the finalist round and was told position was being kept open.  I've never worked in higher ed and frankly after this process I'm not sure I'd like to...\r\n\r\nThe really weird thing is that this process started with an onsite interview with the hiring manager and then all the follow up interviews were with other teams/groups; including a panel interview with a dozen people simply going around a room asking me questions (based on those questions, I doubt very seriously any one of them even took the trouble to read my resume).\r\n\r\nApparently this was all focused on building a consensus in the final decision.", "Interview Questions": "Nothing about the interviews themselves was really difficult or unexpected, just the fact that these guys had me back half a dozen times and then couldn't make a decision."}, {"date": "30 Sept 2013", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland Global Campus (Largo, MD) in Aug 2012", "Interview Descriptions": "Hiring and Interview Process took 2 months.  I did not interview with HR, only the department staff and a  staff person from another department. Support staff were very nice and professional, the red flag should have been the eye rolling and twitching Hiring Manager and the lack of enthusiasm from the other interviewer who is no longer at UMUC.", "Interview Questions": "No difficult questions, however, I should have asked more questions about budget accountability, ED's managerial style and requested an interview with HR about the high turn over rate in the department."}, {"date": "30 Dec 2016", "title": "Adjuct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Global Campus (Landover, MD) in Aug 2012", "Interview Descriptions": "telephone interview.  Basic background questions.  Teaching philosophy.  Courses that you have taught.  quick interview.  Nothing extraordinary.  Then completed the I9, W4, state withholding and other forms.", "Interview Questions": "How long have you been teaching. "}, {"date": "26 Feb 2014", "title": "Document Management Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at University of Maryland Global Campus in Jun 2012", "Interview Descriptions": "The hiring process was fairly easy.  The interview consisted of a panel interview of about 3 people, including the hiring manager.  The questions were standard interview questions.", "Interview Questions": "What are 5 of your weaknesses?"}, {"date": "19 Nov 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Maryland Global Campus (Adelphi, MD) in May 2012", "Interview Descriptions": "I was not formally interviewed for the position I currently hold. The director called me and chit chatted with me for ten to fifteen minutes and asked me maybe 2 questions.", "Interview Questions": "I wasn't actually asked any questions relating to the job I had applied for."}, {"date": "6 Jan 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland Global Campus (Adelphi, MD) in May 2012", "Interview Descriptions": "Applied through online system. I was initially interviewed informally over coffee by the program director to gauge my interest in the specific assignment she had in mind for me. (Course development for a new degree program.) I wasn't all that thrilled, initially, as I wanted to teach, When she explained that it was her practice to assign the course developer to teach the first section of the new course when implemented, I agreed. She then arranged for a formal telephonic interview with herself and another program director. The questions were typical academic interview questions and the interview was a much as them explaining the expectations of UMUC as it was about eliciting responses from me. The entire process was relatively pain free.", "Interview Questions": "To explain my teaching philosophy."}, {"date": "22 Sept 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Maryland Global Campus (Adelphi, MD) in May 2012", "Interview Descriptions": "Interview process is based off of a panel. It was very personable and did not take more than 15 minutes. They called within the next couple days to tell me that I had the job.", "Interview Questions": "Went over basic strength and weakness"}, {"date": "27 Dec 2012", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Maryland Global Campus (College Park, MD) in Apr 2012", "Interview Descriptions": "Telephone interview", "Interview Questions": "None"}, {"date": "14 Aug 2014", "title": "Collections Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland Global Campus (Hyattsville, MD) in Feb 2012", "Interview Descriptions": "Long and drawn out over a 2-3 month process, it was a very easy interview and not much pressure.  I had a lot of interest in the job, but the length of the process when doing interviews that never lasted more than 30 minutes could have been condensed in 1 lengthy interview.", "Interview Questions": "N/A"}], [{"date": "8 Dec 2011", "title": "Director, Customer Relantionship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Global Campus (Adelphi, MD) in Oct 2011", "Interview Descriptions": "The interview was very thorough from the telephone to the 1:1 to the Group Panel process. The staff that conducted the interview was very helpful and followed a clear state government interview process.", "Interview Questions": "What major challenges and problems did you face? How did you handle them? "}, {"date": "18 Mar 2015", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maryland Global Campus in Oct 2011", "Interview Descriptions": "When I interviewed with UMUC I was very honest about my expectations, and I feel like they put me in a position that was every I never wanted in job.", "Interview Questions": "I don't remember."}, {"date": "10 May 2011", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Maryland Global Campus (Largo, MD) in Aug 2010", "Interview Descriptions": "Interview was very well-run.  Generally you meet with one upper level management and a direct supervisor.  Writing sample is required.  No oddball questions; pretty straightforward process - why you want to work there, situational questions, background experience questions, etc.", "Interview Questions": "What do you know about UMUC?"}]]