[[{"date": "8 May 2023", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Changi General Hospital (Singapore)", "Interview Descriptions": "Good feedback session with the AD, DD, and C suite with the Talent and Acquisition team. The whole process is indeed awesome and I did have a wonderful time during the interview.", "Interview Questions": "What do you dislike about being an administrative assistant?"}, {"date": "19 Oct 2022", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Changi General Hospital (Singapore) in Jun 2022", "Interview Descriptions": "Short and to the point with the customary questions about describing myself and why am I interested in the position. There were 4 interviewers and the interview was very informal with the interviewers being very friendly helping to reduce the stress of the interview.", "Interview Questions": "Why did you choose to apply for this position at CGH?"}, {"date": "11 Apr 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Changi General Hospital", "Interview Descriptions": "It will be with a panel of healthcare professionals, one round. Questions regarding your passion for the job, understanding of the job will come up. Will also ask you what you want to contribute to the job", "Interview Questions": "What do you think you can contribute as a therapist for the organisation?"}, {"date": "3 Feb 2022", "title": "Facilities Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Changi General Hospital in Dec 2021", "Interview Descriptions": "it's a smooth interview process, however, the interviewers asked a few questions that were out of the job description/requirements. The interviewers are more focused on your relevant working experience (technical questions)", "Interview Questions": "why you are leaving your current job?"}, {"date": "14 Oct 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 5 weeks. I interviewed at Changi General Hospital", "Interview Descriptions": "2 sessions Test of knowledge in Pharmacy field Interview with senior and HOD ,Email for offer letter \nOverall a good description on job offer and daily task or duties duties perform", "Interview Questions": "Why we chose to work here?"}, {"date": "4 Sept 2021", "title": "Physiotherapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Changi General Hospital", "Interview Descriptions": "it was a one on one face go face interview with one of the main physiotherapists. they went through your qualifications and grades and asked a bit about why you want to be a Physio", "Interview Questions": "they asked about your clinical experience "}, {"date": "1 Aug 2021", "title": "Community Partnership Executive Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Changi General Hospital in Jul 2021", "Interview Descriptions": "The interview went alright and they were interested to know about yourself and your work experience. What was upsetting is that HR called me up and verbally offered me the position after I completed the interview a week ago.  However, there were no follow-ups after 2 weeks since HR last called me. I contacted them and asked for the updates but to my dismay, the job offer was retracted since I did not have past experience in community healthcare. Then why give the candidate false hope and not seek approval from the rest of the management before informing the candidate of the job offer? Very unprofessional and distasteful. Hope no other candidates have to experience what I've gone through", "Interview Questions": "Why do you want to work in this job position? Where do you see yourself in the future in terms of your career? Tell me more about yourself"}, {"date": "31 Aug 2021", "title": "Associate Executive, Comm Psychogeriatric Prog CPGP Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Changi General Hospital (Singapore) in Jul 2021", "Interview Descriptions": "It was a contract position with only 9 months left to the contract. Panel interview with HR, Doctor & supervisor I suppose. Overall felt like an interrogation, there wasn't a back and forth conversation where each party can obtain information from one another.", "Interview Questions": "Why do you want to join healthcare? "}, {"date": "21 Feb 2021", "title": "Analyst/Senior Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Changi General Hospital", "Interview Descriptions": "Guy just rambled for 1.5 hours after asking the usual \"tell me about yourself\". HR was there as well. The connection was also quite spotty.\r\n\r\nHe asked industry specific question, which you would not know unless you've been in the industry. So you can't just have the required DS/ML knowledge but need to know the domain. It's a catch-22 situation.", "Interview Questions": "Please tell me about yourself."}, {"date": "2 Feb 2021", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Changi General Hospital (Singapore) in Feb 2021", "Interview Descriptions": "Interview duration was average. Has three interviewers and they were very friendly. Was nervous at first but felt comfortable with them. Questions asked revolve around my resume and experience.", "Interview Questions": "Describe yourself  and what’s your strength and weaknesses "}], [{"date": "1 Apr 2021", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Changi General Hospital in Feb 2021", "Interview Descriptions": "Hiring and interview process was very fast (Within the same month). Interview itself was relatively fast - about 20 mins. Interview panel was straightforward with their questions and was not intimidating at all. They knew what they wanted to know about me and questions were not daunting as well.", "Interview Questions": "Why did you choose the healthcare industry?\r\nHow can your previous work experience contribute in your current role?\r\nAre you open to shift hours?"}, {"date": "31 Mar 2021", "title": "Social Work Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Changi General Hospital in Oct 2020", "Interview Descriptions": "Shortlisted for interview within 5 days. The interview was taken place at CGH instead of online interview. There were 1 hr staff and the other 2 social work higher ups. Whole process during interview took about 20-30 minutes, pretty fast although the waiting time took quite a while to start.", "Interview Questions": "Why did you choose to join CGH?"}, {"date": "10 Aug 2020", "title": "Allied Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Changi General Hospital", "Interview Descriptions": "One HR representative and one from the department you are applying to. First section is the regular question and answer during the online meeting, followed by your own questions if you had any. Straight forward process", "Interview Questions": "Why should we hire you? "}, {"date": "21 Apr 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Changi General Hospital (Singapore) in Jul 2020", "Interview Descriptions": "The interview process was collegial and fairly efficient. The HR personnel were professional and friendly. As it was during COVID-19 restrictions, the interviews were via phone and virtually. Overall a good experience and process compared to some other organisations.", "Interview Questions": "Why do I want the job"}, {"date": "1 May 2020", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Changi General Hospital", "Interview Descriptions": "Interview went well and was offered the position but at senior executive instead. Was told by HR that they can’t offer me assistant manager  even thou I’ve met the requirements as this will upset the existing managers in the organization as they have been with the them for very long.  Unfair assessments to experienced candidates.", "Interview Questions": "Past working experience"}, {"date": "12 Sept 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Changi General Hospital", "Interview Descriptions": "2 interviewers, ask questions about job related past experience, also  ask questions on job expectations, able to start immediate as department was shorthanded, pose questions on hobbies and also experience with working in hospital", "Interview Questions": "Why do you want to work here, and not other research instituition?"}, {"date": "11 Jun 2019", "title": "Senior Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Changi General Hospital (Bedok New Town, ) in May 2019", "Interview Descriptions": "Interview was conducted smoothly. The interviewer explained the job role and expectation of the position applied. The type of challenges that we will face and what we will be expecting in the working environment.", "Interview Questions": "Why choose healthcare industry?"}, {"date": "20 Feb 2019", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Changi General Hospital", "Interview Descriptions": "Basic interview questions were asked. Nothing spectacular or extremely difficult  qn. But overall all interviewers were genuine and nice. Really need to figure out why you want to work here.", "Interview Questions": "Motivation"}, {"date": "17 Feb 2022", "title": "Counsellor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Changi General Hospital (Singapore) in Sept 2018", "Interview Descriptions": "Informed via phone call, overall process was quite smooth. Had one interview in total. Interviewed by head of department and consultant. HR was also seated in the interview. Fair questions asked, mainly about your experiences and how you manage certain cases.", "Interview Questions": "Previous experiences in caring for client"}, {"date": "3 Mar 2018", "title": "Executive Team Leader-Operations Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Changi General Hospital (Tampines New Town, ) in Oct 2017", "Interview Descriptions": "It was a employee referral. My name was referred to the hiring manager of the hiring department. An interview date and time was fixed, and thereafter I went ahead to meet the hiring manger and a HR representative to have the interview.", "Interview Questions": "Why should we invest so much resources in you to develop you, and then have you leave for a Management Associate Programme?"}], [{"date": "5 May 2021", "title": "Biomedical Engineer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Changi General Hospital (Singapore) in Jun 2017", "Interview Descriptions": "Interview was fast. Interviewer was friendly. The interviewer would casually ask simple questions and the things intern has to do such as the workflow, expectations. Overall the interview took less than half an hour without pressure.", "Interview Questions": "Why did you choose Hospital instead of Vendors?"}, {"date": "30 Sept 2020", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Changi General Hospital (Singapore) in Sept 2016", "Interview Descriptions": "Case studies, appropriate questions regarding skills, \r\nBackground check, resume, cover letter, phone call check. Two rounds of interview. Proper process. Professionally done. \r\nSubmission of resume - phone call - First interview - second interview - phone call confirmation - signing of contract\r\nWas alright overall. A normal interview process.", "Interview Questions": "Case study on clinical skills and where do u see yourself in five years"}, {"date": "24 Jun 2019", "title": "Full Time Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Changi General Hospital (Bedok New Town, ) in Apr 2015", "Interview Descriptions": "HR call for interview, met HR and the boss and after 1 week, offer was made. Once appointment letter was signed, I was recruited and started work as I had resigned and was serving notice at that time.", "Interview Questions": "Tell us about youtself"}, {"date": "1 Aug 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Changi General Hospital in Jun 2013", "Interview Descriptions": "two rounds of intensive interviews after many sets of written tests; though they are difficult, i am glad that i have been given the job.  Because of the stringent selection process, there has been a reasonabl good person-job fit.", "Interview Questions": "how to improve the manpower crunch situation in public healthcare sector in Singapore"}, {"date": "22 Nov 2016", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Changi General Hospital (Singapore) in Oct 2012", "Interview Descriptions": "My interview was initially over a video call. The interview lasted over an and I was interviewed by one of the Principle pharmacists and the Chief of the department. They were very friendly and the interview started very casually with general introductions. It then went on to by previous experiences, future aims and clinical knowledge with some clinically based questions. The interview also included some practical problem solving and my ability to adapt to new cultural environments as I would be moving for the UK to Singapore.", "Interview Questions": "They asked me a few clinical questions such as drug interactions and evidence based treatment options."}]]