[[{"date": "26 Feb 2023", "title": "HR Business Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "One interview over zoom and another in person. First with 2 people then with 5. This was for an entry level position but with other positions Ive heard you have to give presentations to departments.", "Interview Questions": "Tell us about yourself? How you do prioritize tasks?"}, {"date": "17 Feb 2023", "title": "Client Hardware and Software Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "30 minute interview, technical and the rest was about myself. Very easy technician questions. If you know how to repair basic needs for laptops and towers you are in. Also be likeable person because you will be customer facing.", "Interview Questions": "Cant recall any questions at this time."}, {"date": "6 Jun 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "Super easy and intentional. I felt like they truly cared about each person who interviewed.  The process was overall fast.  They were going through HR  turnover so it was more timely to move forward.", "Interview Questions": "Explain what diversity means to you."}, {"date": "21 Aug 2021", "title": "Adminstrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Metropolitan State University of Denver (Denver, CO) in Jul 2021", "Interview Descriptions": "The interview process was complete and detail oriented. After a series of interview with staff at all levels of the department to determine fit, I was offered a position. I could not be more thrilled with the interview process, its rigor, and the commitment shown by the university to find the right personalities and qualifications to serve at MSU Denver.", "Interview Questions": "What about your background makes you a good candidate to work at MSU Denver.  "}, {"date": "5 May 2021", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "1st round was a phone interview with the team members and recruiter, they asked some technical and behavioural questions. Second round was 2 phases one with hiring manager and dev team. Second one was with other team members. They discussed about role related skills, asked questions on projects,SQL, Git,  SQL, Java, Fundamentals, Behavioural, over all fit into the team etc", "Interview Questions": "SQL, Java, Fundamentals, Behavioural, over all fit into the team"}, {"date": "16 Sept 2020", "title": "Health Career Navigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metropolitan State University of Denver (Denver, CO) in Jun 2020", "Interview Descriptions": "The interview process took 3 months. I applied in May, with first contact on around the second week of June. First, I had a phone interview, and it went really well. Two weeks later, I had a Zoom interview with the same people I had the initial phone interview with, plus another individual in the department. As I progressed through that, I had another Zoom interview about 3 weeks after that. Everything went smoothly, and I was told they were going to reach out to my references. Another week went by, and I followed up, asking how the reference checking process was going. I did not hear back for another week, in which I heard it was going well and I would hear of an update soon. Another week went by, and I got a generic rejection email from the university. When I reached out to HR for feedback I got an email reading, \"Hello (misspelled my name), we opt not to provide feedback to applicants. Please feel free to watch our job postings and apply through our website\" \nAfter 3 months, I would hope to hear some sort of feedback to understand why I was rejected.", "Interview Questions": "Tell us about a time you had to work with a difficult individual. How did you handle it?"}, {"date": "10 Feb 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "The process was standard and quite long, which is typical for higher education.  I had a zoom and phone interview and met for an onsite interview with a hiring committee and then presented to the community.", "Interview Questions": "What is one project you have worked on in the past that was successful?"}, {"date": "2 Sept 2018", "title": "Admissions and Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "Ridiculous. It took literally six months from initial contact to job start. Committee, group and one-on-one interviews ad nauseum. Sheltered by state taxpayer subsidies, this was a common experience. Nimble competitors could hire the best talent while the state process ground slowly along...", "Interview Questions": "There were so many interviews I can't remember."}, {"date": "24 Jul 2018", "title": "Arts Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "No interview took place. It did however take two months for any update on the status of the position. No communication whatsoever from the university despite weekly calls and bi-weekly e-mails. The only people I was able to reach had no information about the application process other than what I could find out myself online.", "Interview Questions": "N/A"}, {"date": "23 Aug 2018", "title": "Supplemental Instructoe Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Metropolitan State University of Denver (Denver, CO) in Jul 2018", "Interview Descriptions": "Was contacted for a phone interview in which I was interviewed by 5 people.  The interview experience was great and I thought it went well. I wasn't offered the position, which is fine, but no one ever followed up to let me know that the position had been filled. Waited for weeks without hearing anything back, despite two follow-up emails. Rude and unprofessional.", "Interview Questions": "Previous experiences, situational/behavioral questions related to the job duties."}], [{"date": "22 Sept 2022", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Metropolitan State University of Denver in Jan 2018", "Interview Descriptions": "It was a good job interview clear direct and I learned alot about the position. Not hard very easy going. I thought it was very professional Good work environment . On campus was a plus", "Interview Questions": "What are your goals for the future"}, {"date": "15 Nov 2017", "title": "Career Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "Applied online. Received an e-mail about 2 weeks after I applied saying that I meet the position's requirements and I'll hear back . One week later, received another e-mail stating I'll be contacted for an in-person interview. The next week, I went in person for the interview. It was a very positive experience, but I unfortunately didn't get the position.", "Interview Questions": "Describe your experience advising people in a higher education setting"}, {"date": "24 Jul 2017", "title": "Process Transformation Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "Auto-emailed asking whether I was okay with salary band, after a replying back in the affirmative I received another form email saying I didn't make it to round two.\r\n\r\nBoth emails said \"Dear Applicant\" - must not even have the IT staff in place to use my first name, which you have on file with my application, and resume, and cover letter.", "Interview Questions": "Are you okay with the salary band?"}, {"date": "6 Apr 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "The selection period was very, very long. The interview consisted of a panel who asked about my background and professional personality, as well as a presentation on what I'd do with the department. I came to campus, got a tour and then headed to the interview location with my future boss. It wasn't stressful or aggressive at all. Background check also took a long time as HR tends to be very busy. Start to finish the process took several months.", "Interview Questions": "Professional background, vision for the department, ability to handle stress."}, {"date": "28 Aug 2017", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Metropolitan State University of Denver (Denver, CO) in Apr 2015", "Interview Descriptions": "I was pulled in by a friend who works for the company and had referred me to his boss. Then had a quick one on one interview and had the paper work started fairly quickly.", "Interview Questions": "Do I have work study?"}, {"date": "7 Aug 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Metropolitan State University of Denver (Denver, CO) in Feb 2015", "Interview Descriptions": "Very easy-going, general questions such as: career goals, expectations, previous job experience and what I liked or disliked about my last job. Also explained general duties and what I can expect from this job.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "20 Dec 2017", "title": "Exam Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Metropolitan State University of Denver (Denver, CO) in Jan 2015", "Interview Descriptions": "Simple interview. initial phone interview for pre screening and then you go into office meeting with director and two other people that work with him.  A lot of down times, so perfect for a college student.", "Interview Questions": "Why do you think you would be good fit as exam proctor "}, {"date": "21 Nov 2014", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Metropolitan State University of Denver (Denver, CO)", "Interview Descriptions": "Interviewed by search committee then direct management/supervisor.  Parking is a hot commodity so be sure to get on campus at least 30 minutes prior to your interview to find parking, get to where you're going, check in and wait.  Interview questions are prepared in advance and vetted by the search committee chair.  Good technology resources were provided for the required professional presentation.", "Interview Questions": "What is your favorite football team?"}, {"date": "2 May 2014", "title": "Associate Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Metropolitan State University of Denver", "Interview Descriptions": "Internet search revealed a job opening to teach my specialty, sent an application package, called and requested an in-person interview.  Interview was more of a formality and interviewer was decidedly uncomfortable at having to conduct the interview.  I asked most of the questions.", "Interview Questions": "came about a month after being hired to teach in the fall, offered a classroom class in the spring that I had to turn down because we hadn't relocated to Denver yet."}, {"date": "26 Nov 2017", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Metropolitan State University of Denver (Denver, CO) in Jul 2013", "Interview Descriptions": "Very professional and well organized. Everyone was extremely helpful and outgoing. It’s a great program with a lot of history. The campus is located in downtown Denver and everything is within access which makes the recruiting process easier.", "Interview Questions": "What is your coaching philosophy? "}], [{"date": "17 May 2013", "title": "Study Abroad Advsior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Metropolitan State University of Denver (Denver, CO) in May 2013", "Interview Descriptions": "I applied online on Jan 23 2013. I received a call middle of March to request a phone interview which I had on March 28.  I have extensive experience in Study abroad so the questions where pretty standard for the interview.  There were 5 people on the line so it was confusing at times to keep track of who was who and what they asked.  Then I received an email on April 18 for an on campus interview for May 10.  Which I accepted.  They paid for everything.  Very nice campus and seems like a nice place to live and work.  I met with the staff again and it was nice to put faces to the names.  There is a lot of potential in the position to make it great.  Would love to get the position.", "Interview Questions": "What kind of marketing techniques would you use?"}, {"date": "3 Dec 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Metropolitan State University of Denver (Denver, CO) in Apr 2013", "Interview Descriptions": "Pleaseant. Gave a job talk and met a lot of faculty. The job talk was to give a sample lecture. The faculty involved pretended to be students. I was offered a adjunct position but no what I was applying for.", "Interview Questions": "What are some ways to engage non-traditional students?"}, {"date": "7 Jul 2015", "title": "Statistical Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Metropolitan State University of Denver (Denver, CO) in May 2012", "Interview Descriptions": "there was a \"test\" prior to being offered an in-person interview (this may no longer be part of the process), at the in-person interview there was a panel of constituents from the hiring department and from other employees that I would work with in the future", "Interview Questions": "Explain to us how you would handle a situation where you had work from your manager to completed by day's end, and the President or a member of the Board also had a request that needed to be completed by day's end.  You realize that there isn't enough time in the day to complete both requests.  Go..."}, {"date": "10 Mar 2014", "title": "Staff Member Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Metropolitan State University of Denver in Jul 2010", "Interview Descriptions": "After applying for the job, I got an initial interview and it was easy and fast.  A week later, the supervisor emailed me that I got the job.", "Interview Questions": "N/A"}, {"date": "17 Jun 2014", "title": "Affiliate Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Metropolitan State University of Denver (Denver, CO) in Jan 2010", "Interview Descriptions": "One question: Do you have a car?  Really that's the only question that matters, since I would not have been interviewed had I not been qualified for the job.  No reason to play games since I am a professional with a doctorate in my field and many years of experience.", "Interview Questions": "Only one question: Do you have a car?"}]]