[[{"date": "11 Nov 2021", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Teen Challenge", "Interview Descriptions": "Absolutely amazing, thoughtful, and honoring. The staff was welcoming and confident. I enjoyed the process and love the job. They were relatable yet professional. Kept the room light but had purpose and direction.", "Interview Questions": "N/A"}, {"date": "10 Mar 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Teen Challenge (London, ON) in Apr 2018", "Interview Descriptions": "Discussed position, my history, what would be expected. How would I apply my experience to this new position. How would I deal with difficulty and obstacles at work. What are my goals in the 5 -10 years", "Interview Questions": "How do you have difficulty.\r\nHow do you decompression when you're shift is done\r\nHow do you show compassion at work."}, {"date": "7 Aug 2017", "title": "Human Resources Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Teen Challenge", "Interview Descriptions": "This is an informal process.  They place  a high value on an individuals interest in the mission of the organization and ability to model Christian values.  Most roles interact directly with clients and so employees need compassion, empathy and discernment to be in alignment with the mission.", "Interview Questions": "Tell me about your faith journey."}, {"date": "26 Dec 2021", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Teen Challenge (San Francisco, CA) in Aug 2017", "Interview Descriptions": "Interview Process was incredibly smooth and felt more like a dialogue than an interview. The interview was held by the hiring manager and an executive member. They asked a serious of behavioral questions and situational questions.", "Interview Questions": "Tell me about a time you responded to conflict"}, {"date": "7 Dec 2016", "title": "Sales and Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Teen Challenge (Saint John, NB) in Dec 2016", "Interview Descriptions": "We began getting to know each other. Some small talk first and then we went a little deeper professionally. I was asked about my sales experience and employment history in general. I also inquired about the companies history. How long in business, etc. I was asked if I had experience in Real estate and digital marketing. I described my social media experience and my relationship building and ability to develop people and recruit talent.", "Interview Questions": "My B2b accomplishments"}, {"date": "27 Apr 2016", "title": "Accounting Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Teen Challenge (Columbus, GA) in Sept 2013", "Interview Descriptions": "Interviewed with Finance Manager initially. Then went through a 'panel' interview with people I would not even be working with. Extremely uncomfortable. Did not feel as though I was being interviewed for position as much as where my beliefs were with God.", "Interview Questions": "Who impacted you the most in your life?"}, {"date": "22 Jan 2014", "title": "Recovery Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Teen Challenge (Minneapolis, MN) in May 2011", "Interview Descriptions": "Communication to get to the interview was a bit of a slow process. I dont remember exactly why. I had one interview, which included 3 people- the clinical supervisor, another recovery coach, and the dean of women. We met in a boardroom. I was hired that day. A pastoral reference was needed.", "Interview Questions": "How would you confront a client that is breaking the rules? "}, {"date": "30 Jul 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Teen Challenge (Columbus, GA) in Mar 2011", "Interview Descriptions": "Short and sweet...you have easier access if you know someone and have people refer you. Since this is a religious organization, questions in this area are part of the interview and pastor's reference is required.", "Interview Questions": "They asked about prior experiences"}, {"date": "6 Dec 2015", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Teen Challenge (Harmony, NC) in Jan 2011", "Interview Descriptions": "Very comfortable, personal, and explained job duties very well. Very personal and comfortable. I understood my job as it would be. Very comfortable, personal, and explained job duties very well. Very personal and comfortable. I understood my job as it would be.Very comfortable, personal, and explained job duties very well. Very personal and comfortable. I understood my job as it would be.", "Interview Questions": "Are you available to spend the night and oversee adults in program"}], [], []]