[[{"date": "17 Jun 2021", "title": "IT Technical Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Neighborcare Health", "Interview Descriptions": "1. Applied on company site\n2. Phone screening with HR\n3. Screening with hiring manager \n4. Panel interview with team \n\nOverall it was pretty standard, their HR portal is less annoying than most.", "Interview Questions": "They asked \"What is DHCP?\""}, {"date": "22 Mar 2019", "title": "Associate Clinic Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Neighborcare Health in Mar 2019", "Interview Descriptions": "It felt like I was being dragged along for open roles.  At one point, the HR team turned me down for a role only to turn around and ask if I'd like to continue the process as the first candidate rejected their offer. During my phone screening, the interviewer asked if I would come in for an interview with her and a couple of providers, with a specific date and time.  When I showed up she claimed that she had never intended for me to come in, and that because she hadn't sent me an outlook invite that should have been my clue they weren't interested in proceeding.\r\n\r\n Communication was poor and untimely. \r\n\r\nAs part of my check-up on the company, I spoke with a few former and current employees.  A common complaint of poor management emerged.\r\n\r\nWhile checking out a location, I overheard a front desk employee telling her colleagues about staying excessivley late while she waited for a key holder to come back to the clinic to lock up the doors.", "Interview Questions": "A large focus was placed on my ability to handle staff development."}, {"date": "12 Nov 2018", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Neighborcare Health", "Interview Descriptions": "Very straightforward. First was a phone screening and then an in person interview. The in person interview was in two parts with the first hour  with multiple providers in the practice, and the second hour with an administrator and nursing staff.", "Interview Questions": "Why Neighborcare and why community health."}, {"date": "11 Apr 2017", "title": "Health Information Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Neighborcare Health (Seattle, WA) in Apr 2017", "Interview Descriptions": "Email from department manager, on-site interview, conversational interview with the manager who was very easy to talk to, asked behavioral questions and we went through my resume, heard back after 2 weeks", "Interview Questions": "How do you handle conflict within a team"}, {"date": "13 Sept 2016", "title": "Medical Assistant Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Neighborcare Health (Seattle, WA)", "Interview Descriptions": "I had 3 interviews. Two of which I was told I would hear back in 2 weeks. First interview was with HR. Second with 4 clinic administrators. Third with two separate Clinics that were hiring for the same position. I never heard back for SIX WEEKS.", "Interview Questions": "Typical, why did you leave your last job. "}, {"date": "10 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Neighborcare Health (Seattle, WA)", "Interview Descriptions": "Quick phone interview and then I was asked to come in. Met with the manager and other team members. Asked my experience and some behavioral questions that related the the client population. I felt at ease in the interview, it was not an intimidating process.", "Interview Questions": "What was my previous experience?"}, {"date": "10 May 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Neighborcare Health (Seattle, WA) in May 2015", "Interview Descriptions": "Really simple and straightforward interview process! Felt like a conversation. I would recommend just speaking from the heart. Community Health requires that commitment and passion to speak about your experiences that can show you would be a great fit.", "Interview Questions": "Why Community Health?"}], [{"date": "18 Jun 2015", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Neighborcare Health (Seattle, WA) in Jun 2011", "Interview Descriptions": "2 interviews - one with branch director and one with a three person panel. also met with supervisor's boss. some of it is technical and some of it is really about personality fit with the people you will be working with.", "Interview Questions": "tell us about yourself and why you would like to work here"}]]