[[{"date": "13 Jun 2023", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine Health (Irvine, CA) in May 2023", "Interview Descriptions": "The hiring manager gives a brief overview of her department. Then the candidate describes his/her background. There are questions from the hiring manager about the skill and his/her background. No video interview, audio interview only", "Interview Questions": "Describe the process of consenting a patient"}, {"date": "2 Mar 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "Asked a series of questions: why nursing? Short term and long term goals, as well as situational type questions - describe a time you handled conflict? Describe a time you were overwhelmed and what did you do? Describe a time where you saw something wrong?", "Interview Questions": "Asked a series of questions: why nursing? Short term and long term goals, as well as situational type questions - describe a time you handled conflict? Describe a time you were overwhelmed and what did you do? Describe a time where you saw something wrong?"}, {"date": "7 Mar 2023", "title": "Procurement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health in Feb 2023", "Interview Descriptions": "I got an interview opportunity at UC Irvine, so I booked a flight and made accommodations to stay in Orange County. 5 days before my interview, I got a call saying that my interview was being rescheduled. I could not change my flight, so they cancelled my interview. Do not recommend this employer. They do not care about their potential employers", "Interview Questions": "N/A"}, {"date": "16 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UC Irvine Health (Orange, CA) in Aug 2022", "Interview Descriptions": "Panel interview with several scenario questions including contacting doctors after hours, admission assessment, patient safety, and medication consent. Must include actual work experience and how primary nurse handled the situation.", "Interview Questions": "N/A"}, {"date": "30 Jun 2022", "title": "Orthopedic Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine Health", "Interview Descriptions": "It was quick and over the phone. They ask questions about why you are leaving and what are your 5 year goals. They also ask about how many patients you see and what is a typical day.", "Interview Questions": "They ask questions about why you are leaving and what are your 5 year goals. They also ask about how many patients you see and what is a typical day."}, {"date": "28 Jun 2022", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine Health (Orange, CA) in Jun 2022", "Interview Descriptions": "Applied online, took 3 weeks to hear back from the hiring manager and was called to come in for a Panel In-Person interview. I had about 7 people in the panel and they would bounce off each other and ask questions. \n\nWas notified same day via phone call if I got it. Total process took 3 weeks from application to interview and offer.", "Interview Questions": "Tell me about yourself.\n\nTell me about what a typical shift looks like for you, what are your duties?\n\nDescribe a time when you had a conflict with a coworker. \n\nIf a patient has abdominal pain, walk us through your method of addressing it. \n\nWhat does teamwork mean to you?\n\nWhere do you see yourself in 5 years?\n\nWhy UCI? \n\nHow would someone describe you in 3 words?\n\nHow can you make the workplace a happier place?\n\nWhat did you not like about your last job? \n\n"}, {"date": "28 May 2022", "title": "Revenue Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "Never heard back even with follow up email to the hiring manager.  Applying through the website is even worse.  It seems they use key words to pick out candidates to move forward or reject.", "Interview Questions": "I work in revenue cycle, most questions were related to the job.  "}, {"date": "30 Apr 2022", "title": "Patient Relations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine Health in Apr 2022", "Interview Descriptions": "phone interview about informing about the position and details about what the job consist. As well of asking question about my experience and skills to see what qualification I have towards the job offer.  The next step is a formal interview on zoom with another supervisor.", "Interview Questions": "what skills do you have that qualify for the job"}, {"date": "24 Jan 2022", "title": "Senior Grant Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "Uneven. Received emails from HR talking about planning an interview I already had. They wanted the names and contact info for 5 references in a 24 hour window. HR person sat in on one interview and looked bored the whole time", "Interview Questions": "ability to manage multiple grants"}, {"date": "21 Feb 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine Health in Jan 2022", "Interview Descriptions": "Applied through website and received a request for a phone interview within 2 days. After the phone interview, I was told that I could potentially interview with 3 people in total, the dept manager, clinical trials manager and an additional person. After the panel interview I was told if I passed, I would then interview with the dept manager and clinical trials manager again. All interview questions focused on behavioral type situations, experience and strengths/weaknesses", "Interview Questions": "Tell us about your experience Why this company How would you handle etc."}], [{"date": "24 Sept 2021", "title": "Clinical Nurse I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "I applied online and then they contacted me through phone call. My interview was the next day on zoom. It lasted 30 minutes and they said that they would get back to me in a week.", "Interview Questions": "what are your 5 year goals"}, {"date": "18 Jan 2023", "title": "Biospecimen Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UC Irvine Health (Orange, CA) in Sept 2021", "Interview Descriptions": "There were two interviews, one with the director on zoom and a call with the lab supervisors. It was overall a breakdown of your responsibilities and general questions about why you are interested in the position?", "Interview Questions": "Why are you interested in this role? What is your availability?"}, {"date": "29 Aug 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "Certified nursing assistants may also be called a nursing assistant, a nurse's aid, or a patient care assistant. CNAs work directly with patients and nurses, helping with the many physical and complex tasks for patient care. Some of their responsibilities include: Turning or moving patients.", "Interview Questions": "Tell me about yourself that you like"}, {"date": "20 Aug 2021", "title": "Registerd Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "Great interview, casual. I felt at ease and they were only trying to see if I was a good fit for this position. Interview took place during covid so it was online.", "Interview Questions": "Why do you want to work here "}, {"date": "8 Aug 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine Health (Orange, CA) in Aug 2021", "Interview Descriptions": "I was asked multiple questions about past experience as well as how to respond to different circumstances, including emergencies. I was a Registered Nurse back in my country so they also asked about the experience and clinical skills that I had back then.", "Interview Questions": "What past experience that you had before applying this job?"}, {"date": "6 Jul 2021", "title": "Associate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UC Irvine Health in Jun 2021", "Interview Descriptions": "Easy - connect with recruiter and research PI. Multiple rounds of HR and onboarding meetings, but interview is brief and limited to verifying prior history and experience in addition to salary.", "Interview Questions": "What prior experience do you bring to this job? "}, {"date": "22 Mar 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine Health (Irvine, CA) in Feb 2020", "Interview Descriptions": "Panel interview. Great questions. Many questions designed to get to know my personality and determine a good fit for unit. Comfortable setting. Didn’t feel rushed. No questions regarding scenarios. Only one day of interviews for this role so had to make sure I was there that day.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "8 Jan 2020", "title": "Junior Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UC Irvine Health", "Interview Descriptions": "Apply online. \r\n\r\nHR person I first came in contact of Urology Department with did not seem too excited when I submitted my AP application- in fact, she suggested other departments in the School of Medicine. In addition, she tells me that my questions about my application was most likely sent to the trash/spam box.  These interactions happened over the phone, and I did not seem too excited about the application process afterward. When I got invited to interview- though I was very happy- my negative experience with the previous HR person I first came in contact with brought manifested in the interview as excitement- which led to no job offer (and was not apparent in my initial job application). Currently have a negative association with this department heavily due to my first impression.\r\n\r\nPlease notify HR that job candidates can lose interest in first initial direct contact with department if their experience is unpleasant. Please fix the APRecruit System so job applicants can actually get their questions about their recently submitted job applications answered in a timely manner.", "Interview Questions": "What would you bring to our team?"}, {"date": "28 Jan 2020", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Irvine, CA) in Jan 2020", "Interview Descriptions": "Received a phone call from HR and had interview after a week, ask me if I'm still interested and ask for my license number? when I can start the job? She then ask me to bring all my credentials on the interview day", "Interview Questions": "Why UCI?"}, {"date": "3 May 2022", "title": "Senior Billing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UC Irvine Health (Orange, CA) in Aug 2019", "Interview Descriptions": "In depth phone interview with Human Resources manager\r\nIn person panel interview with 3 upper management, on consultant, and one manager on the same level as the open position\r\nInterview with COO\r\nInterview with Chairman and two staff members of department", "Interview Questions": "How do you handle employee engagement in the department you manage? Do you know how to use Excel and pivot tables? Have you given performance reviews to staff working under you? What would you do if 2 staff members are having a conflict?\r\n"}], [{"date": "9 Jul 2019", "title": "Principal Administrative Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine Health", "Interview Descriptions": "three interviews upon hiring . they take a long time to call you back but its worth the wait. After three interviews you will either get a call from HR with your offer or you wont get a call back", "Interview Questions": "What is your experience "}, {"date": "6 Mar 2019", "title": "Per Diem Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at UC Irvine Health (Garden Grove, CA) in Mar 2019", "Interview Descriptions": "Applied in Dec-2018. Got called in Early February for a telephone interview. After a successful phone interview I was scheduled for an i person interview the following week (roughly the 2nd to last week of February). Got a call back from the hiring manager approximately 2 weeks later for an offer. I accepted and HR called me following another 2 weeks with an offer letter an instructions for my on-boarding process. Lengthy but was a smooth process.", "Interview Questions": "Questions were related to my past experience. “Behavioral Based.”"}, {"date": "19 Apr 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UC Irvine Health (Irvine, CA) in Feb 2019", "Interview Descriptions": "Sunny weather. Same as most grad student interviews. Professors looked at our CVs and asked questions based on those. Some professors were absent due to other commitments. Nice campus with park in middle.", "Interview Questions": "What you want to be after grad school?"}, {"date": "9 Apr 2019", "title": "Laboratory Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Irvine, CA) in Jan 2019", "Interview Descriptions": "I had a very negative experience dealing with the Department of Urology at the UC Irvine Medical Center.   I applied online for a Director-level position at the Department of Urology.   After approximately one week I've got a phone call from an HR person performing phone interview who did not understand ANYTHING about the position.   In approximately one week after that, I was invited to the on-site interview.   I mentioned that I have to travel from Silicon Valley to attend the on-site interview and was verbally assured that all travel expenses should be taken care of because this is a Director-level position.   When I have already made all the travel arrangements,  I found out that I am meeting with just a single person.  I specifically reminded the HR to arrange several interviews to make sure I meet everyone in a single on-site interview visit.  Nevertheless, when I came to the Department of Urology, I still was scheduled to meet just a single interviewer.    Moreover, the interviewer was late and spent just 30 minutes for the interview.   He said that everything looks great and they will invite me for a second on-site interview soon.  After the interview, the admin assistant said she will send me the travel expense reimbursement forms but I never received them.   Then I tried to contact HR and they said that this position is a \"Director-level\" only in the advertisement but in reality, this is a low-level analyst position which is not eligible for travel reimbursement.  What a lie!  Basically, I wasted the entire day and my own money just to meet with one interviewer for 30 minutes!  I then checked their Yelp reviews and found out they lie to and overcharge many of their patients! This is a very dishonest organization!  Definitely, I do not recommend to deal with them in any way.", "Interview Questions": "Do you have experience with SEC?"}, {"date": "1 Sept 2021", "title": "Admin Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Orange, CA) in Dec 2018", "Interview Descriptions": "Nurse Manager called me and asked me if I was ok with the variable shifts. Then, I was asked to come in for an interview with the Nurse Manager. But when I came in it was a panel interview with the Director, Analyst, and two Admin Assistant IIIs.", "Interview Questions": "Q: In one word, how would your mother describe you?"}, {"date": "16 Apr 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine Health (Orange, CA) in Oct 2018", "Interview Descriptions": "I had 2 phone interviews and 3 in person interviews. HR wouldn’t even respond to me. I thought that was pretty poor prospect management considering the time investment I made in the interview process. Now I wouldn’t work for them if they paid me double.", "Interview Questions": "How do you feel about rapidly changing work streams and deadlines?"}, {"date": "23 Aug 2018", "title": "Call Center Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "None, I submitted an application online and was contacted by the recruiter two days later. I called the hiring manager, no call back. I called two days later and still no call back. Lack of courtesy in terms on reaching out to applicants.", "Interview Questions": "N/A"}, {"date": "13 Aug 2018", "title": "Patient Experience Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine Health", "Interview Descriptions": "Submitted application through UCI website, heard back in about 2 weeks. Interview with 4 staff members. Was conversational and pleasant. They took turns asking me situational questions. At the end I had to write a summary of what patient experience means. They also gave me plenty of opportunity at the end to ask questions and they explained benefits of interning there.", "Interview Questions": "How do you handle conflict with a co-worker?"}, {"date": "28 Jun 2020", "title": "Patient Experience Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UC Irvine Health (Irvine, CA) in Mar 2018", "Interview Descriptions": "It's a short and easy process. If you stay honest and show that you are eager for the position you will get the position. Maintain Eye contact and just have a conversation with your interviewer. It is really casual.", "Interview Questions": "How will you help us become a better organization?"}, {"date": "25 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Irvine, CA) in Feb 2018", "Interview Descriptions": "First round of interview was with the lab manager, then another PI in the lab and second round of interview was with the PI of the lab. After the second interview, I was offered the position", "Interview Questions": "GPA, projects/research you've done, why this lab, how can they help you in your career, your schedule"}], [{"date": "28 Jan 2018", "title": "Staff Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine Health (Irvine, CA)", "Interview Descriptions": "The interview itself went fine. They promised a lot of opportunities that sounded great, but later, I found out it was all to get me to say yes to the position. I have yet to see the opportunities promised.", "Interview Questions": "Have you ever found yourself bending the rules?"}, {"date": "19 Apr 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Orange, CA) in Apr 2017", "Interview Descriptions": "Got a phone interview from the nurse manager and assistant nurse manager, roughly 2 weeks after I submitted my application. Had an in-person interview the following week. They were very easy to get along with.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Mar 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine Health (Orange, CA) in Mar 2017", "Interview Descriptions": "Received a call from the nurse manager for an interview within two days of applying. I had my interview early the next week. Everything was set up via e-mail. Staff were kind but interview was challenging.", "Interview Questions": "Describe for me a time where you had a deteriorating patient. What did you do? Walk me through your thought process. "}, {"date": "6 Mar 2018", "title": "CNA/HHA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine Health (Orange, CA) in Mar 2017", "Interview Descriptions": "Phone interview, and then invitation for panel interview. Nurse manager, assistant nurse manager, charge nurses, and other available nurses joined to ask questions. Overall, it really depends on the department. you may get a tough manager with tough questions, or a really laid back manager who will ask easier questions.", "Interview Questions": "Why do you want to work at UCI? "}, {"date": "8 Aug 2018", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine Health (Orange, CA) in Mar 2017", "Interview Descriptions": "interview was very formal. Manager called me in for an interview and got down to talking about business. very quick and simple. manager asked me to assemble a tray for her which i did.", "Interview Questions": "They asked about my job experience. "}, {"date": "4 Nov 2017", "title": "Junior Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UC Irvine Health (Orange, CA) in Jan 2017", "Interview Descriptions": "Interviewed by the head PI (physician) and a group of student interns. The process takes about a day, and the hiring process takes a little over a month to go through HR and the required background checks.", "Interview Questions": "Describe yourself in one word."}, {"date": "18 Jan 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at UC Irvine Health (Orange, CA) in Jan 2017", "Interview Descriptions": "There was a basic application process which included just resume/CV. The application would ask basic questions regarding experience and education. Then there was a phone interview which was a general screening. Two in person interviews with two supervisors and three reference checks were required.", "Interview Questions": "What qualities do you have make you qualified for the position?"}, {"date": "12 Oct 2016", "title": "Medical Records Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine Health (Irvine, CA)", "Interview Descriptions": "Applying for UC Irvine health is terrible. There HR dept. does not respond quickly or at all sometimes. With this position it was a one on one interview, so that made it easier.", "Interview Questions": "Surprisingly I was asked if I even wanted to work there because of the distance."}, {"date": "8 Dec 2020", "title": "Assistant Project Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health in Aug 2016", "Interview Descriptions": "Presented in front of other researchers about my research Projects that I have been involved. Then, interview with PI about my future plans and then, hear the response, offer, from him two weeks later. fill out all the documents and submit the recommendation letters as well.", "Interview Questions": "what is your research about?"}, {"date": "14 Aug 2016", "title": "Interning At Cancer Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine Health (Orange, CA) in Feb 2016", "Interview Descriptions": "Went into supervisor's office and she asked me questions involving this internship to be taken under a course for college and placed me in the cancer center that she felt would best fit me", "Interview Questions": "asked what my major and career interest was, what my course requirement was to do the internship, grade point average, how many hours I needed"}], [{"date": "28 Mar 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at UC Irvine Health (Orange, CA) in Jan 2016", "Interview Descriptions": "Applied online and was emailed to come for an interview. I was interviewed by student research assistant and the person in charge of managing research within the department. Pretty straightforward interview. Just asked about past experiences and what I expected from working here", "Interview Questions": "What I knew about department and its research"}, {"date": "14 Nov 2015", "title": "RN NICU Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine Health (San Bernardino, CA) in Nov 2015", "Interview Descriptions": "Filled out an application online around September. Got a call for an interview in November. Set up a time. Had a panel interview with the Manager, night shift manager, educator, day shift nurse, night shift nurse and another educator. The interview was very relaxing, each member asked a question.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "18 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Orange, CA) in Sept 2015", "Interview Descriptions": "Interviewed by nurse managers and nurse educator.  The group interview was performed. Each person on the panel asked questions.  Then they offered time for you to ask questions to them. The interview process lasted thirty minutes.", "Interview Questions": "Have you ever come across a difficult patient and how did you handle the situation?"}, {"date": "17 Aug 2015", "title": "Lab Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine Health", "Interview Descriptions": "Pretty straightforward interview (mostly because this is an entry-level student assistant position). Just asked about past experiences and what you hope to gain from working here, how long you can commit, etc.", "Interview Questions": "What are your future goals/aspirations? "}, {"date": "15 Jun 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine Health", "Interview Descriptions": "Process was very straightforward, on the website you can find all necessary steps required to becoming a volunteer. The program requires that you dedicate 100 hours. You are required to show up for 3 hours a week in order to maintain your status as active volunteer which was not hard to do because of the hours the center is open", "Interview Questions": "Why do you want to volunteer with us?"}, {"date": "4 Jul 2016", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine Health in Jan 2015", "Interview Descriptions": "I applied online and took an online questionnaire. I received a phone call within 1 week to arrange a face to face interview. The interview was with manager and consisted on behavioral and clinical questions. After the interview, there was a medication and EKG test. Post interview follow up was within 2 weeks. Overall, very smooth process but difficult interview questions and EKG test.", "Interview Questions": "Describe a time you had a difficult patient and how did you handle it?"}, {"date": "15 Apr 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at UC Irvine Health (Orange, CA) in Jan 2015", "Interview Descriptions": "The recruiting and staffing team was prompt, thorough, and they made the process as simple and seamless as possible.  The process was well thought out, connecting me during the interview process with both management and peers, so I could obtain a fuller picture of what it is like to work at UC Irvine Health, what the culture is, et al.", "Interview Questions": "They focused well not only on asking about my business style and approach, but were also engaged in finding out what my career goals were to ensure that it was a good match not only for UC Irvine Health as an employer, but also me as a potential employee."}, {"date": "5 Oct 2015", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UC Irvine Health (Orange, CA) in Nov 2014", "Interview Descriptions": "Met with unit supervisor and charge nurse to discuss job requirements and expectations. Both interviewers were extremely professional and easy to talk to. Demonstrated passion for nursing and patient care, and boasted strong support for nursing staff on unit.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "29 Aug 2016", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine Health (Orange, CA) in Aug 2014", "Interview Descriptions": "1 on 1 interview with the unit manager. Very casual and friendly. I did not feel like I was being interviewed, it was more of us just chatting and getting to know each other.", "Interview Questions": "What do you do for fun?"}, {"date": "27 Jul 2015", "title": "Administrative Assistant III (Temp) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at UC Irvine Health (Irvine, CA) in Aug 2014", "Interview Descriptions": "I was contacted by email within a week of applying on the Temporary jobs website for UCI. I had a brief phone interview 3 days after the initial email, and then asked to come in to the Temporary Services office the next week for a formal interview. When I went to the office, they asked me to take a Microsoft Excel and Word test to analyze my skill level. The interview in-person was not too bad; they just wanted to get a feel for the type of person I was and correctly quantify my abilities.", "Interview Questions": "Please name any instances of leadership and how you handled the situation."}], [{"date": "15 Mar 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at UC Irvine Health (Irvine, CA) in Mar 2014", "Interview Descriptions": "One on site interview", "Interview Questions": "N/A"}, {"date": "11 Jan 2014", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at UC Irvine Health (Irvine, CA)", "Interview Descriptions": "Group interview process. Individual interview to determine knowledge of psychodynamic models.", "Interview Questions": "What behavioral model do you most espouse to? How do you feel about working with patients who may have communicable diseases? "}, {"date": "14 Aug 2013", "title": "Assistant Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at UC Irvine Health", "Interview Descriptions": "I was hired through a temporary agency, so I did not meet the people in the office beforehand. The interview included a Word, Excel, and typing proficiency test. It was very straight forward and was hired that day.", "Interview Questions": "What type of job settings I would not like to work in."}, {"date": "6 Jan 2017", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine Health (Irvine, CA) in Jun 2013", "Interview Descriptions": "First I had a phone interview from Human Resources, then I had a phone interview with the hiring manager, then I was asked to interview in person, then I had a second interview with several staff and physicians. Overall it was a fairly organized and appropriate process.", "Interview Questions": "What is one of your major accomplishments at your last job?"}, {"date": "15 Mar 2013", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UC Irvine Health", "Interview Descriptions": "I applied through an online application from their website.  It was simple and to the point.  Nowadays, as a new grad, it is super difficult finding a job.  So knowing someone in the inside is immensely helpful in getting your application picked out from the hundreds of apps.  I knew the manager from school which helped me get an interview.  The interview was standard in all the units with a couple of questions that are made up by the manager.  It was professional.", "Interview Questions": "Why did you want to be a nurse rather than a doctor?"}, {"date": "10 Sept 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UC Irvine Health (Irvine, CA) in Aug 2012", "Interview Descriptions": "Great, I was interviewed by H.R., and then by a supervisor which was later fired (along with a few others) by that lunatic (I use this term because you can feel and see that something is seriously 'OFF' about her, though perhaps it can't quite be pinpointed), Trudy Trgovac (a physical therapist) who fired freely and at will, with blessings from the Administrator who brought her on board.", "Interview Questions": "You're overqualified for the position you applied for, would you consider interpreting/transcribing?\r\n\r\nThen they provided me with medical terminology and translation tests, in multi languages (I speak several), and I passed.\r\n\r\n"}, {"date": "3 Feb 2013", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Orange, CA) in Jul 2012", "Interview Descriptions": "I applied online and received a surprise phone call a few weeks later from UCI.  Turns out, a group of qualified candidates were given a surprise phone interview of about 5 questions.  6 - 7 candidates were chosen for a in -person interview with the supervisor and manager, which also wasn't too bad - similar questions.  Seemed like the in-person interview was more like a formality.   1 person was selected for the job.", "Interview Questions": "None too hard.  Have you ever had a difficult pt?  What is the difference between a CNA and RN?"}, {"date": "8 Mar 2016", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UC Irvine Health (Orange, CA) in Apr 2012", "Interview Descriptions": "There were two interviews in different days. First was with the educator and another staff nurse. The second was a panel interview with the supervisor and various staff. I was intimidated by the second interview, but it went fine. The questions asked were your typical interview questions and each person went around and asked a question. Not too bad in my opinion.", "Interview Questions": "How do you resolve conflict?"}, {"date": "12 Apr 2016", "title": "Claims Examiner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine Health (Orange, CA) in Mar 2012", "Interview Descriptions": "I did this interview several years ago so do not remember much of it. However it was a very casual interview process. I was suppose to have two people at the interview and it only ended up being one. Interview lasted about 30 minutes. The lady that interviewed me was very nice and not intimidating.", "Interview Questions": "What is your weakness?"}, {"date": "17 May 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine Health (Orange, CA) in Jan 2012", "Interview Descriptions": "Great process, very informative about what the organization was all about.  Allowed me time to ask questions to ensure it was a good fit for me too. Great two-way process.", "Interview Questions": "Experience and behavioral based questions"}], [{"date": "8 Sept 2014", "title": "Staffing and Patient Placement Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine Health in Jan 2012", "Interview Descriptions": "The process was fairly easy. I was interviewed over the phone, then I had an in-person interview, followed by an hour or so of shadowing my prospective coworkers. As this was a hospital, I also had to go through a basic health screening.", "Interview Questions": "N/A"}, {"date": "24 Nov 2010", "title": "Patient Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine Health (Orange, CA) in Nov 2010", "Interview Descriptions": "Phone Interview first: Q: Describe to me how to make your favorite sandwich.\r\n\r\n1:1 Interview : consisted of 10 questions relating to 'customer relations'\r\n\r\nSkills Test : Proof read one email.", "Interview Questions": "Tell me a time where you worked with a group and it did not turn out the way you would like for it to. How would you change the experience?"}, {"date": "3 Apr 2014", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine Health (Irvine, CA) in Aug 2010", "Interview Descriptions": "Applied against an add in Nature jobs, received email from professor to arrange for references, got an offer, paper work through email for visa processing, visa interviews at US consulate, received visa, joined....", "Interview Questions": "N/A"}, {"date": "25 Jun 2010", "title": "Social Work Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine Health (Orange, CA) in May 2010", "Interview Descriptions": "I filled out an application online and had a phone interview.", "Interview Questions": "What have you done in the past to make you  a good candidate for the position"}]]