[[{"date": "8 Jul 2023", "title": "RN Care Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin", "Interview Descriptions": "Interview was straightforward with standard questions including employment background, member interaction, conflict management, and general personal organization questions. There was also the opportunity to ask questions about position, organization and program.", "Interview Questions": "- member interaction - conflict management"}, {"date": "13 Jun 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin (Madison, WI) in May 2023", "Interview Descriptions": "I thought the interview process was fast. I interviewed with HR and then the supervisors. It was about a week from start to finish. I think everyone I have talked to so far has been nice. They have acknowledged the bad reviews and I appreciate that.", "Interview Questions": "It was the normal interview questions and a few scenarios as well."}, {"date": "5 Apr 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at My Choice Wisconsin (Madison, WI) in Mar 2023", "Interview Descriptions": "I really enjoyed how the interviewer made me feel comfortable. She was focused on me as a person and what it was that I wanted out of a company. She listened to me and the questions I asked. I liked the fact she opened up about her self as well and made her come off as a real person and not just someone looking to hire a worker. I was very grateful for the opportunity", "Interview Questions": "What are you looking for ima company?"}, {"date": "16 Dec 2022", "title": "Enrollment Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at My Choice Wisconsin", "Interview Descriptions": "Recruiter reach out to me after application submission and did a brief Interview over the phone. Standard questions were asked and after that she forwarded it to the manager for review. About a week later I was asked to set up a formal interview over Teams. Sometimes interviewing with multiple people is a little scary but it was very professional and relaxed", "Interview Questions": "Tell me about a time when you had conflict with a coworker and how was that resolved?"}, {"date": "13 Dec 2022", "title": "RN Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at My Choice Wisconsin (Madison, WI)", "Interview Descriptions": "Interview process went smoothly. Interviewed with three people in a virtual meeting. Interviewers put me at ease. They were very transparent and responded to my questions thoroughly as well. Was a very good experience.", "Interview Questions": "Interviewers asked questions about prior experiences and knowledge to see if I was a good fit for the position that I applied for."}, {"date": "4 Dec 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at My Choice Wisconsin", "Interview Descriptions": "The interview process went very well. They asked me questions about my on-the-job experience and why I was looking for a new job. They were friendly and welcoming. They provided thorough answers to questions I had during and after the interview process.", "Interview Questions": "Tell me about what kind of working environment you are looking for."}, {"date": "7 Sept 2022", "title": "Member Health & Safety Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at My Choice Wisconsin", "Interview Descriptions": "Interview was conducted by Zoom.\nInterviewing supervisors were very friendly and helpful.\nInterview questions asked including direct situations relating to the position.\nTimetable was reasonable as well.\nGreat feedback from those conducting the interview", "Interview Questions": "N/A"}, {"date": "7 Sept 2022", "title": "RN, Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at My Choice Wisconsin (Madison, WI) in Sept 2022", "Interview Descriptions": "The initial interview was completed by a recruiter who was very genuine. He asked the usual questions that a screener would ask, but did so in a conversational way. He made a great first impression. The second interview was set up right away, which impressed me. This interview was conducted by the two primary management staff. They also showed their genuineness, understanding and pride in their product. They seemed fair and it was easy to tell they were happy in their jobs. The expectations of the job were explained as were the risks and benefits. I appreciated their honesty and process of ensuring this was the right job for me and that I was the right person for job. I respected the My Choice local office management team and felt good about my future with them. It must have been mutual as I was notified by the end of the next date that I would be getting an offer. I was happy with the offer and felt it recognized my skill set and experience.", "Interview Questions": "Walk us through your resume and explain what you have done that makes you qualified for this position."}, {"date": "24 Aug 2022", "title": "Provider Quality and Provider Credentialing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin (Brookfield, WI)", "Interview Descriptions": "It was great.  I interviewed via video/remote with HR and my current supervisors.  They were very professional amicable and continue to be so.  I am very much enjoying my current position and employment and feel very blessed to be a part of this wonderful team.", "Interview Questions": "Tell us how your previous background and experience relates to this position."}, {"date": "23 Aug 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin (Milwaukee, WI) in Aug 2022", "Interview Descriptions": "Awesome experience!not to lengthy but very detailed. Very down right questions. a-lot of information about the company. Interviewers Had  positive attitudes which made the process even more smoothly.This definitely eased my nerves and I felt confident.", "Interview Questions": "What do I expect in my next employer and or supervisor "}], [{"date": "7 Sept 2022", "title": "Bilingual Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin (Milwaukee, WI) in Aug 2022", "Interview Descriptions": "The interview was wonderful. Great screening of background and experience done by the interviewer. It was pleasant and less intimidating than other interviews I have participated on. Great experience overall.", "Interview Questions": "Why do you want to work as a Case Manager?\nHow would you handle conflicts between coworkers?\n"}, {"date": "27 Jul 2022", "title": "Employee Benefits Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at My Choice Wisconsin (Wauwatosa, WI) in Jun 2022", "Interview Descriptions": "I met with a recruiter via phone for a screen and then a few days later with the hiring manager and another team member.  It was fairly quick process which was great compared to some other companies I had interviewed with.", "Interview Questions": "They asked different situational questions about my experience. "}, {"date": "21 Feb 2022", "title": "Community Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin (Madison, WI) in Feb 2022", "Interview Descriptions": "Initially talked with HR for a phone interview then met with two managers for an hour long interview.  HR got back to me fast and answered all my questions.  The entire process was a great experience.", "Interview Questions": "Wide variety of situational questions and questions specific to the position."}, {"date": "24 Jan 2022", "title": "Decision Support Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at My Choice Wisconsin (Madison, WI) in Jan 2022", "Interview Descriptions": "Preliminary screening by recruiting, followed by Zoom meetings with hiring manager followed by panel interview with team members. All within a week. Very pleasant surprise to see employer act so quickly.", "Interview Questions": "Alot concerning style and approach to management. Little technical questioning."}, {"date": "27 Oct 2021", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at My Choice Wisconsin", "Interview Descriptions": "Contacted via e-mail to schedule a phone interview with HR Recruiter.\nFollowing phone interview I was contacted via e-mail to schedule a face-to-face interview with Hiring Manager.\nWas contacted by phone by HR Recruiter asking for more information following face-to-face interview.\nUltimately was contacted via phone for offer.", "Interview Questions": "What do you know about My Choice Wisconsin; the demographic served, and the services provided?"}, {"date": "11 Oct 2021", "title": "Talent Acquisition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin", "Interview Descriptions": "The team that I met with was wonderful. They were very knowledgeable on the organization and position. There was transparency in answering any questions that I had. They really sold the company culture.", "Interview Questions": "Tell me about a time you had to coach an employee."}, {"date": "9 Dec 2021", "title": "Dedicated Functional Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at My Choice Wisconsin in Nov 2020", "Interview Descriptions": "After you apply, your application is pulled and you will be contacted to schedule a phone interview. They are very flexible and understanding! If the phone interview goes well, you will schedule a zoom video interview. Again, they are very flexible with scheduling if you reach out. I met on zoom with 2 ladies, and it was about a 1 hour pretty casual interview. You get to know the company, they get to know you. Then about a week later, they will reach out with their decision.", "Interview Questions": "What is your minimum salary expectation?"}, {"date": "13 Nov 2020", "title": "Care Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at My Choice Wisconsin in May 2020", "Interview Descriptions": "It seems to be a very lengthy process.  I had other job offers and didn't want to wait such a long time to hear if I had the job or not.", "Interview Questions": "why I wanted the job"}]]