[[{"date": "21 Apr 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at MetroPlusHealth (New York, NY)", "Interview Descriptions": "Applied thru a placement agency that specialized in temp to perm. The timeframe between first applying with the agency to interviewing with MetroPlus was approx 2 weeks. The interview was conducted via phone instead of zoom, which was actually good for me as I'm very incredibly shy. It was with 2 managers in the UM Dept. There was a 3rd manager that couldn't be present that day. \r\n\r\nThe 2 women started out nice enough, and asked me several ice breaker questions prior to starting the actual interview. They did not ask me any challenging questions like one would expect from a nursing interview. One question that stood out to me was they asked me what would make me a good supervisor. That's not the role I applied for, I applied for a regular nurse position. I answered it anyway, to the best of my ability. At my job at that time, I took part in interviewing candidates (along with other staff and the manager). These 2 women asked me about that and said something along the lines of \"that's usually something a team lead does\". Well, maybe, but at the job I was employed at that time, the manager gave all the nurses a chance to take part in interviewing as well. I asked them several questions about their workflow and what a typical day for them is like. I also asked them if there are any chances for challenging side projects. One of the women then got sort of snippy with me and said something like \"why would you want more responsibility, you should focus on the actual role\". I should've ended the interview at that time, I really don't know why I didn't. They also didn't answer my questions about the job itself, they gave me very vague answers. The interview lasted approx 20 minutes, most of the conversation was about what I do at my job (they are competitors), instead of them explaining the role to me.  \r\n\r\nThe very next day, I find out from the agency that I didn't get the job. That was ok with me. I never go into any interview with the expectation of getting the job. \r\n\r\nAbout 6 months later, I end up working with someone who came from MP that knows the managers of the department I interviewed in. It turns out the former team lead at my job was the 3rd manager that couldn't be present during my interview. She was on the call listening in to me and my answers, which I was not aware of at that time. I went back to the interview confirmation email (I save all employer emails for awhile to remember where I applied/interviewed with) and sure enough, the former team lead was listed there as a manager. It was all the way at the bottom of the email, which I didn't see prior. If I knew she worked there, I would've canceled the interview myself as I don't want to work with anyone from that other employer.  I was trying to make a \"clean break\" from my job at that time.\r\n\r\nThis is one of the most unprofessional things I've ever experienced/heard regarding an employer. If she didn't want to work with anyone from her prior job, she should've told the agency not to move forward with me. Or tell them not to send anyone over from her prior job. Why waste my time? Why waste their time? It just feels disgusting and sneaky to have someone listening in to me, who I was told wasn't available.  Also, I never had a problem with this 3rd manager when her and I worked together.  I totally understand if she didn't want to work with anyone from the other place, but why try to make a fool out of job candidates from there?\r\n\r\nI wanted to put my interview experience out there, especially after finding out the info I did after the fact. I just cannot believe a management team would do/allow something like this and IMO it's a red flag to anyone who would want to consider working for them. The insurance industry is a small world, so be aware you could be in the same situation as I was and not find out. I don't understand what the point was of that or what they were trying to accomplish.  These other 2 managers didn't know me, never worked with me.  They already knew they were not going to even give me a shot at the job but still \"interviewed\" me.", "Interview Questions": "How long have you been in UM? What would make you a good supervisor? Have you ever supervised anyone? What is your prior nursing experience prior to UM?"}, {"date": "5 Jul 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth (New York, NY) in Mar 2023", "Interview Descriptions": "Very quick and easy; it took about a month or two to get an answer. The interview did not really ask any behavioral questions or questions about ability and experience.", "Interview Questions": "They asked me about myself and if I would like working there and whether the job sounded interesting to me."}, {"date": "20 Jan 2023", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MetroPlusHealth", "Interview Descriptions": "Great process. Could not have be any better. It was concise and short and to the point. They will ask simple questions for simple answers. Be prepared for a good interview", "Interview Questions": "What is one thing you want to do in"}, {"date": "19 Jan 2023", "title": "Helpdesk Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MetroPlusHealth (New York, NY)", "Interview Descriptions": "Long 45 minutes, two people on the video call and ask typically questions on how you provide support to users. Note that position is a call center support. They ask some networking questions, so be prepared for the basic fundamental of it. Asked questions about their work culture, their team and what the typical day looks like if hired.", "Interview Questions": "Questions about networking. Helpdesk scenarios"}, {"date": "28 May 2023", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth (New York, NY) in Nov 2022", "Interview Descriptions": "Standard interview with multiple people. The entire process was very long and took over 2 months from the first interview to offer. Average questions and spaced out over a couple of weeks.", "Interview Questions": "Have you led projects? Have you implemented operational processes?"}, {"date": "27 Oct 2022", "title": "Sales Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MetroPlusHealth (New York, NY) in Oct 2022", "Interview Descriptions": "Panel Interview, was kind of intimidating but overall very easy going and conversational. It's interesting to hear questions as a team rather than just a sole interviewer so you can better grasp the company.", "Interview Questions": "Can you meet the daily quota of 7 enrollments per day?"}, {"date": "18 Dec 2022", "title": "Customer Success Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at MetroPlusHealth (New York, NY) in Sept 2022", "Interview Descriptions": "Inicial communication was via email, a recruiter asked that i apply to the position because she had seen my profile on LinkedIn. Then the HR generalist reached out asking for a time to meet my possible managers. The interview happened on a Friday afternoon. It went pretty well and was about 30-45 min with two very nice and stern managers.", "Interview Questions": "Tell me about a time you received exceptional customer services."}, {"date": "1 Jun 2022", "title": "Claims Internship Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MetroPlusHealth", "Interview Descriptions": "The clean, smooth, and comfortable onboarding process asked me about my previous work experience and projects.  They took my two rounds of interviews one with HR and the director. It was a wonderful experience.", "Interview Questions": "previous work experience, knowledge about the subject"}, {"date": "6 Jun 2022", "title": "Sales Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth (New York, NY) in Apr 2022", "Interview Descriptions": "Awful process \nHR is confused consistently \nZoom address link was sent incorrectly\nDragged out process and wasted my time\nRestructuring and awful communication regarding next steps\nTerrible reviews online… What was I thinking? !", "Interview Questions": "Got an offer, sort of.  I was told an offer letter was specifically coming. It never came. Then restructuring… Still waiting, and then ghosted.\nBeyond unprofessional!"}, {"date": "1 Jun 2022", "title": "Inernship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth in Mar 2022", "Interview Descriptions": "I received an email with the interview invitation about 2 weeks after I applied. The interviewer asked me about 5 questions and that was all. I checked up 2 weeks later and got the offer a week after that.", "Interview Questions": "Why this company?\r\nWhat can you provide for this company?\r\nWhy are you a good candidate?"}], [{"date": "9 May 2022", "title": "Harp Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MetroPlusHealth (New York, NY) in Mar 2022", "Interview Descriptions": "Initially, via telephone, then through emails and eventually in person. Everyone was pleasant and professional. An issue with background verification of past employment.  Equipment was issued and the bag is really efficient.", "Interview Questions": "My experience as a CM. "}, {"date": "12 Jun 2022", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at MetroPlusHealth (New York, NY) in Jan 2022", "Interview Descriptions": "Recruitment screening was very thorough. The interview with the hiring management (panel interview 4 people) was very specific. They challenge your knowledge in job specific areas and experience as every interview should. It was a great experience.", "Interview Questions": "What is your experience with Union employees?"}, {"date": "14 Oct 2021", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth", "Interview Descriptions": "Straight forward process when applying online.  You will received a call, then interview.  If you do well, you will get a second interview with the division head(s).  Finally, an offer is extended.  Process usually takes 2-3 weeks.", "Interview Questions": "What do you know about MetroPlus?\n"}, {"date": "28 May 2022", "title": "Member Experience Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MetroPlusHealth (New York, NY) in Oct 2021", "Interview Descriptions": "2 video interview's and then got a call form HR ; was told toc complete application online ;was then scheduled to come in for fingerprints and ID picture ; waited 2 weeks for results of background check; was then called to schedule my first day to pick up my computer for work at home; that day I picked up my computer IT set it up; went home and started training virtually with the team.", "Interview Questions": "What does Customer Service mean to you?"}, {"date": "23 Dec 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth (New York, NY) in Nov 2020", "Interview Descriptions": "Very quick and was hired on the spot............. They come with great benefits and the starting pay is great!!!!!!!!! This is a great job for people that want to work in the health field.", "Interview Questions": "Why did you leave your last job?"}, {"date": "6 Feb 2020", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MetroPlusHealth (New York, NY) in Jan 2020", "Interview Descriptions": "Brief, very straight forward, laid back.  Be confident, Extremely higher than average turnover.  Confusing which floor to go to, two elevator banks.  Easy to get hired because people leave so often.", "Interview Questions": "if you fit"}, {"date": "19 Apr 2022", "title": "Member Experience Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MetroPlusHealth (New York, NY) in Nov 2019", "Interview Descriptions": "Like your ordinary interview, why you want to work here? What’s your strengths and weaknesses.  Give us an example of a  situation you had to overcome ? Where do you see your self in 5 years from now etc", "Interview Questions": "Why do you want to work with Metroplus "}, {"date": "21 Oct 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at MetroPlusHealth", "Interview Descriptions": "a skype interview, and talk about the resume, experience. introduce the job and the response is very fast. it took them within a week to respond. But HR is very slow processing the files.", "Interview Questions": "talk about resume"}, {"date": "21 Sept 2019", "title": "HEDIS Seasonal Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth", "Interview Descriptions": "Not the best. Interviewed with two people and was immediately shut down because of my job history. It was a quick process and not much questions were asked. One of the interviewers only talked about the position and I later received a rejection letter in an email by the end of the interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "26 Sept 2020", "title": "QM Operations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth (New York, NY) in Feb 2019", "Interview Descriptions": "Interview was very bias and vague. Not a welcoming atmosphere and felt rushed.  Brought in for an interview twice because my resume and qualifications matched,  but ended up being a waste of time because of the interviewers lack of competence in hiring.", "Interview Questions": "Tell me about your experience and why do you want to work here? "}], [{"date": "2 Nov 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at MetroPlusHealth (New York, NY)", "Interview Descriptions": "They had you do the process in three steps. The first step is you take a call center assessment on the computer. Second step you take the writing portion of it. Third step is you sit in front of the managers or team leads in a group of two or three answering questions back and forth.", "Interview Questions": "tell us something that you found out about the company?!?"}, {"date": "19 Nov 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MetroPlusHealth (Brooklyn, NY) in Nov 2018", "Interview Descriptions": "Interview process was long and draining. You take a call center assessment on the computer which can take up to an hour and a half. Then you take a writing portion answering multiple interview questions and an essay portion on why you would be an asset to the position. Then after you sit in a group interview with other candidates and 3 or 4 team leads answering more questions back and forth. Overall you spend almost 4-5 hours through this whole process.", "Interview Questions": "What is your personal definition of success?"}, {"date": "25 Feb 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth (Brooklyn, NY) in Feb 2018", "Interview Descriptions": "You take 2 online assessments one of them is a call center simulation, then you answer 2 pages of interview questions and write an essay on why you should be hired. Then you and 3 other interviewees  have a panel/group interview with 3 supervisors and a team lead taking turns answering interview questions. It took about 3 weeks after the interview to get called back with the offer.", "Interview Questions": "How did you handle constructive criticism from a supervisor."}, {"date": "24 Jan 2018", "title": "Quality Assurance Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at MetroPlusHealth (New York, NY)", "Interview Descriptions": "Applied online and their recruiter will call you to setup an interview.\nMost likely interview will be at 9 am.\nOverall interview was good. They asked questions from resume only.\nThey have some expectations which are looking from you so if you guess it right you just need to explain it and you are done.", "Interview Questions": "What reason makes you apply for this position."}, {"date": "28 Sept 2017", "title": "Chief Information Security Officer (CISO) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MetroPlusHealth (New York, NY) in Sept 2017", "Interview Descriptions": "I met with the CIO, the Privacy Officer and several senior IT people.\r\nSeveral times they spoke about the previous security teams and how would I do something different.\r\nThat raised a red flag.\r\nSeveral other security teams?  In a HIPAA regulated organization?\r\nThen I realized that within a month, the CISO of Health and Hospitals and MetroPlus both left?\r\nAs a security professional, that's concerning.\r\nAs a HIPAA regulated organization, to have so many \"teams\" coming and going isn't good.\r\nEventually, when it came time for an offer, I declined.\r\n$140k for a 15 year CISO is an insult in NYC.\r\nI've hired security managers for more than that.\r\nIt's clear to me:  Multiple security teams, lack of resources, no commitment to the proper tool set and subpar salaries?  This organization does not value security or protecting of their data and their clients.\r\nAfter Equifax's breach, I don't want my face plastered all over the internet as the face of a major breach:  I declined the offer", "Interview Questions": "Have you ever worked with LogRhythm?"}, {"date": "2 Jun 2017", "title": "Claims Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth", "Interview Descriptions": "The person who interviewed me was extremely unprofessional and rude. For starters, she was not prepared for the interview as she had the resume of another candidate in front of her, her cellphone was not on silent as I could her how it kept beeping all the time and when I was responding to her questions, she kept staring outside at people walking by her office. I have never witnessed anything so unprofessional in my entire life. I felt like this person was taken straight out of the hood and put in a position of charge within the department. I am so glad that I was not offered a job in this department. Even if I was, I would not take it. I am way more professional than she will ever be.", "Interview Questions": "Very basic non-sense questions in which the interviewer expected me to think like her and if I did not say what she wanted to say, I pretty much wasn't meant for the job. I felt like I was back in high school to be honest. "}, {"date": "20 Jun 2017", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth (New York, NY) in Apr 2017", "Interview Descriptions": "I got interview for intern position.  It took just 15 minutes and easy questions. They didn't ask not that much questions.  After that group leader also contacted me  for ph interview and they didn't reply anymore.", "Interview Questions": "What is the most important thing in Java?"}, {"date": "2 Jun 2017", "title": "Retention Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at MetroPlusHealth (New York, NY) in Oct 2016", "Interview Descriptions": "The referral, interview and offer took approximately one week. The physical, blood work (for titers), and drug screening took another week and start date was another week. So it was a three week process in total.", "Interview Questions": "Why do you want to work in HIV/AIDS? Is your reason for wanting to work in HIV/AIDS for personal reasons?  It is my opinion that the interviewer was trying to ask if I had HIV/AIDS.  I was not applying for a Peer Advocate position where that question would have been relevant.  So  the question  was very unprofessional."}, {"date": "8 Feb 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at MetroPlusHealth in Oct 2016", "Interview Descriptions": "The interview process usually consists of two stages. The first is with the hiring manager and the second with the team whom you will be working with. The second part of the interview can be somewhat overwhelming but at the same time you have the opportunity of interacting with your future colleagues.  It gives you a good feel of what to expect. Aside from this a skills assessment was also required before the second interview.", "Interview Questions": "What are you looking to obtain for this position?"}, {"date": "21 Aug 2016", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at MetroPlusHealth in Aug 2016", "Interview Descriptions": "Where do I start? First you take an online assessment. Then you give your resume to the HR assistant. There two parts two the online assessment. One is multiple choice. One is listening audio. After the assessment I was told I would get a call back in two days never received one. I have call center experience. Like the previous candidate explained what a waste of time. When I called two days later. I was told oh we called the people we needed. Very unprofessional company.", "Interview Questions": "There were online questions. Did not get a call back for interview"}], [{"date": "7 Feb 2016", "title": "Community Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at MetroPlusHealth (New York, NY) in Jan 2016", "Interview Descriptions": "it was easy..........................................\r\nthe interview was informal...........................\r\nthe interview was more about the interviewer.  I'm happy with the way they operate and with the way they treat me and the way they treat their staff in general.  They're good employers.  They've taught me a lot; I've gained a lot of experience and I feel appreciated by them for the results I achieve and, generally, as a member of their team.  I do feel that they're perhaps not as fast-moving and progressive as they could be which is probably my main reason for wishing to move on and join an organization such as yours.", "Interview Questions": "tell about your background in the field work."}, {"date": "13 Sept 2015", "title": "Revenue Operations Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MetroPlusHealth (New York, NY) in Sept 2015", "Interview Descriptions": "I was interviewed by the head of department. The interview was informal. There were no standard questions except for \"tell me about yourself\" part.\r\nI was asked what I did in my previous job, what type of analysis I performed, what data I worked with, etc. I was informed about benefits at Metroplus. \r\nThe second part of the interview was to read an article and write some sort of essay. The purpose of it was to check critical thinking of a candidate. That article was about issues with healthcare.gov website at the end of 2013.\r\nOverall I had a very pleasant experience.", "Interview Questions": "What techniques did you use to analyze data?"}, {"date": "10 Aug 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at MetroPlusHealth", "Interview Descriptions": "The process was pretty long - over a month. Went through one phone and 3 in-person interviews with six different people. During the last one met with 4 C-suites. All were very professional and pleasant.", "Interview Questions": "How would your first month at work look like?"}, {"date": "2 Jul 2015", "title": "CMT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth", "Interview Descriptions": "Very lengthy, you have to be hired the first of every month. Salary goes according to your last salary. If you see a salary range under the job you apply,you will not get that salary unless your in that range. Keep copies of all your benefit documents and vacation/personal etc time, things tend to get lost around here. Get your experience, leave and if you come back you will get more money. Looking for growth, not the place for you. also very very cheap company, pay for christimas party's, no paper plates or cups for your lunch. 1 microwave to share with at least 100 people. No raises!", "Interview Questions": "Experience and responsibilities at the last job."}, {"date": "18 Mar 2015", "title": "Don't Want to Mention Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroPlusHealth", "Interview Descriptions": "I went through a couple rounds of interviews and reached out to HR for a status update after 2 weeks passed from my final interview. I was told to hang tight and then received a call 2 days later from management saying that the company was going through internal restructuring and that they were going in a different direction. Needless to say I was disappointed and would have thought that the restructuring was taking place before I stepped foot in their office for an interview. What a waste of time.", "Interview Questions": "Why healthcare?"}, {"date": "9 Dec 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MetroPlusHealth", "Interview Descriptions": "i was an intern with them before. they contacted me for another position that they had. I applied and eventually got the job after a simple interview. they took some time to reply back, but wanted me to start immediately.", "Interview Questions": "it was an easy interview"}, {"date": "26 Mar 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at MetroPlusHealth (New York, NY) in Sept 2014", "Interview Descriptions": "Applied online many months prior but was not called until i met someone who took a look at my resume and pulled it up and then everything went really fast. Hopefully you know someone who can help to get your resume to be looked at in the first place.\r\nan overview interview with HR over the telephone to make sure you have the requirements. Then another interview with hiring manager. then job offer and salary negotiation and job acceptance.", "Interview Questions": "Why do you want to work with Metroplus?"}, {"date": "13 Jul 2015", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MetroPlusHealth (New York, NY) in Jul 2014", "Interview Descriptions": "Very brief interview on the phone, in person interview had me asking more technical questions then were asked of me . They called me a one week after my interview with an offer. NEGOTIATE your salary! No matter what they say its up for NEGOTIATION!", "Interview Questions": "N/A"}, {"date": "28 Sept 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at MetroPlusHealth (New York, NY) in May 2014", "Interview Descriptions": "You have to take a simple test on the computer if you pass you will interview with 2 or 3 supervisors really simple questions if you get a offer you will have to go in again get fingerprinted and a background check which you have to pay for it out of your first check", "Interview Questions": "Why do you want to work for this company?"}, {"date": "19 Oct 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at MetroPlusHealth (New York, NY) in Mar 2014", "Interview Descriptions": "The interview process was strange to say the least. The red flags are at the very entry, when you find the heaps of garbage, boxes and paper lined against the walls and file cabinets. The questions asked are mainly hypothetical, like \"what are your weakness and strengths?, why did you leave your last employer?\". Then they usually go into rants about the place being a Union environment. They also like to paint a pretty picture in between the negative feedback. You may hear them giving you warnings like \"are you sure you want to work here?\" (follow up instincts and take those warning at face value). The hiring process was a nightmare. They do background checks which you have to pay for ($98 off your first pay check), then you get all kinds of phone calls from the background check company. They can never find proof of anything. Be ready to show copies of everything in your work history and education. (10 years of paystubs or W2's, diplomas, certificates, licenses, etc. This will all happen while you are in training and orientation. You may also receive a lot of phone calls to make you an offer. It is likely that they'll leave you message and forget to hang up, so you'll hear people talking in the background, using profanity and Ebonics. You will be asked to take competency tests. They are easy, I suggest you bring a calculator. They are not know for negotiating salaries, but you should still play hardball, they are desperate for new blood and they have the money, so go for it and make them sweat.", "Interview Questions": "None, everything is hypothetical."}], [{"date": "4 Aug 2013", "title": "Chose Not to Mention Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at MetroPlusHealth", "Interview Descriptions": "The interview was a general interview for a higher-up position, don't want to name what department since this is anonymous.  I got called in and was left for a long time alone in the Exec staff's office for around a few hours waiting for them to show up. What ensued afterwards signaled mainly red flags.", "Interview Questions": "N/A"}, {"date": "20 Dec 2014", "title": "Senior Consultant, to Executive Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MetroPlusHealth (New York, NY) in Jan 2010", "Interview Descriptions": "Met with CEO and together we assessed how I might add value to the organization.  Immediate needs were collaboratively developed and a proposal was submitted.  And, approved by the Board of Directors.  Apparently, there were no difficulties in appointment and a 3-year contract was offered.  At the end of the first contract I was reappointed and extended my engagement for an additional 2 years.", "Interview Questions": "I had been referred as was familiar with the organization.  I was well prepared as I had interviewed with many City organizations."}]]