[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Driven, friendly and focused on mission.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Oct 2022", "job_title": "Key Relationship Manager in Cardiff, Wales", "duration": "N/A", "pros": "As a relatively new employee, I have found Wycliffe to be a very welcoming and diverse team to work with. It is an exciting time to be involved in Bible translation work as we are seeing an upward trajectory in growth of translation projects, income, partnerships and Gospel sharing worldwide and this energy is felt across the organisation. For employees, volunteers and members there is a clear investment in personal development, team building, prayer and opportunities to engage with other staff, volunteers and members at a monthly all-staff meeting (which is very helpful if you intend to work remotely). For those with families, there is flexibility and a generous attitude toward supporting those with dependents. The HR team are supportive and there is a clear intention and culture that seeks to help maximize (and learn from) what skills and experience you bring to Wycliffe, regardless of your age, gender or role within the organisation. There is also access to a diverse range of Christians who are highly experienced in mission, literacy, scripture engagement, theology and church partnership, many of whom are highly respected in their field. This can open your eyes further, if you are looking to be involved long-term in mission and charitable work both here in the UK or abroad.", "cons": "With a growing team at Wycliffe and remote working opportunities on the increase, it can take more time to connect organisationally with all those involved and systems are also often being updated to accommodate new needs, which requires a willingness to adapt to (and contribute toward) changes as they are introduced."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great opportunities and supportive workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Aug 2022", "job_title": "Finance Assistant in Oxford, England", "duration": "N/A", "pros": "Wycliffe Bible Translators are paying for me to do a professional qualification in accounting. They really value their employees and want to provide them with opportunities to develop professionally", "cons": "I don't have any downsides to working here"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "The best job!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Dec 2021", "job_title": "Supporter Care Officer in Oxford, England", "duration": "N/A", "pros": "- Warm, friendly and loving staff team\r\n- A positive learning and work environment is provided\r\n- Personal development is encouraged\r\n- Everyone has the same passion and goal to see people's lives being transformed by God's Word.\r\n- There are daily heartwarming and encouraging conversations with the supporters as well as opportunities to pray for those that are struggling.", "cons": "- Many staff members in the wider staff time work from home, therefore, it is more difficult to get to know them personally. However, there are monthly opportunities to get to see all staff face-to-face.  Other social opportunities are arising too"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Mission-minded NGO in need of innovation", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Apr 2021", "job_title": "Anonymous Employee in Oxford, England", "duration": "N/A", "pros": "- Working with mission-minded teams who are making an eternal impact through Bible translation is fulfilling.\r\n\r\n- Good holiday benefits \r\n\r\n- Training and development opportunities\r\n\r\n- There's a culture of people willing to help across teams and be servant-hearted.", "cons": "Lack of innovation - there is no opportunity for forward thinking or how to develop archaic processes. Stuck in a 20th century mindset incapable of evolving due to poor priorities and staying with what is comfortable.\r\n\r\nLack of self awareness - very inward focused and not enough opportunities to learn from other non-profits in areas of growth. Seems more concerned with maintaining the status quo and doesn't think through properly about how the organisation's image comes across to people outside its walls. \r\n\r\nLack of efficiency with clear organisation and timelines for projects - there is no central planning board so teams are frequently told to work on projects last minute without any additional support or awareness of cross-team impact. Projects can take longer than necessary due to the lack of hard boundaries set for deadlines.\r\n\r\nPoor internal communication - People tend to not know what is going on due to lack of or poor communication from leadership and overall internal culture. This results in poor change management, lack of trust and confusion.\r\n\r\nToo much word salad jargon - For an organisation that translates the Bible, there needs to be an internal practicing what you preach by making internal language easier to understand. The focus on academia means people do not always consider communicating simply in laymen's terms to new staff and supporters. \r\n\r\n\r\nManagement lack experience in their roles and understanding how their teams can work more efficiently - managers seem to be employed because they will maintain the out dated culture rather than challenge the way things are done in order to innovate for the good of the mission."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Good to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Apr 2021", "job_title": "Director in Lancaster, England", "duration": "N/A", "pros": "Work to a vision and mission", "cons": "No main office location at present"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great cause", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jan 2021", "job_title": "Strategy Manager in Oxford, England", "duration": "N/A", "pros": "Bible translation is a great cause to work for. The staff team are very friendly.", "cons": "It's a relatively smaller organisation, so internal career advancement opportunities are more limited."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The mission is more important to them than the people carrying it out", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Oct 2014", "job_title": "Language Surveyor in High Wycombe, England", "duration": "N/A", "pros": "Very diverse job opportunities in a huge variety of international locations\r\nWidely respected on the field\r\nExcellent academic development opportunities\r\nWonderful local staff in each location", "cons": "Despite being inspired by the God who defines love, HR worldwide show ineptitude and insensitivity which can be extremely damaging psychologically. Those interviewing you, training you, overseeing your assignment, etc have total control over where you go, when you go and even whether you go to the field. This power is often wielded without logic or care with entire families being shifted around the globe at the command of the so-called Member Care department. I've seen relationships within families and between colleagues and friends or under severe strain because of this.\r\n\r\nDespite being so culturally diverse, the vast majority of Americans who comprise the organisation have little to no cultural awareness or sensitivity. The negative impact this has on the local communities and members in minority cultures is almost completely invisible to these individuals. There is incredible inertia within the organisation to change this if it is eventually identified as a problem i.e. no recognition of the need for ongoing cultural mediation. Once you've done the orientation, they think all will be fine.\r\n\r\nConfusing and discriminating hierarchy with employees v members and many different regional organisational structures. Administratively Neanderthal. Almost impossible to innovate due to hierarchical control."}], []]