[[{"date": "26 Jul 2022", "title": "Freelance Translator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Amara in Jul 2022", "Interview Descriptions": "Too much questions. I think that's not necessary to a freelance. And the rate is so low. Seriously low. Too much interview, so low rate. I felt cheated. They have no conscience.", "Interview Questions": "What about our editor compared with the other editors?\nWhy are you apply to us?\netc."}, {"date": "6 Oct 2018", "title": "Translator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Amara", "Interview Descriptions": "Easy paperwork that can be done online, then signing a NDA and some other related contract agreement, and a casual Skype interview. It was fairly quick; all took place in a week or so.", "Interview Questions": "Why did you want to apply for this position?"}, {"date": "8 Jan 2018", "title": "Translator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Amara", "Interview Descriptions": "written interview through skype. They got back to me in 2-3 months with a generic email asking me to choose a time slot for interview. Afterwards, I had a skype interview (text only). The questions were generic and I almost sensed as if I was speaking to bot.", "Interview Questions": "Generic questions, almost thought there was a bot. "}, {"date": "25 Oct 2017", "title": "Translator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Amara in Oct 2017", "Interview Descriptions": "I received an email with an invitation to book an interview. There were lots of busy timeslots, the nearest available was in 2 days. The interview consisted of copypasted questions and information.", "Interview Questions": "First, are you age 18 or older? What is your native language, and are you fluent in any others? Are you comfortable translating from your native language into English? Do you currently work for other translation organizations? And do you currently volunteer for any of the Amara teams such as TED Talks, Art21, or PBS NewsHour? If so, for how long?"}, {"date": "16 Nov 2017", "title": "Subtitler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Amara in Oct 2017", "Interview Descriptions": "I applied online (they have a post saying that they are looking for native speakers of many languages. After almost three months that I applied, I received an e-mail asking if I was still interested. Then I received a list of busy timeslots to book an interview. I 100% agree with another post here at Glassdoor: the interview (Skype text chat) consisted of copypasted questions and information. And they seemed to hire everybody that is not a completely nonfit.", "Interview Questions": "Are you at least 18 years of age? "}], [], [], [], [], []]