[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Jul 2023", "job_title": "Project Specialist in Calgary, AB", "duration": "N/A", "pros": "Awesome environment. Supportive seniors. The best part is ECO Canada super weekend (One extra day off on a long weekend).", "cons": "From my perspective, there are none."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Leadership is out to lunch", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Sept 2022", "job_title": "Program Coordinator in Calgary, AB", "duration": "N/A", "pros": "AMAZING group of hard-working individuals, inspiring programs/initiatives, and relatable staff (co-workers) that made every day a fun experience (or at least as much fun as it could have been)", "cons": "Insanely underappreciated workers at the company; from criminally low pay, to straight up verbal abuse, management has no plan to curb the exodus of good employees. I've witnessed an employee getting verbally assaulted in a team meeting, as well as having been sworn at myself - both instances were from the worst \"leader\" I have ever worked for. Management will give you the power to work on a project, but you are on a really short leash in the sense that every action you make and dollar you spend is criticized to no end. Nothing is ever good enough for this sociopath. Also, it seems that some of the Indigenous programs are only backed by the company if it reduces their costs and there is a high profit margin...Not genuinely concerned with actually bettering Indigenous Peoples' lives (don't get me wrong, my colleagues loved what they did and who they worked with, it was management that didn't show any empathy unless there was a dollar sign behind it). Worst employers I have ever worked for. Raises are usually in the 1% range as well...1% of 45,000 is $450. Horrible compensation for such hard working individuals."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing people and valuable work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Feb 2023", "job_title": "Marketing in Calgary, AB", "duration": "N/A", "pros": "The people at ECO are really great. Very friendly teams with a lot of diversity bring all kinds of views and experiences to the table. Everyone is passionate about building the environmental industry, which shows in how we all work together. Great health and wellness plan. The work is rewarding. I never dread Mondays. I enjoy all aspects of my experience here.", "cons": "No specific cons. Everything is how it should be, or better."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Place", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2023", "job_title": "Senior Manager, Professional Services in Calgary, AB", "duration": "N/A", "pros": "Eco Canada is a fantastic place to work. The atmosphere is welcoming and it is staffed by really wonderful people who all come together as an effective team.", "cons": "As a not-for-profit organization Eco Canada restrictions are mandated by law and these restrictions (salaries, etc) may turn off some."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "fun place - interesting work, great people", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Nov 2022", "job_title": "Manager in Calgary, AB", "duration": "N/A", "pros": "As a small non-profit, there is never a boring day. My skills and knowledge base has grown significantly during my time at ECO.", "cons": "flip side to the pros - it's busy and direction changes often - usually because of a funder requirement, but regardless, the day to day never looks the same which can sometimes be tricky to navigate. Luckily the team always has each other's back!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Company Review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Sept 2022", "job_title": "Accountant in Calgary, AB", "duration": "N/A", "pros": "People are very friendly to work with and has a great benefits plan.", "cons": "Overwork the employees and poor compensation for the expected work. Management is reactive versus proactive when it comes to people management (don't understand the team dynamic before hiring someone new). Disregard how the employees are coping with stress and there is hardly any strategy when it comes to conflict. If issues are brought up, they get swept under the carpet and ignored."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Sept 2021", "job_title": "General Accountant in Calgary, AB", "duration": "N/A", "pros": "Highly collaborative team\nGreat work culture\nGreat learning scope\nPositive environment", "cons": "Small to mid-size company therefore there could be delays in career progression."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "A few years ago", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 May 2018", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "- Good celebration events\r\n- Positive, friendly environment\r\n- Yoga at lunch\r\n- Great about work/life balance and vacations\r\n- Loved dogs coming to the office\r\n- Liked working with my immediate Manager", "cons": "- Very limited room to grow (but it's a small company, so that's not their fault)\r\n- It seemed/felt like the company was primarily focused on the marketing team but I was never clear on what they were actually marketing . Ignored other teams in favor of marketing initiatives\r\n- Not a lot of cross team collaboration \r\n- High employee turnover"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "An Amazing Group of People", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Mar 2016", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "The people at ECO Canada are nothing short of incredible. Even years after moving on, I've yet to work at a company where I built such meaningful relationships as I did at ECO Canada, and am still friends with many of them. The employees who end up at ECO are kind, smart as a whip, and warm. A great culture to work in.", "cons": "Upper management has a history of making somewhat rash decisions, and wasn't particularly well liked."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A Dream Job Until You Find Out What You Are Really Worth", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 Jan 2016", "job_title": "Coordinator in Calgary, AB", "duration": "N/A", "pros": "When I first began working here, I loved pretty much everything about this company and the people in it. My co-workers were a smart, talented group of people and the leadership team made us feel like we were part of something bigger than us and making real contributions to Canada's environmental workforce. Managers were flexible with work schedules for employees transitioning from full-time school to full-time work and for employees requesting parental leaves. There was great teamwork across divisions and collaboration was encouraged, which led to cross-functional learning for everyone. In the first few years I worked there, the leadership team was transparent about our position in the current political and economic climate and hosted monthly staff meetings to ensure all employees were aware of initiatives in each division and where we stood with our reaching yearly goals.", "cons": "Over time it became clear the leadership team was not interested in working with employees to address their well-being, concerns, or suggestions for improvement. Leadership became less transparent about the company's overall direction. Manager support for lower-level employees decreased despite multiple accounts from employees who felt overwhelmed by their workload or unsure of their ever-changing responsibilities and expectations.\r\n\r\nI was responsible for implementing several new programs, but after working on these for more than a year, much of it as a team of one, I heard from other co-workers that, during management meetings, my client groups were not being considered part of any new projects as they were no longer valuable to the company's profit goals. I was not given an opportunity to implement improvements to these new programs, and, one by one, the leadership team cancelled most of them without the courtesy of involving me in the process.\r\n\r\nChange and evolution of an organization to meet current market demands is one thing, but to summarily dismiss close to two years' hard work and effort of myself and others and to ditch an entire client base with minimal internal discussions or external communications as to why we were moving in a new direction made me feel like any successes I had achieved and relationships I built for the company were unnoticed and worthless. I saw the majority of my colleagues face similar dismissals of their work and achievements until they decided to apply their skills to other companies that would value them.\r\n\r\nAll of my co-workers were dedicated to their jobs, to the work they did, and wanted the company to succeed, but for some reason those in leadership roles seemed to change over time and made no efforts to address small concerns until they became big concerns, at which point employees were either forced to resign, let go, or left out of frustration."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Project Coordinator", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Apr 2016", "job_title": " in Calgary, AB", "duration": "N/A", "pros": "Great employees and team atmosphere. Management was generally good to work for and provided support when needed.", "cons": "Instability due to government funding."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Client Relations Coordinator", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 May 2018", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "Good atmosphere, supportive supervisors, great place to work for early career", "cons": "High level leadership seemed unclear about overall organizational strategy"}]]