[[{"date": "10 Oct 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kennedy Health", "Interview Descriptions": "It was very easy interview process. The nurse manager was friendly and we basically had a nice conversation. Showed me a tour of the unit and what to expect if I were to be offered the position.", "Interview Questions": "Best/ most difficult part of providing patient care and being in medical field."}, {"date": "23 Sept 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Kennedy Health", "Interview Descriptions": "I am commenting here about the follow up I received from HR after my interview. I sent a brief follow up email reiterating my interest in the position/thanking everyone for their time. I received an immediate, very cordial email back from the hiring manager, stating that the team would be in touch throughout the process. I did not hear back, and 3 weeks later sent a brief email to the HR manager to follow up on my candidacy. Never heard back. Most organizations do acknowledge candidates with some kind of follow up closing the loop. Very antiquated and unprofessional HR department at this organization.", "Interview Questions": "Why do you want to work for our organization?"}, {"date": "7 Apr 2016", "title": "Certified Surgical Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Kennedy Health (Sewell, NJ) in Mar 2016", "Interview Descriptions": "Went through the entire interview process and physical in the span of 3 weeks.  Very quick process and dealt with very pleasant staff.  Met with staff of the surgical center as well and the he recruiter.  Talked with the center manager on the phone several times and she was extremely eager to have me come on board.", "Interview Questions": "Why did I want to come back to Kennedy?"}, {"date": "18 Sept 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Kennedy Health (Newark, NJ) in Feb 2016", "Interview Descriptions": "Very easy interview process. Ask several questions regarding case management skills and abilities. After first interview , second interview. Same process with more introduction to program and staff\r\nAnd goals and objections", "Interview Questions": "How would you handle time managment"}, {"date": "24 Jan 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kennedy Health in Jan 2016", "Interview Descriptions": "HR contacts you for a preinterview to go over basic questions about your experience. Then if elected they will call you back to interview with the hiring manager. The interview with the hiring manager is more specific to the position. They asked questions that were germane to the position such as “ how would you deal with a difficult patient who just had a negative prognosis”.", "Interview Questions": "Questions were pretty basic such as “what is your experience” and “what are your strengths and weaknesses”. The second interview had more difficult questions related to the job itself. Depending on the department they can range from vague to specific."}, {"date": "29 Sept 2015", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kennedy Health", "Interview Descriptions": "applied online, was an internal applicant, went in for interview (waited for an hour for nurse manager to be ready), nurse manager was friendly, explains the process well, nurse manager used standard sheet of interview questions, eventually was beat out by an external candidate who had more experience", "Interview Questions": "strengths and weaknesses, situational questions"}, {"date": "18 Aug 2015", "title": "Med Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kennedy Health (Cherry Hill, NJ) in Jul 2015", "Interview Descriptions": "They were quick to respond to my application. I interviewed three days after my first contact with someone. Friendly process overall. The interview questions were pretty standard. Strengths, weaknesses, how you deal with challenges in the work place, etc. I had to demonstrate skills on the bench as well as the standard interview.", "Interview Questions": "Strengths, weaknesses, etc."}, {"date": "13 Aug 2014", "title": "Nurse Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kennedy Health", "Interview Descriptions": "The questions were normal for the role. They just asked if it was in your ability to everything that you were certified to do. They also asked a few behavioral questions such as how you would respond in a certain situation. There were to separate interviews one with the staffing coordinator and nursing supervisor and the other was with hr.", "Interview Questions": "Have you ever been attacked by a resident and what did you do ?"}, {"date": "27 Mar 2015", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kennedy Health (Cherry Hill, NJ) in Apr 2014", "Interview Descriptions": "Average. Basic questions about your role and few behavioral questions. Team player, why did you choose our company? what is your salary range? how do you handle stress? how many call outs in your last job? what you didn't like about the last management? brief explanation about what I did in my last job? Will my last employer will hire me again?\r\n\r\nOverall interview experience: process was quick, offered the position right away.", "Interview Questions": "Are you a team player?"}, {"date": "20 Oct 2013", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kennedy Health", "Interview Descriptions": "Received a call from the Senior Clinician within 1 week of applying. I interviewed with the Senior Clinician and Program Manager. Typical interview questions about your experience; nothing too difficult. By the end of the interview they told me I would be hired and should expect a call from HR. HR called within a hour to schedule a second interview.", "Interview Questions": "What is your ideal work environment?"}], [{"date": "19 Mar 2013", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kennedy Health", "Interview Descriptions": "Filled out online application, got a call from HR and scheduled an interview.  They weren't flexible with dates.  However, I got to the interview and met with the nurse recruiter for an hour then the nurse manager for another hour of interviews.  Bring 2 copies of your transcript, certifications, and coverletter/resume", "Interview Questions": "None.  Pretty standard.  "}, {"date": "4 Apr 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kennedy Health (Cherry Hill, NJ) in Jan 2012", "Interview Descriptions": "quick and easy process.  Meet with hiring manager then a follow with the nurse recruiter. I received an offer within 5 days.  Nursing is pretty demanding. I was a quick and easy hire--it was a no brainer", "Interview Questions": "why do you want to work here?"}, {"date": "21 Apr 2015", "title": "Patient Care and Clerical Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kennedy Health (Stratford, NJ) in Jul 2011", "Interview Descriptions": "2 interviews one with manager and second with hr. During the interview was told I was going to be hired as a part time worker averaging about 20 hours bi weekly. The first day I started work I was told it changed to 40 hours a week and EVERY WEEKEND", "Interview Questions": "They didn't ask questions they described hours which changed the day I started work."}, {"date": "15 Jun 2011", "title": "Food Seervice Manager II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kennedy Health (Egg Harbor City, NJ) in May 2011", "Interview Descriptions": "the interveiw  went well", "Interview Questions": "how would you handle a conflict with employees"}]]