[[{"date": "12 Dec 2022", "title": "Senior Director Risk Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Apr 2022", "Interview Descriptions": "Extremely intense and somewhat unprofessional - administrative disease was clear throughout the process. The person currently covering for the role was extremely unprofessional in asking what her bosses shared in previous interview sessions.", "Interview Questions": "N/A"}, {"date": "7 Dec 2021", "title": "Recruitment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brooklyn Hospital Center in Dec 2021", "Interview Descriptions": "The interview process was confusing and extremely unorganized. Was first contacted by recruitment to which they left me a message and when I called back multiple times could not get in contact with the person who contacted me. I was then contacted by another person to schedule an interview. Several hours later was finally contacted back by the person who initially contacted me to discuss the position to which I then had to inform the person I had already been contacted to schedule an interview. On the day of the interview the person I was suppose to interview with was apparently busy and could not meet with me so I ended up meeting with the person in charge of recruitment. She barely interviewed me and appeared to not truly be considering me for the recruitment specialist position at all. Instead they kept trying to push a temporary benefits position on me which I didn’t apply for and to which I stated several times thru out the process that I was not interested in as I was only interested in full time permanent work. Nonetheless, after this entire process I was glad to not advance in the process as this does not seem like a company that would be a good fit for me/company I would want to work for. There were too many red flags in the interview/initial phase contact which tells me I probably avoided working in a toxic environment!", "Interview Questions": "What do you look for when sourcing a candidate?"}, {"date": "22 Oct 2021", "title": "Technical Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brooklyn Hospital Center", "Interview Descriptions": "The interview process was extremely unprofessional to the point where I felt racially targeted as a Bipoc. I applied via indeed and within 3 minutes received a call to phone screen which is a red flag. Either the department is desperate to hire or they’re recruitment strategy isn’t great. During the call I was asked to provide reasons for leaving previous employment and to discuss compensation early on without the recruiter discussing the company, the role, any benefits or what they’re looking for. Also, she was extremely passive aggressive in which she kept making assumptions and also stating how they work closely with one another and the right person has to be respectful. I asked if she had any concerns or hesitations about me and she stated this again. Her communication and questions were extremely biased. The salary given was 60k which is under the market value for the industry and she was extremely unpleasant. Now I see why they’re experiencing a staffing shortage. No matter how bad you need a job make sure you find an employer that respects you and doesn’t tell you that you only look good on paper (resume).  That is racially biased and full of micro aggression", "Interview Questions": "How much are you looking too make? "}, {"date": "16 Sept 2021", "title": "Diagnostic Medical Sonographer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Brooklyn Hospital Center (New York, NY) in Aug 2021", "Interview Descriptions": "Very nice and understanding about new graduates and any questions I had. I was able to execute any concerns about the job title work environment and coworkers without worry.  I was also told about what was expected of workers and the daily routine of a sonographer", "Interview Questions": "When are you taking your registry"}, {"date": "13 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brooklyn Hospital Center (Brooklyn, NY)", "Interview Descriptions": "Interview with manager and supervisor. After interview Called back within a week with an offer.  Asked to come in to sign contract officially accepting offer and go over pay and benefits", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "31 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Brooklyn Hospital Center in Jan 2021", "Interview Descriptions": "Quick interview I was nervous but the nurse managers were great. Wish more information was given. I got a call back same day. Orientation was pretty short that's a major downfall.", "Interview Questions": "How do you handle challenges?"}, {"date": "11 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Jul 2020", "Interview Descriptions": "The interview process was an open house event. Many people came as it was advertised online. Spoke to unit managers and ended up getting a position offer a few weeks later.", "Interview Questions": "What do you know about the hospital?"}, {"date": "25 Jan 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Jan 2019", "Interview Descriptions": "Detailed  make sure you know why you want to work there and what you would bring to the hospital and if your looking for long term or short", "Interview Questions": "Why did I want to work there "}, {"date": "18 Jun 2018", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Brooklyn Hospital Center", "Interview Descriptions": "Relaxed and friendly; was given a tour of the facility and met with the department director and chair individually. Had time to speak with PAs on the service working on their current shift.", "Interview Questions": "Why do you want to be a PA at this hospital?"}, {"date": "3 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Brooklyn Hospital Center (New York, NY) in Apr 2018", "Interview Descriptions": "Applied Online. Got a call from the recruiter and scheduled a date for an interview with the Nursing Director of the Unit together with the Nurse Manager. Ask some few questions about yourself.", "Interview Questions": "Why should we hire you?"}], [{"date": "24 Dec 2017", "title": "Quality Assurance Data Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brooklyn Hospital Center (Brooklyn, NY)", "Interview Descriptions": "The interview process is extremely slow. It took me about 2 months. Started with an in person interview followed by an VP interview. Interview questions are very common behavioral questions. The whole interview process is not well- organized, follow-up emails were not being replied. However, the people in the department are very nice and friendly. Very diverse working environment", "Interview Questions": "What's your career plan in 5 years? \r\nTell me about a project you dealing with data?\r\nWhat is your strength?"}, {"date": "6 Sept 2017", "title": "Medication Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Brooklyn Hospital Center", "Interview Descriptions": "Almost a 2 hour interview with the supervisor. He wanted to see if I was a good match and gave me overview of the entire department and waked me through everywhere. It was a great interview. Got to know a lot of people I would work with during the interview.", "Interview Questions": "How would I feel by starting a job that was recently created?"}, {"date": "14 Aug 2017", "title": "BHA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Brooklyn Hospital Center in Apr 2017", "Interview Descriptions": "Very unorganized. Takes less than 2 minutes . They were other people ahead of me coming out telling me that it was the worst. Ask you questions that was related to the job", "Interview Questions": "Where I grew up. Family background... like really"}, {"date": "8 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Feb 2017", "Interview Descriptions": "It was a comfortable environment and everything was completed in a timely manner. It was very professional and the staff was very welcoming. Make sure to arrive early and ask the security for directions! It can be a maze if you try to find the place on your own and you do not want to be late!", "Interview Questions": "Why choose this facility"}, {"date": "10 Sept 2017", "title": "Nutrition Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Oct 2016", "Interview Descriptions": "-sent my resume and cover letter to director, then received email back from her assistant to set up for interview\r\n-meet with the director and her assistant\r\n-after director approval, meet with the site managers,", "Interview Questions": "what is the benefit of Breastfeeding?"}, {"date": "6 Apr 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Brooklyn Hospital Center", "Interview Descriptions": "It was fairly easy, the interviewer was really nice. He made me feel comfortable by lightening up the mood with jokes. He was very knowledgeable of his profession and what he expects of the person who is given the position.", "Interview Questions": "Can you handle a fast paced environment"}, {"date": "16 Mar 2020", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Brooklyn Hospital Center (Dallas, TX) in Jan 2016", "Interview Descriptions": "Interview process was held in Dallas, Tx with all the other candidates. Mostly social questions. No academic questions. It was a very liverly atmosphere, and I did not get nervous after a couple of minutes passed.", "Interview Questions": "Interview was all social. No academic questions"}, {"date": "27 Mar 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Brooklyn Hospital Center (New York, NY) in May 2015", "Interview Descriptions": "they e-mail a short list of questions before, and then invited me to participate in their open house. later they gave everyone a short interview related to their resume and cover letter. later they gave me another call asked some technical questions related to the job description on their post. after that they gave me the offer for intern quickly.", "Interview Questions": "can you explain more about your xxx(experience listed in resume) experience?"}, {"date": "7 Jun 2015", "title": "Senior Patient Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Aug 2012", "Interview Descriptions": "I interviewed with the former CNO. It was a very good interview.  I learned a great deal about my superior and in the end I did get the position I interviewed for successfully.", "Interview Questions": "What was my experience with the type of position."}, {"date": "23 Nov 2011", "title": "Administrative Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Oct 2011", "Interview Descriptions": "This was a joke. Top Administrative person does not kinow what software is deployed.\r\nSpoke about something they do not have for 20 minutes because this came up in the speach that was\r\ngiven to me by Brooklyn Hospital interviewer. Was taken to see another member of this department and when started to talk about the same issue was interrupted by another member of this department with statment: We do not have that.. Felt very bad and confused: One peorson is saing YES, but another one is saing NO.\r\nBrooklyn Hospital Top Administrative person gave me a speach on how great was this peorson who just left, that is why this position became available. That is OK  for 10 to 15 min, but to listen to this for 30 min? I wanted to ask: Why did you let this happened? Why could you keep this person? If this peorson was so great, why not make some accomodations to keep great people? I got my answer without asking. \r\nMy feelings during interview: confused. I felt like they do not want me, they want their great peorson back, BUT I'm not that person. They did not ask my why i\"m looking for new position.\r\nMy feelings after interview: What a waste of time.", "Interview Questions": "How would you address this issue?"}], [{"date": "26 May 2015", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Feb 2011", "Interview Descriptions": "HR interview with department manager. Tour of hospital. Then department interview. Interviewed with all attendings individually. Second interview with dept. manager. Meeting with expected co-workers. Long wait for offer. Interview with department manager was typical battery of questions. Interview with physicians was based on providing experience level", "Interview Questions": "typical....weaknesses, strengths, reason for entering field, why choose TBHC"}, {"date": "20 Jul 2015", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brooklyn Hospital Center (Brooklyn, NY) in Jan 2011", "Interview Descriptions": "Meet with department director. Drilled me with questions. Offered lots of information in regards to the position. Basic questions, where do I see myself in 5 years? what are my qualifications? Met with Human Resources after initial departmental interview. Very basic presentation of paperwork and was offered the job.", "Interview Questions": "What are my qualifications?"}]]