[[{"date": "17 Apr 2023", "title": "PR Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Soil Association (Bristol, England)", "Interview Descriptions": "One hour face-to-face interview with two managers, and one additional PR writing assessment after the interview which should be finished in the office. The managers are very nice and those questions are not very tricky.", "Interview Questions": "why SA; your experiences related; the campaigns you have designed"}, {"date": "28 Mar 2023", "title": "Import/ Export Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Soil Association (Over Silton, England) in Mar 2023", "Interview Descriptions": "Applied online with CV & 4 short answers related to relevant experience and skills and interest in the organisation. Invited for a 1-hr interview with would-be line manager and a manager in another department. Was emailed a prioritisation task to look over before hand and complete in the first 10 mins of the interview. This was then followed by 8 competency based rapid fire questions which you have to give an example for each situation. Thought the interview questions were very specific given the compensation and the role responsibilities. Was emailed later to be told that job description didn't include the fact that you'd have to work some Saturday's and bank holidays. Withdrew my application at that point.", "Interview Questions": "Explain a time when you had to deal with a vulnerable customer. Explain a time when you dealt with financial documentation. What is one word your manager would use to describe you."}, {"date": "24 Feb 2023", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Soil Association in Dec 2022", "Interview Descriptions": "Straight forward application form and cv. If successful then have a 15 minute 'get to know you' microsoft teams meeting with 2 managers. The next stage is 1hr in person interview with same 2 people.", "Interview Questions": "How can I prioritise workload? What would I do if I was the only one in the office that day? What is my experience with various databases? How will I ensure that I enter data accurately? What are my strategies regarding distractions when working in an open plan office?"}, {"date": "24 Aug 2022", "title": "Admin Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Soil Association", "Interview Descriptions": "Expected questions asked about skills, competencies questions \"describe a time you had to prioritise\" , \"describe a time you had to communicate to different people, or do community manager role", "Interview Questions": "why do you want this job\r\ndescribe a time you had to prioritise work"}, {"date": "24 Jul 2023", "title": "Certification Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Soil Association (Bristol, England) in Aug 2022", "Interview Descriptions": "I was invited to a Microsoft Teams interview with 2 managers approximately 2 weeks after applying. Pretty standard interview questions regarding work history, skills, experience etc. Lighthearted phone call role play. Heard back within 10 days, unsuccessful.", "Interview Questions": "Can you describe a time when you followed a procedure and why this is important?"}, {"date": "1 Nov 2021", "title": "Senior Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Soil Association in Oct 2021", "Interview Descriptions": "Very quick processing time. An invitation to interview was offered two days after the closing date for applications. The interview was conducted through MS Teams and feedback was received later that day. The interviewers were kind and professional and the questions were what you would expect for an administrative role.", "Interview Questions": "How would you manage the workflow demands of this role?"}, {"date": "11 Jun 2021", "title": "Certification Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Soil Association (Bristol, England) in May 2021", "Interview Descriptions": "The interview started with a brief presentation of both interviewers. I then presented myself and the interviewers. I had the opportunity to express myself a lot and demonstrate my will to work for the Soil Association. I finally had some time to ask questions about the position and the organisation.", "Interview Questions": "Why do you want to work for the Soil Association? "}, {"date": "25 Jun 2021", "title": "Certification Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Soil Association in May 2021", "Interview Descriptions": "Good. They send me an email invitation for the interview for the interview. We did it by Microsoft Teams due to Covid. They told me that the decision would be taken on Friday, and they called me on Friday to offer me the job", "Interview Questions": "Where are you currently based?"}, {"date": "10 Sept 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Soil Association in Jan 2021", "Interview Descriptions": "Virtual interview, first was a general chat, second had to complete an exercise. Was made to feel comfortable and felt the staff were engaged in what I was saying. Quick turn around with letting you know the outcome of each stage.", "Interview Questions": "What experience can you bring to the role? "}, {"date": "19 Nov 2020", "title": "Inspector Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Soil Association (London, England) in Nov 2020", "Interview Descriptions": "It was a competency based interview. The interview was nice, the interviewers made it relaxed reducing the tension. It was meant to last 1h it lasted 1 hour 40 minutes without even realize it.", "Interview Questions": "What I think are the skills needed for this job?"}], [{"date": "27 Feb 2017", "title": "Producer Support Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Soil Association (Bristol, England) in Sept 2016", "Interview Descriptions": "Simple application process, followed by interview. Interview was 30-45 mins long at headquarters in Bristol. Had a 15 minute task to list the process I'd go through to organise several events and a few questions.", "Interview Questions": "Tell us about your experience"}]]