[[{"date": "5 Aug 2021", "title": "Graduate Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Roosevelt University", "Interview Descriptions": "It was quick and easy. you need to apply on student portal and you will get reply within 3 days.  once they check your student grade and classes attendance. you are good to go.", "Interview Questions": "How's your Classes and Grades going on?"}, {"date": "2 Sept 2020", "title": "Educational Advisor (TRIO) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Roosevelt University", "Interview Descriptions": "Straight forward; they reviewed my resume and then HR contacted me for a prescreen. After, the hiring manager asked basic questions regarding previous experience and why you want to work in this field.", "Interview Questions": "What is your experience with diverse student populations?"}, {"date": "29 Oct 2020", "title": "Assistant Professor, Psychology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Roosevelt University (Chicago, IL) in Sept 2020", "Interview Descriptions": "Wonderful; down to earth; smooth and you get to learn more about the program in depth. Direct answers, want to see if you’re a fit for the overall program; the second interview is about you asking them questions, you get a good opportunity to interview them.", "Interview Questions": "What attracted you to this job? "}, {"date": "13 Mar 2020", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Roosevelt University (Chicago, IL) in Jan 2020", "Interview Descriptions": "Phone screen then onsite. Met with three people onsite and presented on a business problem they chose. Never even got an email back and I even sent a nice thank you follow-up. I ended up getting a much better job so I don't care but I wanted to let people know that this organization doesn't treat interviewees with respect and will just ghost you. It was also apparent in the interview that Roosevelt is financially struggling.", "Interview Questions": "What do you like least about your last role?"}, {"date": "12 Dec 2021", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roosevelt University (Chicago, IL) in Sept 2019", "Interview Descriptions": "There was first a human resources screening phone interview that went over basic information and background experience.  I was then invited to an in-person panel interview that was very laid back and easy-going.", "Interview Questions": "Q: Tell me about a time when you had a conflict with a co-worker."}, {"date": "28 Mar 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Roosevelt University (Chicago, IL) in Mar 2018", "Interview Descriptions": "Asked basic questions such as tell me about yourself, describe your teaching and research philosophies. Meetings with dean and provost are crucial. They will treat you to meals and hotel.", "Interview Questions": "Explain why you want to come here. "}, {"date": "2 May 2019", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Roosevelt University (Chicago, IL) in Sept 2017", "Interview Descriptions": "I was invited to one of the rooms in the school after applying on the jobs board of the school. The interviewer just asks me questions  about my resume and past experiences.", "Interview Questions": "What type of things I had done with tutoring before."}, {"date": "29 Jul 2021", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Roosevelt University in Aug 2017", "Interview Descriptions": "Had an interview with all of the members of the undergraduate department. Gave a presentation on how I would market the school to potentially interested students and their families. Followed by a series of questions from each of the counselors on various topics surrounding working with students.", "Interview Questions": "How would you market Chicago to out of state students?"}, {"date": "24 Jul 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Roosevelt University (Chicago, IL) in Jul 2017", "Interview Descriptions": "Prompt, efficient, and on time. The entire initial process was executed within a week and when I received follow ups they were also very prompt. Interview was not difficult as a result of experience with working within student affairs.", "Interview Questions": "Experience working with student affairs "}, {"date": "23 Mar 2017", "title": "RU Environmental Sustainability Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Roosevelt University (Chicago, IL) in Oct 2016", "Interview Descriptions": "I submitted my application through RU Career Central. Then, the boss okayed me to come in for the interview and to chat with me. An office worker helped me apply, and I got the job. However, the boss had to fill out Employment Personnel Action Forms, so I was not able to start work for a few weeks. However, I have been at the job since October 2016, and am really enjoying it.", "Interview Questions": "What is your greatest weakness?"}], [{"date": "28 Nov 2016", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roosevelt University in Oct 2016", "Interview Descriptions": "First round was done through HR recruiter via phone, asking basic screening questions. The second interview was with the hiring manager. It seemed more like an informational interview than serious, which had me (rightly) believe that they were already considering someone else for the job. It was a short process, though, which was appreciated, and they communicated throughout.", "Interview Questions": "How would you describe your email communication style in three words?\r\n"}, {"date": "21 Mar 2017", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roosevelt University in Oct 2015", "Interview Descriptions": "Began with a few phone calls with a recruiter who made it seem as though I was an extremely qualified candidate. I was emailed for an in-person interview and required to prepare a mock presentation based on given criteria. The interview was a 6 on 1 interview (which was never mentioned) with me first, presenting, and after, q & a from all six of the interviewers.", "Interview Questions": "What were my plans for the next five years?"}, {"date": "31 Jan 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Roosevelt University (Chicago, IL) in Sept 2015", "Interview Descriptions": "The interview process at Roosevelt University was great! The team that interviewed me was kind, organized and respectful.  The actual time it took from start of applying to the job and receiving an offer was slightly longer than 2 months but the HR hiring representative kept me updated each step of the way.  Overall, my experience was a positive one, I just wished it had moved along more quickly but I understand that these reviews need to be thorough.", "Interview Questions": "There was a question regarding a professional development organization and my involvement that I was not familiar with, so that was the biggest surprise of the interview. "}, {"date": "19 Apr 2015", "title": "Desktop HD Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roosevelt University (Chicago, IL) in Aug 2014", "Interview Descriptions": "You sign up for the position on experience.com.  Only Roosevelt Students can apply.  The interview was quick and simple, I met the people I would work with and visited the area I could work if I was hired.", "Interview Questions": "Tell me about yourself."}, {"date": "23 May 2016", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Roosevelt University (Chicago, IL) in Aug 2014", "Interview Descriptions": "Very minimal, I had to go to the career website and upload my resume and and a cover letter. I was surprised they did not have my go through a normal formal interview.  I believe it depends on the job position. For the more higher-tier jobs, I'm sure the interview process is standard.", "Interview Questions": "Why should we hire you?"}, {"date": "7 Jun 2014", "title": "Communication Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Roosevelt University (Chicago, IL) in May 2014", "Interview Descriptions": "Called me in for an interview. Went very well. Nice talk with the VP in charge. Talked for at least 40 minutes abut the position's demands. I asked about the role of the director in the organization. Good experience all around. Even though I didn't get the position, still good experience.", "Interview Questions": "N/A"}]]