[[{"date": "21 Jun 2023", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "At the Psych department it depends really heavily on your relationship with the PI. The process is lab specific but usually involves a presentation and an interview. The presentation involves your research and the interview usually discusses your research agenda.", "Interview Questions": "Describe to me the policy implications of your research"}, {"date": "27 Jun 2023", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University (Princeton, NJ) in Jun 2023", "Interview Descriptions": "I applied through their website, was contacted for a phone interview and then was contacted for an in-person interview and now I am currently waiting to hear back from them.", "Interview Questions": "Why Department of Public Safety?"}], [], [{"date": "16 May 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "Phone screening and then in-person interview with the whole team went well. Nothing too out of the ordinary. I wasn’t offered the position, but did receive a nice email from two members of the team.", "Interview Questions": "You mentioned X on your cover letter. Can you talk about about that? "}, {"date": "6 Apr 2021", "title": "Senior Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "Applied online and received a phone interview after 2 weeks. After my phone interview, they Invited me for the final interview for a whole day (final interview). Met many staff members inside and outside of the place I applied.", "Interview Questions": "Tell me about a time when you failed and what you learned from it."}, {"date": "26 Jan 2021", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "Overall interview process was very smooth and everyone in the process was very nice and encouraging. My only gripe is they pull references on all finalists. HR is transparent, which is appreciated, but seems like poor practice to ask candidates who you know are not the first choice to have professionals in their circle take their time and effort to provide references. It’s not very candidate friendly and is not typical practice. I’d suggest revisiting it.", "Interview Questions": "Princeton is big on diversity and inclusion. "}, {"date": "21 Jul 2021", "title": "Phd Mechanical Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Princeton University (Princeton, NJ) in Jan 2021", "Interview Descriptions": "Got back to be within two weeks of submitting my application. There was only a short fifteen minute interview, run by a two potential advisors that liked my application. The interview went by incredibly quickly and was easy and exactly what you would expect.", "Interview Questions": "Past Experience in research, importance of findings, "}, {"date": "17 Aug 2021", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Princeton University (Princeton, NJ) in Jan 2021", "Interview Descriptions": "The interview process was long: about 4-5 months from initial application to the interviews to finding out the result.\r\n\r\n4 Stages of interviews with multiple zooms - the last of the stages involved 2 day-long zoom marathon sessions that took the place of what used to be on-campus visits.\r\n\r\nWhile helpful, answering the same question in 8 different settings wasn't necessarily the best use of time.\r\n\r\nSome of the interviews were exciting, others a bit more lackluster. I had one faculty member ask me \"Oh, I see you don't do a lot of research lately, can you tell us why not...\" and before I could even answer she continued \"oh, you must not think research is important - can you tell us why you think research is not important?\"  I'm sure you can see how problematic that example was on multiple levels.\r\n\r\nAnyways, overall a neutral experience with peaks and valleys creating that ranking.", "Interview Questions": "What made you decide to apply for this Associate Director role?"}, {"date": "9 Oct 2020", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "I only had to send an online submission - no interview via phone or in-person was required so I had to compile a detailed CV, cover letter and writing sample", "Interview Questions": "Why are you a fit for this department?"}, {"date": "18 Sept 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "First PI will ask you your background. They will ask you to describe your past research experience. Then, they will ask you some technical details regarding your work. Most important thing is to explain in simple words.", "Interview Questions": "Describe your past research experience"}], [{"date": "17 Dec 2020", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Princeton University (Princeton, NJ) in Sept 2020", "Interview Descriptions": "its easy, its on videocall, 2 or 3 round of interview, taken by 2 different people. they will ask you about your achievement and all that, be on time, open your video calling app before 15 min of interview , great experience.", "Interview Questions": "what can you contribute at work place."}, {"date": "25 Aug 2020", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "They asked for a detailed project proposal and approval from a faculty advisor who would supervise your work. I formatted my research proposal in latex and contacted relevant faculty. Interested faculty asked me about past research experience and more details about my proposal.", "Interview Questions": "Asked about technical background needed to complete proposal "}, {"date": "17 Sept 2020", "title": "Graduate Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University in Aug 2020", "Interview Descriptions": "The initial interview was conducted via phone and scheduled for 30 minutes. The interviewer provided clear information regarding the position and responsibilities. Questions dove deeper than just general initial screening questions.", "Interview Questions": "Tell me a bit about yourself."}, {"date": "8 Aug 2021", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Princeton University in Jan 2020", "Interview Descriptions": "It was done through the office of the Dean of Undergraduate Students. You must attend a seminar first. It has a group interview then a personal interview, and this is done to see how well you will do with handling conflict.", "Interview Questions": "Describe a time where you had a personal conflict with someone you disliked, and how did you overcome it?"}, {"date": "18 Dec 2019", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "They held an initial  conversation with HR and the  hiring manager. After the call back there was  a series of meetings in group settings with a few 1:1 interviews. Lunch meeting with a potential peer. Several rounds of interviews.", "Interview Questions": "How do you organize your data?"}, {"date": "18 Apr 2021", "title": "Graphic Designer/Customer Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Princeton University (Princeton, NJ) in Dec 2019", "Interview Descriptions": "I had a phone interview and then had a day scheduled full of interviews. I met with several panels of 3-5 people that took several hours. This position was to work in their print center, so I was very surprised by how rigorous the interview process seemed to be. I was not given an art test either.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Oct 2019", "title": "Research Specialist I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Princeton University in Oct 2019", "Interview Descriptions": "My interview was a video interview because I was from out of state.  It was a pretty relaxed interview conducted by one of the postdocs in the lab.   We basically discussed why I was interested in the lab and how I would be able to perform given my lack of experience in a professional lab setting.", "Interview Questions": "Why are you interested in working on this research?"}, {"date": "15 Oct 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Princeton University (Princeton, NJ) in Sept 2019", "Interview Descriptions": "I Applied Online and then was asked for a Phone Interview. After that I was scheduled to interview in person. The experience was great. I found the person to be extremely professional.", "Interview Questions": "Why do you want to work for this position?"}, {"date": "12 Aug 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University", "Interview Descriptions": "Communicating with the professor over email and in his office to discuss interests and possible research topics. Communicating with the professor over email and in his office to discuss interests and possible research topics.", "Interview Questions": "N/A"}, {"date": "13 Dec 2019", "title": "Faculty Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Princeton University (Princeton, NJ) in Aug 2019", "Interview Descriptions": "I met with the Department Manager for 30 minutes to discuss the position, my interests and goals, and it was very cordial and easy. She had reviewed my resume and we were able to get right down to it without my having to lay everything out in detail. Simple and pleasant.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "15 Jul 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University", "Interview Descriptions": "Very much discussion oriented, no excessively pointed or aggressive questions. Good back and forth with the interviewer. They do a good job of making the whole interview day pretty painless.", "Interview Questions": "Describe the next step in your research"}, {"date": "29 Apr 2022", "title": "Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Princeton University (Princeton, NJ) in Jul 2019", "Interview Descriptions": "The interview process was extremely simple and quick. I had a phone screen with someone from HR and then one, in-person meeting with a group of 3 people (after which HR emailed me extending an offer).", "Interview Questions": "Why are you interested in this particular position?"}, {"date": "22 Sept 2019", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Princeton University (Princeton, NJ) in Jul 2019", "Interview Descriptions": "Wonderful team and experience. The staff was very professional and students were insightful They were thorough and asked all the right questions.  They utilized all the stakeholders with an all-day interview process.  I am glad I had the opportunity to demonstrate my experience and personal interests with the team.", "Interview Questions": "What would you change about the program if you could?"}, {"date": "15 Apr 2019", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "purely a formality, and it's mostly just aimed at actually detailing the schedule of when you'll work. definitely don't worry about this at all. If you get an interview, you're in.", "Interview Questions": "do you have enough time?"}, {"date": "27 Jan 2019", "title": "Librarian (Without Continuing Appointment) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Part 1: 20-minute phone interview with 5-member search committee. Basic questions about qualifications. Part 2: Full-day on-campus interview that included several 1 on 1 and group meetings with a wide variety of people from within the larger library system,  candidate lunch, and a 20-minute presentation (no campus tour). Both interviews were very pleasant and I enjoyed meeting everyone and seeing campus immensely.  Time from when I was invited to the phone interview to the job offer was 6 (very long) months.", "Interview Questions": "This position is 'Librarian without continuing appointment' which is similar to tenure-track. To get a 'continuing appointment' you will have 5 years to innovate services and programs, show leadership, research, publish, go to conferences, contribute to university service, have a national presence in your field, etc. Be prepared to answer questions about how you would contribute to the profession (conferences, research, publishing) and the university (committees, student life) as a whole, not just your job.  Think big."}, {"date": "2 Jul 2018", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "multiple rounds with different committees. full day.  long and drawn out for position at hand. Staff was nice. Decision took a long time ultimately declined the role for better opportunity. Looking forward to other positions there for great benefits.", "Interview Questions": "Typical "}, {"date": "10 Jun 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Princeton University (Princeton, NJ) in Jun 2018", "Interview Descriptions": "I wasn't interviewed as much as I was told that there was no room for growth in the position and no chance of promotion. Everyone seemed nice, but it was disheartening to be told that I would not be offered opprotunities for professional growth.", "Interview Questions": "Why are you interested in working at Princeton?"}], [{"date": "19 Aug 2021", "title": "Summer Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 11 months. I interviewed at Princeton University (Princeton, NJ) in May 2018", "Interview Descriptions": "phone interview, talk about your interests, why you would be good for the internship program, and what you think you can contribute. as well as start date and end date, schedule time to come in and talk about wha research to do.", "Interview Questions": "What did you do related to this research?"}, {"date": "9 Jul 2021", "title": "Technical Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Princeton University in Feb 2018", "Interview Descriptions": "Had a phone interview which lasted 25 minutes.  Mostly went over my past experience.  The interviewer briefly described the job.  Questions were not difficult and was told the second interview would be in person.", "Interview Questions": "Why should we hire you?  Why did you leave your previous employer?"}, {"date": "9 Nov 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "Skype call with a faculty member. Had a nice and easy conversation. Interview questions section only lasted for about 10 minutes then the professor starrts to introduce the campus and program.", "Interview Questions": "They ask you to talk about your experience and research interest. "}, {"date": "22 Oct 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Was asked a lot of soft questions with non-quantifiable answers to objectively compare competing candidates. The interview staff did not have the skill or understanding to evaluate my Web Development skills, so the focus was on  interpersonal throughout most of the process. There was a technical exam, but once I was hired they admitted to not being able to actually evaluate the code I  wrote (it was above the skill level of those involved and they were not going to invite others at the University into the process so they could).", "Interview Questions": "How would you design a chicken?"}, {"date": "23 Oct 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "I interviewed for a PhD program that's on the more social and friendly side of the spectrum. The interview consisted of several days of being hosted by grad students, talking with professors, and social events.", "Interview Questions": "Describe your previous research project in detail."}, {"date": "6 Apr 2018", "title": "Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Oct 2017", "Interview Descriptions": "Extensive: Written questions, phone interview, full-day in-person interviews. All questions asked were relevant and helpful. And everyone I met with was really warm and friendly. The process took a little under two months from the initial phone interview to the full-day round of interviews.", "Interview Questions": "Tell us what interests you about this position. "}, {"date": "14 Sept 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Princeton University", "Interview Descriptions": "Phone Interview followed by a face to face interview with HR. Many other interviews to follow with people in the department.  Interview process all together took a few months.", "Interview Questions": "Why do you want to work at Princeton? What are you strengths? "}], [{"date": "30 Aug 2017", "title": "ARCA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "After filling out the application online with 3 references and a statement of purpose, group interviews of about 10-15 applicants were conducted by current senior staff members of the college core. In addition to group interveiws,  an interview with Director of Student life and Head of the College lasting approximately 30 mins is conducted. Afterwards, the DSL will get back to you within a few weeks, and all responses are released to all applicants at the same time.", "Interview Questions": "What excites you about the role and where do you see yourself excelling? What worries you about the role, and where do you see yourself struggling?"}, {"date": "18 Aug 2017", "title": "Venue Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "I applied online, naturally. Two weeks later I received an email to choose a time that would be suitable to do a thirty minute phone screening with an HR rep. Once I did that, I received an email later that afternoon to set up a second phone interview with my would-be Manager and the Deputy  Director for the performance venues. A day or two after that second phone interview, both lasting around thirty minutes each, I received an invitation to come to campus to interview in person for more intensive discussions. I was told by the individual coordinating the whole affair that all travel and accommodations would be on my own dime, which was a red flag. I know budgets can be rigid, but if you cannot reimburse out-of-state candidates for gas and mileage, at the very least, you need to stick to local applicants or use Zoom video conferences for this process.\r\n\r\nThe actual interview was a day-long extravaganza, beginning at 8:30am. I had a brief discussion with the Venue Manager, which was pleasant. The first group of people I met with were absolutely wonderful, congenial, and seemed to enjoy what they did.  This group was comprised of several Assistant Directors, and Managers. The next group was less attentive. This table was filled with employees from the production area of the department. One person barely looked up from their Mac book and only seemed awake when it was their turn to ask me a question. The third and final group was almost comical in terms of how it was structured, and included Managers and various Assistant/Associate Directors from IT, Building Services, and one Administrative Director who let me know how terribly that round of interviews had gone for me on their way out. This was something I found rather rude, and I kindly remarked that those questions presented all seemed repetitive, while thanking them for the feedback. But really? You do not need to be told that an interview did not go well. I was there, unlike the panel I was meeting with. Very generic interview questions that were all alarmingly similar. I got the impression that these people did not chat prior to sitting down with me that afternoon, or even worse, none of them were listening to what the other interviewers were asking. I am well aware that in lengthy interview processes, the questions can all start to sound similar, but this was ridiculous. Not to mention that the questions themselves are the results that pop up in a Google search of \"interview questions.\" There was only interviewer who seemed to be cognizant of this and had a list of personalized questions more closely related to my experiences and the job in question. \r\n\r\nNext came a brief sit down with the Director, who was quite amiable. Seemed excited to meet me at first, but I soon got the impression that this sunny disposition was not person specific, and not reserved for myself alone. This is not bad, as the world needs these kind of people. I can imagine this Director being wonderful for department morale.\r\n\r\nLater I went to lunch with the Venue Manager and Deputy Director. Both continued to be very warm and welcoming, but I could not shake the sinking feeling that this job was not for me. \r\n\r\nLastly, I met with a Talent Acquisition Specialist. When it was my chance to ask questions, I was given no information. I naturally inquired about salary and when health benefits would begin if selected, and I received a blank stare. The salary range for this role was quite broad, and was discussed on the very first phone screening a month prior, but being invited to campus for a third round opens up the discussion for more specific questions and answers as they pertain to the candidate and the role in question. As kind as this person was, they were not prepared to say much besides how much they enjoyed Princeton and how long they had worked there. I had to email them later that day to remind them that I was still waiting and would very much appreciate an answer for my questions, as that info would ultimately be the gauge for my interest if an offer was to be extended.\r\n\r\nI was thanked for my time, and was told I would hear back in the coming weeks. After a week of not being asked to provide the contact info for my references, I felt relieved. \r\n\r\nAll in all, it was not a bad experience. There were moments in the day that felt less enthusiastic or engaging than others, but still a nice interview process. It was that third panel of employees that seemed quite green. Come prepared and ask questions that relate to the candidate and the position itself. You were meeting with a potential full-time staff member, not a part-time work study. It did not reflect well on your departments, or the University at large.\r\n \r\nThe job I interviewed for probably changed someone's life, but would have been just another position for myself.", "Interview Questions": "You already work at an Ivy League school. Why are you interested in Princeton?"}, {"date": "1 Aug 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Princeton University", "Interview Descriptions": "There was an email distributed to all students regarding the RA opportunity, I emailed the relevant professor and came to a short interview . The interview was casual with a professor I knew well", "Interview Questions": "How many hours a week can you work"}, {"date": "1 May 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Princeton University", "Interview Descriptions": "Invited to campus for an interview before submitting my application.  I took a lab tour and had the ability to ask questions of all the personnel in the program.", "Interview Questions": "Tell us about yourself.  They asked about the findings of my undergraduate research."}, {"date": "10 Apr 2017", "title": "Senior Technical Support Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Princeton University", "Interview Descriptions": "Met with 7 people in 3 hrs. \nIt was overall good. Got a great idea on the team and the employees being supported.\nNot too stuffy. Talked about my skills and some scenarios. It's been 2 weeks and no word. Hope to hear back either way. It was a lengthy interview.", "Interview Questions": "how would you handle an upset user?"}, {"date": "6 Apr 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Princeton University", "Interview Descriptions": "Tedious application process followed by speedy interview. Was asked very general questions with very little feedback. Interviewer simply jotted down my answers while on the phone and did not follow up afterwards as promised. Perhaps they already had somebody in mind?", "Interview Questions": "Tell me an experience where you had to juggle various tasks simultaneously and how you managed your time."}, {"date": "29 Mar 2021", "title": "Web Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University (Princeton, NJ) in Apr 2017", "Interview Descriptions": "First round interview with HR over the phone, second round over the phone, and the third round was in-person.  They were friendly, but it took them months to actually tell me I wasn't getting the job, even though they let me think I was a top candidate.", "Interview Questions": "Just asked about my experience with the tech they wanted me to work on. "}, {"date": "30 Sept 2017", "title": "Facilities Information Technology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Princeton University (Princeton, NJ) in Apr 2017", "Interview Descriptions": "The interview process was pretty basic. They did a good job of responding to my emails and getting things processed in a timely manner. The interview itself was behavioral and not complex at all.", "Interview Questions": "Name a situation where you were placed in an uncomfortable situation. How did you handle it?"}, {"date": "23 Mar 2017", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Interview with several faculty members one on one. They talked to me about my research experience and where I wanted to take my own work. They also described their work and solicited my thoughts on it.", "Interview Questions": "My own research, my thoughts on their research."}, {"date": "6 Mar 2017", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Princeton University", "Interview Descriptions": "No interview was required. I prepared all documents and submitted them online. The documents were easy to prepare. After about one month I was contacted with respect to my application and was offered the job.", "Interview Questions": "N/A"}], [{"date": "30 Mar 2017", "title": "Entrepreneurial Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Princeton University (Haddonfield, NJ) in Feb 2017", "Interview Descriptions": "Phone interview, with a recruitment official went very well; however, I suspected that the job would be given to a Princeton insider.  The interviewer agreed I had a great background for the job, set out a timetable for a second phone interview, and then set up a schedule for a live interview.  I reminded him, that I had not gone to Princeton University, and specifically asked if that limited my job chances.  He said that it would not, but, a few weeks later, I received a rejection notice with no follow up...", "Interview Questions": "Given your extensive qualifications and education, why do you want this position?"}, {"date": "29 Dec 2016", "title": "Office Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Phone interview, then entire morning of meetings. Met with an HR rep and then had 6 30-min. interviews with different people in the department. Also took an online MS Word test and an Excel test, as well as a writing and spelling test.", "Interview Questions": "How do you handle competing priorities?"}, {"date": "20 Oct 2017", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Aug 2016", "Interview Descriptions": "Had a Skype interview first. Then I travelled from Europe for an on-site interview lasting a full day. Met with Professor and Lab members. Overall a decent experience. They were hospitable and friendly. They sent an offer within two weeks.", "Interview Questions": "Where do you see yourself in 5 years?\r\n"}, {"date": "14 Mar 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Princeton University (Princeton, NJ) in Mar 2016", "Interview Descriptions": "The interview process can be long, drawn out, and mentally draining.  Princeton University is a very bureaucratic place to work, so hiring requires a lot of buy-in from \"all the right people\".  However, candidates should use this as an opportunity to ask as many questions as they want in order to make sure that it is the right fit.", "Interview Questions": "How will I acclimate to the Princeton culture?"}, {"date": "27 Feb 2018", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Princeton University in Mar 2016", "Interview Descriptions": "Skype interview with five professors. Everybody asked a question. There were from the same department. They didn't ask tricky questions. Although I wasn't selected for the position, I really appreciated the opportunity and experience.", "Interview Questions": "How could you bring more students to your class?"}, {"date": "21 Feb 2016", "title": "Staff Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Princeton University (Princeton, NJ) in Jan 2016", "Interview Descriptions": "Met with several members of the HR department, some individually, some together with another staff member, after passing an initial phone interview. Some of the interviewers showed very thinly veiled disdain; I suppose it was not their particular choice to invite me for the in-person interview or they felt they had far better things to do. In another interview with two staff members, one very obviously zoned out, yawned(!), and showed a total lack of interest while his colleague took over to explain some things and while I talked. Is this on purpose? It certainly didn't seem like acting. While certain staff members showed professionalism and general cordiality, the rest left a very sour taste in my mouth for the university and had I been offered the position I seriously question whether I could have joined that environment. I do not anticipate seeking further opportunities at this institution.", "Interview Questions": "Describe a success and a failure and what you learned from each."}, {"date": "14 Apr 2017", "title": "Laboratory Safety Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Princeton University (Princeton, NJ) in Jan 2016", "Interview Descriptions": "Applied through Princeton University hiring website.  I was asked to interview at the main building for EHS.  I met several of the staff, including the Managing Director, the Director of Laboratory Safety, and all of the Supervisors.  They asked me several questions about my experience.", "Interview Questions": "Have you ever been involved in a laboratory safety incident?"}, {"date": "10 Mar 2016", "title": "Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Princeton University (Princeton, NJ) in Dec 2015", "Interview Descriptions": "I have applied an IT position on University. It took 1 1/2 months to get phone interview with department manager. Another week to talk to HR personal to provide my personal information. Waits another 3 weeks to have face to face interview with hiring manager, was told this is 1st round interview. A full morning (3 hrs) talked with 7 people(managers) who comes from 4 different departments.\r\nI am lucky enough pass through and ready for 2nd round F2F interview, another 2 weeks waiting. To meet with 3 directors from different departments that I previous met with managers. Then, have lunch with other staffs/developers.\r\nAfter two round interview, I still wait for the result after one month. My friend who works in University told me that it is normal to take 3 months on hiring process.\r\n\r\nTo wait for this position and result of interview, I already turn down 2 other offers. Now, I think it is not worth, because I am not sure I can obtain this opening after 3 months waiting.\r\n\r\nBy the way, they will have background check before hiring, so not sure how long will be for that.\r\n\r\nTo who wants to apply position on University,  I will suggest you apply when you still have other job, don't wait when you are unemployment, like me. If you got short term contract position, take it when you are waiting the answer from University. Most likely, you will finish your 4 months contact before you get reply from University.", "Interview Questions": "Not much tech questions, but describe your previous experience.\r\nWhy you want to apply this job?\r\nWhat is your next 5 years planning?"}, {"date": "4 Jul 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Princeton University (Princeton, NJ) in Dec 2015", "Interview Descriptions": "I met a professor who I had contacted through email in person. We sat down once and chatted about his work. I I was doing research through a program which payed half of my stipend and expected Princeton to pay the other half. Since I came from a pretty prestigious university, it was pretty much assumed that I was qualified for the job. The interview was more of a get to know each other.", "Interview Questions": "He asked me about what I wanted to get out of the research, logistics of the program I was doing research for, and what my interests were."}, {"date": "6 Mar 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Oct 2015", "Interview Descriptions": "Got in touch with a Professor who is recruiting. I was invited to give a talk (45min) on my graduate reseach. Talked with the members there. A week later, I was offered a job.", "Interview Questions": "When I can start the job if offered."}], [{"date": "15 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Princeton University", "Interview Descriptions": "There wasn't really an interview process. They just look at your application, which does need to be very competitive. GRE scores, recommendation letters, GPA, and writing sample. Typical application. The recommendation letters and writing sample are probably the most important aspects of the whole process.", "Interview Questions": "No questions, really."}, {"date": "10 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University", "Interview Descriptions": "The research statement portion of the application is likely the most important part of the application.  You should be specific in why you want to be at Princeton and which professors you are particularly interested.  Professors are looking for students who are great fits for their lab and who will likely select their lab as their top choice. Do not get distracted by the great visitation day performances that Princeton (and all universities) put; you are there to see the personal side of your research group possibilities.", "Interview Questions": "Description of research interests.  Previous research experience."}, {"date": "19 Dec 2015", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Sept 2015", "Interview Descriptions": "\"Screening\" interview with Human Resources Dept. Questions weren't hard, pretty much as one would expect. The interview was entirely to learn more about me and provided no enlightenment about the position, although I said I'd like to know more. Information I was given during the interview about the hiring process has proven untrue. Was told they would hire someone within two to three weeks. It's now been seven weeks and no one's\r\nbeen hired.  I've heard from all sorts of sources that Princeton University is inordinately slow to make hiring decisions, at least for non-academic positions, but I'm still surprised, given what I was told in this particular case. To stay sane,  candidates shouldn't hold their breath and should pursue alternative employment aggressively.", "Interview Questions": "Why are you qualified to perform this job?"}, {"date": "31 Aug 2015", "title": "Senior Java Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Phone Interview followed by an interview with the hiring manager and a meeting with senior members of the team.  For the most part it was informal and only included a brief whiteboard session.", "Interview Questions": "Can integer factorization be done in polynomial time on a classical computer?"}, {"date": "10 Sept 2015", "title": "Generic Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Princeton University (Princeton, NJ) in Jun 2015", "Interview Descriptions": "When I traveled to Princeton for the day, I found the experience very easy. The HR group faciliated the day and schedule very well, the day went very smoothly, including my travel and accommodations. everyone was friendly and welcoming", "Interview Questions": "What questions did I have for them"}, {"date": "21 Aug 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Princeton University (Princeton, NJ) in Apr 2015", "Interview Descriptions": "It depends on your qualifications and your contributions in research. There are no tricky questions in the interview. You present a talk and talk to the mentor who want to hire you.", "Interview Questions": "Do you like research"}, {"date": "19 Mar 2015", "title": "Theater Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "I applied online, got an email asking me to schedule a phone interview. Phone interview lasted about 30min. They asked me some questions such as why would you like to work for Princeton University\r\n? We discussed my previous work history.", "Interview Questions": "Why do you wanna work in Princeton University?"}, {"date": "27 Aug 2015", "title": "Business DevelopmentKeller Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Princeton University (New York, NY) in Mar 2015", "Interview Descriptions": "Received E-mail from school department E-mail; apply and fill in basic information on strength, background, and submit resume etc. Received a 20-minutes phone call after a week, and received the offer after 2 weeks.", "Interview Questions": "How is your experience related to what we are trying to do?"}, {"date": "25 Oct 2015", "title": "Outside Reader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Princeton University (Princeton, NJ) in Mar 2015", "Interview Descriptions": "The interview process was fairly casual and I was interviewed by one of the young admissions staff, who asked me fairly predictable questions about my motivation, background, and interest in the position.", "Interview Questions": "Whether I would willing to work flexible hours and why I was motivated to work on admissions."}, {"date": "31 Mar 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Feb 2015", "Interview Descriptions": "Half day interview; met with multiple different parties for 1/2 hour blocks of time.\r\n\r\nInterview itself wasn't bad - really got a good feel for the department and what would be required. The most challenging part was finding the building - signage was terrible and snow made it challenging.\r\n\r\nThe worst part was after the interview. I was explicitly told by an HR representative while I was there that either he or the potential supervisor would call me within the next week and a half - either way. I clarified to make sure I heard him correctly, and he confirmed. After over two weeks, I heard nothing, so I reached out to him via email - no response. I found out someone else got the position after over a month of checking my online application status, and seeing the position was full. Another two weeks after that, I received an email from an Admin Assistant, telling me that I did not get the job.\r\n\r\nThis was completely unprofessional. If you're not going to call, then don't say you will. Not responding to emails, especially with prospective staff recruits, is rude and has put a completely negative idea in my mind on the values of the institution if they treat prospective employees in this way. I'm okay with not getting the job, but not with being told I'll be contacted by phone, and then ignored.", "Interview Questions": "What are your values?"}], [{"date": "4 Feb 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Princeton University", "Interview Descriptions": "The interview process varies dramatically between different people, professors, majors, and experiences. There was a long delay between the application and the interview, but that was so that they could select the top candidates. Not everyone got an interview, and mine was very laid back.", "Interview Questions": "If you could study anything, what would it be?"}, {"date": "10 Dec 2015", "title": "Circulation Desk Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Princeton University (Princeton, NJ) in Feb 2015", "Interview Descriptions": "They only asked me behavioral questions about my non-academic life on campus and how good I am with time management. Because Firestone Circulation is always lacking people, she talked as if I had already gotten the job.", "Interview Questions": "What do you do on campus?"}, {"date": "1 Mar 2017", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University (New York, NY) in Feb 2015", "Interview Descriptions": "After submitting an application, which consisted of a cover letter, resume, writing sample, and three recommendations, I had a Skype interview with two faculty members. They asked pointed questions about my research and teaching.", "Interview Questions": "What is my second research project?"}, {"date": "23 Sept 2019", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Jan 2015", "Interview Descriptions": "Can you tell me a little about yourself? ...\r\nHow did you hear about the position? ...\r\nWhat do you know about the company? ...\r\nWhy do you want this job? ...\r\nWhy should we hire you? ...\r\nWhat are your greatest professional strengths? ...\r\nWhat do you consider to be your weaknesses?", "Interview Questions": "What are your goals in five years?"}, {"date": "16 Mar 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Princeton University in Jan 2015", "Interview Descriptions": "Applied to princeton graduate program online. Contacted by a professor for a skype interview. Answered questions about my previous research. No tough questions as I was prepared to talk about my resume.", "Interview Questions": "Describe your most recent research"}, {"date": "22 Jan 2018", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Princeton University (Princeton, NJ) in Nov 2014", "Interview Descriptions": "Everybody who applies has good credentials therefore you need to have a strong statement of purpose.  Similarly, GRE scores are high. If the department of the application does not know the candidate, it is important to have high scores.", "Interview Questions": "Who do you want to work with and why?"}, {"date": "15 Oct 2014", "title": "Research Specialist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Princeton University", "Interview Descriptions": "Received interview request from hiring manager (PI) directly; after initial interview, had a phone interview with HR two weeks later. Did not get the offer, was irritated that HR never followed up with hiring decision as promised (had been told I would be notified \"either way\" in the next couple of days).", "Interview Questions": "Interview with hiring manager was subject-based, nothing unexpected; HR only wanted to discuss benefits/salary requirements/etc."}, {"date": "8 Nov 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Princeton University (Princeton, NJ) in Aug 2014", "Interview Descriptions": "There was a brief 1-on-1 interview, during which I was asked about my qualifications at a tutor, strategies I found useful in the class, what I would do in certain situations, etc.", "Interview Questions": "They asked me why I felt like I was qualified to tutor Microeconomics, and how I would ensure that my students would be able to learn. "}, {"date": "22 Feb 2016", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (New York, NY) in Aug 2014", "Interview Descriptions": "very relaxed, asked questions about previous research, professional goals, what your interests in research are. they described their projects and then asked if you had any questions about their work and if their work seemed of interest to you. very friendly, quick, and relaxed process\r\n\r\nthey asked about the projects i discussed and sometimes asked specific field-related questions in order to get a better sense of how well the interview knows the material", "Interview Questions": "describe a research project you participated in"}, {"date": "16 May 2014", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Typical interview with the head of the lab and the lab members.  You give a presentation in the morning, meet with 4-5 lab members individually, go out to lunch and conclude with a meeting with the boss.  An offer can them be given in person by the end of the day or you may be told you will be contacted shortly.", "Interview Questions": "Why would you like to work in my lab?"}], [{"date": "13 Sept 2015", "title": "Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Mar 2014", "Interview Descriptions": "Easy, simple questions, friendly environment. Be ready to talk about your qualifications and availability, as there is a big time commitment for the job. Otherwise not difficult, just be prepared to be interviewed by the entire office of roughly 8 people.", "Interview Questions": "Will you need to take leave for any vacation?"}, {"date": "30 Jan 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Jobs for students are posted on the Student Employment Website.  I submitted a resume and cover letter, followed by a short 20 minute interview about my resume. I worked for a politics professor and was able to work about 8 hours per week, whenever I wanted.  We met once a week to discuss my research progress, and I self-reported hours into the payroll system.", "Interview Questions": "Questions were not difficult."}, {"date": "6 Jan 2014", "title": "Assistant Director Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Princeton University", "Interview Descriptions": "Started with a screening phone interview in which questions focused on skills and experiences.  These were the typical interview questions.   Then had an all day in-person interview with most of the staff at some point in the day.  Started with an interview with the three staff members who I would be working with the most closely.  This was a conversational interview asking about experiences, thoughts about trends in the field, etc.  After this round, I met with the administrative staff and had a chance to ask many questions.  I then received a tour of the campus by a staff member and had a lunch interview with the Director.", "Interview Questions": "Questions were behavioral and nothing too unexpected."}, {"date": "13 Jan 2014", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "The outcome of an interview for a postdoctoral position relies on publications, good recommendation letters, and a good style of presenting your research. There is nothing special to Princeton University in this respect.", "Interview Questions": "Nothing unexpected or difficult."}, {"date": "13 Jan 2016", "title": "Undergraduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Princeton University in Jan 2014", "Interview Descriptions": "It was a typical college interview, asking questions about extracurriculars, my high school experience, my interests, where I saw myself in the future, etc.\r\nInterviewer also answered questions about the academic program, student life, and reminisced.", "Interview Questions": "Tell me about your high school experience."}, {"date": "8 Nov 2014", "title": "Master of Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Princeton University in Jan 2014", "Interview Descriptions": "An interview with the lady in charge of career service of that program. She is pretty friendly and the questions are all quite predictable like why do you want to study Finance and what is your future career goal.", "Interview Questions": "What news are you following in risk management"}, {"date": "23 Mar 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Princeton University (Princeton, NJ) in Jan 2014", "Interview Descriptions": "There was a phone screen and then four panel interviews over a series of many weeks, The interview sessions themselves were also a few hours long.  It was a marathon of interviews.", "Interview Questions": "How would you navigate working with a difficult group?"}, {"date": "28 Nov 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Oct 2013", "Interview Descriptions": "The interview involved an informal meeting at a scientific conference and then some email correspondence before a formal (on-site) interview. The interview included meetings with all lab staff and the PI, a brief lab-meeting style presentation of my graduate work, and a tour of the facilities and campus.", "Interview Questions": "Why was I interested in this lab's work specifically?"}, {"date": "19 Feb 2014", "title": "Research Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Princeton University in Sept 2013", "Interview Descriptions": "The interview process was in depth and took a long time to complete. Start to finish it took months.  The initial offer was an intentional low ball. but they were willing to negotiate to a normal salary range.   The people were very friendly and very helpful. The Institution itself is very small and the campus is beautiful. It is a perfect place to allow for very creative thought processes to occur. The people are independent and very intelligent.  With no major cities around it makes it difficult to buy anything which results in a tremendous reliance on online ordering. They love their policies.", "Interview Questions": "It was difficult to answer: \"Where do you want your career to take you\" "}, {"date": "16 Mar 2014", "title": "Web Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Princeton University in Aug 2013", "Interview Descriptions": "Interview was started by a recruiter. He put me in contact with one of the developers that I'd be working with. I had a quick phone call interview with him. Interview went well. Second interview was with 2 developers via phone. This one went well also. The third and final interview that I had with them was a skype interview. I wasn't quite prepared as I think they were looking for specific coding examples and I didn't realize that was the purpose of the interview. It still went well though and was an overall good experience, they just went with someone else for the position.", "Interview Questions": "There really were no difficult or unexpected questions. All the questions were relevant and expected for the position."}], [{"date": "31 Jul 2013", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "A junior staff member gave me a tour of the office. She was very nice and geared the tour towards the position's responsibilities. The interview followed with the senior staff. The questions were basic but detailed. The interview took about 60 minutes.", "Interview Questions": "Behavioral questions such as \"What would you do in certain situations.\" They wanted very detailed responses. "}, {"date": "10 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Princeton University", "Interview Descriptions": "An email was received, an interview scheduled via email, an on-site interview, then a phone call from HR with the offer.", "Interview Questions": "Why are you interested in this position?"}, {"date": "6 Mar 2013", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Princeton University", "Interview Descriptions": "I interviewed my research advisor.\r\nThe hiring process for international postdocs was rather slow. And they only give 1-year VISA contracts to foreign postdocs, unless you have an outside fellowship.\r\n\r\nReceived very little help in terms of relocation. Housing is surprisingly expensive, and there are essentially no subsidized or on-campus housing options for postdocs.", "Interview Questions": "Nothing special"}, {"date": "20 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Princeton University (Princeton, NJ) in Mar 2013", "Interview Descriptions": "There was no interview process. Admission seemed to be based solely off of resumes and essays that were included in the application. Essays were not particularly short but not hard to complete.", "Interview Questions": "Nothing"}, {"date": "23 Feb 2013", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Princeton University", "Interview Descriptions": "Phone call interview asking why I was interested in Princeton University and which were the other schools I applied to.", "Interview Questions": "Is there anything that you would like to tell to the admissions committee?"}, {"date": "20 Jan 2013", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Princeton University (Princeton, NJ)", "Interview Descriptions": "Resume sent online, phone call, brief chat, loooong 2 hour interview with Staffing HR, Department Manager, another manager, and 3 other Administrative Staff.  Was pretty stuffy with HR and DM - but other staff more friendly.  Got the feeling some tension within the team.", "Interview Questions": "Not so difficult, but recurring question regarding \"how do you handle difficult personalities?\"\r\nA lot of \"behavioral\" type questions. "}, {"date": "29 Sept 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Princeton University in Jan 2013", "Interview Descriptions": "The committee evaluated the application and decided to give me an offer. Then graduate school sent me an official offer letter and during the visiting weekend, I accepted the offer.", "Interview Questions": "Why did you choose Princeton?"}, {"date": "7 Mar 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Princeton University (Princeton, NJ) in Jan 2013", "Interview Descriptions": "The interview was during the phone call. Beforehand, the interview is scheduled with the targeted professors based on interests and background. After the phone interview, my profile was checked by graduate school and department", "Interview Questions": "Background and undergraduate research"}, {"date": "10 Mar 2013", "title": "Undergraduate Student Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Princeton University (New York, NY) in Jan 2013", "Interview Descriptions": "Brief and interviewer was keen on time and this was by far the shortest interview I've had.", "Interview Questions": "The interviewer asked many questions about my interests and I described my past work on projects to her. No questions were particularly unexpected and she started out by going through a list of generic questions until I started telling her a bit about my background and asking her questions. Probably the most difficult aspect was trying to answer her questions and maintain respect for her despite her pretentiousness regarding the prestige of the institution. "}, {"date": "27 Oct 2016", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Princeton University (Princeton, NJ) in Dec 2012", "Interview Descriptions": "It was a very brief and short test that I had to pass as a student manager. I was originally a captain in the crews. Then I was asked to do a shift and so I did. It went well as I remember", "Interview Questions": "How long does it take to brew Coffee"}], [{"date": "9 Mar 2016", "title": "Office Support III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Princeton University (Princeton, NJ) in Oct 2012", "Interview Descriptions": "Had to come for 2 interviews and go out to lunch with department to see if I fit in with the people I would be working for.  had to meet one on one and also with a bunch of different groups of people . first I had a phone interview.", "Interview Questions": "they asked about my skills , whether I liked to work alone or as a team, what I had done at my past jobs , I think they were more interested in my personality as well as my skills. they wanted to make sure I would fit in with the group."}, {"date": "20 Jul 2016", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Oct 2012", "Interview Descriptions": "There's just an online application. This application involves writing a personal statement, providing letters of recommendation, submitting all of your transcripts, and, finally, submitting your GRE and GRE Subject test scores.", "Interview Questions": "No interview. Just an online application"}, {"date": "9 Nov 2013", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Princeton University (Princeton, NJ) in Jun 2012", "Interview Descriptions": "Contact with professor via email, first step: recommendation letters, second step: skype interview. Received Job offer immediately.", "Interview Questions": "We talked about details on my research."}, {"date": "7 Jun 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Princeton University (Princeton, NJ) in Mar 2012", "Interview Descriptions": "The interview process took 2 days. You are invited to visit the school and you are asked to meet with at-least 3 faculty members on a one on one basis to discuss research.", "Interview Questions": "They asked about my previous research experience"}, {"date": "19 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 months. I interviewed at Princeton University (Princeton, NJ) in Feb 2012", "Interview Descriptions": "I applied as with the full application, including many writing samples, curriculum vitae, and three recommendations from three professors who had taught me, and i also submitted extra materials to enhance my application. The interview only occurred after I had been accepted to the PhD program. This seems like a dumb way to weed out candidates! When you are accepting 2% of the applications you receive, why not meet some people first? I don't understand or respect this manner of hiring.", "Interview Questions": "Are you excited about coming to Princeton?"}, {"date": "9 Dec 2016", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Princeton University (Princeton, NJ) in Jan 2012", "Interview Descriptions": "Lengthy application, interview was quick (one weekend). Mostly about touring the place rather than a rigorous interview. Mostly the interview weekend functions to screen out the wackos who look good on paper. Once you get the interview you are more or less in.", "Interview Questions": "Describe my research"}, {"date": "2 Apr 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Princeton University (Princeton, NJ) in Apr 2011", "Interview Descriptions": "Waited about 3 months for an interview, finally got a call.  Went in the next day was greeted kindly, the people who interviewed me were great, made me feel welcome, gave me the tour, met everyone etc etc", "Interview Questions": "Can you handle monotonous tasks?"}, {"date": "28 Oct 2015", "title": "Manager, Information Technology Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Princeton University (Princeton, NJ) in Apr 2011", "Interview Descriptions": "The position was posted on the university's website and provided an online application process.  The interview consisted of an initial phone interview to assess basic level of required skills, followed by an interview with 4 senior level managers, followed up by a second round of interviews with several faculty.", "Interview Questions": "How would I manage an issue surrounding a faculty member who did not receive an acceptable level of service by a technician."}, {"date": "11 Jun 2012", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Princeton University (Princeton, FL) in Feb 2011", "Interview Descriptions": "everything from your initial communications with the company, organization and planning of the interview, number and type of interviews, and any advice you might offer to other interview candidates. Bonus points for your perceptions of the people, office, and work culture.", "Interview Questions": "whhy are you interested in Princeton University?"}, {"date": "2 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Princeton University (Princeton, NJ) in Feb 2011", "Interview Descriptions": "This differs wildly by department, many of which don't even have interviews. In some departments, it's \"visit day\" and you are already accepted. In some departments, it's kind of cut-throat. It even differs by advisor, some consider it a real \"interview\" and some consider it a last-ditch screening attempt to make sure you're not an axe murderer who will terrorize the department for the next 5? years. I am posting this to get the glassdoor upgrade. It is stupid that they require this.", "Interview Questions": "How do you see yourself fitting in to this department?\r\nIf you had unlimited funds, describe one experiment you would run."}], [{"date": "23 May 2015", "title": "Undergraduate Student Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University (Boston, MA) in Feb 2011", "Interview Descriptions": "Interviewing for Princeton in an opportunity for the applicant to demonstrate there is a personality behind the application. It's an opportunity to support the things you've mentioned in the CommonApp, but it's important not to reiterate everything you've already written.", "Interview Questions": "My interviewer did not initially ask any questions and left it open for me to speak about myself. So preparing a little spiel about why you're an ideal applicant might be useful. Otherwise college interviewers might want to hear about how you think as a student, how you spend your free time etc..."}, {"date": "31 Oct 2013", "title": "Postodc Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Princeton University (Princeton, NJ) in May 2009", "Interview Descriptions": "standard postdoc interview drill. good papers and manners and you are in.", "Interview Questions": "N/A"}, {"date": "11 May 2009", "title": "Librarian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Princeton University (Princeton, NJ) in Apr 2009", "Interview Descriptions": "The interview for this position was an entire day with meetings scheduled with different individuals and with various groups.  In addition, I had to give a presentation that was open to all staff. \r\nMost of the day went well.  I met with the University Librarian, with the person to whom I would report, with some faculty members, and with various other staff and librarians with whom I would work or interact.  A very grueling day. \r\n\r\nWhile most of the people were professional and seemed to want to give a good impression of the workplace, there were a few staff members in particular who were almost belligerent in the way in which they asked questions or addressed me.  I understand the need to give a real perception of the workplace, but this was a little too real and I would not want to have to work with people such as those.  The job may be at Princeton University, but it seems they have some internal housecleaning to do before they can expect to attract some qualified people.", "Interview Questions": "How would you change your teaching style for a different audience (graduate vs undergraduate student or faculty)?"}, {"date": "16 Sept 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Princeton University (Princeton, NJ) in Apr 2009", "Interview Descriptions": "Applied through normal process and got an admit from Department of Civil and Environmental Engineering at Princeton University, Princeton, NJ", "Interview Questions": "Not very many unexpected questions"}, {"date": "6 Feb 2010", "title": "Engineering Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 days. I interviewed at Princeton University (Princeton Junction, Mercer, NJ) in Jun 2008", "Interview Descriptions": "Phone interview, resume sent, nice people very nice work environment. Lots of interactions and very fun place to be great town and close to NY very smart people all around many einsteins everywhere with long beards. really enjoy the place and think of smart people best for future progress and greatest school in country", "Interview Questions": "what is your name"}]]