[[{"date": "15 Jun 2023", "title": "Practice Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southcoast Health System (Savannah, GA)", "Interview Descriptions": "Interview process consisted of 4 interviews over a 2 week period. The interviewers included managers, human resources, and the company CEO. The process was all in person except for the initial telephone screening.", "Interview Questions": "Basic interview questions regarding experience and specific working scenarios. Management style, people skills, conflict skills, would you work overtime, weekends, evenings, etc."}, {"date": "11 May 2023", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southcoast Health System", "Interview Descriptions": "I felt their was poor communication and no responses after interviews. This is unacceptable in this day with all the forms of communication at our fingertips. A simple email informing a candidate they weren’t hired is a simple request.", "Interview Questions": "Why am I leaving my current position?"}, {"date": "26 Apr 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southcoast Health System (New Bedford, MA) in Feb 2023", "Interview Descriptions": "Positive interview process - phone screening and then interviewing with hiring manager. The interview was very positive. Felt comfortable throughout the interview with questions and topics and the hiring manager also made me feel comfortable which led to a fantastic conversation. Problem was the process post interview. I was told I was the leading candidate and potential next steps to then getting ghosted and told they were going in a different direction.", "Interview Questions": "How do you prepare presentations for senior leadership?"}, {"date": "19 Nov 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southcoast Health System", "Interview Descriptions": "Good interview techniques and ample time taken to complete the interview and attention paid to the interviews and made candidate feel welcome, gave them opportunity to talk and ask their questions and told candidate what happens next", "Interview Questions": "Why I wanted to work"}, {"date": "27 Oct 2022", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southcoast Health System", "Interview Descriptions": "Had about 4 interviews and then was ghosted by HR/the recruiter for months until I got an automated message that I wasn't selected. Very unprofessional. Could have at least replied to one of my follow up emails since we had already spoken.", "Interview Questions": "Don't recall it was months ago."}, {"date": "24 Dec 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southcoast Health System (Waltham, MA) in Oct 2022", "Interview Descriptions": "First, had a phone call with HR. Then a follow up phone call with the hiring manager. Last, an in person with hiring manager. Very easy streamlined process. Great process.", "Interview Questions": "Describe your previous work experience."}, {"date": "4 Jan 2023", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southcoast Health System (New Bedford, MA) in Dec 2021", "Interview Descriptions": "Phone interview was concise and informative. Very flexible and understanding, as there were some difficulties with scheduling. The whole phone interview process was smooth and it led to a one on one interview on site with the hiring manager that was also concise, informative and organized.", "Interview Questions": "Have you ever had people directly report to you?"}, {"date": "25 Sept 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southcoast Health System", "Interview Descriptions": "Professional environment \r\nInformative interviewer \r\nDid not waste your time\r\nTook the time to answer all of my questions\r\nWe’re up front and honest from the start regarding expectations\r\nStraight forward in person interview following a phone conversation", "Interview Questions": "Mainly based upon my resume "}, {"date": "17 Jun 2021", "title": "Financial Resource Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southcoast Health System (Fall River, MA) in Jun 2021", "Interview Descriptions": "It flowed and I got to ask questions and got them answered. I was provided with all the information I needed. The manager made me feel comfortable and welcome. The interview was paced and now rushed", "Interview Questions": "How can I be an asset to the company "}, {"date": "28 Mar 2019", "title": "Therepeutic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southcoast Health System", "Interview Descriptions": "This process was pretty straight forward and typical for this type of position. Much of it was figuring out your competencies when dealing with patients in a professional manner. The rest was conversational and enjoyable.", "Interview Questions": "How did you find this job?"}], [{"date": "8 Jan 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southcoast Health System (Dartmouth, MA) in Jan 2019", "Interview Descriptions": "Didn't seem to really know me. Doesn't read through my resume. Didn't ask that many questions. Seems to hire anyone. We nice, have quick tour. Now eager to fill position Thabk know about candidate", "Interview Questions": "Do you like psych "}, {"date": "19 Dec 2018", "title": "ERP Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Southcoast Health System (Fairhaven, MA)", "Interview Descriptions": "The interview process was very streamline and they kept me very informed along the way. There was quick turnaround time from the time I interviewed to receiving an offer. It was good experience.", "Interview Questions": "Why am I interested at working at Southcoast?"}, {"date": "3 May 2019", "title": "Clinical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southcoast Health System (Fairhaven, MA) in Aug 2018", "Interview Descriptions": "Meet with recruiter briefly, then meet with manager and team leads. Once manager and team leads agreed the recruiter reached out again and extended an offer with a salary.", "Interview Questions": "Relevant experience, how to deal with high stress situations, how you deal with changing your workflow for the day to address something critical. "}, {"date": "31 Aug 2018", "title": "Housekeeper Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Southcoast Health System (Dartmouth, MA) in Aug 2018", "Interview Descriptions": "I explained it already on a previous questionnaire.   I already answered all of your questions.  And, by the way, your questionnaires are very lengthy and redundant. Why do you ask the same questions over and over?  It is as if you want me to exit out of the interview.", "Interview Questions": "N/A"}, {"date": "29 Jan 2018", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southcoast Health System", "Interview Descriptions": "I had a phone interview first and was brought in for a F2F interview, the interview took over 2 hours for F2F. I didn't hear back until after 2 weeks later that the position was filled", "Interview Questions": "N/A"}, {"date": "4 Oct 2016", "title": "Nursing Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southcoast Health System (New Bedford, MA) in Sept 2016", "Interview Descriptions": "Process went very well, I met with Human Resources, who provided paperwork to inform me about south coast,  she asked me questions concerning how I would handle different situations and how I felt about certain scenarios. The process was what I expected it to be.", "Interview Questions": "How I would handle prioritizing a multitask situation"}, {"date": "15 Jul 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Southcoast Health System (Fall River, MA) in Jul 2016", "Interview Descriptions": "I was asked a series of question of which to answer, as well as reviewing my certifications. The interview ended with my meeting the nurse manager for the unit to which I applied, as well as taking a tour of the unit.", "Interview Questions": "One question I was asked was to give an example of a time I had conflict at work, and how I handled it."}, {"date": "13 Jun 2016", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Southcoast Health System", "Interview Descriptions": "I applied online and heard back the next day about setting up an interview. The interview was great, a lot of good information about working for the company, friendly staff, more questions and conversation than I've ever had on an interview.  Then there was a 90 day wait and multiple ignored phone calls and emails before I finally heard back that I didn't get the job.  Poor follow through.  A friend of mine had the exact same experience.", "Interview Questions": "\"Tell me about yourself\" and multiple questions about conflict resolution."}, {"date": "28 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Southcoast Health System (Wareham, MA) in Jun 2016", "Interview Descriptions": "I received a call from Human Resources, stating I was selected to interview for one of the positions I had applied for which was, ER Registered Nurse. I was asked to come in on a date suitable to both parties. The interview process was formal, prompt and extensive. I initially was interviewed by Human Resources, and at a later date was interviewed by ER Director. Interview itself had some basic questions, but also had questions that were much more in-depth. The interview with the ER Director was much more extensive and it included a tour around the ER Department.", "Interview Questions": "What was one of my strengths."}, {"date": "29 Apr 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Southcoast Health System (Fall River, MA) in Mar 2016", "Interview Descriptions": "Great experience!  Had the opportunity to meet with several members of the organization.  All staff members were extremely professional & passionate.  Organization is highly driven by mission & values.", "Interview Questions": "Inquiries surrounding background, experience, clinical skills, long-term goals, etc.."}], [{"date": "10 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Southcoast Health System (Fall River, MA)", "Interview Descriptions": "Online application, call from HR stating nursing manager is interested and sets up interview.  Interview with HR-standard nursing questions. Next interview with nurse manager-goes over position, asks nursing questiosn, skills questions, strengths.  Reference checks. Job offer pending background screening and physical.  Over all very smooth, HR was very kind, nurse manager was very knowledgable about hospital as a whole, the unit etc.  Toured unit, met some staff.  Great experience!", "Interview Questions": "What is your greatest strenth as a nurse?\r\nWhat can you bring to Southcoast?"}, {"date": "22 Apr 2015", "title": "Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southcoast Health System (Fall River, MA) in Mar 2015", "Interview Descriptions": "I was contacted by HR to set up an interview. Met with HR person and hiring manager. Interview went very well. I was told they were making a decision within a few business days. \r\n\r\nI followed up with a thank you email. Called HR rep a few days after their decision deadline had passed for an update. HR rep said she would check and call me back. Two days later, I still hadn't heard back. I followed up with another phone call and an email. Calls / email not returned. \r\n\r\nI'm surprised and disappointed. It's very unprofessional not to return the call of a candidate that has been in for an interview.", "Interview Questions": "Tell me about yourself?"}, {"date": "12 Oct 2015", "title": "MIS Manager Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Southcoast Health System (Fairhaven, MA) in Feb 2014", "Interview Descriptions": "I was interviewed by 2 people on my first interview and 5 individual interviews on my 2nd visit. It took about 2 months for them to respond with my 2nd interview date. It took about 2 or 3 months of inquiring that I didnt get the job.", "Interview Questions": "General questions were asked during the interview. No tech questions. A few scenarios were given and I was asked how I would handle them. "}, {"date": "25 Jan 2014", "title": "Clinical Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Southcoast Health System (New Bedford, MA)", "Interview Descriptions": "on line application, contact by junior HR rep, inept screening by HR rep with no understanding of ob terminology or duties, initial interview with sr social worker / peer, second interview by hiring manager and several staff social workers.", "Interview Questions": "Tell us  in detail about the patients you see in your private practice. "}, {"date": "20 Oct 2016", "title": "Staff Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southcoast Health System (New Bedford, MA) in Nov 2012", "Interview Descriptions": "Applied on line. Had a phone screening with HR then met with HR again and she brought me to the Pharmacy Manager where we spoke for 45mins.  Went over how I qualified for the job what aspects of my other job would I use here.  Went over the basics of the job and met the staff.", "Interview Questions": "Basic questions of if you qualify for the job or not.  See if you fit into the culture.  From manager but HR did more Behavioral Questions.  "}, {"date": "17 Aug 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southcoast Health System (Fall River, MA) in May 2012", "Interview Descriptions": "Easy interview, just need to be a certified MT and you are hired, especially for 3 rd shift. Just met with Human resources the lab specialty area, and lab manager. If you are personable you will be hired.", "Interview Questions": "why did you choose this profession?"}]]