[[{"date": "22 May 2023", "title": "Junior Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SBP (Bucharest, Bucuresti)", "Interview Descriptions": "Regarding the technical interview, you go at their place to 3 different coding tests: 1. Show how better you are at OOP, you are free to do anything just keep in mind that you need to convince them that you know OOP better than the other candidates. (you have 1h 30min) 2. Debbugging problem . Fairly easy debuuging problem. You will need to go through some documentation to get it but it's okay. (you have 30min) 3. Adding features. You have 4 problems, starting from the code you just debugged, you need to solve 4 more exercises which pretty much mean to add 4 new features. This is the most challengin problem and I dont think you got enough time to solve them all (2h 30 min) Overall, a negative experience. I went there at 9am and I left at 5pm. It was like a full working ( and probably that's what they probably want) which was very exhausting and unnecessary if they wanted to determine what candidate is good for them. Also, after spending ~8 hours and solving all of their problems besides the lase exercise on the last problem, I got refused without any feedback. Just imagine having a candidate spending 8 hours at your HQs and doing almost everything you tell them just to refuse them and not even tell him what he did wrong. Bad experience, I would advise you not to go there.", "Interview Questions": "I already specified them ."}, {"date": "14 Dec 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at SBP", "Interview Descriptions": "Seamless interview process and easy communication with recruiter. \nIt felt more like a conversation than an interview. \n\nInterviewer was timely, prompt and respectful. \n\nThe interview was over the phone, which I probably preferred. Meeting over zoom or virtually for the first time can be a bit intimidating if you aren't sure what to expect.", "Interview Questions": "Why are you looking for a change in employment?"}, {"date": "2 Dec 2021", "title": "Net/C# Developer (Software Engineer) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at SBP (Bucharest, Bucuresti) in Oct 2021", "Interview Descriptions": "Interviul incepe cu 10 intrebari de logica pe calculator care pot fii rezolvate in cele 20 de min daca esti obisnuit cu acele intrebari daca nu, o sa fie destul de dificil deoarece nu te ajuta sa stii doar programare in C++", "Interview Questions": "10 intrebari de logica la care ai 20 de minute sa dai un raspuns"}, {"date": "28 Jun 2021", "title": "Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at SBP", "Interview Descriptions": "Phone interview followed by zoom interview. It was a fairly long and slow process. It took at least 3 months from application submission to when the zoom interview took place.", "Interview Questions": "They just ask very generic interview questions, the typical \"tell me about a time when\" questions that everyone hates. One odd one that stumped me was \"tell me a time when your curiosity lead you to see something no one else saw at work.\""}, {"date": "24 Jun 2019", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SBP (New York, NY) in Mar 2019", "Interview Descriptions": "I first applied through their website. Received a email from HR regarding setting up a phone interview. After the phone interview, an in person interview was scheduled within 4 weeks.", "Interview Questions": "Why are you looking to switch careers?"}, {"date": "5 Nov 2019", "title": "Client Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SBP (Houston, TX) in Oct 2018", "Interview Descriptions": "Relaxed process. I did two phone interviews. Both were great! I felt comfortable doing the interview and I did not feel intimidated at any point. The interview felt like a conversation.", "Interview Questions": "Why do you think you are an ideal candidate for this position?"}, {"date": "7 Sept 2018", "title": "Disaster Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SBP (Houston, TX) in Sept 2018", "Interview Descriptions": "I applied on-lined and within 5 days, the Human Resources specialist called and emailed me to schedule a phone screen. I was given a calendar to self schedule. On the appointed day and time, I received a call. We spent just at 30 minutes exploring the opportunity. Very nice interview.", "Interview Questions": "Tell me about yourself"}, {"date": "30 Mar 2022", "title": "Site Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SBP in Jun 2018", "Interview Descriptions": "Initial phone call discuss what the job is about. You should bring questions for this call! They set up. A Skype interview and ask about leadership experiences and various basic behavioral interview questions.", "Interview Questions": "Tell me about a time when you had to work with a difficult person. "}, {"date": "25 May 2018", "title": "Client Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SBP (Hagerstown, MD) in May 2018", "Interview Descriptions": "Standard interview.  Told me about the organization, their work and position and questions about my professional experience.  The questions were mostly about how I handled different situations in the past (working in teams, taking leadership, facing adversity, taking criticism, etc.)", "Interview Questions": "Describe a time where you were faced with a difficult problem while working on a team and how did you approached it. "}, {"date": "22 Feb 2019", "title": "Client Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at SBP (San Juan, PR) in Jan 2018", "Interview Descriptions": "SUPER easy!!!! They ask you few questions about the company, but basically anyone is qualify to enter, not  a hard one at all. the hiring process takes like 3-4 weeks .", "Interview Questions": "What do you know about us, Why you want to work for us, Tells Us About You, "}], [{"date": "9 Dec 2017", "title": "Site Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SBP in Nov 2017", "Interview Descriptions": "Straightforward. Standard interview questions. First interview is about 40 minutes. A week later you speak with a second interviewer in the position you specifically applied for. Seems like they are looking for mostly college age students, but I may be wrong.", "Interview Questions": "How do you deal with adversity?"}, {"date": "25 Apr 2019", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SBP (Sea Bright, NJ) in Apr 2016", "Interview Descriptions": "There were two interviews held, the first via phone and the second in person. The first is more of a vetting process, and the second is more in depth questions like \"have you ever received criticism before?\" etc.", "Interview Questions": "When in your life have you received criticism?\r\nHave you ever served in an underserved community before?"}, {"date": "20 Jun 2017", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SBP (New Orleans, LA) in Apr 2015", "Interview Descriptions": "There was the initial application process, which included sending in your resume and cover letter via email or snail mail. On top of that, there were two interviews--one with the general AmeriCorps Manager and another with the department supervisor. They were short and sweet, but included a good bit of detail about the position and expectations.", "Interview Questions": "Why do you want to be part of this organization?"}, {"date": "28 Oct 2016", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at SBP in Jul 2012", "Interview Descriptions": "I had two interviews over the phone...1 with HR and 1 with a potential manager. These questions were both specific to the job and broader to get a sense of who I am. They were fairly informal and gave me an opportunity to ask any questions I may have.", "Interview Questions": "Name a time when you had to make a difficult decision and how you went about doing that?"}]]