[[{"date": "15 May 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Barry University (Miami, FL)", "Interview Descriptions": "Actually enjoyable. Very low stress and comforting environment. Of course this is dependent on the program but the school as a whole is a great place to attend. Nothing negative I can say.", "Interview Questions": "What would you describe as your why?"}, {"date": "27 Apr 2023", "title": "Assistant Professor of Law Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Barry University (Orlando, FL)", "Interview Descriptions": "Great interview experience. The faculty were all nice and collegial. The faculty are very tight knit and you can tell that they diligently work together. The faculty worked with me to reschedule the interview. The flight, hotel, and transportation were all taken care of which made the interview experience move more smoothly. All faculty were open to genuinely answering questions.", "Interview Questions": "Q: Why choose Barry Law?"}, {"date": "6 Oct 2022", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Barry University", "Interview Descriptions": "In person interview with about 20 typical interview questions with the last being how they have had multiple rounds of interviews due to the salary but the workload expectations are high including working on weekends.", "Interview Questions": "How do you handle stress in the workplace and what what do you do to keep you on task"}, {"date": "13 Oct 2022", "title": "Operations Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Barry University in Sept 2022", "Interview Descriptions": "Panel interview, great interactions with informative feedback. Everyone was very engaged and pleasant during \ninterview. It was a pleasure to meet the hiring Director,  she is a good representation of the Barry culture.  Unfortunately I had to decline offer due to low pay.", "Interview Questions": "What is your leadership style?"}, {"date": "12 Jun 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Barry University (Miami, FL) in May 2022", "Interview Descriptions": "I'm in the process of being interviewed. I completed the background check which took about 6 weeks online. I was then offered to pick which classes I would be interested in teaching. I have not been hired yet and I'm not quite sure of the next steps.", "Interview Questions": "What classes would I be interested in teaching "}, {"date": "15 Nov 2022", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Barry University in Jan 2022", "Interview Descriptions": "you walk in and they ask you simple questions ETC: simple questions: can you take apart a computer? can you install antivirus? What makes you qualified for this role? Describe your troubleshooting process. Which processors would you recommend for a company doing data-intensive work?", "Interview Questions": "N/A"}, {"date": "16 Jun 2022", "title": "Classroom Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Barry University in Oct 2020", "Interview Descriptions": "Simple phone call with general questions regarding traits that made me fit for the job and others listed in the job application. I given a date when I could begin training and started soon after.", "Interview Questions": "What makes you fit for this job?"}, {"date": "22 May 2021", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Barry University (Miami, FL) in Mar 2019", "Interview Descriptions": "It was quite elaborate but comforting. They hit you one curveball question that will knock you off guard. Like \"how would you fit a tiger in a freezer?\" Be prepared for those type of questions and you will be fine.", "Interview Questions": "Tell us about yourself?\r\nWhy do you want to be a nurse?\r\nWhy Barry?"}, {"date": "30 Jul 2019", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Barry University in Apr 2018", "Interview Descriptions": "Met with three supervisors in the campus recreation and wellness department. Overall, it was an easy interview. Asked questions about Experience in childcare,  how I would handle Various situations, about my personality, and asked me to explain stories from previous jobs.", "Interview Questions": "Experience in childcare"}, {"date": "31 Aug 2017", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Barry University (Miami, FL) in Jul 2017", "Interview Descriptions": "It was pretty easy. Was asked about my experience with children & asked me situation-questions. Even though it's a relaxed job, dress professionally. I noticed one girl went in the interview with gym clothes on & she wasn't hired (noticed when it was time to work).", "Interview Questions": "If a kid were playing alone, how would you approach the situation?"}], [{"date": "29 Jul 2017", "title": "Camp Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Barry University (Miami, FL) in May 2017", "Interview Descriptions": "Professional meeting with all members of the hiring staff present. Thorough questions and conversation concerning the position and experience of candidate. Accurate explanation of duties the position required. Good immediate follow up with references. Positive experience.", "Interview Questions": "What is your strength as an instructor and what is your weakness"}, {"date": "4 Mar 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Barry University (Miami, FL) in Feb 2017", "Interview Descriptions": "Individual interview , in the officed asked about back experiences , how would you see yourself in 5 years and weaknesses and strengths you have , one to one interview process didn’t have any bad energy and manager who interview really nice taking more while interview was being done", "Interview Questions": "What would be a situation that would not know how to handdle , and what would you do ? "}, {"date": "5 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Barry University in Sept 2015", "Interview Descriptions": "I applied online, and received a phone call a week later to schedule an interview for 3 days later. I attended the interview (panel interview with three people) and i thought it didn't go so well but almost a month later i received a call asking me to contact HR to schedule a skill test (need at least 70% to pass) I took the test the next day and then the following day i received a call from the department offering me the position.", "Interview Questions": "Why should we pick you?"}, {"date": "7 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Barry University (Miami Shores, FL)", "Interview Descriptions": "Honest, straightforward and positive. As a former Barry student, it was easier to get an interview for the position. The questions were fair and the interviewers were friendly and positive. It was an even exchange of listening, learning and speaking. They provided great feedback regarding my skillsets and asked me some scenario questions as to how I would respond to certain situations.", "Interview Questions": "Tell us how your background aligns with the skills and knowledge necessary for this position"}, {"date": "16 Jul 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Barry University (Miami, FL) in Jul 2015", "Interview Descriptions": "The interview was very informal, but informative. The way the position overview seems as if it for a coordinator that needs to do clerical work.  It seems as if I was selected because I received my bachelor's degree for Barry University.", "Interview Questions": "What are your weakness?"}, {"date": "3 Jun 2015", "title": "Flight Attendant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Barry University in May 2015", "Interview Descriptions": "Submitted resume and received an email invitation for a video interview. They give you a practice question to start and then you will proceed to recording the actual 3-4 questions. You are also allowed to recorded/retake each question over if you make a mistake or you are not happy with the way you answered the question.", "Interview Questions": "Tell us about a time when you had an emergency situation, how did you handle it.\r\nWhat do you know about Alllegiant Airlines?\r\nWhat experience do you have that makes you qualified for this job?"}, {"date": "30 May 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Barry University (Ocala, FL) in Jan 2015", "Interview Descriptions": "It was very good. I had 3 people to interview me and, they were wonderful.  They were very personable and friendly.  They made me feel comfortable during  the interview.  They explained the job and hired me on the spot.", "Interview Questions": "What qualifications did I have that  made me the person for this job.  If hired how would I engage my students in their learning  and training as future exceptional education teachers in any school setting private, public or home school setting. "}, {"date": "8 Apr 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Barry University", "Interview Descriptions": "The hiring process took quite a bit of time but wasn't too difficult. You meet with a few people from different departments.", "Interview Questions": "N/A"}, {"date": "26 Jan 2014", "title": "Ace Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Barry University (Miami Shores, FL)", "Interview Descriptions": "Search committees members need instructions from human resources to insure that the hiring process is fair.  Perhaps they should get advice related to equal opportunity and learn about how resumes are reviewed and considered.  \r\n\r\nI would have liked to have learned that the same questions were asked to every candidate.", "Interview Questions": "I answered questions related to teaching philosophy, approach to students and career goals."}, {"date": "1 Feb 2013", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Barry University (Miami, FL)", "Interview Descriptions": "Hiring and interview are OK, if you get a call back.  First interview is over the phone with a search committee.  If selected, the candidate then is invited for a personal interview with the same people on the search committee. Then the number of candidates is narrowed down to three.  Once the decision is made the candidate will receive an offer.", "Interview Questions": "All questions were straight forward."}], [{"date": "1 Dec 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Barry University (Tampa, FL) in Jan 2013", "Interview Descriptions": "One interview, a pleasant informative session. All pertinent questions answered promptly", "Interview Questions": "N/A"}, {"date": "12 Nov 2015", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Barry University (Miami, FL) in Jan 2012", "Interview Descriptions": "I submitted an application online, and like most academic employers, Barry was hiring a year out from the start date. After an email indicating their interest, I had two phone interviews, as well as a face to face meeting where the department head discussed my qualifications, education, and teaching philosophy.", "Interview Questions": "How would you best meet the needs of adult and non-traditional learners?"}, {"date": "12 Nov 2015", "title": "ADM Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at Barry University (Miami Shores, FL) in Dec 2011", "Interview Descriptions": "The interview was amicable and professional. I was interviewed by 2 senior faculty members and 1 administrator. We met over lunch and they shared the departments, mission and vision and where they were planning to take the discipline I was being hired to teach.", "Interview Questions": "Teaching philosophy"}, {"date": "20 Jul 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Barry University (Miami Shores, FL) in Nov 2009", "Interview Descriptions": "8 hour interview process.  Ranged from very easy basic questions to one person who was asking questions way beyond the position I applied for.  Don't get why some people are \"appointed\" and others go through grueling interview process", "Interview Questions": "Describe how you would overhaul the division, in detail"}, {"date": "29 Jun 2011", "title": "Adjunct Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Barry University (Miami, FL) in Aug 2009", "Interview Descriptions": "Very informal one on one interview.  Filled out all forms at same time and given schedule", "Interview Questions": "N/A"}, {"date": "2 Aug 2012", "title": "IT - Development Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Barry University (Miami Shores, FL) in Apr 2008", "Interview Descriptions": "Not very professional. The interview was rescheduled multiple times. There was a lack of communication after the interview was over, did not hear anything for almost a month. No questions on whether I could perform the job, it was mostly a \"personality\" based interview.\r\n\r\nWe had a conversation about what my personal goals are. That was pretty much it.", "Interview Questions": "No difficult questions. \r\n\r\nWhere do you see yourself professionally 5 years from now?"}]]