[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "The change in culture and leadership approach has made this a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jul 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Colleagues, learning & development, career development opportunities, recent Investors in People accreditation", "cons": "It's a small organisation so promotion opportunities are limited.  However, there are excellent learning & development opportunities available to all."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Some nice people but weak leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Mar 2021", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Some of the employees are great to work with and are clearly passionate about their jobs. \r\nWork life balance is good. \r\nThe office location is good and it is a nice building. \r\nSalaries are in general pretty good and average for the industry. \r\nThere are some good employee benefits and support for staff available.", "cons": "Leadership is weak and directionless. Too much power, influence and control is given over to certain teams. \r\nWork tasks are reactionary and pushed onto staff without a strategic plan, and there is no follow-up or review once tasks are completed, it just moves onto the next project. \r\nThey are in danger of alienating some membership with the direction they are travelling in when thinking about outputs. \r\nDespite well written policies and employee handbooks, some decision making is opaque and unclear which is problematic in a small organisation.\r\nWhile small organisations can be great places to work, a downside is the lack of development opportunity in the organisation."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "An positive and enjoyable experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Mar 2021", "job_title": "Head Of Operations in London, England", "duration": "N/A", "pros": "BSR is a progressing not for profit organisation supporting the Rheumatology community in the UK and overseas.\r\nThe SMT is proactive in developing the organisation, including the staff, and has made a number of improvements to working and other conditions over the past few years.\r\nAlthough being a SME has its limitations, it allows staff to be well connected with each other and to work collaboratively.\r\nThe Society adapted really well to working from home because of the pandemic, and was ahead of the curve in terms of adapting its building and policies to accommodate the new 'normal'.\r\nBSR is a friendly organisation to work for and I enjoyed my time there, working with some really good colleagues. I always felt valued and supported and I think I made a bit of a difference and a contribution by the time I left.", "cons": "As a SME, opportunities to progress are limited.\r\nI think some areas of the organisation need a more development or need to be re-thought.\r\nCultural change takes time but I think BSR is on the right track."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A good year despite the pandemic", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Mar 2021", "job_title": "Head Of Operations in London, England", "duration": "N/A", "pros": "BSR is a progressing not for profit employer which has undergone significant change over the past few year, making lots of improvements.\r\nAs an SME, employees have easy access to the SMT and each other, and work together in a collegiate and increasingly collaborative way.\r\nBSR is a friendly organisation to work for, provides good benefits for its staff and has embraced hybrid working .\r\nThe SMT provide various opportunities for the staff to contribute to strategic planning and to shaping the operating culture of the Society.", "cons": "As an SME, opportunities to progress are few, especially with a very low staff turnover.\r\nSome areas of delivery need to be re-thought."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Nice office, bad culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Feb 2021", "job_title": "Event Executive in London, England", "duration": "N/A", "pros": "Nice office environment, good location next to train station and tubes.", "cons": "Leaders are openly unkind about other staff members in the office. The office culture is quite negative and cliquey. There's no real help or training on the job but you are expected to know how to do things the way the managers want tasks to be done."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Big transformation and great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Sept 2018", "job_title": "Editorial Officer in London, England", "duration": "N/A", "pros": "Coworkers are great and it is a very social organisation. Changes in management and CEO have changed how things work and staff are now consulted and have more input in what the organisation does. Communication from senior management is now more open.\r\nGreat opportunities for learning and development. People are always open for collaboration across departments.", "cons": "As it is a small organisation there are limits when it comes to career progression with regards to promotions. \r\nDespite high improvement in communications, this can still be improved. There are projects underway for this and taking initiative to seek information is also needed. \r\nAs mentioned in another review, as this is not for profit salaries are less competitive."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Too small for progression", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Sept 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Nice people, decent location", "cons": "Flat structure, limited scope for progression. Ok for entry level posts."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Stay Away.  Horrible Management", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Aug 2019", "job_title": "Event Manager in London, England", "duration": "N/A", "pros": "A short recruitment process", "cons": "Terrible management and clique culture: I found the management very aggressive and unprofessional. Long hours and no compensation for overtime. Never had such a horrible 3 months."}], []]