[[{"date": "2 May 2023", "title": "Information Technology Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sea Mar Community Health Centers", "Interview Descriptions": "Interviewed by the manager and employee. It was awkward at times as if they weren’t ready for me or too busy for the interview. It felt rushed. It could’ve been better should they have been prepared for me.", "Interview Questions": "Tell me about yourself How do you face issues?"}, {"date": "3 May 2023", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (South Park, WA) in May 2023", "Interview Descriptions": "Interviewed in a group with 3 recruiters. All gave the cold shoulder. One of them was looking to her side at her second screen while talking to me. One of the recruiters laughed and gave a condescending huff when I told him my experience in a software. The other did not even ask any questions or introduced themselves. They said that they have alot of work to give out and that you have to be ready to work long hours. Does not seem like a company that cares about employees.", "Interview Questions": "What's your experience in excel?"}, {"date": "6 Jun 2022", "title": "Community Health Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sea Mar Community Health Centers", "Interview Descriptions": "Initial interview with regional recruiter. Next level with specific facility staff. Very helpful in discussing expectations and salary at first interview. Also good that recruiter provides intake for multiple facilities rather than repeating the process if you apply to multiple locations.", "Interview Questions": "How the role would fit into my career goals. "}, {"date": "24 Jun 2023", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers in Mar 2022", "Interview Descriptions": "It was neutral, siding towards negative. I applied for a coordinator position, the person hiring called me the next day, asking for a one hour in-person interview. I went for video call, they said I would get a link, they never sent it. The day of the meeting came, and they were 30 minutes late in starting it because they hadn't sent the video call link for microsoft teams, and their system required me to have a log-in set up - but the website on my browser redirected me to a new page and said I had to log-in through the access portal of an entirely different organization (not SeaMar). We ultimately erred for a phone call. They didn't take accountability for their mishandling of the meeting setup. No interview with SeaMar or any organization I have spoken with has allowed such a delay nor error to occur, and there was no professionalism here. They also didn't introduce the other admin staff present, got my name wrong, and asked me very few questions with no followup questions nor any information about next steps from the other staff. It was 10 minutes of talking, and then the interview was over. I got rejected the next day over email. SeaMar is an excellent organization. Based on talks with staff and Google reviews, you may want to reconsider interviewing at the Spanaway site.", "Interview Questions": "Walk me through your resume What was your last job like Is the salary acceptable How would your colleagues describe you"}, {"date": "5 May 2022", "title": "Healthcare Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sea Mar Community Health Centers (Lynnwood, WA) in Dec 2021", "Interview Descriptions": "A simple phone screening describing my experience and then an in-person interview with the manager and one of the nurses who took me on a tour of the facility and a run through of the tasks that I might encounter.", "Interview Questions": "What kind of experience are you hoping to get out of this role?"}, {"date": "3 Nov 2021", "title": "Nutrition Assistant Certifier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Sept 2021", "Interview Descriptions": "It was over a Zoom call, it took about 20 minutes, they asked about 15 questions \r\nThere were two interviewers who took turn asking job related questions while taking notes.", "Interview Questions": "N/A"}, {"date": "7 Nov 2021", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Sept 2021", "Interview Descriptions": "It was great, coherent questions and very welcoming and open professionals. I've felt confident and encouraged to open up. Although you'll need a specific profile and and competences to succeed.", "Interview Questions": "What do you know about the mission statement?"}, {"date": "20 Aug 2021", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Aug 2021", "Interview Descriptions": "Simple communication for initial phone interview, followed by formal Zoom interview the following week. If selected, you then go to a site visit which may or may not result in an offer of employment.", "Interview Questions": "What do you know about Sea Mar as an organization?"}, {"date": "7 Jul 2021", "title": "RDN, LD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sea Mar Community Health Centers", "Interview Descriptions": "It was a good interview with very nice people. There were two people interviewing that asked reasonable questions and were very responsive to my questions. They also answered the many questions I had. Overall, a great experience.", "Interview Questions": "What are the most important qualities of a dietitian?"}, {"date": "26 Jul 2021", "title": "Community Resource Navigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (Tacoma, WA) in Jul 2021", "Interview Descriptions": "Started out with basic introductions about the interviewer and a general over view about the company and the job description. After that was asked about 5-7 questions and it was over.", "Interview Questions": "Why should we hire you?"}], [{"date": "14 Aug 2020", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Jul 2020", "Interview Descriptions": "An hour of questions and a role play at the end. The reason I declined is because I was called by the wrong name, it was not addressed, and then was offered a position when no references were asked for. That’s a big red flag to me as far as High turnover rates and culture go. I would never hire someone without asking for references and that makes me question why they are so eager to hire people so quickly (aka high turnover rates, burnout) which is something they said happens when I asked why they were hiring. Seems like a really cool opportunity but again was shocked to hear the position I applied for was filled by an internal hire and that they wanted me to interview for a different position and that this was relayed to me in the beginning of the interview and not told to me before we started. Just seemed unorganized and that staff are overwhelmed.", "Interview Questions": "To me about a challenging time in your career where you had to use boundaries."}, {"date": "31 Dec 2019", "title": "Dentist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers", "Interview Descriptions": "Very positive conversation about the organization's mission and vision. Discussed benefits and job expectations.  This is a well established organization with years and years behind their method. I believe that this would be a good place to work.", "Interview Questions": "Years in practice"}, {"date": "21 Dec 2019", "title": "PA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Sea Mar Community Health Centers", "Interview Descriptions": "Very warm and efficient interview team.  They keep to a schedule so come prepared with any questions.  They are a big organization and are accomplishing a lot using the resources they have.", "Interview Questions": "Any questions?"}, {"date": "18 Apr 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sea Mar Community Health Centers (New York, NY) in Sept 2019", "Interview Descriptions": "Structured interview with a series of questions to assess for proficiency across areas of clinical judgement, comfort with technology, ability to manage ethical dilemmas, and documentation skills that are necessary for the job.", "Interview Questions": "How will you navigate a situation where you notice a coworker engaging in unethical behaviour?"}, {"date": "27 Apr 2020", "title": "Dental Assistant III Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sea Mar Community Health Centers (Port Angeles, WA) in Aug 2019", "Interview Descriptions": "Usually included clinic's and regional manager. Mostly going over what experience you have in order to determine what level assistant you would apply to. Several page multiple questions skill test administered for each level (DA 1,2,and 3)  If you are an experienced DA it would be level 3; must take all 3 tests if you are level 3. Very straightforward basic knowledge of dentistry test.", "Interview Questions": "What procedures do I have a lot of experience with"}, {"date": "1 May 2019", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sea Mar Community Health Centers (Tacoma, WA) in Mar 2019", "Interview Descriptions": "Interview was with 2 employees who were nice.  Interview questions were a bit tricky at times but mostly standard.   Position is entirely unionized, which means they can't negotiate with you on pay.  Overall process was good bc my interviewers were positive and nice", "Interview Questions": "Why do you want to work here"}, {"date": "25 Feb 2019", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Jan 2019", "Interview Descriptions": "I had an initial interview with HR. I then proceeded with a phone interview with the hiring manager. A few weeks later I interviewed with the hiring manager and one other technical staff member on-site for 2 hours. \r\n\r\nAfter the interview I sent a thank you letter for the interview panel and did not receive any response. A few weeks later I sent an inquiry email to see if I was still being considered for the position and also never received a response.  Probably for the best, as I wouldn't want to work for a company with a complete lack of professional etiquette and respect for others time.", "Interview Questions": "How do you manage change"}, {"date": "6 Oct 2018", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Sea Mar Community Health Centers (Federal Way, WA)", "Interview Descriptions": "I had my initial interview with a guy over the phone he had forgotten about the interview so when he was interviewing me he was driving down the street. A few months later I got a call for an in-person interview where I interviewed with the manager another supervisor into employees. That went pretty well. My final interview was with the CFO and from the beginning of the interview he led the impression that he preferred a man in the position. He kept making comments about needing someone that the team would listen to and just other comments. He also made a comment about how I did not look like my LinkedIn photo.", "Interview Questions": "We need someone who can create processes. Can you do that?"}, {"date": "17 Oct 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Apr 2018", "Interview Descriptions": "Vinay was dishonest about salary. I was paid way less than I agreed to. He is not an honest person.  I was asked questions about my past experience, project management and soft skills.", "Interview Questions": "They asked me about my past experience and people skills. "}, {"date": "25 Jul 2018", "title": "Nurse Practitioner Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Apr 2018", "Interview Descriptions": "The interview started with a 1-hour phone interview followed by a 1-hour in-person interview . In person, there were three nurse practitioners there. They asked me typical interview questions and gave me a case study of a patient with a UTI to try and sort through.They were all very nice!", "Interview Questions": "Describe a time when you had to deal with a challenging patient, how did you handle it? "}], [{"date": "7 Feb 2019", "title": "Integration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Sea Mar Community Health Centers in Mar 2018", "Interview Descriptions": "Consisted of simple behavioral questions, and a couple written questionnaires utilizing the PHQ-9 scale and vignettes.   The questions included crisis management, working within medical settings, substance abuse management, etc", "Interview Questions": "Motivational interviewing"}, {"date": "5 Oct 2017", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Sea Mar Community Health Centers", "Interview Descriptions": "Several interviews during the process. Not complicating  about the process and nothing rove scared of in the process. The length of the process might differ if you are internal candidate or external. Be prepared for wait a bit to finalize hire", "Interview Questions": "None of the questions were difficult. "}, {"date": "4 Aug 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (Lacey, WA) in Aug 2017", "Interview Descriptions": "The questions were very generic. I'm pretty sure the computer just selects them. When I asked him about the questions, the person was a bit confused on what he was asking me.", "Interview Questions": "If a person had communication problems how would you deal with that?"}, {"date": "4 Jul 2017", "title": "Care Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers in Jun 2017", "Interview Descriptions": "The people interviewing me were extremely friendly and the questions they asked were fair. There was a lot of time allowed to answer questions efficiently and in addition I had to fill out a questionnaire at the end of the process. Only hesitation I had was that the position didn't require the applicant to speak Spanish yet the interviewers still asked a question in which I had to answer in Spanish, which I felt was unfair due to the position not requiring the ability to speak the language.", "Interview Questions": "How do you handle priorities in a high crisis situation? "}, {"date": "14 Nov 2016", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sea Mar Community Health Centers", "Interview Descriptions": "I applied for the position on Oct. 25th and got an interview in a week. The program director and a clinical supervisor interviewed me. The interview process was a little bit intense as they just took turns and asked you questions and then wrote down your answers, didn't really give any responses.", "Interview Questions": "Microsoft proficiency; how to deal with stress at work, conflicts with colleagues, etc.; time management; Tell me one time you got a reward or promoted and what made you outstanding."}, {"date": "5 Aug 2016", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sea Mar Community Health Centers (Burien, WA) in Jun 2016", "Interview Descriptions": "The interview process went well - I was interviewed by two people. I was contacted to set up an interview two days after I had turned in my application. I accepted the position, went in to fill out paperwork, and was told it would take about 1.5-2 weeks before I could start work. In the end, I had to hound them to find out what the status was and ended up not having a position.", "Interview Questions": "How do you handle stress?"}, {"date": "23 Oct 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sea Mar Community Health Centers (Lacey, WA) in Jan 2016", "Interview Descriptions": "Interview process was a joke i had to go back over 4 times for paperwork that was \"forgotten\" or to sign documents, my start date kept changing. There is a phone interview and then a one on one interview with the manager, once you are interviewed you are given a skills test that determines your clinical skill level.", "Interview Questions": "How do you handle a difficult patient?"}, {"date": "16 Jan 2017", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Nov 2015", "Interview Descriptions": "After a brief phone screen, I only had one interview, with the Department Head. No one from HR was involved. After the interview was complete, she offered me the job. The paperwork took over a month, and everything had to be completed on paper.", "Interview Questions": "I was asked to explain my understanding of concepts such as \"care coordination\" and \"care plan.\" "}, {"date": "31 May 2017", "title": "Health Educator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Oct 2015", "Interview Descriptions": "Program manager and clinic staff interview as a panel. They talk about approaches to connecting with patients, the ease in which one works with others and the importance of confidentiality. There is a competency test that is given at the time of the on-site interview. Each person asks a different question of which all are written on a paper that each interviewer has.", "Interview Questions": "What do you know about Sea Mar and can you explain to us what our mission is in your own words?"}, {"date": "18 Dec 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Aug 2015", "Interview Descriptions": "I was offered an interview the day I sent in my application. The interview was brief where they asked standard questions. There were three people in the room, and they each took turns asking questions that pertained to the program.", "Interview Questions": "Tell me more about your educational experience."}], [{"date": "14 Apr 2015", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Feb 2015", "Interview Descriptions": "Upon submitting my application (prior to the deadline) I was told that they had already had a few rounds of interviews and had finalists picked. Should have been a red flag at that point that they started a new round of interviews with me and two others (I was told there were three of us they were now interested in). They pursued me and told me how much they appreciated my patience during this long process............. did phone interview, group interview a few weeks later, panel interview a few weeks after that. Was told throughout the process that I would be notified if I was not proceeding to the next round. After a successful final interview (their words) was told that I needed to do a computer skills test. This was scheduled then they notified me not to come in, it was not working and the person who could fix it was not in the office. We left it at an agreement that they would contact me when it was fixed. That was well over two weeks ago. I have emailed to request a status update and asked to be notified if they chose to go in a different direction. Haven't heard a peep. Disappointed they are so unprofessional, thankful I didn't get sucked into whatever is going on there. I should have believed the employee reviews that were posted.", "Interview Questions": "Standard and boring."}, {"date": "18 Nov 2017", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sea Mar Community Health Centers (Everett, WA) in Feb 2015", "Interview Descriptions": "The interview process was disorganized. When the interview finally happened I met with a group that included some upper management employees. I was given a job offer on the spot and was told I would be starting soon. I put in a two week notice at my previous job. It was actually several months later that I started and the communication between management and myself was poor. I had to use some of my savings to pay bills due to the delay.", "Interview Questions": "What would you do if you evaluated a patient and did not agree with the diagnosis by another staff, what would you do?"}, {"date": "9 Feb 2015", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Jan 2015", "Interview Descriptions": "I submitted my resume and cover letter and was called for an in-person interview a few days later. \r\n\r\nI arrived ten minutes early. Two people interviewed me, person A was ten minutes late, person B was fifteen minutes late. Neither of them remembered to print the interview questions, so person B went out and asked a secretary to print them. Person A didn't have a writing implement to take notes, so the secretary had to bring that too. Neither person A or B was flustered by their lack of preparation, this appeared to be standard for their office environment. \r\n\r\nI asked them how this position fit into their strategic goals as an organization, Person A told me they didn't have goals as an organization, but told me their mission statement. \r\n\r\nI asked them what their 5 year plan was as an organization, person B said they didn't know if they had any long term goals. \r\n\r\nOther than the interview question I posted below, everything was fairly standard. What are my biggest stregnths/weaknesses, why should they hire me over other candidates, what do I see as the pros/cons of this job, can I tell them about a time I faced a difficult task at work? \r\n\r\nOne thing to note, after the question \"explain a time I faced a difficult task at work\", Person A read the question \"how do you deal with conflict with your co-workers\" and then she said \"oh, the last question was basically the same, let's skip this one\". I told her that I thought the two questions were different and I would like to answer the question, she gave me a very confused look. She didn't seem to understand how the questions were different. To me, this is an example of further unpreparedness, I don't think she even looked at the questions before coming in to interview me.", "Interview Questions": "Do you mind working mandatory, unpaid hours on the weekends?"}, {"date": "29 Nov 2016", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sea Mar Community Health Centers (Puyallup, WA) in Jun 2014", "Interview Descriptions": "Panel interview - they do not inform you prior. Two interviews do determine if they like you enough to hire you, and also a one page quiz on medical math and terminology.", "Interview Questions": "Why do you want to get into community health care. "}, {"date": "25 May 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Sea Mar Community Health Centers (Tacoma, WA) in Nov 2013", "Interview Descriptions": "I applied online,and received a call within a week. The interview it self was a panel interview with the clinic manager, nurse manager, and medical assistant manager. I was very nervous but I sold it, I know they had a lot of applicants so I studied up on the company and passed with flying colors. I would recommend anyone who wants to work here to just do some research on the values of the company, and you will do good as well.", "Interview Questions": "why would you like to work here?\r\nwhat kind of talent can you bring to the table?\r\nwhat do you know about sea mar?\r\nwhy do you want to work for our company?"}, {"date": "19 Jun 2017", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Sea Mar Community Health Centers (Seattle, WA) in Aug 2013", "Interview Descriptions": "The employee referral process is faster than any other interview process. It was a very informal interview setting, it almost didn't feel like an interview. As an interviewee, I felt overly prepared than the interviewer.", "Interview Questions": "Are you able to use your own personal vehicle to travel to different job sites?"}]]