[[{"date": "5 Dec 2022", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Global Citizen Year (Cape Town) in Nov 2022", "Interview Descriptions": "I applied for this job application via an advertisement on LinkedIn. The application form was long with a few essay questions and a cover letter. The application was lengthy but pleasurable to complete as there were in depth questions that spoke to the values of the company. I received an email prompting me to the next round within 2 weeks and then met with the hiring manager. This was a brief and casual meeting. I instantly felt attracted to the organisations values. I then received an exercise which took about 1hour 30 mins to complete. About a week after submitting the exercise I received an interview with the executive team which included a senior manager. The interview was somewhat a challenge as I received interview questions that I did not receive before. I felt like the questions were not basic questions and the interviewers seemed well prepared - the interviewers were professional, to the point and they were incredibly relatable. I had a really good experience and would gladly apply again. I did not get the position - but I was in the top 5 selected so I will improve for the next time.", "Interview Questions": "1.How would you deal with conflict between two candidate members? 2. Tell us about a time where you had to make a decision based on a calculated risk"}, {"date": "17 Feb 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Global Citizen Year in Jan 2022", "Interview Descriptions": "I was reached out to by a recruiter for a position and was quite amazed at the transparency this company has for a job candidate. I knew up front what the salary range is, was given an in-depth scope of the job, and a clear timeline of what the interview process would look like.  I did an initial screen with the recruiter and then did a second screen with a member of the team I'd potentially be working for. The third step was an exercise that was missing a lot of information and had low-resolution images with analytics that hindered proper project completion in my opinion. I did not advance past the assignment and received a rejection email at 5pm on a Friday through a generic email with no feedback. \r\n\r\nEveryone I interacted with was very kind and kept excellent communication and provided updates throughout the process. Although I did not receive an offer, I do have respect for the people involved in the entire interview process. They were very refreshing with their communication and ultimately left a good taste in my mouth about this organization.", "Interview Questions": "Are you comfortable working with different types of people? "}, {"date": "30 Apr 2021", "title": "Program Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Global Citizen Year in Apr 2021", "Interview Descriptions": "I had a nice phone screening with a member of the People & Operations team. It was only 15 minutes and it was a pleasant experience.  I was invited to do a written exercise a few days later which I completed and submitted. After full 10 days the VP of People & Operations finally emailed to let me know they had moved forward with other candidates, presumably so they could keep candidates waiting in case their top candidate turned down the opportunity.", "Interview Questions": "Tell me about a time you displayed empathy. "}, {"date": "19 Feb 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Citizen Year in Feb 2021", "Interview Descriptions": "After applying, I was contacted within about a week to set up an initial video screening interview about two weeks after that date. The interview was with a new member of the People & Talent team who was very friendly and transparent when I asked questions about the company.", "Interview Questions": "What is something that has brought you joy in quarantine? \n\nTell me about a time when you witnessed inequity, and tell me what you did about it. \n\nWhy is Global Citizen Year a good match for you?"}, {"date": "23 Jul 2021", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Global Citizen Year (San Jose, CA) in Oct 2020", "Interview Descriptions": "There are multiple rounds of interviews, I was only in the first.  The first interview is kind of like a screening process, to learn a little bit about you and your work style.", "Interview Questions": "Tell us about a time (in a job) in which you changed the system of doing things so that it would work more efficiently."}, {"date": "14 Nov 2018", "title": "Fellow Success Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Global Citizen Year (Oakland, CA) in Oct 2018", "Interview Descriptions": "I applied in mid to late August and heard back about a first round interview at the end of September. I had 3 interviews in October and 2 skills tests (one was a 3 hour project to work on at home and one was a live excel project). They are very thorough in their process, much more so than any other job I've ever interviewed for. The people were friendly and ultimately I think they were looking for someone who is more experienced with data analysis, which wasn't clear from the initial job description, but became clear during the process. They seem like a really well organized organization and overall I was really impressed by them. I don't think the job was the right fit for me but I would apply again if there was a role that was a better fit in the future. They seem to be hiring a lot of positions right now- I'm not sure if that's because of growth or because of turnover (or maybe a combination?).", "Interview Questions": "Describe a time you interacted with a difficult parent. \r\nHow do you stay organized?"}, {"date": "8 Apr 2018", "title": "Team Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Citizen Year", "Interview Descriptions": "I applied online and was contacted via email shortly after to schedule an interview.  The interview was via Skype and consisted of a series of questions about my goals, experience and how I would proceed in a couple of potential scenarios.  At the end of the interview, I was given a date by which I should hear back from them.  The hiring manager notified me about the decision five days later. \r\n\r\nAlthough I did not get a job offer, I was pleasantly surprised by how my application was handled. Throughout the entire process, the hiring manager was very kind, respectful and quick to respond.", "Interview Questions": "I don't remember the exact wording but something along the lines of why is this position a good next step in your career."}], [{"date": "24 Jan 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Global Citizen Year in Sept 2017", "Interview Descriptions": "Multiple skype interviews which also included a hour long simulation activity. One of the worst interview processes I have ever experienced. The woman running the interview was a horrible communicator/responder and very rude. Was incredibly unimpressed by the entire process.", "Interview Questions": "How long I was planning on staying at the company?"}, {"date": "7 Jul 2017", "title": "Special Assistant to the Chief Executive Officer/Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Global Citizen Year in Mar 2017", "Interview Descriptions": "Several stage process utilized combining written exercises and interviews. I completed an initial exercise, an interview with a manager, and a timed exercise. All staff were exceptionally polite and curious. Very communicative and prompt in replies.", "Interview Questions": "How do you prioritize tasks?"}, {"date": "26 Jul 2018", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Global Citizen Year (Pune) in Jun 2016", "Interview Descriptions": "The process involved 1 digital interview with the Executive Director at US headquarters, 1 digital interview with my direct superior Country Director, and 1 interview with an on-site staff member. \r\n\r\nEven when responding to an active open job posting, I had to follow up repeatedly to get a response from the team.  In fact I reached out through personal contacts and former employees to request a status update and got my response about 2 months after applying.   When offered the position, they asked me to wait as they could only offer me the position in after half a year.  So overall I waited about 10 for this particular position, although in case of emergency they will try to hire within 2 weeks as they need.  There was also a written assignment to share my local language fluency as well as how I would edit student blogs and respond to certain student crisis scenarios. This assignment was given with 3 days notice. \r\n\r\nThough the interviews went great, in person they decided not to give me the position I'd applied for and I never had a chance at it.  So I felt the interview process had been somewhat superficial, and sufficient effort was not made to give me the orientation and opportunity to do the job I had come for.", "Interview Questions": "What are the core values that drive you? "}, {"date": "3 Jun 2015", "title": "Global Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Global Citizen Year (San Francisco, CA) in Feb 2015", "Interview Descriptions": "2 rounds of interview with Senior Management. The interview process was very respectful and clear. Questions pertained to the position listed and skills in-line with the position. Each interview lasted for about 45 minutes to an hour and was detailed. For the first interview, I was asked questions about my previous work experience and how I was a good fit for the position in question. GCY was looking for candidates with very specific experience and that's the reason I wasn't considered for future rounds. However, I do have positive things to say about the Senior Management and their desire to do the right thing for the organization.", "Interview Questions": "Questions about work style"}]]