[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good for Startup, working on textile pcb,good learning exposure on hardwares and testing of industrial machine", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Apr 2020", "job_title": "Hardware Engineer in Coimbatore", "duration": "N/A", "pros": "Less Time \r\ngood learning Exposure\r\nContacts building\r\nTools handling\r\nFreedom to learn", "cons": "Salary \r\nLocation \r\nMan power\r\nWork place \r\nNo senior"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "While maintaining a great camaraderie with IPCS' staff, the overall experience left me dissatisfied.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jan 2018", "job_title": "Researcher in New Delhi", "duration": "N/A", "pros": "The staff is great; friendly, welcoming, young, and dynamic. For an Indian non-profit, IPCS' work culture is a pleasant surprise. It encourages and accommodates individuals of varying opinions and ideologies. Moreover, there are opportunities to learn, take initiative, and get published with leading newspapers and digital media outlets in addition to, of course, building networks with India's strategic and diplomatic community.", "cons": "Grossly underpaid positions that are inconsistent with living standards in New Delhi make it unsustainable for any candidate from outside the city to consider working here. Giving young people an opportunity to grow 'wings' is indeed noble, but mission statements ought to be congruent with organisational strategies in order to deliver matching results. Lastly, the management's inability to leverage IPCS' brand value is disappointing. Going forward, the company would surely benefit from a more assertive leadership and flexibility in executing ideas."}], [], [], []]