[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Absolutely amazing experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Mar 2023", "job_title": "Volunteer Coordinator in Calgary, AB", "duration": "N/A", "pros": "Who doesn't love animals at work. But other then that, the culture working here is very supportive and encouraging. Having the opportunity to learn even if igs not directly related to your role", "cons": "Can get quite busy and overwhelming but always have help"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Not recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Apr 2023", "job_title": "Animal Care Specialist in Calgary, AB", "duration": "N/A", "pros": "The animals are the only positive thing about this place", "cons": "Poorly run, senior management is out for themselves. A toxic workplace where bullying runs rampant, management cannot be trusted. Worst place I’ve ever worked."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best employer!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "20 Feb 2023", "job_title": "Front End Staff in Calgary, AB", "duration": "N/A", "pros": "The CHS has a really great management team. I feel I can go to any manager with any concerns I have. Staff are appreciated and treated fairly. Of course the animals! I know I am making a difference", "cons": "Can be very sad and stressful. Staff that have no idea what’s going on are the first to make comments and spread lies."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DO NOT WORK HERE", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Mar 2022", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "The one and only pro are the animals we serve.", "cons": "If you are already here on this site, I implore you to read through ALL of the reviews that have been left. You will quickly discover a disturbing trend of employee mistreatment, irresponsible mismanagement and the ongoing suffering of mental health.\r\n\r\nIt's been going on for years, and nothing has changed. The highest levels of CHS don't change or turn over, so KNOW that means everything remains precisely the same as the reviews from years and years back are telling you. This organization doesn't have leaders at its helm - it has rulers. The staff in every department except for one turn over regularly. This is not a joke or an exaggeration. \r\n\r\nOnce the honeymoon of getting a job at CHS wears off, you will quickly realize you are painfully underpaid for what you do and that there is zero appreciation of the skills you bring to your role and the hard work you are continually contributing. You are simply filling a spot in the chain. The ED, HR and a lot of the management team will use you and abuse you until you leave - either by your own realization of the conditions there, or by them letting you go for a contrived reason.\r\n\r\nPeople being fired or quitting is a weekly occurrence. Every time I log in for my shift, I am stunned to see yet another HR email announcing another departure. \r\n\r\nThey wonder why they can't keep people. It's so obvious to absolutely everyone BUT senior management. And with a board that unfortunately does not realize it has a job to manage the top employees, sad to say, you do not want to work here if you have another option."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "As bad as an employer gets", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Feb 2022", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "Working for the welfare of animals.", "cons": "The management team are horrific at the Calgary Humane Society. You wont encounter a more dysfunctional Human Resources department, one that fires EVERY employee that shows signs of being stressed out from work or burned out. If they give constructive criticism of a process in place at CHS, GONE. Disagree with the Executive Director on anything, GONE. Say your mental health is suffering, GONE. \r\n\r\nTake a look at the CHS hiring page. Roles is EVERY department are available. The turnover is endless and the organization is nothing more than a sweatshop of employees overworked  until they are no longer useful and are then discarded."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Overall cares about the animals and offers great learning opportunities", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Feb 2021", "job_title": "Adoptions Supervisor in Calgary, AB", "duration": "N/A", "pros": "Overall, there is a ton of room for growth in the company if you put in the effort and work hard. Often times if you cared about your job and worked hard, this was acknowledged by your supervisors. Professional development opportunities were usually quite plentiful and you learn a LOT on the job from other knowledgable staff and even passionate members of the public. This included anything from animal handling, to conflict training, to financial planning, meditation, etc. The work at CHS gives you a great insight on how to communicate with people and gives you great life skills. Also, the knowledge and expertise that the animal health and behaviour teams brought to the shelter was incredible. \r\n\r\nMental health was taken seriously and spoken about quite honestly and openly which was refreshing. Team leads were given wellness days in addition to their vacation days to help support work/life balance. Other staff were given overtime hours to use as days off. \r\n\r\nManagement put a lot of effort into developing a more positive and open culture (some more than others). This was something they knew was important overall and were making positive steps in that direction. \r\n\r\nDifficult decisions like euthanasia were carried out respectfully. Often times there were difficult discussions and hard days on staff, however communication was honest and open for questions or concerns. For the most part, supervisors, team leads, and the HR manager were accessible to talk to if you needed to. \r\n\r\nStaff discounts were available to all staff on adoption fees, store purchases, training classes, etc. \r\n\r\nLastly, but certainly not the least, the animals. A HUGE perk to the job was access to really any type of animal you could think of. Cats, dogs, birds, snakes, rabbits, chinchillas, degus, mice, guinea pigs, etc. you name it. When you had a break (or sometimes just needed a break), you were able to go and hang out with the animals and form lovely bonds with them. My best memories were hands down all the amazing interactions with such a diverse group of animals, all with there own unique personalities. A lot of these animals had certain past experiences that made them act a certain way, and it was great to be a part of helping them feel more comfortable, learning about them, and finding them a great home. All the staff had a common bond over their love for animals and it showed in how much time and effort the staff put in to making those animals feel comfortable and flourish.", "cons": "There was a lot of staff turnover. This constant turnover meant that supervisors and team leads were busy hiring/training staff and had less time to focus on longer term staff development or bigger projects. Usually this put undue stress, a higher workload, and less support on those employees. This often led to unhappy employees or ultimately those people leaving and starting the cycle all over again. Being a team lead sometimes just felt like being in HR with the amount of staff hiring and morale boosting you were doing. \r\n\r\nAdditionally, there was a lot of red tape in place. This is somewhat needed for safety purposes and to ensure accurate information is distributed to staff and the public, however it tended to slow everything down. If you wanted to create change and you are lower on the totem pole, it means that your idea had to go through several layers of management (who are often very busy) to get approved.\r\n\r\nThe salary and pay was very low. As a non-profit there are certainly challenges to paying staff a living wage so it's not overly unexpected, however I know that even at a team lead salary, it was hard to fully support yourself. With the amount of knowledge, expertise, training, and emotional maturity/intelligence that the staff are expected to have, it's hard to keep valuable staff with the wage being so low."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Animals + great team members", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Mar 2021", "job_title": "Fund Development Coordinator in Calgary, AB", "duration": "N/A", "pros": "Working with animals\r\nLots of collaboration \r\nFast paced", "cons": "Limited resources/budgets - non profit life"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Would not recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Feb 2021", "job_title": "Animal Care in Calgary, AB", "duration": "N/A", "pros": "Can’t think of any. Not worth it", "cons": "Very bad work environment. Poor management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Dedicated people making a difference in the lives of animals.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jul 2020", "job_title": "Communications in Calgary, AB", "duration": "N/A", "pros": "Working in an environment where everyone is dedicated to achieving the same goal is a wonderful feeling. Good colleagues, occasional perks like lunch or treats, lots of mental health support recently. Staff are good at recognizing each other's value to the team. You get to work with lots of cute animals too!", "cons": "Stress/sick leave is available for valid reasons and most people use it for the right reasons, but not every one. It's a high-stress environment. Unfortunately people on leave means remaining colleagues have to pick up the pieces when there's no coverage for their job (even temporarily). There's a lot to be done every day and it's easy to feel overworked."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Animal Care and Health do so much for the company and anyone else in the company just don't care.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Jul 2020", "job_title": "Animal Care Technician in Calgary, AB", "duration": "N/A", "pros": "Lots of free donuts and pizza (Like SO MUCH free food all the time), Sometimes there were innovative moments of community, Close teams, animals, learning, lax rules on phone use and personal breaks, good with wellness issues and always looking to grow and improve, training in other departments.", "cons": "Slow to improve, were not cooperative with people stepping up to address concerns, never following through with promises, anyone that doesn't work closely with Animal Care or Health just dont bother to communicate and would just assume everything. So many tasks that were not for AC were dumped on us and expected for us to continue to carry out the tasks and maintain them. Management is such a mess. I was without a manager for most of the time I worked there and the turn over rate is ridiculous. They don't have an overly great training routine and most stuff is through email which AC has little time to look at due to the fact that they are constantly moving around and away from any access to a computer.\r\nBenefits are so expensive and not that great, the social comity is also such a waste of mandatory funds. Pay is not sustainable for a position considered to be a career, it's not sustainable."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Proud to be part of the Humane Society that is leading in Animal Welfare", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Jun 2014", "job_title": "Animal Care Attendant in Calgary, AB", "duration": "N/A", "pros": "Get to work with the animals, Helping make a difference, Improving every year, Leading in Animal Welfare", "cons": "No raise (non-profit organization) despite how many years you work there, Poor management, Keeps around people who do minimum work and aren't strict about you being absent or sick often."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Rewarding - great team", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Jun 2020", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "Rewarding work and dedicated, compassionate staff.", "cons": "You see and hear about some horrible things but there’s good mental health supports in place for staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good job, inadequate pay", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jun 2020", "job_title": "Animal Health Assistant in Calgary, AB", "duration": "N/A", "pros": "Non Profit Organization, Animal Cruelty Investigation", "cons": "Low pay due to non profit"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Ok", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Sept 2020", "job_title": "Coordinator in Calgary, AB", "duration": "N/A", "pros": "Work with animals, relaxed enviornment", "cons": "Low pay, very busy, hihg turnover"}]]