[[{"date": "4 Nov 2022", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Crouse Hospital (Syracuse, NY) in Aug 2021", "Interview Descriptions": "The interview process was quick. I was interviewed by three of the nurse managers. Asked why I wanted to work there and my experience in clinical. They asked what shift I wanted to work.", "Interview Questions": "Why do I want to work for crouse"}, {"date": "24 Jun 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Crouse Hospital", "Interview Descriptions": "In person interview after contact via email. Talked with hiring manager as well as tour facility. They asked many situational questions, as well as questions about my background and my experience.", "Interview Questions": "Why are you interested in this position?"}, {"date": "16 Feb 2021", "title": "Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crouse Hospital in Nov 2020", "Interview Descriptions": "Interview process was upfront and clear. Interviewer showed interest in me and made sure to get a good understanding of my experience.  Valued all my experience, not just experience that is directly related to position.", "Interview Questions": "Strengths and difficulties? Near future goals? "}, {"date": "26 Aug 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Crouse Hospital (Syracuse, NY) in Oct 2018", "Interview Descriptions": "Very easy. Applied online on a Wednesday, received call from HR to schedule an interview for Friday. Completed the interview with HR, then with the Nurse Manager. In total took 45 minutes to an hour. The Nurse Manager took me on your of the unit. That afternoon received a call from HR with an offer. The next week there was a drug and background check and a fitness test.", "Interview Questions": "Why did you want to become a nurse? What are your professional strengths? How do you deal with stressful situations? What are your goals in your career?"}, {"date": "27 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Crouse Hospital", "Interview Descriptions": "It was a brief in person interview with the head of the Chemical Dependency Treatment Services Department.  I got the interview through a psychological internship class that I was taking through my university .", "Interview Questions": "What are you studying, what are your career goals, why do you want to work for us, how do you deal with stress?"}, {"date": "14 Oct 2017", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Crouse Hospital (Syracuse, NY)", "Interview Descriptions": "Interviews with immediate supervisor, peers, and direct reports.  This occurred over two days. The interviews were relative common questions about personal experience, skills and future goals. The interviews were coordinated by HR recruitment.", "Interview Questions": "Why did you leave your previous employer? "}, {"date": "27 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Crouse Hospital (Syracuse, NY) in May 2016", "Interview Descriptions": "Interviewed for ER staff nurse. Met first with HR personnel. Interview was pointed. Interviewer was hard to read but pleasant and professional. Met with ER manager and coordinator. They were pleasant and unguarded. They gave a ton of information and asked great questions. I was given a tour around the unit as well as the construction for the new ER. They are implementing a new EMR software.", "Interview Questions": "What have I learned a previous employments."}, {"date": "24 Jun 2019", "title": "Nutrition Services Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Crouse Hospital (Syracuse, NY) in Mar 2016", "Interview Descriptions": "It takes awhile to get an interview and or hired. You interview with the department and HR . They are very professional.  They give you a tour and explained exactly what I would be doing daily.  They explained rate of pay and also factored in any prior experience at that time .", "Interview Questions": "Why would this position be a good fit for you? Any prior experience ? . Examples of a difficult situation . "}, {"date": "20 Oct 2015", "title": "Strategic Planning Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Crouse Hospital (Syracuse, NY) in May 2015", "Interview Descriptions": "2 interviews. First with a more senior analyst who has done the same work of the internship position when they first started. They are a very patient oriented hospital at every level in the organization. They want to see that you are warm and friendly but also extremely smart and competent. The second interview was with the senior supervisor who reports directly to the hospital CEO.  Everyone who interviews the first time gets through to this round. They are very thorough and take their time to make the decision. You need to take initiative to hear anything back.", "Interview Questions": "Are you on time with assignments."}, {"date": "6 May 2014", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Crouse Hospital (Syracuse, NY) in Jun 2013", "Interview Descriptions": "One interview with HR. Typing test. Then if you pass the typing test you have a face to face with the hiring manager for your department. I received the call the same day and started within a two weeks. Had to go to employee health for physical, mask fit test.", "Interview Questions": "N/A"}], [{"date": "28 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Crouse Hospital (Syracuse, NY) in May 2012", "Interview Descriptions": "The interview process is 2 parts.  Firse with HR, and then with giring manager.  Both very laid back, comfortable.  I felt that I over-prepared, but in the end I got the job.  I was contactef with an offer within days of my interview.  The contacted all 3 of my references with online questionairres.", "Interview Questions": "Years of experience, relevant skills"}, {"date": "25 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crouse Hospital (Syracuse, NY) in Apr 2011", "Interview Descriptions": "I met with the nurse recruiter who asked me a series of non-clinical questions. Then I met with the manager and nursing staff. The manager asked me when I was available to work and what days that I would need off to focus on school. She stated that my work schedule would be flexible to accommodate my school schedule. Then I met with a HR representative to review my health benefits.", "Interview Questions": "What were my future goals to be accomplished within the next 5 years."}]]