[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work with a diverse team", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "29 Feb 2020", "job_title": "Communications Intern in Salzburg", "duration": "N/A", "pros": "- Salzburg Global Seminar is a great place to work/intern at especially if you're looking to transfer/channel your knowledge and past experiences into working in a more organizational/nonprofit environment.\r\n- The staff across all departments are very friendly, approachable and helpful.\r\n- Supervisors are helpful and guide you when you're unsure of a task.\r\n- The environment (the Schloss Leopoldskron itself) provides a lovely ambience to work and unwind in.\r\n- You get to meet a lot of people from different countries, from all walks of life during SGS programs and sessions.\r\n- You're allowed to suggest/discuss new ideas or a certain project you'd like to work on with your supervisor.\r\n- Internship program manager is very friendly and cares a lot about intern wellbeing.\r\n- You're kind of left to be independent, but supervisors are always around to assist you.\r\n- Interns are well taken care of even though the internship is unpaid. But interns get free board, free food, sometimes free tickets to attend some exclusive events outside or inside the Schloss, and they can attend/work on all sessions/SGS programs.\r\n- Diversity in work place. Many staff and interns are all from different parts of the world - Africa, Asia, the Americas, Europe, Australia, etc.", "cons": "- Sometimes when there are a lot of sessions during a period, it might get very tasking for an intern and a little pressure begins to build up. During some sessions, interns can work on Saturdays and Sundays (especially program interns) past 6PM. BUT the interns are FULLY AWARE of this anyway before coming to Salzburg, as they're made aware that during some sessions they might have to work on weekends, late into the evening.\r\n- Some interns can take up two intern roles with different tasks. But again, if an intern is taking up two different roles/tasks, they're made aware of it before hand, and can oblige to do it or not."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Once in a lifetime opportunity", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "29 Oct 2014", "job_title": "Program Intern in Salzburg", "duration": "N/A", "pros": "Working within an amazing staff that is welcoming and always willing to help. The people who attend the seminars are truly inspirational. You end up making conversation with them over lunches and dinners and getting life advice from these successful people from different fields and backgrounds. Oh, and living in a palace with beautiful scenery is definitely a pro as well!", "cons": "Nothing really to note here!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great environment and work-life balance", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Feb 2020", "job_title": "Intern in Salzburg", "duration": "N/A", "pros": "Free accommodation and meals, friendly coworkers, plenty of opportunities for networking with session participants, working environment, great work-life balance. All interns are treated very respectfully.", "cons": "Internships are basically unpaid, and the load of work varies depending on the season. Usually autumn has the most sessions and therefore it is the busiest time. Your supervisor also constantly change depending on what sessions you work on."}], [], [], []]