[[{"date": "4 Jan 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Samaritan Health Services in Dec 2022", "Interview Descriptions": "Doing application process they asked for your Social Security number, drivers license, date of birth in order to do not just a background check but also a credit check. It had paperwork about the fair credit reporting act.", "Interview Questions": "Please tell me about yourself?"}, {"date": "19 Apr 2023", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Samaritan Health Services in Sept 2022", "Interview Descriptions": "Began with phone call with recruiter then casual phone call with medical director. This was followed by in-person tour and reviewing benefit package at site then ended with small panel (5 including candidate) interview at the hospital.", "Interview Questions": "How do you react to stress?"}, {"date": "26 Aug 2022", "title": "Senior HR Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Samaritan Health Services (Corvallis, OR) in Aug 2022", "Interview Descriptions": "For this role, Samaritan Health Services had a three-stage interview process.  It began with a telephone interview, an interview with peers and the hiring manager, and with executives. I did not participate n the final interview as I had already received a job offer from a different firm.", "Interview Questions": "The interview questions were standard behavioral questions as well as questions about my background. "}, {"date": "18 Jul 2022", "title": "Business Analyst I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Samaritan Health Services", "Interview Descriptions": "The initial zoom interview was straightforward. The interviewer is one of your supervisors and my interviewer was very forthcoming with information pertaining to what the job would look like and what they are looking for in their potential candidates. \r\nThe second interview was with HR over the phone. I was asked about my previous job history for the last 10 years, with information about how long I was there for and why I left. \r\nFinally, they asked for references (at least three and at most five). Samaritan Health Services uses an online platform to digitally send and receive references, though you are unable to go back and change information about the recommendation given or the information about the person being the reference.", "Interview Questions": "What is your experience with Excel?\r\nWhat do you hope to learn from this position?\r\nWhat is your experience with SQL?"}, {"date": "14 Nov 2022", "title": "Training Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Samaritan Health Services (Salem, OR) in Jul 2022", "Interview Descriptions": "First initial phone interview, and after clearing that hurdle a virtual, group, interview. While virtual, everyone was warm and engaged, and the process was a positive experience. The interview consisted of the usual round of situational-based questions.", "Interview Questions": "Tell us about a time where you were responsible for creating and delivering training content (two separate answers)."}, {"date": "16 May 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Samaritan Health Services", "Interview Descriptions": "Talked about customer service and past employment. Talked about job description. Took a tour of the hospital. It took about an hour. Wasn't asked many questions at all. They were nice though.", "Interview Questions": "Can you life 25 pounds?"}, {"date": "22 Sept 2020", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Samaritan Health Services (Newport, OR) in Aug 2020", "Interview Descriptions": "Quick, painless and no stupid questions. The recruiter went over the job and the environment I’d be working. Overall a nice conversation about what they were looking for, type of training available and other opportunities.", "Interview Questions": "What was your last nursing job like"}, {"date": "25 Sept 2019", "title": "Customer Service Representative I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Samaritan Health Services (Corvallis, OR) in Sept 2019", "Interview Descriptions": "Interviewed by 3 an immediate supervisor, a secondary supervisor and a trainer. Each took turns asking a question; all took notes. All 3 were very pleasant and professional. I felt very comfortable with the persons interviewing me. The interview questions were similar to others found online and this was helpful in preparing for the interview.", "Interview Questions": "Tell us what makes you well suited for this position?"}, {"date": "9 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Samaritan Health Services (Albany, OR) in Oct 2018", "Interview Descriptions": "A long online process, then an online questionnaire, after the recruiting company reviewed it was forwarded onto the manager who then requested an interview.  I was offered the next day", "Interview Questions": "What makes you want to work for us?\r\nWe have a smaller hospital, is that something that you would be able to work with (i came from a much larger system)\r\nFew clinical questions, difficult patient and family questions, pretty standard questions"}, {"date": "15 Apr 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Samaritan Health Services (Corvallis, OR) in May 2018", "Interview Descriptions": "I was interviewed by two supervisors. I was able to talk with the previous Intern before and after the interview which was very helpful. The interview lasted approximately 20 minutes.", "Interview Questions": "Tell me about yourself?\nDescribe a time when you had to work with a team."}], [{"date": "26 Oct 2017", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Samaritan Health Services (Corvallis, OR) in Nov 2016", "Interview Descriptions": "Got called in for interview with Manager and Supervisor.  Got a call the next day asking me to come in and meet with Chief Operating Officer.  She asked me very specific questions that a person would have to have been working at Samaritan to answer.  She seemed to want me to fail the interview, which I did.  I have so much valuable experience, but this company will not give you the opportunity to show that talent if you don't know what they want to hear.  Being a genuine hard working, knowledgable, reliable person doesn't matter if you are not a game player.  So, brush up on those behaviorial interview answers and tell them what they want to hear.", "Interview Questions": "Easy, but if you are honest, you will probably fail."}, {"date": "9 Nov 2015", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Samaritan Health Services (Corvallis, OR) in Oct 2015", "Interview Descriptions": "So many red flags. No one seems happy to be there. Have been through three interviews (two different positions). Each time, the process was extremely disorganized and excruciatingly slow. I'm female and the men on the panels (except for one) came across as sexist, dismissive, threatened, and socially inept, both towards me and towards my female interviewers. Won't be applying for any more positions; I've seen enough.", "Interview Questions": "Why do you want to work here? (Same question I asked myself after the last interview...)"}, {"date": "2 Nov 2015", "title": "Infusion Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Samaritan Health Services (Corvallis, OR) in Oct 2015", "Interview Descriptions": "Phone interview with human resources . Then second phone interview with manager. Then had a walk through of the infusion center, met with some key staff members. Took a tour of the building and had discussion with the manager.", "Interview Questions": "What is the reason you want this job."}, {"date": "19 Sept 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Samaritan Health Services (Corvallis, OR) in Jun 2015", "Interview Descriptions": "Interview panel, critical thinking questions. Unclear upon hiring for process of submitting education requirements to HR and unclear inconsistent union representation/presentation. I personally don't feel interview panel and critical thinking questions are helpful as they stress out the interviewee.", "Interview Questions": "role playing, critical thinking questions"}, {"date": "26 Jun 2014", "title": "Unit Support Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Samaritan Health Services (Lebanon, OR) in May 2014", "Interview Descriptions": "Applied online. HR called same week for an interview. I was interviewed by 2 people. Within a week of the interview, I received an email with an automated message saying another candidate was chosen.", "Interview Questions": "What are your strength and weakness?"}, {"date": "13 Jul 2013", "title": "Nurse Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Samaritan Health Services", "Interview Descriptions": "Interview with department manager, member of senior leadership, HR Director", "Interview Questions": "What sets off your hot button"}, {"date": "11 Jul 2013", "title": "RN Clinic Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Samaritan Health Services (Corvallis, OR) in Apr 2013", "Interview Descriptions": "Application is online for all positions. I had 5 interviews and at each one there were two individuals present. They have a list of questions their company asks you during their interview and of course since some jobs are union if you are coming from outside of the company you will not be chosen. They were all very good questions. Each person was kind and professional, clean and well spoken. All questions I asked during the my questions possed to them were answered to the best of their ability and to my satisfaction. The only rule here is hat like most companies these days, when they don't hire you then you are e-mail. This is so impersonal and leaves many prospecive employees feeling very lost and somewhat used.", "Interview Questions": "The most difficult question for me was, \" do you have any questions for us?\" "}, {"date": "12 Oct 2015", "title": "Medical Records Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Samaritan Health Services (Albany, OR) in Oct 2011", "Interview Descriptions": "A group interview with my potential manager and direct coworkers who all asked questions to learn about my adaptability, attention to detail, self motivation and team spirit.     Displaying sf confidence, communicating details and past incidences that were relevant, and remembering names got me the job.", "Interview Questions": "How have you improved the last workplace you were employed at?"}]]