[[{"date": "19 Oct 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Opportunity International (New York, NY) in Jul 2021", "Interview Descriptions": "First you need to take two interviews and the third one is a technical task. They require proof of your skills. Overall it was a good experience. The interviewers were very nice. Its a shame I didn’t get the offer", "Interview Questions": "What’s you experience as a leader in your community?"}, {"date": "11 Mar 2022", "title": "Education Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Opportunity International (Lusaka, Lusaka) in Oct 2020", "Interview Descriptions": "You go through 3-4 rounds of interviews and assignments\r\n1 is for screening. on this one you need to understand the role and how you will fit into the company\r\n2 is by expert/s. You need understand your job description\r\n3 is by project manager\r\n4 may be done by director", "Interview Questions": "What is a school development plan"}, {"date": "16 Jan 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Opportunity International (Chicago, IL) in Jun 2019", "Interview Descriptions": "I was contacted shortly after I applied. I had three over the phone interviews  and one in person and was offered the job the same day. knowing about nonprofits and how microfinance work was the key I think.", "Interview Questions": "What do I know about microfinance."}, {"date": "6 Apr 2017", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Opportunity International (Johannesburg)", "Interview Descriptions": "Sent in my resume, was then called for an interview, given an interview date and time, spoke to team leader, then HR in USA, then received a job offer, accepted", "Interview Questions": "What in your past job experience would prepare you for this position?"}, {"date": "2 Nov 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Opportunity International", "Interview Descriptions": "I applied on their website and via an internal referral. I had an initial couple phone screens with HR and then the VP's that I would be supporting. There was one in person interview which included the offer.", "Interview Questions": "Walk me through your experience?\r\nTell me about a time you overcame a conflict. \r\nWhen was a time you had to work in a fast paced setting?"}, {"date": "16 Jun 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Opportunity International (Chicago, IL) in Jun 2016", "Interview Descriptions": "It was an easy process I am a Contractor. Met with 3 people including HR. Interview was 2 hours. Was not intimidating at all If there is an opportunity to become permanent I may consider it if the salary matches my skill level.", "Interview Questions": "About experience, I had a lot of previous experience therefore I was able to WOW them with my answeres"}, {"date": "4 Sept 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Opportunity International", "Interview Descriptions": "I did a skype interview with the intern director of the marketing department. It was not very long, about half an hour, and I am usually very good with interviews but I felt very awkward with this interview. The interview was not difficult; I don't remember the exact questions, but none of them were intimidating or out of the ordinary. I ended up getting the internship, but I wished I did more research and asked better questions at the interview, because the internship was very different from what I expected. My experience wasn't bad; I just had an enormous expectation of the internship. My advice would be to ask good questions to gauge what your experience at Opportunity will be like.", "Interview Questions": "How do you work in a team?"}, {"date": "30 Aug 2015", "title": "Proposal Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Opportunity International (Philadelphia, PA) in Aug 2015", "Interview Descriptions": "Very standard easy questions.  I got the impression that the initial interview was to weed out any non-Christians.  They kept asking me what my \"motivation\" is for doing social impact work.  When my responses did not touch on religion the interviewer kept rephrasing the question again and again until she got what she was looking for.", "Interview Questions": "What is your motivation for doing social impact work?"}, {"date": "6 Apr 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Opportunity International (Nairobi) in Jun 2012", "Interview Descriptions": "Skype and in-person interviews with senior staff, scheduled meetings with 1 on 1 interview with Director, heard about the job through a contact of someone employed with the organization.  Interview process took 3 weeks, got an offer on the position.  Currently still employed there.", "Interview Questions": "Experience, example of successful project administration"}, {"date": "16 Nov 2015", "title": "Fund Raiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Opportunity International (Chicago, IL) in Mar 2011", "Interview Descriptions": "it was not a positive experience. The HR group was not very responsive, nor were the hiring managers. The process took several months. It seemed that they didn't know what the job entailed, who it would report to, etc.", "Interview Questions": "tell me about your background?"}]]