[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great Workplace", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Jan 2021", "job_title": "Manager in Cape Town", "duration": "N/A", "pros": "It's an amazing organization to work for, they take care of their staff", "cons": "It can be bureaucratic at times"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "High performing", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "20 Aug 2018", "job_title": "Director of Communications in Cape Town", "duration": "N/A", "pros": "If you’re a high performing, self-motivated professional who wants to be given the space to excel, then Orbis is a good fit for you. However, if you’re in search of an uncomplicated 9 to 5 job then look elsewhere. The organisation attracts leaders who are strategic, results-orientated, tough yet fair and they expect their teams to deliver. I had the privilege of working for Orbis International Africa for almost five years and chose to leave only because I was offered an incredible opportunity to work for a leading private foundation (from fundraising to funder – who could ask for more?). It needs to be said that, had I not been offered the position, I would happily have stayed with Orbis for another 5 years.  After a string of CEOs, Orbis is very lucky to have Bob Ranck at the helm and this has brought much-needed stability and strong global leadership.", "cons": "No organisation is without its faults and while Orbis has the usual cumbersome systems and processes that one would expect to find within an international organisation, it is countered by teams who are genuinely committed to collaborating for maximum impact. Although Orbis sees its fair share of staff turnover, on the converse it retains many individuals who have been with the organisation for more than a decade, without losing any of their energy or passion for the cause."}]]