[[{"date": "5 Sept 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Education", "Interview Descriptions": "The fastest interview process I've ever gone through. I got an interview schedule a few days after applying for the position, got a yes response 2 days after the interview.", "Interview Questions": "What is your experience with managing a team?"}, {"date": "28 Nov 2020", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Education in Sept 2020", "Interview Descriptions": "I don't usually post negative reviews online, but I had such a bizarre experience interviewing for a program associate position that I feel compelled to share my experience. I was asked to complete a phone screening with a PA on a holiday who had only been with the company for a few months. From what I'd gathered, she has only done administrative work and was not accustomed to interviewing candidates. Her voice was shaky and she was clearly anxious, which made for an incredibly awkward interview. She also never asked me the standard \"tell me about yourself\" question and was unfamiliar with my resume so it was difficult to communicate my qualifications and experience. After the interview, there was no follow-up (despite sending a thank you), which I found really disrespectful and outdated. I was deterred by several Glassdoor reviews which state mismanagement and a lack of internal communication. My interview experience only confirms these perspectives. I have since been offered a position that pays substantially more and will not be applying for any further positions at World Education.", "Interview Questions": "What do you know about the company?"}, {"date": "30 Apr 2020", "title": "Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Education", "Interview Descriptions": "Phone call for about 30 minutes. Asked why I was interested in the job and how my past experience would help. Very open ended and left a lot of room to sell yourself.", "Interview Questions": "Why do you want this job?"}, {"date": "30 May 2018", "title": "Staff Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Education (Boston, MA) in May 2018", "Interview Descriptions": "Applied online and heard back a few days later to schedule a phone interview. The phone interview was pretty standard, taking about 35-45 minutes. A few days later they emailed me again to set-up an in-person interview. When I came into the office, I interviewed with 4 people related to the role. A few days after that I was asked to provide a writing sample and references. It has been a few days since I responded with those materials, and am now waiting to hear back.", "Interview Questions": "What interests you about working at World Education and this position more specifically?"}, {"date": "25 May 2016", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Education (Boston, MA) in Mar 2016", "Interview Descriptions": "Was contacted by a Program Officer (PO) who scheduled a phone interview with me the following week. The phone interview was pretty standard and was with the PO and Manager. Lasted 45mins, and contained all the basic interview questions. A few days later I was contacted by email again inviting me for an in-person interview for the following week. I live outside of Boston and they paid for plane ticket (up to $400) and one night of hotel and taxi/uber to and from the interview (which is amazing considering its a non-profit). The in-person interview lasted one hour and was with a different PO, Manager (same one) and the regional VP. The interview was again pretty standard, no surprises. After the interview (still at the office) I took an excel \"test\". Very basic excel skills. Followed by a short writing \"test.\" After all was complete, I was told that they would have a decision within a few weeks. Never heard from them again. \r\n\r\nThe overall experience was pretty positive. However, I find it very unprofessional to not follow up with a final candidate (especially if they traveled out of state for the interview) notifying them that they did not get an offer.", "Interview Questions": "Tell us about your past budget experience. "}, {"date": "12 Jul 2015", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Education (Boston, MA)", "Interview Descriptions": "It is fairly simple compared to other organizations and similar positions. A phone interview with two people followed by an in person interview with the senior leadership. Surprising there is no middle step. A bit slow, from application to the second round of interviews took about 2 months.", "Interview Questions": "How would you adjust to the head office coming from a field office and what challenges do you anticipate?"}], [], [], []]