[[{"date": "9 Mar 2023", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "Recived an email to interview, interviewed with manager and then with chair. Two about a week in total.The manage rat the time was easy to talk to, very personable . I was the offered position", "Interview Questions": "What do you do in your most r3ecent job"}, {"date": "16 Dec 2021", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The GW Medical Faculty Associates (Washington, DC) in Nov 2021", "Interview Descriptions": "Applied via job portal. Series of 3 interviews with different faculty. They all try to gauge the type of candidate you are. However,  they seem a little disorganized and very slow to respond/unresponsive.", "Interview Questions": "They basically go through your resume and ask you questions about your experiences. And some personable questions like what are your strengths and weaknesses etc"}, {"date": "20 Jul 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "The interview process is fine but the on boarding process was awful and everything from the systems to the HR personnel is unorganized! They don't set you up for success. There is a lack of training and departmental leadership aren't the right people for the job.", "Interview Questions": "Tell me about your management style."}, {"date": "2 Jul 2020", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at The GW Medical Faculty Associates (Rockville, MD) in Jun 2020", "Interview Descriptions": "Hiring process took exactly two months, everything was delayed because of COVID-19. I had 3 interviews, two over the phone and one in person. After the interview I was contacted exactly week later over the phone and I accepted the offer.", "Interview Questions": "Why do you want to work for this company?\r\n "}, {"date": "6 Mar 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "Went in and waited for hours. Was told I would hear from them soon with a job offer but found out they gave someone else the offer when I reached out to them after waiting.", "Interview Questions": "Why do yo want this job?"}, {"date": "2 Jul 2019", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "Within a week after applying, I was called in for a in person interview. The following week I was offered the job. The interview consisted of them telling me about the facility and functions of the position. Overall, easy interview. I will say the on boarding process is very confusing as there is little to no accurate communication between corporate and clinical staff management.", "Interview Questions": "What is your ideal salary? "}, {"date": "8 Feb 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at The GW Medical Faculty Associates (Rockville, MD) in Feb 2019", "Interview Descriptions": "Sherri Mcnara was professional, personable, and throughly explained the duties of the medical assistant at the office I was filling in for.  The staff was friendly and I believe we were a great fit right off.", "Interview Questions": "The interviewing process was not much different from my past experiences. I was working with a Quadrant recruiter, Dena Yusif, my resume was submitted for review and I came in for an interview. Based on how things went, I was either asked to stay and fill in for a medical assistants taking leave at one of the GW Medical Faculty Associate office. "}, {"date": "18 May 2019", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at The GW Medical Faculty Associates (Washington, DC) in Jan 2019", "Interview Descriptions": "Interviewed with HR recruiter. Week or so later interviewed with Hiring Manager. It was one of those interviews where the manager was look a reason not to hire you. Disappointing for HR", "Interview Questions": "Standard questions about why you want the role"}, {"date": "14 Aug 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The GW Medical Faculty Associates (Washington, DC)", "Interview Descriptions": "It went well.  I had to wait for 1 hour for the my last interviewer. The entire process took a few weeks.  The position had been vacated by the former employee with out notification.", "Interview Questions": "What or who inspires you."}, {"date": "30 Apr 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at The GW Medical Faculty Associates (Reston, VA) in Jan 2018", "Interview Descriptions": "Applied online and the process took 3 weeks. Got a phone call from the office to \ncome in for an interview. I was interviewed by the office manager and one HR representative. I met with the office staff as well. The whole interview process was 1hour and 30 minutes.", "Interview Questions": "Give me a time where you had a difficult situation and how did you solve it ?"}], [{"date": "22 May 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The GW Medical Faculty Associates (Washington, DC) in Jan 2018", "Interview Descriptions": "Meet with manager, supervisor and tour the facility didn’t ask a lot of questions wanted to know can you stay at work late and have Good transportation and child care", "Interview Questions": "What’s the lowest you will take "}, {"date": "15 Dec 2017", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The GW Medical Faculty Associates (Arlington, VA) in Aug 2017", "Interview Descriptions": "Received a phone call from HR which included approximately five or six questions.  You interview with the H.R. and head of the department.  The process took about thirty minutes. Viewed the work area which was all opened space.", "Interview Questions": "Give an example of one obstacle and what you did to overcome it on a previous job. The number of words that you can type per hour.  What’s your level of customer service experiences?"}, {"date": "25 Jan 2016", "title": "Employee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The GW Medical Faculty Associates (Washington, DC)", "Interview Descriptions": "I had a telephone interview.  I came in to meet with management.  I interviewed with a few people.  Each interview took about 30 minutes to complete.  These were the people that I worked with.  I heard back in about a week.  Then I accepted the job.  The interview process is not hard at all.  This is nothing to be worried about.", "Interview Questions": "How do you handle multiple projects at a time?"}, {"date": "23 Nov 2015", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "I applied online. Did a brief interview with an HR rep and the. Schedule an I person interview with the Hiring manager. And a week later was offered a position.", "Interview Questions": "N/A"}, {"date": "19 Apr 2018", "title": "Offsite Helpdesk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at The GW Medical Faculty Associates (Washington, DC) in Nov 2015", "Interview Descriptions": "Was brought into the Director of IT's office, and was interviewed by 3 different people: \r\nDirector of IT, Network Team Manager, and Helpdesk Manager. The questions increased in difficulty as I gave correct answers. Low-level focused on helpdesk and basic troubleshooting skills, then increased to customer service questions. After answering those thoroughly, I was asked higher techincal level questions, such as networking questions and server questions.", "Interview Questions": "How do you set a computer to have a static IP?"}, {"date": "5 May 2015", "title": "Patient Service Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "Quick, human resources seemed a little rude. The manager for the surgery department was nice. They both asked simple question. Easy interview overall. Although the position got cancelled, everything else went well.", "Interview Questions": "Why healthcare? Typical questions"}, {"date": "23 Dec 2013", "title": "Human Resources Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "Good communications throughout the process.  Spent a full day interviewing. Many of the interviewers had not reviewed my resume. Most did not know the key criteria for the selection process.  This is an organization that needs a stronger HR team. I would have helped if I could have known ahead of time the backgrounds of my interviewers.", "Interview Questions": "Good behavioral interview questions. None were particularly difficult."}, {"date": "15 Jun 2013", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The GW Medical Faculty Associates", "Interview Descriptions": "Communication was mainly through email. The interview was mainly based off of my resume and no textbook interview questions were asked", "Interview Questions": "N/A"}, {"date": "21 Jan 2014", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at The GW Medical Faculty Associates (Washington, DC) in Apr 2013", "Interview Descriptions": "Hiring and HR in general, are very bad. I was contacted directly by the supervisor, whom I was connected through by a common friend. She interviewed me for the initial round who then advised me to apply on the website and wait for the HR to contact me. HR contacted after 5 days. Conducted their interview using the usual list of common questions.", "Interview Questions": "None. All the questions were the usual, expected list from the behavioral set of questions, such as weakness/strengths?, how you motivate others?, why you are a good fit for this position?, where do you see yourself in the next 5 years? long term goals?"}, {"date": "15 Jun 2012", "title": "Sports Medicine Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The GW Medical Faculty Associates (Seattle, WA) in May 2011", "Interview Descriptions": "The interns are interviewed after submitting a resume and application online. The application process was open for 1 month and half the applicants were interviewed. Of the applicants interviewed only about 1/3 of them were accepted. The interview was relaxed though you should ask lots of questions to show interest.", "Interview Questions": "Why do you want to be here?"}]]