[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Don't Believe the 1 Star Reviews...", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Mar 2023", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Everyone in the org is mission driven, not product driven or racing the corporate ladder for a title. These wild 1-star reviews are likely not National employees or are disgruntled former employees that were let go from performance issues. It's a non-profit, of course the salaries are not great, that shouldn't be a shock to anyone in the NP world. Everything the Recruiter for the National Office told me has been the truth and I love my job and the people we work with across the departments. From the C-Suite down, we have some phenomenal people working here doing great work. The org has made huge strides since going remote in hiring great talent across the country and some phenomenal diverse hires that have been rare in the non-profit world, the teams have been adding such amazing people that are great to work with.", "cons": "Obviously pay is tough and non-profits can't meet market averages, that's a no brainer. Everyone wants to make as much money as they can but be realistic. Camera on meetings get old, quick. Let's get back to camera optional."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working for Make-A-Wish Rocks!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jun 2023", "job_title": "Development Specialist in Maitland, FL", "duration": "N/A", "pros": "Everyone is super amazing, and getting to work with all of the Alumni families is such a blessing :)", "cons": "None that I can htink of"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Believe the Bad Reviews - Sad but true", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Mar 2023", "job_title": "National Office Staff", "duration": "N/A", "pros": "The mission. The wish kids. Some nice people. That’s it.", "cons": "Believe the bad reviews. All of them. (The dismissive attitude toward them is a perfect example of a narcissistic org: “We refuse to improve. I’m not the problem, you’re the problem.”) Incompetent, over-paid leadership: National Office politics and National/Chapter infighting perpetually delay progress. Expect your projects to take 3x as long. Misalignment & poor communication = confusion & low morale. They can’t handle a remote culture. Expect more turnover. It’s not disgruntled or low-performing employees who leave, it’s people who love the mission, but believe the org should live up to its values. And the gossip mill: Wow! Be ready to pull knives out of your back daily."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good Cause, Problematic Leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Apr 2023", "job_title": "Marketing in Dublin, Dublin", "duration": "N/A", "pros": "The cause is great - it is wonderful to see wishes improving sick children's lives", "cons": "Management says that they are a casual team that is open to change but responds poorly to suggested changes. CEO holds complete power over decisions and does not allow others to disagree. Gossip and pettiness are commonplace. Marketing mix is heavily weighted towards traditional marketing with no evidence that this is working. Digital marketing is given less than 5% of marketing budget. The CEO takes a 6 figure salary, even though the annual funds raised are less than 2 million."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This Rating Reflects the Current State of this Chapter, not the Whole Job", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Apr 2023", "job_title": "Senior Manager of Marketing & Communication in Sacramento, CA", "duration": "N/A", "pros": "This review is for Make-A-Wish Northeastern & Central California and Northern Nevada specifically. The mission and impact is tangible. This is one job where you can SEE and FEEL the impact you will be making. The work is very rewarding, and fun. Our kids wish for cool stuff! Whether it be a kiddo who wanted to be a trash collector, a delivery driver or a pop star, we get to work with some amazing kids who are so creative in what the wish for. Plus, many of the individuals who comprise the team are amazing. They care, and they work hard. For nearly all of four years working there, it's one of the most collaborative experiences I've had in my career with smart, talented and creative people. One of my absolute favorite things about this job was their investment in production equipment. With a Sony FX3, your videos will be top notch and they invested in a print quality printer, large format printer and cutting machine, giving you the opportunity to take a collateral piece from design to production. Working with the Brand and Marketing Team at Make-A-Wish America is amazing. There are some really great individuals working on that team who are always there to help if they can and to amplify the stories coming out of the chapter.", "cons": "Again, this review is for Make-A-Wish Northeastern & Central California and Northern Nevada specifically. For three+ years and throughout the pandemic, there really wasn't a lot that was wrong. I would say over the course of that time, our DEI initiatives were lacking. However, since really Spring 2022, the chapter has been in a state of flux. It has made growth opportunities harder to picture. Where it used to be senior leadership would have these conversations with their employees, that conversation for me was pushed back every few months with a promise to revisit the conversation that never came to fruition. So at present, growth in salary and role is stagnant to non-existant. But the main problem lie in the current CEO. They have a large ego, taking up an entire staff meeting to talk about themselves. At that same staff meeting a major announcement was made in the final five minutes which was an awful way to communicate changes that would affect colleagues and the chapter at large. The CEO's communication style is very apathetic as well. They aren't super interested in working with wish families during a wish (would rather talk to city dignitaries) and isn't particularly charismatic, which has resulted in poor performances at large fundraising events and even the loss of a few influential donors. More than anything, through a conversation I had directly with this individual, I don't believe they understand what the mission of Make-A-Wish is. It was the final red flag for me before I left and I did report to Make-A-Wish America which will hopefully mean it will be addressed. During my final week, I had a going away Zoom with my colleagues and it was so terribly nice to hear about the impact that my work has made on families across the chapter, and on my colleagues. Which is why it was very odd when the CEO walked past me without acknowledgement on my final day without saying good bye or thank you. Par for the course it would seem... Not convinced on the communication yet? Well know that benefits that were promised to us under the previous CEO, and the Interim CEO are being looked at under a fine toothed \"cost cutting\" microscope. Worse yet, the current CEO has cancelled some benefits without even announcing to the staff, including grief counseling, an amazing benefit that some were taking advantage of that was stripped from them without ANY communication. Embarrassing that one of my colleagues found out about this from the counselor and not the CEO who cancelled that benefit without any notice. It's either a lack of respect for the staff, or the CEO is so out of touch that she doesn't think about the staff at all when making decisions. I get a CEO's job is sometimes to make difficult decisions, but the lack of foresight and communication is exceptionally bad. As for Make-A-Wish America, the former CEO was incredible and we as individuals at the chapter heard from them often. Upon their retirement, his replacement, the Current Make-A-Wish America CEO, I'm not sure I've heard anything from them."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Mission", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 May 2023", "job_title": "Market Director in Cincinnati, OH", "duration": "N/A", "pros": "Great Mission and caring volunteers", "cons": "Mixed messaging to the staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wish Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 May 2023", "job_title": "Wish Manager in Philadelphia, PA", "duration": "N/A", "pros": "Love the mission and the staff", "cons": "Non-profit salary. I wish budget was higher for salary."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fun and rewarding internship experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Apr 2023", "job_title": "Events Intern in Trumbull, CT", "duration": "N/A", "pros": "The internship experience is so fun and rewarding to be apart of, you get to work hands on with the team and become apart of the culture.", "cons": "Not really known about or promoted"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Perfect Internship", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 May 2023", "job_title": "Volunteer Services Intern in Marietta, GA", "duration": "N/A", "pros": "company culture and emotional satisfaction", "cons": "You don’t get any payment or salary"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Amazing Mission, Struggling Leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2023", "job_title": "Director of Events in Los Angeles, CA", "duration": "N/A", "pros": "As a fundraiser, it doesn't get much easier than raising funds for Make-A-Wish. Companies were always willing to take our call and talk about partnerships. Staff in the office were all hard working.", "cons": "I was there prior to 2019 so I can't speak to current leadership. Back then, leadership seemed to turn over every 2 years and focused on all the wrong things. Top leaders didn't seem to have c-suite relationships and spent most of their time in the weeds of events or wish granting details that were better left in the capable hands of directors and managers."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "salary", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Apr 2023", "job_title": "Project Coordinator in Chicago, IL", "duration": "N/A", "pros": "good company and good culture", "cons": "no cons from my view"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Best Job Ever", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Mar 2023", "job_title": "Corporate Alliances", "duration": "N/A", "pros": "Incredible mission, innovative leadership moving to full time remote permanently just four months into the pandemic, freedom to achieve goals on own timeline, culture is very kind and helpful.", "cons": "Lack in opportunities for growth, limited professional development, lot of hours worked for below industry standard salaries."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Absolutely amazing organization to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Apr 2023", "job_title": "Data Analyst in Las Vegas, NV", "duration": "N/A", "pros": "- Fair Pair -Great Benefits - Remote Work -Healthy Work Culture", "cons": "- N/A, I've work for and with them for years and can't think of anything."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Mature Brand - Needs Strong Leaders", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Mar 2023", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Brand, mission, well respected organization.", "cons": "Leaders are new and supervise at best. No true leadership and development- everyone is just working. And if you’re good at your job autonomously, you get more work vs an opportunity to lead."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It was contract and expired", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Apr 2023", "job_title": "IM Currently Unemployed", "duration": "N/A", "pros": "Good working environment Co-workers were friendly Kind employers", "cons": "Low salary Long working hours"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Amazing Organization", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Apr 2023", "job_title": "Wish Coordinator", "duration": "N/A", "pros": "Great people, strong mission, good support", "cons": "Burnout is common from working at a nonprofit and dealing with push back from families and volunteers"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great mission, great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This company has a strong mission that I hold very near and dear to my heart. I am proud to say I work here. My day-to-day work life is very fulfilling. There are opportunities for professional growth. My co-workers are people I respect and enjoy working with. I envision myself working here for many years to come.", "cons": "From my perspective, I have no cons to list. Now and again, we face issues like every company. However, we address those issues together as they arise."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Not What I Wished For…", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Feb 2023", "job_title": "Fundraiser", "duration": "N/A", "pros": "The mission is the only pro. It’s impactful.", "cons": "As mentioned, please be mindful that if you are looking for a job at MAW, it is a federalized format with several individual chapters. This will make your job hunt more difficult, so focus on where the reviewer worked. My review is from a local chapter, not corporate. Here are my three top reasons I chose to leave: - Poor Leadership: I have never experienced such unprofessional and unkind management in my career. I’m not sure if it’s a lack of training, awareness, or truly just mean-spirited. Everyone was micromanaged, no matter your performance. No freedom for new ideas or projects. The few times I tried to share my concerns, I was brushed off. This poor leadership really effected my professional confidence in a way I never expected. - No HR Presence: Before I left, I did all I could to make things better. I documented poor situations I found myself in, and bravely addressed concerns I had with my boss directly and then worked up the leadership ladder from there. I didn’t have one ally in that office though, especially because there is no HR presence, so think of it as a small “mom and pop” shop. - Low Pay & Benefits: My first red flag should have been accepting the job knowing it was already below market value for a fundraiser of my tenure in our area. I counter-offered, and was told the board wouldn’t approve an increase. Should have run then. The low pay and poor benefits are not worth being a martyr for the mission."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Nice work environment", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Mar 2023", "job_title": "Coordinator in Mumbai", "duration": "N/A", "pros": "Great place to work and good environment", "cons": "Financial restraints being a non profit"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": "N/A", "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "It was great, until it wasn’t.", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Mar 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Most people were awesome and friendly. Remote opportunities, the kids!!", "cons": "Training or lack there of, some coworkers were extremely immature, management didn’t want to get involved in associate conflict.\n\nSalary was terrible for the amount of work expected."}], [{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great cause", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Mar 2023", "job_title": "Staff Accountant in Monroe, NJ", "duration": "N/A", "pros": "Flexibility and great people to work with!", "cons": "Lack of guidance from upper management"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Watch what you Wish for!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Feb 2023", "job_title": "Communications Manager in Phoenix, AZ", "duration": "N/A", "pros": "Great benefits Great office location Great food options", "cons": "Terrible culture of backstabbing, gossip and toxic leaders who would rather communicate to employees through memo rather than by talking or direct communication. Leaders do not have the backs of employees. This place is horrible because they're so mired in trying to be politically correct that you're afraid of your own shadow! Beware! This is not a nice place to work. It's dull, drab, and despite the mission, a depressing place to work! The pay is positively horrible!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Wish Granter at Make-A-Wish", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Feb 2023", "job_title": "Wish Granter", "duration": "N/A", "pros": "Great sense of purpose and fulfilment and the team on every MAW Affiliate is genuinely a great person and trying to help and overall super kind", "cons": "Bad payment because of limited resources and heavy emotional baggage"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Mar 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Caring staff Team Players Amazing Management Wonderful People Wonderful Common Goal", "cons": "There are literally no cons to working here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Great intership", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Dec 2022", "job_title": "Marketing/Public Relations Intern", "duration": "N/A", "pros": "Fantastic mission, friendly and supportive staff Learned how to use Canva, iMac, Sharepoint, Constant Contact Instant company recognition", "cons": "Would like if the internship was more structured (sometimes I didn't have things to do) Rotations between the departments would've also been nice Unpaid but the experience was good"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't go", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Mar 2023", "job_title": "Coordinator in Monroe, NJ", "duration": "N/A", "pros": "Working with great coworkers. Sometimes work from home.", "cons": "Horrible management. Toxic work environment"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "23 Feb 2023", "job_title": "Chief Financial Officer (CFO) in New York, NY", "duration": "N/A", "pros": "Great Team who all believe in the mission, leadership is top notch", "cons": "no cons that I can think of."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Amazing mission, management challenges", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Jan 2023", "job_title": "Development Manager in Toronto, ON", "duration": "N/A", "pros": "Inspirational mission - doing good work for real people. You get to see the impact directly when you hear from real wish families and see the difference a wish has on a child.", "cons": "Organization merged with Children's Wish Foundation a few years ago and it has been a mess since. Major staff exodus and management challenges. Do not recommend until they get things organized."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Aug 2022", "job_title": "Marketing Manager", "duration": "N/A", "pros": "Great company and culture - really care about employees\n- Working for great cause\n- Good PTO and benefits (except dental). Medical paid at 100%.\nSmall chapters (mostly) so you get\nA lot of interaction with National chapter which has been nice for getting updates, and a blueprint of how tos", "cons": "Pay is at bottom of non-profit scale\nVery strict about branding rules so you must learn them in and out\nDental is the worst benefit I've ever. I pay a lot out of pocket for any services besides cleaning. And only 1,000 per year allotment which pays for practically nothing.\nWish they were more progressive with fertility help in insurance.\nSmall company so not many career opportunities, you really just get a title change and a bump in pay for being at your job a while or doing it well. This isn't necessarily bad but"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Feb 2023", "job_title": "Accounting Manager in Phoenix, AZ", "duration": "N/A", "pros": "Phenomenal culture - unbeatable. Everyone is mission focused!", "cons": "There were no cons - great company!"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "great work life balance", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Feb 2023", "job_title": "Social Worker", "duration": "N/A", "pros": "great employers teamwork child integrity job satisfaction", "cons": "none I can think of"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Disgraceful Foundation", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Mar 2023", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "They gave me some free stuff.", "cons": "They treat people very badly."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Disgraceful Foundation", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Mar 2023", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "I got some free things.", "cons": "They treat people very bad."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "An Unfortunate Mess", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- The mission is incredible, and you can truly see the impact a wish has on a critically ill child's life. \r\n\r\n- There are some really smart, kind individuals left working for the organization.", "cons": "* Note that Make-A-Wish is federated. This page encompasses reviews from something like 60 different 501(c)3s. Your mileage may vary depending on where you work. I can only speak to headquarters.\r\n\r\nAlmost everything else. It's really unfortunate to see. The mass exodus over the last 9 or so months has nothing to do with the mission, and everything to do with management of the organization.\r\n\r\n- Executive Leadership is out of touch with...everyone below\r\n- Workloads are untenable, prioritization of work is nonexistent\r\n- HR doesn't seem interested in true employee engagement, just period games and \"fun\" or guidelines around when to turn on your camera for meetings\r\n- You have to fight for more than a 3-5% increase in a lot of roles, which doesn't cover cost of living increases at this point"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Super Toxic", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Oct 2022", "job_title": "Volunteer Coordinator", "duration": "N/A", "pros": "The kids you meet and a lot of their families are amazing.", "cons": "Literally everything else. Pay is super low, turnover is crazy high. My chapter had less than 10 people who had been there longer than 2 years and less than 5 who had been there for more than 3. My chapter also didn’t have an HR so any anonymous whistle blower complaints are impossible to put in including harassment and discrimination issues that I ran into in my time. Even if you make it past a year good luck getting a promotion! Also majority of their hires are as diverse as a group of white women who are there for a church book club."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Development manager", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Jan 2023", "job_title": "Development Manager in Philadelphia, PA", "duration": "N/A", "pros": "Great mission with lots of passionate supporters", "cons": "Leadership turnover and lack of direction"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "overall - good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Dec 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- the team I work with is amazing and the work we do is meaningful so it feels good to be part of a bigger picture - remote environment", "cons": "can’t think of much besides miscommunications between departments"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Not Bad", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jan 2023", "job_title": "PR Assistant", "duration": "N/A", "pros": "Fun work environment, low pressure", "cons": "Little room for advancement at all."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mission-centered", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Dec 2022", "job_title": "Chapter Staff", "duration": "N/A", "pros": "Great mission and you can see wish impact through the incredible children and families.", "cons": "None to share at this time."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good pay and great cause!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Dec 2022", "job_title": "HR Manager in Detroit, MI", "duration": "N/A", "pros": "Great cause with reasonable pay.", "cons": "Typical roadblocks for non-profit work."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love working for this company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2022", "job_title": "Operations", "duration": "N/A", "pros": "Great people, great mission, meaningful work", "cons": "Young incoming staff sometimes (interns)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Very Supportive!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This is the most supportive place I've worked at! My employers trust me and I trust them.", "cons": "There are very few cons to working here."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic @ National Office", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Oct 2022", "job_title": "Digital Marketing and Website Manager in Phoenix, AZ", "duration": "N/A", "pros": "The mission is really special. And employees are pretty passionate about it.", "cons": "Toxic culture that starts at the C-suite: highly stigmatizes mental health, promotes burnout, and does not support staff. You must be available 24/7. Gaslighting. No authentic supports in place for employees. The promotions process typically takes 9-18 months after you bring it up. It started out as a really great experience, but once I demonstrated my potential they burnt me out (80hr work weeks) and then froze me out when I asked for help/support."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "✅", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Dec 2022", "job_title": "Manager", "duration": "N/A", "pros": "Mission driven team with lots of energy", "cons": "Turnover and poor CRM affects workflow"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Make A Wish Internship", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Nov 2022", "job_title": "Intern", "duration": "N/A", "pros": "Friendly people to work with", "cons": "Requires you to be on-site weekly"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Nov 2022", "job_title": "Manager in Phoenix, AZ", "duration": "N/A", "pros": "Great mission which provides meaningful value to your work", "cons": "low pay for the work done"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Lots of Management issues", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Sept 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lots of back stabbing, idea stealing, management issues. If they cleaned up their act, it would be better like it might have been years ago.", "cons": "Short Staffed. Not enough money. People do not listen to ideas or steal them. People step on others to get where they want to be."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Nice", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2022", "job_title": "Administration", "duration": "N/A", "pros": "Great bosses, coworkers, conditions and many more", "cons": "Can't think of any cons honestly"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work! I love my job.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Aug 2022", "job_title": "Mission Delivery in Bethesda, MD", "duration": "N/A", "pros": "A wonderful team, DEI initiatives, hybrid work schedule, fantastic support from higher administration and peers, a caring workplace, and a great mission. I could not imagine a better place to work.", "cons": "On the lower end of financial compensation, not enough diversity (predominantly Caucasian workplace)."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A truly inspirational place to work!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Oct 2022", "job_title": "Anonymous Employee in Columbus, OH", "duration": "N/A", "pros": "Amazing mission with team that really cares.", "cons": "A lot of hours and some career path confusion."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Ehhh", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Sept 2022", "job_title": "Accounting Manager in Rockford, IL", "duration": "N/A", "pros": "A real feel good job. Plenty of people to connect with", "cons": "Pay sucks with a rotating door of employees. Took department being down 30% of our employees to even start helping."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Organization", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Aug 2022", "job_title": "Event Marketing Manager", "duration": "N/A", "pros": "Strong passionate individuals that work there. All the employees believe so strongly in the cause and truly love what they do! Excellent pay and benefits!", "cons": "Its hard to think of anything negative"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place but can improve", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 May 2022", "job_title": "Sales Development Representative in Phoenix, AZ", "duration": "N/A", "pros": "Great mission and great people, low morale sometimes makes the work days tedious. Ask how people are doing. I know the nature of the job is to help kids and their families who are ill, but internal work relations are important too.", "cons": "Needs more team morale and kinship. Look at more diverse candidates."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible Culture", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Sept 2021", "job_title": "Development Officer in Grand Rapids, MI", "duration": "N/A", "pros": "-Salary is strong to begin but no pay increase and no bonus\r\n-Wonderful donors and volunteers, seriously the best. \r\n-Great mission, the kids were the only thing that kept me sane.", "cons": "The culture is awful and it stems from the top. There is no professional development. No vision or strategic development. They only care about how many people are registered for the events and how much it raises. The staff in GR is mostly okay. Though a couple of the team members will stab you in the back at their earliest convenience and to cover themselves - you’ll know right away who it is. On employee went to HR on me because we had a disagreement about event set up - they’re still there. Beware. \r\n\r\nGossip city. Everyone talks about everyone behind their back. Most petty and unprofessional staff I’ve ever seen. \r\n\r\nYou will have your review include how people “feel” about you. And don’t try to defend yourself because they only believe the negative so they don’t have to increase your pay. \r\n\r\nI’ve heard of the C Suite staff being very inappropriate to staff members in hotel rooms because they have to share rooms. If you like gossip, stress, anxiety, and terrible leadership, this place was made for you."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great organization", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jul 2022", "job_title": "Regional Board Member", "duration": "N/A", "pros": "Great organization of people that strongly care about helping kids", "cons": "None currently come to mind"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great culture, average pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jul 2022", "job_title": "Director of Development in Raleigh, NC", "duration": "N/A", "pros": "Flexibility, supportive colleagues, meaningful mission", "cons": "Average salary, high staff turnover rate"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Such a great team", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 May 2022", "job_title": "Senior Manager", "duration": "N/A", "pros": "The team at Make-A-Wish truly cares about each other and the wish kids. It's like working with family rather than co-workers.", "cons": "Salary certainly takes a hit at a nonprofit."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Make-A-Wish", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jun 2022", "job_title": "Wish Coordinator in Chicago, IL", "duration": "N/A", "pros": "The people, culture and wish families", "cons": "Compensation and work life balance"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 May 2022", "job_title": "Senior Integration Specialist in Columbus, OH", "duration": "N/A", "pros": "Great mission\r\nFulfilling work\r\nGet to wear multiple hats and have many roles", "cons": "Difficult to grow\r\nLimited opportunities\r\nVery low salary\r\nCrazy hours/ stressful work\r\nHigh turn over"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Review", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2022", "job_title": "Anonymous Employee in Mountain Home, AR", "duration": "N/A", "pros": "Great place to work most of time", "cons": "Not so great rest of the time"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Energy", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good energy, kind people, decent benefits", "cons": "Like all non-profits, pay could be better"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Pretty Good", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Solid mission \n- Great coworkers", "cons": "- Compensation\n- Projects tend to change fairly often"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "It's a corporate mess", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Apr 2022", "job_title": "Community Manager in Bakersfield, CA", "duration": "N/A", "pros": "Get to help some wonderful families", "cons": "Leadership reap all the benefits and salary while the employees doing the work are not rewarded."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company, low pay", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company, met some of my best friends while working there.", "cons": "Low pay. I understand it's a nonprofit but the pay is not sustainable."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Apr 2022", "job_title": "Medical Coordinator in Riverside, CA", "duration": "N/A", "pros": "I love my job. Everyone is so nice and caring", "cons": "There are none at the moment"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Feb 2022", "job_title": "Director", "duration": "N/A", "pros": "The work Make-A-Wish does is incredible to be a part of.", "cons": "Having a National identity can be both a positive and a negative when raising money in local communities. It can be a struggle making sure people know that their funds support kids local to them when they make a donation"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "It’s ok.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Wish kids benefit from most of the work.", "cons": "Shockingly not what I expected."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Wish Coordinator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2022", "job_title": "Wish Coordinator in Boston, MA", "duration": "N/A", "pros": "Feel good about providing positive experiences for wish families", "cons": "There is a mental and emotional toll"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Mar 2022", "job_title": "Coordinator in New York, NY", "duration": "N/A", "pros": "It was a Great work environment.", "cons": "The pay was very low for a New York city based job."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Corporate Partnerships", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Feb 2022", "job_title": "Director in Stamford, CT", "duration": "N/A", "pros": "Strong brand, vision and mission for organization", "cons": "None at this time, thank you."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Salary", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2022", "job_title": "Corporate Partnerships Manager in Orlando, FL", "duration": "N/A", "pros": "Coworkers, training, the mission, partners", "cons": "Low pay, high turnover, little room for growth"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great mission", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission and pride in helping kids.", "cons": "Leadership is focused more on event/transactional giving than philanthropic support."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Incredible Organization.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Nov 2021", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The organizational mission \r\nThe organization values \r\nThe work collaboration and dedication \r\nLoyal, mission driven, hardworking employees, Trust in leadership and board\r\nEngagement and recognition \r\nBenefits, flexibility \r\nInclusivity \r\nProfessional growth", "cons": "Compassion fatigue may occur as we work to make wishes come true every day for amazing, strong, wonderful children battling critical illnesses"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Please, be aware of the negative reviews", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Aug 2021", "job_title": "Coordinator in Freehold, NJ", "duration": "N/A", "pros": "Wish families are incredible. They are faced with many struggled and yet are so grateful, even when their kids wish for something small.", "cons": "The turn over rate is so high because of employees being burned out, every fall you will see wish coordinators running away from the company. When many of us applied we all remember reading glassdoor reviews and seeing ones begging people to stay away from Make-A-Wish New Jersey. We disregarded thinking that it was one disgruntled employee. However, after our year of employment, many of us were leaving without any future job prospects.. thats how exhausted, mistreated and burned out we were. Please don't disregard the negative reviews. MAWNJ and many other chapters can get away with just letting their burned out employees leave because there is no HR presence in the building. They hire out HR and as a result there are no representatives of the company in the office. Those who are trusted to communicate with the HR company, don't in an honest way. They filter through the problems personally and determine if you are being honest enough to report it. Many people have tried to make reports, however almost none were successful. Those who were, went to the HR company directly, once upper management found out the employee was railed. Employees are yelled at, asked to work overtime for no overtime pay, and told to come into the office even when sick. It all stems from the top down and unfortunately change won't come to the NJ location until they stop avoiding accountability."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A feel-good organization you will work at for 1-3 years", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 May 2021", "job_title": "Program Team", "duration": "N/A", "pros": "Nice mission, nice people. They invest in team building and training, and are very transparent with strategic plan and finances.", "cons": "Company can rely too heavily on the mission keeping employees around and not invest in lowering turnover. Salary is very low for everyone except directors, and employees are expected to work a lot of evenings and weekends. Too much administrative work that sucks up all your time and feels pointless. For example, reviews happen 2x per year and are 8-10 pages of essay questions. Then, very little opportunities for compensation increase unless you are there for a long time and are promoted to a new role. Most people don't stay very long, their turnover is too high."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Strong mission", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I loved mission and the people I worked with", "cons": "Management wasn't always the greatest"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good Benefits", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits, thoughtful employee celebration", "cons": "Can be turbulent, frequent turnover"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Difficult work environment and toxic culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Aug 2021", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "Some really incredible people work here! There's great comraderie among lower-mid level staff. Truly love my coworkers.", "cons": "Senior leadership is ineffective and does not care about employee well being or mental health. The mission is secondary to cost saving and the children and families we serve are being affected."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Negative reviews are spot on", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing mission and rewarding work", "cons": "Experience is highly dependent on your immediate manager. Managers need more training and alignment with the mission. Credit stealing, lazy, incompetent managers should be outed and fired. Company lacks diversity in both socioeconomic status and ethnic backgrounds."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best Mission in the World", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Aug 2021", "job_title": "Senior Manager in Phoenix, AZ", "duration": "N/A", "pros": "- Supporting the best mission in the world (granting wishes for children with critical illnesses)\n- Lots of opportunities to learn and grow\n- Strong Brand (people love hearing that you work for Make-A-Wish)\n- Supportive work culture\n- Strong Leadership\n- FUN", "cons": "- Some teams are a little newer than others. I've personally found this to be a pro as you get to shape the direction of those teams, but this may not be for everyone."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing people doing amazing work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The company fosters a collaborative, uplifting, and driven work environment.", "cons": "There could be some salary increases."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Dec 2021", "job_title": "Business Development Assistant", "duration": "N/A", "pros": "Lots of SOPS. Clear definition of roles and responsibilities. Excellent mission.", "cons": "Not always open to change."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission, progressive corporate office", "cons": "Outdated software and processes, but working on updating"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "good place", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great place to work for", "cons": "have not much room to grow"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great organization with a wonderful cause", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Oct 2021", "job_title": "Development Coordinator in Dallas, TX", "duration": "N/A", "pros": "committed team, fun work environment", "cons": "challenging to move up in the company"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great mission - horrible management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Aug 2021", "job_title": "Coordinator in New York, NY", "duration": "N/A", "pros": "The mission\nThe kids\nOverall, you feel great doing the work", "cons": "Management has no idea what is actually happening - expect inexperienced young recent college grads to have uncomfortable conversations with stressed parents"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Business Transformation", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Organization is investing in technology to become more data driven and insightful - so that we can reach more kids, communities, and partners.", "cons": "Heavy meeting culture required for high collaboration and change."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Make A Wish", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Sept 2021", "job_title": "Information Technology in Phoenix, AZ", "duration": "N/A", "pros": "Great mission focus with an overwhelming passion to create hope.", "cons": "Extreme lack of diversity with slow moving progress."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great Organization, Little Room for Upward Mobility", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "24 May 2021", "job_title": "Nonprofit in San Diego, CA", "duration": "N/A", "pros": "Get to work for incredible kiddos and their families\r\nExtremely rewarding\r\nAmazing coworkers who also love their job", "cons": "Barely make minimum wage as a coordinator and manager positions are hard to come by\r\nWorth the pay for the first few years but the stress and emotional exhaustion of the job over time does not equal what you are being paid"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great people and mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jul 2021", "job_title": "Anonymous Employee in Bethesda, MD", "duration": "N/A", "pros": "The Mid-Atlantic office has strong leadership, passionate colleagues and does meaningful work.", "cons": "Org has been through some staff and structural changes in last two years, but has come through it stronger and with an improved and positive culture."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great team!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Aug 2021", "job_title": "Office Manager in Honolulu, HI", "duration": "N/A", "pros": "Amazing mission, flexible scheduled, best coworkers!", "cons": "No room for development. Dedicated a lot of free time to work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Aug 2021", "job_title": "Office Manager in Monroe Township, NJ", "duration": "N/A", "pros": "Great bonus days off, great coworkers", "cons": "Tough work life balance during busy times"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "meaningful work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits and paid time off", "cons": "Little upward mobility or salary negotiations"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Overall good company, chapters can be cliquey", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Jul 2021", "job_title": "Business Development Manager in Jacksonville, FL", "duration": "N/A", "pros": "The pay is commensurate. The job goal and purpose is fulfilling.", "cons": "The Chapters differ greatly and can be very exclusive and cliquey."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Special Events/Fundraising Coordinator", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jul 2021", "job_title": "Special Events/Fundraising Coordinator", "duration": "N/A", "pros": "- Mission & Overall Objective. \n- Engagement with direct staff members.", "cons": "- Employee breakdown and responsibilities unorganized."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "No room for growth", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 May 2021", "job_title": "Marketing Coordinator in Las Vegas, NV", "duration": "N/A", "pros": "Great team, amazing benefits, fulfilling work. The people is was makes the company amazing to work for.", "cons": "No room for growth. Non-profit burnout is real. Tasks continue to get piled onto your plate, but with no compensation or promise of upward mobility."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great Mission", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jun 2021", "job_title": "Senior Manager in Phoenix, AZ", "duration": "N/A", "pros": "inspiring and engaging mission with passionate employees", "cons": "none at this time to report"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Mission!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 May 2021", "job_title": "Volunteer in Denver, CO", "duration": "N/A", "pros": "Great Mission and wonderful people here. Interesting experience.", "cons": "Volunteer position, so no compensation available, but I knew that when I applied."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jun 2021", "job_title": "Learning And Development Specialist in Phoenix, AZ", "duration": "N/A", "pros": "Non profit but corporate resources", "cons": "Treated like a for profit"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 May 2021", "job_title": "Wish Coordinator", "duration": "N/A", "pros": "It was a great place to work. Management was thoughtful and caring. The work was inspiring.", "cons": "Pay was just okay but not fantastic."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Apr 2021", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Remote work is a wonderful option.", "cons": "Remote work is a wonderful option, but it would be nice to have a hybrid schedule available."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good mission", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "20 May 2021", "job_title": "Manager", "duration": "N/A", "pros": "Mission was great. Good work in community", "cons": "Nonprofit means many uncompensated hours"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 May 2021", "job_title": "Mission Delivery", "duration": "N/A", "pros": "Great company with great team members!", "cons": "Overworking team members at times"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "High turnover", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jul 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mission driven, friendly staff, remote", "cons": "Constant change, high turnover, salary"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "soooo goooood", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 May 2021", "job_title": "Student Worker", "duration": "N/A", "pros": "it was such a great time", "cons": "there are truly none of cons lmao"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great mission", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The Make-A-Wish mission is very emotionally profound and really sucks you in.", "cons": "The company takes advantage of those that feel connected to the mission with the insane workload and low pay."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "-", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2021", "job_title": "Junior Data Analyst in Hilversum", "duration": "N/A", "pros": "International small office and friendly colleagues", "cons": "very corperative environment and top-down management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Love the mission and team", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2021", "job_title": "Senior Manager, Mission Advancement in Phoenix, AZ", "duration": "N/A", "pros": "Great collaboration, strong mission and purpose, global network of chapters, impactful work", "cons": "limited growth opportunities, no career pathing, senior leadership is disconnected from the \"boots on the ground\" employees."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Burn-out", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "31 Mar 2021", "job_title": "Community Manager in Fresno, CA", "duration": "N/A", "pros": "Stay connected with wish families", "cons": "they'll sell out and burn you out"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to start career in fundraising", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Mar 2021", "job_title": "Development Officer", "duration": "N/A", "pros": "Trainings, knowledge, processes, systems in place, donor database", "cons": "Low pay, management was not strong at time of employment"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Mar 2021", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "Health benefits, flexible PTO, people, mission", "cons": "Non-profit salary can be low/capped"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Mar 2021", "job_title": "Business Administrator in Richmond, VA", "duration": "N/A", "pros": "Great environment and Great mission. Wonderful staff", "cons": "I do not have any"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great organization; subpar employer", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Mar 2021", "job_title": "Generalist", "duration": "N/A", "pros": "Great mission and mostly great staff", "cons": "Questionable leadership; inflexible strategic plan; lack of action on non-performers"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "It's all about the leader", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jan 2021", "job_title": "Development Director", "duration": "N/A", "pros": "Great Mission! New National Leadership seems to be on point.", "cons": "Local leadership was lacking - lots of pressure, with confusing agendas."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Feb 2021", "job_title": "Outreach Staff in Phoenix, AZ", "duration": "N/A", "pros": "The mission and the team", "cons": "Can't think of many cons."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Commercially challenging", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Jan 2021", "job_title": "Anonymous Employee in Richmond, Victoria", "duration": "N/A", "pros": "You are working to make sick kids lives better, great content, great cause, great brand reputation", "cons": "Risk-averse which limits commercial and fundraising opportunities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Resource Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Feb 2021", "job_title": "Resource Coordinator in Phoenix, AZ", "duration": "N/A", "pros": "Fun teams in the organization", "cons": "Priorities can be challenging to determine"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Heart warming", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Dec 2020", "job_title": "Medical Outreach & Wish Volunteer Coordinator in San Juan, PR", "duration": "N/A", "pros": "Full filing experience, you get to work with kids and put a smile on their faces", "cons": "Low salary. Family dynamics are hard to deal with sometimes."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jan 2021", "job_title": "Development Manager", "duration": "N/A", "pros": "work life balance and mission driven", "cons": "difficult to move up in organization"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work!", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Jan 2021", "job_title": "Major Gifts Director in Blue Bell, PA", "duration": "N/A", "pros": "Vital and important mission; collaborative and teamwork atmosphere.", "cons": "There are not any cons."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working with family", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jan 2021", "job_title": "Assessment Associate in New York, NY", "duration": "N/A", "pros": "supporting, encouraging, flexible. positive, comforting", "cons": "Constantly updating due to COVID."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Wonderful mission", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jan 2021", "job_title": "Wish Coordinator", "duration": "N/A", "pros": "Work with amazing, caring people", "cons": "Little chance to move upward"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Good til it's not (Metro NY and Western NY Office)", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Nov 2019", "job_title": "Manager in New York, NY", "duration": "N/A", "pros": "Amazing work is done at this organization. If you want to make an impact on a child and their family's life then I recommend working here but consider the cons section as this is not a solid and reliable income unless you're quickly favored by management. Amazing name recognition for your resume.", "cons": "No room to be creative, and consequently not much room for individual growth.  This particular office was not interested in hearing new ideas.  They're a bit disorganized and have a large physical-to-digital disconnect. \r\n\r\nAdditionally, new management and corporate restructuring have created a high turnover culture. If you don't know how to perfectly interrupt what your supervisor is asking you to do then they will let you go. They may say they like questions, but if those questions question their method then you won't last long here. MAW knows plenty of people would work for them and they can fill your role quickly. \r\n\r\nFunding also isn't consistent for all roles.  Another note on funding: They accept funds from any and all donors no matter how problematic that donor may be with the rest of their money. Questionable media organizations , Multi-million dollar corporations etc. If you want to remain consistent in your values, don't work here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Best Office Culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Oct 2020", "job_title": "Anonymous Employee in Blue Bell, PA", "duration": "N/A", "pros": "I loved working there. It was a pleasure coming to work and was eager to start my day. The employees were awesome and so supportive starting from day one!", "cons": "No cons. I loved my time there."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Dec 2020", "job_title": "Wish Coordinator in Spokane, WA", "duration": "N/A", "pros": "Amazing work environment, great benefits and PTO, inspiring mission", "cons": "Nothing I can think of"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Best intern", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Dec 2020", "job_title": "Intern in Dallas, TX", "duration": "N/A", "pros": "Great company culture was great", "cons": "There was no cons all"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Salary", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Dec 2020", "job_title": "Coordinator in Urbandale, IA", "duration": "N/A", "pros": "Flexible schedule, amount of PTO", "cons": "Poor communication from leadership, low salaries"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great company, little growth or opportunity", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Nov 2020", "job_title": "Coordinator in Toronto, ON", "duration": "N/A", "pros": "nice people and a nice mission", "cons": "low salary, not competitive, not much professional growth or additional opportunities"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great mission, great people, but limited opportunities for career growth", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Some outstanding colleagues who are generally very approachable. Incredible mission, opportunities to engage with and volunteer with the local chapter(s). Inexpensive healthcare, great, central location. CEO is outstanding: kind, genuine, caring, frugal and is invested in appropriately stewarding all constituents including staff, donors, volunteers, wish families and just people that are curious about the organization. He is very involved and takes a lot of time simply to thank people and sincerely learn about their interests, passions and motivations.", "cons": "Unfortunately, the CEO's leadership doesn't always trickle down and there are eternal power struggles, structural readjustments and maneuverings, some people in leadership roles that aren't really competent in their positions and manage their staff poorly. Compensation is average at best for the majority of staff (even in the non-profit sector) and there aren't career paths or opportunities for upward mobility. So many meetings for the sake of meetings and initiatives that distract from the mission of the organization. Many silos and cliques. Work is disproportionately distributed even amongst the same title grade."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Make A Wish of Metro New York and Western NY", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Wonderful cause. \r\n- Generally, a happy place to be.", "cons": "- As much as management pretends to care about you both as an employee and an individual, they don’t. They don’t give you the tools you need to succeed in your position and then blame you for everything that’s going wrong. \r\n- Senior management has been at the organization long enough that they should realize a pattern, it’s not the people you’re hiring that can’t perform, it’s the illogical way you’re trying to run this organization.  \r\n- HIGH turnover rate. About 10 people were fired/left this year alone. \r\n- No HR department. HR ‘rep’ is COO who is part of the problem and very friendly with people whom you would like to make complaints about. \r\n- Low pay and few vacation days/holidays. \r\n- Expect you to work a crazy amount of hours (evenings and weekends) to get to their goal of wishes."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Nov 2020", "job_title": "Learning And Development Specialist in Phoenix, AZ", "duration": "N/A", "pros": "Good people, fair salary, purposeful work", "cons": "not very diverse in stafff"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Organisation helping a good cause", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Sept 2020", "job_title": "Marketing Volunteer", "duration": "N/A", "pros": "People were very helpful and wanted the best for you. Would answer any questions or concerns. Good experience", "cons": "I did not encounter any"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Wonderful Organization", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2020", "job_title": "Wish Coordinator in Irvine, CA", "duration": "N/A", "pros": "Work in a life-changing environment", "cons": "Minimum wage job with little room to grow"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "It's not what you think.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Jan 2018", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Wonderful mission that people care about", "cons": "People at Make-A-Wish America (the corporate headquarters) are really passionate about the mission, which is great. However, you would think feeling fulfilled in your career would make you happier as a human being. I have never met so many horribly mean, insensitive, angry, and stubborn people in my entire professional career. Upper management will make mistakes and then put the blame on lower level employees, constantly making the lower level employees feel horrible about things that were absolutely not their fault. If you are new to the organization, prepare to be stepped on over and over again. The people that have been at the organization for more than 5 years are basically a cult that rule the office and make everyone else miserable. The office atmosphere and culture is completely outdated and old fashioned. Prepare to follow rules that were made almost 40 years ago. There is so much red tape and absolute nonsense and nothing you can do to change any of it. Prepare to drown in red tape. It also follows the typical non-profit environment of not having enough resources. You will work overtime, work through your lunches, work weekends, and no one will thank you. Because every single person to forced to do it because every team is so understaffed."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The National Office is full of BS", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Dec 2018", "job_title": "Manager in Phoenix, AZ", "duration": "N/A", "pros": "The mission is incredible and the local Chapters are amazing to work with.", "cons": "Extreme lack of diversity and inclusion, which is apparent by the employees they choose to highlight on the company page (majority female, white, millennial). Leadership at the National Office  are terrible and use the mission to hide behind poor decisions. They do not know how to engage employees or foster a positive working environment, which contributes to high turnover and low employee morale.  Majority of operational leadership at the National Office come from American Express and run it like a dysfunctional call center. You must play the political game & drink the koolaid to become a \"favorite\" if you want to receive development opportunities, be recognized for going above & beyond, or grow within the organization. If you don't play the political game, or if you decide to speak transparently about ongoing issues, you are completely excluded."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wish Manager", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Oct 2020", "job_title": "Wish Manager in Greenville, SC", "duration": "N/A", "pros": "Granting wishes of children with life-threatening illnesses", "cons": "Benefits, low salary, and volunteers"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best \"job\" I've ever had!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Mar 2018", "job_title": "Office Coordinator in Phoenix, AZ", "duration": "N/A", "pros": "There are so many wonderful things about working here. I have been here for over two years, now, and have progressed and developed like no other. I don't know what that comment \"It's not what you think\" is talking about because the majority of everyone here is anything BUT mean. That specific person must be mean themselves and perceive everything wrong because I have worked several places prior to here and have never met so many happy people who LOVE THEIR JOB! Just in the two years I've worked here they have taken the responses to the employee surveys and ACTUALLY DID SOMETHING ABOUT IT. They make changes when necessary and are open to new ideas, especially from the younger crowd. Please, don't let that one comment from one angry ex employee differ you. The benefits are wonderful. The work itself is fulfilling. The people are fantastic. I have never enjoyed my job before coming to MAW.", "cons": "There, of course, are some downsides to this job, but it's the typical office drama. There are a couple people who feed into it and I'm sure there are a couple managers who hold their employees down, but, FOR THE MOST PART, hard work is appreciated and acknowledged daily."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great Mission, Poor Hiring Choices and Very Bad Management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Jun 2013", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "I worked at Make A Wish Foundation of America full-time\r\n\r\nPros – The mission is the big driver here -- employees care about it and give their all. The organization has a great public image and is a champion fundraiser, but this covers up what goes on behind closed doors.", "cons": "Cons – The problem is with upper management -- there is considerable lack of distrust between employees and management. Upper management (not all direct supervisors) changed staff performance reviews without telling staff members. Staff are not treated well if you are not a favorite of the VP's. Staff are underpaid whereas management staff are taking home HUGE paychecks by comparison. Bonuses are provided based on favoritism, not performance. This is not an equitable work environment -- staff are very unhappy and there is a high turnover rate in the area of Development especically."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great mission - but left a really bad taste in my mouth!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "MAWC has an amazing mission and it is run with wonderful volunteers.", "cons": "The payscale for positions are not equivalent to other similar charities in Canada.  New hires tend to be young and inexperienced and will be under-payed -- all with the promise of promotions in their near future.  Don't believe it --- promotions will take about 10 years to appear, and usually after a job that someone has left has been foisted on you (and they have not filled) AND with no title or pay raise.  People leave because they will never be promoted, mentored, or recognized for their contributions.  It's stagnant."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Hard NO on working for the National Office", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Dec 2017", "job_title": "Consultant in Phoenix, AZ", "duration": "N/A", "pros": "CEO communicates regularly to staff on upcoming events and status of the organization.", "cons": "CEO's lack of involvement with Executive Leadership Team and who is hired and who leaves has changed the National Office from a great place to work to a complete disaster. Some of the executive leaders are finally retiring but the national office has hired several unqualified and unprofessional Managers and Directors that rule by authority and create a stressful work environment. If job stability, advancement opportunities and friendly work environment are important to you, the National Office at Make A Wish would not be a good choice. It might sound good but after a few months, you will realize you made a huge mistake accepting a job working here."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "The most poorly mismanaged organization you will ever work for! It is tragic.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great Mission,  amazing Wish kids and awesome  wish granters.", "cons": "The CEO, COO AND Program Director are all from an auditing or banking background with zero non profit experience.  Leadership is an oxymoron; a knee jerk reaction to whatever shows up on the radar that day, versus a thoughtful, well planned long term strategy. The CEO is an egotistical self absorbed fake. Senior leadership does not care about nor appreciate their people, mostly because they have no idea what people’s jobs actually are; secondarily, because they simply don’t care. They just care about protecting their very high salaries and bonuses ( which the CEO flaunts in front of lesser paid staff). This leadership team has created a toxic culture by letting the CEO run rampant, damaging relationships and angering new and longtime donors and supporters. The Board is naive and ineffective. All in all, it is a tragic situation and undeserved as Make-A-Wish is an amazing organization."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Solid mission but Horrible Management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Jan 2018", "job_title": "Analyst in Phoenix, AZ", "duration": "N/A", "pros": "They have a great mission but could accomplish more if they didn't overspend,", "cons": "Many but I'll list a few.  Horrible Directors and above. No job stability with very high turnover. Around 80% of their employees have been there less than 2 years and this is due to very poor leadership and no loyalty to their employees. They have terminated an entire department in a day leaving with no notice to the employees leaving ppl without jobs. I would not recommend working here. If you look at any of the job sites, MAW is always hiring and there is a reason for this. Again poor leadership and the buck stops with the CEO. David Williams has done a horrible job running the National Office. He is a nice guy in person but can not lead an organization.  Don't be fooled by the mission. If  career longevity and job stability is important to you, then this would not be a good career move."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "They take advantage of hopefuls", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Apr 2018", "job_title": "National Office- Analyst/Specialist in Phoenix, AZ", "duration": "N/A", "pros": "Free coffee, I guess. Benefits are fair. PTO is generous.", "cons": "Oh where to begin.\r\nOverworked and underpaid and highly patronizing. Everything is last minute. No one takes accountability. ESPESCIALLY not leadership. Top execs are rarely in the office and when they are they’re having personal meetings. \r\n\r\nFor what the org does, you’d be amazed at how arrogant, selfish, lazy, and incompetent these people are and it is so engrained in the culture  Employee recognition is a joke- they’re grasping at straws to keep people at the org instead of actually listening to what leaving employees say. They make it look like they’re listening with “feedback” teams but nothing ever actually changes. \r\nThey use something called kudos for employee recognition and it’s basically a popularity contest- the same handful of people get the monthly award.\r\nUnless you’re a senior manager or above, they treat you as indispensable. There’s no appreciation for the work you do, and if it’s good work your supervisor will take credit for it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Misery between 4 walls. Worst area is Compliance by far", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Jan 2018", "job_title": "Senior Management in Phoenix, AZ", "duration": "N/A", "pros": "Great mission for those kids who are able to have wishes granted.", "cons": "Sadly, currently there are many dysfunctional areas within the National Office in Phoenix but I would say the most dysfunctional area to work in would be Compliance. They have been an internal department, outsourced, brought back in house and have changed directors all in only the past 5 years. I would say now unfortunately, its the worst it has been over the 5 years I've been with Make-A-Wish. I believe the reason for this is ineffective executive leadership and the CEO not being involved. If you are looking for job stability, i would highly recommend looking at other areas within the National Office as I don't predict it will get much better. Other areas definitely have their share of problems but nothing like Compliance. Good Luck !!!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "CEO is in it for personal gain and doesn't care about the kids and wish families", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The mission is impressive and the Program Teams truly care about the wish children being served.", "cons": "- The CEO (Siana Hunt) is only in it for personal gain\r\n- She uses the corporate credit card like it is her own personal loan or ATM\r\n- There are huge disparities not only in salary and benefits but also treatment of employees between the Wish granting staff vs. the Development staff\r\n- the development staff makes more than twice as much as the program teams\r\n-There are major compliance issues here but everyone looks the other way because of fear of losing their jobs and being slandered in the community\r\n-The org loses 1-2 employees a month either by being fired, being pushed out due to ill treatment; The chapter turns over half of it's staff each year due to the CEO\r\n-chapter was in an over $400K deficit for 2017!!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wonderful culture to work in, feeling of unity and passion for the mission across all the departments", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Friendly people who are always willing to meet with you and talk about career possibilities no matter what position they are in, young lively office, you can tell everyone's heart is in the mission and go above and beyond to try to make the best experience for the children and families, the culture of the office is great! As an intern  you meet with the various directors so you get an overall understanding of how the foundation operates instead of just the specific department you are working in.", "cons": "Smaller office so not many job openings. As an intern the tasks they give can get repetitive, not much variation in what you get done and there is not much work with the families or children. Interns are only there for a semester so they turnover rate is pretty high in that aspect."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inspiring Work Every Day", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Mar 2018", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "I have found Make-A-Wish America to be the most rewarding work experience in my 13-year career. I work on a team that is passionate, focused, funny, and encouraging. To top it off, everything we do comes back to our mission of granting life-changing wishes for children with critical illnesses. I have had a pleasant experience with just about everyone I've collaborated with, and it feels like most people who have been here awhile are open to innovative change.  I am also trusted to work independently. It is an exciting time of change for the organization, which adds to the motivation of doing high-quality work.", "cons": "With Make-A-Wish being a nonprofit, some of the frills you might find elsewhere (more current software platforms, for example) are not here yet, but it sounds like upper management is genuinely open to hearing ideas of how we can do our jobs more efficiently to help achieve our mission."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Ignorant Hiring", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The mission is very motivating, however working there made me realize that I would much rather be a volunteer than spend my career there.", "cons": "There is a huge amount of turn-over at Make-A-Wish, and the reason is apparent once you have worked there for a couple months. They hire many individuals with what seems to be little care or thought at all. The Senior Leadership Team is also very elitist for working at such a small company. There needs to be a major overhaul in leadership (including with the CEO, who doesn't seem to have many new ideas or innovative suggestions for the future). They need to catch up with the millennial generation or they are going to fail."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Horrible place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Dec 2017", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Knowing you work for an organization that grants wishes to sick children.", "cons": "I've worked for Make A Wish for many years and have seen it crumble in terms of poor executive leadership, loosing really good people and replacing them with people with bad attitudes and poor judgement which has led to overall very bad morale among the employees. Human Resources tries to show they are addressing the many problems within the national office but it's just a smoke screen. Very poor job stability and no long term growth. Some of the executive leadership team are finally retiring and the others were hired in from a credit care company.... There are too many disadvantages to working for the National Office that there is not enough space but areas to avoid are human resources, CFS,  anything job that involves finance or compliance I would highly recommend avoiding."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "MAW New Jersey Nightmare", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Feb 2020", "job_title": "Coordinator in Monroe Township, NJ", "duration": "N/A", "pros": "Great mission, Great staff,  and great building", "cons": "The Senior management is out of control and has hired an additional senior management, who is just a puppet and a babysitter so he can not show up to work.  His fits of fury and criticism is intolerable.   He finally did something right and fired one of his senior managers of Mission but then as usually made a bad decision and promoted her mini me into that position.   The new managers has no people skills and is only concerned with saving her job.  She is cold, cruel and calculating.  She should have been fired with the former  VP."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "CEO", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Jan 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Incredible Mission and beginnings of the organization. Managers, coordinators, support staff and interns truly believe in Mission and work towards it.", "cons": "Low pay for all employees in a manager’s position or lower; chapter’s leadership team pretends to care about staff but little or no real recognition; high employee turnover with no efforts from anyone from the leadership team acknowledging nor making anything efforts to stop or minimize it; large gap in salaries between leadership and manager positions and below; no room for growth with zero opportunities for professional development or career growth. CEO and 1 or 1 members of leadership team attends yearly national conferences with no one else allowed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Those that work in our organization share a deep-rooted passion for our mission which is to make wishes come true.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "1. Passion of our fellow employees to our mission\r\n2. Seeing the joy of the children we serve when their wishes come true\r\n3. Commitment by our management to improve our efficiency and our ability to grant even more wishes", "cons": "Despite the great work we do, it's heartbreaking when we hear about wish kids who pass on. Although some wish kids are able to fully realize full, adult lives. Some don't."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "So Much Potential-only if...", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing organization. Mission is wonderful. Not all chapters are alike - some smaller, some larger.", "cons": "Larger chapters lose sight of the mission and focus on numbers instead, resulting in a lesser-quality wish. Certain departments are understaffed,  \"stepford-like,\" and micro-managed. Pay is insultingly low given weight of caseloads.High turnover rate."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Make-A-Mess", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Apr 2016", "job_title": "Anonymous Employee in Brighton, MI", "duration": "N/A", "pros": "Some of the most kindhearted entry level staff and volunteers I have ever had the pleasure of knowing. The mission is worthy of good leadership.", "cons": "Employee moral is crazy low. The rate of turnover is so incredibly high - even middle managers don't last because they see the dysfunction of the leadership team. HR is a total joke - to the point of basically breaking the law with information shared with other employees. The CEO? Give me a break. Absolutely NO experience leading a multi-million dollar organization. Her idea of professional development and coaching is 'Be grateful and read Brene Brown books.\"  The decision-making model is completely lost on this group of managers. What should take 6 weeks takes 6 months. Everyone is afraid to speak their minds because of fear. Do not work here."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "MAWFA", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Nov 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "MAWFA offers lots of great benefits, a mostly friendly upbeat environment, and any interaction with Wish Kids, Families, or volunteers is heartwarming.", "cons": "Very little training was provided despite constant promises to the contrary, number of hours allowed (not salaried) does not allow for amount of work that needs to be completed at the quality it needs to be completed at. Unrealistic standards, and the HQ is very removed from the work with Wish Families which makes Wishes seem trivial as compared to the families' mountains of debts or other long term needs/concerns."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great learning experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Feb 2011", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Working for the MAW Foundation is very rewarding and I loved knowing that I was making a difference in the lives of wish kids everyday through my hard work.  It's a small office so it's a pretty tight knit group and everyone works well together.  The hours are pretty flexible and most employees do not stay too late into the evening.", "cons": "Like many non-profits, the amount of work that employees put in to the Foundation far exceeds the monetary compensation that is received in return.  You really have to love what you're doing."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Poor leadership at national office", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great mission and many dedicated team members.", "cons": "Horrible senior leadership at national office lead by a COO who has no business leading people. Most senior leaders come from American Express and will complain about the culture that they left, only to have brought it with them. The lack of concern for those who are actually trying to support chapters is disturbing. The class system between the “SLT” and the average employee leads to tremendous turnover, especially among experiences hires. Hopefully the new CEO will clean out the AMEX clique and get this place doing what is should be doing. I saw many talented individuals at all levels recognize this quickly. Most experienced hires bail starting at the 6-12 month mark."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Mission, wonderful experience for young professionals", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Apr 2012", "job_title": " in Phoenix, AZ", "duration": "N/A", "pros": "1. The Mission- the kids and families are what keep people inspired to work here\r\n\r\n2. The Company Culture- telecommuting is a valid option here- many National Office staff work remotely, staff are encouraged to take your vacation time, flexible schedules when needed, overall management is very accomodating to staff needs\r\n\r\n3. Great Brand- it is exciting to work for such a wonderful organization and you can proudly represent the brand because the mission really is helping families during a diffcult time. Make-A-Wish staff and volunteers operate with a lot of integrity. \r\n\r\n4. Job responsibilities- as a young professional, you are given an opportunity to handle a lot more than you would at a regular corporate job in the for-profit world. There is tons of work and if you are willing to take on projects you can get some great experience.", "cons": "1. Tension between National Office and International Office.  Also, sometimes tension between Chapters and National Office, although those problems have started to fade in recent years. Every Make-A-Wish office is its own seperate 501(c)(3), which makes for an \"every office for themselves\" mentality.  The structure needs to change for cooperation to continue. Leadership can preach the \"Power of One\" message, but unless the organizational structure changes there will always be the need to take care of your own chapter first before helping others. \r\n\r\n2. Change is slow moving.  People at Make-A-Wish are sometimes afraid to ruffle people's feathers. Everyone wants to be the \"nice guy\", which causes staff to dance around problems instead of facing them head on. \r\n\r\n3. Promotions are scarce- you have to work at Make-A-Wish a very long time to get promoted to the senior manager, director or VP level.  If you are okay with being an assistant, coordinator or manager forever you'll be happy here. \r\n\r\n4. Salary & Benefits are just okay. Because the promotions are scarce, you don't move past your annual 3% raise each year which can be frustrating. Heath coverage for employee is at no cost, which is great, but if you want to add your spouse or kids to the plan be prepared to pay a premium.  They do offer 401k matching, short term disability, long term disability, etc."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great disappointment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 May 2016", "job_title": " in Trumbull, CT", "duration": "N/A", "pros": "Wonderful mission with wonderful volunteers\r\nWish Managers are the heart of the organization\r\nExternal events based on fun and inspirational stories\r\nWork is easy and rewarding", "cons": "Non-diverse team - management hires friends with little experience or skill to fill key roles\r\nNot a good environment for high-performing employees\r\nManagement is ego-driven rather than driven by passion for the mission \r\nUnfair and retaliatory employment practices\r\nManagement lacks wisdom and is not trust worthy \r\nImmature social/ work environment\r\nInconsiderate co-workers\r\nLack of team integration\r\nNot an inclusive culture\r\nWork is not challenging"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Outstanding Organization that Cares for its Employees.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Jan 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Make-A-Wish Illinois provides an amazing opportunity to utilize your professional skills to directly advance a mission that is impacting the lives of children and families who are battling critical illness. Adding to that, Make-A-Wish Illinois invests in my future as an employee. I have been given access to amazing professional development and have been given great growth both in terms of rewards and opportunities. This is a company that truly cares about people.", "cons": "No downsides! I truly think this is an amazing place to be. Couldn't be happier with my career at this point."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Exciting time, positive changes!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Jul 2018", "job_title": "Director in Phoenix, AZ", "duration": "N/A", "pros": "Great mission, new HQ building, passionate staff.   Significant turnover recently signals big changes and isn't necessarily a bad thing, despite what you may read in some of these reviews.  David Williams is a wonderful leader and has had a good run with the organization but his departure will lead to continued evolution of the brand, culture and mission.  Its a good time to join the team and ride the wave of change!", "cons": "Limited resources, complicated federated model, unique culture that isn't always easy to navigate."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Really great organization", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Sept 2015", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Nothing gets better than the mission of Make-A-Wish! In general, the work is very rewarding, the employees are very nice and smart, and the company culture is relaxed. The CEO is very genuine and humble, which is refreshing.", "cons": "There are some issues at the SVP level that the CEO, despite his many good qualities, won't address. Turnover is higher than the average nonprofit, likely because of this, but also because compensation isn't especially competitive. Also, if you work at HQ, it's in Phoenix-- it's hard to attract good talent to the area without compensating them for it...."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "One of America's most iconic brands is poised for more growth", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Dec 2018", "job_title": "Director in Phoenix, AZ", "duration": "N/A", "pros": "In my 4+ years at the National Office in Phoenix, I've had the privilege to be part of an exciting cultural and brand transformation. This includes a talented and highly sought after new CEO joining the organization, the establishment of a professional, disciplined strategic project management and data analytics team, the launch of a number of award-winning and highly successful digital campaigns, and a data-driven brand re-positioning and visual refresh . I've particularly  enjoyed the opportunity to interact and learn from Make-A-Wish's Fortune 500 corporate partners and national board members. Being able to network and learn from C-suite executives at companies like Disney, Airbnb, Subaru, Southwest Airlines, TopGolf, Lokai, Mozilla, etc. is an opportunity few jobs offer. Most of all, my interactions with the mission and specifically wish kids and their families has been an experience without peer. It's also been exciting to see the medical community in the U.S. and Europe release new research opening the door to the possibilities that wishes have medical and financial benefits.", "cons": "The biggest disadvantages about working for Make-A-Wish is the fact that a majority of Americans incorrectly view it as a last wish or a dying wish only for terminal kids, when in fact for many of the  wish kids, a wish serves as a catalyst to better health. While this is an exciting marketing challenge, the organization is not currently equipped with the resources to adequately address this opportunity. Like most nonprofits, Make-A-Wish currently (December 2018) employs a \"do more with less\" philosophy, which can be frustrating at times. \r\n\r\nThe organization has also been experienced significant culture change over the past four years, due in part to growth and an influx of new employees. Make-A-Wish is still grappling with this change, and is still in the process of determining what kind of culture it wants to embody."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "I thoroughly enjoyed my time working for the Make-A-Wish Foundation.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Mar 2012", "job_title": " in Fort Worth, TX", "duration": "N/A", "pros": "As an intern with the Make-A-Wish Foundation in Dallas and Fort Worth, I learned a great deal about non-profit \"life\". I had an incredible experience overall: both offices treated me with respect and courtesy, always had important work for me to accomplish, and took time to write recommendations for me at later dates.", "cons": "The internships were unpaid, which made it difficult to spend a significant amount of time at the office. I had to balance a second job with my internship."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Community Director", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Sept 2017", "job_title": "Director of Community Development in Fresno, CA", "duration": "N/A", "pros": "You can have somewhat of a flexible schedule but be prepared to work overtime at a moments notice. This job is project driven.", "cons": "Not a lot of support from the Board or Executive Director which can make it hard to be competitive for donor dollars in the community. Must be able to work independently with little resources for development. A lot of administrative work with no assistance."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "MAW to Made a Mistake taking this job", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Nov 2017", "job_title": "Senior Project Manager in Phoenix, AZ", "duration": "N/A", "pros": "Location  , underground parking, free coffee and ice cream.", "cons": "Very poor and delusional leadership in the National Office. Hiring process for Managers and Directors is unbelievably poor for an organization of this size. In some cases, they interviewed only one candidate for Director positions and they were external candidates. Don't believe their \"we hire from within\" philosophy. Most of the Directors and Executive Leadership Team have come from other companies. not all but some.  If you do decided to roll the dice, I would avoid any position that works directly with the chapters such as Chapter Advancement, Compliance or CFS. If you really want to work with Make a Wish,  I would recommend working for a Chapter"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Metro New York and Western New York Chapter", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Sept 2014", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "There are a lot of feel good moments knowing you are granting the wish of a very sick child. And the employees generally have hearts of gold. This is one of the best nonprofits in terms of national management in the country.", "cons": "Not much room to be creative, and consequently not much room for individual growth. Make-A-Wish is very good at what they do and has been for years. This particular office was not interested in hearing new ideas."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Development Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Oct 2015", "job_title": "Development Intern in El Paso, TX", "duration": "N/A", "pros": "Great learning environment, organizational culture, and overall purpose! The Development Director in my office was very invested in helping me learn.", "cons": "The office space is fairly small.  Additionally, since it is a non-profit, the interns are not receiving any compensation.  If one is looking for a paid summer or semester internship, this would not be the company to apply to."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Awful place to work full where managment treats employees like garbage", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Jun 2018", "job_title": "Mid-Level Manager in Phoenix, AZ", "duration": "N/A", "pros": "The only pro are the scraps they leave lower level employees after meetings.", "cons": "Management rule as dictators and berate employees. CEO turns a blind eyes and lets management do what they want. Very high turnover because employees finally get tired and realize that even though the mission is wonderful, the treatment by management isn't worth it. David Williams turns a blind eye and doesn't care or do anything. He only protects Executive Management and Directors. By far the two worst areas to work are Compliance and Chapter Advancement. If you decide to roll the dice, Information Technology and Business Operations are the only two areas that are decent. Avoid, avoid, avoid. Notice they are constantly hiring. There is a reason for that."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great starting place", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 May 2009", "job_title": " in Pittsburgh, PA", "duration": "N/A", "pros": "In Pittsburgh, the MAW office there has a great team in place, fabulous office, excellent CEO, friendly staff and free beverages! It was an absolute joy going to work everyday and gave me unique insight into how a non-profit works. Everybody there was helpful (don't hesitate to ask questions) and approachable. Little (to none) in-house politics or cattiness.", "cons": "I mean, it is a non-profit so the pay isn't great and the chance for advancement is little to none since turn over is non existent."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Volunteer, but don't work here!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Jan 2020", "job_title": "Anonymous Employee in Brighton, MI", "duration": "N/A", "pros": "Great mission, non-leadership employees mean well for the most part", "cons": "Leadership is nonexistent, new ideas and viewpoints are shot down, employees disciplined for speaking up (including when managers and above have crossed the line and been inappropriate with staff), must share hotel rooms with staff members - even your Manager/Director. EXTREMELY high turnover rate. There are no opportunities for growth in your career or for personal development. You'll be pressured to give not only your time and sanity, but also through your paycheck because leadership \"wants to be able to say that 100% of staff gives back to the organization\"."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "It was ok.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Apr 2012", "job_title": "Volunteer Coordinator in New York, NY", "duration": "N/A", "pros": "The Organization does amazing things.  I was proud to be a member of their organization.  The office I was in had wonderful people working there.", "cons": "Wish Coordinators are expected to work very long hours and have case loads like social workers.\r\nThe office I worked in wasn't fair regarding promotions.  If you were liked you got promoted, if not, then you weren't promoted."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Creative Services Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I loved working as an intern at Make-A-Wish. I was always busy doing things that actually benefitted the company rather than chores that are intern stereotypes. The brand advancement team was helpful, funny and never afraid to give you feedback. Make-A-Wish also provides intern activities that foster interpersonal connections, lunch with the CEO and plenty of networking opportunities. They're open to new ideas that could be implemented and treat interns as full-time employees rather than disposable staff.", "cons": "Sometimes the office was boiling hot, others freezing cold. Some of the software should be updated; it feels like some of it is from 2005."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Make-A-Wish Arizona", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Extraordinary mission, vision and values. Well managed organization with committed, caring people. Supportive, effective working board of directors. Employee-driven culture. Having a singular mission (to grant wishes) creates a rallying point for a staff of varying backgrounds, and reduces mission uncertainty/mission creep. Well-funded programs allow for creative mission fulfillment and employee retention. The Arizona chapter is the founding chapter of the organization, which means tremendous pride in the \"flagship\" status. The office being in the same region as Make-A-Wish America (the organization's corporate HQ) means easy access to top decision makers and opportunities for closer partnerships and pilot programs.", "cons": "Some stasis on the executive team, the downside of low turnover. The CEO is retirement age, but having turned the chapter around from under performing to top performing in her tenure, she rests on her laurels. While the staff is empowered to innovate and bolster the culture, the CEO sits in her office and plays on her iPad and asks donors and board members for personal favors. It's this former employee's opinion that all favors should be reserved to support wish granting programs, not the CEO's family and personal life. There is a bit of a \"mean girl\" culture in the C-Suite, with the Chief Development Officer and CEO often in personal conflict that can be felt throughout the office.  \r\n\r\nThere is a culture of body and food shaming, an unfortunate reality at an organization dedicated to serving ill children. The CDO has been heard making multitudes of comments about employees' body shapes and sizes as well as work apparel and diet. It can feel quite hostile and personal.\r\n\r\nThere's tension among the generations, with some Baby Boomer aged people openly making negative and stereotype-based comments about Millenial aged staff members, specifically on the fundraising team. Young talent has turned over because of the perceived pressure to \"stay in line\" and not show initiative or ambition, which are read as threats by older staff."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great mission, less-than -stellar leadership", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Nov 2012", "job_title": "Development Manager in Albany, NY", "duration": "N/A", "pros": "The mission is undeniably great.  Tt is a chance to work with children and families.  Lots of support from the Central office.", "cons": "Chapters are ruled by CEOs who often have a limited grasp of fundraising.  If you are a serious fund raiser, you may get tired of the disrespectful attitude toward fundraising, cronyism, and lack of performance metrics."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inspiring Mission and Amazing People! (National Office)", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2020", "job_title": "Senior Project Manager in Phoenix, AZ", "duration": "N/A", "pros": "* Stellar Leadership: From the Director level all the way up through the CEO, the leadership at Make-A-Wish is empowering, supportive and inspiring. We are in an amazing period of growth and change (challenging the status quo) and because of the leadership, we feel empowered as staff to be part of that change.\r\n\r\n* The People: Every single person I work with is dedicated to the mission, assumes best intent of their fellow staff member (making a culture of collaboration and support),  and provides extremely high quality of work. They also are genuinely nice and caring about each other as people. This may sound like a small thing, but it's so refreshing and makes it feel even more like we are one big team, working together to achieve the same goals and vision. \r\n\r\n* The Mission: It's so nice at the end of the day to be part of a mission to grant wishes - bringing hope and joy to our wish kids and their families. I hear at least one story a day that makes me beam with pride that I get to be even a small part of that.\r\n\r\n* Education Opportunities: Our HR and Strategy teams are dedicated to ensuring that our staff get the ability to train on process, communication and leadership. I have grown so much as a staff member because of this - it's invaluable! I have earned my LEAN Six Sigma yellow and green belts, gotten to take several leadership classes on leading my staff and being a self-leader (meaning that we all are leaders, even if we don't manage staff). We also have had sessions on \"fierce communications,\" walking us through working better together (including having tough conversations when we need to) through better communication.\r\n\r\n* Work/Life Balance: For most roles in the organization, there is incredible work/life balance. Some roles do require hours outside of the traditional 8-5 day, but that's true anywhere. More so than any other place I have worked, people respect your personal time and your vacation time.", "cons": "* Upward Movement: The only con is that there is no guarantee of upward movement within the organization and it can take a long time to happen, but I feel this is true of most organizations. I have seen in more recent years many more internal promotions and giving staff the opportunity to take on more responsibilities, but for someone looking for a fast track to promotions, this may not be the organization for you. I find great joy in the regular challenges I get to take on and have been promoted since I started but it just can't be an assumption. Those that are good with challenging themselves to do more and strive higher without the necessary guarantee of a title/salary promotion will thrive here."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Accounts Payable Manager", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Mar 2016", "job_title": " in Columbus, OH", "duration": "N/A", "pros": "Love the mission and the wish kiddos.", "cons": "Senior management not in touch with reality, have their own agenda.  No such thing as a promotion, everything is handled as even across the board so no pay increase.  No confidentiality, management has loose lips.  They put current employees thru interview process for different job knowing they won't get it because the job and pay has already been given to someone else.  This is common practice at MAW OH, KY & IN."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Mission, Wonderful Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Dec 2018", "job_title": "Fundraiser", "duration": "N/A", "pros": "Excellent culture, people work here to make a difference in children's lives.  I love the open environment where questions and new ideas are encouraged and feel very supported in my role (Development).  Management makes a strong effort to be transparent.", "cons": "Any workplace has hiccups but overall no major issues that I've experienced."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Make a Nightmare", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Oct 2015", "job_title": "Human Resources Employee in Phoenix, AZ", "duration": "N/A", "pros": "Great location, beautiful building, free food and drinks, great kitchen and some really great people.", "cons": "Almost nobody loves their job. Everybody behind the scenes complains about moral, HR is a total cluster (you know what) and the place is crazy political. Nobody can make a decision in a timely fashion, everyone is afraid to speak their minds owing to retribution and they have hired the most ubiquitous leaders who are so afraid of their own shadows to speak that nothing gets done. A horrible employer, the pay is laughable and the behind-the-scenes-moral is miserable. Do not work here. You won't be happy and you won't feel satisfied. Wishes aside... corporate is a mess."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Rewarding", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Large organization that does wonderful work to give children hope during a very emothion period of their lives. Ample opportunity to do a variety of jobs, thus creating the ability for transferable skills.", "cons": "Lack of consistancy and communication from chapters to the national office. Would be nice to see additional opportunities for employees in the chapter level to move into national careers."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wish Granter", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Mar 2016", "job_title": "Wish Granter in Honolulu, HI", "duration": "N/A", "pros": "Make a wish is an amazing company to volunteer for. You will function as a critical member of the make a wish team and directly contribute to the mission.", "cons": "You will be in a volunteer status, so there is no salary. It can be time consuming if you do it well, but it is absolutely worth the time it takes"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Good mission - too beaucratic with overpaid management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Aug 2012", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working with the families and children was wonderful!  Knowing I was making a difference was important to me.", "cons": "Upper management is way overpaid (David Williams receives over $350,000!).  More concerned about policies than the mission at time.  Local chapter management is spotty to poor at times."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Volunteer Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Dec 2016", "job_title": "Volunteer in Phoenix, AZ", "duration": "N/A", "pros": "Meeting the family's and especially the kids who truly do mean every thank you and appreciate you on a scale like\nnone other. The people you work with (in my experience) are never grumpy or irritated. Everyone there loves what they do and it's a great thing to see great people pull off an amazing job like this.", "cons": "Getting know you kids and understanding that as happy and cheerful as they are and they experience is, 80% of them will pass."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Most employees are satisfied but not engaged", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Mar 2015", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Most everyone is there because of the mission and a desire to make a difference. The majority of senior managers and managers care about the professional development of their subordinates. New HR team is really trying to make impact; Brand is well-known and respected.", "cons": "Decision-making process is never ending because no one can make a decision with a committee, and then executive sign off halts the process completely; low trust equals high cost at every turn."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Fundraising", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Jul 2016", "job_title": " in Tempe, AZ", "duration": "N/A", "pros": "Love the mission, great work-life balance, great benefits!", "cons": "No upward mobility. Most Managers do not have experience/know how to properly manage employees. No accountability and managers do not have their employees backs. Some departments are overworked and underpaid, although that seems to come with the NPO territory."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "passion", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Nov 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "some of the best reasons to work for Make-A-Wish are:\r\n• the mission is the forefront of decision-making\r\n• it's a corporate environment but its also casual and fun\r\n• good benefits", "cons": "some downsides:\r\n• the national office is not directly connected to the mission\r\n• culturally there are some silos that need to be worked through\r\n• top down communication and empowerment isn't very present"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Avoid New Jersey Chapter At All Costs", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission\r\nEntry level employees work hard for the children we serve", "cons": "Negative and abusive work environment\r\nExtremely low morale\r\nNo work/life balance\r\nFocused only on quantity of wishes not quality\r\nAbsurdly high turnover rate due to poor leadership\r\nNo HR department\r\nCEO verbally berates employees including senior staff in front of other staff members\r\nLack of on-boarding and off-boarding procedure leaves current staff members with the responsibilities of positions that were left vacant long after the vacancy is filled\r\n\"Other duties as assigned\" often means doing things that have nothing to do with your job"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Intern review", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Mar 2016", "job_title": "Intern in Atlanta, GA", "duration": "N/A", "pros": "I interned with them in 2015. The internship was really easy and fun and I learned a lot about Make-A-Wish itself.", "cons": "I really enjoyed my internship, but I felt that I was doing the exact same work as the employees just minus the pay. I didn't feel as though I learned a lot in regards to nonprofit management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": 3, "review_title": "Loved my internship!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "the people are great, free ice cream, free popcorn every Friday, you're helping kids all over the country, you're giving back, you're working on projects that will impact families who have suffered for a long time", "cons": "you may get bored at some point, your position may not be exactly as you imagined it"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Jan 2015", "job_title": "Program Intern in Fort Worth, TX", "duration": "N/A", "pros": "I was an intern and then a part-time employee at Make-A-Wish North Texas and I absolutely loved it. I couldn't think of a better nonprofit to work for. I'm always trying to go back!", "cons": "The only con is that there aren't a lot of opportunities for your internship to turn into a full-time position. I would have loved to work at Make-A-Wish full-time but their low turnover makes that difficult."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "CFS and Compliance NIGHTMARE", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Apr 2018", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "The 1% of employees who were nice to work with.", "cons": "Compliance Management and CFS Management are unquailed, inept, and overall horrible people to work for. Very high turnover and very low morale is common in these two departments. C Level employees who oversee CFS and Compliance just do not care and are not communicating with the employees. I feel horrible for the employees who work for these managers and directors. Horrible, Horrible people but that's what David Williams wants. Chris G is turning in his grave knowing how MAW treats its employees while using his name. Very sad."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Central and Western NC Office", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great mission, lots of work available. It's definitely got it's heart in the right place and it s a great org for those who want to work in non-profits or social work.", "cons": "Disorganization and VERY high turnover at the office I was at. The average age of employee was like 26- the work expectations were too high and the salary was too low for people to last very long."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wish granting volunteer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Aug 2016", "job_title": " in New York, NY", "duration": "N/A", "pros": "I have been volunteering at the wish granting department for over 6 years. They are the heart and soul of the organization. The wish coordinators are hard working  people, devoted to the mission of the organization. It's a very fulfilling position that requires empathy above everything else.", "cons": "The chapter has changed management recently and it's becoming too corporate. Too much pressure and emphasis on social media."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great cause!", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You have the opportunity to meet some of the most inspiring children and families. Work is rewarding.", "cons": "Like any non-profit, the compensation is well below industry standards. There's also a slower, non-competitive culture that needs to change so ensure the non-profit is able to secure donations and engage the coming generation."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wish Granter", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Aug 2015", "job_title": "Special Events in Northridge, CA", "duration": "N/A", "pros": "I am just a volunteer for this company, but Glassdoor refuses to let me skip reviewing Make A Wish. I have been a volunteer for 1 1/2 years and the people and the work are rewarding.", "cons": "I have zero cons to list at Make A Wish. This is truly a great company with great morals."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great non-profit internship", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Mar 2010", "job_title": "Intern in Chicago, IL", "duration": "N/A", "pros": "Had the chance to really take on a lot of tasks and do things I wouldn't be able to do at other internships", "cons": "It is unpaid which is expected but you have a lot of responsibilities and it would be nice to receive some small stipend"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "NEW JERSEY-HORRIBLE", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice staff\r\nExcellent Mission\r\n Commute\r\nBeautiful facility", "cons": "CEO is arrogant and abusive\r\nLeadership team is horrible.  Have no idea what they are doing and expect everyone else to do their job and take all the credit.\r\nDisorganzied\r\nHigh expectations, love salary, no respect\r\nSuper high turnover\r\nManagement treat people with a \"who cares attitude\", as everyone can be replaced!\r\nDisgusting"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great organization", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Feb 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The mission, vision, and values of the organization is closely held by the leadership and staff members. Everyone is dedicated to bringing as many wishes to as many children as possible.", "cons": "Kind of challenging to move up and grow within the organization. Everyone seems \"stuck\" in their position."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Not bad, but not forever", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Feb 2017", "job_title": "Media and PR Manager", "duration": "N/A", "pros": "- Great people, strong community network and wonderful mission. \r\n- Additional education is encouraged\r\n- The \"wow!\" you get when you tell people what you do\r\n- The feeling that you really changed the lives of people who need hope", "cons": "- Unpredictable leadership\r\n- Unresponsive team members at the National level\r\n- Inconsistent branding standards, or double standards"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Not the same workplace anymore", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jan 2017", "job_title": "Anonymous Employee in Gilbert, AZ", "duration": "N/A", "pros": "Sense of purpose\r\nYou can pat yourself on the back and keep telling yoursel what a gift you are to the world\r\nDecent pay in most cases\r\nGood benefits overall.  HR goes out of their way to improve things.\r\nYou can pat yourself on the head and say to yourself \"I'm such an angel to all these kids", "cons": "probably better to keep my mouth shut"}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Huge Disappointment in what a non profit culture is supposed to be like", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "loved the mission, HATED the corporate environment.", "cons": "toxic culture, senior management had insecurities and egos"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Passionate, Caring People", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I love most of my co-workers. Everyone is friendly, fun, and there for the kids.", "cons": "There are some big egos toward the top of the fundraising department. Those people always get their way, and they are not afraid to belittle others to get there. There is also very little upward mobility."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Overall, It Was Very Good.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Feb 2014", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Great mission, many opportunities to learn new skills and stretch your wings. Most of the staff were really nice. And they were certainly passionate about the mission as well. It's important that you have a good attitude and a collaborative spirit.", "cons": "Sometimes internal politics and shortsightedness get in the way of effectiveness and productivity. Salary was just okay."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Could have been great, but people are treated like they are worthless", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The children and families are amazing.  Large amount of training to get you ready for your job.  Local staff members are wonderful.", "cons": "The national office treats the chapters and the people who work for them like they are numbers.  Everything is based off statistics and there is no gray area."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great mission, great org", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great mission, passionate employees, and Make-A-Wish Massachusetts and Rhode Island always among the best performing chapter in the nations.", "cons": "Ad a nonprofit, there are, inevitably, limited resources and limited staff for the amount of work, which is always a challenge. The chapter's dedication to excellence means that it is run like a business, with high expectations and a commitment to excellence."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Company-Worked at a local branch as an intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The people working at Make-A-Wish are all very focused on the mission and love their job.  I always felt very welcomed, even as a part-time intern, and I really got the chance to learn a lot about the organization, their mission, and how they accomplish it.", "cons": "Being a non-profit, the internship was unpaid."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Absolutely love the mission!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jan 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The families, volunteers, and fundraisers are so fun!  It's wonderful to see all of the people who want to get involved with the foundation, simply because it's Make-A-Wish.", "cons": "There is a lot of extra time spent in the office - above and beyond the normal 40 hours per week."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "OKI is a COMPLETE disaster", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Sept 2019", "job_title": "Development in Columbus, OH", "duration": "N/A", "pros": "A good mission and a decent board", "cons": "This place is a financial and organizational mess.  The culture is toxic which creates a ridiculous amount of turnover.  Senior leadership is to blame because they don't know how to lead - let alone fundraise, manage people or manage processes.  The HR team has no real HR experience to help deal with these issues. Now that the CEO is gone, hopefully the board will be able to get this place back on track."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Very happy at Make-A-Wish", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I was very happy as an intern here. I was treated with respect and not made to feel inferior. I felt valued and that the staff cared about my contributions, as well as making the summer internship a learning experience for me.", "cons": "As an intern, I was not paid, which was difficult."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Wonderful mission, complex path to carrying it out.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2016", "job_title": " in Phoenix, AZ", "duration": "N/A", "pros": "The wishes! The employees are among the friendliest you'll ever work with. You get a real sense of fulfillment when you hear the wish stories.", "cons": "Few defined career paths and very hierarchical. Salaries can be a challenge. Cons really depend on the department you are in."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Large divide between program staff and support staff", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Dec 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Coworkers were enthusiastic about the mission of the organization. Program staff went above and beyond to ensure customer service.", "cons": "Leadership seemed unable to get traction or capitalize on the visibility of the organization. The central office didn't listen to the needs of the chapters."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Development", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I honestly do think it varies on where you work. My supervisor was great and really helped me grow as a person. My supervisor was very helpful and taught me many skill sets that I appreciate.", "cons": "My second supervisor I had wasn't that great. Didn't bother giving assignments or teaching anything new, as well as was very inconsiderate."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Development Manager-9 year employee", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Mar 2020", "job_title": "Senior Business Development Manager in Fresno, CA", "duration": "N/A", "pros": "Granting wishes for sick kids. Working with community volunteers.", "cons": "Upper management lack integrity. Double standard for managers who take the glory for all the hard work the program people do. Donations are not guaranteed to stay local even if they tell you they do."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great Employees", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The mission is wonderful, staff is skilled, pay is competitive.", "cons": "The chapter system can be frustrating. As a chapter you have to defer to the National Office and they have issues with keeping staff so projects they run often lag or are badly managed. Some of the tools they provide are very helpful to the chapter, though."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not the organization it once was", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "18 Aug 2018", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "A sense of good purpose, at least to some extent.  They treat most employees fairly decently overall although I've seen a few rather disgraceful hatchet jobs during the time I was there.", "cons": "politics, too much self-congratulating.  No real opportunities to grow once you get to a certain level."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "VP", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Oct 2019", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "Friendly and passionate people with a very caring culture.  I have worked here for 6 months and have loved every minute!", "cons": "Not to seem to over the top but I don't think there is a negative."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great experience for a great cause", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Definitely a job that makes you happy to wake up for. Very rewarding experiences. Treated like family (most of the time).", "cons": "No room for advancement what-so-ever. As for all non-profits, few employees per department so people wear many hats. Many employees are easily burnt out."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "This was the best summer internship I think I could have ever possibly had.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The people there were so inspiring. The work that is done at Make-A-Wish is amazing. They have values that I believe all companies should instill. They work for the greater good of all people.", "cons": "The commute was the only con for me."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Salary is too low, even for a nonprofit", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "4 May 2019", "job_title": "Development Coordinator in New Haven, CT", "duration": "N/A", "pros": "Very recognizable brand/nonprofit \nEach chapter is run differently so the culture will depend on where you’re located \nGood resume builder because of the name", "cons": "In the Orange County office: micro-managing is a problem, and extremely petty work environment. Even for a nonprofit the salary is extremely low. Very high turnover."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good organization.  On the right track", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Jan 2017", "job_title": "Wish Coordinator in Bethesda, MD", "duration": "N/A", "pros": "Great Colleagues, nice office and location north of DC. Inspiring and fulfilling work.", "cons": "Chapter went through several leadership changes in short period of time.  Lack of transparency was a big issue.  However, things are on the right track."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Corporate Office:  Their Culture does NOT match their mission!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Sept 2017", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "No redeeming pros. Senior Leadership team is toxic and cruel to employees", "cons": "They have a great mission but their culture is toxic."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Nov 2018", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "I worked at the Illinois Chapter for several years. Great culture and staff. Excellent benefits (tons of PTO, health insurance) offset compensation that's lower than would be received in corporate world.", "cons": "Like many non-profits, there are limited resources, so you can be stretched thin."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Love this place!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Jun 2016", "job_title": "Wish Coordinator in Tulsa, OK", "duration": "N/A", "pros": "Getting to work with the children is the best part.  The next best would be working with all the unbelievably giving people in the community.", "cons": "It can be very hard to work here sometimes given the nature of the work."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Accountant", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "If you are looking for an entry level job than this is your place of employment. Flexible hours for all staff.", "cons": "High turnover of staff which leads to being overworked and underpaid for a nonprofit plus it's hard to move up to next level"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome organization!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Sept 2015", "job_title": "Wish Granter in Phoenix, AZ", "duration": "N/A", "pros": "This organization does amazing work.  It is filled with passionate people who love what they do and it shows.", "cons": "There were no cons that I could think of off the top of my head."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The internship was a very positive experience.  Everyone is driven by the impact they make in the community.  It is a great atmosphere with a lot of people who love their job.  Overall a great experience.", "cons": "It seemed like some departments were understaffed."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great People", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Everyone who works at Make-A-Wish is there for the right reasons and are genuine and kind people.", "cons": "I felt like my job responsibilities could have been better communicated. All the interns were isolated at desks in the back corner where it made it hard to meet new people."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Culture continues to go downhill", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Aug 2020", "job_title": "Manager", "duration": "N/A", "pros": "The mission of this organization is absolutely incredible, the supporters of the organization (wish granting volunteers) are the backbone and amazing to work with.", "cons": "Various chapters with various leadership. Leadership at the Mid-Atlantic is continuing to go downhill, as is the culture."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Senior Wish Coordinator Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Sept 2016", "job_title": "Intern in Riverside, CA", "duration": "N/A", "pros": "It was a great opportunity to make connections. It was an amazing feeling to help a child's wish come true.", "cons": "The organization would benefit from having a social worker that could provide case management services to the families."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best internship experience for those seeking nonprofit career", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "They go above and beyond to create a supportive learning environment for interns. Put a great deal of money into their internship program, especially compared to other nonprofits.", "cons": "No guarantee position after conclusion of internship; not always an opening"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Great Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jul 2016", "job_title": " in Portland, OR", "duration": "N/A", "pros": "This was my first internship experience so I wasn't sure what to expect. After completing two additional internships, this was by FAR the most organized program. That can be difficult to find in many nonprofits.", "cons": "Could have had more mentorship"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful! Inspiring!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Sept 2016", "job_title": "Director of Development in New Orleans, LA", "duration": "N/A", "pros": "Make a difference everyday and help make wishes come true! You wake up everyday and want to go to work!", "cons": "There are not really cons to this job. You have an experience of a lifetime and help make an impact upon others lives!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Extremely rewarding opportunity to improve lives.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 Oct 2019", "job_title": "Volunteer Manager", "duration": "N/A", "pros": "Be involved in changing (bettering) the life of a child with a critical illness. Comp and flex time is encouraged. Great office environment. Learn a lot about the interworkings of non-profits.", "cons": "Involves lots of evening and weekend hours. Minimal pay."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Average", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Feb 2015", "job_title": " in Greenville, SC", "duration": "N/A", "pros": "It's a great feeling to help with the behind the scenes work of making a child's wish come true. You know you're working for a great cause.", "cons": "As an intern, I was bored many times at work and wasn't given much to work on."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Wish Coordinator", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Aug 2015", "job_title": "Wish Coordinator", "duration": "N/A", "pros": "Great mission to help children and their families be granted their one true wish!", "cons": "You are a non-profit and seem to get paid like most stereotypical non-profits."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "National Office: Fantastic atmosphere.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great people. More than just a \"paycheck\". You're doing something that matters.", "cons": "Light work-load, management goes at their own pace (which is rather slow) on making decisions."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Just Alright", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Joined when they were in between CEO's and lots of transition. Everyone was just watching their skin as they were hoping to keep their jobs. There's been almost 99% turnover since then.", "cons": "No vantage or growth pattern. Needed better guidance."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great foundation!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Jun 2017", "job_title": "Volunteer Services Coordinator in Ankara", "duration": "N/A", "pros": "Being a volunteer there is quite good and they have maximum effort for the children with disabilities or illnesses. Perfect!", "cons": "There are some challenges in Turkey's organization, mailing group is a bit weak comparing to any other Make a Wish Organizations."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Wish Manager", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "18 Oct 2018", "job_title": "Anonymous Employee in Irving, TX", "duration": "N/A", "pros": "Loved the mission and the relationships with wish granters and coworkers.", "cons": "Very heavy workload that increases each year without added support. \r\nInadequate pay.  For a non-profit, there is too much of a discrepancy between the salaries of management and everyone else."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Development Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Absolutely loved my time there! I had an incredible experience and got to be a apart of planning fundraising events. I also had alot of one on one experience with donors.", "cons": "The management was under change while I was there."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "awful place to work.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "there were no pros, really.", "cons": "churns employees constantly due to awful management, extremely high-stress environment, penalized employees for decisions of upper management, indecisive, constantly \"restructuring\" everyone out of jobs"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Program Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Aug 2016", "job_title": "Program Intern in Austin, TX", "duration": "N/A", "pros": "Working at Make-A-Wish was one of the best environments I could ever be with, the people you surround yourself with are so dedicated and everyday you feel amazing coming in", "cons": "There are no negative cons to this job!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Great Company, Little Opportunity for Growth", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Mar 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I really felt like I had a purpose when I worked there, plus the people were incredibly nice and welcoming to the team.", "cons": "Low pay (non-profit), little opportunity to get hired on after internship completed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Manager Role", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Supportive environment, growth opportunities, strong ties to mission and easy to connect with donors and volunteers. You are also connected to other managers around the world to help with problem solving and strategies.", "cons": "I really enjoyed working here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Corporate Development", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jun 2014", "job_title": "Community Relations in New York, NY", "duration": "N/A", "pros": "Great work/life balance, extremely friendly environment and what's better then helping children and their families!?", "cons": "Obviously working for a non-profit isn't going to bring in a lot of money."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Keep A Distance", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Make-A-Wish has a worthwhile mission and abundance of inspiring stories of children with life-threatening medical conditions", "cons": "Some offices suffer from an oppressive work environment that erodes creativity, productivity and team spirit"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Fundraising", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Oct 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Rewarding work, people who really care about what you do. Willing donors, not a hard sell.", "cons": "Stuck in old ways both when it comes to digitization of marketing content as well as fundraising techniques"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A place of impact and reward", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Mar 2019", "job_title": "Creative Director in Columbus, OH", "duration": "N/A", "pros": "You have impact, You get to do amazing storytelling with passionate, in a caring environment, you can make a difference in a child's life, a family,  community", "cons": "work a lot of weekends"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great mission-oriented company!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Jul 2020", "job_title": "Donor Care Coordinator in Scottsdale, AZ", "duration": "N/A", "pros": "I loved working at Make-A-Wish for the culture, the organization atmosphere, and Mission Mondays.", "cons": "Although it is a nonprofit, it can feel a bit cut-throat like a corporate atmosphere."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A great place to make a career in helping children and families who need you", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Oct 2008", "job_title": "Board Member in Los Angeles, CA", "duration": "N/A", "pros": "Real ability to impact the lives of children", "cons": "Chapter oversight by national can create conflict"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Intern Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jul 2015", "job_title": "Intern", "duration": "N/A", "pros": "Great organizational culture, and atmosphere. Felt that everyone had a desire to improve, learn more, and become more successful.", "cons": "A lot of tedious, office work..which needed to be done but it was not very challenging."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Wonderful organization", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jul 2015", "job_title": "Communications", "duration": "N/A", "pros": "Wonderful organization to be a part of. Very rewarding work at the end of the day. Great management.", "cons": "Lower salary because it is non-profit but you get many other benefits including extra vacation days."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Program Services", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The mission of the Make-A-Wish Foundation is a reason alone to want to volunteer, intern or work for the Foundation. The culture and work environment was wonderful.", "cons": "Some of the intern work is repetitive"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": "N/A", "review_title": "Office Coordinator", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Seeing a child with a life threatening illness happy and able to put aside their illness for a moment.", "cons": "The children have life threatening illnesses and sometimes they pass away and that is hard."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Volunteer", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Had an amazing opportunity to volunteer and loved every minute of it. Such a great company and I love what they are doing. Best non-profit organization", "cons": "Do not see a con in this organization"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Inspirational place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Sept 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Incredible mission, good leadership, feel heard by managers, mostly good coworkers", "cons": "compensation seems to be lower than the national average or of other similiar national non profits"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Development Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Sept 2015", "job_title": " in Dunwoody, GA", "duration": "N/A", "pros": "Best summer internship I've ever had. Great experience and people. Everyone should work for a non profit.", "cons": "No cons to the internship except being un paid which comes with the non-profit territory"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Disfunction at its best!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Oct 2015", "job_title": "Human Resources in Scottsdale, AZ", "duration": "N/A", "pros": "Good food in the deli down the hall although way too expensive and free ice cream!", "cons": "Totally crazy, political, unorganized environment. Nobody has job security, everyone is afraid of getting fired, employees hate the place, HR is crazy disfunctional, leadership is asleep and the company makes way too much money and grants far too few wishes."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Development Coordinator", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "(Metro New York Chapter)\r\n\r\nLoved the people, loved my boss, great culture", "cons": "Location= in the middle of nowhere- not convenient if you don't drive and live in Long Island\r\n\r\nPay= not great- definitely not competitive."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Director of Program Services", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Jun 2017", "job_title": "Director of Program Services", "duration": "N/A", "pros": "Wonderful mission and the opportunity to work with amazing people!", "cons": "As with most non-profits, there are a lot of \"hats\" to wear at most of the small local offices."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Referral Intake Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Sept 2018", "job_title": "Intern in Columbus, OH", "duration": "N/A", "pros": "I loved this job! Part of the job is communicating with families and getting to tell them their child qualifies for a wish!", "cons": "I have no cons for this internship!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Great environment", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 May 2019", "job_title": "Special Events Intern", "duration": "N/A", "pros": "Great environment, great people, great cause. Loved my time here and was able to learn so much through hands-on experiences", "cons": "Internships are unpaid (but there is a stipend at the end)"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "great mission", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "its a great cause to be a part of, makes you feel good to know that you're helping so many children", "cons": "lots of turnover, hard to get projects completed"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Development Title", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Jan 2017", "job_title": "Development Intern in Cincinnati, OH", "duration": "N/A", "pros": "Flexibility\r\nHands-On Experience\r\nTake on various roles/wear multiple hats", "cons": "Not much room for growth\r\nLimited hiring\r\nSalary- like any nonprofit, limited \r\nToo much leisure time by staff"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Amazing Mission and Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing mission to work for, supportive co-workers and management, a creative environment, overall a very fulfilling and fun job", "cons": "salary is low, but it is non-profit"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Amazing company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Best place to work! Amazing staff, fun and love environment! Everyone is so helpful and understanding, and will never say no to a question!", "cons": "Cant think of anything, amazing place!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Program Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "mission-driven, care about their employees, all employees feel empowered to stay yes, creative and fun work, different work everyday, truly trust interns", "cons": "unpaid internship, outdated equipment, outdated office space"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Interview", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Aug 2019", "job_title": "Event Coordinator", "duration": "N/A", "pros": "The  mission of Make-A-Wish makes it a very rewarding job.", "cons": "The management in our office could be more organized and could strive for more innovation to grow the chapter."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Sept 2019", "job_title": "Manager in Toronto, ON", "duration": "N/A", "pros": "Incredibly rewarding mission, great senior leadership, lots of autonomy and support", "cons": "It can take a while for changes to be implemented"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "AMAZING!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Feb 2020", "job_title": "Marketing & Communications Intern in Pittsburgh, PA", "duration": "N/A", "pros": "- Everyone is so kind-hearted and helpful\r\n- You get to meet so many amazing people!\r\n- So much to learn!", "cons": "- Nothing! This place is absolutely incredible!"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Create accountability and take care of employees", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The mission and your colleagues", "cons": "Lack of transparency, ineffective senior management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Fantastic internship.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Wonderful people, wonderful place. Every bit of work you do helps sick children find joy.", "cons": "Repetitive at times. Little autonomy, no room to create or pursue your own ideas."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Waste of my time", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Sept 2016", "job_title": "Wish Granter in Honolulu, HI", "duration": "N/A", "pros": "The company seems like a fun and inspiring place to work. But it's a trap.", "cons": "The management is run by middle-aged white women who discriminates against minorities. Don't bother interviewing here unless you're also a white middle-aged woman."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Love the mission", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jan 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The best thing about working at the foundation is the mission and all of the individuals who want to help support it.", "cons": "Some what high employee turnover"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Fundraiser", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Jan 2015", "job_title": "Fundraiser in Storrs, CT", "duration": "N/A", "pros": "very helpful setting up fundraiser, supportive, there to answer any questions", "cons": "not on site, mostly dealt with over the phone"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Aug 2015", "job_title": "Intern in Boca Raton, FL", "duration": "N/A", "pros": "An amazing experience for someone who is younger and looking to work in the non profit world.", "cons": "Not a paid internship, but nothing bad to say about the experience."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Accountant", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jun 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good benefits (health, dental, vision), PTO, sick time. Great mission. Strong brand power.", "cons": "No room for career advancement. Low salary.  High turn-over ration. No diversity."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Communications Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Nov 2016", "job_title": "Communications Intern in Westerville, OH", "duration": "N/A", "pros": "Wonderful mission that everybody is working towards. You can really feel the unity throughout the organization. Truly a magical company.", "cons": "Hard to think of any cons!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "former intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Mar 2016", "job_title": "Intern", "duration": "N/A", "pros": "loved the staff and working for such a great organization", "cons": "sad to turn referrals away if child was not qualified to receive a wish"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Development", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission, fantastic families", "cons": "Burn out, very high turnover rate, poor Managment, hostile environment"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Overworked, unhappy staff", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Apr 2017", "job_title": "Development in Phoenix, AZ", "duration": "N/A", "pros": "Great mission\r\nGreat national conference which gives you hope it will get better - it doesn't", "cons": "Overworked\r\nUnderpaid\r\nPoor leadership\r\nNo HR departments at most chapters, mine included, so no one to talk to about problems\r\nEveryone has 2-3 jobs on their schedule\r\nTakes over your life\r\nUnhappiness"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great  place to get your feet wet", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great environment, good for college students to gain experience", "cons": "not much room for growth, low pay, favoritism"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Chapter Review - Illinois", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Interesting and impactful work\r\nsupportive environment\r\nmanagement invested in training and development of staff", "cons": "runs on a lean budget - occasionally under-resourced (time/additional staff)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Donor Care Manager", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Nice staff, good mission, optimisitc", "cons": "Unorganized, teams are too flat and needs more structure, needs to be more proactive and develop strategies and plans"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Leadership does not care", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "7 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great cause, but pretty much it.", "cons": "Management is completely disconnected from staff.  No one does anything to address employee's issues or follow up.  Culture is changing for the worse  everyday.  It's a shame that it happens to a foundation with such important mission."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "An Excellent Place to Work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jan 2020", "job_title": "Intake Specialist", "duration": "N/A", "pros": "I felt supported and like I had all the resources necessary to get the job done", "cons": "There were no downsides here"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Mission, Great Culture", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jun 2020", "job_title": "Manager in Phoenix, AZ", "duration": "N/A", "pros": "Culture, Team Oriented, Mission, Opinions Matter, Professional Development", "cons": "Resource allocation to volunteer departments could improve as to better serve our volunteer base"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Nice organization", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jul 2020", "job_title": "Volunteer Coordinator in Manchester, NH", "duration": "N/A", "pros": "Wish kids & families are wonderful! Great, well-meaning volunteers.", "cons": "Worked with some wonderful people but overall office dynamic was not great."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Great Internship Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Feb 2016", "job_title": "Business Analysis INtern in Sacramento, CA", "duration": "N/A", "pros": "Great atmosphere, experiences were very educational.", "cons": "Not everything I did was applicable to what I'll be doing later in life."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Feb 2016", "job_title": "Intern", "duration": "N/A", "pros": "I loved my time here, it was a great experience and look great on a resume", "cons": "Unpaid internship, also some unorganization"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "wonderful mission, dedicated staff and volunteers", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "feeling good about something you do every day, professional staff and board", "cons": "none that I can think of"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wish follow up assistant", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Wednesday bagel day, amazing people to interact with, heartwarming experience", "cons": "No cons. It's a great environment to work at"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Awesome Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "People passionate about job\r\nMaking a difference\r\nHigh level of autonomy", "cons": "Keep up with what you are doing"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Development Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission and great company to work for.", "cons": "Working with donors can always be challenging with a lot of different opinions."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Oct 2015", "job_title": "Marketing/Communications Intern", "duration": "N/A", "pros": "good cause, great people, nation-wide, very rewarding", "cons": "i was an intern and was unpaid- but thats not uncommon for non-profits"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Amazing!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Aug 2019", "job_title": "Medical Outreach Coordinator", "duration": "N/A", "pros": "The team and people here were the best part. Everyone had a great relationship together.", "cons": "None, would work here again"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Amazing foundation - truly fulfilling!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Aug 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "They do truly amazing work!", "cons": "The nonprofit sector can't pay as well as a corporate job."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great development and people who dedicated to the MAW mission.", "cons": "personal growth within the company"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "great work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I work with great people for a great cause", "cons": "there is not a lot of room for growth"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Aug 2020", "job_title": "Wish Granter", "duration": "N/A", "pros": "Great environment, supportive team! A great job to give back.", "cons": "I  have not experienced anything bad with this organization."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Fair", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Apr 2011", "job_title": " in Phoenix, AZ", "duration": "N/A", "pros": "Furthering the work of granting wishes to children suffering with life-threatening medical conditions.", "cons": "Senior leadership lacks vision and ability to scope out change."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Development Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "BEST internship in the whole wide world. I gained a ton of expierence.", "cons": "Nothing negative about this internship."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wonderful Internship", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great organization with great values. Offers a variety of skills learned.", "cons": "General intern work, mailing, cold calls, etc."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": "N/A", "Senior Management": 4, "review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Work very independently and learn a lot", "cons": "Unpaid internship experience makes it tough to do full time"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Very rewarding and fulfilling work with a greater purpose", "cons": "No pay with a good amount of mundane clerical work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Nov 2016", "job_title": "Marketing in Dublin, Dublin", "duration": "N/A", "pros": "Fanatic team and great CEO", "cons": "Location - Leopardstown is quite far from the city centre"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Incredible mission", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Simple, incredible mission. Big positive changes have been happening within the organization.", "cons": "Technology outdated and resources are limited."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Apr 2019", "job_title": "Internship", "duration": "N/A", "pros": "Everyone is friendly and welcoming. It’s a great feeling getting to help.", "cons": "It is all office work."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great internship", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Apr 2012", "job_title": "Volunteer Intern in Morrisville, NC", "duration": "N/A", "pros": "Helping the families and seeing the wish come true.", "cons": "Non paid intership and no positions available."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Internship Review", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Furthered my education in the communications and marketing role.", "cons": "There are no cons from my experience."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Jul 2020", "job_title": "Accounting", "duration": "N/A", "pros": "Great team with great mission", "cons": "None that I can think of."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Make-A-Wish Foundation", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Jun 2016", "job_title": "Development Intern in Brentwood, TN", "duration": "N/A", "pros": "-Great people\r\n-True to their mission\r\n-Fulfilling work", "cons": "There were no cons that I can think of"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Make-A-WIsh", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Unique mission\r\nstrong brand\r\nappeals to many", "cons": "Still evolving national structure can make planning at the chapter level difficult"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Review", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great mission at Make A WISH", "cons": "High turnoverat Make A WISH"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Beautiful mission, passionate staff", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mission, positive workplace, strong leadership", "cons": "Staff works for the kids, not high salaries"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Accounting", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Opportunity for career growth, personal development, hand on training, employee perks, benefits", "cons": "Long commute and low pay"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Volunteer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Dec 2018", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "It was a great experience helping coordinate events and meet the children", "cons": "There were no cons"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good experience making a difference", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Dec 2019", "job_title": "Intern", "duration": "N/A", "pros": "Decent amount of responsibility, good supervisors", "cons": "All female office sometimes got catty"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Customer service", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Knowing you were able to help others", "cons": "Lots of internal gossip just like middle school"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Intern Review", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Aug 2015", "job_title": "Intern", "duration": "N/A", "pros": "Great opportunity for learning, given a lot of responsibility", "cons": "Somewhat disorganized intern program and training"}], [{"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "ok experience", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-Working for a great cause\r\n- Friendly staff", "cons": "there does not seem to be room for growth"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing organization", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great organization with an amazing mission.", "cons": "As with other non-profits, resources are always tight."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexibility, strong purpose for your work, decent benefits", "cons": "Relatively young national nonprofit organization"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Development Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Love their mission and created valuable professional relationships.", "cons": "There was a bit of micromanaging."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "non-profit", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "culture, mission, fun, decent benefits, work life balance", "cons": "compensation, average benefits, limited job growth"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "volunteer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "its the best volunteering experience ever", "cons": "It is challenging and yet very rewarding"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Make A Wish", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great place to work at", "cons": "Bothing wrong with the Make a Wish foundation"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Development Manager", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing mission, great training, never boring", "cons": "Little oversight for the chapter's CEO"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Make a wish", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jan 2020", "job_title": "Wish Granter", "duration": "N/A", "pros": "Very nice to help people", "cons": "There was no cons for this job."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "very rewarding, makes your heart feel good", "cons": "(just not financially rewarding at all)"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Fall Communication Development Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Close-knit office with ample opportunities.", "cons": "Typical intern work overpowers potential progress."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Community outreach intern", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Mar 2016", "job_title": "Community Relations Intern in Mount Prospect, IL", "duration": "N/A", "pros": "Great mission and value statements", "cons": "internship is unpaid but great company"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Wish Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Meaningful work and great people", "cons": "Hard at times to work with families"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Accounts Manager", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great Place. Wonderful Place. So happy.", "cons": "Not enough time with the clients."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Mar 2020", "job_title": "Fund Development Manager", "duration": "N/A", "pros": "Great work environment and great cause", "cons": "Low pay And not a lot of advancement opportunities"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Nice", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jun 2020", "job_title": "Development", "duration": "N/A", "pros": "Nice people who mean well", "cons": "Not a lot of opportunity for advancement"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Appreciate", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Aug 2020", "job_title": "Appreciate", "duration": "N/A", "pros": "Nice people there who are friendly", "cons": "Hard work. Being on your feet all day."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Cool environment", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Sept 2011", "job_title": "Marketing Intern in Phoenix, AZ", "duration": "N/A", "pros": "Friendly environment. Nice work area. Parking", "cons": "Consistency of repetitive daily activities"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Professional but fun environment; very rewarding work", "cons": "Very little opportunity for advancement"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Current employee", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Talented and dedicated staff working on wonderful mission.", "cons": "Nothing to report at this time."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Wonderful experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2019", "job_title": "Wish Granter in Atlanta, GA", "duration": "N/A", "pros": "Meet lots of people\r\nKnowledgeable staff", "cons": "Communication \r\nSome employees don’t take responsibility"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "review", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Sept 2019", "job_title": "Director", "duration": "N/A", "pros": "great purpose and fun projects", "cons": "limited upward mobility and conflicts with global offices"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "helper", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Aug 2020", "job_title": "Volunteer", "duration": "N/A", "pros": "Helping those who have a hard time", "cons": "I enjoyed working with MAW"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Wonderful Organization", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Aug 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Family oriented and mission driven", "cons": "very little opportunity for career growth"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mixed Bag", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Leadership cares about you personally.", "cons": "Difficult to see a career path"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Excellent", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Feel good about your job", "cons": "Non-profit does not pay as much as for-profit industry"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Marketing Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Oct 2017", "job_title": "Marketing Manager in Athens, Athens, Attica", "duration": "N/A", "pros": "Beautiful smiles of our children", "cons": "Overwhelming & lots of hrs"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Interview", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working for good cause and satisfying", "cons": "Bad behavior by top management"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Make-A-Wish is a good organization", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Nov 2010", "job_title": "Development", "duration": "N/A", "pros": "Good organization with good cause", "cons": "Non-profits are hard to work at"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission and great people", "cons": "High stress for wish managers"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Wow!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Worthy mission, highly recognizable brand, positive public perception", "cons": "challenging corporate culture and silo mentality, deeply resistant to change, absence of clear strategy and vision, very homogeneous environment."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Don't be fooled by the mission", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Oct 2019", "job_title": "Manager", "duration": "N/A", "pros": "Great mission, very poor management", "cons": "Abusive behavior my some of management"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "bad", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "great mission helping children to forget", "cons": "Leadership have no idea how to lead people"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Salesforce Developer", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "There is nothing at all", "cons": "No Ethics for employee as well"}]]