[[{"date": "11 Nov 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Lifewell (Phoenix, AZ) in Nov 2022", "Interview Descriptions": "The interviewers were polite and casual. I was nervous when I came in, but the straightforwardness put me at ease. There was two interviewers and they took turns asking behavioral health related questions. If you have experience in psych or behavioral health, then you’ll have no problems answering the questions. The work place culture is down to Earth, compassionate and thoughtful about their decisions. It’s a good fit for someone who is less formal, but holds themselves to higher standards.", "Interview Questions": "How would you handle an upset client? Tell us about a time when you had to intervene in a crisis situation? Can you name two disorders and their characteristics? Are you comfortable with home visits? Are you comfortable with driving clients in your car to their appointments?"}, {"date": "29 May 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lifewell", "Interview Descriptions": "I submitted an on line application.  HR reached out to me via phone and set up a phone interview.  They were pretty flexible with timing and were very responsive.  They were very upfront about the salary at the very beginning.", "Interview Questions": "They asked a lot about my work history and my availability "}, {"date": "27 Mar 2022", "title": "Behavioral Health Clinician Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lifewell", "Interview Descriptions": "A brief interview that attempted to gauge experience and discover the reasons I wanted to work for the company.  They were friendly but this is an entry-level position that pays very poorly.", "Interview Questions": "Do you have experience and why would you like this job"}, {"date": "22 May 2022", "title": "Peer Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lifewell (Phoenix, AZ) in Sept 2021", "Interview Descriptions": "It was very unprofessional and I still didn't get selected for the job, the managers conducting the interview were arguing with other during the interview. They talked bad about the clients that they were overseeing and giving me horror stories instead of speaking highly of the clients and of the position", "Interview Questions": "He asked about my experience in recovery"}, {"date": "9 Feb 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lifewell (Phoenix, AZ) in Feb 2021", "Interview Descriptions": "I only met with one person for the interview and it was overall laid back. The interviewer discussed her struggles in this field and asked why I wanted to work with people with SMI.", "Interview Questions": "\"Do you have any knowledge of any serious mental illnesses\""}, {"date": "16 May 2019", "title": "Mental Health Clinician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lifewell (Phoenix, AZ) in May 2019", "Interview Descriptions": "This organization is only concerned with billing and does not genuinely care about their clients \r\nThey just want bodies to process billing and maintain order over clients. They aren’t interested in helping clients heal. If you want that kind of environment then try Lifewell.", "Interview Questions": "I was asked to bill 56 times a day! Which is the entire day. It may leave you with a few hours with the clients but it’s not going to happen in reality. "}, {"date": "14 Jun 2018", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Lifewell (Phoenix, AZ) in Apr 2018", "Interview Descriptions": "Was given a typing test. That was strange. The interview was relaxed went ok. Got hired on the spot. The HR lady was rude and seemed like she had a lot on her mind. Maybe she was having a bad day? The actual\nPerson that did my interview was nice and made the interview fun.", "Interview Questions": "Typical interview questions\nA lot of questions about SMI population."}, {"date": "11 Dec 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lifewell (Phoenix, AZ)", "Interview Descriptions": "They barely interviewed me. They hand picked me and told me straight out they only interviewed others because they had to do so. I was uncomfortable with the fact they told people I had the job before I actually had my interview and felt I had to take it.", "Interview Questions": "Describe a crisis and how you would handle it."}, {"date": "24 Feb 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lifewell (Phoenix, AZ) in Jan 2016", "Interview Descriptions": "First interviewer asked me about my education, knowledge of the job duties, and had me take a typing test. Introduced me to the person who would be my supervisor.\r\n\r\nThe second interviewer had me visit her in the corporate office. Asked me if I'd done any case management, had be bring in a ton of paperwork, then go take a drug test.", "Interview Questions": "The only unexpected thing was a typing speed test. Minimum speed of 25 WPM, which is negligible."}, {"date": "19 Nov 2015", "title": "Clinician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lifewell (Phoenix, AZ) in Nov 2015", "Interview Descriptions": "I was contacted by their HR, to set up an interview. I was told there would be a typing test and an assessment progress note test.\n\nI arrived at Lifewell, checked in at the front desk. I was then given a scenario to read & I was asked to make an assessment, and progress note. There was a second part that asked what was missing in the scenario. I completed it and returned it to the front desk.  \n\nNext, the clinical director came and escorted me to an office. She went to her computer and said that I will now complete the typing test. She said I had one minute to type. They want at least 25 words per minute. Exactly one minute later, she came back into the room with another person whom I was introduced to. \n\nThey then asked me to sit at a round table with them and began the interview.", "Interview Questions": "Tell us about yourself."}], [{"date": "23 Feb 2016", "title": "Clinician I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lifewell (Phoenix, AZ) in Jul 2015", "Interview Descriptions": "Phone interview with HR and then in person interview with the program coordinator. The interview was very informal and more like a conversation. I was informed that I received the job within a couple of hours of the interview.", "Interview Questions": "N/A"}, {"date": "1 Nov 2015", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lifewell (Phoenix, AZ) in Apr 2013", "Interview Descriptions": "I was interviewed by two staff members. I have extensive work history in the field, and my resume speaks for itself as to my job skills. The agency was well represented by the interviewers and it was a pleasant beginning.", "Interview Questions": "What are your strengths? Are you looking for job advancement while working at Lifewell?"}]]