[[{"date": "15 Apr 2022", "title": "RBT - Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Anova", "Interview Descriptions": "Super easy! I went in to the interview and they asked me a series of questions and also asked for my resume. I told them I had a preference for schools (in terms of disctricts) and they placed me in that district,", "Interview Questions": "Tell me about your experience working with children."}, {"date": "29 Oct 2018", "title": "Territory Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Anova", "Interview Descriptions": "I applied online and the next day received an invitation to take an assessment as the first step in the process. The assessment took more than an hour to complete and was heavy on personality questions and surprisingly heavy on LinkedIn questions (how do I use it, what is my social score, how many connections do I have, etc.). After completing the assessment, I heard nothing for almost three months, when I received a form rejection email from \"ANOVA HR\" - no name or feedback. The company claims that people come first, that the treat people well, and our open about what they do, but this does not apply to applicants apparently. They have no problem wasting potential employee's time and not treating them with respect.", "Interview Questions": "I was sent an assessment that took over an hour of my time to complete, then heard nothing from the company, with no way to follow up. Three months later, I received a form rejection email with no name or explanation."}, {"date": "14 Oct 2016", "title": "Sales Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Anova (Minneapolis, MN)", "Interview Descriptions": "Ridiculous, and unstructured, \r\n\r\nHR continued to confuse which role I was applying for?\r\n\r\nActually assumed I could not handle rejection when I asked for feedback after being declined for a role in a state where I did not reside? Is this basic un-professionalism or rank ineptitude? Having held and performed successfully at a number of Sales/Sales Management roles over the past 20 years I believe I no how to handle rejection and how to gain from the client the reasons why they choose to go in a different direction (I think it is called follow-up for feedback, something the folks at ANOVA might try and learn a thing or two about).\r\nAs it stands, I dodged a bullet, receiving an offer for a Director level role the same day!", "Interview Questions": "Basic resume and experience questions"}], [], [], []]