[[{"date": "27 Nov 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "Background info, STAR based questions. For example Tell about a time when you had to manage multiple projects and conflicting timeliness. Several rounds of formal interviews and the informal chat with a fee team members", "Interview Questions": "Tell me about a time when you had to manage multiple projects."}, {"date": "24 Nov 2021", "title": "Campaign Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Way", "Interview Descriptions": "The interview process was well coordinated and clearly communicated throughout. I had the opportunity to meet with several key people I would be working with and they did a great job of hearing my perspectives and answering my questions", "Interview Questions": "My approach to process development and organization and prioritization of opportunities "}, {"date": "4 May 2021", "title": "Database Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at United Way (Halifax, NS) in Mar 2021", "Interview Descriptions": "Interview was conducted online via MS Teams. The interview atmosphere was not stressful or intense. The interviewers were very casual and relaxed. The interview was short at about 20 minutes.", "Interview Questions": "Describe a time when you changed the way you approach something and how it turned out."}, {"date": "10 Mar 2018", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Way", "Interview Descriptions": "Great process. Had an interview with the HR manager, Director of Workplace and the VP of Resource Development. Very standard questions, time to discuss the role. Really organized and supportive environment. It's important to prepare for behavioural questions.", "Interview Questions": "Tell me about a time when you faced a challenge at work. How did you deal with it?"}, {"date": "8 Mar 2016", "title": "Community Impact Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at United Way (Halifax, NS) in Jan 2016", "Interview Descriptions": "Hired through recruiter and they wanted someone to start right away. I had done an interview with the recruiter prior to this but not for a specific job. They called me and asked if I could start this job the next day. It was very fast", "Interview Questions": "N/A"}, {"date": "25 Jul 2016", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at United Way (Toronto, ON) in Sept 2015", "Interview Descriptions": "Was referred through a friend. Process moved pretty quickly, had one interview with one hr representative and one manager. Relatively easy interview with basic questions and the job started 2 weeks after the initial interview.", "Interview Questions": "Why do you feel you would be a good fit?"}, {"date": "9 Jul 2015", "title": "Fundraising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Way (Toronto, ON)", "Interview Descriptions": "More or less your standard interview with the usual questions except for some very skill-specific questions. The online job description did not specify some skills they were looking for. There were a number of technical skills that were not in the job ad.", "Interview Questions": "As we were just seated and chatting before we formally began the interview, it was assumed that I did not have children and an inappropriate comment was made about disliking children. No illegal questions about children were asked, but it was uncomfortable."}, {"date": "3 Jan 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at United Way (Toronto, ON) in Feb 2015", "Interview Descriptions": "Typical, very dry and overly serious for such an \"entry-level\" position. You're given scenarios, what would you do in this situation, that situation. There were two interviews. Basically, the more bland you are the better it is, they want you to be a true conformist, smile and nod your head to everything. Also, there was a test administered, testing your Excel abilities. Some things you have never heard of before and will not use in your job.", "Interview Questions": "I can't really remember, but I know it was one of those typical dull questions (e.g. What would you if you didn't know how to complete a certain task? or What if you had a conflict with another employee and had to have the 'courageous conversation'?)."}, {"date": "7 Jan 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at United Way", "Interview Descriptions": "Spoke with recruiter and then met with the employer and was trained over one day, the team were pushed for time and were very accomodating. They assisted me over the next few weeks as I only had one day training for the role.", "Interview Questions": "N/A"}, {"date": "1 Mar 2018", "title": "Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way in Jan 2014", "Interview Descriptions": "The interview process was really smooth and I felt confident that this was a warm and strong team. In the end I decided the job wasn't the right fit for me.", "Interview Questions": "N/A"}], [{"date": "18 Dec 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at United Way (Ottawa, ON) in Oct 2013", "Interview Descriptions": "Phone prescreen - asked question about salary expectations\r\n2-panel members - direct supervisors\r\n45-60 mins face-to-face interview\r\nabout 10 questions\r\nsecond interview with the head of the department\r\nasked for 2 references\r\nmade an offer after they received the references", "Interview Questions": "Tell us about yourself."}, {"date": "8 Jul 2016", "title": "Resource Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United Way (London, ON) in Jul 2012", "Interview Descriptions": "The process was fairly standard. There was a screening interview and a couple of in-person interviews following. The entire process took about a month's time. Everyone was fairly organized and managed expectations well.", "Interview Questions": "Questions are all behaviour-based."}]]