[[{"date": "8 Nov 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clark University in Sept 2022", "Interview Descriptions": "Most of the interview questions are BQ questions. All the interview processes are relaxing and smooth. A virtual interview is required with several committee board members. Some questions are about the equity and diversity of the employees.", "Interview Questions": "N/A"}, {"date": "9 Mar 2022", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Clark University", "Interview Descriptions": "Group interview then individual. Group is situational and conversational prompts while the individual one is your traditional one-on-one with questions about how you would apply your skills as a future RA", "Interview Questions": "questions about how you would apply your skills as a future RA, leadership & conflict  resolution"}, {"date": "1 Mar 2022", "title": "Graduate Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Clark University (Worcester, MA)", "Interview Descriptions": "Smooth processes, questions we about the role and the questions were creative.  The interviewers were polite ad gave time and space to think about answers. The entire process took about 1 month with onboarding.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "22 May 2021", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clark University (Worcester, MA) in Apr 2021", "Interview Descriptions": "A preliminary phone prescreening of the candidate by the position’s direct supervisor. If that goes well, HR will contact the candidate to do a salary screening -to make sure employer and candidate are on the same page before vesting too much time into consideration. Lastly, a formal interview with direct supervisor and affiliated parties.", "Interview Questions": "Why are you interested in working at Clark University?"}, {"date": "23 Mar 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clark University", "Interview Descriptions": "Started with phone interview first.  Then second round was all day interview with multiple departments.  Switching from 1 to 1 meetings to group interviews.  Strong focus on former experience, and strengths.  Community is very important.", "Interview Questions": "Share an accomplishment most proud of\n\n"}, {"date": "11 Mar 2021", "title": "Mailroom Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clark University", "Interview Descriptions": "It required an application and they asked the standard question like how I work in a team and what other things I have been involved with on campus.  Other than that, they had me do an interview through email because of COVID but usually it would be in person.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "6 Apr 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clark University (Worcester, MA) in Dec 2020", "Interview Descriptions": "The interview was about 20 minutes over zoom. It was quite conversational and entailed going over life and professional experiences. Then, scheduling was made as to when it was best to get back in touch and begin working.", "Interview Questions": "How do past experiences contribute to this current position?"}, {"date": "4 Dec 2020", "title": "Undergraduate Admissions Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Clark University (Worcester, MA) in Nov 2019", "Interview Descriptions": "Difficult but fun interview! Includes a lot of different activities including a mock panel, a mandatory speech everyone must make, and a group interview. Challenging process but very enjoyable. The staff is all very friendly.", "Interview Questions": "What was your college search experience like?"}, {"date": "26 Jan 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clark University", "Interview Descriptions": "Met during the ASSA meetings. Three people came and talked very briefly about the University. And asked me about my research and how I would teach their PhD level course.", "Interview Questions": "Tell us about your job market paper"}, {"date": "22 Mar 2016", "title": "Departmental Junior Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Clark University (Worcester, MA)", "Interview Descriptions": "I answered an ad in the paper, submitted a detailed and well done resume. They called me in, told me they were impressed by my resume, and offered me the job on the spot.   I did not know anyone at the university and did not have any other connections.  They told me they hired me over other applicants.  They liked my resume which was well written.  I was not asked many questions and they did not tell me much about what would be expected or about the position.", "Interview Questions": "I don't recall any interview questions.  I only remember them saying they had selected me over others due to my resume and offering me the job on the spot."}], [{"date": "21 Jun 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clark University (Worcester, MA) in Jan 2016", "Interview Descriptions": "All done over the phone for a job in China. There's a lot of chit chat and empty promises. Clearly, the just wanted a body.\r\n\r\nOnce I got there, from the motley crew they'd hired, that the manager really just wanted someone with a pulse. Since the program was overseas, all that mattered was income.", "Interview Questions": "Can you handle adversity?"}, {"date": "27 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Clark University (Worcester, MA) in Jan 2016", "Interview Descriptions": "Working with a professor at Clark requires self motivation. The opportunities are there you just have to make a point to look, ask, and listen to what professors can offer you and what they are working on/want to work on.", "Interview Questions": "Why do you want to do this research?"}, {"date": "2 Jan 2018", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clark University (Worcester, MA) in Sept 2014", "Interview Descriptions": "Applied online then got the interview.  Was sent an email to come to the office at a date within a week and then asked a few questions about my behavior and how I was a good fit.  I dressed business casual and answered the questions nicely.  They sent out an email a couple days later saying that i got the job.", "Interview Questions": "Why do you think you are a good fit?"}, {"date": "1 Oct 2017", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Clark University (Worcester, MA) in Mar 2014", "Interview Descriptions": "Over the phone screening and then in office interview pertaining to why I wanted the job and why I believe I was a good fit. The staff was very friendly and the interview was not as nerve wrecking as I has anticipated.", "Interview Questions": "Why do you want to work as an admissions counselor? "}, {"date": "15 Jul 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Clark University", "Interview Descriptions": "Just simple interview. I do not think Professor ask other people to interview. Just tell me job content and ask me whether I'm willing to do.", "Interview Questions": "N/A"}, {"date": "5 Jun 2012", "title": "Career Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Clark University (Worcester, MA) in Apr 2012", "Interview Descriptions": "I applied via email and by mail.  A co-worker had a connection to get my resume to the hiring manager who was the director of the Graduate school of management. I prepared by learning as much as I could about Clark and about the GSOM office and what they offered. I prepared questions based on the job description.   I was told my my friend that they thought I was over qualified and that I would have to convince them that I would stay in the role for some time.  I think the reason that I did not get the role is that I am currently interning as a career advisor, and the director did not think I really would be happy with an adminstrative role.  The interview was hard, and the director was a former recruiter.", "Interview Questions": "In your current or previous job, what kind of pressures do you encounter?"}, {"date": "2 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clark University (Worcester, MA) in Jan 2011", "Interview Descriptions": "Skype was used to communicate. Most questions are based on my research experience during my graduate and undergraduate career. Specifics on analytical techniques  are asked and i walked through a few instruments i used in my research. The whole interview last about 40 mins and the interviewer is very concerned about communication basics in addition to scientific details. Hiring a research assistant who is able to communicate is also of great importance.", "Interview Questions": "Tell something specific on using SEM"}]]