[[{"date": "24 Jan 2023", "title": "Supply Chain Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Beebe Healthcare (Rehoboth Beach, DE) in Jan 2023", "Interview Descriptions": "Met with several people. All seemed to have positive attitudes It was a very long interview process. Took 5 hours. This is to make me over the 30 words I keep having to add more sentences", "Interview Questions": "What would you do in your first 90 days"}, {"date": "20 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beebe Healthcare", "Interview Descriptions": "meeting with managers from at least three units of your choice and asking them questions as well as answering. each manager's questions.  Discussing what is expected during the shift and also they are good at answering questions about further education credits.", "Interview Questions": "Tell me about yourself and how you handle conflict "}, {"date": "17 Aug 2021", "title": "Licensed Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beebe Healthcare", "Interview Descriptions": "Smooth and clear process! Staff give expectations up front with no \"gray area\". Interview was virtual for safety precautions because of the pandemic. The interview was a group of interviewers and one candidate (me).", "Interview Questions": "Name a time you were faced with challenges at your work?"}, {"date": "19 Jun 2021", "title": "Public Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Beebe Healthcare", "Interview Descriptions": "Had an initial interview comprised entirely of those \"tell me about a time when...\" questions. Nothing about my experience in the field or my track record. Followup was a team interview, exactly the same. It went on forever and was stressful and pointless.", "Interview Questions": "Tell me about a specific time you had a conflict with a coworker and how you resolved it.\n\nEtc."}, {"date": "14 Dec 2020", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beebe Healthcare (Lewes, DE) in Oct 2020", "Interview Descriptions": "Zoom call with two department heads.  Interview was for multiple positions to see where they thought you would best fit.  Was able to discuss past careers what I enjoyed more than others. Provided next steps and when I should hear back.", "Interview Questions": "Dont recall the interview questions"}, {"date": "10 Jun 2020", "title": "Registered Nurse Home Care Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Beebe Healthcare in Jun 2020", "Interview Descriptions": "It was a 3 panel interview process in which each took turns asking questions.  The questions were situational and puts you on the spot. Some may not have a issue with these type of questions .", "Interview Questions": "What is something you current manager could so different?\r\n"}, {"date": "11 Jul 2019", "title": "Registered Nurse II Home Health Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Beebe Healthcare (Millsboro, DE) in Jul 2019", "Interview Descriptions": "There were three people on this interview panel. One of which was a very unprofessional male with 5 hoop earrings in his ear.  Another was a woman tasked with \"filling in\" for the nurse manager (reluctantly). I was asked closed to 30 questions and the interview took an hour and a half. I prepared the day before by practicing behavioral interview questions. I had answers with scenerios already prepared. I felt that the interview itself went really well, only to discover that the job requirements had changed from what the origional posting had suggested. I was not given an offer because I did not have home health experience.  My 6 years of developmental disability experience with trachs, feeding tubes, catheters, etc.  My 8 years of hospital experience with orthopedic, cardiac, IV's, PICCs, Pluerx, Chest tubes, mediports, wound vacs, etc. None of it considered. What a waste of time.  I wish the fill in nurse manager  would have made that clear prior to wasting my time.", "Interview Questions": "What is one negative thing your current supervisor would say about you?"}, {"date": "12 Oct 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beebe Healthcare (Lewes, DE) in Oct 2017", "Interview Descriptions": "There was an initial interview with the department director then a panel interview with five of the department heads.  This took two weeks, which to me wasn't a long time in between interviews.  The HR department kept in contact with me during the entire process.  After three weeks (from initial) I got a job offer.  Preemployment processes started the Monday after the job offer.", "Interview Questions": "The panel interview folks took turns asking behavioral type questions.  Being honest and pulling from my previous work experience allowed me to respond to their questions timely.  Not sure if someone at an entry level type position would have the same type of questions or not.  How would you,  and is there a time, type of questions were asked.  It took about an hour for the final interview. "}, {"date": "8 Nov 2017", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Beebe Healthcare (Lewes, DE) in Oct 2017", "Interview Descriptions": "The Beebe Healthcare organization is a growing hospital in Sussex County Delaware. They are attracting a much better team of physicians, nurses and key members in the healthcare industry. I can highly recommend this organization.", "Interview Questions": "Previous experience"}, {"date": "26 Sept 2017", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Beebe Healthcare", "Interview Descriptions": "Beebe uses the STAR method for interviewing so be prepared with past experiences that you can discuss. Be professional and smile! If possible, google Beebe Values. It is a big thing here and it will definitely help you land the job.", "Interview Questions": "Explain a time where you didn’t get along with co-worker and how did you handle this situation?"}], [{"date": "29 Jun 2017", "title": "ER PCT Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Beebe Healthcare (Lewes, DE)", "Interview Descriptions": "Very strange, acted like I had the job already. Interviewed with a manager and a nurse that had been there for less then 2 months. Furthermore HR failed to inform me that while testing for drugs in the Pre employment process that they test for nicotine. I'm not a smoker but celebrated with my roommates by having a cigar when when i accepted the position. Ultiamiy they refused me the job after I tested positive for nicotine and wouldn't even listen to my explanation. Was treated like a second class citizen or a drug addict because of a cigar. FYI,  if you are a smoker and passed on there timeline of there hiring process quit smoking long before you even consider applying (it takes anywhere from 2-6 weeks for nicotine to get out of your system and the pre employment process only takes 3-4 weeks.) but HR will not inform you of this requirment for employment. Also they try controlling there employees lives outside of work by not allowing you to use any nicotine products ( including e-cigs or patches for people who are quitting) furthermore they expect you to show them a script for every drug you are personally prescribed. And if they randomly  drug test you, and you pop for something that's prescribed to you but you failed to inform them of it (I.E. adderall, painkiller or some antidepressants) they will fire you anyway.", "Interview Questions": "Tell us a time where you were wrong?"}, {"date": "10 Apr 2018", "title": "RN Float Pool Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beebe Healthcare (New York, NY) in Mar 2016", "Interview Descriptions": "Just asked to tell me a little about myself... And I answered and that was pretty much it. I didn't get any of the standard questions that most get. I was told that they would contact my references and let me know. This person was accustomed to interviewing travel nurses over the phone, and I think this may explain the lax format of the interview.", "Interview Questions": "Tell me a little about yourself"}, {"date": "16 Oct 2014", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Beebe Healthcare", "Interview Descriptions": "It has been many years since I have interviewed, but the current interview process covers applicants values as well as their skills. Questions are aligned with the core values of the organization, and outweigh the skills. The organization is very focused on hiring staff with patient/customer focus.", "Interview Questions": "N/A"}, {"date": "30 Nov 2015", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beebe Healthcare (Lewes, DE) in Dec 2013", "Interview Descriptions": "A value based 10 open-ended questions. They are based on your own personal experience with the expectation of detailed answers. There were 2 other staff along with the manger who conducted the interview", "Interview Questions": "Tell about  time you went over & above for a customer "}]]