[[{"date": "27 Jun 2023", "title": "Grants/Proposals, Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Actionaid", "Interview Descriptions": "Really good overall, felt very informed and they helped show me off. I felt comfortable throughout and was able to ask questions at the end. Questions provided before and feedback after!", "Interview Questions": "Why do you want to work for ActionAid"}, {"date": "28 Apr 2023", "title": "Head of Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Actionaid (London, England) in Mar 2023", "Interview Descriptions": "While the staff I spoke to were all really friendly and obviously knowledgeable, the HR process left a lot to be desired. It was more than a month between submitting the application and getting an interview offer - I'd assumed I hadn't gotten an interview, and then I heard. Then multiple weeks between the first and second interviews, multiple weeks before I heard a final decision. It's been more than a month and, despite requesting feedback multiple times, I've only had unofficial feedback from an HR colleague, whose expertise isn't in comms, making the feedback not incredibly useful.", "Interview Questions": "Big emphasis on international aid - big emphasis on EDI in their work. Not many questions about line management abilities, which was strange - the interview felt more like it was for a senior officer role, as they were very focused on hands-on work, rather than team management."}, {"date": "24 May 2022", "title": "Supporter Care Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Actionaid in Jan 2022", "Interview Descriptions": "Interviewed online via zoom, three members of staff. standard panel style, competencies questions. There was a pre interview task also, again the kind of thing you could easily expect. Given half an hour to produce an example of the kind of correspondence you'd be sending to supporters.", "Interview Questions": "What experience do you have in a similar role? "}, {"date": "10 Apr 2021", "title": "Chief Executive Officer (CEO) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Actionaid", "Interview Descriptions": "Online application process with answers required to specific questions rather than a generic ‘supporting statement’\r\n\r\nOffered a conversation after the process to give feedback on why my application was not successful, which was greatly appreciated", "Interview Questions": "How will your senior leadership experience enable you to lead on the delivery of ActionAid UK’s strategy and mission?"}, {"date": "28 Apr 2021", "title": "Finance and Assurance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Actionaid (London, England) in Apr 2021", "Interview Descriptions": "It was great, however there is a need of improving the process especially in the situation where there is a possibility for aptitude test,it should clearly state prior to the interview that there will also be a written test before oral interview", "Interview Questions": "Budget Proposal"}, {"date": "26 Jun 2020", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Actionaid in Jun 2020", "Interview Descriptions": "2 stage interview process on Microsoft Teams. Questions were well thought of and helped assess candidates' knowledge and critical thinking. There was the option to review the questions 30 minutes before the interview time, which was very helpful.", "Interview Questions": "What do feminist leadership principles mean to you?"}, {"date": "24 Jun 2019", "title": "Fundraising Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Actionaid", "Interview Descriptions": "The interview included three stages. The first one was with the hiring manager and the second one was a competency test of 2 hours with the hiring manager and the fundraising manager.  The competency test was exhausting.", "Interview Questions": "What levels of donations have you handled? "}, {"date": "16 May 2023", "title": "Student Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Actionaid (London, England) in Mar 2019", "Interview Descriptions": "It was easy, they contacted my school and the process was smooth. The questions were very simple and mostly just asked about what my study interests were and what curriculars I liked. We then discussed the projects they had and that was it.", "Interview Questions": "What do you see your future career plans centering around?"}, {"date": "7 Jan 2019", "title": "Grants Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Actionaid (London, England) in Dec 2018", "Interview Descriptions": "After having applied online I was shortlisted for an in-person interview with three people at ActionAid London. I was told that I would first have to take a one hour test, then have the one hour panel interview. Upon arrival, I was led straight into the panel interview room and the interview started right away instead of the test, which was very confusing.\r\nOne of the panel members was really nice and friendly, the others looked bored and it almost seemed like they had already chosen the candidate (I was the last interview). The questions were straight forward, related to my experience for the role, why ActionAid, etc. \r\nThe test was more difficult than the panel interview. In only one hour, there was an excel test to complete (budget report) and a word test (proposal to amend).\r\nI was told that I would hear from them three days after the interview. On said date, nothing. After reaching out, I was told that it would actually be another couple of days for them to be able to let me know their decision. Still nothing - I had to wait another two weeks to receive an automatic reply from HR. \r\nNot a very feminist organisation :)", "Interview Questions": "Why do you want to work with ActionAid?"}, {"date": "7 Feb 2018", "title": "HR Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Actionaid (London, England) in Jan 2018", "Interview Descriptions": "Normal process, applied online, called for interview a week later. Quick and easy process . About 10 interview questions. Hiring process was very fast got my contract within 2 weeks. Friendly recruitment person.", "Interview Questions": "What skills and experience can you bring to this role?"}], [{"date": "23 Feb 2019", "title": "Senior Policy Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Actionaid (London, England) in Jan 2018", "Interview Descriptions": "The interview was over Skype with two managers for about an hour followed by a test for research skills. I was given two pages of regression tables and was asked to write a blog post summarizing the most interesting impacts of the program.", "Interview Questions": "They asked me about my experiences and skills in quantitative and qualitative research with examples. "}, {"date": "10 Jan 2018", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Actionaid (London, England) in Dec 2017", "Interview Descriptions": "Very impersonal, not much introduction, got thrown straight into a presentation I had to prepare beforehand as soon as I was led into the interview room. I was the 4th and last candidate that, day, the three interviewers seemed tired. Questions were standard and performance-based, the whole thing was very impersonal and overly formal. 4 weeks later and still haven't heard from them, which I find unprofessional. Upon asking them when the role would start, they \"didn't know\".", "Interview Questions": "If someone in my team would take away a promising case I was working on, because they had more experience, how would I feel"}, {"date": "8 Jan 2018", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Actionaid (London, England) in Nov 2017", "Interview Descriptions": "Was never contacted about the income despite interviewing for a senior role.  Assumed I didn't get the job but was surprised to not be formally told. This is particularly bad as I had previously been a volunteer campaigner for ActionAid. But I won't be doing this again as they clearly have no respect for the fact that I did that or for the time I took to both prepare for and undertake the interview.", "Interview Questions": "Competency based."}, {"date": "16 Feb 2017", "title": "M&E Specialist (Maternity Leave) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Actionaid (London, England) in Oct 2014", "Interview Descriptions": "I submitted by CV and cover letter, after 2 weeks I was asked for an in-person interview. The interview was with 2 people, with one person calling in on skype. The connect was not great and it was difficult to understand this person's questions and for my response to be clearly understoon.", "Interview Questions": "M&E principles anda experience with analysis "}]]