[[{"date": "N/A", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "The process was well communicated, and expectations were clear. There were multiple parts of the interview that helped me to understand the expectations of the job more throughout. I enjoyed the video question part and think this is a great way to get through the interview process more quickly.", "Interview Questions": "It was geared towards me as an individual and how I would contribute to the classes, which I really appreciate."}, {"date": "21 Jun 2023", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Southern New Hampshire University", "Interview Descriptions": "For the interview, you will receive an email asking you to complete a 45-minute session on HireVue, which includes recording self-made videos and written responses. I declined the one-way interview because this format may lead to discrimination and bias.", "Interview Questions": "N/A"}, {"date": "28 Jun 2023", "title": "Marketing Automation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Jun 2023", "Interview Descriptions": "- 3-step interview process. 1st was a recorded interview answering typical questions related to the role - 2nd interview was very conversational - In the 3rd interview, I was shown a glimpse of the daily tasks within various systems", "Interview Questions": "Tell me about your experience with MC?"}, {"date": "26 May 2023", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Applied for an Adjunct Faculty position. Completed a HireVue and then interview with recruiter. Questions were straight forward and the interview experience was positive. Overall process took several weeks to hear back. Great place to work. With a lot of support.", "Interview Questions": "Q: How would I teach to remote learners?"}, {"date": "3 May 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "A series of online interview questions. Your responses are recorded (video). Following the interview questions I had a 10-minute overview with the HR person. A few days later I received an offer letter.", "Interview Questions": "I forgot but they were general adjunct questions"}, {"date": "16 Apr 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Fantastic and easy interview process. Took about 6 weeks from application date to offer date. First interview was self paced, 3 video questions and 4 essay questions. Second interview was a 30 min phone call with an HR employee - she was nice, well informed, and communicative throughout the entire process.", "Interview Questions": "Basic questions about teaching experience"}, {"date": "4 May 2023", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Apr 2023", "Interview Descriptions": "They did not really ask any questions to get to know me or any questions regarding academic advising at that. I researched a lot about the interview process and they asked none of the questions listed by others here; or even similar questions. Just basic, odd questions; they probably are actually data analysts. \r\n\r\nI agree with what was said by someone else on here on how a Bachelors Degree & great recommendations/references isn’t enough. So if that’s all you’re going off of;  do not waste your time interviewing. \r\n\r\nAlso, if you are a non-white person of color; beware that there is no diversity here. I interviewed with up to six managers/team leads and not one of them were a person of color.", "Interview Questions": "What are your work experiences and skills?"}, {"date": "2 Apr 2023", "title": "Campus Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Meet with so many interviews and takes forever to make a decision. If you’re an employee of color, they try to talk you out of the job. It’s hard to know who to contact to ask questions.", "Interview Questions": "N/A"}, {"date": "18 Jan 2023", "title": "Curriculum Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University", "Interview Descriptions": "The First Round of Interviews Consisted of: Virtual and Video Interview The Second Round of Interviews Consisted of: Leader Panel The Third Round of Interviews Consisted of: Peer Panel, Present a Project", "Interview Questions": "Experience with Adult Learning Theory"}, {"date": "12 Jan 2023", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "More rigid than anticipated. Questions were related to background, educational experience, diversity of student population and experience with online LMS systems such as Brightspace. Interview was relaxed and the staffer working with me kept me at ease during the process.", "Interview Questions": "Tell us about your experience with diversity and inclusion in the classroom?"}, {"date": "23 Feb 2023", "title": "Curriculum Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Southern New Hampshire University (Manchester, NH) in Jan 2023", "Interview Descriptions": "First round was virtual on Harver platform. Five basic questions. Then a Zoom with the hiring manager and some other leaders. Then a task. Then present the task to a panel consisting of the team you’d be working with. I put a lot into it and didn’t get any feedback other than they were moving forward with other candidates. When a candidate gets this far in the process, it should be standard practice to give at least some constructive feedback as compensation for the time and effort put forth. After all, this person will be moving forward with other potential employers and likely wants to improve their professional profile to land the next one.", "Interview Questions": "How would your previous coworkers describe you? How would your previous supervisors describe you?"}], [{"date": "N/A", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "The process was well communicated, and expectations were clear. There were multiple parts of the interview that helped me to understand the expectations of the job more throughout. I enjoyed the video question part and think this is a great way to get through the interview process more quickly.", "Interview Questions": "It was geared towards me as an individual and how I would contribute to the classes, which I really appreciate."}, {"date": "27 Dec 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "online/ virtual. not with a real person. didnt meet expectations. exceeded qualifications for the job however didnt pass first interview. the interview was not personable. I did not receive any feedback on the interview or the process itself.", "Interview Questions": "What are your expectations of this role?"}, {"date": "21 Dec 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Phone screen interview, then training and background check. Not bad at all. Also asked about degrees and transcripts. Also inquired about teaching experience. She also asked about courses previously taught.", "Interview Questions": "Questions about past teaching and transcripts."}, {"date": "16 Dec 2022", "title": "Academic Advisor I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "First interview is done by recording answers for 7questions. You can record as many times as you wish. Nxt they will do the video interview. And you need to present 4 references.", "Interview Questions": "Exceptional service experience that you have provided."}, {"date": "9 Dec 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "I applied online, just before the pandemic. I had a video interview and submitted responses online. After I was selected for an in person interview. Although others interview process may be fully online", "Interview Questions": "What is your reasoning for choosing SNHU"}, {"date": "26 Dec 2022", "title": "Technical Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University in Dec 2022", "Interview Descriptions": "I started with a 30ish minute interview with a recruiter, but then after that they requested four references which is very excessive. I decided not to proceed further as I feel as though the process would have been long and drawn out and having to provide four references is unacceptable as they wanted essay type questions from these references.", "Interview Questions": "What are some of the product teams you have worked with?"}, {"date": "21 Mar 2023", "title": "Student Experience Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern New Hampshire University in Nov 2022", "Interview Descriptions": "This was a very basic digital interview where you record your answers to a few questions. I actually enjoyed this one compared to my first digital interview 6 months prior for a different job with SNHU. There were more opportunities to practice your answer to the question. Digital interviews are so hard because you're just talking to a screen and there's no immediate response, so practice helps it feel more natural.", "Interview Questions": "What does professionalism mean to me?"}, {"date": "18 Oct 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "It was very well streamlined and efficient. The team seemed organized and collaborative. Very professional and common for online employment. Follow up was quick and responsive. Onboarding was very streamlined as well.", "Interview Questions": "Specific to the job. They did most of the talking."}, {"date": "5 Oct 2022", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "I filled out an application online and they got back to me quickly. I spoke to several people on campus and was offered to teach classes. It seemed much less involved than expected.", "Interview Questions": "How do I feel about grading papers/exams?"}, {"date": "4 Oct 2022", "title": "User Experience Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "I've interviewed for Faculty and Staff roles at SNHU, and each time the process started with a video-recorded interview with up to five questions to respond to. The interviewee had 3m to respond to each question, and the good thing was you could re-record an unlimited amount of times to your satisfaction.", "Interview Questions": "Describe your relevant past and current experiences as it relates to this opportunity."}], [{"date": "26 Oct 2022", "title": "Online Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Covington, GA) in Oct 2022", "Interview Descriptions": "The application/interview process was very organized. I filled out an application and was contacted within a couple of days. I completed a virtual interview during which I had to record videos and answer questions. I also had to reply to sample emails. After that was completed, I was contacted for a phone interview with a talent acquisition consultant. Before the interview, I was asked to send in a list of courses I was interested in teaching. The interview was about 20 mins long. She was to the point and very friendly. The entire process (application to offer) was complete in about 2 weeks.", "Interview Questions": "What interests you about teaching online with SNHU?"}, {"date": "30 Sept 2022", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Anchorage, AK) in Sept 2022", "Interview Descriptions": "I applied online. The process took less than 2 weeks. First, I completed a virtual video. Next, I was invited to participate in a Zoom style panel interview. The panelists were a bit snooty, but cordial.  All of these gatekeepers were the same giving me the impression that there is little diversity in this department or in the school as a whole. Although the interview was thought-provoking, it was minimally invasive.  I was able to argue my case by showcasing my skills, experience, and ideology for the job. Even though I believed the interview went fairly well, I had the overall suspicion that I wasn't their type of candidate. My intuition was correct because 2 days later I received the standard rejection letter. \nI really wish companies like this would be more forthright in describing the type of people they're looking to hire so that they don't waste anyone's time going through the song and dance of an interview knowing in the end that you aren't interested in diversifying the team.  There's really no need to pretend you're interested in broadening the workforce. Please, let the recruiters know the type you're looking for so that they can filter out those who don't fit into the mold.", "Interview Questions": "How would you respond to a student who said they've already applied to 200 companies and haven't gotten any callbacks?"}, {"date": "1 Sept 2022", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "The interview is done online. There are 5 questions. You can record the video more than once. You never meet a person and it takes a long time to hear back.", "Interview Questions": "Very general about how you design. You can see the questions before recording if you need time to think. You can also record multiple times."}, {"date": "18 Aug 2022", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 days. I interviewed at Southern New Hampshire University (Stone Mountain, GA)", "Interview Descriptions": "1st interview is self paced. You can re-record as much as you need to. Next steps was given a few hours after I submitted it which was to gather 4 references. After that I had a video interview via video. Called the next day to offer me the job.", "Interview Questions": "Tell me about a time you went above & beyond."}, {"date": "13 Aug 2022", "title": "Talent Acquisition Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (Columbia, SC)", "Interview Descriptions": "The interview process was thorough and professional.  Hands  down the best organized process I've been through.  From the recruiter to the senior leadership, you could tell that everyone loved their job and wanted to be where they are.", "Interview Questions": "Tell me about yourself and what got you here today?"}, {"date": "25 Aug 2022", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University in Aug 2022", "Interview Descriptions": "Very easy process. The first part is a self-recording of 6 questions. You can retake the video as many times as you like until you're confident with it. The second part is an actual interview which is more about telling yourself and then questions at the end.", "Interview Questions": "What makes an effective remote employee? \n\nWhat is it about the Admissions Counselor position that you like?\n"}, {"date": "1 Sept 2022", "title": "Director Program Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University in Aug 2022", "Interview Descriptions": "Pre-recorded interview for first round which had technical frustrations in uploading videos, required four references prior to first round of which two required to be supervisors, first round interview was clunky", "Interview Questions": "Asked about experience as a product owner and plan for starting a new project or program"}, {"date": "7 Jun 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University", "Interview Descriptions": "extremely easy interview. panel or 4 team lead (which are really data analysts) and they ask questions related to customer service... be friendly, you'll be hired. the role has nothing to do with academia, more on if you're a \"people person\".", "Interview Questions": "how would you respond to a student struggling with classes? answer tip: say you'll talk them into staying (so snhu gets paid). thats the bottom line..."}, {"date": "21 Jun 2023", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Southern New Hampshire University (San Antonio, TX) in Jun 2022", "Interview Descriptions": "One digital interview with a set of questions regarding student success and role description and experience. One interview with Team Leaders Final step, appointment with recruiter to go over start date and amazing benefits!", "Interview Questions": "Different scenarios of how you dealt with a difficult situation with a student. Strong focus on problem solving."}, {"date": "18 May 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "This was a very easy process. Video online submission. Easy and the best part... you can practice a few times first . That makes you fell at ease. I really enjoyed it!", "Interview Questions": "N/A"}], [{"date": "11 May 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Easy, quick, fast-response. It took about 3 weeks to get a call back after I applied. Then a video interview and then a phone interview followed shortly after. Once the phone interview concluded it was another week or two before I received an offer.", "Interview Questions": "A question regarding how would you contribute to a diverse student body?"}, {"date": "3 Jun 2022", "title": "Peer Mentor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University in May 2022", "Interview Descriptions": "So far the interview process has been quite extensive for a part-time position.  I have gone through the application process, a virtual video recorded interview, and a phone interview with a recruiter.  I am currently scheduled to go through a final interview with a hiring manager.", "Interview Questions": "Why are you fit for this position?\n\nWhat is your work history?\n\nHow do you see yourself within the values of SNHU?"}, {"date": "25 Jun 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern New Hampshire University (Easley, SC) in May 2022", "Interview Descriptions": "They were prompt & asked good questions about work ethic. They also asked if I had questions that were still unclear. After the interview was over the let me know they would follow up, which they did.", "Interview Questions": "How were my organization skills differ be than others. "}, {"date": "18 Apr 2022", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Southern New Hampshire University", "Interview Descriptions": "They had a digital screening interview that was extremely annoying and awkward to work with. It was a very frustrating process where they sought to limit human interaction. Felt very off-putting and distant, and I couldn't help but feel that I was being ignored. This company does not value employees or their time.", "Interview Questions": "Tell us about your self"}, {"date": "29 Sept 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University in Apr 2022", "Interview Descriptions": "Interview process begins with a digital interview and then interview with the dean. The digital interview ask verbal questions and you have to submit 3 written questions. The written questions are how you would respond to students.  ", "Interview Questions": "Describe your online teaching experience in higher education. "}, {"date": "13 Nov 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern New Hampshire University (Manchester, NH) in Apr 2022", "Interview Descriptions": "Interview was conducted by phone. Very pleasant experience. Questions were Direct. and emphasized professional experience and application to be subject.. however, the format they used for recommendation seemed created for an experienced applicants.", "Interview Questions": "Why do you want to teach this field. Describe your pofessional relevant to this field."}, {"date": "20 Apr 2022", "title": "Career Engagement Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Southern New Hampshire University in Apr 2022", "Interview Descriptions": "I made it to the final of three interview rounds: \r\n\r\n1) HireVue recorded an interview with a robot. I was not too fond of this part - it was nearly dehumanizing to interact with outer space. To ease nerves of being recorded, it would be nice to have the opportunity to learn the questions a bit ahead of time, even if it were just an hour in advance, or be given to opportunity to complete a second take simply because this is an unnatural way to interview.  \r\n2) MS Teams interview with a panel of 5-6 individuals. This was a great experience, and I immediately felt comfortable and welcomed. \r\n3) Final Round via MS Team - I was informed I made it this far and was to give a 15-20 minute presentation in 4 days. \r\n\r\nI put a great deal of time and effort into preparing for, researching, developing, and rehearsing a presentation. I felt that each round went very well, and I was humble but confident in the interview. \r\n\r\nI was very disheartened to be passed over. However, that is the nature of the beast. I did find it inconsiderate to have put in such a great deal of dedication and passion into the whole process to be turned down an automated email! If a candidate completes the final round, please call to deliver the news and provide specific feedback. \r\n\r\nUPDATE: 24 hours after getting the automated rejection, I got a personalized email from the panel lead offering a meet-up to provide feedback. This was considerate and appreciated. \r\n\r\nSalary: No salary information was given or mentioned at any stage, and because this was a relatively new and unique position, no salary information can be found online. I'd kindly ask SNHU to be transparent to candidates about the salary range before interviewing. \r\n\r\nOverall, fantastic experience, and I'll definitely pursue another opportunity at SNHU.", "Interview Questions": "HireVue: What interests you in this position? How do you prioritize tasks?   When cross-functional teammates have other priorities, how do you gain their attention to your project? What can you bring to the position (or something like that). \r\nTell us about you. \r\nFuture goals and plans in the position. \r\nHow would you go about getting your recommendations implemented into the curriculum?"}, {"date": "27 Jul 2022", "title": "Conduct Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Apr 2022", "Interview Descriptions": "The first interview was a recorded session.   If you have not done a recorded interview before it can be challenging to get into a rhythm.   This consisted of 8 questions geared toward getting to know the candidate and their experience.", "Interview Questions": "Standard first interview questions and a few specific to the job.  "}, {"date": "25 Mar 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Went smoothly. She was to the point and asked only the pertinent questions you'd get anywhere else. I was asked to walk her through how I handle a day in the classroom.", "Interview Questions": "How I felt about early intervention. "}, {"date": "11 Mar 2022", "title": "Accommodations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "I applied for the position Accomodations Specialist in which I exceeded the minimum experience and educational qualifications.  Less than 24 later, I received an email that said they would be moving forward with other applicants.  I do not understand why unless it is because they ask the question about desired salary, and felt I asked for too much even though my answer was $20K less than my previous job.", "Interview Questions": "N/A"}], [{"date": "4 Mar 2022", "title": "Curriculum Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Southern New Hampshire University in Mar 2022", "Interview Descriptions": "-Very poor interview experience. The recruiter had a tone of coming across as a used car salesman because he answered my questions vaguely in regards to the position, the team, and the projects they were working on.\r\n-Asked your generic interview questions \r\n-Felt like he was marking off a checklist and rushed. From my experience, the most effective interviews are the ones where it feels more like a conversation between the recruiter and applicant.\r\n-Didnt seem that interested", "Interview Questions": "-Why did you apply to SNHU?"}, {"date": "4 Apr 2022", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Denison, TX) in Mar 2022", "Interview Descriptions": "1st interview was just answering questions verbally on the computer to an avatar.  I haven't had 2nd interview but it will on Wednesday.  It will also be online since this is a remote position but actual people will be on zoom.", "Interview Questions": "What were my qualifications and experience."}, {"date": "12 Jan 2023", "title": "Budget Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Nashua, NH) in Mar 2022", "Interview Descriptions": "Very knowledgeable and great benefits, including tuition assistance for both you and your family. No direct contact with departmental leads due to difference in salary regardless of interest. Responsive recruitment.", "Interview Questions": "Would I be more interested in internal budget-department or external?"}, {"date": "24 Feb 2022", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University in Feb 2022", "Interview Descriptions": "I graduated both from SNHU's online bachelors and also their brick and mortar graduate programs. After submitting my resume, I received an email back within 48 hours to schedule a digital interview where I recorded myself answering seven questions that you only have a minute to prepare for. \r\n\r\nWithin 24 hours I was invited to schedule a second interview over Zoom plus I needed to get FOUR references via a survey form. I'm a great employee and have had bosses tell me years later they wish I still worked for them, so I know my references were glowing. I also had a great time during my interview and felt that I really connected with the team leads who interviewed me. My interviewers and I got onto the topic of how the department is run, and they indicated that candidates are hired in \"cohorts\" that become your team throughout your time as an academic advisor, usually in groups of 10. \r\n\r\nDespite the good odds, I received a form rejection less than twenty-four hours after my second interview.  Acquaintances who work in this position say they get over 100+ candidates, some of whom have a graduate degree or certificate in academic advising. There is no preferred high education degree in the job listing as it is very highly customer experience based, which I have in spades. If they're getting SO MANY \"perfect\" candidates and only hiring the ones with academic and career advising graduate certificates, they have to disclose that on the job listing.\r\n\r\nTo be perfect for the job and still not get it is incredibly disheartening.", "Interview Questions": "What does professionalism mean to you?"}, {"date": "5 Feb 2022", "title": "Art Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "I applied for this position, met and even exceeded all of the job qualifications, but received a form letter back saying they were moving forward with more qualified candidates who better met their requirements.", "Interview Questions": "N/A"}, {"date": "4 Mar 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University (Nashville, TN) in Feb 2022", "Interview Descriptions": "Smooth process.  The interview process was smooth, efficient, effective, and respectful.  There were clear criteria and expectations. SNHU had a plan of action—for what they needed and what the candidate needed to provide. SNHU provided a clear, concise summary of this plan, which was most helpful for the candidate. The summary is helpful to both parties because it enables them to realize exactly what has been accomplished as well as to focus on a final concordance.", "Interview Questions": "In what areas are you a subject matter expert?"}, {"date": "15 Oct 2022", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Houston, TX) in Feb 2022", "Interview Descriptions": "The first interview was a video interview which was timed. This created a somewhat stressful experience. I went through several questions and then the last one was \"Here's the salary, now state that you agree with it.\" It didn't seem very welcoming. In the face to face interview, the person I talked to was extremely kind and friendly. I would've loved to have worked with her, but what they were asking for was more of a test generator than a designer and I feel like I was the wrong fit. However, they were very kind and friendly.", "Interview Questions": "How did you hear about us?"}, {"date": "27 Feb 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University in Feb 2022", "Interview Descriptions": "Made the process easy, everyone was friendly, quickly responded to inquires.  Phone call took about a half hour abs steps were clearly explained. They provided the resources I needed to make a decision", "Interview Questions": "Why did you chose snhu"}, {"date": "24 Mar 2022", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University in Feb 2022", "Interview Descriptions": "Video questions at first (three questions), this was  followed by a phone interview with human resource. Phone call lasted about 15-20 minutes. Received an email a week later with the job offer.", "Interview Questions": "tell me about yourself \nprior teaching experience\ncourses taught\nsomething i can implement base on my own undergraduate experience "}, {"date": "24 Jan 2022", "title": "IT Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Say what you will, but I find one-way video \"interviews\" to be very cold and impersonal, if not dehumanizing. SNHU seems like a great, fast-paced place to work for but frankly I can't say I'm interested in working somewhere  where I can be \"filtered out\" without even speaking to someone personally.", "Interview Questions": "Generic \"why are you a good fit\" questions."}], [{"date": "11 Jan 2022", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "They had me contact four references and submit a survey from each of them and then I didn’t hear anything from them for over a month. I wish they would have waited until further in the process before making my references fill out time consuming surveys about me", "Interview Questions": "How your background and experience fit the role"}, {"date": "12 Jan 2022", "title": "Admission Processing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Two one one interview with direct boss, and department head. Both were extremely friendly and asked position-related questions. Didn’t take more than 10 minutes and offered me a job on the spot.", "Interview Questions": "How will you deal with the repetitive tasks that are required by this position?"}, {"date": "27 Dec 2021", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Very easy. They did everything online. It was fun to meet everyone I would be potentially working with. They communicated quickly and made the whole process super enjoyable. I was happy with it.", "Interview Questions": "Please tell us about yourself?"}, {"date": "7 Dec 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern New Hampshire University", "Interview Descriptions": "1st interview is a record yourself. Very easy and user friendly. 2nd interview was a google meet video call. It took about 20-25 minutes. The women who interviewed me was kind. I felt like the questioned aligned with the job description", "Interview Questions": "Previous experience working remote? A time where you went above and beyond in a customer service position? What does professionalism mean to you?"}, {"date": "8 Dec 2021", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Southern New Hampshire University", "Interview Descriptions": "The interview process was long, but relatively easy. First, you complete a video interview, then a short phone interview. The video interview can make people nervous if they aren't familiar with that kind of format.", "Interview Questions": "Why are you interested in this position?"}, {"date": "26 Oct 2021", "title": "Makerspace Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "the interview process was very easy. It was virtual which i was nervous about but it ended up being really easy. I would like more places to offer this virtual interview option", "Interview Questions": "N/A"}, {"date": "26 Aug 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Southern New Hampshire University in Oct 2021", "Interview Descriptions": "Hiring process was very long. I applied and received a request for an interview. I had to record myself and do short answer questions. About 6 weeks later, I got a phone interview. The lady was very kind and only asked me a few questions. About another 6 weeks later, the department accepted me and sent me an offer.", "Interview Questions": "I believe one was: how would I handle a student who made a controversial discussion post? "}, {"date": "31 Aug 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Southern New Hampshire University (Indianapolis, IN) in Aug 2021", "Interview Descriptions": "It took about 2-3 weeks to be contacted to set up the initial phone interview. There were 4 interviews total and one attention to detail assessment. You are also required to provide 4 professional references, 2 manager and 2 coworker. Two of the interviews had STAR style questions, one of which had cultural type questions too. One of the interviews was mostly asking questions more related to the job and my experience. The questions can be intense, so it’s essential to prepare and have notes at the ready. I had several practice questions and answers written down and it was still a little intimidating.", "Interview Questions": "Tell me of a time where you had to tell someone no"}, {"date": "9 Jul 2021", "title": "Call Center Phone Agent Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "disorganized, slow to respond . wanted info a s a p and was slow to hear back from.  Nice benefits that they offer though interview is too hard considering the pay offered and that it doesn't require college degree.", "Interview Questions": "about star scenario questions okay"}, {"date": "29 Jun 2021", "title": "Customer Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Simple 3 interview process. The first two were digital and then one in-person interview. Quick process once started but can take a while to reach out to you. Overall a normal interview process.", "Interview Questions": "How do you feel about working for a non-profit."}], [{"date": "19 Feb 2023", "title": "Transfer Credit Evaluation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern New Hampshire University (Manchester, NH) in Jun 2021", "Interview Descriptions": "Remote interview with 2 people. Was very welcoming and comfortable. Made sure to answer any questions I had, and seemed interested in people as a whole not just as an employee.", "Interview Questions": "What is a hobby you enjoy when you are not working?"}, {"date": "24 May 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Used a video format to answer questions and then proceeded to a virtual interview. The people involved were very patient, friendly, and accommodating. This whole process was a very smooth thing.", "Interview Questions": "How does previous employment prepare me?"}, {"date": "10 May 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Raleigh, NC) in May 2021", "Interview Descriptions": "The interview process wasn't complex at at all. I did have to interview twice. The first interview was a video recorded where you answered video questions and typed scenario answers to questions. It was total of six questions and I felt comfortable being able to answer them. My second interview I did a zoom meeting  with three staff of the academic advising department.  The interview lasted around 40 min. I enjoyed the second interview because I got the chance to understand SNHU way of life.", "Interview Questions": "How where you able to learn from peer constructive criticism ?"}, {"date": "15 Jun 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University in May 2021", "Interview Descriptions": "Interview process first consisted of a timed recorded answer to questions via video and words. Follow-up interview was conducted over phone with general questions. Overall, the process was succinct and thorough.", "Interview Questions": "How would you ensure students know they can reach out to you?"}, {"date": "29 Apr 2022", "title": "Transfer Credit Evaluation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University in May 2021", "Interview Descriptions": "The interview was a 30 minute Zoom call with two managers in the department I was applying to. They asked about 6-7 questions about my interest in higher education, how I felt working with different types of students,  why I was interested in this job, remote work interest, and general questions about myself. Both managers were incredibly friendly and easy to talk to. The next day I was asked to submit references, which was an online survey, and I got the job offer about a week later.", "Interview Questions": "Why do you want to work for SNHU?"}, {"date": "22 Apr 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "The process was streamlined and appropriate for the position. It was questions in regards to my previous experience and how you would react in some difficult situations. It prepared me for the position well. I enjoyed the process and would urge others to check it out as well.", "Interview Questions": "How would you react in situations A,B,C?"}, {"date": "8 Apr 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Excellent,  professional online interview process.\nThe interviewer made for a very comfortable, laid back but informative interview.\nThe online format( Zoom -Ringcentral) was vaeary good. Good audio and visual. \nThe questions asked were very to the point and allowed time for answers and discussionsl", "Interview Questions": " What is your Vision for the course?"}, {"date": "18 Mar 2021", "title": "Finance Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "The interview started out with a digital recorded interview. From there I was contacted to set up a zoom interview with the two supervisors in the department. The actual interview process was smooth, however, it took four weeks before hearing back about the position.", "Interview Questions": "Describe a time you went above and beyond with a customer."}, {"date": "22 Jun 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2021", "Interview Descriptions": "Recruiter and manager team interviewed me. Orderly process. Excellent benefits. Highly recommend. Very focused on student service so be sure to highlight service background.  Southern new hamp shire university is exciting place to be!", "Interview Questions": "Tell me about yourself and service background "}, {"date": "24 Feb 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Southern New Hampshire University in Mar 2021", "Interview Descriptions": "Average interview process. A lot of technical questions quizzing you on your specific skillset. It came across like they were trying to throw heavy curveballs to see how you handle it. If you are not technically skilled, you would probably find the questions intimidating. A lot of questions about your personal life which I found kind of odd.", "Interview Questions": "What do you like to do for fun?\r\nHow would you describe your personality?\r\n"}], [{"date": "5 Feb 2021", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Fast and Easy! Had my first video recorded interview within 72 hours of application and phone interview within a week and hired within 3 weeks. Great young lady interviewed me and wrote down my responses. Very professional and fluid.", "Interview Questions": "Past experience teaching in the Communication field."}, {"date": "22 Jan 2021", "title": "Transfer Credit Evaluation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Southern New Hampshire University in Jan 2021", "Interview Descriptions": "Applied online and received an email asking to schedule an interview through RingCentral. I interviewed with two friendly women and they asked me typical interview questions. A few days later, I was contacted about providing references and then once those were done, I was offered the position!", "Interview Questions": "How do I define professionalism?"}, {"date": "9 Dec 2020", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Was great. Snhu was very nice and positive about the whole experience. Didn’t ask questions that made me feel different about the job. My interviewer was great and very friendly.", "Interview Questions": "Why did you apply for this job?"}, {"date": "29 Dec 2020", "title": "Transfer Credit Evaluation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Nov 2020", "Interview Descriptions": "I submitted an application online and the next week I got an email to set up a live video interview. The interview seemed to go well and it sounded like I would be a good match for the job. I was interviewed by two women who were professional and friendly. The interview lasted 30 minutes. \n \nA few days after the interview, I was contacted about submitting references. A minimum of 5 references were required and the references had to fill out a survey. I had all of my references submitted within 2 days. Once they were submitted, I received a call from my assigned Talent Acquisition Consultant to discuss a possible new requirement for the role. The job was listed as being fully remote, however he said now they are considering an on-campus requirement once the COVID restriction is lifted in June. He asked me if I would be open to the possibility of relocating if that did become a requirement. I said I was open to relocation in the future, but it was not something my family could do right now.\n\nAbout a month went by since that last conversation and when I heard from him again. I sent 2 follow up emails within that month and they were not immediately replied to. Once I did receive a response to my second follow up email, I was told that it was no longer a fully remote position and they would keep me in mind if anything changes in the future. \n\nOverall the experience was okay, but a bit disappointing. I found it frustrating that the job was posted as being fully remote and quickly changed after. I also think they could improve in their communication. I get the impression that I would have never heard back had I not sent 2 follow up emails. \n\nThe interviewers were nice and the job description sounded great. \n\nI have noticed that in their recent job postings, they are putting \"temporarily remote\" in the description now. I'm glad they made this adjustment.", "Interview Questions": "What was a challenge you faced in the workplace and how did you handle it?"}, {"date": "20 Nov 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Southern New Hampshire University in Nov 2020", "Interview Descriptions": "It was quite thorough. Four references are required. The interview included a recorded video first with a verbal response as well as a written portion. Then a phone interview followed. Excellent recruiting process", "Interview Questions": "How I typically responded to feedback "}, {"date": "15 Apr 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Nov 2020", "Interview Descriptions": "The entrance interview is a video interview where applicants respond to three questions by video and complete two written prompts. The communication and instructions around this process is superb. Following this initial screening, a Zoom interview is scheduled for 45 minutes with three members of the Advising team. Again, communication and clarity around this process is above average. I received a job offer within two weeks of completing my interview with updates throughout the process.", "Interview Questions": "Can you provide an example of strategies you use to combat stress in the workplace?"}, {"date": "14 Dec 2020", "title": "Faculty Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Nov 2020", "Interview Descriptions": "Contacted by Talent Acquisition staff for initial phone call. Participated in several interviews with search team throughout the candidate process. Took personality assessment (caliper).  Hiring manager was accessible, transparent, and continually provided timely feedback and information about the search process and my candidacy.", "Interview Questions": "Asked about my past experiences, asked about interest in SNHU, asked about experiences in working as as a teammate and in an innovative environment."}, {"date": "21 Oct 2020", "title": "Finance Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "Initial interview through Hire Vue App ( record yourself answering 3 questions) then Zoom interview with 2 managers. Followed up with link for reference check. Reference check was very in depth and needed to provide 5 who are willing to complete a survey on your behalf.", "Interview Questions": "What is a challenge you have faced at work and how did you overcome it?"}, {"date": "21 Oct 2020", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Southern New Hampshire University in Oct 2020", "Interview Descriptions": "Before I go in to the negatives, I just want to say that I enjoyed attending SNHU as a school quite a bit.  From other reviews, I'm also pretty sure they're a fine place to work. With that said, I was not impressed with how they handled the interview process. I will say a lot of this probably had to do with the COVID-19 pandemic. \r\n\r\nI started the process back in May and it seemed pretty easy at first. There was a short digital based interview through an app that asked pretty standard stuff. After that, they scheduled a video interview with a live person. This gentleman was extremely professional and easy to talk to, and mostly asked questions typical of a standard interview. He also went over what made SNHU a great place to work, and was pretty convincing.\r\n\r\n After this interview, I was instructed to fill out a reference sheet and was told I'd be reached back out to again shortly. Weeks passed and I wasn't told anything, so I figured I'd give the person who's name was in the automated Workday emails a call to ask what was up. She stated that as of right now they were currently not hiring for that position but remained interested in me and would let me know when I could see about next steps. A little weird they still kept up their job postings everywhere if they didn't have openings of these positions, but ok, fine. I wasn't in a big rush to be hired luckily, so I figured I'd wait. \r\n\r\nOver a month passed and I got a little anxious about getting into a new career. I went ahead and emailed the woman who I had called previously and asked if they were perhaps hiring for another one of the roles from their job posting. She told me that they were hiring for a financial aid rep and asked me to review the role description and email her back if I was interested. I emailed her back immediately that I was, but did not hear anything back. I emailed her again a week later, and nothing. By the end of August, I still hadn't heard anything back about either of the roles and had obtained my bachelor's degree in the time I had waited. Even though by this point I was pretty sure she wouldn't reply, I emailed asking if I could switch my application to go for the Academic advisor role. I then got an automated looking email from her stating that I got moved forward and that I needed to schedule an interview with a group of their team. I did so, but was unsure of what role I was even interviewing for at this point. I asked, but got no reply once again.\r\n\r\nAfter 4 plus months of waiting, I finally had this third interview with a group of people that worked for SNHU. The video call was incredibly laggy and I'm not sure if this was due to issues on my end or their's. That said, we were able to get through the interview okay, though they only really had two questions. I asked them firstly what role I was interviewing for, and maybe they didn't like that because the interview that was supposedly going to take like 30 minutes ended rather fast. They asked me basic questions about where I see myself in 5-10 years and why I wanted to work for SNHU. They asked nothing else and told me that I'd get an email \"fairly quickly\" about whether I was being moved forward or not. I got a denial email like a day later.\r\n\r\nOverall, the people from SNHU were pleasant and nice. However, the process seemed EXTREMELY disorganized and communication was not handled well at all. If you're applying for any of their roles right now, I'd say be prepared to possibly be waiting around for a good while.", "Interview Questions": "Where do you see yourself in 5-10 years?\r\nWhy do you want to work for SNHU?\r\nName a time when you dealt with a challenging situation."}, {"date": "25 Aug 2022", "title": "Transfer Credit Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University in Oct 2020", "Interview Descriptions": "Very easy process overall - I was invited to do a digital/recorded interview, then had an \"in person\" video call interview - both were very concise, and easy to navigate. The emails from the talent acquisition coordinator I worked with were very prompt & they always got back to me quickly with any questions I had!", "Interview Questions": "Explain a time that you overcame a conflict with a coworker."}], [{"date": "20 Sept 2020", "title": "Student Support Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Good Process, received a phone call interview first.\r\nFollowed by a digital interview with two people within the department.\r\nCome prepared with questions to ask your interviewer. As its a very competitive job market!", "Interview Questions": "Why do you want to work for SNHU?"}, {"date": "20 Jul 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Tucson, AZ) in Sept 2020", "Interview Descriptions": "Modern and easy to schedule.  Started off with a digital interview which was interesting, but easy to navigate.  Follow-up interview was via zoom and questions were pretty standard for this kind of position.", "Interview Questions": "Describe a time where you were faced with a challenging situation at work?"}, {"date": "28 Aug 2020", "title": "Advising and Student Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Applied online, then had a brief phone screen, then virtual interview with 3 team members. The questions were behavior-based, personality type questions. Not many questions based on actual professional experience or how I would fit with the role. No communication until 3 weeks later and said they chose an internal candidate.", "Interview Questions": "What is something about you we don't know from reading your resume?"}, {"date": "27 Jun 2021", "title": "Adjunct Faculty Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Aug 2020", "Interview Descriptions": "The process is divided into 3 stages and was very thorough. I got to ask as many questions as needed about the university and the course I would be teaching. The faculty recruiter was very knowledgeable and quick to return emails.", "Interview Questions": "What was one time I received feedback about something I needed to improve?"}, {"date": "6 Jan 2022", "title": "Nursing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2020", "Interview Descriptions": "The first interview is a video interview where you read a question and then record your answer.  It is impersonal and does not allow for the personal connection \r\nI will never interview again for a company that can't take the time to meet me in person.  It demonstrates a lack of interest from the beginning", "Interview Questions": "Name a time when you had a conflict and how did you overcome it?"}, {"date": "22 Jan 2020", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Southern New Hampshire University", "Interview Descriptions": "I was contacted by a recruiter on linked in. I had a call with the recruiter, then with the hiring manager. Then an in person interview with the manager and two team members. Received an offer soon after.", "Interview Questions": "There was a sql test for the business analyst position."}, {"date": "5 Feb 2020", "title": "International Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University in Jan 2020", "Interview Descriptions": "I applied online and then was asked to do a virtual interview. They ask you five or six questions about general customer service experience and other stuff of that sorts. Got called to do an in person interview. Went for my interview, it was one-on-one. Easy interview, staff seemed very friendly and eager to conduct the interview. Then got an email a few days later to check for references.", "Interview Questions": "Why did you want to be an admissions counselor?"}, {"date": "15 Nov 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "After completing online interview I was invited for an in-person interview with two team members. Five open-ended questions were given. Team members were friendly and were able to answer questions I had.", "Interview Questions": "Name a challenging time and what did you do to overcome it. "}, {"date": "22 Oct 2020", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Oct 2019", "Interview Descriptions": "The interview was pleasant and the proctor was extremely nice and made me feel relaxed. Challenging but not overwhelming, and an amazing company to work for. The interview questions were very standard, a time I learned something new, had a challenge, a new idea, etc. You had to think on your toes, but I naturally added humor in there that they seemed to really appreciate. There were 3 other people there for interviews, which may be intimidating, but SNHU fills a lot of positions so don't let that get you down.", "Interview Questions": "\"Describe a time you had to learn something new\""}, {"date": "18 Feb 2020", "title": "Writing Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Sept 2019", "Interview Descriptions": "The interview process was a combination of internal HR and management. There were several in person group interviews. It was a challenging interview, because they take their time to determine a great fit for the company, the team and the culture.", "Interview Questions": "How do you see yourself improving on the learning process of students, and what outside resources can you bring to the table?"}], [{"date": "5 Aug 2019", "title": "Student Experience Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (New York, NY)", "Interview Descriptions": "The first interview took place online through HireVue. It was very impersonal. I feel this style of interview is suited to \"the selfie generation.\" For those of us that still like two way interaction and don't hide behind smart phones, it may feel very robotic and sterile. Questions were pretty standard interview questions. \n\nIt took about a month to hear back. I was invited for an in person interview however the hours were changed from the original job posting. I appreciate hearing back, however I feel the hours should be accurate before accepting interviews otherwise it's a waste of everyone's time.  I don't think I would apply again after this experience.", "Interview Questions": "Why are you interested in this position?"}, {"date": "25 Jul 2019", "title": "Admissions I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Digital interview was phenomenal. It was really neat to see how technology can really help us. The next day I was contacted by Human Resources to continue my application and possible employment. Incredible!", "Interview Questions": "Tell me about a time where you had to follow rules and regulations and how you did. "}, {"date": "29 Jul 2019", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Jul 2019", "Interview Descriptions": "It was my second go around with SNHU, I had applied for advising, so I kind of knew what to expect, it is not very thorough, at least in the sense that they wanted to know anything job related. It was mostly things to do with emotional intelligence and \"fit\"", "Interview Questions": "How have I grown in the intervening time between my first interview and this one "}, {"date": "11 Sept 2019", "title": "Assistant Athletic Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern New Hampshire University (Hooksett, NH) in May 2019", "Interview Descriptions": "I received a phone interview that outlined the details of the job and what they entail. At the end of that phone interview, I was asked to come to campus for a half day in person interview.", "Interview Questions": "How do you deal with change?"}, {"date": "15 May 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2019", "Interview Descriptions": "There was a phone interview and in-person interview with the team. It was great to meet with various team members and learn about their roles and how I would be partnering with them.", "Interview Questions": "Questions related to experience managing a team."}, {"date": "31 Jul 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2019", "Interview Descriptions": "5 questions and discussion between myself and a panel of team leads and a director.  The interview lasted about 30 minutes.  Interview was average in length of time and difficulty.", "Interview Questions": "Tell me about a time and how you overcame technology obstacles?"}, {"date": "15 Apr 2022", "title": "Career Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2019", "Interview Descriptions": "A pleasant interview candidate experience. Interviewers explained company culture well. Positive energy and clear communication throughout. Unfortunately, due to the COVID-19 pandemic the role was rescinded shortly after extension of offer.", "Interview Questions": "Explain your experience with Excel. "}, {"date": "31 Jul 2019", "title": "Capital Infrastructure Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2019", "Interview Descriptions": "Screening call with HR; formal face-to-face  interview with a variety of key team members (9).  The team presented a variety of situations and asked me to provide my resolution to it.\r\nI also provided past situations I had and how I resolved them.", "Interview Questions": "Asked me how I handled teams in political situations and when projects went off schedule how did I handle the teams."}, {"date": "8 Jul 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Feb 2019", "Interview Descriptions": "I went through one pre-recorded video interview, followed by a Skype interview with 2 members of the hiring process. There was a decent wait time between each stage, and I was also required to get 3 professional references, who filled out detailed questionnaires on various aspects of my ability and temperament.", "Interview Questions": "Describe a time when you had to coach someone through a difficult conversation"}, {"date": "17 Feb 2019", "title": "Financial Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University in Feb 2019", "Interview Descriptions": "I first received an email to complete a \"virtual\" interview, which had the basic interview questions, it was very simple! Then, I got another email, very quickly, to set up a in person interview, which was pretty tough but at the same time comforting! Lots of questions were asked and they weren't your typical interview questions, but much deeper thought questions. Three workers would come into the room with you and all of them would ask you a couple of questions. They were very friendly and I did not feel interrogated at all! I felt like I was already part of the team.", "Interview Questions": "Name 3 weakness and 3 strengths. "}], [{"date": "4 Jun 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Jan 2019", "Interview Descriptions": "Partially online and then a 15 minute interview in person, got back to me very quickly, answered my emails for questions I had about the process, I enjoyed working with their HR department", "Interview Questions": "N/A"}, {"date": "11 Feb 2019", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern New Hampshire University in Jan 2019", "Interview Descriptions": "Poor interview process.\r\n\r\nThey do their best avoid talking to candidates on the phone and do not answer emails.\r\n\r\nYou will be asked what you expect to make on the application, if it is over the 25th percentile for the region you will be immediately rejected without an explanation. \r\n\r\nIf you make it past the income expectations you will be asked how you feel about working a lot of overtime uncompensated & how you feel about waiting for a bus from remote parking for up to 30 minutes each way.\r\n\r\nNo questions about analytics though, nothing about data. \r\n\r\nCompared with other local universities with better reputations, an uninspiring interview process with a lot of institutional ego and little understanding of the field or the market right now.", "Interview Questions": "How much do you expect to make?"}, {"date": "12 Feb 2019", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Southern New Hampshire University (Manchester, NH) in Nov 2018", "Interview Descriptions": "The interview process started out very efficient.  There were 4 individual phone interviews over the course of several weeks.  These interviews were scheduled and coordinated by an SNHU Talent Acquisition specialist.   After these phone interviews, I was contacted by the specialist to schedule an onsite interview which would include a flight, hotel, etc.  The specialist turned me over to an Admin Manager who would coordinate the onsite visit.  The onsite interview was an all-day session with 6 separate, 1-hour interviews with 1-2 SNHU leaders.  At the end of the day, i was advised that i will be notified within a couple of weeks of the next steps.   Unfortunately, 6 weeks went by and i heard nothing from the Admin Mgr.  I reached out to her several times and received no response.  I reached out to the original Talent Acquisition Specialist and received no reply.  It wasn't until i reached out to one of the executives  did i receive a reply of \"we have filled this position....\".  There was no apologies for the nearly 2 month gap or explanation.  I find this level of communication to be unacceptable for a leadership role.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Oct 2018", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Very intimidating. Sat in a room with three people, asked 7 “tell me about a time when you.....” questions. Didn’t try to get to know me at all. No back and fourth conversation just 3 people judging you while you squirm.", "Interview Questions": "Tell me about a time when you faced an obstacle at work, how did you overcome it?"}, {"date": "6 Oct 2018", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Interview was brief and interesting . I applied for the job and got an email within a week to attend an interview . The interview was one on one and basically about customer service since the position is more of from deak", "Interview Questions": "Tell us about yourself "}, {"date": "11 Sept 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University in Jul 2018", "Interview Descriptions": "Apply online. Got an e-mail about a week later, inviting me to do a recorded interview. Recorded myself answering 5 questions, and then a short essay question about why I wanted the job. Received an e-mail a week later, asking me to participate in a panel interview via webcam. They asked for reference checks that same day (5 references needed, each of them get e-mailed a survey asking about you). You have to do a personality assessment when you get asked for your references. Background check is completed once they offer you a job. The whole process took about a month.", "Interview Questions": "Why do you want to be an advisor?"}, {"date": "1 Jun 2018", "title": "Manager Team Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "I was called by recruiter for a phone screen. They had me come in to meet four people. I felt the interview went good. They then called me a week later to have me do another interview via their hirevue platform.  Very impersonal, awkward, unnatural way to interview. Never heard back from them after that.  This is the last time I apply at SNHU. I expected more from them on a professional level.", "Interview Questions": "Describe a time you had a conflict with a co-worker and how did you handle it."}, {"date": "26 Jul 2018", "title": "IT Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in May 2018", "Interview Descriptions": "2 phone, 2 in person. It seemed really well thought out and organized through Workday.  Everyone was super nice and helpful throughout the process. There's massive growth going on and there's a great feel of community at SNHU. A great place to interview - very Boston feel", "Interview Questions": "why SNHU? "}, {"date": "15 Jul 2022", "title": "Course Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University in May 2018", "Interview Descriptions": "Interview process starts with digital interview answering questions which is very awkward. After that standard HR call and in-person interview. If you are qualified for the job and have a good people person mindset/personality SNHU is a good fit.", "Interview Questions": "How would you broach a topic to a supervisor if you disagreed with them?"}, {"date": "16 Apr 2018", "title": "Military Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Received email notifying me of an online interview.  The process was fairly simple.  Had plenty of time to practice and rehearse.  Five recorded questions and one essay.   No time limit on the essay but could have used more time to answer the recorded questions.", "Interview Questions": "They asked several questions.  A standard \"Why do you want to work for SNHU\" and one that kind of threw me a bit \"Have you experienced conflict in the workplace.\""}], [{"date": "8 Sept 2020", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Apr 2018", "Interview Descriptions": "It went smooth, interviewed with multiple people, they made sure that I felt comfortable. The culture at SNHU is like no other, people really do care for one another and t starts from the moment you interview there.", "Interview Questions": "What are some of your strengths?"}, {"date": "13 Feb 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Southern New Hampshire University", "Interview Descriptions": "I was referred by an employee and promptly contacted by HR for a phone interview, which was basic and served primarily to gauge phone skills. I interviewed shortly afterward with two Advising team leads and a director of Advising, which is somewhat abnormal. The interview questions were varied, and the style was conversational, though some articulate and in-depth responses are expected. There were typically two rounds of interviews for this position (one with team leads, then one with directors), but I was hired after one interview because a director was present for mine.", "Interview Questions": "What would your dream job be?"}, {"date": "3 May 2022", "title": "Faculty Training and Support Facilitator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Southern New Hampshire University (Manchester, NH) in Feb 2018", "Interview Descriptions": "As an internal candidate, I had a meeting with the hiring manager scheduled before the interview to discuss the position, and the day of, she no-showed.  I asked friends of friends, and it turns out she was let go that day for serious reasons that I won't disclose here.  I was granted an interview, and I connected well with several of the leaders who interviewed  me.  About a month passed, and I hadn't heard anything, so I followed up with the HR specialist assigned to the requisition, and she said I was still being considered (and included an exclamation point and smiley emoji), and that she'd follow up with the director.  Within an hour, I got an email from the same HR person, saying that the Director wanted to keep looking. I asked the HR person if she could help me set up a time to get interview feedback from the Director, and within an hour, had a response from HR stating that the Director said that she \"didn't have the bandwidth\" to give me feedback or discuss it further with me.", "Interview Questions": "Why do you want to leave your current role?"}, {"date": "13 Dec 2017", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Extremely unprofessional. A recruiter with some memorized questions and taking notes... No questions about the professional experience and subject matter expert. It shows that the dean of the school doesn't care about his team even he doesn't have time to conduct interview himself.", "Interview Questions": "How would you deal with students of diverse backgrounds?"}, {"date": "19 Feb 2018", "title": "Workforce Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Dec 2017", "Interview Descriptions": "Received email request to answer standard questions via video submission. Then, had a group phone interview, followed by an in-person meeting with the entire team in one room to watch a presentation I was asked to create. This was for a VP position. The process was impersonal and didn't enable a conversation with the hiring manager that would have provided an opportunity to have a deep conversation about fit, strategy, and their leadership needs. For a senior level role, this process was ineffective and not well-suited to the role. It gave me the impression SNHU lacks sophistication in hiring top talent.", "Interview Questions": "Will your employer let you go? "}, {"date": "2 Dec 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Nov 2017", "Interview Descriptions": "Overall good. It was weird at first talking through a computer but easy to get used to. The questions were fair, and pertained to the job which is sometimes rare these days", "Interview Questions": "How would you manage a struggling student. "}, {"date": "14 Mar 2018", "title": "Analytics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Southern New Hampshire University in Nov 2017", "Interview Descriptions": "It was a long drawn out process.  The interviews were set up informally and it was a bit awkward.  I was asked back for a second interview to meet with other members of the team and it ended up being a 4 person panel interview.  Very unlike the first round.  It's clear I wasn't the right fit for what they were looking for, so I feel like they wasted my time by drawing out the process.  When I checked in with them a week after the second interview, they told me they were going to put off the decision for a few more weeks and then never got back to me.", "Interview Questions": "Describe a project you worked on"}, {"date": "12 Oct 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "15 minute situational interview with members of upper management to determine experience and fit in a relaxed environment. This interview felt more like a conversation than an interview. There was also an initial skype interview and phone screening with the staffing agency prior to the in person interview.", "Interview Questions": "How do you deal with change in the workplace?"}, {"date": "20 Jan 2018", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Oct 2017", "Interview Descriptions": "Process started off great, sent resume in and got a call within a week. Had a phone interview the following week with an on-site interview shortly thereafter. I felt the onsite interview went well, I answered questions and really felt like I got along well with the folks I talked to. I never heard back from them in regards to making an offer or passing. I did contact the hiring manager and he indicated they had a lot of candidates to go through (they where hiring over 10 developers) and hadn't reached any decisions as of that time. That was 3 months ago. It's disappointing as I was fairly excited about the job and what they are working on.", "Interview Questions": "Asked me to write a program to convert a string into a number (e.g. \"1\")"}, {"date": "21 Aug 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Started with an email asking me to partake in a web-based interview that was to be recorded.  Thought it was corny at first but once I did it the questions were great and thought to myself why don't most places do this, so much more efficient.  Then  in person following that, which people mentioned the recorded answers I gave, impressed.", "Interview Questions": "Great behavioral type of questions, follow ups on follow-ups. Really made me think."}], [{"date": "23 Oct 2017", "title": "Business Development Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Aug 2017", "Interview Descriptions": "Southern New Hampshire University used a digital interview, powered by HireVue.   This was highly impersonal, awkward and frankly demeaning.  There is time to practice and find the proper background and position the PC camera.  For those not of the selfie generation this is an awkward process.", "Interview Questions": "N/A"}, {"date": "24 Mar 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Southern New Hampshire University (Manchester, NH) in Aug 2017", "Interview Descriptions": "I was surprised and disappointed in their interview process. I arrived on time but waited nearly two hours to be interviewed. They used a panel interview and each interviewer had their own style. After the interview, I was told by another employee there that one interviewer's \"schtick\" was to be slightly aggressive when asking questions to purposely make interviewees uncomfortable. Well, the style resulted in me getting feedback that I was \"too nervous\".", "Interview Questions": "Besides being unstructured and mildly aggressive,  they were typical and included behavioral questions."}, {"date": "2 Aug 2017", "title": "Lead Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Process began with an interview with the Dean followed by a group interview.  Group interview was round robin style of Q&A.   Followed by one on one with Chief Nursing Officer.", "Interview Questions": "Experience with data management."}, {"date": "17 Jul 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Southern New Hampshire University", "Interview Descriptions": "I was recommended for the job from a former adjunct; I interviewed with the dean and the chair of the department for about an hour. It was very quick and easy and was offered the job a few days later.", "Interview Questions": "They asked about my experience in the field and teaching"}, {"date": "7 Jul 2017", "title": "Adjunct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (San Diego, CA) in Jul 2017", "Interview Descriptions": "Forms and surveys for references and a questionnaire must be submitted before interview.  First interview 30 min over the phone.   Overall pretty quick and efficient in how they process a candidate.", "Interview Questions": "Role of higher ed?  Trends in higher ed?"}, {"date": "29 Jan 2018", "title": "Admission Counselor Team Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Jun 2017", "Interview Descriptions": "Higher Vue video interview for round one, in person question and answer with senior leadership for round two, round three is 1:1 interview with VP of department. Each meeting was about 15-20 minutes. For the video interview, questions were given, and you were responsible to video yourself answering these questions to be selected for a second panel interview.", "Interview Questions": "What kind of leader do you want to be?"}, {"date": "24 May 2017", "title": "Online Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Filled out the application online. Then I received an email asking for my official transcripts and then it asked me to fill out a 'survey' The survey was basically my thoughts on higher education. About a week later they asked me for a phone interview and 4 references. Unfortunately there was not a lot of notice given, email then interview 2 days later. Still I had the interview but received a little attitude about only 2/4 references being filled out. Sorry but come on give people some time! Plus the phone interview was in the morning so it hadn't even been 48 hours since I sent them the request. Then I was told I'd hear back in less than a week and I did. \r\n\r\nOverall it was a lot of work done really fast but then they were just as fast so thats nice.", "Interview Questions": "How would I handle a diverse population of students with different backgrounds and different educational strengths and weaknesses?"}, {"date": "20 Apr 2017", "title": "Director of Admission Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2017", "Interview Descriptions": "Conducted a phone interview first. The face to face interview included ample time to meet with senior leadership, the direct supervisor, and the team. I wish there had been a bit more time to get to know the team and ask further questions, but I still felt like the community and team were able to get to know me, my skills, and that I had time to give my best.", "Interview Questions": "What kind of a leader am I?"}, {"date": "10 Nov 2017", "title": "Student Video Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southern New Hampshire University (Manchester, NH) in Jan 2017", "Interview Descriptions": "It took less than 5 minutes. The duties and tasks of this position is not that difficult. You would get the job if you can show a little bit of enthusiasm.", "Interview Questions": "Would you be able work weekends when needed?"}, {"date": "16 Dec 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (San Diego, CA) in Jan 2017", "Interview Descriptions": "Overall it was a very good process.  It was done virtually and over the phone.  It took about 45 min and they gave me an offer when the interview was over.  Overall it was a  very professional and to the point.", "Interview Questions": "What is your teaching style"}], [{"date": "20 Oct 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Oct 2016", "Interview Descriptions": "The Interview and eventual offer consisted of three steps, \r\n\r\n1. Initial Phone Interview \r\n2. In person Interview (this is crucial)\r\n3. Checking References\r\n\r\nI have applied to SNHU 3 times and the third time was the charm! As far as the interview process goes it was on par with any other interview I have done. My background is in education so it is important to be well versed in education and how technology is integrated into education. They also look for customer service experience as well. Overall, it was a fairly painless process which, for me, resulted in an offer!", "Interview Questions": "what did you find most difficult about public education and what ultimately made you decide to switch to Higher Education?"}, {"date": "6 Jul 2016", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Southern New Hampshire University (Syracuse, NY)", "Interview Descriptions": "Applied online through college website\r\nReceived email to schedule interview \r\nEmailed recruiter for interview time\r\nDid phone interview with recruiter\r\nScheduled Skype Interview for next morning\r\nHad Skype Interview with program supervisor\r\nReceived call for job offer that same evening.from recruiter\r\nAccepted offer and scheduled start date", "Interview Questions": "How would I implement career readiness for success?"}, {"date": "4 May 2016", "title": "Online Adjunct Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Southern New Hampshire University (Palm Bay, FL) in Apr 2016", "Interview Descriptions": "First one sends transcripts and work evaluations, then one is called for a phone interview.  \r\nKnow your answers to the common questions.  I sue would recommend common phone practices for interviews, such as being upbeat, being prepared with your best answers, since they may interview many candidates.\r\n\r\nThere are several other steps to future evaluations, and a Dean may then examine many interviewees (even though i cannot verify that for certain.", "Interview Questions": "How do you connect with an adult student?"}, {"date": "24 Mar 2016", "title": "Online Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Southern New Hampshire University (Los Angeles, CA) in Mar 2016", "Interview Descriptions": "I applied online and was contacted for my transcripts. After they arrived, I received an email stating I would be contacted for an interview \"within the next few weeks\". That was a Friday. On Monday morning, I was contacted for an interview. \r\n\r\nI was sent a fairly inane \"faculty survey\" to fill out (basically a pre-interview sheet) and the link to a survey that would be sent to my references. They want FIVE references, TWO of which must be managers. Did I mention this is for a PART TIME job that pays less than minimum wage when all is said and done?\r\n\r\nI sent back the survey and got in touch with my references on Wednesday. By Thursday, the interviewer was upset that all of my references hadn't gotten to her. Did I mention this is during spring break AND my references had less that 24 hours to respond at this point? Golly, all this pressure on people I admire was really making me want to work for this company! \r\n\r\nThe interview itself was pleasant enough and took about 30 minutes. I was interviewed by the manager of faculty recruitment. The interviewer was VERY happy with my skills and answers and at the end of the interview told me she was sending me a packet that I needed to have it filled out ASAP (notice a trend?) so I could QUICKLY get into the THREE WEEK UNPAID TRAINING that would follow. All of this so I can start teaching ONE class. IN JUNE. It's March as I type this. Yes, I need to work like a house on fire to get SNHU all of my materials so I can sit around and wait for my low-paying job to start three months later. Awesome!\r\n\r\nAt the end of the interview, I asked several questions (How often are classes canceled at the last minute? How active does the instructor need to be when facilitating discussion? How many items is an instructor expected to grade each week?\") and her answers were either \"I don't know, I'll have to get back to you on that.\" or \"That's something you can learn about during the training.\" Then I asked her how many classes an instructor can teach per term. She told me that for the first few terms, I'd be limited to ONE class and that maybe, MAYBE, after several terms, I could teach two at a time but they prefer to keep instructors to one at a time. \r\n\r\nSNHU pays $2200 per course and has six terms each year. That means this position could earn you all of $13,200 for the entire year. Mind you, the college will collect over $200k for your labor and that is a low estimate (6 terms per year, $524 per course hour, each class is 3 course hours, with about 20 students per course (though you may have as many as 28 per class.)) \r\n\r\nThough I passed to the next round (three weeks unpaid training!) I declined the position. Everyone involved in this should be ashamed.", "Interview Questions": "What is the role of customer service in higher education?  To what degree should faculty be responsible for providing customer service in their teaching?"}, {"date": "17 Mar 2016", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Held in house with notification through email and word of mouth announcing opening. Outlook calendar invite sent to secure interview time. Behavioral interview questions asked by two or three higher ups. Results given in about a week.", "Interview Questions": "Describe a time you needed to manage your time, etc."}, {"date": "22 Feb 2016", "title": "Online Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "It was a very easy interview for anyone who has done higher education teaching before. They asked cursory questions about teaching experience and how you would engage online, as well as strategies for reaching out to students having trouble in a course. They seemed to be focused on making a connection between faculty and students.", "Interview Questions": "How would you promote engagement in an online class?"}, {"date": "11 Jan 2016", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern New Hampshire University (Manchester, NH) in Jan 2016", "Interview Descriptions": "Online application with cover letter and resume. Then phone screening and then interview.I met with an HR person and with three advisors. One or two of advisors were team leads. The interview was approximately 30 minutes long.They asked the standard traditional,behavioral and industry specific questions. The advisors were dressed fairly casually and there was ample opportunity to ask questions of them.", "Interview Questions": "Tell us about your self."}, {"date": "28 Jan 2016", "title": "Academic Advisor-2nd Shift Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Southern New Hampshire University (Manchester, NH) in Jan 2016", "Interview Descriptions": "I applied for this position on 12/18/2015.  I received an email asked for a phone interview on 01/11/2016.  I spoke with Jennifer on 01/12/2016 and after phone interview we set up an in person interview on 01/13/2016.  I meet with Kyle Winston and Meghan Casello on 01/14/2016 for 30 minutes.  I was told I would be contacted directly by Diane about whether or not I would be offer a position.  On 01/15/2016 I received a generic email stating \" We were pleased to talk with you personally and to learn more about your professional qualifications.  Your willingness to provide details concerning your knowledge, skills and experience was greatly appreciated.   At this time, We have selected a candidate whose qualifications are a better match to the job requirements\"", "Interview Questions": "Since this is a second shift position how would you adjust to this work schedule."}, {"date": "18 May 2017", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Southern New Hampshire University (Manchester, NH) in Jan 2016", "Interview Descriptions": "Went through a hiring agency, and met with a director of admission at a hotel to conduct an interview. It was very relaxed and very comfortable. We had a long conversation and I answered several questions before leaving. I was told that I would hear back in about a week.", "Interview Questions": "Why I was looking to become an admission counselor?"}, {"date": "16 Oct 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Found it very odd that you were  not interviewed by a supervisor, but rather by a scheduler or recruiter. They are looking for people who already know how to use Blackboard to teach online. Interview experience went very well.", "Interview Questions": "N/A"}], [{"date": "24 Feb 2016", "title": "Online Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (New York, NY) in Oct 2015", "Interview Descriptions": "Fairly east interview process. They presented what the expectations were for this position. It was fairly general and nothing new if you've taught in higher Ed before. They wanted to know my background and teaching experience, which was apparently good, as they hired me to teach in the COCE porgram.", "Interview Questions": "How would you engage students in an online environment?"}, {"date": "18 Jul 2016", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Sept 2015", "Interview Descriptions": "National Employment handles all incoming hires.  You will be paid $15 / hour during your 90 day temp period.  During the temporary period your employment is incredibly tenuous and you will be terminated immediately if there's any indication at all that you aren't exactly what they want.  During our two week training period, 30% of our class was terminated.  After the training, 19 out of the 20 people that made it to \"the floor\" were retained and converted perm.  If you're going to get launched, it will most likely be in the first two weeks.", "Interview Questions": "Tell me about a time you didn't meet a goal and what you did about it"}, {"date": "30 Sept 2015", "title": "On-Line Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Southern New Hampshire University in Sept 2015", "Interview Descriptions": "It took a while but they also kept in touch during the process, so I felt like I knew what was happening. The process included a very nice phone conversation.", "Interview Questions": "One big question they asked was how you support students that are not really prepared academically for your course."}, {"date": "14 Dec 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Rockville, MD) in Sept 2015", "Interview Descriptions": "I applied online and about a month after I was contacted by email to schedule a phone interview. The interview was about 30 min (September 2014). We went over my experience of teaching (I had none with online teaching at the time) and also what was expected from adjunct professors. A month after the interview, I started a 3 week-online training (unpaid). In February 2015,  I taught my first online class.", "Interview Questions": "How would you create an online engaging environment?"}, {"date": "15 Aug 2015", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Southern New Hampshire University", "Interview Descriptions": "You meet senior management and they ask about your skill set, specifically working within a team and customer service. It is more of a conversation than anything, just be yourself.", "Interview Questions": "Tell me about your experiences working in a customer service position. "}, {"date": "11 Aug 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "My niece knew an Associate Dean, so I was pretty much handed a class of freshmen and told to teach them Western Civilization.  I had exactly one week to prepare my class", "Interview Questions": "When can you start?  What format do your classes follow?  Have you ever used BlackBoard grading platform software?"}, {"date": "18 Jan 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Aug 2015", "Interview Descriptions": "Application is online. They will send an email whether or not you have moved onto the next stage. (For a previous position, I received a denial letter which was incredibly appreciated.) It started as a phone interview to vet how I would fit within the institution's culture and mission. If you are asked for an in-person interview, you are given the details of the salary (which is non-negotiable). Then you have an in-person interview, usually with who would be your direct supervisor and their supervisor. If you are hired, it might take a while since they do training in batches. My turnaround happened to be extremely fast, but I know others who had to wait for several months.", "Interview Questions": "How will you help students succeed? How can you help a diverse student population? Are you comfortable talking on the phone? "}, {"date": "11 Dec 2017", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Aug 2015", "Interview Descriptions": "Skype interview with two managers. Emphasis on student support examples, experience and professional strengths. Lasted 30 mins at the most.  Prior to I was screened by an HR person regarding my experience, what I new about the university and why I wanted to work there.", "Interview Questions": "Give an example when you provided exemplary student support"}, {"date": "15 Jul 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "The interview process was conducted all through electronic media.  There was no in person interview.  Everything was conducted online.  I had to submit my application electronically and complete a very lengthy questionnaire with my background.  This seemed applicable as the position I was applying for was online instructing where everything is conducted in an asynchronous environment with a heavy focus on using technology.", "Interview Questions": "Have you ever used electronic platforms for instructing?"}, {"date": "9 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Southern New Hampshire University", "Interview Descriptions": "After the initial application I received the normal automated response. About six week later I received another email requesting official transcripts to be sent directly to them. Five weeks later I received an email about setting up a phone interview within the next few weeks. Another six weeks goes by and I received the let's schedule a telephone interview. Two weeks later we had the phone interview. If the interview goes well they will email you qualification forms to fill out for each class they/you want to teach. Once you return the forms it goes to the academic dean for review and approval. It took 11 weeks before I received a response to the forms. The response will either confirm that you were approved to teach or denied. If you are approved to teach they will send you a login to start pre employment paper work and background check paperwork.  After all that is done they will schedule you for the next available spot for three weeks of unpaid training. Once you successfully complete training you will be on the list to potentially receive a class to teach.  ****THERE IS ABSOLUTELY NO COMMUNICATION FROM THEM THROUGHOUT THE PROCESS**** They do not respond to emails and there are no phone numbers or contact information", "Interview Questions": "What challenges do you anticipate with online learners?"}], [{"date": "10 Sept 2015", "title": "ADmissions Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Southern New Hampshire University (Manchester, NH) in Jul 2015", "Interview Descriptions": "You have to apply through OfficeTeam, but the interview was fantastic and laid back. You are interviewed by 2-4 people in management. They were in need of people to start immediately so the process happened very quickly and I was offered the job 3 days after the interview (there was a weekend in between). I wasn't able to give my current employer a full two weeks because they wanted to start very quickly.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Jun 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Phone Screening --> In person interview --> Reference check. All in all it was very transparent and they were very clear in what they were looking for as a candidate. Make sure you research what SNHU is doing with education during the process.", "Interview Questions": "What is the reason behind applying for this role and this company?"}, {"date": "20 Oct 2015", "title": "Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Jun 2015", "Interview Descriptions": "Had a phone interview, was asked just a few questions and then never got a face to face interview for a job I was totally qualified for.   They hired someone in their mid to late 20's which seems to be happening all over campus", "Interview Questions": "If I googled you, what would I find?"}, {"date": "1 Jul 2015", "title": "Reviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Southern New Hampshire University (Boston, MA) in Jun 2015", "Interview Descriptions": "So far, I've completed half of the interview process for College for America. The preliminary interview is a phone call asking how you came across the company, why you want to work for them, and prior experience that may help with the job. It's a fairly easy interview. The person who interviewed me asked questions, explained how CfA works, who they reach out to, as well as how the job works. \r\n\r\nThe interviewer was friendly, willing to answer any question I had, and was thorough about addressing concerns, which I liked. The only thing I didn't like was the sales pitch discussing cost of the university, how degree programs work, and why it's a good program. This was a bit of a turnoff, so if I could speak to higher-ups directly, I would say eliminate the sales pitch during the interview for a job.\r\n\r\nWhat helped me was that I was prepared for the interview by reading sample interview questions from Southern New Hampshire University since CfA is affiliated. However, the interview is simple and straight-forward.", "Interview Questions": "Q. What made you want to apply here?"}, {"date": "20 Jul 2017", "title": "Reviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Jun 2015", "Interview Descriptions": "The interview process is over the phone and online for out-of-state individuals. It is lengthy with questions about your teaching philosophy and goals. The online portion involves a lot of essay writing to describe your goals. The phone interview is much easier. I recommend taking notes prior to the phone interview!", "Interview Questions": "What is your teaching philosophy?"}, {"date": "8 Sept 2015", "title": "Reviewer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took a year or more. I interviewed at Southern New Hampshire University (San Jose, CA) in Jun 2015", "Interview Descriptions": "Hired.   We received a written promise of having no less than 25 hours per week from HR, but this turned out to be untrue.  It is only a couple of hours each week.  With false promises of more work to come", "Interview Questions": "Experience in the field, education, etc."}, {"date": "31 May 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern New Hampshire University (Nashua, NH) in May 2015", "Interview Descriptions": "Oddly hasty. I applied and had a phone screening in about 2 days. Then another phone interview and I had to then conduct the faculty training session and 'pass' that.", "Interview Questions": "Why are you wanting to be an adjunct?"}, {"date": "19 Jun 2015", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in May 2015", "Interview Descriptions": "There was an initial telephone interview with an HR person that was a pretty standard \"tell me about yourself\" type deal.  The next interview was with the actual supervisors and was also by telephone, but was more unscripted.  Since it was so unscripted, a few of the questions seemed to be a bit vague in relation to what they were trying to get at.", "Interview Questions": "Tell me a bit about how you came to apply for this position."}, {"date": "10 Jan 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in May 2015", "Interview Descriptions": "It was a 2 step process. 1st step is a telephonic interview with the HR and the 2nd round was with the team lead or manager. The telephonic interview was more to do with communication skills, work experience, how did i hear about the job, what my prior experience that I could relate to the job that I have applied for", "Interview Questions": "My level of expertise with HTML, Excel, and PowerPoint. My prior experience skills that I can relate to the job I have applied. Challenges that I faced at my previous work places and how I worked through them."}, {"date": "18 Apr 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "First, I submitted an online application for the position through SNHU's Peoplel Admin website. Next, I was called for an interview, had interview, waited for a week, and was then offered the position", "Interview Questions": "Do you have any concerns about the assistantship?"}], [{"date": "8 Apr 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Mar 2015", "Interview Descriptions": "relatively easy. We talked about the position for approximately 45 minutes. I liked the manner of the Interviewer, as they seemed genuine in seeking the best candidates for open positions.", "Interview Questions": "Describe your teaching style"}, {"date": "15 Jul 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Southern New Hampshire University in Feb 2015", "Interview Descriptions": "It was extremely quick.  Not intimidating at all.  Seemed like a good atmosphere.  The three people that interviewed me were very friendly and young.  Everyone I saw in the office looked right out of college.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "20 Jan 2015", "title": "Academic Advisor Team Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "This is probably the quickest process I've encountered from application through two interviews.  The whole process took about a month and that was including through the holidays.  HR reaches out via email to schedule a phone interview, then the next step is an in person interview.  The environment was very collegial.  The biggest dilemma was finding parking as the ones on the street were not all working due to the cold weather.", "Interview Questions": "What is the biggest mistake you ever made professionally?"}, {"date": "16 Dec 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Happens really fast! You could have a phone interview on Monday, an in-person interview Wednesday, a follow up Friday and then hear Friday! The panel interviews are with the people who would be your direct managers, which is good but also tough because they aren't experienced interviewers, so you have to know how to tell them what you want them to know, even if they don't ask about it.", "Interview Questions": "How would you apply customer service approach to academia?"}, {"date": "15 Aug 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (Alexandria, VA) in Dec 2014", "Interview Descriptions": "Had one 15-20 minute initial-vetting type of phone interview with an HR person, then a more detailed, follow-up interview of perhaps 45-60 minutes with an IT program dean. Both were straight-on, no-nonsense interviews, with no \"curveball\" questions -- it was a very streamlined process, though given the proximity to end-of-year holidays, probably stretched out (~ one month) more than is usual.", "Interview Questions": "General questions regarding my experience over the past 10-15 years, with additional detailed questions on the areas of expertise where my teaching skills could fit best at SNHU."}, {"date": "15 Oct 2014", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southern New Hampshire University (Manchester, NH) in Oct 2014", "Interview Descriptions": "One phone screen with hiring manager, then onsite interview with director, peers (group session) and hiring manager. Friendly people, easy interview. Focused on technical skills, and not the default interview questions (what's your biggest mistake, etc)", "Interview Questions": "What are you like? (director was aiming to find out if I would call out a lot, or be late often)"}, {"date": "23 Feb 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Southern New Hampshire University (Manchester, NH) in Aug 2014", "Interview Descriptions": "They asked many questions about my approach to teaching and my experience and background. I also asked them questions which was very helpful. It was a friendly and thorough atmosphere.", "Interview Questions": "Asked how I would handle different student situations."}, {"date": "20 Jul 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "The initial in-person interview went well enough; many questions centered around situational specifics (i.e. what would you do if...) scenarios. The interviewers appeared professional and business-like. Prior experience in the field may not be necessary.", "Interview Questions": "What have you done to prepare for this interview today?"}, {"date": "24 Apr 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University in Jul 2014", "Interview Descriptions": "The interview process was very fast and easy if you are familiar with online teaching.  Interviewer was very easy to talk to.  I applied and received a phone call two weeks later. Within another week I was signed up to start training. After training I was assigned a course and have been teaching there for almost three years now.", "Interview Questions": "How do I engage with students in a inline classroom setting."}, {"date": "30 Apr 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Jul 2014", "Interview Descriptions": "Hired through temp agency. ~15 minute interview, just wanted to know more about you.Could have done over the phone, since the entire position was made up of over the phone communication. Expected more questions during the interview, but they were mass hiring (30+), so I guess they just needed bodies. once in the job, they freely fire based on skills/how easy you pick up the job.", "Interview Questions": "Why do you want to be an admission counselor?"}], [{"date": "29 May 2015", "title": "Outcomes & Assessment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University in Jun 2014", "Interview Descriptions": "Online application, brief phone call to gauge interest in position, in-person interview with one manager and the director of Outcomes and Assessment. The questions were very typical of an interview--focused on group dynamics, but also ensuring that you understand the job description and asking about experience writing assessments.", "Interview Questions": "How would you handle a situation where you do not agree with your manager's decision?"}, {"date": "6 May 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Southern New Hampshire University (Manchester, NH) in May 2014", "Interview Descriptions": "Lightning round 10 minute interview. Did not really ask me anything related to the position or higher education. I had my work experience in higher ed on my resume and they did not even ask me anything about it. It's like they did not care. It was a very odd process.", "Interview Questions": "What was my customer service experience like?"}, {"date": "18 Apr 2014", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Southern New Hampshire University (Manchester, NH)", "Interview Descriptions": "Met with each member of the team before I was offered the position. Was asked more about ideas than about why I left my previous position which is great! Was told about special projects and the opportunities to advance.", "Interview Questions": "The most difficult questions dealt with having to continuously having to prove myself during each phase of the interviews."}, {"date": "16 May 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Apr 2014", "Interview Descriptions": "Arduous, costly and demoralizing. One hurdle after another, months-long periods of waiting. Glib interviewers and opaque criteria. A smarmy place filled with anti-depressant fueled staff. In the same league as Acappella, University of Phoenix, Kaplan—don't let the quaint New England campus fool you. Nor the non-profit status. You'll end up scratching your head at the idiocy, feeling devalued and degraded. Pompous ill-written missives from  bombastic president meant to make you feel like part of something big and progressive, but the veneer quickly wears thin. Go for it if you are desperate.", "Interview Questions": "The usual drivel, I don't remember a single meaningful question."}, {"date": "25 Mar 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Southern New Hampshire University", "Interview Descriptions": "when applying to snhu in the advising department there are three innitial steps. A phone screening, 2nd interview in person, final interview with leadership. The 2nd interview is key, this is where they make the decision. Make sure you dress appropriately", "Interview Questions": "the questions are framed in a way to make you think. Do not show that they confuse you, do not show frustration. "}, {"date": "22 Sept 2015", "title": "Mailroom Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Southern New Hampshire University (Manchester, NH) in Apr 2014", "Interview Descriptions": "the interview is very easy, jen is very nice. everyone is nice there. you can feel free to work there. its a best part time job in SNHU. if you are a student in SNHU, go apply for it", "Interview Questions": "how are you :D"}, {"date": "8 Feb 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Southern New Hampshire University (Manchester, NH) in Feb 2014", "Interview Descriptions": "1. I applied online\r\n2. I got an email about doing a phone interview\r\n3. Phone Interview\r\n4. In person interview (3 person panel)\r\n5. Final approval email with the assistant director of advising.", "Interview Questions": "I was asked this question twice: \"What would your ideal workplace look like?\" I think they're looking for what kind of culture you expect. "}, {"date": "21 Oct 2014", "title": "Adjunct Faculty Member Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 months. I interviewed at Southern New Hampshire University in Jan 2014", "Interview Descriptions": "They sat on my resume for something like 6 months and then did the interview. Very easy questions was seemingly hired, wasted a bunch of time on their unpaid training, filled out forms, signed off on a background check and never heard another word ever. This was a complete waste of my time.", "Interview Questions": "None, just say you love to help students pass their class and you will get the job but read the reviews here - you may not want the job."}, {"date": "16 May 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Southern New Hampshire University in Jan 2014", "Interview Descriptions": "you would need to pass a 2.5 month training after getting accepted in the phone interview process and transcript evaluation. I think the interview was pretty easy, however, employee referral or some connection is kind of necessary to get the initial interview", "Interview Questions": "the interview was not very technical, it was mostly a series of general questions about my resume"}, {"date": "16 May 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Baltimore, MD) in Jan 2014", "Interview Descriptions": "The process was very easy.  After submitting my application, I received a phone call within 2 - 3 weeks. I had a phone interview and I had to submit my teaching statement.  I found the process very easy and not intimidating.", "Interview Questions": "Have I had experience teaching?"}], [{"date": "5 Dec 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Southern New Hampshire University", "Interview Descriptions": "Phone interview", "Interview Questions": "Asked about experience, classroom management style, experience with specific LMS platforms."}, {"date": "9 Aug 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Dec 2013", "Interview Descriptions": "The process began with a brief phone interview which was pretty standard and provided some insights as to what the job entailed.  Next step was an in-person interview with two advising team leads and one advising director.  In general they were very pleasant and engaging.", "Interview Questions": "How would I approach developing relationships with individuals only via phone and email?"}, {"date": "14 Jan 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Jul 2013", "Interview Descriptions": "Applied online from SNHU website. Received preliminary call back a week later, then in person interview. Interview held with team of three (team lead and two others). Positive, comfortable atmosphere. Multiple interviews were being held at the same time. Very quick, easy interview, nothing out of the ordinary question wise. Was given the feeling they knew exactly the type of candidate they were looking for without much flexibility.", "Interview Questions": "Can you handle delivering bad news?"}, {"date": "3 Oct 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Jul 2013", "Interview Descriptions": "Recruiter does screening and briefly asks about your sales background. They want someone who doesn't fear rejection or making tons of calls", "Interview Questions": "Why have you chosen to do sales so many times in your life."}, {"date": "1 Feb 2016", "title": "Online Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Southern New Hampshire University in May 2013", "Interview Descriptions": "Done completely online. Never talked to a person directly. It took about 4 weeks, included written portions along the lines of teaching philosophy and how you would grade an assignment. After this was completed, they sent out separate application sheets for classes they thought you might be qualified to teach and you had to provide evidence that you could teach it (courses taken, taught, research). After there was a training session that oriented you to the job, LMS and policies.", "Interview Questions": "How would you grade this assignment?"}, {"date": "30 Sept 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (New York, NY) in May 2013", "Interview Descriptions": "The interview process was cut and dry.  They mainly talked about credentials and what courses you were interested in teaching.  They send an email prior to the interview.", "Interview Questions": "What classes was I interested in teaching. "}, {"date": "28 Mar 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Raleigh, NC) in Mar 2013", "Interview Descriptions": "I was asked to develop a course and work with an Instructional Course Developer to include all the necessary objectives of the class.  Once complete I was required to instruct the online course and to continue to develop any new material.", "Interview Questions": "What is my preferred teaching environment?"}, {"date": "28 Jun 2017", "title": "Associate Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2013", "Interview Descriptions": "Standard Interview. Phone screen then conference call and then full day in-person meeting on site. All the right people within senior leadership made themselves available that day. Helped my decision.", "Interview Questions": "Why would I want to be a part of their university?"}, {"date": "12 Jun 2015", "title": "COCE Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Feb 2013", "Interview Descriptions": "brief and informal- they brought me into a room and asked me questions about my prior work experience and where I saw myself in the future- they were not dressed professionally but told me that It was a casual work environment", "Interview Questions": "why do I want to work here"}, {"date": "6 Jul 2016", "title": "Adjunct Faculty of Social Science Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Nov 2012", "Interview Descriptions": "Phone interview on how I work with students; my grading ideas and teaching philosophy.  In addition, they asked questions that focused on 'special populations' of students e.g. military and disabled and how would I handle particular situations.", "Interview Questions": "They asked me about my teaching experiences in the past; and provided scenarios that I had to answer based on student issues, grading, and special situations."}], [{"date": "15 Jun 2016", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Southern New Hampshire University (Manchester, NH) in Oct 2012", "Interview Descriptions": "Group interview over your past experience. Nothing in details. Just going over what the company does and what they expect. Talk about your education experience. Talk about your previous work experience and hobbies and interes", "Interview Questions": "interview process took 1 week, 2 meetings, not very hard. talked more about position, interview process took 1 week, 2 meetings, not very hard. talked more about position, interview process took 1 week, 2 meetings, not very hard. talked more about position, interview process took 1 week, 2 meetings, not very hard. talked more about position,"}, {"date": "17 Dec 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Southern New Hampshire University (Chattanooga, TN) in Jan 2012", "Interview Descriptions": "Two phone calls that determined my skills as well as desires to teach for SNHU. They reviewed my college transcripts, and then asked questions particular to the courses they were wanting my to teach.", "Interview Questions": "Why did I want to teach for SNHU."}, {"date": "12 Jun 2012", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Southern New Hampshire University (Manchester, NH) in Nov 2011", "Interview Descriptions": "I applied through the university website. In a months time i got an email from the online campus asking me to join them for a 1:1 interview. The date and time was fixed. The interview consisted of basic questions like my prior experience, my ambition and my will to learn new things. It lasted for around an hour with a tour of the entire office included at the end. After the interview i got a call from them accepting me as their employee in a span of a week.", "Interview Questions": "Prior working experience"}, {"date": "16 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Southern New Hampshire University (Manchester, NH) in Mar 2011", "Interview Descriptions": "the interview is not very competitive and the professors are very nice, the process it's about 1hour, two professors asked questions, one of them is the director research supervisor, the other is a high level manager, they are both very nice", "Interview Questions": "They asked how did I hear about this university"}]]