[[{"date": "1 Jun 2023", "title": "Carpenter Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in May 2023", "Interview Descriptions": "they do not know what their doing nor do they follow modern rules of safety which is very hard to believe Wish I never wasted my time going to an interview", "Interview Questions": "do I know lock out procedure"}, {"date": "1 Apr 2023", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Mary's University (Canada) (Halifax, NS)", "Interview Descriptions": "Interviews progressed quickly and everyone involved treated me well and with respect. I had initial questions about the total compensation that I’d asked HR early on (before the interviews) which they did not answer. This ended up being an important factor for me and regrettably, I later withdrew from the process when I learned the answers to my questions and that my needs couldn’t be met. Learning this earlier would have saved everyone time and effort.", "Interview Questions": "The questions were all behavioural based and relevant to the role."}, {"date": "2 Jun 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Apr 2022", "Interview Descriptions": "Quite positive. It is mainly related to your future study plan and work plan. Professors care more about your future free time and energy than they do about the professional level.", "Interview Questions": "1. Introduce yourself .\r\n2. Describe one time you faced difficult.\r\n\r\n\r\n"}, {"date": "23 Dec 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Nov 2020", "Interview Descriptions": "the process started with a phone call for pre-screening with the HR personnel to review my resume. Then I was invited for another interview with a hiring panel consisting of 3 persons.", "Interview Questions": "examples of my previous experience in managing IT projects and related challenges and how these challenges have been solved."}, {"date": "30 Aug 2021", "title": "RSO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Mar 2020", "Interview Descriptions": "There were 2 interviewers. The interview lasted around 30 min. Consisted of basic questions, nothing you could not handle such as \"how would you handle a call about a noise complaint late at night?\". Make sure your answers clearly show that you understand what the job is about.", "Interview Questions": "What is your greatest accomplishment so far?\n"}, {"date": "26 May 2020", "title": "RSO Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Feb 2020", "Interview Descriptions": "In person interview. Sat down in a classroom and was asked a couple of questions by 2 interviewers. lasted about 30 min. Talk as much as you can. Make sure to answer all questions, do not take too long to think. Body language important", "Interview Questions": "why should we hire you"}, {"date": "15 Nov 2022", "title": "Welcome Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Oct 2018", "Interview Descriptions": "I asked a friend to give me a reference then he gave me the manager's email, then I got it after talking to the manager, it's just a temporary job, so nothing really complicated, any student can get it.", "Interview Questions": "Why do you want this job"}, {"date": "26 Jan 2022", "title": "Residence Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Saint Mary's University (Canada) in Mar 2018", "Interview Descriptions": "Group interview followed by individual interview. Lots of team building activities. All very relevant to the position. Individual interview was with potential boss and senior employee. Process took a month to do.", "Interview Questions": "Personal questions and decision making "}, {"date": "13 Jun 2019", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Jan 2018", "Interview Descriptions": "There was no formal interview process. I first asked for the position and was told that they'd let me know if there was an opening. I was then asked if I wanted the position and I accepted.", "Interview Questions": "No questions were required other than a driver's licence for field trip opportunities where I was required to drive students"}, {"date": "10 Sept 2017", "title": "Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Mary's University (Canada)", "Interview Descriptions": "Very standard process as one could imagine for an institution this size. The HR people were professional, friendly, accommodating and direct.  Throughout the process they kept me informed and were pleasant to deal with. The interview panel definitely knew their stuff when asking questions. If you put something on your resume, they will have experts on the panel able to determine if you actually know what you claim to know.", "Interview Questions": "A lot of excel questions about formulas, pivot tables and various other advanced features. "}], [{"date": "10 Feb 2021", "title": "System Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Sept 2017", "Interview Descriptions": "Interview process was quite basic, they are not looking for technical person, moreover they look for behaviour point of view and similarities in the env you have worked in past.\r\nVery smooth process, salary is bit low", "Interview Questions": "basic question on area of linux, administration\r\nsql queries, \r\nwebserver troubleshooting"}, {"date": "25 Feb 2019", "title": "Bartender Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Sept 2017", "Interview Descriptions": "asked about former work and volunteer experience... very standard interview that you would face for a job in the service industry. wasn't super intimidating either. I thought they asked questions based on personality and on my previous jobs, and allowed me to feel comfortable", "Interview Questions": "previous work experience "}, {"date": "13 May 2020", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Apr 2017", "Interview Descriptions": "The interview was conducted by HR and your hiring manager. A lot of situational questions.They will asking about your strengths and weaknesses. They will also ask about a time when you deescalated a difficult situation and helped a customer.", "Interview Questions": "The most difficult question was : What are some unique differences between Dal and SMU "}, {"date": "13 Oct 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Sept 2016", "Interview Descriptions": "A quick selection process depending on your grades/qualifications on your resume. If you have exceptional grades then it makes it easier for you to get contacted by the program director/supervisor for this opportunity. Usually you need to send out an email to know if there are any available opportunities.", "Interview Questions": "N/A"}, {"date": "21 Jul 2017", "title": "Helpdesk Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Aug 2015", "Interview Descriptions": "Conversation with your immediate supervisor followed by a test/exam to gauge your knowledge of technology and familiarity with SMU infrastructure.\r\nThen you meet with the department head but basically as a formality", "Interview Questions": "Describe one instance of you dealing with a technical issue"}, {"date": "27 Jul 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Saint Mary's University (Canada) (Halifax, NS)", "Interview Descriptions": "There was no interview. If you get good enough marks the professors/TA coordinators will email you asking if you'd be interested in becoming a TA. Once that happens, you have to fill out an application, submit a cover letter, resume, and transcripts then wait for approval. No interview needed.", "Interview Questions": "Why do you want to be a TA?"}, {"date": "25 Mar 2015", "title": "Residence Service Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Aug 2014", "Interview Descriptions": "Submitted the resume and references online. Got a call to setup an interview through google doc sheet. There was a group interview as first where you have to deal with a situation in a group and later an individual interview will be scheduled if you cold pass the group interview.", "Interview Questions": "Mostly situational questions. Based on customer service and security"}, {"date": "28 Sept 2018", "title": "Registraion Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Mar 2014", "Interview Descriptions": "It was pretty straight forward, you have the interview with the HR representative and the Manager of the department for the job you applied to. Simple interview questions and also a lot of situational questions.", "Interview Questions": "Where do you see your self in 5 years from now?"}, {"date": "20 Jun 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Jan 2014", "Interview Descriptions": "Unprofessional setting, and people who conducted the interview.  They asked inappropriate questions.  It took a long period of time before hearing back from the interviewer.  This made it difficult to determine if I wanted to even work for them.", "Interview Questions": "What makes you a good fit for this role"}, {"date": "3 Nov 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Mary's University (Canada)", "Interview Descriptions": "I was hired by personal contact through the prof. There was no formal interview as the professor used his classes to determine who would be allowed to work for him. A high mark was not required but a willingness to work and learn", "Interview Questions": "N/A"}], [{"date": "5 Apr 2015", "title": "English Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Saint Mary's University (Canada) (Halifax, NS) in Apr 2011", "Interview Descriptions": "Was about 1 hour long with the Department Director and Director of Academic studies. Pretty standard questions - strengths/weaknesses, most proud of, etc and some more 'technical' questions on English language and teaching methodology.\r\nWas fairly intense and left with a feeling of 50/50 about getting the position, but heard back with a positive response within 10 days.", "Interview Questions": "What are your strengths/weaknesses? Give an example of how you solved a problem between students in the classroom."}]]