[[{"date": "15 May 2021", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at HCA Houston Healthcare Clear Lake (Houston, TX) in Apr 2021", "Interview Descriptions": "Applied for the StaRN Residency! Was then Interviewed by 2 RN Managers for the unit. Very friendly and positive experience. The managers were respectful and truly interested in what I had to offer the team. Have been to a few interviews with different organizations and this is by far the most positive experience I've had. They offered me the job later that day and I gladly accepted.", "Interview Questions": "Interview Tips: Be yourself, lots of behavioral questions. They want to see that you have a passion  for care. Be open-minded and make it a priority that you display your dedication and value for leadership, as this leads to better patient outcomes. "}, {"date": "13 Feb 2021", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX) in Feb 2021", "Interview Descriptions": "Virtual interview, then follow up from recruiter. Easy to login and communicate. great platform. All staff were very friendly and personable. I was able to interview with multiple people at the same time as a group setting.", "Interview Questions": "If you were giving.a blood transfusion and the patient started having an itchy throat and flushing red, what would you do?"}, {"date": "18 Mar 2021", "title": "New Graduate Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake (Houston, TX) in Feb 2021", "Interview Descriptions": "I had two nurses interview me.  They asked me why do I want to  work for HCA, why did I choose to become a nurse, how do I deal with conflict at work.", "Interview Questions": "They asked me why do I want to  work for HCA, why did I choose to become a nurse, how do I deal with conflict at work."}, {"date": "12 Oct 2019", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake", "Interview Descriptions": "It was pretty casual, at first, I thought it was going to be a panel interview, but then I was only interviewed by the hiring manager. She asked some simple background questions, then focused more on the behavioral questions.", "Interview Questions": "Why did you choose our hospital?"}, {"date": "6 Jun 2019", "title": "RN, Starn Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HCA Houston Healthcare Clear Lake", "Interview Descriptions": "Quick and professional. I interviewed with a team of directors and later a team of nurses on the floor. Several new grads were there for the interview. Got the offer the day after.", "Interview Questions": "What do you do to avoid mistakes on the job?"}, {"date": "11 Mar 2019", "title": "StaRN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at HCA Houston Healthcare Clear Lake", "Interview Descriptions": "Their recruiter was able to set me up with a few interviews. Staff were very friendly. I did find it a bit disorganized because the original manager who was supposed to interview me never showed up so I was waiting for about 15-20 mins after my scheduled time before anyone came to see me. Other experience was even worse as I was left in a room for what seemed like 40 mins before someone came back. I wish there was more preparation from the staff involved in the process, as it felt like I was an inconvenience to them.", "Interview Questions": "Typical technical questions you would get for a nursing position"}, {"date": "7 Mar 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at HCA Houston Healthcare Clear Lake (League City, TX) in Mar 2019", "Interview Descriptions": "Ask questions to why I would like to become a employee with they company and my experiences he also told me about they facility and how many patients and all type of pts systom", "Interview Questions": "My experiences"}, {"date": "29 Oct 2018", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HCA Houston Healthcare Clear Lake", "Interview Descriptions": "It was very easy no difficult questions everyone was friendly. They ask you about your previous experience. And a lot of general interview questions like how would you handle this situation. What are your strength and weakness.", "Interview Questions": "What are my strength"}, {"date": "27 Sept 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HCA Houston Healthcare Clear Lake (Clear Lake, TX)", "Interview Descriptions": "I waited ~30 min. to get walked from HR to the unit I was being interviewed for. Was asked 7 questions from the director and 2 nurse managers. Director said I would hear something within 24 hrs. but I didn't hear I got the job until more than a week ago. Just be patient!", "Interview Questions": "Name a time you had to think on your feet."}, {"date": "31 Aug 2018", "title": "CCT Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HCA Houston Healthcare Clear Lake", "Interview Descriptions": "Clear Lake is a fan of doing a peer review type interview. Put in front of fellow techs and RNs makes it a lot easier to be interviewed. Felt comfortable.", "Interview Questions": "What is your experience? "}], [{"date": "11 Oct 2017", "title": "Monitor Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX)", "Interview Descriptions": "I applied online, and I was contacted back about 1 month later to schedule an interview. The interview went ok I guess, and after the interview they did a background check as well as the TB skin test, and they took a urine sample. One week later, I attended the new employee orientation. It was mostly discussing the hospital's policy, mission, and values. Some people later came in to give presentations. After orientation, we had lunch with important figures in the company.", "Interview Questions": "Why did you choose Clear Lake Regional?\r\n\r\nWhat are some qualities that define you?"}, {"date": "24 May 2021", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX) in Oct 2017", "Interview Descriptions": "You will interview with the manager first then a peer interview. The peer interview is your team and will try to see if you fit in the culture of the team. Try to let them see your personality and talk. No need to be shy.", "Interview Questions": "How advanced are your computer skills?"}, {"date": "10 May 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at HCA Houston Healthcare Clear Lake in Feb 2017", "Interview Descriptions": "No interview..I was hired after my contract ended. Hiring manager called me to extend the available offer, explained what the unit was about and I accepted terms. Manager was very nice and polite.", "Interview Questions": "When would you like to start?"}, {"date": "11 May 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX) in Sept 2016", "Interview Descriptions": "Panel, asked multiple questions by other nurses and also the director. Was taken to the different units and explained what the job requires of me. Also I was explained how nurses work on the floor and the support they have and how long the orientation process was.", "Interview Questions": "How would I fit in to their organization."}, {"date": "1 Aug 2016", "title": "StaRN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX) in Jun 2016", "Interview Descriptions": "It was a panel interview with about 7-9 nurses holding different positions from different units (nurse managers, charge nurses, etc). Units during my interview included IMCU, SICU, CV 1 and 2, oncology, Bariatrics, stroke med/surg, medical/cardiac, and some others. They each had the files I've submitted before, so bringing along your own resume is not needed, in fact, they will let you know to send it off to HR if you bring anything. They certainly can tell you the layout of the program if you ask specific questions.\r\nThe interview lasted about 25 minutes for me. Questions and answers were thrown across the room from both sides, and every nurse in there were very kind and receptive. Taking notes are a plus, and an even better impression.", "Interview Questions": "1)What are your fears about becoming a new graduate nurse?\r\n2) Can you work nights?\r\n3) Have you had clinicals in Clear Lake, and if so, which units?"}, {"date": "29 Sept 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake in Apr 2015", "Interview Descriptions": "was contacted by HR to set up an interview time/date.  On the day of the interview I only met with the nursing director and was offered a job on the spot.  I wasn't really asked any questions, instead it was more so me interviewing the potential employer.", "Interview Questions": "N/A"}, {"date": "10 Sept 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX) in Jan 2015", "Interview Descriptions": "I was taken to the Managers office and interviewed by the two Managers and one Director. They were very friendly and eager to hear from me. I applied for a night position as a new graduate but was offered a day position instead. A sudden unexpected switch. Overall, the interview was quick and easy.", "Interview Questions": "Why do I want to work with Clear Lake Regional?\r\nHow do I handle stress or an outraged patient."}, {"date": "30 Jul 2014", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Houston Healthcare Clear Lake in Jul 2014", "Interview Descriptions": "Submitted resume and received a call from HR the next morning. Set up appoint for early into the next week. Came to HR first as instructed. HR walked me to the office of my interviewer and began introductions. Left me with the interviewer. Felt welcomed. Made me feel at ease. I was introduced to the therapy staff in the office. Everybody was polite and welcoming. Interviewer told me she would leave me with the therapy team for a few minutes so they could ask me questions and get to know me. Everyone was so friendly and asked me questions about my experiences. They had a copy of my resume when I walked in so they already had an idea. I was asked questions about me personally. Questions like do you have a family? Where do you live? Everyone there seemed very happy working there. A lot of them have been there 10 or more years. They described there work life as \"family centered\".  Everyone looks out for each other and helps each other out. They made a lasting impression on me. Great group of folks!", "Interview Questions": "N/A"}, {"date": "30 Dec 2013", "title": "Laboratory Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX) in Dec 2013", "Interview Descriptions": "So I applied for this job over 3 months ago before they finally called me for an interview, they claimed they didn't know how my information got to them, hmm.. application maybe? lol. Anyways I accepted an interview, even though it was rejected immediately when I applied online (yeah the HR people aren't medically trained, but they apparently reject apps before the medical supervisors get to look at them). So the supervisor pushed it through anyways, then once I arrived; apparently you are treated like a child, someone has to practically hold your hand the whole way to your interview (hey we're adults, treat us like adults mmk?), but I never made it that far, I came dressed in a real expensive and nice dressy jean (silver brand) and a dockers brand long sleeved dress shirt with dockers dress shoes. Well later she came out (after I sat for almost 30 minutes, even though they say arrive 15 mins early (and i'm the unprofessional one?). Well to continue, she said I wasn't dressed appropriately and that they had to cancel the interview due to those circumstances. I would like to note that every job I have ever landed I dressed that way, actually the only job I didn't land was a big corporate sales job and I dressed in a very expensive suit which I returned the next day because I don't wear suits, they're very uncomfortable and I ain't bill gates lol. Nonetheless be prepared to \"froo froo up\" if you apply here, they think they're a big corporate hospital like christus or memorial, but at the end of the day they're still \"hca\".", "Interview Questions": "N/A"}, {"date": "4 Apr 2016", "title": "Human Resources Clerical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at HCA Houston Healthcare Clear Lake (Webster, TX) in Jun 2012", "Interview Descriptions": "She told me she hired me from my resume. I was in high school at the time and the school had a partnership with local business to hire us. I submitted a resume to the school and they distributed it to the business.", "Interview Questions": "Tell me about yourself."}]]