[[{"date": "12 May 2023", "title": "Tobacco Cessation Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in May 2023", "Interview Descriptions": "Quick. Was contracted out through a staffing firm for first two interviews. Had to do a call center simulation prior to NJ interview. Not sure what job really is given the test.", "Interview Questions": "Basic background experience, what do you do best?"}, {"date": "10 Feb 2023", "title": "Clinical Lab Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Dec 2022", "Interview Descriptions": "Applied online and recieved a phone call a week later in which we scheduled a phone interview with the supervisor. In the phone interview she described the structure of the team and job functions and then asked a few behavior questions. She then said to move on she would send a reference assessment link for reference opinions.", "Interview Questions": "When was a time that you had to be respectful of someone else's beliefs"}, {"date": "21 Jun 2022", "title": "Infection Preventionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Jewish Health", "Interview Descriptions": "Straightforward interview process. The staff and directors I interviewed with were very nice. Involved 2 zoom interviews and then an in-person interview with the current infection preventionist, as well as director of nursing.", "Interview Questions": "Asked about working with others and how you react when someone doesn't agree with your idea. "}, {"date": "26 May 2022", "title": "Web & Social Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Jewish Health (Denver, CO) in May 2022", "Interview Descriptions": "I interviewed with a lot of places and this was one of the most disorganized and uncomfortable ones I have experienced in a while. I didn't have the experience that was needed and the interviewer kind of admitted that and then said they had other positions, but they really didn't. \r\n\r\nHave the HR person do the initial screens who can read resumes and confidently ask questions. I have been flat-out rejected from other jobs that were a better fit than this one.", "Interview Questions": "What experience do you have with HTML?"}, {"date": "19 Nov 2021", "title": "PRN Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Jewish Health", "Interview Descriptions": "Phone screen with HR followed by phone interview with Pharmacy Director. Ended up taking a different position and did not complete the interview process. The people I spoke with however were very pleasant.", "Interview Questions": "Tell me why you would be qualified for this position. "}, {"date": "23 Oct 2020", "title": "Lab Scientist I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Aug 2020", "Interview Descriptions": "I had the hiring recruiter call me to tell me more about this position. After talking with her, she asked if I would like an interview with the hiring managers. I accepted, and had an interview a couple of days later. I though it went well, and called the hiring recruiter a couple days later to see when I would hear back. She said they were still deciding, and would send an email whether I got the position or not. I never heard back from anyone, and never got the position.", "Interview Questions": "Describe a time you had a disagreement with a co-worker. How did you handle it? How did things turn out?"}, {"date": "11 Sept 2020", "title": "Lab Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Aug 2020", "Interview Descriptions": "Wasn’t hard. General questions. Background questions and experiences. Started with basic background and they in depth knowledge check about the position. Job specific questions as well as general tyoe of questions.", "Interview Questions": "Experience "}, {"date": "29 Jul 2020", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Jewish Health", "Interview Descriptions": "I applied online and then received a brief phone interview with HR. This was followed by another interview with the hiring manager. Next I met the other researchers in the laboratory.", "Interview Questions": "Why do you want this specific position?"}, {"date": "10 Oct 2019", "title": "Research Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Jewish Health", "Interview Descriptions": "There is a predetermined list of questions the employer is asked to draw from to ensure each candidate is treated fairly. The company website provides resources to prepare for the interview.", "Interview Questions": "Describe a work experience where you had to make a final decision and how did that impact others? "}, {"date": "4 Sept 2019", "title": "Registrar Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National Jewish Health (Denver, CO) in Aug 2019", "Interview Descriptions": "Applied online, received a phone call to schedule an interview a few days later. The process was tailored to my position. I had an interview with the unit manager and RN.", "Interview Questions": "Strengths/Weaknesses.."}], [{"date": "2 Jul 2019", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at National Jewish Health (Denver, CO)", "Interview Descriptions": "Met the PI and was given a tour of the lab and nearby lab areas that are relevant to their research. Met a few other people working in the lab and had a mini interview with each of them.", "Interview Questions": "Why should we hire you?"}, {"date": "26 Jul 2019", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Jewish Health (Denver, CO) in Jun 2019", "Interview Descriptions": "I received a phone call and was asked to come in that same day for an initial interview at their Galleria office. After the initial interview I was asked to visit their administrative office for a second interview with management and received a verbal offer. I was completely ghosted after this final interview, with the hiring manager refusing to answer my calls or emails regarding his verbal offer.", "Interview Questions": "Do you have experience working with templates?"}, {"date": "22 Apr 2019", "title": "Clinical Lab Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at National Jewish Health (Denver, CO) in Mar 2019", "Interview Descriptions": "You will sit down with 1-6 employees who will feel you out, and ask you questions based on your resume. Imagine speed dating but for a work interview. This is purely to see whether your knowledge base matches your resume, and to figure out whether your personality will clash with the more immature employees that have already worked there for an extended period of time.", "Interview Questions": "Have you ever worked with ELISA's before"}, {"date": "28 Aug 2018", "title": "Sales Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Jewish Health (Denver, CO)", "Interview Descriptions": "Initial Interview and interview with Manager then interview with the founder of the program.  I was asked for my references which I provided and they all completed the online interview process.  After about 2 additional weeks I was told they were pursuing other candidates.  References should not be contacted unless there's an offer to be extended, it's rather disrespectful to that person's personal contacts as it's a waste of their time.", "Interview Questions": "Sales Operations Experience, Salesforce specific experience."}, {"date": "5 Apr 2021", "title": "Biomedical Researcher Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Jewish Health in Jul 2017", "Interview Descriptions": "One-on-one in person format, simple questions based on my research interests, past experiences, going over the job duties/description, logistics about the job itself. I was asked about salary expectations as well.", "Interview Questions": "How did you hear about this position?"}, {"date": "8 May 2017", "title": "Pre-Analytical Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Apr 2017", "Interview Descriptions": "I applied online early in the month and received a phone call for an interview about three weeks later. First the conducted a phone interview and invited me in for an interview with the hiring managers. The interview was behavioral and lasted about 45 minutes. After that part of the interview they allowed me to tour the lab and talk to a few people about their positions. Afterwards, they contacted me in about 48 hours for a reference check. After the reference check was complete, HR said they would contact me within a few days, which after another follow up still did not happen.", "Interview Questions": "Tell us about a time where you had to meet a deadline. "}, {"date": "9 Jun 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Apr 2017", "Interview Descriptions": "The interview process was tailored to my specific job. The questions were clear and simple and not intimidating! It was more of a conversation so that the interviewer could get a grasp of my personality!", "Interview Questions": "What skills do you have that can you bring change to NJH?"}, {"date": "6 Sept 2017", "title": "Academic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Mar 2017", "Interview Descriptions": "Phone interview lasted one hour with many questions and lots of discussion over the job responsibilities\r\nSubmit written paperwork for review\r\nGet over 5 references for review\r\nSpeak with HR if accepted and negotiate your salary!", "Interview Questions": "What are your cons?"}, {"date": "24 Jan 2017", "title": "Health and Wellness Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Jan 2017", "Interview Descriptions": "Explanation of Job. Q and A format. We spent time getting to know each other. Interviewer came across very kind. She showed me around the Department after we had interviewed. She went to great length of describing what would be excepted of me if I was hired. They were interviewing several people that day so because it was a call center they were trying to fill a lot of spots that were open.", "Interview Questions": "What is your dream?"}, {"date": "24 Apr 2018", "title": "Health Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Dec 2016", "Interview Descriptions": "The interviewer was a very nice gentleman. Very informative and kind. Hearing back from HR did take quite a long time. They made you give 5 professional references and had them do an online assignment of you.", "Interview Questions": "If I had any coaching in addiction."}], [{"date": "14 Sept 2016", "title": "Data Analysis Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Jewish Health", "Interview Descriptions": "Simple interview; they didn't ask me anything difficult.  I didn't accept the job--the vacation benefits were abhorrent and the pay not so great.  I was surprised that a hospital with such a great rep had such poor compensation and vacation.", "Interview Questions": "Why do you want to work here?"}, {"date": "3 Sept 2016", "title": "Administrative Position Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Jewish Health", "Interview Descriptions": "Generic interview questions. Would not provide salary information, not even a range. Some questions about the job were addressed very clearly; others were avoided, such as specific questions about the exact position and how it worked. Slow process between interviews (took weeks to complete the process). Interviewer was positive and promoted the organization. The interview process was very standard and in a one-on-one format. It was not too intimidating.", "Interview Questions": "Name your strengths and weaknesses."}, {"date": "16 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at National Jewish Health (Denver, CO) in Jul 2016", "Interview Descriptions": "Very easy. They are not trying to trick you in any way. They care about their patients dearly, and they want to make sure you have the same values. Only one round of interview, and was interviewed by two people.", "Interview Questions": "They asked me questions based on my resume. Tell us about yourself, and your past experience. "}, {"date": "7 Jul 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Jewish Health (Denver, CO)", "Interview Descriptions": "Very laid back, but HR can be a little unorganized. It takes a long time to actually get hired and started. The interview was very causal and non confrontational. I had a good experience interviewing.", "Interview Questions": "Why do you want to work at National Jewish?"}, {"date": "11 Jun 2015", "title": "Health & Wellness Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Jewish Health (Glendale, CO)", "Interview Descriptions": "Applied online and was offered an interview 1 week later. Asked about experience with difficult customers, a time when I felt most satisfied with my work, a time when I was dissatisfied and what I did to change it, and asked about my motivation. Automated email to list references, and sends questions to those references via email (so cool). I was then contacted by HR for an offer.", "Interview Questions": "Tell me about a time when you felt most satisfied with your work?"}, {"date": "26 Jan 2018", "title": "Staff RN I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Jewish Health (Denver, CO) in Jun 2015", "Interview Descriptions": "Submitted online application then had to wait FOREVER!! I submitted the applications, then waited almost 2 months for a call from HR. In the meantime turned down a great offer!!", "Interview Questions": "Why would you want to work at NJH? What would you bring to NJH?"}, {"date": "8 Jun 2016", "title": "Health and Wellness Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National Jewish Health (Denver, CO) in May 2015", "Interview Descriptions": "The turnover rate is high so there is a hiring event every month with 10-20 people getting hired from all different backgrounds. The interview itself is pretty basic, 30-60 minutes, but opportunities may be offered that really WON'T be offered once hired. After getting hired, all 10-20 people will start a training on the same date that can range from 2-4 weeks but training changed on a regular basis because it truly is an on the job learning experience.", "Interview Questions": "Give an example of a time you exceeded the expectations at a workplace?"}, {"date": "19 Jun 2014", "title": "Health and Wellness Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at National Jewish Health in Jun 2014", "Interview Descriptions": "2 interviews- one paper  asking basic questions - availably, what you want the job, etc. In person was more personal and in-depth gauging your knowledge of SMART goals etc", "Interview Questions": "One time you coached some one without telling them what to do."}, {"date": "12 Sept 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Jewish Health (Denver, CO) in Apr 2014", "Interview Descriptions": "The interview process was okay; It was oh phone followed by email exchanges and eventually face to face interview for 40 minutes or so; It was not intimidating at all. The questions were general followed by a few specific questions and expectations.", "Interview Questions": "strengths and weaknesses; how do you manage your time; accomplishments so far"}, {"date": "2 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Jewish Health (Denver, CO) in Sept 2013", "Interview Descriptions": "Got interviewed by the manager, radiologist and couple analysts. Interview is relatively easy. The questions are pretty straightforward. Job would be yours as long as you show your interest and get along with the group.", "Interview Questions": "What experience do you have? What's your educational/research background? "}], [{"date": "27 Jul 2015", "title": "Pre-Analytical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Jewish Health (Denver, CO) in Jul 2013", "Interview Descriptions": "I received a cold phone call to perform a brief screen, and a second to coordinate an in-person interview.  Interviewed with supervisor of Pre-Analytical department. Individual in-person interview followed by meeting the team and watching them work. I was comfortable talking to the supervisor, and did not have subsequent interviews with higher management.", "Interview Questions": "What is your level of comfort with working under pressure in a fast-paced environment?"}, {"date": "10 May 2016", "title": "Health and Wellness Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at National Jewish Health (Denver, CO) in Oct 2012", "Interview Descriptions": "Several scenarios with leads, there was a lot of Q &A. There was also a chance to tour the facility and meet others. You also have a chance to sit with others and get the jist of the job you will be doing.", "Interview Questions": "Why did I think I was a good fit"}]]