[[{"date": "16 Feb 2023", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Lewis University (Romeoville, IL) in Jan 2023", "Interview Descriptions": "I am a former alum and I applied on 11/22/22. I reached out to former professors and connections, HR, and the CS director and shared my work portfolio. The school claims they support Lasallian values, but I’m starting to believe that is false. Someone reached out on 12/20 for a brief phone screening and I was asked to join a zoom conference on 1/6. It was a panel interview with the supervisor and other admin. I felt inadequate, but I hoped they could sense my genuine passion for the vocation. I was asked to come to Lewis for an in person interview. I arrived at 11:20 and I left around 3:18pm. There was a snowstorm but I was determined to be there interview. Prior to that, I had a conference with the HR dept about all the amazing benefits, insurance, etc…we talked about an hour and I felt certain that meant I was a top choice. I gave a 10 min presentation in front of two different groups. I tried to share personal stories when I was a student. The last part involved about 18 individuals coming in - deans, admin, PC, business dept, etc firing long winded questions. I had to keep asking them to repeat themselves and my brain was on overload. This tripped me up. Being towards the end of the interview (going on 4 hours) I didn’t have the same tenacity and started to feel very intimidated. I can only imagine the things they said about my lack of experience and knowledge. I tried to write down everyone’s name and emailed EVERYONE a thank you the next morning. I even offered to volunteer for an upcoming career services event. I followed up 3x after that, they kept telling me the interview process takes a long time. Today on 2/16 they shared they wanted to go in a different direction. They probably wanted someone more seasoned and didn’t have patience for helping an alum develop professionally.", "Interview Questions": "Tell me what you know about Lewis’ mission. How will you support Lasallian traditions?"}, {"date": "22 Feb 2021", "title": "Campus Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Lewis University", "Interview Descriptions": "The interview process consists of multiple interviews, submitting an essay about how you would advance the University Mission if you got the position, and answering several questions about yourself and previous work experiences.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "26 Nov 2019", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Lewis University (Romeoville, IL) in Feb 2019", "Interview Descriptions": "Applied online. Sent in a cover letter and a resume. I was on phone call and interviewed in person. Questions are behavioral. \r\n\r\nOnly problem I had was that Lewis gives clear preferential treatment to women over men. Every GA at Lewis University and over 65% of the staff are female. Males need not apply.", "Interview Questions": "Give me a time you overcame a difficult situation? What did you do and what did you learn from the experience?"}, {"date": "11 Nov 2017", "title": "Freshman Admission Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Lewis University (Romeoville, IL)", "Interview Descriptions": "I applied via email and received an interview about two weeks later.  First had an unscheduled phone interview and was asked to come in for a formal interview. Was asked to prepare a 10 minute presentation to present to the current admissions staff.", "Interview Questions": "Why do you want to work here?"}, {"date": "13 Jun 2017", "title": "Event Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lewis University", "Interview Descriptions": "There was a lot of paperwork to fill out but not much of an interview. IT was very easy to apply and the supervisor was very helpful. It is a very basic job, so it is not a treacherous process.", "Interview Questions": "Are you a good communicator?"}, {"date": "12 Aug 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Lewis University (Romeoville, IL) in Jun 2017", "Interview Descriptions": "I was promoted after being a student worker so the interview process was comfortable for me, with people I knew. It was an average interview, nothing too easy or nothing too hard.", "Interview Questions": "Where do you see yourself in 5 years? 10 years?\nWhat can you bring to this team?"}, {"date": "18 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lewis University", "Interview Descriptions": "-part of interview in Spanish (as faculty member of Spanish), part in English\r\n-more informal, friendly style interview\r\n-explained teaching methods and strengths/weaknesses as teacher\r\n-explained Spanish major/minor and how that works", "Interview Questions": "What are your strengths as an educator?"}, {"date": "15 May 2015", "title": "Human Resources Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lewis University", "Interview Descriptions": "I applied online and was contacted within 3-5 days for a brief 20 min phone interview. Upon completion the interviewer scheduled an in person interview a few days later. Prior to this interview I was asked to prepare a powerpoint presentation on an HR topic of my choice and to last approximately 20-25 minutes long. I arrived to the interview 10 mins early and my interviewer was 10 mins late. When taken into the conference room for the interview there were 5 other employees that entered the room. I was not prepared for this and throughout the interview I felt I was up against a firing squad. Each person battled to ask questions and none of them has any personality whatsoever. After an hour and a half I was dismissed and said that I would be contacted within 5 days. I was never contacted nor was I interested in moving forward with the interview process.", "Interview Questions": "Questions consisted of mostly, \"How would you initiate change, handle difficult situation, etc...\""}, {"date": "28 Feb 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Lewis University (Romeoville, IL) in May 2015", "Interview Descriptions": "I was called in to the interview and asked questions about my prior experience in a similar role. It was pretty straightforward and the interviewers were friendly. It was short because I had had the same interview a year before and did not get the job the first time due to another candidate having more experience. I was called the day after to say I had the job.", "Interview Questions": "Your resume says you were a _____. Tell us some of the day to day duties and the kind of leadership you showed in this industry"}, {"date": "1 Sept 2016", "title": "Computer Labaratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Lewis University (New York, NY) in Jan 2015", "Interview Descriptions": "The interview process went on very smoothly. I was examined on how efficient i am with using excel power point and other kind of computer software. It was a very good expirience i must say and very challenging at the same time", "Interview Questions": "Where do i see myself 3years from now(career goal)"}], [{"date": "25 Dec 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Lewis University", "Interview Descriptions": "Pretty basic interview, basic questions are asked. No curve ball questions or anything like that. After the interview, management will typically call you within a few days and tell you your schedule and when training is.", "Interview Questions": "None, straight forward"}, {"date": "24 Jan 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Lewis University (Romeoville, IL) in Aug 2014", "Interview Descriptions": "They asked me if i was familiar with the systems they used in the department and if i had any administrative skills from previous jobs. They asked me my interests and hobbies.", "Interview Questions": "Have you worked with Salesforce before?"}, {"date": "13 Nov 2013", "title": "Director of Prospect Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lewis University (Romeoville, IL)", "Interview Descriptions": "Went through a phone screening, then 3 in person interviews.  I did not speak with Human Resources until hired.  I did have to submit a mission reflection piece in order to be hired.", "Interview Questions": "Had to answer questions regarding my experience"}, {"date": "18 Oct 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Lewis University (Romeoville, IL) in Aug 2012", "Interview Descriptions": "The interview process moved swiftly. The interview itself was very short but productive. I received the job almost on the spot, but it was a student job. The interview had a lot to do with customer service experience, which is the main aspect of their jobs. The process in itself was short and quick.", "Interview Questions": "What is your background in working at a library?"}, {"date": "14 Nov 2014", "title": "Alumni Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Lewis University in Mar 2012", "Interview Descriptions": "The interview process and hiring process were very smooth. Those involved were courteous of the candidates and the process. The timeframe from the initial interview to the offer was not very long.", "Interview Questions": "There were no surprise interview questions."}, {"date": "16 Jan 2014", "title": "Foreign Language Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Lewis University (Romeoville, IL) in Apr 2010", "Interview Descriptions": "The interview was very simple and the questions were basic. They want to know what languages you currently speak and what you're interested in. The department is rather small and it appears that almost everyone is an adjunct. The interview was very laid back yet very professional. Don't expect anything too hard and the people there are very nice.", "Interview Questions": "If you happen to speak the same foreign language as the person interviewing you expect to be talked to in that language"}, {"date": "26 Jul 2010", "title": "Orientation Group Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Lewis University (Romeoville, IL) in Apr 2009", "Interview Descriptions": "I applied to the student services office. From there I was put in a group where we were given a few case studies of what a new student may go through. We then worked in our group to determine how we would handle each of the cases. After about 10 mins to discuss amongst ourselves we were asked to join the interview panel who then asked us about the cases and questions regarding the universities mission and what it means to us. I was then called in for a second panel interview in which we were asked to put together a presentation we would give to introduce a student to the university.", "Interview Questions": "Three cases about what a new student might encounter. Be sure to establish a leader in your small group that you work with."}]]