[[{"date": "10 Jun 2018", "title": "Field Contractor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Obama For America in Mar 2018", "Interview Descriptions": "Had a phone interview that lasted a RIDICULOUS long time, over 1.5 hours!  Basically asked the same questions over and over but in a different way.  I also found it hilarious that the goal was to keep the ACA in action, yet they didn't even want to give their employees health insurance nor benefits.  After the this long interview, I emailed my contact person, not once, but twice.  He didn't even have the courtesy to respond about whether the position had been filled.  Horrible and unprofessional experience.", "Interview Questions": "Tell me about your organizing experience."}, {"date": "18 Apr 2019", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Obama For America (New York, NY) in Mar 2018", "Interview Descriptions": "Process took place over the phone. Easy interview questions, lasted about 20 minutes. Lots of discussion on hobbies and interests. Fun time. They replied back to me with a response in five days.", "Interview Questions": "What do you like to do for fun?"}, {"date": "18 Sept 2015", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Obama For America", "Interview Descriptions": "Phone Call Interview with the Regional Field Director. We talked about my past organizing experience for about one hour. I gave detailed responses about my organizing experience and the OFA Fellowship Training Program. During the interview, we also discussed what my responsibilities would be if I was hired by OFA. After the phone call interview, all other questions were taken care of via-email. I accepted the offer a couple of days later.", "Interview Questions": "Describe a difficult situation you organized"}, {"date": "5 Aug 2015", "title": "Headquartersand Volunteer Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Obama For America (Chicago, IL)", "Interview Descriptions": "I volunteered, someone I worked for realized I was competent and recommended me to management, management asked me a few questions, I was hired that day.  Typical process for campaigns.", "Interview Questions": "How would you manage the intern process, so every department had an intern (even the less desirable places to work)?"}, {"date": "26 Feb 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Obama For America", "Interview Descriptions": "It was all phone interviews. They moved fasts as befits a campaign. This was for the summer before the 2012 election so there wasn't any time wasted. Campaigns are the definition of moving fast - puts any startup to shame. Loved working for the President. He, as well as the First Lady came by HQ which was a tremendous thing to see.", "Interview Questions": "Mostly just my experience with political polling and analytics. Nothing unexpected"}, {"date": "17 Jan 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Obama For America", "Interview Descriptions": "I applied online through the campaign website and had to wait for a couple of months before I was contacted. I was emailed by a department director and we schedule a phone call. During the call, I was asked basic questions about my background and interest in working there, and was offered the job on the spot.", "Interview Questions": "N/A"}, {"date": "13 Oct 2013", "title": "Deputy Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Obama For America", "Interview Descriptions": "Most hires are made through the pool of organizing fellows. If you vocalize your desire to be hired as staff, work hard and learn the ropes quickly, there's a very good chance you'll get hired!", "Interview Questions": "N/A"}, {"date": "12 Dec 2012", "title": "Press Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Obama For America", "Interview Descriptions": "i was initially contacted by someone on the phone who saw that i was interested in working on the campaign. everything was done over the phone since the job was in Florida and i was currently located in Virginia. it was an easy process.", "Interview Questions": "N/A"}, {"date": "16 Nov 2012", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Obama For America", "Interview Descriptions": "2 phone interviews; one 90 minutes and one 30 minutes. Hired afterwards", "Interview Questions": "When was a time you had to work a very long time without rest?"}, {"date": "12 Aug 2015", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Obama For America (Arlington, VA) in Sept 2012", "Interview Descriptions": "Much more casual than the typical interview process, but pretty standard for the campaign world.  Asked about my experience working on campaigns, why I wanted to jump on the campaign at that stage, etc.  Basically my experience spoke for itself, and it was just a getting-to-know-you meeting. They needed more people, I was excited and motivated to get started, it was a relatively easy process once they determined I was a match with what they needed.", "Interview Questions": "How well do you know the area?"}], [{"date": "16 Jan 2013", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Obama For America (Cocoa, FL) in Jun 2012", "Interview Descriptions": "I was an intern brought on for the summer. I was advised that a couple of positions would be opening up and I indicated that I was interested. Then, submitted a resume to my boss, did an in person interview/discussion then a telephone interview.", "Interview Questions": "What drives you? Why do you want to work so very hard, given mediocre compensation?"}, {"date": "12 Jul 2016", "title": "Advance Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Obama For America (Minneapolis, MN) in May 2012", "Interview Descriptions": "Call on Skype brief. I was referred from another person who thought I would be good for the job. Word of mouth was good enough for an interview. Started out on contract more like a trial run.", "Interview Questions": "What is your background"}, {"date": "22 Oct 2013", "title": "Organizing Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Obama For America (Chicago, IL) in May 2012", "Interview Descriptions": "I would get on them if you are really into it. I think sending an email to the office head about when they'd come to a decision helped me. Remember--about 1/6 will get it, most of them students like you.", "Interview Questions": "Name a time where your leadership wasn't immediate"}, {"date": "6 Jun 2015", "title": "Organizing Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Obama For America in Apr 2012", "Interview Descriptions": "Drove to the field office and had an interview with the state director and the assistant. The interview was informal, but they asked about my resume experiences, a few policy questions, and why I would want to be part of OFA. Overall a warm interview really about getting to know the candidate. Organizing requires generally extroverted personalities, so they probably vetted for character/values/etc.", "Interview Questions": "Why do you want to work for OFA?"}, {"date": "26 Feb 2013", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Obama For America (Cincinnati, OH) in Dec 2011", "Interview Descriptions": "2 interviews in person", "Interview Questions": "N/A"}, {"date": "10 Dec 2011", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Obama For America (Chicago, IL) in Aug 2011", "Interview Descriptions": "I applied for the internship online.  A few days later I was contacted by e-mail to set up a phone interview.  They asked questions such as why I wanted to work in politics, why I support President Obama, etc.  If you follow politics at all it's not a difficult interview.", "Interview Questions": "Why do you support President Obama?"}, {"date": "24 Feb 2010", "title": "Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Obama For America (Chicago, IL) in Jul 2008", "Interview Descriptions": "Volunteer experience was critical in landing an interview with the campaign. Like many other jobs in n on-political fields, knowing someone, or knowing someone that knows someone is an important part of getting your resume or work looked at. In the frantic pace of a campaign, hiring managers rarely look outside their own circle/networks, so it helped that I had experience volunteering for the campaign before being offered a position. The interview itself consisted of a tour and what felt like more of a personality test than a skills and capabilities test, despite my preparation for a very hands-on interview.", "Interview Questions": "Can you make it to Chicago?"}]]