[[{"date": "21 Sept 2022", "title": "CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "First they called me to schedule a phone interview where they asked general questions such as my availability and experience. Next they scheduled an in person interview. During the interview they asked questions about my experience, availability, why do I want to work there, and asked me about challenges I’ve faced and how I got through them.", "Interview Questions": "Think of a mistake you’ve made. What consequences resulted from it and how did you solve it."}, {"date": "5 Apr 2022", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "Asked tech questions related to software and design. Overall good experience. The interviewer helped throughout the process. About 20 question were asked. Initially made mistakes but interviewer guided through the test cases and showed mistakes.", "Interview Questions": "Data Structure, basics of design"}, {"date": "31 Mar 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "GOOD and EASY, the clinic is new and small love working there, the staff is nice, the pay is above average compared to other clinics.  Overall, Really enjoyed working at this place. location good too", "Interview Questions": "What I like to do for fun"}, {"date": "16 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "It was a great experience, you can tell they care about you and what you will be doing at the job. Some tough questions but it was a decent process overall", "Interview Questions": "Name a time you had a conflict at work"}, {"date": "10 Feb 2022", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Elizabeth Healthcare in Feb 2022", "Interview Descriptions": "It was an average interview process. Be prepared to ask questions and talk openly about experiences.  The hiring manager was easy to talk to so it made the interview even better.", "Interview Questions": "Do you have any experience in a large facility doing housekeeping or Evs? "}, {"date": "17 Mar 2022", "title": "Activities Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Elizabeth Healthcare (Warwick, RI) in Jan 2022", "Interview Descriptions": "Welcoming & relaxed. The most impressive thing was that they wanted ideas on improvements to the monthly calendar which demonstrated their support of new ideas & teamwork. Also, a time frame for the hiring decision was important information for me. They said they were making offers by end of week. I interviewed on Monday so the short time frame was a plus.", "Interview Questions": "What can you add to the team?"}, {"date": "26 Feb 2022", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Aug 2021", "Interview Descriptions": "I sat down with a  panel of three board members. They asked questions and reviewed my work history. We engaged in small talk and discussed specific relevant concerns obtaining to the position. I also asked questions.", "Interview Questions": "What is your weakness? What is your strength?"}, {"date": "10 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at St. Elizabeth Healthcare (Erlanger, KY) in Apr 2021", "Interview Descriptions": "The interview process was very good.  It was a 2 step process.  I interviewed with a floor nurse and then interviewed with the head nurse of the area that I was interested in.", "Interview Questions": "Why was this the profession you chose"}, {"date": "29 Mar 2021", "title": "Register Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "Interview process is very clear and manager explains everything about job and was very professional, so I was very confident during interview. All staff was very friendly and polite during the interview process. I definitely recommend to work with st.E", "Interview Questions": "What is the importance of team work"}, {"date": "8 Nov 2022", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at St. Elizabeth Healthcare in Feb 2021", "Interview Descriptions": "Two interviews. They will start you will one and then call you back for a second interview. Dress professionally. Ask questions and be on time. Answer appropriately to each question given", "Interview Questions": "What makes you think you are right?"}], [{"date": "5 Jan 2021", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "Received email from recruiter. Interviewed with department lead. Was easy peezy lemon squeezy. Received offer several weeks later. It’s quite silly that in order to view reviews on a specific job, you have to enter your own review.", "Interview Questions": "What is your past experience? "}, {"date": "3 Jun 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Elizabeth Healthcare (Cincinnati, OH) in Apr 2020", "Interview Descriptions": "Initial phone interview and then In person. Situation questions, references, printed resumes, online test. Good overall experience. Nice staff, good recruiters, calls back fast. would recommend. Enjoyed the recruiter, stayed in touch. Hr then reaches out.", "Interview Questions": "How do you handle stress. "}, {"date": "18 Jun 2018", "title": "Registration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "Attended a job fair.  Received 2 interviews at the fair.  About a week later, received a call from HR to come in for a face to face interview with Recruiter.  It was basically a formality.  She had an offer ready for me.  Completed the background check and drug screen and then was assigned to a training class.", "Interview Questions": "I was interviewing for a part time position.  The hiring manager tried to convince me to consider a full time role and leave my full time career.  Would you consider coming here full time?"}, {"date": "11 Sept 2018", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Feb 2018", "Interview Descriptions": "The process went good it was very fast from the time I had the interview until the time I started. We had to go upstairs away from the lab and to where the supervisors offices were. This made me feel like I was going some where important. We sat down at a big table and they started the process by just trying to get to know a little about me.", "Interview Questions": "How would your skills translate to your new position in the lab?"}, {"date": "16 Apr 2019", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Jan 2018", "Interview Descriptions": "Took over 6 months to get hired. Interview was 1 hour long. Human resource turn around time is to long.  Great interview very relaxed. No real hard questions just layed back discussion about myself and company policies.", "Interview Questions": "Do you see yourself here for career"}, {"date": "7 Nov 2017", "title": "Phlebotomy Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Elizabeth Healthcare in Oct 2017", "Interview Descriptions": "Called me on the phone and asked when I could come in. I showed up for my interview only to find out the other person who was to conduct the interview took a PTO day. \r\nI figured at that point i was not getting the job.", "Interview Questions": "Why do you want to take this position?"}, {"date": "20 Nov 2017", "title": "IS Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Elizabeth Healthcare (Cincinnati, OH) in Oct 2017", "Interview Descriptions": "Friendly, asked me a few questions about my previous experiences and then asked me three or four situational (what if?) questions. After  that she told me that there hiring manager is on vacation and that sent me links for the psychoanalysis job test.", "Interview Questions": "What would you do if a team member is disruptive to the project?"}, {"date": "21 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "Depends, best way plan is to reach out to an HR recruiter. Apply online, if you are a new nurse look for the link for Nurse training program.", "Interview Questions": "Future educational plans, how to handle difficult situations "}, {"date": "25 Apr 2018", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in May 2017", "Interview Descriptions": "HR interview was super easy- why you want the job, what type of job you're looking for, etc. Floor interview was a little bit more difficult and included a tour of the unit.", "Interview Questions": "What problems have you had with co-workers on your previous job? Why do you want to work here? Why should we hire you?"}, {"date": "3 Jan 2017", "title": "Medical Staff Services Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Elizabeth Healthcare (Northern, KY) in Dec 2016", "Interview Descriptions": "I met with Director of Human Resources where she asked me general questions. As in regards to my strength and weaknesses. Why am I looking for a new job? Then I met with the Director of the position I was interviewing for.", "Interview Questions": "What are you looking elsewhere for a new job?"}], [{"date": "2 Aug 2016", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Jul 2016", "Interview Descriptions": "Applied online and was called the next day for an interview with HR. She forwarded my resume to a couple departments. I've had one interview with a nurse manager and another interview on a different floor this week. I am still in the process and have not been offered a position as of yet.", "Interview Questions": "Name a time you made a mistake and how you handled it."}, {"date": "15 Oct 2017", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Elizabeth Healthcare in May 2016", "Interview Descriptions": "They use Skilled Survey.......you have to give the e-mails of 5 references which the company sends to the people you listed as references, and wait for the people to respond.  That leaves your application in limbo until they get the report back from the company....the problem is most people don't want an extra task to do during to day.....so you have to constantly hound your references to do the questionnaire.  Human resources will not forward your resume to a hiring manager until that is complete, so you may not even get an interview, but you are forced to bother your references with no idea if you will even be interviewed.....they don't realize that it takes a lot of work to get this done.   \r\nThis company is located in Northern Kentucky and is extremely racist and will not hire minorities for anything other than janitorial , or laundry (menial) positions.  They will NOT hire blacks to work in the pharmacy.   I was told I didn't have recent experience, and then when I applied to other positions I was told I didn't qualify at all to work as a pharmacy tech in their hospital at all .....even though I have 25 years experience and was certified in 1995 and worked in a hospital environment for most of my career. The minute I showed up for the interview ....they were very unwelcoming and acted as if I was wasting their time.  Equal opportunity is a joke in this religion based hospital.  They do not want to see blacks in a suit and tie, or as a medical professional in a white coat.......but as long as you have a mop in your hand you will be fine.", "Interview Questions": "The usual  interview questions."}, {"date": "10 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at St. Elizabeth Healthcare (Florence, KY) in Mar 2016", "Interview Descriptions": "Went to hiring event. Brought resume and interviewed with manager on the spot. Had second interview with human resources a week after. Was sent for ppd and drug screen. It took about 3 months of orientation before going to the floor. Offers great orientation for new graduates. Positive overall experience.", "Interview Questions": "Strengths and weaknesses"}, {"date": "24 Sept 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Jun 2015", "Interview Descriptions": "Initially I applied for a position online through their website.  I received a call from a lady with HR who asked me to come in for an initial interview.  It went well and she said she wanted to forward my resume to a department in the hospital.  I received a call for an interview with management about a week later and made the appointment for the following day.  It all went pretty smoothly.", "Interview Questions": "Why do you want to work for our company."}, {"date": "2 Jul 2015", "title": "EMS Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Elizabeth Healthcare (Florence, KY) in May 2015", "Interview Descriptions": "Applied online, got a call from HR within 24 hours.  Interview scheduled with hiring manager, who didn't show up and I interviewed with a nurse manager who really had no input on anything.  Met with a \"committee\" a week later and they seemed totally disinterested in my actual experience but with issues not really part of the job; like my choice of degree (BSN). Left with a \"you will hear from us in a week or so.\"", "Interview Questions": "They seemed weirdly concerned with the fact I moved from another state; when the person I would have replaced was herself from another state; by her own admission.  They were, again, weirdly concerned over my pursuit of a BSN: even though I think I told them 10 times I wasn't getting that degree to be a RN, but to just get a degree.  Not a lot of actual job related questions."}, {"date": "15 Dec 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Elizabeth Healthcare (Edgewood, KY)", "Interview Descriptions": "I had 2 interviews. One with HR that went really well. The HR manager was very kind and professional. The 2nd interviews went well. The hiring managers are kind and ask you pretty much standard questions. It can be pretty informal and it may catch you off guard...but always remain professional and ask them questions.", "Interview Questions": "why did you want to become a nurse"}, {"date": "25 Nov 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at St. Elizabeth Healthcare", "Interview Descriptions": "Glassdoor wants thirty words, so thirty words they will get, there isn't much to say about nursing jobs, they ask you standard questions and you give them standard answers. If you have a license and a pulse, that will probably suffice.", "Interview Questions": "N/A"}, {"date": "12 May 2015", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Nov 2014", "Interview Descriptions": "after submitting an online application I received a phone call from the recruiter at Saint Elizabeth's healthcare. Expressed that she was  very interested due to my qualifications and long-term employment as a RN. I explained my recent relocation and desire to work part time and in the Northern Kentucky area.", "Interview Questions": "what type of job was I looking for"}, {"date": "30 Aug 2017", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at St. Elizabeth Healthcare in Aug 2014", "Interview Descriptions": "Very friendly, they asked the standard questions. I knew someone who worked in the department so it helped me get the job. Remember to not burn any bridges and everyone knows someone in the organization.", "Interview Questions": "What made you apply for this position"}], [{"date": "18 Aug 2015", "title": "Pre Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at St. Elizabeth Healthcare (Erlanger, KY) in Apr 2014", "Interview Descriptions": "one on one interview with supervisors and and additional interview with management. Questions about education and what do you have to offer St. Elizabeth. What training and experience do you have? how do you get along with your co-workers? How many absences and/or tardy's have you had in the last year?Are you flexible with St Elizabeth's hours of operation at this location? tell me about yourself?", "Interview Questions": "What experience do you have in healthcare? can you work overtime hours? what made you apply for this position?  "}, {"date": "17 Sept 2013", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Elizabeth Healthcare (Crestview Hills, KY) in Aug 2012", "Interview Descriptions": "Received a call for an interview. Interviewed with director and one member of their staff.", "Interview Questions": "Asked basic SQL questions"}, {"date": "13 Jun 2016", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Aug 2012", "Interview Descriptions": "Interview was typical - meet with lab supervisor and meet with HR. The only con is HR is now off Mineola Pike - not in the Edgewood building - this means you have to go to the site you will work at, then to HR, then to the Edgewood hospital for drug testing, etc.", "Interview Questions": "How have you been able to handle a crisis situation?"}, {"date": "23 May 2013", "title": "Medical Records Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Elizabeth Healthcare (Covington, KY) in Mar 2012", "Interview Descriptions": "Got contacted by email to set a interview. Interview was pretty straight forward and questions regarding the job. she told me the process of the job from beginning to end. she then showed me first han how people do the job and how to deal with problems that arise. overall it was straight forward.", "Interview Questions": "the most unexpected question for me was when they asked me how long i was going to work there."}, {"date": "23 Nov 2015", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Elizabeth Healthcare (Edgewood, KY) in Mar 2011", "Interview Descriptions": "Met with interviewee and went over resume and she offered potential jobs to me other than one I applied for. Very friendly and professional. Brought in the supervisor of the job I was applying to to chat with.", "Interview Questions": "What are your expectations?"}, {"date": "7 Mar 2014", "title": "Processing Tech III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at St. Elizabeth Healthcare in Feb 2010", "Interview Descriptions": "Everything we as expected, the typical questions.", "Interview Questions": "The most unexpected question was where did I get my shoes from. Go figure."}]]