[[{"date": "8 Sept 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at OakBend Medical Center", "Interview Descriptions": "Kind of nice. But not feeling good. There were two ladies interviewed me. They delayed me back and asked me a few questions about Certified Nursing Aide. The environment is general and employees are nice.", "Interview Questions": "Do you want to take care if COVID-19 patient?"}, {"date": "26 Aug 2021", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OakBend Medical Center", "Interview Descriptions": "It was probably the worst interview ever. Mostly one way where i was asked questions and no duties regarding the positions were discussed. Just behavioral questions and previous work history were discussed. Very disorganized and the intervieweer was constantly taking notes and barely made any eye contact. I have no idea whey i even applied to this place, there is no mission/vision for this hospital and just seems like a very dull place.", "Interview Questions": "Tell me about a time you had to deal with an unruly patient/family member. "}, {"date": "2 Mar 2021", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OakBend Medical Center (Richmond, TX) in Jan 2021", "Interview Descriptions": "Really non-threatening. The interviewers make you feel at ease. There were two people interviewing me and they asked various questions that lasted 15-20 minutes. They make it seem like a conversation, so the interview can go really well.", "Interview Questions": "What animal would you be and why?"}, {"date": "12 May 2020", "title": "ICU RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OakBend Medical Center (Richmond, TX) in Apr 2020", "Interview Descriptions": "The interviewer was very friendly and easy-going. I was called for an interview 6 days after applying, the interview was 4 days later, and I heard back from them 2 weeks after the interview.", "Interview Questions": "Define excellence and ownership."}, {"date": "21 Dec 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at OakBend Medical Center (Houston, TX) in Oct 2019", "Interview Descriptions": "It was a 2 step interview with 2 panel interviewers. One of the managers was nice and asking all the questions, the other person was quiet, she didn't have much to say and excused herself from the interview, maybe she felt the other manager was talking over her.", "Interview Questions": "How do you handle conflict?"}, {"date": "15 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OakBend Medical Center in Dec 2018", "Interview Descriptions": "It was easy and straight forward. Simple questions were asked and shared some past experiences with examples. Manager was good and make me feel comfortable.  Two of the unit nurses were also part of the interview and asked scenario based question on what you would do in specific situations like code grey etc. ", "Interview Questions": "What do you like about being a Nurse"}, {"date": "24 Jul 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OakBend Medical Center", "Interview Descriptions": "Via web. It was a group interview. The process was nice but the facility procedures are scary. Beautiful facility thou. The HR department has changes now ive heard. They need help with management.", "Interview Questions": "How long I've bern a nurse"}, {"date": "3 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 10 months. I interviewed at OakBend Medical Center (Houston, TX)", "Interview Descriptions": "Fake, Lies, Deceit, sells you dreams, gets in your personal business, coworkers throw you under the bus, popularity contest, not genuine, say anything to get you in the door", "Interview Questions": "how many years of experience "}, {"date": "15 Feb 2017", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at OakBend Medical Center (Richmond, TX) in Nov 2016", "Interview Descriptions": "They asked me to wait in the lobby. The HR director told me they decided to have an impromptu meeting when she came to get me 30 minutes later. The interview went well, my problem is the lack of communication from them afterward. I was told I would hear back in 2-3 weeks. On the 3rd week, I emailed the director & a recruiter (who told me I should apply) to check for progress. 3 days later, the director emailed me back saying the position has been filled. Got the same email from the recruiter a week later. \r\nIs it so hard to send a rejection email? Even a generic copy & paste one is better than silence.", "Interview Questions": "Typical questions: What's your strengths? weakness? Why are you interested in this position?"}, {"date": "4 Oct 2017", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at OakBend Medical Center in Oct 2016", "Interview Descriptions": "Interview was laid back, alot of laughing and joking around.\r\nAfter getting the job everything was good, until I started seeing how they liked turning co-workers against each other and tell on each other. I would not recommend anyone to work here, it is by far the worst work environment anyone should work at.... The COO was very arrogent and rude! 1 of the COM is the daughter to COO and operated the same as mummy dearest! To sum it up UPPER MANAGEMENT SUCKED and NEED MORE TRAINING ON MORALS, RESPECT, AND TEAM WORK!", "Interview Questions": "They asked if I was a team player, because they were looking for such employees to \"fit in\"."}], [{"date": "12 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OakBend Medical Center (Richmond, TX)", "Interview Descriptions": "It was pretty laid back. They really needed nurses at the time, so it was basically a given that the job would be mine so long as I didn't blow it by saying something ridiculous. It was more of an hour long chit chat with the nurse manager than a high intensity interview.", "Interview Questions": "What would one of your former managers say about you? How do you handle high stress environments?"}, {"date": "11 Jun 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OakBend Medical Center (Rosenberg, TX)", "Interview Descriptions": "Telephone interview first. Then a group interview with the department manager, day shift charge nurse and 5 other staff members including other nurses and nurse aids. It was a bit intimidating as everyone randomly asked questions. I don't think they really cared on what I answered but were determining if they liked my personality", "Interview Questions": "How do you handle conflict."}, {"date": "23 Jan 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OakBend Medical Center", "Interview Descriptions": "Easy one to one interview followed by a tour of the area and brief introductions to staff.  Pleasant and relatively laid back atmosphere during interview and tour.  Facility nice and clean and everyone was pleasant.  Applied online, interview set up approximately 1.5 weeks later.  Received call for second interview same day.  Declined second interview as job description different than posted online and hours not the same as posted online.", "Interview Questions": "Tell me about yourself."}, {"date": "14 Jan 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at OakBend Medical Center", "Interview Descriptions": "Very pleasant interview process. I was in an office with manager, charge nurse and another department head.  Had some basic conversations regarding workplace, how it functions, any assistance for RNs.", "Interview Questions": "asked questions regarding to the workplace, N to P ratio, census etc...."}, {"date": "24 Mar 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at OakBend Medical Center (Richmond, TX) in Oct 2015", "Interview Descriptions": "The interview process is simple, make sure that you fill out the online application prior to coming in for job fair (if applicable) bring a copy of your resume and really listen to the mission statement. Patient's First...", "Interview Questions": "To name a situation that I have experienced that had an irrational or confrontational person and how did I handle it?"}, {"date": "2 Feb 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OakBend Medical Center in Aug 2015", "Interview Descriptions": "They called me in and asked a few simple questions. There were 3 people who interviewed me. Not a hard interview at all.  Whole process from applying to hiring took about 3 to 4 weeks.", "Interview Questions": "How do you organize and prioritize tasks that you need to work on?"}]]