[[{"date": "19 Feb 2023", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps College", "Interview Descriptions": "I interviewed with the associate Dean and the director of the program who first called me. The Dean later called me and offered me the job with details about the position.", "Interview Questions": "They will ask you how you structure and teach your class, how you work individually with students, and how you manage the classroom."}, {"date": "17 Apr 2021", "title": "Foundation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps College", "Interview Descriptions": "Long interview process with thorough questions and interviews with multiple associates from the organization. Appreciate all of the communication and transparency from everyone. There was a test that they administered without any notice.", "Interview Questions": "Past experience, job expectations, salary expectations "}, {"date": "5 May 2022", "title": "Emergency Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps College (Claremont, CA) in Apr 2018", "Interview Descriptions": "I was called by an administrative assistant. She was the same person who met me when I arrived. \r\nI was interviewed by a panel of 5 people. The took turns asking questions asking me about different experiences and scenarios. The interview lasted about 30 minutes.", "Interview Questions": "Tell me a time when you had to overcome a difficult problem."}, {"date": "7 May 2022", "title": "Tutoring Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps College in Apr 2018", "Interview Descriptions": "Completed interview with previous tutor coordinator and supervisors (Deans); they were very friendly and approachable, it was not intimidating at all. Before hand I applied with a resume and cover letter and references.", "Interview Questions": "They ask about time management, ability to promptly reply to emails, etc. "}, {"date": "24 Nov 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps College (Claremont, CA) in Sept 2017", "Interview Descriptions": "Easy process. Applied online, got an email and was invited to come in for an interview. Only two people were there. They asked about research experience, and why I wanted the job.", "Interview Questions": "What is your experience with excel?"}, {"date": "15 Jan 2017", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps College (Claremont, CA)", "Interview Descriptions": "The interview process was very pleasant and welcoming. The staff spoke highly of the mission of the university and gave clarity to the role in a way that most other interviews have not. I appreciated their candor and left with a clear sense of what would be expected as a member of the team.", "Interview Questions": "How do you see yourself balancing the cyclical nature of the admission process?"}, {"date": "26 May 2017", "title": "Web Designer (Student On-Campus Work-Study) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Scripps College (Claremont, CA) in Oct 2016", "Interview Descriptions": "Extremely casual and laid-back... I found the position on a social media post published by another student, and emailed her. She introduced me to the head of the department that was hiring, and we met for an informal coffee interview. He explained the projects he wanted completed, and I detailed my experience and explained how I would approach and complete his proposed projects. He hired me on the spot and I started in immediately.", "Interview Questions": "What is your artistic aesthetic, and are you flexible in trying new styles?"}, {"date": "18 May 2020", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps College (Claremont, CA) in Sept 2016", "Interview Descriptions": "I was brought into the supervisors office. They asked me about 5 open-ended questions about the position, then they asked me which position i was interested in (i applied to two) and then offered the job on the spot", "Interview Questions": "What does health mean to you? "}, {"date": "24 Jun 2016", "title": "Emergency Management Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Scripps College (Claremont, CA)", "Interview Descriptions": "I was first given a phone interview with a group of 5 interviewers. They took turns asking questions and every question began with \"Tell me a time when...\" A couple weeks later I was asked to come to the college for an in-person interview. I sat at a round table with the same 5 people. They again took turns asking questions, each one beginning with \"Tell me a time when...\". While I was answering another person's questions, the other interviewers were obviously checking their email on their phones in their laps. \r\nThe questions were tedious. Each person asked a couple of questions. How many examples can you think up within moments?", "Interview Questions": "Tell me a time when you had an idea that was not well accepted by the rest of the team."}, {"date": "24 Feb 2016", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Scripps College", "Interview Descriptions": "Although I hate and don't see the point of being put before an interviewing panel of 4+ people on only the FIRST interview, at least most of the people seemed nice and easy to interview with.  What irritated me was that one of them kept rolling her eyes as though she didn't want to listen to what I was saying, which is annoying, rude, and distracting because even though I wasn't rambling at all, it derailed my confidence in my answer.  Another factor of my irritation was the ABYSMAL salary that was quoted to me: if I accepted the offer, I'd only be paid pebbles for the extensive list duties outlined in the description.  Judging by the other reviews I've seen, receiving a pittance in compensation isn't uncommon.  For a school that makes MILLIONS annually in tuition alone, that doesn't make any sense.", "Interview Questions": "N/A"}], [{"date": "30 Aug 2018", "title": "Senior Marketing Associate / Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Scripps College (Claremont, CA) in Jan 2016", "Interview Descriptions": "Group interview then solo interview. Asked about why you want to be an Admission Ambassador, what your experiences with the college admissions and Scripps are, as well as some hypotheticals .", "Interview Questions": "Why do you want to be an Admission Ambassador?"}, {"date": "31 Dec 2013", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps College", "Interview Descriptions": "I first emailed the application and resume, and then I received an email saying that I qualified for the second round of interviews. We made a couple of email back and forth seeing when would be best to conduct the interview and then had a skype interview and a phone interview.", "Interview Questions": "There was no difficult question. "}, {"date": "12 Nov 2013", "title": "Summer Conference Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Scripps College", "Interview Descriptions": "I applied to be a conference assistant with the public events office and received an email that they wanted me to come in for an interview. The interview was about 20 minutes with many hypothetical questions.", "Interview Questions": "How do you think you would react in a situation where an emergency arises? "}, {"date": "2 Jun 2017", "title": "Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps College (Claremont, CA) in Sept 2013", "Interview Descriptions": "I saw flyers and Facebook posts about Advocates, submitted an application, then received an email asking for an interview, went through the interview process, and then finally received confirmation email", "Interview Questions": "Why would you be a good advocate?"}]]