[[{"date": "8 Feb 2023", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Alzheimer's Research UK in Dec 2022", "Interview Descriptions": "An hour and a half of standard but quite repetitive competency-based questions (e.g. give an example of when you solved a problem, give an example of when you made something better, give an example of when you improved something). Also a short prioritisation task (written) that could have been sent ahead or done separately but was instead done mid-interview (we all just turned off our cameras). This was quite an awkward and clunky way to do it. After nearly three weeks I hadn’t heard anything so I emailed the person who organised the interview to chase. She didn’t reply but two days later I got a short, automated rejection email, to which I could not reply and which did not give any feedback. This seems a little cowardly and unprofessional from a company that prides itself on being a good employer and valuing people.", "Interview Questions": "Tell us about yourself What do you know about ARUK"}, {"date": "11 Oct 2021", "title": "Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Research UK", "Interview Descriptions": "Two weeks notice to prepare a 5 minute presentation, then further questions on how skillset/experience match role and what ideas I'd have for further projects if I got the job", "Interview Questions": "How does your skillset/experience match the role"}, {"date": "20 Nov 2019", "title": "Information Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Alzheimer's Research UK (Cambridge, England) in Oct 2019", "Interview Descriptions": "A 1 hour written task involving answering email enquires followed by a 1 hour panel interview. Interviewers were friendly and although panel questions were sometimes difficult, interviewers did there best to relax the situation and even guide you if the question was confusing.  Interested in your demeanor and personality as a very upbeat and optimistic company.", "Interview Questions": "What do you know about Alzheimer's Research UK as a charity?"}, {"date": "1 Nov 2019", "title": "Prospect Research Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alzheimer's Research UK (Cambridge, England) in Sept 2019", "Interview Descriptions": "An hour interview with two people which involved general questions and competency-based questions. There was then short test/piece of written work, which was related to the job I would be doing when I started.", "Interview Questions": "Can you explain at time where you have been proactive, in a job or in your life? "}, {"date": "10 Jul 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Alzheimer's Research UK in Apr 2019", "Interview Descriptions": "Applied via an agency.  Face-face interview with Manager & Recruitment Coordinator and second interview with Director.  All put me at ease, even had a few laughs.  Lots and lots of questions, but easy to answer and combine i.e. answer 2-3 in one response.", "Interview Questions": "Asked for numerous examples of how I would deal with different situations."}, {"date": "17 Jul 2019", "title": "Community & Events Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alzheimer's Research UK (Cambridge, England) in Aug 2015", "Interview Descriptions": "Questions followed by a short task. I was made to feel very welcome and the questions were delivered well. \r\n\r\nI have interviewed by 3 people and they all started by introducing themselves which made me feel comfortable.", "Interview Questions": "About the charity,  my experience "}], [{"date": "20 Feb 2015", "title": "Information Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Research UK in Jan 2015", "Interview Descriptions": "I sent CV and cover letter and got asked for an interview. First I had one hour task to complete on the computer. Time went very fast as you were required to answer questions by looking into scientific artciles on internet. \r\nLater I had an interview with the relevant potential manager. I got to talk about my experience and cv, and asked to connect it with the job requirements. Not particularly difficult. They would assign a mark to every question on the spot on paper, they had a very structured interview, which did not feel very natural and was a bit cold. Afterwards I could talk with someone on the same role, which was very nice.", "Interview Questions": "nothing in particular."}]]