[[{"date": "2 Jul 2023", "title": "Medical Coding Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marshfield Clinic", "Interview Descriptions": "Received an email for an interview. The first interview is with a recruiter and then with the manager. I was very disappointed because I was mislead with the position I applied for. The manager began to tell me that this was an edits position and not a basic coding Specialist position. I have no interest in edits and that is not what I applied for. They should have created a job description for that position. They didn't ask me any questions because they rely on references which I think is ridiculous. You are hiring me, not my references. On top of that they needed my previous supervisor as a reference which I was not comfortable with.", "Interview Questions": "No questions were asked during the interview"}, {"date": "7 Apr 2023", "title": "Billing Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marshfield Clinic (Holmen, WI)", "Interview Descriptions": "It was a pretty standard interview process. Got a call from HR assistant then got scheduled with a HR rep and then the lead and manager. However, during my talk with the HR rep I got told that in order to reach the top of the range of pay which was $20.54 requires a 25yr work history and the position is entry level. They need to review their compensation policy because 25yr to get to the top of the pay range for a entry level position is a total red flag to potential employees. To say the least I withdrew my application.", "Interview Questions": "What is your salary range?"}, {"date": "17 May 2022", "title": "Administrative Assistant/Data Entry Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Marshfield Clinic (Marshfield, WI) in May 2022", "Interview Descriptions": "Conducted via the chat function of a video conferencing platform - definitely the weirdest interview experience I've had. Every response from HR was copied and pasted. I was told ahead of time that they were interviewing multiple candidates at once, but they were very clearly bulk interviewing. Very clinical, no human interaction. Long breaks between questions as I'm sure they were going through the other candidates.", "Interview Questions": "Describe yourself in three words."}, {"date": "21 Feb 2022", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marshfield Clinic", "Interview Descriptions": "Standard Questions about coworker interactions and hypotheticals about daily interactions and issues.  I underwent two phone interviews in the course of a week and half with a fairly prompt response to application and call backs.", "Interview Questions": "Describe how you would approach a scenario with an unhappy coworker."}, {"date": "16 Mar 2022", "title": "Cerner Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Marshfield Clinic (Milwaukee, WI) in Jan 2022", "Interview Descriptions": "The interview was fairly straight forward. It was one phone interview. I was asked about my level of expertise with Cerner. \r\nI was also asked several EMR module related questions to confirm my knowledge.  She asked several questions about my background and why I wanted the position. \r\n\r\nWhole thing lasted 8 Minutes.", "Interview Questions": "What Cerner module are you familiar with and most experienced with using?"}, {"date": "3 Feb 2022", "title": "Health Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marshfield Clinic in Jan 2022", "Interview Descriptions": "First interview with HR representative about background, salary and work expectations.  Can ask questions.\r\n\r\n2nd interview with managers.  Questions focused on the three parts of the job and experience with these area.", "Interview Questions": "How handle difficult customer?\r\nWhat annoys you the most?\r\nExperience with Motivational interviewing?\r\nHow you go above and beyond with customer service? \r\nOn a scale of 1-10 how interested are you in this position?"}, {"date": "29 Aug 2021", "title": "Information Technology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marshfield Clinic (Stevens Point, WI)", "Interview Descriptions": "I applied through their website career page, got interviewed by their internal recruiter then the hiring manager. From my perspective both interviews went well but, not getting any updates after sending a thank you or an updates , nada ‘ghosted’ is very unprofessional.  It has been over 3 months and no rejection letter whatsoever.  Respect is very important for me and I am glad that I am not an employee of this organization because I got another offer which was better and couldn’t be happier.  So job seeker, beware and be ready being ‘ghosted’.", "Interview Questions": "Typical behavioral and technical questions."}, {"date": "8 Jul 2021", "title": "Customer Support Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marshfield Clinic", "Interview Descriptions": "It was pretty mundane.  The director was more of a bystander to the interview rather than driving it.   I would recommend a more conversational tone rather than rushing through.  Ask for examples and past experiences rather than creating an atmosphere of exasperation.", "Interview Questions": "When will you be available to work?"}, {"date": "3 Aug 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Marshfield Clinic (Marshfield, WI) in Jul 2021", "Interview Descriptions": "Received a call from HR to set up an interview after I applied on their website. We scheduled an interview via zoom. There were 5 team members present, some video called and the manager just phone called.", "Interview Questions": "Could you tell me about yourself"}, {"date": "2 Nov 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Marshfield Clinic (Eau Claire, WI) in Feb 2021", "Interview Descriptions": "There was the basic tell me about yourself followed by lots of behavioral or situation-based questions. You will draw on clinical experience or work experience a lot to answer. Overall not bad", "Interview Questions": "Tell me about a time you worked on a team and how you managed it"}], [{"date": "26 Jan 2022", "title": "Ophthalmic Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marshfield Clinic (Marshfield, WI) in Oct 2020", "Interview Descriptions": "Submitted a resume and received a preliminary call back from a screener. I was then scheduled for a more in-depth phone interview (no in-person interviews due to COVID) with the department manager, who was personable and did ask good questions. He then promised to follow up, and did in a timely manner.", "Interview Questions": "What relevant experience I could bring to the position and one time that I went above and beyond in service of a patient in my previous positions. "}, {"date": "18 Sept 2019", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Marshfield Clinic in Aug 2019", "Interview Descriptions": "Simple application and quick interview.  Very personable recruiting department. Quick face to face interview after phone interview. Easy to find facility with ample parking available.  Prompt greeting and interview on time.  Length of face to face interview 1 hour.", "Interview Questions": "What made you go into Nursing?"}, {"date": "28 May 2019", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Marshfield Clinic (Ladysmith, WI)", "Interview Descriptions": "I was referred by another employee.  I met in person with hiring personnel.  We discussed my previous experience.  We discussed the process  and references available for taking a transcription test which I then performed on-site.", "Interview Questions": "If I had previous experience."}, {"date": "25 Jan 2019", "title": "Staff Attorney Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Marshfield Clinic (Marshfield, WI)", "Interview Descriptions": "Seemed they were mostly looking for personality fit once satisfied with core competencies. Informal (not formulaic) interview with all other in-house attorneys (who were very intelligent, nice, genuine, hard-working people) each having a chance to ask their own unique questions. Phone screen with HR  2 months after applying online. Then group phone call with all other attorneys. Then they ask you to come in or fly you in for in-person interview.", "Interview Questions": "What is your work style ? Are you willing to handle all the tasks and responsibilities that come along with the job ? Where do you see yourself in 5 years ?"}, {"date": "8 Nov 2018", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Marshfield Clinic (Marshfield, WI) in Aug 2018", "Interview Descriptions": "Really great, provided description and tour, let me talk with current employees. Explained challenges and opportunities. Personable. I think I’d like to work there but they chose another candidate and I’d like to work there some day.", "Interview Questions": "Why are you here? Why us?"}, {"date": "4 Oct 2017", "title": "Optician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marshfield Clinic", "Interview Descriptions": "Was called within a week of applying. Interview was quick and painless. Department manager and team leader preformed the interview. Team lead gave tour of department after short 15-20 minute interview. Was called to move forward with hiring process within 2-3 days", "Interview Questions": "How would you handle a difficult situation with a patient?"}, {"date": "5 Jun 2018", "title": "Bioinformatics Scientist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marshfield Clinic (Marshfield, WI) in Jul 2017", "Interview Descriptions": "Marshfield Clinic had a process that included two interviews and then a review. After a panel review, they make a decision on the applicant. I was informed over the phone that I had been offered the position.", "Interview Questions": "Can you manipulate bclfastq files?"}, {"date": "31 May 2021", "title": "Food and Nutrition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marshfield Clinic in Jun 2017", "Interview Descriptions": "Asked questions about my past jobs , experience I had for the job I applied, explained what I would be doing , talked about the hours available, including that it would include weekends", "Interview Questions": "If I could work weekends "}, {"date": "10 Mar 2017", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Marshfield Clinic", "Interview Descriptions": "No difficult questions. Some English and math questions by HR. After talking to HR, three more panel interviews. Mostly behavior questions. I presented my main project and they asked several questions about that.", "Interview Questions": "English questions. I didn't expect that."}, {"date": "4 Dec 2016", "title": "Business Intelligence Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Marshfield Clinic (Marshfield, WI)", "Interview Descriptions": "First they take a telephonic interview and then if they like they call you for onsite interview. They are good at hospitality. However a little more planning could have been nicer. Interview was planned for an hour, but it didn't start on time and so they actually rushed through! By the end of the interview you would feel like you got the job and but they never get back to you!", "Interview Questions": "How would you define your personality?"}], [{"date": "11 Nov 2017", "title": "Systems Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Marshfield Clinic in Nov 2016", "Interview Descriptions": "Phone interview with Medical Director and Administrator telling me what was in place, come to find out , very little of it was true. Medical Director very honest and truthful what the priorities should be.  Admin   played up the position like it was a perfect place. It was very relaxed, easy questions.", "Interview Questions": "What will it take for you to accept the position?"}, {"date": "19 Feb 2017", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Marshfield Clinic (Marshfield, WI) in Jan 2016", "Interview Descriptions": "Face to face interview with a panel of five staff members asking various questions. The overall process took approximately two hours. I was shown around the clinic and introduced to various team members.", "Interview Questions": "Do I get emotionally attached to my patients?"}, {"date": "15 May 2016", "title": "Appointment Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marshfield Clinic (Eau Claire, WI) in Dec 2015", "Interview Descriptions": "First apply online. If they are interested they will give you a call to set up a phone interview. After the phone interview they will ask you to come in for a group interview. There was 4 people who interviewed me. They said they would let me know within 4 days their decision, it took them almost 3 weeks to let me know their answer.", "Interview Questions": "Why should they hire me?"}, {"date": "28 Sept 2015", "title": "Dentist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Marshfield Clinic (Marshfield, WI)", "Interview Descriptions": "One phone interview and another on-site interview. Initially there was a phone screen. The phone screen is just for gathering basic information like degrees, date of graduation etc. The onsite interview lasted about a day.", "Interview Questions": "Nothing technical. Asked questions about my background and why I preferred Marshfield as a work location. The interview team is nice. They have clinics in and around Marshfield but I preferred Marshfield. What appealed to me the most is the work-life balance and small town feel. It's definitely a great place to work for"}, {"date": "15 Nov 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marshfield Clinic in Jan 2015", "Interview Descriptions": "It takes a long time to get through the interview process here.  I actually had accepted another position outside of Marshfield Clinic and told them I was set to start that role Monday at 8 am.  They called me to offer a position the Friday before at 4 pm .  Did not allow much time for decision making.", "Interview Questions": "I was asked about my previous skills as an MA."}, {"date": "29 Jul 2014", "title": "Information Systems Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marshfield Clinic", "Interview Descriptions": "I had one interview and was offered the postion within a few days of the interview.  Interviewed with 4 people but 2 of them asked most of the questions.  There were lots of situational questions, \"Tell us about a time when...\"  They described the IT organization at a high level.  The description indicated that the IT department was in a state of re-org, which proved to be accurate when I started working there.   Be prepared to ask questions about the type of work you will be doing and which projects you will be assigned.  They have two groups of PMs.  One group works on clincial projects.  The other works on building projects and IT projects with networks and servers.", "Interview Questions": "What would we be missing if we did not hire you?  What would we have to put up with if we did hire you?  They did ask PM process questions so be prepared to talk about the triple constraint and critical path.  "}, {"date": "19 Nov 2013", "title": "Programmer/Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Marshfield Clinic", "Interview Descriptions": "I got in contact with them through my college, University of Wisconsin Eau Claire, and interviewed them on-site. The process was pretty quick,  within a month I had an offer, and I knew in November I would be working there In May.", "Interview Questions": "None. They stuck to the basic questions about group work, and what you are most proud of, stuff like that."}, {"date": "2 Dec 2011", "title": "Statistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Marshfield Clinic (Marshfield, WI) in Nov 2011", "Interview Descriptions": "Basically no questions on the skills and behaviors. Just talk to tons of people. I did 7 sessions with more than 15 people. You can eat lunch alone by yourself and take some rest. Since the place is kinda in the middle of nowhere, they seem to care a lot if u really want to be there.", "Interview Questions": "What is the difference between survival analysis and other statistical analysis."}, {"date": "26 Jan 2013", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Marshfield Clinic (Marshfield, WI) in Nov 2011", "Interview Descriptions": "Residency Interviews by panel of 3 people", "Interview Questions": "Why Marshfield?"}, {"date": "17 May 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Marshfield Clinic (Marshfield, WI) in Jun 2011", "Interview Descriptions": "Long interview process which took over 3 months. 3 separate interviews plus a phone interview.  No one seemed in a great hurry to hire for the position. Very difficult to stay interested in the job when the interview process took so long", "Interview Questions": "N/A"}], [{"date": "26 Jan 2015", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Marshfield Clinic in Jan 2011", "Interview Descriptions": "I had one interview and was hired for the position. The coordination process was easy flowing. Frequent communication was beneficial to know my wear about and who i was meeting with. They accommodated to my schedule for setting up the interview as well. I felt the question for the application is intense and time consuming.", "Interview Questions": "Question were very focused to my job I was interviewing for."}, {"date": "8 May 2011", "title": "Non-physician/Medical Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Marshfield Clinic (Marshfield, WI) in Dec 2010", "Interview Descriptions": "Interview process followed a fairly common methodology - phone screen with HR recruiter, then on-site interview with recruiter, hiring manager, and group of peers that work for hiring manager.\r\n\r\nVery upfront about compensation package. \r\n\r\nDisappointing was the way they handled post-interview phase. Told me a decision would be made by a certain date, and if I didn't hear from them by that time, to contact them. Did so and was told the decision had been delayed. Waited another 2 weeks (my mistake), and when I called them again, was told the position had been filled. Had I not contacted them twice, would I have ever had another conversation with them?\r\n\r\nI know someone else who had exactly the same experience. Seems like this is a game they play with candidates and I think it reflects very poorly on Marshfield Clinic. It seems unprofessional to leave candidates hanging even as they wait patiently for a promised phone call that never comes.", "Interview Questions": "Describe how you handle a situation where a team co-worker is being difficult."}, {"date": "22 Jun 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Marshfield Clinic (Marshfield, WI) in Oct 2010", "Interview Descriptions": "Long wait from submission of application to offer.  I have transferred within the organization before and it seems HR is slow to move on things.  Managers wait and wait for them to offer the position and inform the other candidates that they did not receive the job.", "Interview Questions": "N/A"}, {"date": "5 May 2010", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Marshfield Clinic (Marshfield, WI) in Jul 2008", "Interview Descriptions": "Intereviewed with HR - gave company background, benefits, job info, etc.  Met with 1:1 with dept manager. Met with group of potential co-workers.  Smooth flowing interview process.", "Interview Questions": "Three words that describe your character"}]]