[[{"date": "7 Jul 2022", "title": "Assistant Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ozarks Technical Community College", "Interview Descriptions": "One panel interview, panel members took turns asking standard behavioral type interview questions. Very quick and easy. Everyone was laid back and welcoming and open to sharing their own experience.", "Interview Questions": "How would you deliver bad news?"}, {"date": "30 Jun 2022", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ozarks Technical Community College (Springfield, MO) in Aug 2020", "Interview Descriptions": "Surprise panel interview, but they are all super awesome and sweet. Wonderful office to work in and easy, but monotonous work. You basically get to choose your own hours and they work really well around school schedules.", "Interview Questions": "What would you bring if we had pot luck "}, {"date": "7 Aug 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Ozarks Technical Community College (Nixa, MO) in May 2018", "Interview Descriptions": "Was very casual and made me feel super comfortable.  I was able to talk about why I wanted this job and what schedule worked best with my classes and they wanted to try and accommodate.", "Interview Questions": "What type of prior office experience did I have? "}, {"date": "2 Jun 2017", "title": "Promoted From Within Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Ozarks Technical Community College (Springfield, MO)", "Interview Descriptions": "Interview with a panel of peers from other departments.  Provided a 10 minute presentation over a topic I would normally teach in the classroom. Allowed questions by the interviewee at end.", "Interview Questions": "How would you increase enrollment? How would you deal with disgruntled staff and students? What is your short term and long term plans for the program? "}, {"date": "24 Nov 2013", "title": "Accounting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Ozarks Technical Community College", "Interview Descriptions": "The admin asst to the dept. called to schedule the interview and was not very friendly. I interviewed with 5-6 people who asked questions about what I knew about the college, my experience, what I wanted in a job, what I do for fun, how I contribute to a team--the usual interview questions.  Interviewers were cold and I received the classic cold fish handshakes.", "Interview Questions": "Describe a time on the job when I had to switch priorities."}, {"date": "8 Jul 2016", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ozarks Technical Community College (Springfield, MO) in Oct 2013", "Interview Descriptions": "Ozark Technical Community College's procedure is to have a panel of 3 men and 3 women. They have a list of questions from which to choose, each of the 6 choose which questions they want to ask, they narrow it down to a handful for each person and they each read the question round robin. There is an opportunity at the end to add anything you want, but it is not an interview that flows naturally, and I believe that is because it's a committee.", "Interview Questions": "I can't recall. They were the usual, as best I can recall."}, {"date": "27 Aug 2014", "title": "Secretary for OTC Online Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Ozarks Technical Community College in Sept 2013", "Interview Descriptions": "This was a panel review. They ask standard questions and its your job as the interviewee to give creative answers that fit those questions. Google questions for an interview and they will ask the standard ones.", "Interview Questions": "What makes you Mad?"}, {"date": "12 Jul 2016", "title": "Shipping & Receiving Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ozarks Technical Community College (Springfield, MO) in Jun 2012", "Interview Descriptions": "The is a panel interview.  You will interview with six people at once. Each person typically has a couple questions each.  Dress was business casual.  They will then deliberate, and if you are the successful candidate check your references and perform a background check.  The process is lengthy.", "Interview Questions": "What are your strengths?  What are your weaknesses?"}, {"date": "14 Jun 2013", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Ozarks Technical Community College (Springfield, MO) in Jan 2012", "Interview Descriptions": "Basically department chair had conversation with me in his office.  He asked some questions to verify basic knowledge of subject.  We talked about how teaching was there, what approaches fit students there", "Interview Questions": "explain what a molecular orbital is"}, {"date": "21 Apr 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ozarks Technical Community College (Springfield, MO) in Jun 2011", "Interview Descriptions": "Hiring process is slow. Interview by committee. Applications are submitted, reviewed by committee to determine who to interview. Interviews are scheduled, committee votes, and then additional documentation submitted to support hiring applicant. A lengthy process that can take up to 2 or 3 months, in which time many people have lost interest.", "Interview Questions": "What I liked least about my last job."}]]