[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent College with a Unique Mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "26 Jun 2021", "job_title": "Professor in", "duration": "N/A", "pros": "Beacon College serves students who learn differently. I have been teaching at Beacon for over 12 years and I really enjoy my job and all my colleagues. My supervisor is very supportive and knowledgeable. The students are great and the campus has a small community feeling. Teachers are really encouraged to be creative in the classroom. The benefits are good. Excellent holiday and vacation schedule for faculty. Highly recommend!", "cons": "Beacon is always striving to improve, so being able to adapt to change is important."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Spare yourself the heartache", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jun 2023", "job_title": "Faculty in", "duration": "N/A", "pros": "The relationships that you can cultivate with students, faculty, and those on campus can be rewarding. Many lovely people work there; even more have left. Many areas of the campus are being built up and are scenic. Health benefits are good; however, you have to stay at least 3 years to benefit from 401k contributions, and you won't want to.", "cons": "Everything previously mentioned in the other negative reviews remain true and aren't at all embellished. I wish I had read them prior to working here. 1) A bill of goods is sold that isn't true. Their mission, \"the life abundant,\" sounds like an amazing thing to be involved in and will suck in those who are compassionate, however senior staff is turning over and are checked out. They want to avoid lawsuits and will scapegoat their faculty and staff to do so. 2) It is 100% true that students who don't fulfill curricular requirements are passed through...OFTEN. Faculty is highly pressured to do so. If they uphold the standards asked of them, they need to be prepared to be thrown under the bus and sanctimoniously overruled/undermined. Anyone with ethics won't be able to abide this for long. Other students see this and feel their efforts are cheapened (because they are). 3) Highly toxic work environment where - and I cannot stress this enough - your needs don't matter. There is no work/life balance. You don't have to consent to extra, unpaid work in order for it to be expected and demanded of you. It will be expected that you get involved with multiple clubs, after-school responsibilities, weekend student trips, etc. on top of needing to grade the extra classes you didn't consent to take. It's also not time and a half...you just get adjunct pay...so half. 4)Favoritism is obvious. As long as you don't \"challenge\" (ask reasonable questions, advocate for yourself) those in the highest positions, you'll be fine. The majority of staff is too afraid to say anything about anything listed here - they care about the students and need to keep their jobs to live. 5) Pay is LOWBALLED - offers are far below the national average but they will ask you to go above and beyond at all times, outside of your paygrade, to a point that is literally dangerous to you and the students. Cash is king - admin won't miss paychecks, but you will. 6) Same note: contracts are made and reneged on to a degree that is criminal. If you follow up, do not expect HR to help you. You'll have to spend the money you were promised on a lawyer if you want to try to get it. Void of ethics so far (Hint: consult SACSOC and review how institutions are expected to work. They accredit Beacon and should investigate them. Admin will use SACSOC as a fallback and quote policies from them that don't exist). 7) Staff is subjected to regular abuse and harassment by students. There are no resources allotted to help you with this stress. Students use burner email addresses and phone numbers to do this, as well as act out in person and use the internet to slander and complain. Staff must witness criminal (stalking, sexual assault, battery, et al) behavior among students. College does nothing. This might be the worst aspect - it's haunting. Don't cause yourself the heartache. 8) You will not be trained, unless it is by your already overloaded direct superior. The college does not take time to go over relevant policies. If you ask where they are or to see them, consider yourself targeted and your time limited. 9) I'm sure there's more, but just run. Please. I've been involved with multiple academic institutions of higher learning and have never experienced anything so morally destitute."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "More concerned with tuition than students", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Apr 2023", "job_title": "Instructor in", "duration": "N/A", "pros": "Small college, no pressure to publish", "cons": "There is pressure to 'pass' students and inflate grades to get students to graduation. This is unethical and the reason many instructors leave."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Start", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Feb 2023", "job_title": "Instructor in", "duration": "N/A", "pros": "Beacon allows creativity in course creation.", "cons": "Low pay at the doctoral level."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It's all about the mission!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "7 Jul 2021", "job_title": "Director of Development in", "duration": "N/A", "pros": "Helping fulfill the educational goals of students with learning differences makes it easy to come to work everyday.", "cons": "Limited staff can be overwhelming at times."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great students, toxic work culture", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Nov 2020", "job_title": "Resident Director in", "duration": "N/A", "pros": "The students are great, they are always eager to see you and you can really see the impact you are having on them, and the difference you can make and they make sure to let you know how much you are appreciated.", "cons": "Low pay, toxic work environment, the higher ups often expect you to do more than your job description for no additional pay, high turnover, out of the 8 people that worked in my department when I started here, only 2 remain in the department"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Beacon College Review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 May 2021", "job_title": "Administrative Assistant in", "duration": "N/A", "pros": "Benefits, paid time off, and holidays", "cons": "Treatment of employees by the Directors."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Apr 2021", "job_title": "Teaching Assistant in", "duration": "N/A", "pros": "You are allowed to do homework while you work", "cons": "They do not care about you or what you do for them"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Zero Job Security", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Nov 2020", "job_title": "Administrator in", "duration": "N/A", "pros": "The students are high need, but, working with them can be rewarding.", "cons": "There is zero job security and zero loyalty here. Staff are let go at a whim for no reason. It makes no sense as to who stays and who goes. Don't put yourself through this."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Faculty", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Apr 2017", "job_title": "Faculty in", "duration": "N/A", "pros": "Students, mission. Many students are grateful and interesting. Some talented, creative and dedicated staff. Working with students wirh learning differences can personally  rewarding. Time off.", "cons": "Favoritism, toxic work environment, lack of diversity, political, nepotism, mismanaged growth, lack of respect or appreciation for some dedicated employees, opportunities for lateral moves or promotions limited and political. Run like a for-profit. Students with money can get away with doing nothing or threatening/disrupting others and have exceptions made for them if families with money make donations and complain. Culture of CYA,blame. Staff survives by  working  hard and keeping quiet.  High turnover and people are fired often and played off to stay quiet. Big focus on outer image, appearances and PR. It's a shame that it's  a carefully crafted illusion."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Oct 2020", "job_title": "Counselor in Leesburg, FL", "duration": "N/A", "pros": "Supervisor very knowledgeable and supportive. Definitely cares about the students and it shows.", "cons": "High need population makes it a very stressful job"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Disappointing and some positives.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "11 Feb 2015", "job_title": "Learning Specialist in Leesburg, FL", "duration": "N/A", "pros": "38 hours work week, a lot of time off for, good benefits, discounted lunch, learn a lot from working with this population.", "cons": "Silos, unclear leadership vision, challenging student population, leadership disconnected from employees and students, management required us to treat college students like elementary age kids and wake them up in their apartments if they didn't show up for class or appointments."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Interesting", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Feb 2013", "job_title": " in Leesburg, FL", "duration": "N/A", "pros": "Time off, interaction with people. Trying to get students to stay in the school.", "cons": "Elitist dictatorship that favored their own friends and family. \r\nDidn't care enough about the type of students coming in.\r\nStudents who had been there since before they were accredited still there to bring down students who come in and those who can succeed.\r\nNot enough for students to do while on downtime. \r\nReviews are a joke since the president did not even witness the work being done."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Friendly Advice", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Jun 2016", "job_title": "Faculty in Leesburg, FL", "duration": "N/A", "pros": "On a positive note, the students are the driving force behind every employee's motivation to go to work each day at this institution. They are beautiful young men and women ready to make a difference in the world. They will win your heart to a point where you will tolerate things you never thought you could just to have the privilege of being able to continue serving them.", "cons": "Complete incompetence of the administration. Those who are not incompetent are strictly out for themselves at the expense of anyone who gets in their way. Some are easy to spot.   Others are so incredibly good at it, they will leave you spellbound. But, if you eat at their lunch table, you're golden. (This is not a metaphor. It really is just like high school). It is ALL about political alignment. Please do not apply if you would like to enjoy the benefits of job security. I watch competent, caring, honest faculty and staff members come and go on a regular basis. I'm not speaking of people who do anything wrong. I'm speaking of individuals who lose their jobs without warning, rhyme or reason--some who have been there many years. So, if you do choose to work here, please keep this in mind.  Keep your head down, eyes & mouth closed and mind your business--no matter what you witness. There are very few you can trust--none of which are administrators."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Small town college", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Mar 2014", "job_title": "Anonymous Employee in Leesburg, FL", "duration": "N/A", "pros": "Small college. Many employees deeply care about the college mission.  Many students make great gains in their self-esteem and academic progress.", "cons": "Many secret alliances and deals going on behind closed doors.  Women are typically paid an average of $5k less per year for equal positions.  Hiring and firing practices are typically very unregulated."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Great working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Apr 2019", "job_title": "Office Assistant/Student Worker in Leesburg, FL", "duration": "N/A", "pros": "You can joke around with the boss and coworkers. Always interacting with the students and making a positive impact.", "cons": "At the most ten hours per week."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "It was good", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Jan 2020", "job_title": "Anonymous Employee in Leesburg, FL", "duration": "N/A", "pros": "It was good environment", "cons": "None really just overwork you sometime"}]]