[[{"date": "28 Apr 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Average, they asked about research experience, asked me to elaborate on resume experience, asked if I had any questions. Why do I want to work at Brookings, also asked about future plans", "Interview Questions": "How Brookings fits into future plans"}, {"date": "2 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Was invited to an online two-to-one interview a few months after submitting my resume. It lasted a bit more than 30 minutes. The interviewers were very friendly and the process was very straightforward.", "Interview Questions": "Tell me about ur past project(s)"}, {"date": "6 May 2023", "title": "Summer Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Brookings Institution in Apr 2023", "Interview Descriptions": "Received a notice for an interview roughly one week after submitting my application. The interviewer said they will notify me at the end of the week but I received no call back since; my follow-up emails received no response either.", "Interview Questions": "Fairly general questions regarding one's relevant experience; a project that one was most proud of; one's strengths and weaknesses"}, {"date": "23 Mar 2023", "title": "Community Engagement Internship  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution in Mar 2023", "Interview Descriptions": "Interviewed about a week or two after submitting my application. Questions were geared towards past experience and plenty of work examples. Asked why the department interested you and what you hope to gain from the internship.", "Interview Questions": "Why does the department interest you?"}, {"date": "11 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Typical interview process but they want highly specialized candidates despite folks only being at college level. This makes it difficult for students to align with their research areas with enough specificity.", "Interview Questions": "Q: Tell me about your work directly in relation to public transit infastructure"}, {"date": "28 Mar 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (Washington, DC) in Feb 2023", "Interview Descriptions": "There were 3 people in the team interviewing me. They asked several questions about my experience regarding research and project coordination, and let me ask them about the organization. There is no prompt questions. Every question was expected. Overall, not difficult.", "Interview Questions": "Rate 1-10 how much do you know SDGs. What do you think is the most challenging thing to complete this internship?"}, {"date": "24 Jan 2023", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Everyone was incredibly friendly and warm. It was held over zoom and you can tell they really care about their fellows. There is an extensive interview process which can feel tiring but you can also tell they they’re being thorough.", "Interview Questions": "Why did you apply for this position?"}, {"date": "7 Dec 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Interview process was very quick. Went through a 1-2 screening phone interviews that did not last long and was able to interview virtually with the Director of the program for about an hour. They are fairly responsive in returning and checking back with the candidate.", "Interview Questions": "What type of administrative and executive experience do you have?"}, {"date": "19 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution (Washington, DC) in Dec 2022", "Interview Descriptions": "The interview process was straightforward; there was a screening followed by an interview with a project manager and senior fellow. Afterwards, there is a skills test to identify your comfortability and proficiency with statistical software.", "Interview Questions": "Both the screening and interview had typical questions: why do you want to work here; where do you get your news; tell me about your background in research; what data tools have you used; what qualities would you use to describe yourself?"}, {"date": "8 Sept 2022", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "It was a friendly, and overall great interview experience. However, the “entry level” position I applied for was given preference to those with more experience. They offered very helpful advice after interview process was over.", "Interview Questions": "Why do you want to work for Brookings?"}], [{"date": "9 Mar 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution in Jul 2022", "Interview Descriptions": "Participated in a phone screening, writing assessment, and two interviews and was then never contacted. All of my follow-up calls and emails were completely ignored. I felt very disrespected and it has tainted my opinion of a company I once highly regarded.", "Interview Questions": "What is your experience with transatlantic relations?"}, {"date": "19 Dec 2022", "title": "Research Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution (Remote) in Jul 2022", "Interview Descriptions": "Quick zoom call, did not think the questions were overly complicated but did not give a good insight into what was expected of the role. Rather, the questions were very broad and it was hard to gauge how to answer them in the context of what they were looking for - research itself if broad, but the position would not have been.", "Interview Questions": "What research experience do you have?"}, {"date": "20 May 2022", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "About three panel interviews were conducted. Standard questions and nothing out of the ordinary.  One technical question to assess skills. Would have been better if recruiter actually followed up after lengthy interview process to give status on candidacy.", "Interview Questions": "Questions surrounding managing up, behavioral questions, etc."}, {"date": "9 May 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Quick, but you have to know exactly why you want the job and you need to be ready to convey that in your answer. None of the questions were too intense, I think they are just looking for someone passionate to have such an opportunity.", "Interview Questions": "Why do you want to work at Brookings? "}, {"date": "5 Apr 2022", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Typical interview process with a CPS data task. 1 phone interview with RAs, 1 interview with a fellow, final interview with full staff and director. CPS exercise could be done in a software of my choosing.", "Interview Questions": "Talk about an example of a data exercise you completed\r\n"}, {"date": "31 Mar 2022", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution in Mar 2022", "Interview Descriptions": "Submitted application in mid-Feb, received interview invitation a month later. The interview was pretty straightforward. Mostly common questions, not much technical questions were asked. Got an email immediately after the interview on next steps.", "Interview Questions": "Why Brookings? Weakness? Previous internship experience at think tanks"}, {"date": "15 Jan 2022", "title": "Research Assistant and Project Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "4 step process: 30 initial phone screening with HR, 30 min interview with supervisor, 3 hr take-home assignment, 1 hr interview with an additional supervisor. Take-home assignment involved making a short PowerPoint about an assigned subject. Materials were provided.", "Interview Questions": "Describe relevant qualitative research experience"}, {"date": "15 Jan 2022", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "I got an email around friday saying they would like to interview me for the internship, and a phone interview was scheduled for a couple of days after on the following Monday. Then, after the interview I was asked to provide one letter of recommendation  and two references. Once the interviewer had received it, I got an email by the end of the week (Friday) that I got the internship.", "Interview Questions": "The questions were pretty straightforward like \"tell me about yourself\", \"why do you think you would be a good fit at Brookings\", etc. "}, {"date": "3 Jan 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "I conducted a virtual interview and an online screening process that assessed my skill level. The virtual interview was around 30 minutes long and the skills test was around 2 hours long.", "Interview Questions": "They were interested in how my past experiences, both academic and professional, would assist me with the tasks of the internship."}, {"date": "25 Dec 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "The interviewer was kind, and the questions were straightforward. A lot were related to previous experiences and how I handled difficult situations with other team members. None were academic questions related to politics. I just had to elaborate on my leadership approach, communications skills, and what I would do in hypothetical work scenarios.", "Interview Questions": "What did you do when your team disagreed with each other?"}], [{"date": "30 Jan 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution in Dec 2021", "Interview Descriptions": "Two rounds of interviews and a one hour writing exercise, as follow:\r\nPhone Interview: HR interview\r\nPanel Interview: One analyst, the director of the unit, and a fellow researcher.\r\nAnalytical Writing exercise: Answer three questions about a short paper.", "Interview Questions": "Why do you want to leave your current job?\r\nHow would you prioritize conflicting tasks?"}, {"date": "9 Oct 2021", "title": "Research and Project Coordination Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "Straightforward interview, there were some questions about my past research and project coordination experience as well as my career goals, not too difficult or as many behavioral questions as I thought there would be", "Interview Questions": "Tell me about yourself and why you are a good fit for this internship"}, {"date": "10 Oct 2021", "title": "Policy Analyst Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "All about research and experience and the reason for choosing a major: asked questions relating to career goals and where do you see yourself in the future.  Overall pretty straightforward.", "Interview Questions": "Tell me about your experience working as a policy analyst"}, {"date": "17 Sept 2021", "title": "Research Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "The interview was very formal, with the questions from a predetermined list. Most questions were to be expected from a traditional interview. They definitely wanted to know whether you were engaged in the research for the program you were interviewing for.", "Interview Questions": "What papers or blog posts were especially interesting from the project?"}, {"date": "15 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "very easy, one round via phone call, 30 mins. there was not much notice for the interview though (24hr). All behavioral and fair questions. was a good experience. I had a response within 24 hours", "Interview Questions": "why would you be a good fit"}, {"date": "13 Sept 2021", "title": "Data Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "The interview primarily consisted of the interviewers explaining their responsibilities and the purpose of their roles. They asked about my research experience, interests, and what I know about the Brookings Institution. The interviewers were very kind! Unfortunately, this was in early 2020 and the summer internships were cancelled for that year, so no offers were extended.", "Interview Questions": "Where do you get your news from? "}, {"date": "15 Jul 2021", "title": "Visiting Graduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "There was first approximately a 10 minute phone call with the program manager to cover the basic questions such as why Brookings and background information. The second round was a panel interview with scholars with research-related questions.", "Interview Questions": "What are your career goals after the position?"}, {"date": "15 Jul 2021", "title": "Summer Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (Washington, DC) in Jul 2021", "Interview Descriptions": "Easy questions\nInterview was fairly short, only thirty minutes\nConversational \nEmphasized my research interests and how they align with Brookings' goals\nFamiliarize yourself with Brookings values! They want to know what you can offer Brookings but also what Brookings can offer you", "Interview Questions": "How does your previous work and educational experience align with the position's duties?"}, {"date": "29 Apr 2022", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Jul 2021", "Interview Descriptions": "There were multiple stages to the interview: a screening call, followed by an initial call with the senior administrative team, then a call with the program VP and a call with the communications team. Finally, there was a presentation with questions from the program scholars. Before the offer was made, there was an extensive background check.", "Interview Questions": "How does your previous experience make you a good fit for this role?"}, {"date": "27 Jul 2021", "title": "Project Coordinator and Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution in Jun 2021", "Interview Descriptions": "Had a first round phone screening with HR where I was asked basic employment questions. Second round was with a member of the team and interviewer showed up 20 minutes late to a 30 minute interview and interviewed for 10 minutes for the final round.", "Interview Questions": "Can you describe your research experience "}], [{"date": "19 May 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Very long. I had five interviews in total including the HR phone screen, three with the team I will be working with, and one more with the HR director. They are also spaced out from each other so the whole process took a month.", "Interview Questions": "Can you describe your responsibilities if get this position? "}, {"date": "3 May 2021", "title": "Summer Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "I applied online then received an offer for a phone call interview on a Friday afternoon. The interview went well and the panelists were friendly and seemed interested in me as a candidate. However, couldn't be an intern there because ultimately it was between me (an undergrad) and a Master's student.", "Interview Questions": "Why are you suitable for the job? Governance and Political Science related questions. "}, {"date": "23 Apr 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "It s a good place to work, develop writing skills, and expand my career network. I learned so much from Brookings and truly appreciate opportunities to work with famous scholars.", "Interview Questions": "Why are you interested in this position?"}, {"date": "29 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "I applied online by submitting my resume and cover letter through the portal. The interview process was very straightforward; it was just one phone interview with the division's research analyst.", "Interview Questions": "All behavioral questions based on the experienced on my resume. "}, {"date": "20 Mar 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "The first round was very causal, and was with the whole team of three researchers and two research assistants. There were about 4-6 behavioral questions in this round, and none were technical.", "Interview Questions": "Tell us a little about yourself. "}, {"date": "20 May 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Mar 2021", "Interview Descriptions": "The interview went well, and the interviewer seemed to think my qualifications aligned well. However, after sending a follow up email, the interviewer ghosted me. Really unprofessional and inconsiderate given that they acted open to receiving follow up contact.", "Interview Questions": "What do you know about the organization?\r\nWhy are your qualified? \r\nTell me about yourself, etc. "}, {"date": "7 Jan 2022", "title": "Communications Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (San Francisco, CA) in Mar 2021", "Interview Descriptions": "Very straightforward, two phone calls and received the offer soon after last interview. No Zoom or video calling, was contacted by the person who became my supervisor. I interviewed two years in a row, and the interview process was the same both years (one year pre-pandemic, the other year during the pandemic).", "Interview Questions": "Typical behavioral interview questions. Asked me why I was interested in communications and policy work in general. Had to explain situations in which I felt challenged, situations where I worked in a team, how I like to communicate with supervisors, etc. They asked about what Brookings departments I was interested in. "}, {"date": "28 Feb 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "The interview was straight forward and lasted for about 30 minutes. It was professional and the main questions revolved around prior research projects or experience. There was only one interviewer.", "Interview Questions": "Tell us about your former research experience. "}, {"date": "10 Feb 2021", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "I went in for an interview and it went well. At the second round of interviews, the interviewer sent out an assignment for all applicants, which consisted of reading a over 100 page report, and then creating several pages of content in various forms. The project took a full day and then the interviewer ghosted me. She never even acknowledged receipt of the materials, and never emailed again.", "Interview Questions": "How would you attract an audience to an online event."}, {"date": "17 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "The interview process was smooth. \n\nThere were three stages: \n\n1. an HR round with basic questions on background. \n\n2.  a test containing coding and writing questions\n\n3. a final round interview with a senior person and one more person. The main questions asked were on how I went about the test, asking about my mistakes etc.", "Interview Questions": "Why do you want to work at Brookings? "}], [{"date": "16 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "I applied in October and was contacted weeks later for a 30 min interview.  I was asked to introduce myself, specific questions about my research projects and econ courses I've taken, why I was interested in my research area of interest, etc. Approximately two weeks later, I was contacted to choose a day to complete a data and writing task within a certain time period.", "Interview Questions": "Tell me about your research project?"}, {"date": "28 Dec 2020", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Submit the resume and get the first interview. Visited the office and did the interview. They told me they have the second interview too. Interview time was less than 1 hour.", "Interview Questions": "The research I did at school "}, {"date": "11 Dec 2020", "title": "Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "Why did you choose our company "}, {"date": "11 Dec 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Applied over the online application, they reached out shortly after and scheduled an interview with the manager for the position. Overall a good experience - they had a lot of applicants.", "Interview Questions": "Tell me a bit about yourself?"}, {"date": "9 Jan 2021", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Brookings Institution (Washington, DC) in Dec 2020", "Interview Descriptions": "First there was a data analysis task; I had the option of using stata or R. Next, I did an interview with the research assistants, they asked very typical interview questions. Then there was an interview with the managers who wanted to know more about how I approached roadblocks. Finally, I was interviewed by the entire team including the director who asked broad questions about why I wanted to work there and then some more typical interview questions. I had time to ask questions in the 3rd and final stages.", "Interview Questions": "Give an example of a time you made a mistake, what did you do about it?"}, {"date": "10 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Dec 2020", "Interview Descriptions": "I had a phone screening with three members of the team at Brookings in their education center. The questions were standard and focused on my past research. Interview was conducted by the center, rather than by an HR representative.", "Interview Questions": "Tell me about your past research, and the challenges and opportunities it presented."}, {"date": "7 Mar 2021", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution (Washington, DC) in Dec 2020", "Interview Descriptions": "Zoom interview for 45 min to 1 hour, mostly behavior interview questions, on top of a few academic questions like what projects you complete and walk me through it. It depends on which policy program you are applying for, I interviewed with two policy programs and the questions are slightly different.", "Interview Questions": "A few academic questions like what projects you complete and walk me through it. "}, {"date": "30 Nov 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "I interviewed with the research fellow, then with his current RAs. The entire process was incredibly friendly and informative, I learned a lot about the position. They asked about my qualifications and some of the items on my resume, but the process was more looking at whether we were a good fit for each other.", "Interview Questions": "They asked about one grade on my transcript, and they asked about my priorities with economic policy and how they might match up."}, {"date": "8 Oct 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "I had an initial interview with current/outgoing RAs. Following that, I had an  interview with more senior staff on Skype. Following that, I was then invited to interview in DC. I got notified of my status soon afterwards. Overall a quick process.", "Interview Questions": "What are your specific areas of interest in public policy?"}, {"date": "30 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "I submitted an application to their portal and then received an interview within the week. I had one interview with them and was asked to submit a writing sample afterward. I was then offered an internship position.", "Interview Questions": "Why did you apply to Brookings?"}], [{"date": "24 Aug 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Called in for an in person meeting. Interviewer was a Research Assistant, I was asked about my previous research experience, research interests and quantitative and qualitative skills. I was given the structure of the institution and how interns are placed with fellows.", "Interview Questions": "What are you research interests?"}, {"date": "14 Aug 2020", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "1) HR Interview with behavior questions\n2) Senior Fellow Interview with past research experience and other standard questions like why would you want the position. \n\nThe HR round was conducted over phone and the second round is on site. There's no exam involved.", "Interview Questions": "Tell me about yourself and talk me through your resume.\n"}, {"date": "4 Aug 2021", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (Washington, DC) in Aug 2020", "Interview Descriptions": "Submitted cover letter, resume, and writing samples. Was contacted a week later for an interview. There was only one round of interviews and it was with the person who ended up being my direct supervisor. The call lasted about 45 minutes.", "Interview Questions": "Are you familiar with any Brookings scholars? What do you know about the institution? "}, {"date": "28 Jun 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Brookings Institution in Aug 2020", "Interview Descriptions": "Process took almost 3 months from applying to final interview. Phone screening interview with HR, asked about technical skills and how you’d rate yourself in R, Stata, etc. Then I was given 2 days to complete a test, 2 parts: writing and coding. Writing task is to summarize an econ paper so that the general public can understand. Coding test was pretty much using statistical software to replicate  graphs from given datasets and graphs. Then 2 weeks later; final round with the director and an RA. It was pretty awkward, general questions about previous econ research experience and the test.", "Interview Questions": "Tell me about your economic research experience "}, {"date": "12 Sept 2020", "title": "Research Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution in May 2020", "Interview Descriptions": "I was interviewed for a research role at Brookings. Due to lockdown (COVID-19 pandemic), the interviews were held on zoom  and lasted for about an hour each.  The first interview was with the co-coordinator/development officer and the second one was with a senior fellow.", "Interview Questions": "1) How will your education help you with this job ?"}, {"date": "14 Dec 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in May 2020", "Interview Descriptions": "They contacted me to meet with two young college grads and one more senior employee. They asked me questions about my background and experience. I’d recommend tailoring your answers to the specific fellow’s field of interest.", "Interview Questions": "Can you describe a research project that you carried out from start to finish?"}, {"date": "5 Oct 2020", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Mar 2020", "Interview Descriptions": "Pretty generic questions, relatively brief, and then asking for your questions about the position. Very painless, took all of 20-30 minutes-- be prepared to speak specifically about the program to which you applied.", "Interview Questions": "Tell us about a time you were on a team.\r\nTell us about yourself.\r\nWho's a scholar whose work interests you?\r\nWhy Brookings?"}, {"date": "5 Feb 2021", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution in Mar 2020", "Interview Descriptions": "I had two rounds of interviews. The first round was with RAs and the second round was with PhD level researchers. They asked questions about research experience, lit review experience, and working in a team. The interview was quite laid back - they were friendly and spent quite a bit of time telling me about the company and finding out my interests.", "Interview Questions": "Describe how you would approach conducting a literature review."}, {"date": "28 Feb 2020", "title": "Undergraduate Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "I submitted my application and received an email to interview two weeks later. I had three interviews total -- one with program manager, one with the current team of RAs, and then one higher up manager.", "Interview Questions": "What quantitative skills could you bring? How have you worked collaboratively with a team? "}, {"date": "27 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Brookings Institution", "Interview Descriptions": "I completed the online application and was emailed about a video interview 4 weeks later. The video interview was 30 minutes long with the team's current RAs, about half informational and half behavioral questions. A week later I was emailed about a phone interview with two research supervisors. The phone interview was 20 minutes long, mostly questions about my research. That day I was emailed about in-person interviews at Brookings. I spoke with each member of the team  for about 20 minutes each, getting a mix of behavioral and research questions.", "Interview Questions": "Tell us about your thesis question."}], [{"date": "3 Dec 2019", "title": "International Economics Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "I applied online through Brookings' website, and got an email about interview around two weeks later. I set up the time with the program manager and I interviewed at Brookings in DC at the economist's office.", "Interview Questions": "I Interviewed with the economist who I would assist. He just asked questions from my resume & transcript (e.g. Tell me more about this XXX experience, what courses you've already taken, etc.)"}, {"date": "26 Nov 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Process took about 2 months. Interviewed over the phone with the recruiter in the fall of 2019 for the Spring Internship. Was told that they would only be hiring 1 intern.", "Interview Questions": "Why Brookings?"}, {"date": "4 Aug 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Applied online.  Had a 15 minute phone screening. Next step was to complete a four hour skills test. Completed skills test. Email said I would hear back about the status of candidacy in 2 weeks. I never heard back.", "Interview Questions": "Why do you want to work at Brookings?"}, {"date": "25 Jan 2021", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Brookings Institution (Washington, DC) in Jul 2019", "Interview Descriptions": "Typical process. Three rounds: phone, in person, then writing test. Everyone was very polite and easy to coordinate with.  Phone interview was mostly introductory and going through your resume. In-person interview was more challenging, asking about specific experiences and what you can add to Brookings. Writing test focused on copy editing and writing skills.", "Interview Questions": "What interested you about the Metropolitan Policy Group?"}, {"date": "18 Jun 2019", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "The interview process was easy and straightforward. I was asked mainly about past experiences with research, problem solving skills (in a specific scenario), and personal drive to do well in the internship.", "Interview Questions": "What is your greatest strength?"}, {"date": "8 Jul 2019", "title": "Economic Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Jun 2019", "Interview Descriptions": "My interviewer was abroad so we had the interview over the phone.  The entire interview lasted for about 30 minutes. My interviewer introduced the Brookings and my prospect responsibility and he asked about my education and working experiences, volunteer experiences, team project experience and my contribution, strength and weakness, and et cetera. Overall, the experience was good, and the conversation was interesting.", "Interview Questions": "Tell me about your working and education background; volunteer experiences; team project experience and my contribution, strength and weakness"}, {"date": "23 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution (Washington, DC) in Jun 2019", "Interview Descriptions": "One interview through the phone for about 20 minutes. Not too difficult, and everything went by so quickly. i thought i did badly... but somehow still went through it and got an offer! perhaps reference was important? I'm not too sure.", "Interview Questions": "Why are you interested in Brookings?"}, {"date": "25 Feb 2020", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Brookings Institution in Apr 2019", "Interview Descriptions": "The interview consisted of a phone interview with the team members (a Fellow and a Research Analyst). The interview was supposed to be half an hour to an hour long, but I think it wound up being closer to an hour and twenty minutes. After the interview they told me that they would get back to me in a week. I expected there to be a followup interview of some sort, but a few days later they reached out and offered me the position, pending a background check. I suppose because it was just an internship the hiring process was not as stringent as it would be for a long-term position.", "Interview Questions": "Describe a data analysis problem you overcame in the past."}, {"date": "20 Mar 2019", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Phone interview. The interviewer asked quite general questions as the other posts mentioned. There's certainly a list that the interviewer follows. The interviewer told me to wait for response from the HR within one week.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "20 Mar 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Overall very smooth process, lasted around 45 mins on the phone. Was interviewed about my background and research interests; a couple of questions regarding the actual position. I would say a very professional interview process. They tell you everything in advance and then ask about your background and research interests. Overall very helpful staff and HR.", "Interview Questions": "Overall very smooth process, lasted around 45 mins on the phone. Was interviewed about my background and research interests; a couple of questions regarding the actual position. The director was super cool and gave his own background as well. They were looking for passionate interns for the project, alongside that I was asked a couple of technical questions about how would I conduct research with a specific data set. Overall a very good experience."}], [{"date": "8 Jun 2019", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Brookings Institution (Washington, DC) in Mar 2019", "Interview Descriptions": "I responded to an online posting by submitting my resume and cover letter. I was contacted 1 week later to schedule a phone screen, which took place the following day. I spoke with an HR coordinator and was asked basic questions about experience and goals, and why I wanted to come to Brookings. One week passed and I was contacted to come in for an initial in-person interview, which I scheduled for the following week. I spoke with the person who had filled my role most recently, and a senior member of another team with whom I would be working quite closely. Beyond, \"Tell us about your experience,\" and, \"Why Brookings?\" they had very few concrete questions. This seems to be common, so if you are interviewing at Brookings, remember that you will have greater latitude to control the conversation here than with other employees, and use that to your advantage. I asked many very specific questions about current goals and challenges, and was able to propose solutions to address both. \r\n\r\nAfter the first in-person interview, I was asked to complete an MS Word assessment and a writing assignment, both of which I was instructed to complete within 24 hours. This was absurd, and frankly disrespectful to demand of a working professional, so I negotiated for the time I needed.  At the same time that I was invited to complete assessments, I was also contacted to come in for a 2nd round interview a few days later. I met with the person who would be directly supervising this role, and the head of the program. Again both conversations were extraordinarily open-ended and collegial. I was impressed that regardless of the title, record or prestige of the person interviewing me, I was treated as a serious administrative professional with valuable skills to offer, which is not the ordinary experience for an EA in DC.  \r\n\r\nAfter the 2nd interview, I was asked to complete an official application and submit references by 5 PM that day. Again ridiculous, so again I had to negotiate for a reasonable timeline. \r\n\r\nI submitted the requested materials and then waited 2 weeks before emailing my HR contact to request an update. I was contacted a few day later and invited back for a third interview, this time to meet the rest of the team in a more relaxed social environment. \r\n\r\nI met with the team several days later, after which I was contacted within 24 hours with an official job offer, which I accepted, and instructions to complete a background check. \r\n\r\nThe background check took a full week to complete, and my HR contact reached out to let me know my background check was complete, and to schedule my start date. I asked to wait 2 weeks to start, so that I could give my employer notice, and my start date was set for 2 weeks later.\r\n\r\nOne note: If you have interviewed in person several times, it has been a few weeks since you've heard anything, and you are anxiously awaiting an update, please keep in mind that decision makers are often travelling, and that it can be difficult to get everyone in a room together to finalize a decision. Don't be afraid to reach out for an update. If you've made it that far, you're a serious contender, and it serves you well to indicate your continued interest.", "Interview Questions": "Why Brookings?"}, {"date": "15 Feb 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (New York, NY) in Mar 2019", "Interview Descriptions": "Contacted for interview 3 weeks after applying to set up a phone interview.  The phone interview was brief and conducted by RAs. I didn't find it to be too difficult. They asked general questions about the position and my experiences.", "Interview Questions": "What is your prior research experience"}, {"date": "9 Jul 2019", "title": "Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Brookings Institution in Mar 2019", "Interview Descriptions": "Applied for a data analysis and research internship for Summer 2019. This particular internship was for academic credit. I got an email stating that they were interested in interviewing me. A few days later, I did a phone interview which lasted a little over twenty minutes. The interview was hosted by two employees. I received a follow up email a few days after my interview.", "Interview Questions": "Tell us about yourself. "}, {"date": "24 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Interview process was not too difficult. I was called and asked about why I wanted to work for the position and to expand on skills I described. Be sure to know names of scholars in the department and their work", "Interview Questions": "What work in this department drew you to this position?"}, {"date": "14 Jul 2019", "title": "Policy Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (Washington, DC) in Nov 2018", "Interview Descriptions": "The phone-interview was very conversational and went on for roughly 45 minutes. The interviewer focused on why I pursued past positions, as well as the transferable skills I obtained.", "Interview Questions": "Do you have experience with data software, like Stata? "}, {"date": "11 Aug 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution in Oct 2018", "Interview Descriptions": "Applied online, received an email within a week to schedule an interview. Had a great interview, told me I'd hear back in two weeks. Heard nothing. Followed up after a few weeks three separate times and never heard anything. Very unprofessional", "Interview Questions": "Do you prefer working individually or on a team?"}, {"date": "11 Nov 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution in Oct 2018", "Interview Descriptions": "I applied for the position and about two weeks later they emailed me requesting a phone interview. They called me two days later and I spoke to two different people. They were both very nice, asked pretty basic questions. They asked relevant experience, things I hope to work on as an intern, why I want to work for them, etc.", "Interview Questions": "What relevant experience do you have for this internship?"}, {"date": "23 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Overall positive interview experience, everyone was very friendly. The interview was roughly half an hour long, they offered me tea or water before we started.  I took the train to reach the centre, I didn't know that they also offered Skype interview.", "Interview Questions": "Generic questions about public policy and climate change"}, {"date": "15 Sept 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution (Washington, DC) in Aug 2018", "Interview Descriptions": "I had a 30-minute phone interview with an HR representative about a month after applying for the position.  Two weeks later I interviewed individually with the administration director and the senior fellow.  Both meetings were very positive and very informal.", "Interview Questions": "What are your expectations in this role?"}, {"date": "16 Jul 2018", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Initial screening interview with HR. First round Skype interview with two current RA's, in which I had to send in my most advanced STATA code beforehand, and complete a brief writing exercise afterward. Final round interview with panel of 6 interviewers.", "Interview Questions": "Technical coding questions, work environment, ability to self direct, juggle multiple responsibilities. "}], [{"date": "9 Nov 2021", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brookings Institution (Washington, DC) in Jul 2018", "Interview Descriptions": "Fairly straightforward, included small and thematic and skills assessments, as well as a focus on how current coursework and past experience equipped me for the position. Asked about information about the position that wasn't included in the description online but could be found with additional research.", "Interview Questions": "How familiar are you with the work of the fellow you would be working for, and what are some of their most notable research products?"}, {"date": "10 Nov 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Jul 2018", "Interview Descriptions": "After applying online for about a month, I received an email to schedule an interview  with the RA and a scholar from the department that I applied for. The interview was lay-back. No surprising questions just the behavior questions you would normally think of.", "Interview Questions": "What relevant courses you have taken？"}, {"date": "29 Jun 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Brookings India interviewed me and asked me general questions about my resume and the skills and experiences I had listed on there. It was a fast paced interview though and was conducted over Skype.", "Interview Questions": "N/A"}, {"date": "19 Jul 2020", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Jun 2018", "Interview Descriptions": "I applied for a Research Intern position with a scholar in Governance Studies in early June 2018. The process took a bit over a month; I think about 2 weeks from application to getting an email from the interviewers, who were the scholar's research assistants. Very pleasant and conversationalist interviewers who put me at ease. They asked the standard questions and also to describe in depth a research project that I had done that had prepared me for the subject matter of the internship, so make sure to know the ins and outs of a paper or project really well to be able to describe the methodology, research question, data, and analysis/conclusions you came to.", "Interview Questions": "Describe one research project that has prepared you for the subject matter of this internship."}, {"date": "7 May 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "I applied through the online portal and was contacted one month later for an initial phone screen. This was held by an HR representative, who asked what seemed like basic screening questions about my interest, experience, and skills (for example, my experience and comfort level working with data).  They said they would get back with next steps in 2 weeks - towards the 1.5  week mark, I reached out again asking them to expedite the process  since I received a job offer from somewhere else. They didn't respond to that, but the next steps came at the 2 week mark. This was to  complete an assessment that involved finding a data source, presenting the data using a software, and writing an analysis addressing an initial problem statement. I submitted it within the 2-day deadline. I never heard back from them for a second-round interview or with a rejection, which is unfortunate. More communication would have been appreciated!", "Interview Questions": "Have you worked with datasets?"}, {"date": "23 Oct 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (Berkeley, CA) in Apr 2018", "Interview Descriptions": "Phone interview with basic behavioral/experience questions - interviewers (later became my supervisors) were super friendly and thoroughly explained the position. Preceded by submitting resume/cover letter online and followed by a written test involving turning a Brookings publication into sample Tweets/Facebook Posts/Email Summaries as the internship was in the Communications Department.", "Interview Questions": "Why Brookings?"}, {"date": "24 Mar 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "Very friendly and laid-back. Asked questions about classes and econ research you've done, as well as my interest in policy research. Overall a very positive experience; they were prompt in answering emails and questions as well.", "Interview Questions": "They asked specific questions about the methodology I used in a empirical econ paper I wrote and about my faculty with econometric packages."}, {"date": "13 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (Washington, DC)", "Interview Descriptions": "Friendly, no harsh questions, but it seems to me that they are expecting experience very relevant to the position (think tank, research experience, government experience), and a degree on IR, or Political Science. Lasted about 25 minutes.", "Interview Questions": "Background experience, relevant to the internship, according to resume"}, {"date": "12 Apr 2018", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Mar 2018", "Interview Descriptions": "From apply to decision process took 1 month.  Applied online, asked for a phone screen 3 days later.  Had an in person interview a week later. Waited 2 weeks before following up, was still being considered. 3.5 weeks after in-person was emailed as not selected. In person interview was 2 40 min interviews with 2 team members each. Also a budget Excel test, where I had to create a budget from scratch over 45 mins. Team was very professional and responsive when I followed up.", "Interview Questions": "Experience with foreign offices?"}, {"date": "13 Feb 2019", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Brookings Institution in Mar 2018", "Interview Descriptions": "The first interview was a short phone call discussing the position and reviewing my resume.  Nothing was out of the ordinary here! The interviewer was curt but allowed me to answer my questions fully.", "Interview Questions": "How did my past experiences help me prepare for this position?"}], [{"date": "24 Jun 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution in Feb 2018", "Interview Descriptions": "The interview process was quite simple, nothing out of the ordinary - behavioral questions as well as questions about technical knowledge of statistical packages. There is time to ask your own questions about the institute. Only one interview for the internship, but can vary depending on internship program.", "Interview Questions": "What is your research experience? "}, {"date": "23 Jan 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Brookings Institution (Hanover, NH)", "Interview Descriptions": "Nothing too tough. Just a quick meeting with the scholar I would be working for while he was on campus for a speaking event. All behavioral and speaking about future goals.", "Interview Questions": "Why do you want to work at Brookings?"}, {"date": "7 Oct 2017", "title": "John L Thornton China Center Summer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "After submitting your application online, you wait around a week to hear back on the interview. I think they do a resume screening and get you back within 3 days if they don't like it. \r\n\r\nAfter scheduling a time slot, you get a 30~min phone interview. They ask you about your policy background and interests in Brookings.", "Interview Questions": "Why are you interested in the Thornton center in particular?"}, {"date": "10 Oct 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (Washington, DC) in Sept 2017", "Interview Descriptions": "Standard phone screen followed by first-round interview, which was held over Skype.  Questions were virtually all about my character or experience. They were exceptional at responding to emails and very timely in giving me a final answer, something that shouldn't be underrated in this world of frequently cold-hearted recruiting.", "Interview Questions": "How closely did you interact with superiors at X organization?"}, {"date": "24 Aug 2017", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Brookings Institution", "Interview Descriptions": "Phone Interview by potential supervisor followed one to two weeks later with an inperson interview which lasted about 3 hours.  I first met with my potential supervisor for about 45 minutes,  30 minute skills test, next I met with my potential team for about 35 minutes, next I met with HR for about 30 minutes or so.", "Interview Questions": "Why are you interested in this position?"}, {"date": "28 Jul 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "I interviewed with several different people from the department. There was an initial 30-minute phone screening with several people on staff, then a set of in-person interviews lasting a couple of hours.", "Interview Questions": "Nothing was particularly unexpected. The interview questions were standard."}, {"date": "15 Jul 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Brookings Institution (New Delhi) in Jun 2017", "Interview Descriptions": "Was brought into the room and we discussed a variety of research matters. Brought a list of potential exploration topics and how I would go about them. Thats all I did.", "Interview Questions": "What sort of statistical analysis did I know? What programming languages did I know? What research questions did I tackle earlier."}, {"date": "9 Jul 2017", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution (Washington, DC) in May 2017", "Interview Descriptions": "Had a phone screening with somebody in HR on a Friday, then conducted a writing test for the position over the weekend. Was told a week later that I was not selected for the position", "Interview Questions": "Q: What do you know about Brookings, this program, etc."}, {"date": "9 Aug 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (Washington, DC) in May 2017", "Interview Descriptions": "1. Phone interview, was supposed to be with HR person, instead was with a person in the department of the position I applied for. \r\n2. In-person interview, was 1 of 3 applicants to get this round. Two interviewers, mentioned I was a little old for the entry level position.", "Interview Questions": "Have you ever managed the schedule of upper management staff? "}, {"date": "26 Apr 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution", "Interview Descriptions": "There were two main interviews. One was with the person I would presumably working with directly, and the second was a the head of the department I had applied to.  I assume that the hiring process is handled a bit differently depending on the position and department. Everyone was very flexible and a pleasure to speak with. It took a few months and I did know someone who worked with the persons in this department who I used as a reference.", "Interview Questions": "What books are you currently reading? (Pertaining to the research area I was applying for). "}], [{"date": "24 Sept 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution (Washington, DC) in Apr 2017", "Interview Descriptions": "I first had a phone screening, which was pretty basic and with an HR rep. Then 6 weeks later, I had in-person interviews with the scholar and their RA. Questions were thoughtful and in-depth about the research focus area, and not behavioral. Some of the questions were surprisingly personal. Then I was shuttled off to meet with a panel of several additional interviewees from some of the support roles within that division. That interview was much easier, and mostly a review of my resume. \r\n\r\nI didn't hear back regarding my candidacy for an ENTIRE MONTH, despite emailing to figure out the result. The process overall seemed very disorganized to me, and it was not okay to leave a candidate hanging for literal weeks between every stage of the hiring process. Brookings can only get away with disorganization like this because it's so prestigious.", "Interview Questions": "What is your opinion on [a specific piece of writing] by this scholar? "}, {"date": "17 Apr 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Brookings Institution in Mar 2017", "Interview Descriptions": "I submitted an application online and heard back a few weeks later saying I'd been selected for an interview. They scheduled an interview for later that week over the phone with the directors of the program. The interview lasted about 30 minutes. All interaction was timely and professional.", "Interview Questions": "The only mildly interesting question was when they asked me how I would solve a particular economics problem."}, {"date": "5 Apr 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution in Mar 2017", "Interview Descriptions": "Applied online. Was contacted 2 weeks later about a phone interview. The phone interview was 40 minutes long and was conducted by two research assistants. We talked about my background, the reasons why I wanted to intern with Brookings and some substance questions related to the field. They were very nice and provided an overview of the internship itself.", "Interview Questions": "Why Brookings? What skills do you have?"}, {"date": "4 Apr 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Brookings Institution (Washington, DC) in Feb 2017", "Interview Descriptions": "Applied for the job, was given a fairly standard HR screening two weeks later. Told 1-2 weeks for a decision. After checking in intermittently, learned that they had hired another candidate about two months later.", "Interview Questions": "Tell me about a time that something unexpected happened, and how you handled it."}, {"date": "23 Dec 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution in Feb 2017", "Interview Descriptions": "Applied Online. Scheduled one phone call. Was a behavioral interview asking questions about my resume and about the work done at Brookings and how you will be able to contribute to their work.", "Interview Questions": "Who is your favorite fellow and why?"}, {"date": "13 Jan 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC)", "Interview Descriptions": "I was interviewed by a research assistant. S/he asked me straightforward and predictable interview questions regarding my strengths, weaknesses, past experience, biggest obstacle faced, etc. S/he was very friendly and got back to me in timely manner with an internship offer.", "Interview Questions": "Who is your favorite Brookings scholar and why?"}, {"date": "3 Feb 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Jan 2017", "Interview Descriptions": "Online resume/cover letter drop from their jobs board. About 1.5 weeks later, I got an email to schedule a phone screen with HR. The screen was 2 days later -- short (20min) and very straightforward (\"why Brookings?\", \"tell me about your experience.\") \r\n\r\nThe following week, I received an email asking me to come in for an in-person interview, which consisted of an hour-long interview with the small research team and a brief chat with an HR rep. The first interview was very enjoyable -- the researchers truly wanted to understand my interests, my work style, and how those things would fit with their team. It was very relaxed and I had a great time. We went over time, but I was able to ask a few questions. \r\n\r\nThe HR interview was immediately after and was largely informational. I was asked two questions about my interest in the position before the rep discussed Brookings' culture, workflow, etc. The rep then opened the floor for questions, and we chatted a bit about Brookings. Very friendly and relaxed.\r\n\r\nI was asked to complete a writing task that weekend. It was certainly a decent amount of work, but seemed very aligned with the type of assignment an RA would be asked to complete. \r\n\r\nThe next week, I was asked to submit the names of 3 references via an online platform. I got a call with an offer that same week. Overall, it was almost exactly one month between the date of my application and the date of my offer.", "Interview Questions": "Very few \"typical\" questions at the in-person interview. Half were about my research processes/skills (\"how would you approach x research task?\"); the other half were about the group's research topic (\"tell me your thoughts on y policy topic\")."}, {"date": "22 Jan 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Brookings Institution (New Haven, CT) in Jan 2017", "Interview Descriptions": "Simple and direct questions about skills and interests. Nothing too other-wordly or technical. Interviewer was very polite and courteous. Just make sure you've done your research about the position you're applying to.", "Interview Questions": "Why are you interested in this position?"}, {"date": "15 Dec 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Brookings Institution (New York, NY)", "Interview Descriptions": "The interview process surprised me. I had an initial phone interview that lasted about 20 minutes, followed by an interview at the Brookings Institution that lasted about 2.5 hours. They ran a tight schedule and made sure to introduce me to several people. Everyone was very friendly, to an extent that surprised me given what I expected would be a competitive environment. I was frustrated that they could not tell me what the salary would be if I were offered the position. But the interview was conversational, professional, high level, and very enjoyable.", "Interview Questions": "Tell us about a time when an organization where you worked could have used a better approach to solve a problem. "}, {"date": "18 Nov 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "There were three interviews: a phone screen and two face to face interviews. The first phone screen was with a member of HR, the second was with the two research directors and the third was with the managing director of the foreign policy program.", "Interview Questions": "Tell us about your research"}], [{"date": "18 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (New York, NY) in Aug 2016", "Interview Descriptions": "After applying online, I got a request from the research director to set up a phone call. Phone call occurred a week later and lasted 30 minutes. Easy questions, just wanted to assess my qualifications and background. Nice interviewer. Two weeks went by and I emailed them on the status of the job, and the research director told me they had chosen someone else.", "Interview Questions": "Tell me about yourself"}, {"date": "16 Oct 2016", "title": "Financial Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Jul 2016", "Interview Descriptions": "An automated email (without a valid reply-to address) invited me to schedule a phone interview with Brookings HR. When I spoke with the staffer, she asked standard questions (walk me through your resume, etc.) and said she would be in touch to let me know whether Brookings would be moving forward with my application. I did not have a phone number or email address at which I could contact the staffer, since I received all correspondence from an automated address. Then, more than a month later, I received an automated email saying my application had been moved to the next round and that I would be interviewing in person the following week at a certain time. This message was followed by another automated email saying that I had received the first email in error and that I was, in fact, rejected. Classy.", "Interview Questions": "Why did your salary expectations increase since you submitted your application online?"}, {"date": "15 Jul 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Jun 2016", "Interview Descriptions": "I applied online and was immediately contacted for a 30 minute phone interview. Standard interview questions were asked. I was then asked to complete a simple job simulation, which required you to find some Census data and then prepare a one-page memo for a politician, and offered an hour-long in person interview with the project manager. Most of the interview questions were about my skills and why I was interested in the position. Anyone who applies should definitely spend some time reading some of the scholars' works, as they will ask you about this. I was not contacted again.", "Interview Questions": "Have read any of our scholars' works?"}, {"date": "6 Jul 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (New York, NY) in Jun 2016", "Interview Descriptions": "I applied online and the process took about 3 weeks. First, there was a 30 minute phone interview with the deputy director of the program, the administrator, and the current research assistant. Second, there was an opportunity for a face-to-face interview with the entire program and HR.\r\n\r\nOverall, the people were congenial and respectful.", "Interview Questions": "What is your experience working with data?"}, {"date": "22 Jun 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution in Mar 2016", "Interview Descriptions": "One phone interview. Questions were broad and resume based; \"tell us about what you did in this role?\" No specific questions about skills. Interviewers were very kind and respectful and the discussion was more of a conversation than an interview. Overall the interview was fairly easy.", "Interview Questions": "Tell us about a time you had to solve a problem using data?"}, {"date": "16 Oct 2017", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (Washington, DC) in Feb 2016", "Interview Descriptions": "Applied online. Invited for phone screening ~two weeks later. Phone screening with recruiter. Simple personality and experience questions. Lasted roughly 30 minutes. Recruiter did not know specifics of the position to answer my questions.", "Interview Questions": "What would be the most challenging aspect of this position?"}, {"date": "23 Feb 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution in Feb 2016", "Interview Descriptions": "I applied for the position online and was contacted within the week for a phone interview. I interviewed with a mid-level staffer. The interview was very casual and the typical questions were asked. I received a personal email a couple weeks later that they had decided to go with someone else.", "Interview Questions": "Tell me about a recent research project you've worked on."}, {"date": "14 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC)", "Interview Descriptions": "A phone interview, a writing test, and a final in person interview with the research assistant. Process was relatively straightforward. Seems like the hardest part is getting the first interview.", "Interview Questions": "What is your biggest weakness?"}, {"date": "14 Jan 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Jan 2016", "Interview Descriptions": "I applied online and got an email invitation for the 1st round phone interview. Honestly I didn't expect them to be quite unprofessional. First, when they asked me for the time slots I was available, they didn't even confirm with me before the interview. Then when the time came, they were a few minutes late even though the interview was supposed to last for only 20-30 mins. Moreover, after the first question, they asked me whether I was thinking of future PhD in Econ and I said I haven't prepared much for grad school application this year but will for sure apply after 1-2 years working. The interviewer abruptly complained that the connection was so bad that she couldn't hear me and suddenly said bye after telling me to wait for HR response.", "Interview Questions": "What makes you interested in their projects? "}, {"date": "15 Dec 2015", "title": "Entry Level Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution", "Interview Descriptions": "About a month and a half after I applied online, I was contacted saying they were interested. I was sent an editing test, and once that was accepted, I had an in-person interview with two managers. I was told there were two finalists for the final round, which was an interview with another senior staff member as well as a \"conversation\" with the head of the department.", "Interview Questions": "Nothing out of the ordinary"}], [{"date": "4 Dec 2015", "title": "Research and Event Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Brookings Institution (Washington, DC) in Dec 2015", "Interview Descriptions": "By phone. One round. Three people. They are super nice, and I was much more relaxed than my other interviews because they create a light atmosphere. You can tell that they studied your resume, but maybe not the cover letter. They will pick out any experience in your resume to ask you, schools, work experiences and etc. So it can be expected that the questions are not typical or common seen.", "Interview Questions": "1. What did you learn in your jobs at law firms? And what did you do?\r\n2. Why did you come to the US\r\n3. Tell me one time when you take a initiative when your supervisor were not with you."}, {"date": "16 Nov 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution (Washington, DC)", "Interview Descriptions": "First, had a phone interview with several people on 1 call - it took about 45-60 minutes. Then an in person interview with 2 people which took about 1 hour. Then a background check, once that came back positive, an offer was given.", "Interview Questions": "Finance related questions."}, {"date": "13 Sept 2015", "title": "Multiple Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Brookings Institution (Washington, DC)", "Interview Descriptions": "Brookings may be the most prominent think tank in the United States, but the way they treat potential employees is disheartening. Here are my two separate experiences interviewing with them.\r\n\r\nI first applied for a junior-level staff position. The hiring manager scheduled a phone interview with me, and failed to call me when the time came. After I followed up via voicemail and email, we rescheduled the call to a new time, and I was asked to call her instead. When she picked up, she immediately said, \"I can't talk now, let me put you on hold\". She didn't give me any time to ask any questions at the end.\r\n\r\nI was then asked to come in for an in-person interview. It went fine, and I felt there was a good rapport. A few days later, I was asked to do a written assessment with very short notice; they sent it to me on an afternoon, and requested that I turn it in by 10am the next day. I did that. A few weeks later, they asked me to fill out a new job application. I did that. A few weeks later, I got an automated email from HR saying the position was cancelled. The hiring manager emailed me a few hours later to say that there wasn't enough money after all for the job, but that she thought I was a strong candidate and urged me to reapply for new positions in the future.\r\n\r\nAt this point I still had very positive feelings about Brookings. So when I entered grad school and saw that they were looking for graduate interns, I applied right away. The website said that interns would be paid $10.50, which I thought was wonderful. They called me for a phone interview, and at the very end, the hiring manager told me that the internship would actually be unpaid. \"The website has incorrect information,\" he said, but assured me that the rich experience of working at a place like Brookings was enough of a perk to make up for zero pay. I was startled. Not by the fact that Brookings doesn't pay most of its interns (this is very common in DC), but by the fact that this seemed to be intentionally misleading and dishonest -- why couldn't they have corrected the information on their website, or at least told me about this up front?\r\n\r\nDo I still respect Brookings and the quality of its academic research? Yes, absolutely. Would I apply for a job there ever again? Honestly, no, I doubt it. I think people who work at Brookings have been so comfortably nested in their \"we're the best think tank out there and everyone would kill to work for us\" bubble that they no longer recognize the importance of treating external job candidates with the respect that they deserve.", "Interview Questions": "Do you have experience working with data and analytics?"}, {"date": "29 Jul 2015", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "I applied online through a job board (indeed, internships.com, glassdoor, something like that) and then got an email saying they wanted to interview me on the phone. We spoke on the phone and they offered me the internship; this was all within like 2 weeks.", "Interview Questions": "Why did I want the internship in communications? "}, {"date": "24 May 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brookings Institution (Washington, DC) in Aug 2015", "Interview Descriptions": "Admittedly this was a while ago (2015). Interviewing staff was very open and knowledgeable. They represented the company well but also gave space for the person being interviewed to speak and share experience. Overall I was very impressed with the experience.", "Interview Questions": "What do you see as a defining challenge in US foreign policy in the MENA region?"}, {"date": "26 Nov 2015", "title": "Analytics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Brookings Institution (Washington, DC) in Aug 2015", "Interview Descriptions": "Some questions about my resume, one basic question about stat, questions about personality, questions about why you interested in the work, questions about the available work start time, questions about schedule", "Interview Questions": "Say one strong point and one weak point of you"}, {"date": "16 Oct 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (Washington, DC) in May 2015", "Interview Descriptions": "Mostly classic behavioral questions, some policy related. The interview took place over the phone. Talk about your experience, walk me through your resume, etc. They like to see relevant experience to the exact position, so if your resume doesn't stack up pretty closely then you might be out of luck.", "Interview Questions": "Which scholars' work have you read? Who would you most like to work with?"}, {"date": "4 Dec 2018", "title": "Research Assistant & Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution (Washington, DC) in May 2015", "Interview Descriptions": "Applied in April and got offer mid-June. Started job in early July. Interview process involved phone screening with previous RA, phone interview with Fellow, overnight writing test (fairly straightforward), and Skype interview with Fellow and Center Director", "Interview Questions": "What will you bring to this position? What makes you unique?"}, {"date": "18 Aug 2015", "title": "Blog Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Apr 2015", "Interview Descriptions": "There were two people, the head of communications and a resident fellow, who conducted the interview. They were very nice and did a lot of explaining about the position rather than simply grilling me. The position was a new one, so I believe that they didn't know what they were looking for. This resulted in a lot of softball questions.", "Interview Questions": "Do you have experience generating hits for a website?"}, {"date": "25 Sept 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Brookings Institution (Chicago, IL) in Apr 2015", "Interview Descriptions": "A 30-minute phone interview with mostly behavioral questions. The first question is about tell me about yourself. It is very conversational. My interviewer was very nice and helpful. We had some small talk about Illinois weather as well.", "Interview Questions": "What is your strength and your weakness?"}], [{"date": "16 Mar 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Apr 2015", "Interview Descriptions": "Received phone interview for about 30 minutes. The interviewers are very nice and professional. They first introduced themselves and the major requirement of the position before starting to ask questions. The questions are regular types, including why us, why you. There is some behavior questions as well, but not very tricky. Examples are \"please describe one time that you had difficulty in a project and how did you handle it\".", "Interview Questions": "Why do you want to apply for this position?"}, {"date": "11 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brookings Institution in Mar 2015", "Interview Descriptions": "Two rounds of interview, meet the fellow and RA, very friendly environment. People in Brookings really care about their research filed, so it's better you get prepared for the topic", "Interview Questions": "Why are you interested in applying this job?"}, {"date": "11 Dec 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "One phone interview with department coordinator/RA, simple questions. Tell me about yourself, tell me about X experience on your resume, your weaknesses and your strengths, why are you interested in Brookings, why this department, do you know any of the scholars work, what are you most looking forward to in working here", "Interview Questions": "Pretty easy, I guess hardest would be do you know scholars in the department"}, {"date": "19 May 2015", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Brookings Institution (Washington, DC) in Dec 2014", "Interview Descriptions": "The interview process was efficient and typical. It took less than a week to get interview notice and another week to get the offer. Questions include why are you interested in Brookings, why this department? Why are you interested in this specific job? Tell me more about your former working experience relevant to this position.", "Interview Questions": "Are you applying for positions from other organizations at this moment?"}, {"date": "9 Oct 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Brookings Institution (Washington, DC) in Dec 2014", "Interview Descriptions": "They messaged me the day before to come in for the interview. I was traveling so I did the interview via skype. They were very accommodating.  I met with three different employees separately and they all asked me different questions. The department consisted of 3 people and I had to interview with all of them.", "Interview Questions": "1.  If you have an event scheduled and your speaker for that event cancels day of event.  What do you do?"}, {"date": "20 Nov 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "It was a pretty close-knit team. There is a face-to-face interview followed by a written test. The interview asked mainly about interest and availability. The written test involved translation and social media strategies.", "Interview Questions": "Translation"}, {"date": "17 Sept 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "Sent in an email application to the main job board. After about 2 weeks, I received a response asking if I was available for a phone interview. The first interview was relatively relaxed, with very basic behavioral questions asked. After another 2 weeks, I received an update asking if I was available for an interview with the Director of the Department. After this interview, which also had an economist brought on to ask more focused questions, I was told to wait a few days while they made a decision. After 4 days, I was told I received the job.", "Interview Questions": "The Export-Import Bank has made quite a bit of news recently. Please explain what the bank does and please make an argument for or against its operations. "}, {"date": "29 Aug 2014", "title": "Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "Applied online and interviewed via phone 3 weeks later. The interview was conducted by a current research assistant to one of the experts and the questions were very typical, such as \"why would you want to work at Brookings,\" \"describe a research project you really enjoyed,\" etc. They were very interested in knowing exactly how much research I had previously done in the area of study. Entire process was very pleasant.", "Interview Questions": "Most very common questions. Most difficult question asked for details of research in specific area of expertise"}, {"date": "22 Feb 2016", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Brookings Institution in Aug 2014", "Interview Descriptions": "The job was applied online, which required a resume sent by email. The team manager was the recruiter herself, but the resumes were sent to department HR and were distributed to different TMs. I applied three different jobs in the same department. Received a phone interview, and I told the recruiter (the team manager) that Brookings was my first option. The decision was made a few days afterwards. It was a little awkward that two other TMs rejected me but saw me in the office the other month, and unluckily found out that I was the most hard-working one. I was asked to return to the department, but for a far-reaching graduation date and my immigration status, I could not accept.", "Interview Questions": "General behavioral questions: what three words will your friends use to describe you; how do you manage your time, etc. The conversation lasts about half an hour."}, {"date": "12 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Brookings Institution (Washington, DC) in Aug 2014", "Interview Descriptions": "The interview was exciting! It was via Skype. Questions about my experience and personalities, especially talked about team work.\r\nI was asked why Brookings? And why want the position I was applying for?\r\nAlso, asked why I want to work in D.C.", "Interview Questions": "Have you done group work?"}], [{"date": "19 Apr 2014", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (Washington, DC)", "Interview Descriptions": "I applied for a position and two months later I started. This is not normal for Brookings. In fact, most staff waited nearly 6 months between initial application, interviews, and hiring.", "Interview Questions": "What is your health background?"}, {"date": "24 Mar 2014", "title": "Research Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Brookings Institution", "Interview Descriptions": "applied via online system, one HR interview, one interview with the researcher", "Interview Questions": "what kind of supervisor would you work well under? \r\nwhat kind of organization culture would you work well in?"}, {"date": "8 Nov 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Brookings Institution", "Interview Descriptions": "Two weeks after application was asked to submit writing sample; a few days later asked to set up an interview. After a few emails the interview was set up and went alright. Took about a half hour. It took over 1 month for a final decision following that.", "Interview Questions": "Began, after brief introduction, asking about if I had any questions before inquiring into my experience - this was a little surprising. "}, {"date": "31 Jan 2014", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookings Institution (Washington, DC) in Nov 2013", "Interview Descriptions": "Cover letter, resume, transcript required, and just one phone interview", "Interview Questions": "Of all of the scholars in the Governance Studies program, whose research are you most interested in?"}, {"date": "15 Sept 2015", "title": "Communication Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Brookings Institution (Washington, DC) in Oct 2013", "Interview Descriptions": "greetings.\r\nBefore he even started. I expressed my strong interests and passion to this position! Very important. They like it.\r\nasked me questions, about my experiences first. Then move on to ask me how my previous experience had prepared me to the job. \r\nthink i might be a better fit to another position, then transferred me there\r\ngot the job!", "Interview Questions": "Asked about my experience\r\nHow your experience prepared you to this position"}, {"date": "28 Feb 2013", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution (Washington, DC)", "Interview Descriptions": "Very extensive. \r\n1. Applied online\r\n2. Heard back a month later and had a phone interview with a team member\r\n3. a couple weeks later, had a 1-on-1 with that team member\r\n4. A week after that, had a series of panel interviews with the team, the head of the team, and the deputy director of the department, and then an HR interview.  \r\n5. A week later, there was a skills test onsite.\r\n6. A week after thought, following a background check, I received an offer.", "Interview Questions": "What are you reading right now?"}, {"date": "9 Jan 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Brookings Institution", "Interview Descriptions": "Applied online and was contacted by an administrator within a week to arrange a phone interview. Phone interview was scheduled and completed a few days after that. We discussed my resume and experience in detail as well as my approach to international politics. Interviewer was very positive, complimentary and encouraging. After the phone interview I received an employment application to fill out as well as some benefits information and was asked to send a writing sample. I returned all the requested materials and did not hear back for 2+ weeks. At the end of the month, I got an update saying the interview process was delayed due to travel schedules. After that I continued to receive periodic updates for a few weeks before they stopped altogether. About 8-9 weeks after the initial interview I was told that they were proceeding with the next round of interviews and I had not been selected.", "Interview Questions": "N/A"}, {"date": "11 Apr 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Apr 2012", "Interview Descriptions": "I had four interviews before being employed at Brookings, which seemed typical based on speaking with my peers. First I spoke with the HR director over the phone, then came in for 3 one-hour interviews in a single day. It was intense but nice that it was technically only 2 rounds.", "Interview Questions": "My experience working with high level individuals. "}, {"date": "10 Jun 2014", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Brookings Institution (Washington, DC) in Jan 2012", "Interview Descriptions": "Very rigorous interview process. Met with three full time researchers and was drilled with math and econ questions. The interviewers were very friendly but intense. We had lunch after the interview and they held very interesting conversations.", "Interview Questions": "Guestimate the number of emplyees at brookings."}, {"date": "21 Apr 2011", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookings Institution (Washington, DC) in Feb 2011", "Interview Descriptions": "Applied online at the company's website in mid-Dec. Received an email mid-Jan from the department to schedule a 15min. phone interview with the director of the project and a senior researcher. They apologized for getting back to applicants so late, so normally the process doesn't take that long.\r\n\r\nPhone session a couple of days later went well. I was asked why I switched careers to research and how I got interested in their topic area. I spoke about how it impacted my class work and part-time ra job, what my views and understanding of the subject was. Basically, they wanted to confirm that you knew what you were talking about. Two weeks later, received an email from the department to schedule an in person interview with the same pair. \r\n\r\nMet at office a week later. Spent half an hour with hr going over my resume, career change, classes, and activity since graduation. It was the most detailed questioning I've had for any job to date. Lots of follow up questions. Surprisingly, there were many about my spouse and what they did. That was strange. She asked if my references were up to date and I said I'd check on an older one and get back to her.\r\n\r\nWent on to the director and researcher and talked for an hour and a half about the job, my past experience, and stories about things we had in common. There weren't any hr-type questions and they were direct and straightforward. They asked me to send a writing sample. I thought the interview went well and there was a real rapport. However, they said they were doing two weeks of in person interviews, then at least one more round after that, maybe more.\r\n\r\nSent thank you emails with follow up materials the next day. Didn't hear anything for three weeks. Sent an inquiry to hr. Haven't heard anything since. I've heard that it's normal now for companies not to contact you with the results after an interview, but this was disappointing as they were otherwise professional.\r\n\r\nIn all, it seems like a wonderful place to work with people who care about what they do. God only knows how many applications they got. Frankly, it’s a job lottery for overqualified candidates. The position only  called for a BA and I have two MS’s. Other applicants probably had similar education and more experience.", "Interview Questions": "Where does your spouse attend school?"}], [{"date": "1 Mar 2011", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Brookings Institution in Nov 2010", "Interview Descriptions": "it was first an interview with the HR person asking the general background; and then an interview with the hiring manager asking the technical skills you have with a series of data packages.", "Interview Questions": "They give a scenario about their technical problem, ask you how would you deal with it?"}, {"date": "31 Oct 2009", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Brookings Institution (Washington, DC) in Mar 2007", "Interview Descriptions": "Initial phone interview with current research assistant.  Then three one-on-one interviews, first with the current research assistant, then with the program manager, and then with the scholar.  Most questions about my previous experience, especially data collection and management for economics, major focus on the details of my knowledge of particular topics.", "Interview Questions": "Please describe your previous experience in managing large data sets and presenting economic data in graphic format."}]]