[[{"date": "16 Sept 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Harold Grinspoon Foundation (Agawam, MA) in Aug 2021", "Interview Descriptions": "I applied for a position that I am 100% qualified for. Educated at the graduate level, years of experience. My hat was thrown into the ring for positions I didn't even apply for...but not the role I have well over a decade of experience in. The Zoom panel interview went well, or so I thought because the main person who interviewed me specifically said I'd definitely hear from him again. I never heard from anyone again. Ghosted completely. Then the job I applied for was taken down and reposted. The complete lack of courtesy from recruitment was a red flag and could be behind some of the negative employer reviews I've seen across multiple sites. My experience here is the \"poster child\" for why there are still so many unemployed and still looking. First off, I was sent an email interview appointment that was meant for someone else. Then I was called at both numbers and even texted when I did not respond immediately. So, my point is recruiters generally expect your quick responsiveness but... with zero reciprocity. Don't you just love it? Can you imagine texting an HR recruiter a follow up request??? I'd bet the farm they won't appreciate it.  I was set up for an in-person interview, then it was changed to a Zoom with very little notice (I had postponed an afternoon MD appointment to accommodate what I thought would be a live interview). I was initially rejected in the phone screen for a role I've always done because I possess a characteristic that is not only normally considered positive, but necessary. I was then thrown into consideration for other roles. The interview panel had no idea what I had actually applied for; they were under the impression I had applied for those roles. Trying to pretend I did was awkward. There was such an emphasis on being down to earth and ego-free, which I am. But the behavior and treatment I experienced on the recruitment side speaks to the polar opposite. I'm sure many job seekers would agree that this unfortunately all-too-common experience is obnoxious. I guess consideration and courtesy are out of style. They are obviously looking for some kind of \"unicorn\" and have no issues dragging out their very disorganized and unfocused hiring process and wasting the time of/ ghosting qualified people in the process. Employers need to just cut it out already because this has gotten beyond ridiculous. It's time to come back down to earth and let qualified job-seekers get back to the business of working, paying their mortgages, supporting their families and repairing the economy. If there is a concern about an ego-free workplace, they should look more closely at HR recruiting (the demeanor was disingenuous, ego-driven as it was hard to even get a word in, and more typical of a large, beaurocratic organization). Job-seekers have lost all respect for recruiters and it's because of nonsense like this. They certainly don't hold themselves accountable for their gaffes (as extremely picky as THEY are lately to the point of ridiculousness) nor do they respect us or our time.", "Interview Questions": "So tell me about yourself."}], []]