[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place, wonderful colleagues", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Jun 2023", "job_title": "Manager in Olive Branch, MS", "duration": "N/A", "pros": "It's got a wonderful humanitarian mission and purpose (to help victims of armed conflict and strife). Its employees naturally embrace the mission and the fundamental principles on which the organisation undertakes its work. It's a chill work environment - not formal, colleagues tend to be close-knit - and the work itself is rewarding. For colleagues who are able to relocate (and want to), there are great opportunities for you.", "cons": "If you can't become a mobile colleague, the growth potential here is limited. A person can get stuck in the same role for decades. It's also highly bureaucratic, with many unnecessary layers of red tape."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A true humanitarian organization", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Apr 2023", "job_title": "Programme Adviser in Dallas, TX", "duration": "N/A", "pros": "Unique job not like anything else out there", "cons": "Non-profit, risk of job security if experiencing budget deficit"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Not much opportunity", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2023", "job_title": "Data Protection Officer in Kuala Lumpur", "duration": "N/A", "pros": "Good pay and looks good in resume", "cons": "Little too no growth Favourtism"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "terrible org, toxic work culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Dec 2021", "job_title": "Public Relations in Kuala Lumpur", "duration": "N/A", "pros": "the reputation of the org for people who have never worked in it, it is a good thing", "cons": "lack of professionalism, integrity and accountability by heads; \n\nthey push their failings to junior staff and the organisation lets them; \n\nno communication of higher ups with lower level staff (hence managers here hold all the power over officers in their own departments, breaking them if they want to) ; \n\nlow pay for the workload (basically 24/7) just for the so-called prestige of being in this org ; \n\ntheir compliance office and Ombuds system is a joke, and merely exist to give a semblance of a checks and balances in this organisation but merely parrot management's decisions ; \n\nbadly organised leading to last minute and clobbered-together missions which do not fulfill objs and neither do they care \"if we plan 10 events and just have success in 1, that's enough\" - actual words from a manager\n\nno career advancement; had colleagues stuck in their roles for years.\n\nHeads, especially diplomatic staff do not know how to manage relations with local authorities (30 min late for meetings) ; arrogantly point out all that is wrong and demand corrections from Prison authorities\n\ndepartments cannot get along, a lot of infighting making someone who had a cross-department file almost impossible to function. a lot of aggression and intimidation and credit-hogging.\n\nverbal and mental abuse from Heads (was told I was stupid for every thing I did) Heads drag their feet with decisions then throw all the work on their subordinates with no sense of ownership and responsibility."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not Recommended", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Sept 2021", "job_title": "Accountant in Kuala Lumpur", "duration": "N/A", "pros": "The ICRC indeed does some good humanitarian work in certain sectors.", "cons": "The work culture is toxic. A good employee will be demotivated. There is a culture of telling on each other, even over trivial matters. There is a lack of transparency even within a delegation. Managers and staff have 'secret' meetings, or intentionally speak in different languages. Rights of local staff not respected. Contracts are terminated without just cause. The ombudsman is weak and ineffective, due to lack of staff and funding."}]]