[[{"date": "21 Apr 2023", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Global Health Corps in Mar 2023", "Interview Descriptions": "The interview process was rigorous and it started with basic questions and then harder questions were torwards the end of the interviews. Most questions were situation based and required the Star method", "Interview Questions": "Tell me about your self"}, {"date": "14 Feb 2023", "title": "Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Global Health Corps", "Interview Descriptions": "The interview process was very simple, consisted of a phone interview that lasted about 45 min with a member of the development team. The whole process was ~3 weeks from application to start date.", "Interview Questions": "What is your work style/what type of management do you prefer?"}, {"date": "16 Jun 2022", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Global Health Corps (Kigali, Kigali) in Feb 2022", "Interview Descriptions": "First you write essays to accompany applications. Then you get called for interviews, generally fair interviews. Then finally the placement organisation interviews you. Then later GHC calls to inform you that you have been selected.", "Interview Questions": "Regarding myself awareness and experience."}, {"date": "14 Mar 2023", "title": "Monitoring and Evaluation Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Global Health Corps (Lilongwe) in Jan 2022", "Interview Descriptions": "It had three panelists, and they both had different questions to ask. Two of them were female and one male, one was from Malawi and the other from USA and the other from Uganda", "Interview Questions": "whats ur previous salary in your previous job"}, {"date": "24 May 2021", "title": "GHC Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps", "Interview Descriptions": "You interview for each position separately, so the second round interviews can be repetitive if you interview for multiple positions. Overall, the interviewers were very friendly past fellows who can speak to their own experiences and run through a fairly set list of questions.", "Interview Questions": "What would you do if the wifi went out the night before a big project was due?\n"}, {"date": "14 Feb 2021", "title": "Program and Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Global Health Corps", "Interview Descriptions": "The interview process was pretty chill. There are very many women at the organization so chances are you will be interviewed by one. Women tend to be more empathetic when interviewing. \r\n\r\nI spoke to one of their employers for about 45 minutes about my experience and how it was going to help me perform the various tasks the job required. Make sure to relate how your transferable skills will help you do well.", "Interview Questions": "Describe your experience doing data analysis"}, {"date": "26 Jan 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Global Health Corps", "Interview Descriptions": "There were two steps for interviews: first one with global health corps fellows/alums (2 rounds) and the final stage with organizations. It was pretty straightforward and I was given several case scenarios to discuss with panels", "Interview Questions": "Why did you chose to apply to this fellowship? Couple of case scenarios"}, {"date": "2 Oct 2020", "title": "Global Health Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Global Health Corps", "Interview Descriptions": "Phone call with no video. 45 minutes to an hour. \n\nBe able to talk about:\nWalk me through your resume\nWhy this position?\nWhat makes you a strong fit for this position?\nWhy are you interested in health inequality?\nStrengths?\nWeaknesses?", "Interview Questions": "Talk about a mistake you have made and what you learned\n\nProvide an example of good leadership\nYou arrive at your site and your supervisor is gone indefinitely on sick leave. What do you do?\n\nDescribe a time when you encountered an issue at workplace. How did you resolve the conflict/issue?\n\nTell me about a time you took the lead in a team project. What was the outcome of the project?\nGive me an example of a time you made a process more efficient. How did you do it?\n\nWhat do you do if you disagree with a co-worker?\nImagine you arrive and they give you menial tasks. What do you do?\n\nImagine you arrive at the job and in the first weeks you have been given menial tasks\n"}, {"date": "22 Oct 2019", "title": "Director of Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Global Health Corps (New York, NY) in Sept 2019", "Interview Descriptions": "Met with HR professional for a phone interview and then met with the business development consultant for another phone interview. The questions were meaty and really thoughtful. It was a really pleasant interview.", "Interview Questions": "What is your work style?"}, {"date": "10 Aug 2019", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps", "Interview Descriptions": "I applied online for a comms/marketing role. I received an email requesting a 30 minute telephone interview. After this interview I followed up with a \"thank you; I'm interested\" email. I was then asked to do a 60 minute skills assessment. Following this skills assessment, I sent another \"thank you; I'm interested\" email. After about 2-3 weeks passed with no reply, I followed up with a query email, again politely expressing interest in the position and my hope to come to the office for an in-person interview. Never received a reply — not even the standard courtesy \"thanks but we've selected another candidate\" rejection email. I would have expected at least that courtesy given the time I'd invested (seriously, it takes how long to write one of those emails? 90 seconds??)", "Interview Questions": "How do you manage work-related stress?"}], [{"date": "15 Jul 2019", "title": "Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps", "Interview Descriptions": "Received an assignment to be returned within 24 hours. Once completed I received a request for a phone interview. The interview was fairly straightforward and lasted about 30 minutes. I received an offer within a week.", "Interview Questions": "What are your greatest strengths and weaknesses."}, {"date": "2 Jun 2019", "title": "International Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Global Health Corps", "Interview Descriptions": "Initial phone interview with GHC staff, alum, or current fellows as screening for qualification as a GHC fellow. Then possible second phone interview with a panel at placement organization if initial phone interview goes well. First interview is really if you fit as a fellow while second is if you can do the job at the placement org.", "Interview Questions": "Situational questions and general questions on GHC values. "}, {"date": "22 Jun 2021", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps (New York, NY) in Apr 2019", "Interview Descriptions": "Response to job offer led to several skills tests conducted via email and submitted via email. Selection process led to several phone calls and follow up emails describing if the applicant was moved to the next round. In-person interview.", "Interview Questions": "What is a situation that challenged you? Describe a situation in which you found an innovative solution to a problem."}, {"date": "19 Jul 2019", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps in Mar 2019", "Interview Descriptions": "Interviewed first with a global health corps alum, who was awesome. We connected, and I made it to the next round. When I interviewed with the actual organization, the interview also went well. I was told I would be updated in a week or so. Then, 3 weeks went by. Then another two weeks. Until finally, I was told that the funding for this fellowship was cut, and the position I applied to no longer existed. This was after a 6 month application period. It was extremely frustrating and unprofessional to offer this type of program without knowing for sure if funding was secured.", "Interview Questions": "What's something you're trying to improve about yourself as a worker and / or leader? How are you doing so?  "}, {"date": "23 Sept 2019", "title": "Fellows 2019/2020 Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps in Jan 2019", "Interview Descriptions": "There are two skype interviews. The first is done by an alumni which is focused on your understanding of what you think a GHC fellow is. Focus more on the leadership qualities that they are looking for. If you pass that stage, which most do, you will have an opportunity to be interviewed at a later date by the employer(s) you had been accepted to.", "Interview Questions": "Why do you want to be a GHC fellow? First Interview"}, {"date": "29 Aug 2018", "title": "Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Global Health Corps", "Interview Descriptions": "The interview lasted about one hour. Pretty straightforward with questions concerning health equity, how to build community partnerships, etc. There were also some behavioral questions.  Overall, a positive experience.", "Interview Questions": "How would you define health equity?"}, {"date": "12 Jun 2018", "title": "GHC Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Global Health Corps", "Interview Descriptions": "First interview is with a member of the GHC community (current fellow, staff, or alumni). This interview focuses on your personal mission and vision. It also addresses questions about your behavior - are you resilient? can you adapt?", "Interview Questions": "What is something that you’ve realized you struggle with? What is it? How did you realize it? What have you done to work on it?"}, {"date": "6 Jun 2018", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Global Health Corps in May 2018", "Interview Descriptions": "I applied in December. Got notified that I was a semi-finalist in March. I got interviewed for all three positions I had applied to. I found out I was a finalist mid-April and did final interviews with the partner organizations at the end of April. I got both offers at the beginning of May.", "Interview Questions": "What does health equity mean to you?"}, {"date": "19 Mar 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Global Health Corps", "Interview Descriptions": "Before even having an initial interview, I was given an assignment that was neither hypothetical or reasonable in terms of time.  It was based on volumes of real data that would take hours to sift through and analyze.  This before I even had a chance to have an introductory interview to see if it was a good fit and interesting enough to move forward.  I don't have a problem with assignments per se but they should be both hypothetical and reasonable in terms of the time needed to complete.  AND most importantly, they should be once there is at least an initial conversation.  To use an exercise such as this as a culling tool is totally disrespectful of a candidate's time and is indicative of a larger organizational culture issue.  I tried finding a compromise with them but they were not interested so I withdrew my candidacy.  Overall, the experience seemed really unprofessional and lacking experience.  It was telling and clear it wouldn't be a good fit for me.", "Interview Questions": "They did ask any questions.  Only wanted me to complete an assignment before they decided if they would interview me. "}, {"date": "27 Apr 2018", "title": "Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Global Health Corps (New York, NY) in Mar 2018", "Interview Descriptions": "After completing an extensive application, I was notified of my semifinalist status and was able to interview over skype. It lasted roughly an hour and was a mix between questions about my interest in the program and my background and then also behavioral interview questions.", "Interview Questions": "What is the most difficult thing that you will have to learn at your placement organization. "}], [{"date": "21 Mar 2019", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Global Health Corps (Lilongwe) in Mar 2018", "Interview Descriptions": "I applied online and two months later they called for the first round of interviews. I was so excited because it was an opportunity i had been looking forward to in years. I hoped to get it and they gave me a slot for interviews. unfortunately i was travelling and i could not understand the face to face interviews so i was allowed to do skype. I did the interviews and sadly i never made it to the following levl.", "Interview Questions": "My understanding of health as a human right"}, {"date": "18 Jun 2018", "title": "GHC Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps in Mar 2018", "Interview Descriptions": "I participated in two phone interviews. The first was an interview with a prior fellow in which my commitment to the program's mission and values was assessed. The second interview was with a placement organization, and more specific technical questions were asked.", "Interview Questions": "What do you hope to gain from the fellowship program?"}, {"date": "14 Jun 2017", "title": "Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Global Health Corps in May 2017", "Interview Descriptions": "I applied online. After a month received an email that my application was short listed. I was sent an excel assignment to be completed. After that, I was sent another assignment to be completed before the  Skype interview. It was a 30 minute skype interview where they asked behavioral questions.", "Interview Questions": "Why GHC? Why this position? Scenario questions"}, {"date": "26 Apr 2017", "title": "Strategist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps (Kampala)", "Interview Descriptions": "oral and written interview at placement organization\r\nIt involved answering panel questions but also type out answers to a question on the computer.\r\nAssessment based on both oral and written interview done.", "Interview Questions": "strategic development"}, {"date": "10 Apr 2017", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Global Health Corps (New York, NY) in Apr 2017", "Interview Descriptions": "Applied in February via written application with supplemental recommendations. Was notified that I was a semi-finalist in March and had an interview with a current fellow several weeks after. Was notified that I was a finalist in April and had an interview with the specific organization to which I applied as a fellow one week later.", "Interview Questions": "What's something you're trying to improve about yourself as a worker and / or leader? How are you doing so? "}, {"date": "14 Feb 2020", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps (Lusaka, Lusaka) in Apr 2017", "Interview Descriptions": "Swift and transparent, multistage processes. The first stage involved motivation related questions and soft skills questions that would make an individual suitable for the fellowship. The recruiting team communicated adequately before the interview data, about three weeks before the interview and the panel was friendly.", "Interview Questions": "Why do you want to be a Global Health Corps Fellow? "}, {"date": "8 Jun 2017", "title": "Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Global Health Corps in Apr 2017", "Interview Descriptions": "My experience with this application process was a mess, taking place between Jan 17 when I first applied to May 26th. I was a semi-finalist for three positions, one of which I did not originally apply for but was told I was a fit and should submit a new essay. I did so, and during my interview call for this role, it was emphasized that I was not a good fit for it (something I figured would be the perception when I chose not to apply in the first place). I moved on as a finalist for one position, and then was told in late April I had the chance to take a second finalist spot, pending the submission of another essay. I submitted this within the two-day turnaround time allotted to me.\r\n\r\nPosition 1 - Surprise panel interview (in every interview I've ever had, I've been informed of who I would be speaking to ahead of time - at least number of people or roles), combined with spotty Skye (which happens), rushed and vague questions.\r\nPosition 2 - Didn't hear about an interview, despite being prompted to submit an essay to receive the finalist spot. Followed up twice and was informed in May that they could not offer me the role, not even having a chance to interview.\r\n\r\nThis was my second + last time applying for GHC and am eager to find other paths of making the impact that I want to have (ones that don't require navigating such a poorly run application process).", "Interview Questions": "Semi-finalist: If you went to a location in East Africa where a Peace Corps volunteer had recently left their position, and local peoples were not receptive to your arrival, what could be some of the factors that led to this?"}, {"date": "19 Apr 2018", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Global Health Corps (Lusaka, Lusaka) in Mar 2017", "Interview Descriptions": "Two interview steps, first with the GHC alumni and then second with the placement organization. The first interview has a lot of questions and lasted about an hour. Second interview was a little more intense, but had standard job  interview questions.", "Interview Questions": "Why do you want to be a GHC fellow? What are you values?"}, {"date": "27 Jan 2021", "title": "Fellowship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps in Mar 2017", "Interview Descriptions": "Interview process is super long. You have at least 2 interviews. The first is more informal and seems like a screening call. The second interview is with a host organization. I found the interviews to be nice, friendly, and straightforward. However, the process itself to let you know your application status was incredibly slow and frustrating.", "Interview Questions": "Give an example of good leadership.\n\n Scenario where you arrive to your site and have internet/electricity issues. What would you do to meet deadlines.   \n"}, {"date": "26 Jun 2020", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Health Corps in Mar 2017", "Interview Descriptions": "The interview process consisted of 3 Rounds. The first two rounds were with GHC current fellows and/or staff.  The last round was with the organization I had applied to be paired with during the fellowship. All were virtual and pretty standard questions.", "Interview Questions": "What is something you think you need to improve on?"}], [{"date": "28 Jun 2016", "title": "Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps (New York, NY)", "Interview Descriptions": "Interviewed as a semi-finalist in March for a position that was later cancelled, and then as a finalist in April for a different position entirely -- which I had not originally applied for. I was told I would hear back about that position within a week; I didn't hear anything until mid-June, when I emailed GHC asking for a status update and found out that I was on some sort of waitlist. I finally got a rejection email at the end of June, over 2 months from when I was promised a final decision. Overall, I'm leaving with a poor impression of GHC because (a) really terrible communication/notification (b) I got the sense that they're internally pretty disorganized (i.e. cancelling a position in the middle of the application cycle?!) (c) they don't really seem to be following the procedure outlined on the website, which strikes me as sketchy (i.e. I was named a finalist for something I didn't originally apply for; I've heard anecdotally of them pulling people off the waitlist to fill positions that they did not interview for). Will not reapply.", "Interview Questions": "What would you do if you got to work and there was no wifi?"}, {"date": "27 May 2016", "title": "Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Health Corps (New York, NY) in Mar 2016", "Interview Descriptions": "After submitting the application and references, I was selected as a semi-finalist for a position (I think they narrow it down to 10 for this stage). The interview was very little about the actual job, more about overall personality/experience/motivations and how you would handle certain challenging scenarios. \r\n\r\nPoint to note - they're not very good about getting back to you. I was told to expect an email or word of some sort in the next week, I didn't get one for almost two months (March interview, end of May email).", "Interview Questions": "Why are you interested in Healthcare equity/disparities?"}, {"date": "22 Mar 2017", "title": "GHC Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Global Health Corps (New York, NY) in Mar 2016", "Interview Descriptions": "4 question written application online. Semi-finalist interviews with current fellow or GHC staff with standard \"why do you want this job\", strengths/weaknesses questions and 2-3 situation based responses. Finalist interview with host organization.", "Interview Questions": "If you were asked for money for school fees by a patient, what would you do?"}, {"date": "10 Jun 2016", "title": "Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Global Health Corps (New York, NY) in Mar 2016", "Interview Descriptions": "Did two interviews, one in March and one in April. They constantly rescheduled interviews and the interviewers seemed distracted and only half listening to responses. Was informed that a response would come within a week for both interviews. The first one came after 2 weeks, the second didn't come at all despite constant inquiries. Definitely left a bad impression of GHC. It seems highly understaffed for the number of fellows they are attempting to recruit.", "Interview Questions": "What would you do if you couldn't get along with your co-fellow?"}, {"date": "9 Nov 2017", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Global Health Corps in Feb 2016", "Interview Descriptions": "I had a positive interview process with Global Health Corps. The questions were what I was expecting (i.e. describing my background, passion for global health, skills). The interviewer was friendly and readily answered my questions at the end of the interview. The process (timeline and communication) was very well managed.", "Interview Questions": "Describe one of your core beliefs or values "}, {"date": "17 Nov 2017", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Global Health Corps in Feb 2016", "Interview Descriptions": "After I submitted my application online, I was contacted a month or so later so say I was short listed for one of the three positions I applied to. The next step was a 30-60 minute phone call with someone in the GHC community (current fellow or alum). I interviewed with an alum and it was very simple. They asked about leadership experience and gave a few hypothetical questions. After that interview, I was contacted again that I was chosen as a finalist. The next interview is with your placement organization so this difficulty varies. I was offered this position about a week later. Due to having the opportunity to apply to multiple placements, the process becomes lengthy as some applicants get offers from more than one placement, and then in turn have about a week to decide before placements move onto the next applicant offer. So don't get discourage if you haven't heard back. A lengthy process, but worth the wait.", "Interview Questions": "Hypothetical question:\r\n\r\nAfter arriving in country, you get to your placement and after the first few days, your boss is no where to be found. What would you do/how would you handle this situation?"}, {"date": "17 Sept 2015", "title": "Global Fellow Recruitment Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Global Health Corps in Aug 2015", "Interview Descriptions": "The first step in the process was calling a staff member for a writing prompt that I had one hour to complete and send back via email. The second interview was a phone interview. I felt the interviewer, a senior member of staff, was very rushed and seemed extremely stressed. She did not give me the respect of taking the time to get to know me as a candidate. She dived straight into questions without any introduction or letting me introduce myself. Many of her questions seemed almost accusatory and repetitive and I felt she already did not think I was a fit for the role without delving into my experiences and intentions. Overall, it seemed like she was an inexperienced or at the very least an unprepared interviewer. It also sounded like she was multitasking in the background and not completely listening to my responses. The call only lasted about 15 minutes even though I felt I had more to tell her and more questions to ask. Followup was within a week as promised and was a very generic email saying that \"the team enjoyed getting to know me\" even though I only spoke with the one member of staff. Unfortunately, despite the great work that GHC does, the process left me with a negative impression of the organization. I have walked away from other interview processes without an offer but despite this an even better impression of the organization. In this case, I walked away with a bad taste in my mouth.", "Interview Questions": "Why do you want this position?"}, {"date": "17 Jun 2015", "title": "Finance Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Global Health Corps", "Interview Descriptions": "There was an initial 10-minute screening call, followed by an Excel test. The second interview, the only positive and engaging conversation I had, lasted approximately 40 minutes. Subsequent to that, an audit of their financial management system was assigned. Candidates were given almost a week to complete it (it was quite long and time-consuming). The final interview was with a member of senior management on Skype without video. She was half an hour late and seemed to be blaming me for not being available, but I was online well before the interview time and even emailed to say I was ready. When we spoke, I could hear her typing and clicking throughout the entire interview and she had to ask the same questions more than once. I found this very rude. \r\n\r\nI submitted my assignment within the next couple of days and did not hear from them for two weeks. I followed up to find out the status of the process and I received an email that was clearly generic and copied pasted saying I had not been selected. I politely responded asking them if they could extend me the courtesy of letting me know what skills they felt I lacked, and never got any response from them. I have interviewed many people before and at this stage of the process, I feel it is extremely unprofessional and inconsiderate not to respond and give the candidate some information that may be useful to him or her, after he/she dedicated so much time to them. They made a terrible impression on me.", "Interview Questions": "Tell me about something you did at work of which you are proud."}, {"date": "20 May 2015", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Global Health Corps", "Interview Descriptions": "The interview processes is basically in two stages. I was shortlisted as a semi-finalist after an initial written application. Up to ten semi-finalists are chosen for the first round of interviews and up to 5 finalists for the second interview. The first interview was a phone interview with GHC and the second was a panel interview with the placement organization.", "Interview Questions": "The questions were pretty standard, and were centered around getting to know the candidate. There were some behavioral questions (Tell us about a time when...) and some case questions (What would you do if you were in this situation). The semifinalist interview was a bit more technical.So it was either you've done the work before and could confidently answer or couldn't, skills and experiences are important. You have to know your stuff because It is highly competitive."}, {"date": "2 Apr 2015", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Global Health Corps (New York, NY) in Mar 2015", "Interview Descriptions": "Interview was pretty standard. The interviewer stayed objective and didn't offer and positive or negative comments. The interview lasted about 25 minutes. The most difficult question was talking about a mistake I made, and what I learned. I hadn't prepared for that question, but I talked about a negative experience and how I made it positive. I took some time answering that question, and the interviewer was patient. Overall, the interview questions were fair and difficulty was average. Be familiar with the Global Health Corps program and what they value. Their website is a great resource, so take time going through the different tabs.", "Interview Questions": "The interview questions were as follows:\r\n1) What is your motivation for applying to Global Health Corps?\r\n2) What skills do you have related to this position?\r\n3) Where do you see yourself in 5 years?\r\n4) Give an example of good leadership.\r\n5) Talk about a mistake you made and what you learned.\r\n6) What are some challenges you anticipate with this position?\r\n7) Scenario where you arrive to your site and find that your supervisor is gone indefinitely for sick leave. What would you do?"}], [{"date": "13 May 2015", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Global Health Corps (Denver, CO) in Mar 2015", "Interview Descriptions": "The first interview is a phone interview with GHC staff (typically 10 people are interviewed initially for each position. If they choose you as a finalist after this interview, the second interview (usually 3-5 people get a second interview for each position) is via skype or phone (for international positions) with the placement organization. Wait times after the initial interview can be up to two months.", "Interview Questions": "Describe a time when you saw someone demonstrate true leadership."}, {"date": "4 Jun 2015", "title": "GHC Fellow 2015-16 Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Health Corps in Mar 2015", "Interview Descriptions": "Shortly after receiving an email notification from GHC, I arranged a semi-finalist phone screening interview with two alumnae, both of whom were personable, easy-going and chatty. However, none of the recruiters ever notified me about the status of my candidacy following semi-finanist interview, in spite of persistent email inquiries.", "Interview Questions": "1) Describe a time when you encountered an issue at workplace - how did you resolve that conflict? 2) Tell us about your interest in global health. \r\nA couple of other questions related to candidates' work style preferences, personality etc. "}, {"date": "5 Apr 2015", "title": "Communications Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Global Health Corps (Telephone, TX) in Mar 2015", "Interview Descriptions": "The interview was about an hour long over the phone.  The interviewer was a former employee who had held the same position I was applying for.  The tone of the interview was conversational and unstructured- he would often speak at length about his own experiences instead of making it purely question-driven.  At times it felt more like a chat than an interview, which was a bit nerve-wracking because it made it hard to fit critical information in about my work experience.", "Interview Questions": "\"What would you do if you showed up to work and there was no supervisor?\""}, {"date": "29 Apr 2014", "title": "Research Analyst With Elizabeth Glaser Pediatric AIDS Foundation Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Global Health Corps", "Interview Descriptions": "After completing the online application, Global Health Corps contacted me about a month later to let me know I was a semi-finalist for the position that I had applied to, as well as another position nearby geographically with another organization that I had not applied to. The semi-finalist interview for both (two separate interviews) was with a  GHC alum. Many of the questions were standard - ie tell me about yourself, about your work history/experiences ,your motivation for applying to GHC. There were also two case questions: one about how you would scale up a public health program and one about what to do if you arrived at your placement and no one knew what to do with you/you had no supervisor. I provided a short answer for the second one and they probed me for more information.  I was offered a finalist interview which I did in person with one person at the organization and we were also joined by several others on the study team in various locations on the phone. They did not use behavioral questions or case studies here - mostly questions about my work history, specific research skills relevant to the job, experiences working within a team or as a leader, expected challenges in the position.", "Interview Questions": "If you were implementing the scale up of a public health program, what steps would you take to do so? What would your plan be? What would you do if you showed up to your placement and your supervisor was out sick indefinitely and no one knew who you were? Tell us about a time you disagreed with your boss and how you handled that. "}, {"date": "22 Nov 2014", "title": "Programs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Global Health Corps in Apr 2014", "Interview Descriptions": "I submitted a writing sample, cover letter, and resume.  A week later I got an email to schedule a phone interview, and a week after that I had an interview with the US Program Manager. the interview was about 30 minutes long, and was mostly about my resume, with a few questions like, 'why GHC?' or 'what are your goals for the summer?'  Nothing crazy.  I got a job offer within the week.", "Interview Questions": "N/A"}, {"date": "21 Feb 2018", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Health Corps in Mar 2014", "Interview Descriptions": "After written essays in the application you may get chosen to interview for specific positions. Generally, someone within the GHC community will interview you- current employee, previous employees, or previous GHC fellows. There may be an additional interview with the host company but not necessarily.", "Interview Questions": "Behavioral question- If you were helping your organization to roll out a successful program from site 1 to site 2, how would you go about this? What needs to be considered?"}, {"date": "11 Apr 2014", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Global Health Corps (Soroti) in Mar 2013", "Interview Descriptions": "The interview process was really tough having to pass through 3 stages", "Interview Questions": "What inspires you to be a Global Health Corps fellow"}]]