[[{"date": "9 Aug 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Calvin University", "Interview Descriptions": "First interviewed with an HR rep, who was friendly, transparent and informative. Was then invited to submit previous work to demonstrate communication skill level. Was then invited for a 2nd round interview in a group panel setting.", "Interview Questions": "How do you manage your workday, particularly when interruptions or unexpected delays happen? "}, {"date": "15 May 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Calvin University (Grand Rapids, MI) in Jan 2022", "Interview Descriptions": "It was a smooth interview process. The interviewer was straight forward and concise. The interview did not take too long and it was interesting. The interview took place at the Prince Conference Centre", "Interview Questions": "What were your qualifications for the position?"}, {"date": "5 Mar 2021", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Calvin University", "Interview Descriptions": "There is a individual interview with the Resident Directors (RDs) and then a group interview led by current/former Resident Assistants (RAs) with other applicants for the position. It is important to stay true to yourself, so that the interviewers can best place you on a team.", "Interview Questions": "Why do you want to be an RA?"}, {"date": "23 Jan 2023", "title": "IT Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Calvin University (Grand Rapids, MI) in Dec 2020", "Interview Descriptions": "Fantastic interview with my at the time boss and his supervisor. Welcoming and made me feel at home and not under pressure. Led me to walk out of one of the best interviews I ever had.", "Interview Questions": "How will you best serve a customer who is frustrated?"}, {"date": "16 Feb 2019", "title": "Building Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Calvin University (Grand Rapids, MI) in Aug 2017", "Interview Descriptions": "It was a meeting with all the lead building supervisors. It was pretty chill but you definitly want to be on your game. It was very apparent which supervisor i was going to work under but they didn't officially tell me where i'd be working till after the interview.", "Interview Questions": "Q: what does your faith bring to the table?"}, {"date": "12 Feb 2017", "title": "Engineering Department Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Calvin University", "Interview Descriptions": "Passing the class with a good grade is the interview process. A reference from the professor who  taught the class helps. In my first job, my professor asked me to conciser being his grader. In my second, I was hired for being the only volunteer.", "Interview Questions": "Would you like to be my ENGR 303 grader?"}, {"date": "9 Apr 2018", "title": "Orientation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Calvin University (Grand Rapids, MI) in Feb 2016", "Interview Descriptions": "The process is pretty extensive but it is meant to draw out your true and authentic  character and your ability to work well with others. The questions are meant to be exploratory on your ability to stand out and ability to live into the Calvin core values and virtues", "Interview Questions": "What has been the most challenging experiences you have encountered and how did you work to resolve that challenge"}, {"date": "15 May 2018", "title": "Dining Hall Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Calvin University (Grand Rapids, MI) in Jan 2016", "Interview Descriptions": "Straight forward, not much too it honestly. I just walked in, said I was interested in the Dining hall job and then they signed me up. They got me started on the paperwork and that was all, I was hired.", "Interview Questions": "How many hours do you want to work?"}, {"date": "14 Aug 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Calvin University", "Interview Descriptions": "standard interview process with submitting online application first and waiting 3-4 weeks to hear about a possible interview. Interview was with director and assistant as well as an assistant from another department.", "Interview Questions": "What is your favorite part of your job?"}, {"date": "21 Jul 2015", "title": "Human Resources Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Calvin University", "Interview Descriptions": "My first interview was a phone screen with the HR Department. This was a very basic 30 minute phone call asking about my qualifications. The second was a final interview about 2 hours long with 4 panel teams of 3-4 people. The second interview was very intense but it gave me a great idea of how the position was viewed across multiple departments at the College. It was also well organized- everyone had a list of questions they wanted to ask and a copy of my resume that they had obviously reviewed before speaking with me.", "Interview Questions": "Before we end this interview, what are the most important things about you that you would like us to remember? "}], [{"date": "18 Aug 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Calvin University (Grand Rapids, MI) in Apr 2015", "Interview Descriptions": "It was intense. There was an initial interview with a group of resident directors, then there was a second level mass group interview. The mass group interview was also very interactive as there were over 100 other applicants, We were all placed in groups and went from one room/station to another performing different tasks together and reacting to various staged situations as a group. Finally, the third round was a training round for those who made it.", "Interview Questions": "Give an instance of a conflict that occurred and how you handled the situation."}, {"date": "5 Feb 2017", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Calvin University (Grand Rapids, MI) in Sept 2013", "Interview Descriptions": "Brief interview asking about administrative experience and goals for working in the department.  Very conversational and friendly. I think they had narrowed down applicants already and were focused on finding a person who was a good personality fit with the current staff. Most questions were very basic interview questions for secretarial work (any office experience?, have you worked with people?, what is your typing speed? etc.) Very comfortable environment and friendly interviewers", "Interview Questions": "What experiences do you have working in an office environment?  "}, {"date": "1 Jun 2014", "title": "Director of Communications & Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Calvin University (Grand Rapids, MI) in May 2010", "Interview Descriptions": "Many phases of group interview by committee.  Truly academic in its approach.  Faculty governance and issue, though not unique.  New position had not been sold in conceptually.", "Interview Questions": "N/A"}]]