[[{"date": "28 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Desert Regional Medical Center", "Interview Descriptions": "To the point questions. They hold a lot of hiring events but for their med surg units. Very easy to get a job within those units. ER and L&D are hard.", "Interview Questions": "Why did you choose to be a nurse?"}, {"date": "24 Jan 2022", "title": "Phlebotomy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Desert Regional Medical Center", "Interview Descriptions": "It was over the phone. I got laid off from one of their locations so I was transferred to Desert Regional. So I was guaranteed the job. I just had to have a short conversation with management before starting this position.", "Interview Questions": "How fast I could draw patients"}, {"date": "4 Dec 2021", "title": "HIM Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Jun 2021", "Interview Descriptions": "Quick. Dress business casual. Bring copies of your resume and recommendation letters. Be early and smile through your mask. The interview was with a supervisor and another clerk. Ask questions about the position and what they will first expect of you your first weeks.", "Interview Questions": "Skills that can be used for the position\nWhat I know of the field I applied in\nWhy I was interested"}, {"date": "3 Jul 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Desert Regional Medical Center in Jan 2020", "Interview Descriptions": "Phone interview with recruiter twice, then scheduled panel interview in person. In person interview was very relaxed and felt natural. It was aimed more at a personality fit for the unit rather than behavioral questions.", "Interview Questions": "Why DRMC"}, {"date": "14 Aug 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Aug 2019", "Interview Descriptions": "Lasted  approximately 20-30 minutes. I was interviewed by a 2-person panel.  They were both nice,  friendly,  and down to earth.  They made me feel comfortable during my interview.", "Interview Questions": "Have you ever had a problem with another nurse that you were working with,  and if so,  how did you handle it?"}, {"date": "14 Jun 2019", "title": "Wound Care RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Jun 2019", "Interview Descriptions": "Shadowed and did on job training. Was able to meet other staff, get orientated to charting and where supplies were kept, and get a feel for the work flow.  Was able to see pros and cons.", "Interview Questions": "Do you work good independently?"}, {"date": "15 Mar 2018", "title": "Labor and Delivery RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Desert Regional Medical Center", "Interview Descriptions": "It took a while to get an interview, when I went to the interview it went very well.  I had a reference, so it went easier than expected. I did not end up getting the job offer due to other circumstances.", "Interview Questions": "what makes a good l&d nurse?"}, {"date": "16 Feb 2017", "title": "CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Jan 2017", "Interview Descriptions": "You go in meet with the hiring manager. They get to know you a little assessment your skills and layout the duties and functions. Ask for current license and current cpr. Really a enjoyable process.", "Interview Questions": "Describe what your scope of practice is/ was in the past jobs."}, {"date": "28 Apr 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Jan 2017", "Interview Descriptions": "After applying online and waiting a couple of weeks, I received a call from one of the recruiters. She advised me that I had not attached my transcripts. Once I attached the transcripts, I didn't hear from them again until I called them about 4-6 weeks later. After that, I was scheduled an immediate interview with the hiring manager. Things moved very quickly after my call to them. I telephone interviewed with the recruiter, then in person with the hiring manager. Offer was made four days later.", "Interview Questions": "Having just graduated from nursing school, would you have a problem taking direction from a nurse without a bachelor's degree? Would you feel confident enough to handle a procedure the way you were taught in school?"}, {"date": "10 Jan 2018", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Aug 2015", "Interview Descriptions": "I was interviewed by the Director and Assistant Director during a job fair. I was also interviewed by members of the outpatient wound clinic given that wound care was my second choice at that time. However, because I didn't have an acute care experience at that time, it was smarter to get a solid Medical-Surgical experience before moving to a different specialty. So I ended up being interviewed by the Director and Assistant Director of the unit where I am working now.", "Interview Questions": "Given that I was doing home health nursing prior to transitioning to acute care, they were interested to ask how I was going to adjust to the pace and also adjust to working interdependently with other health providers."}], [{"date": "15 Apr 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in May 2015", "Interview Descriptions": "Recruitment was hard to negotiate through.  Skype interview first.  In person with the team.  Then interviewed with some cross functional leaders (round table) at numerous times throughout 1 single day.", "Interview Questions": "Tell me about your experience supervising difficult employees"}, {"date": "17 Jul 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Jan 2015", "Interview Descriptions": "There was initially a phone interview with the C-level that I would report to eventually, then multiple panel interviews conducted with various directors and future staff, CEO interview, COO interview, CNO interview.\r\nA tour of my future department was offered as well.\r\nAfterwards, my recruiter took care of the salary negotiations and got me exactly what I asked for", "Interview Questions": "standard questions"}, {"date": "28 Jan 2016", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Feb 2012", "Interview Descriptions": "two weeks after first call then group then one to one then hr handeled paperwork then a start date with orientaion,3 months probation then you are hired permenantly,then elegible for benefits and other perks.", "Interview Questions": "how will improve our bottomline?"}, {"date": "27 Aug 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Desert Regional Medical Center (Palm Springs, CA) in Jan 2012", "Interview Descriptions": "thru travel  co      fill out application, send in required papers, wait for acceptance, job site, hours, pay, uniforms, call times, frequency, staffing, sick call, call backs, back up staffing, ceu credits available  phone, fill in paper work, type and color of uniforms,   are scrubs supplied, if not what color are they, do I purchase them or are they supplied.   separate lockers provided to staff with locking capability. break room with essential equipment to use when on call,   ie  refrigerator, microwave, sink, , cafeteria 24/7, security 24/7", "Interview Questions": "would I be able to work wkend call"}]]