[[{"date": "20 Feb 2018", "title": "CNA Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Wesley Healthcare in Feb 2018", "Interview Descriptions": "How do they drug test us? Do we do it soon as we get or they wait for the backgroend check. I currently work as a housekeeper and my job made us pay for it i dont get payed till next week and my drug test in 3 days? I wont have the funds.", "Interview Questions": "N/A"}, {"date": "19 May 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wesley Healthcare (Wichita, KS) in Dec 2017", "Interview Descriptions": "You are first contacted by a recruiter. Then the recruiter contacts the manager and you wait for the manager to call you for an interview. After that interview you then interview with other nurses.", "Interview Questions": "Why do you want to work in the er?"}, {"date": "8 May 2017", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wesley Healthcare", "Interview Descriptions": "not too bad, will get to know the management and employees through clinicals if you ever get there when you are in school. Whether it be in the nursing program or the respiratory program.", "Interview Questions": "What was the most difficult situation you ever experienced and what did you do"}, {"date": "12 Jan 2017", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wesley Healthcare in Jan 2017", "Interview Descriptions": "Very informative of what the job position requires and how the projects schedule will be. The interview also included a tour of the department that you will be working on and a small breakdown on where everything is. Afterwards, you wait for HR to get back with you to let you know if you were selected and if so you move on the background check process and drug test. Then you will be scheduled for orientation.", "Interview Questions": "My experience with the position I applied for."}, {"date": "24 Dec 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wesley Healthcare (New York, NY)", "Interview Descriptions": "Recruiters from out of state conduct a short phone interview. Be sure to ask which application they're responding to. If approved, you will advance to an in-person interview by the manager of the unit you're applying for.", "Interview Questions": "What have you learned from your previous experience in med/surg?"}, {"date": "29 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Wesley Healthcare (Wichita, KS) in Jun 2014", "Interview Descriptions": "I originally went through a recruiter that ultimately left me on the wayside after working with her (and waiting for positions) for over 3 weeks. She ended up saying \"sorry, we don't have anything for -you- specifically right now, re-apply in 3 months.\" \r\n\r\nInfuriated, I ended up visiting the hospital myself in person, meeting with all the unit managers face to face to request information and an interview with each. Bypassing HR, I got 3 interviews one after the other set for the same week.\r\n\r\nNote: if your recruiter is being difficult- bypass them completely, do your own research and travel to the unit/call the unit manager yourself and schedule your own interview. It took one day whereas the recruiter took nearly a month before blowing me off completely.", "Interview Questions": "If you were a tree, what kind would you be?"}, {"date": "6 Sept 2015", "title": "Hoste/Hostess Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Wesley Healthcare (Wichita, KS) in Mar 2014", "Interview Descriptions": "The interview consisted of questions regarding  my past work experience and the goals I looked to achieve in working for said company. Also if given other opportunities would I accept/not accept and why?", "Interview Questions": "How would I handle a difficulty situation with an patient or employee."}, {"date": "8 Jan 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wesley Healthcare (Wichita, KS) in Jan 2014", "Interview Descriptions": "It was bit difficult to obtain an interview but once I did it was great.  I was interviewed by 2 charge nurses and the nurse manager.  Very professional and standard.", "Interview Questions": "Why I wanted to be a Labor and Delivery nurse?"}, {"date": "15 Jan 2014", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wesley Healthcare (Wichita, KS) in Aug 2013", "Interview Descriptions": "Difficult and cumbersome. The nurse recruiter is rude and may or may not get back with you.", "Interview Questions": "what kind of fruit would you like to be?"}, {"date": "22 Jul 2016", "title": "Executive Director RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wesley Healthcare (Wichita, KS) in Jun 2012", "Interview Descriptions": "Director and manager were both present. The Director did most of the talking. Most of it was standard interview stuff. It seemed important to be comfortable and confident without thinking you know it all.", "Interview Questions": "What do you check first in a child with a broken arm?"}], [{"date": "10 May 2011", "title": "Ultrasound Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Wesley Healthcare (Wichita, KS) in Apr 2011", "Interview Descriptions": "I applied online march 30, 2011 for an ultrasound job for Heartland womens clnic.  I reapplied as I received no response. I then called an was told I would be contacted. Never was. I then called the office offering the job. I was told I would be called the week. No call no email. I then noticed job no longer online. I found out by a a wesley friend that job had been filled. I received nothing from hr. No email no phone call saying job had filled thank you for your interest. Very frustrating.", "Interview Questions": "N/A"}, {"date": "14 Dec 2013", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Wesley Healthcare (Wichita, KS) in Dec 2009", "Interview Descriptions": "Initially you will be required to interview with a HR nurse recruiter. For the most part these are RN's that know their stuff. During this interview you are asked the normal strengths and weaknesses questions and also have to complete a personality test. After the initial interview you will also be required to pass a drug test. At that point you will be interviewed either by the unit manager or a panel interview with manager director and sometimes a unit supervisor. Offers are usually given at that time unless they are interviewing multiple people for the same position.", "Interview Questions": "General nursing questions are asked. There was not much unexpected."}]]