[[{"date": "18 Jan 2023", "title": "Guest Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "Easy, just asks you scenario questions and how you will handle it. Asks you basic interview questions like strength and weaknesses. Just be yourself, it’s just an office desk job answering phone calls and client questions.", "Interview Questions": "Where I used to work and how that can contribute to the new job here."}, {"date": "7 Oct 2022", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "Lots of meetings with key players, if you come to campus you will likely conduct a class or part of a class for the students. There are also opportunities to meet faculty within your department. The campus is beautiful. I recommend taking a tour while on your interview.", "Interview Questions": "N/A"}, {"date": "7 Sept 2022", "title": "Admissions Processing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of North Florida", "Interview Descriptions": "The interview process began first with a phone call and then a zoom interview. It was a relatively quick process and the questions mostly related to organization and managing multiple responsibilities. ", "Interview Questions": "How do you approach our tasks in terms of importance? "}, {"date": "16 Jun 2021", "title": "Library Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "Easy interview. I got the job. Two people interviewed me and it wasn't too bad. I had no experience in the library only working service jobs but it turned out well.", "Interview Questions": "What animal would you be"}, {"date": "24 Jan 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "Your sat down in conference room where you'll be waiting to be called into a separate conference room and then will answer scenario questions. Answers are variable and open to interpretation.", "Interview Questions": "How would you respond to a roommate conflict?"}, {"date": "16 Dec 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "It was a very fair interview process, I spoke to multiple professors to see what their research was in and if it aligned with my interests. I had options as to what route I should go.", "Interview Questions": "What topics are you interested in?"}, {"date": "9 Aug 2021", "title": "TEACHERS ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of North Florida (Jacksonville, FL) in Dec 2020", "Interview Descriptions": "Very easy and straight forward when working with professors you know. The process is more dependent upon the professor and class you are trying to be TA for. In some cases you aren't competing against anyone else and just have to go through the hiring process.", "Interview Questions": "Q: How well did you understand the content from the class when you took?\nQ: What was your grade in the class?"}, {"date": "9 Jan 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of North Florida (Jacksonville, FL) in Nov 2020", "Interview Descriptions": "It was a thirty minute zoom call between myself and a panel of three interviewers. They first introduced themselves, and after asking for my background, asked situational questions. Overall, it wasn't a bad experience and the interviewers were were friendly and welcoming.", "Interview Questions": "Tell me about a time where you had to make a difficult ethical decision?"}, {"date": "24 Aug 2020", "title": "Receiving Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "pretty easy the do a phone call and in-person interview. depending on the job you will sit down with one or all the supervisors. they will all ask questions and if they like you you'll get hired. there isn't much else after that they will just give you a call if you get the job a couple of days after the interview and give you your uniform about a week after that", "Interview Questions": "PRIOR EXPERIENCE?\nwhat are your skills?"}, {"date": "17 Mar 2022", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of North Florida (Jacksonville, FL) in Jun 2020", "Interview Descriptions": "Virtual interview, the people were very nice and easy to talk to. Easy access to interview and the team wanted to get to know you better, asked questions about why you would be a good fit and why you want to help students.", "Interview Questions": "N/A"}], [{"date": "6 May 2020", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of North Florida", "Interview Descriptions": "I submitted a resume, received a call, then scheduled the interview.  As with other applications and interviews, I received no feedback, or response.  I have found this to be a persistent problem with online job searches.  Notices of available jobs and expressed interest more than not, companies do not give feedback.  I've learned that often posted jobs or potential employers  can receive over 50 applications and initial selection is based on key words found on a resume or letter that have been sorted by a computer system.  UNF jobs are better at responding, but still not great.", "Interview Questions": "Q.  What interest you about this job?"}, {"date": "10 Sept 2021", "title": "Admissions Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of North Florida in May 2020", "Interview Descriptions": "After making it through multiple rounds of interviews, the two women who interviewed me did not reach out to tell me that they were going with a different candidate for over two weeks.", "Interview Questions": "How do you measure your growth or success in a role?"}, {"date": "5 Jul 2022", "title": "General Merchandise Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of North Florida (Jacksonville, FL) in Aug 2018", "Interview Descriptions": "This was a interview for the bookstore, it was a group interview, very laid back was hired on spot after answering questions to the best of my ability. The questions they ask are typical job interview questions.", "Interview Questions": "What is one of the biggest challenges you've had & how did you overcome it."}, {"date": "23 Jan 2018", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "A very long day but pretty typical. You'll meet and spend time with everyone including staff although in the end it's all a waste of time. The dean will decide and staff input is of no relevance whatsoever.", "Interview Questions": "This depends entirely on the type of position you're applying for."}, {"date": "28 Nov 2017", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of North Florida (Jacksonville, FL) in Nov 2017", "Interview Descriptions": "The process was straight forward and relatively easy by event management/coordination industry standards. However, their system on how they interview and select candidates is quite antiquated. It does not allow for candidates to interview via phone/video conference. I find it completely unprofessional and archaic that they require a candidate to have to come from out-of-state to UNF for an in-person interview.  Not all candidates have the flexibility in time or money to drop what they are doing to fly across the country for a possibility.", "Interview Questions": "Do you have experience with working with external event rentals? "}, {"date": "14 May 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of North Florida (Jacksonville, FL) in Jan 2017", "Interview Descriptions": "It was simple, brief, to the point and not stressful. It was a very friendly interview. The interviewer asked questions that were practical and related to the job. It was not the usual questions asked by people but it was practical and suitable for the job.", "Interview Questions": "Why apply for this job?"}, {"date": "9 Mar 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of North Florida (Jacksonville, FL) in Dec 2016", "Interview Descriptions": "I interviewed with the Regional Director and the Director of Marketing who had a list of prepared questions. Neither interviewer was friendly or welcoming - the Director of Marketing was actually unfriendly - never smiled, just took notes and made a snarky remark about project management skills.", "Interview Questions": "What two qualities are most important in this role?"}, {"date": "1 Mar 2016", "title": "Senior Library Services Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of North Florida (Jacksonville, FL) in Jan 2016", "Interview Descriptions": "Applied online on their website, got a call to interview two months later. Interviewed two weeks after that, but to this day still have not received an answer on employment. I have moved on and now have employment, but their process has been very slow and it's insulting to not follow up on interviewees. Lack of respect on their part.", "Interview Questions": "How have you handled irate patrons?\r\nWhat are some research methods that you typically use?\r\nExplain how your past experience qualifies you for this position."}, {"date": "18 Feb 2017", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of North Florida (Jacksonville, FL) in Jan 2016", "Interview Descriptions": "There wasn't much of a true process as I was a student and did well in the class. After that I inquired on how one becomes a teaching assistant. I then spoke to the professor and was told that I would be contacted by the HQ person who handles the registration process etc.", "Interview Questions": "No specific question, it had more to do with scheduling and availability."}, {"date": "3 Dec 2015", "title": "Director, Student Affairs Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of North Florida (Jacksonville, FL) in Nov 2015", "Interview Descriptions": "I first had a video interview with the search committee. They took turns asking pre-written questions. I was invited to campus for a day-long interview with more than 20 people from a variety of departments. \r\n\r\nI was offered the job within a few days of the campus interview, but I ultimately did not accept the job because the offer was well below the average for student affairs directors at this university and peer institutions. \r\n\r\nState employee salaries are available online via various state-operate websites. You should definitely research these sites before entering the offer negotiation phase.\r\n\r\nIt's a beautiful campus in a great part of Jacksonville, but I believe UNF's enrollment fell by about 10 percent over the last few years, and it still remains a commuter school. Commuter schools are often subjected to vast fluctuations in enrollment as students transfer, move away or drop out.", "Interview Questions": "How do you handle conflicts when they arise?"}], [{"date": "23 Aug 2015", "title": "Coordinator, Academic Support Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of North Florida (Jacksonville, FL)", "Interview Descriptions": "First an individual has a phone interview and based on that they are then invited on to campus for a face to face group interview. Usually if you are asked to come on campus you are one of 2 or 3 people they are interested in interviewing for the job", "Interview Questions": "name a time where you had to overcome a stressful situation what did you do and what was the result"}, {"date": "14 Mar 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of North Florida (Jacksonville, FL) in Mar 2015", "Interview Descriptions": "On campus interview runs from morning to the afternoon. Met with the search committee, department chair, college deans and a few students. The campus is just beautiful, and all the people I've met were very nice too. It feels like a friendly community, where professors really care about their students, and the department chair is very supportive and protective towards the faculty members. Interview was a bit challenge yet very much practical for applicants to get a clear idea about what to expect at the position.", "Interview Questions": "Have you identified any potential collaborator within or outside the university for your future research?"}, {"date": "29 Oct 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of North Florida (Jacksonville, FL) in Jan 2015", "Interview Descriptions": "It was pretty easy. I got a phone interview before even making to United States of America where we talked about my previous achievements. After the interview I was invited to a conference to have a face to face meeting.", "Interview Questions": "How many publications have you had in the past?"}, {"date": "2 Jun 2017", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Florida (Jacksonville, FL) in Jan 2015", "Interview Descriptions": "They take you out to lunch and get to know you which is nice. The interview is no to bad make sure to bring your presentation. They also will talk salary because you can negotiate up to 5 percent.", "Interview Questions": "Tell us about your ID experience?"}, {"date": "21 Jul 2017", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of North Florida (Jacksonville, FL) in Jan 2015", "Interview Descriptions": "lengthy but to the point.  It is nothing to lose any sleep over.  It is very standard and to the point. In the end they want someone qualified for the least amount of money.", "Interview Questions": "standard questions. Why are you interested in the job."}, {"date": "14 Nov 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of North Florida in Aug 2014", "Interview Descriptions": "Online application followed by over the phone interview finished with an in house interview. Long interview process that lasted a few weeks it could have actually taken a few months, it's hard to remember.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "12 Jun 2014", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of North Florida (Jacksonville, FL)", "Interview Descriptions": "I was called by the Director of Office of Educational Field Experiences, we set the time of the interview, we met, and she called me within 24 hours to offer me the position.", "Interview Questions": "N/A"}, {"date": "24 Sept 2014", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of North Florida in Apr 2014", "Interview Descriptions": "Emailed Resume and received a call within a few days for a interview, they were very accommodating ,and offered a  Skype interview due to my distance.The interview was a two person panel very nice people, and the interview was basic interview question about yourself , and what your could offer.", "Interview Questions": "nothing was really difficult of unexpected but I just hate answering the question of tell me your best qualities about yourself. "}, {"date": "6 Feb 2014", "title": "Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of North Florida", "Interview Descriptions": "Group interviews", "Interview Questions": "Who is your personal hero?"}, {"date": "11 Nov 2015", "title": "Academic Grader & Class Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of North Florida (Jacksonville, FL) in Aug 2013", "Interview Descriptions": "There was no interview.  I spoke to the head of the Department of Mathematics & Statistics (Dr Scott Hochwald) about what help their professors needed in the beginning of each semester.  He immediately pulled up open grading and proctoring positions on his computer, and we then matched those with classes I had previously taken.", "Interview Questions": "What classes I had taken (and passed)."}], [{"date": "29 Jul 2013", "title": "Associate Professor In School of Engineering Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at University of North Florida", "Interview Descriptions": "For every faculty position there were over 100 applicants. But, the hiring is usually manipulated, and the applicants with background weak or even none in the relevant fields were hired over the qualified candidates. The former director messed up with race discrimination in hiring, which led the EOP director change. Now the School of Engineering faculty gang made hired a director from Turkey, who just openly discriminated without consequence.", "Interview Questions": "N/A"}, {"date": "2 Nov 2017", "title": "Associate General Counsel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of North Florida (Jacksonville, FL) in Apr 2013", "Interview Descriptions": "began with phone interview, subsequently interviewed by multiple persons representing wide range of work areas and perspectives, then by general counsel, CFO,  and University president.; background and professional checks", "Interview Questions": "why I was interested in moving from the private sector to the public sector"}, {"date": "21 Nov 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of North Florida (Jacksonville, FL) in Apr 2013", "Interview Descriptions": "Faculty positions require a day-long interview if you make a good impression via a Skype interview with the Search Committee. You will have a chance to meet all of the faculty of the department (that can show up) and they can ask you questions. The most formal part of the interview for faculty is actually doing a lecture on a topic in your field that faculty may attend. If you know your stuff, there's no need to sweat it. They hire nationally, so they will fly you into Jacksonville if you're a good candidate.", "Interview Questions": "Describe our curriculum in detail and how you would break this information down for students."}, {"date": "10 Aug 2015", "title": "Executive Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of North Florida in Jan 2013", "Interview Descriptions": "Applied online called back 4 months later.  Then was brought in for a group interview.  They contacted my references about a week later and then took about a week for them to make an offer", "Interview Questions": "How would you prioritize multiple projects.  How have you handled a difficult customer or situation in the past"}, {"date": "13 Aug 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of North Florida (Jacksonville, FL) in May 2012", "Interview Descriptions": "Two people asked questions, half an hour interview, found out within the week. also you have to go through a series of group puzzles where you try to figure out how to solve a problem in a group and they watch you and take notes of who is a leader.", "Interview Questions": "what to do in certain situations, what you plan on doing for group activities. basic easy questions."}, {"date": "13 Apr 2015", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of North Florida (Jacksonville, FL) in Nov 2011", "Interview Descriptions": "Extremely easy 25 minute interview.  Very little questioning concerning experience or description of job requirements.  Very casual interview environment.  Impression that the interviewer had not reviewed my resume.  Struggling to find questions to ask applicant.", "Interview Questions": "Why have you applied ?  Do you have any problems saying \"no\" to the requisitioner ?"}, {"date": "8 Feb 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at University of North Florida (Jacksonville, FL) in Mar 2011", "Interview Descriptions": "Before being asked for an on-site interview, they asked all semi-finalists to prepare a plan for recruiting students in Florida.       I spent a lot of time on it and they liked it enough to fly me there.   When I got there I found that the thoughtful planning I thought was a strength of the school was just a marketing/selecting cover for the fact that they were not an academically oriented school, but an old school boys club.  Instead of talking about classroom subject matter and students, they wanted to talk about pro sports.  Fun, but irrelevant to me, a scholar.  After we were there together for an hour it was obvious we were not a good fit, so they actually ignored me.  I later got a much better job elsewhere (pay, status, location, teaching environment), but never forgot the lesson that schools vary enormously in their level of serious approach to our work.", "Interview Questions": "You're from PA--Steelers or Eagles?"}, {"date": "11 Feb 2013", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of North Florida (Jacksonville, FL) in Dec 2009", "Interview Descriptions": "They will call you for a quick, get-to-know-you type of phone call once you've made it past the Human Resources office. They will ask what makes you a good fit for the role and why you want to be a part of the community. You'll be asked about your background and how you plan to grow in the role here. The next phase is a group interview. Similar questions are asked, but they are derived from a sheet given out by HR so each candidate is asked the same question. The answers are scored and then deliberated on. Final decision made by director, and is not a group consensus but input is received from everyone on the panel", "Interview Questions": "They will give you scenarios in how to handle various problems. All having to do with human interaction."}, {"date": "4 Sept 2013", "title": "Director of Annual Giving, Coggin School of Business Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Florida (Jacksonville, FL) in Apr 2009", "Interview Descriptions": "Everyone must apply online. First round of interviews is by phone with a committee. None of the panel members has any role in the actual job in which you'll be working. Most have equivalent jobs in other schools at the college.  Each person shoots a question at you. These are my least favorite type of interview because it is more of an interrogation than a conversation.", "Interview Questions": "I think they asked for an example of how I screwed up something and what I did to make it right."}, {"date": "20 May 2009", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at University of North Florida (Jacksonville, FL) in Dec 2008", "Interview Descriptions": "i had 2 interviews a phone interview with 3 person then a panel interview with 6 persons. they were more focused on my skills  and personality. also having cheked them out myself was a plus", "Interview Questions": "tell me about a time when you were required to make a decision that could have had a potential negative outcomes. how did you make this decision?"}], [{"date": "24 Sept 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of North Florida (Jacksonville, FL) in Jul 2008", "Interview Descriptions": "I took a class with a professor and did well. I knew that a major research effort was about to start, and that that professor would be leading it, so at the end of the semester I asked if there would be any positions opening up. I came in with a resume a few days later, and after an immediate interview I was offered a position.", "Interview Questions": "What do you think you can contribute to the project?"}]]