[[{"date": "24 Jun 2023", "title": "Press Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "1 stage - task and questions - excellent culture. Very Friendly and put at ease. Great panel. Would happily interview again. Really good feedback. Great experience and given really useful guidance for next time", "Interview Questions": "N/A"}, {"date": "2 Feb 2023", "title": "Sustainability Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Took a while but the interview was enjoyable. Informal chat followed by preprepared questions. There was also a task to prepare for. There was a tour of the facility followed by a chat with HR.", "Interview Questions": "what challenges have you overcome"}, {"date": "14 Jan 2023", "title": "Supporter Experience Manager (UK) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Wildlife Fund (Woking, England) in Nov 2022", "Interview Descriptions": "Applied online, 3 weeks later I got an invitation to their Woking office (no recruiter/HR called before that). I was offered a few time slots to choose from, all on the same day. There was a task in the email: make a presentation about the ideal future strategy of supporter experience and how to have a strong voice within WWF. I did the presentation in person for a panel of 3 managers/dept.heads (no HR), in a relaxed atmosphere, although it felt they were not very experienced interviewers (read all questions word by word from a paper). They seemingly liked my ideas and recommendations, took a lot of notes and then they moved to competency-based questions, but many of those could not really be expected from what was included in the job description. After almost 2 hours I was let go and I have never heard from them again (this was 2 months ago). Their only email came from a no-reply address, so I could not even follow-up. I think it is very unprofessional to ghost candidates who prepared for their presentations for days, took a day off work and travelled to the WWF office.", "Interview Questions": "Tell me about a time when you had to solve a problem by using science."}, {"date": "27 Dec 2022", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at World Wildlife Fund in Oct 2022", "Interview Descriptions": "The hiring process was going to be a two stage interview process and this was made clear at the start of the first interview (following successful shortlisting via applications). The first interview went reasonable well with the panel attentive and friendly. I the received an email to say I had not been successful at this stage. This was then followed by an email later on the week that I was invited to a second stage interview. I clarified this with the recruitment team and then arranged a time for the 2nd interview. My task was to prepare a presentation for the panel. The panel at the second stage were uninterested and generally the experience was cold compared to the panel at the first stage. I did not hear anything following the interview. After a couple of weeks I chased up with the recruitment team- and I got no response. After over a month I finally received an automated message to inform me that I had been unsuccessful and not shortlisted for the next stage. I was not aware of a third stage! I was really disappointed that after the time devoted to preparing for the interviews and task I was completely blanked and not given an opportunity to even ask for feedback. Very negative experience and I will not be applying to future roles at WWF due to this.", "Interview Questions": "Experience of managing stakeholders and projects"}, {"date": "15 Aug 2022", "title": "Artists and Influencers Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Disorganised planning of interview with broken systems. No one responding when I asked for help or clarification. Interviewer seemed disinterested and like she was barely listening to my responses. The questions were basic and it seemed like they wanted to cut it short from the minute I hopped on the video call. No feedback was given.", "Interview Questions": "Why do you want to work for WWF?"}, {"date": "30 May 2022", "title": "Partnerships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Interview process was too impersonal, maybe being online deterred the human element and personality from showing. Thus, couldn't feel connection with the interview panel, which made me feel the job will be too cold and I might not enjoy going to it everyday.", "Interview Questions": "Hypothetical scenarios and technical questions"}, {"date": "18 Nov 2022", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Woking, England) in Feb 2022", "Interview Descriptions": "Applied via the WWF website on their online job application form and made it through to the first interview. The interview was held over Zoom with two members of the team.", "Interview Questions": "How would I extent WWF's reach on Tik Tok."}, {"date": "7 Feb 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (London, England) in Jul 2021", "Interview Descriptions": "Open Questions that offer space to start a dialogue for the first round. Second round you are asked to prepare something specifically tailored to your role to showcase your experience.", "Interview Questions": "How would you engage with Stakeholders? \r\nHow would you manage tight deadlines? \r\n"}, {"date": "6 Jun 2021", "title": "Support Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "Online via zoom with two people interviewing. Was friendly and was more like a chatty conversation. Applied online and then heard the outcome with a telephone interview. Was a quick process.", "Interview Questions": "Why do you want to work here"}, {"date": "17 Feb 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (London, England)", "Interview Descriptions": "Unfortunately this is one of the worst hiring experiences I have had. They took over a month to send an automated email inviting me for an interview. The message had several errors stating it was my 2nd interview when it was my first, saying I would get a zoom link 48 hours before and asking me to prepare a presentation with a very vague one line title. I'm lucky I checked the platform an noted this presentation request as the email had no mention of it. They should really make it more clear.\r\n\r\nI didn't receive any zoom link up until the day of my interview and rang, emailed recruitment several times. They did not respond all morning nor to the email I had sent a week before and only phoned me up 5 minutes into my supposed interview to say they couldn't find the link. 15 minutes and another phone call later they found it and got it to me. So I ofcourse entered my interview late. If I had not rang them so many times, I would have missed out on my interview. The interviewer apologised and said they were switching HR systems which was why that happened. I was only asked 6 very basic questions. There were two interviewers (despite my email saying I was speaking to one). This other individual had an angry face the entire interview and was fairly short in her communication. There seemed to be tension in the air.\r\n\r\nI gave my presentation to which they had no feedback apart from saying they liked it and highlighting an idea they liked in particular and thought would be good to implement. When I asked about the timeline of when I should expect to hear back (as I was ofcourse job searching and was expecting another offer but I let them know this role at WWF was my preferred role) they were quite guarded about it and said likely 2 weeks but if I wanted to withdraw I should email them. I told them I had no intention to withdraw as I loved the sound of the job, I just wondered if they had a timeline. I found this quite defeatist and any other interviewer I have asked for a timeline has always been more forthcoming, often even saying to let them know if I needed an answer sooner and they'd try if possible. The interview was then ended. I never heard back from them despite and saw they marked me as unsuccessful on the recruitment platform without giving me any notification or feedback. After following up they told me this was again due to their HR system.\r\n\r\nThe process was a complete mess and I came out feeling short changed by them making me late to the interview which ofcourse threw me off a little. For a charity, I really did not get a good vibe or that they care very much about staff. It is really sad to treat potential employees this way particularly when the job market is harder than usual during the pandemic. From other Glassdoor reviews it seems clear ghosting is common for them and they're not particularly good with potential hires. So I hope if this happens to you, atleast know not to take it personally. Part of making the planet a better place is being pleasant to others and efficient - two things they fell very short on.", "Interview Questions": "Name a time you dealt with conflict.\r\nWhat is a strength and a weakness of yours?\r\nWhat do you think the biggest challenge of the role will be?"}], [{"date": "22 Mar 2021", "title": "Head of Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Feb 2021", "Interview Descriptions": "5 stages-app form, letter, phone screen, panel, 1-2-1\r\nIncluded a presentation on what I could bring to the role and how I would be successful in role. \r\nPresentation was formal with excellent questioning and engaging interaction", "Interview Questions": "How could they help me to be successful in role "}, {"date": "29 Oct 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "The job application was completed online by registering via WWF job portal. After submitting my application, I received an email response within a reasonable time frame, with further instructions about the interview process.", "Interview Questions": "Behavioural-based questions, e.g. Give me an example of a time you faced a conflict while working on a team. How did you handle that?"}, {"date": "29 Oct 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Wildlife Fund (London, England) in Mar 2019", "Interview Descriptions": "You will submit an online Application on WWF's website, Shortlisting, Interview, Panel Interview, Final Interview.\r\n\r\nThere is no need to go through a recruiter.  WWF has a very good system, which allows anyone to be part of the organization if you have an environmental degree that is plus.", "Interview Questions": "What do you can tell us about WWF"}, {"date": "23 Mar 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund in Jan 2019", "Interview Descriptions": "Two competency based interviews. First round was great, more conversational I left feeling I could work with them. Second was less positive, the panel were 20 mins late and the interview was much more aggressive not a conversation I didn’t leave wanting to work with them or think I would be offered, so it felt like they had wasted my time to fill up the short list.", "Interview Questions": "What is the difference between leading and managing."}, {"date": "14 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund in Aug 2018", "Interview Descriptions": "Simple and friendly \r\nEasy stages \r\nResponded to quickly \r\nInviting atmosphere \r\nFriendly panel \r\nGood questions \r\nNice to visit the office \r\nStages were clear cut \r\nPhone call offer nice and personal \r\nThey knew a lot about me before I went\r\nClear and concise questions", "Interview Questions": "Why I am suited to the role "}, {"date": "15 Oct 2022", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Wildlife Fund (Woking, England) in Jan 2018", "Interview Descriptions": "4 Rounds: First with hiring manager Second, task based presentation on what your aspirations with the role are Third, informal coffee meet with the head of brand Fourth, final interview with the director of the communications department", "Interview Questions": "Why are you the right candidate for the role?"}, {"date": "12 Oct 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Woking, England) in Sept 2017", "Interview Descriptions": "Short presentation with follow up questions and broader questions regarding myself and WWF missions. Specific questions on my opinion on issues relating to the role. \r\n\r\nI appreciated the opportunity for an interview but the process was incredibly time consuming - one to keep on the back burner.", "Interview Questions": "Give us a presentation to convince two climate change denialists (interviewers) that climate change is real and why it matters.\r\n\r\nThink of something funny that has happened to you"}, {"date": "4 Sept 2017", "title": "Media Advocacy Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Woking, England) in Aug 2017", "Interview Descriptions": "The interview lasted around 45-60 minutes. The interviewers were really lovely and responsive and said they'd get back to me within a week. Two weeks went by and I received no emails. I messaged HR and got a template email which they didn't even insert my name or the job position into. I was really disappointed that they failed to even reject me kindly despite everyone at the building being extremely welcoming and kind. The email has really left a bad taste in my mouth.", "Interview Questions": "What attributed would team members within the communications department need to have aside from team skills?"}, {"date": "13 Aug 2019", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at World Wildlife Fund (Woking, England) in Jul 2017", "Interview Descriptions": "I heard back from my application within 2 weeks (though this was a particularly quick recruitment) and attended an interview in person. I was asked to prepare a technical presentation and was asked mainly competency based questions. Three interviewers, two from the team and one as objective interviewer. I also met a team member before the interview for a tour and informal chat which was also part of the interview (though not explicitly so). Received a decision within a couple of days. Salary wasn't negotiable.", "Interview Questions": "Tell me about a time you had to manage competing assignments"}, {"date": "9 Feb 2017", "title": "Media Advocacy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at World Wildlife Fund (Woking, England) in Oct 2016", "Interview Descriptions": "The interview process was very thorough 2 step interview. The first consisted of an introductory set of questions about my background, which were then followed competency based questions about how I would react to certain situations. My answers were based on my previous work experience and what I knew about the communications industry. \r\n\r\nI then had to do an hour long written test, where I read a detailed report on an environmental project before producing a press release. \r\n\r\nI was then invited back for the second and final round of interviews shortly afterwards. For the second round I had to prepare a presentation, which looked at an environmental situation and how I would go about trying to influence the key players via the media. The presentation was 5 minutes long and was followed by the same sort of competency questioning that happened during the first interview. \r\n\r\nThe whole process was very positive, although I found my prospective boss (who was there during the second round of interviewing) to be dismissive and quite rude (an interview tactic no doubt)", "Interview Questions": "How would you react if you were on call and a journalist was asking about financial mismanagement at the WWF. They were going to release a story the following day and were looking for someone to comment from your organisation. There is no one senior available and you can't get hold of any of your team. What do you do?"}], [{"date": "4 Jul 2016", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Woking, England) in Jun 2016", "Interview Descriptions": "The initial online application is incredibly comprehensive. They provided a timescale as to when they'd make a decision and when the interviews would take place, which they honoured. I was called to a face to face interview within a few weeks of my application. I've always wanted to work for the WWF and was really excited. I put a lot of thought in to my application and spent a long time preparing for the face to face interview.\r\n\r\nThe interviewers had scripted interview questions which they did not deviate from, presumably to ensure all candidates experience the same interview. All the interviewers seemed incredibly bored throughout the entire process. At the end of the interview I was informed a decision would be made and I would be notified within one week.\r\n\r\nMy interview ran from 9am - 10 am. When I left the interview, I checked my phone and noted receipt of an automatically generated email at 9.32am confirming my unsuitability for the role. The email also confirmed that due to the large volume of applicants, they couldn't provide specific feedback. \r\n\r\nI'm really not sure why they wasted my time and theirs by interviewing me. I'd have been less offended with a straight out rejection. My interview felt like a box-ticking exercise to demonstrate their own compliance with their recruitment process but have left me feeling they have showed a lack of professional courtesy.", "Interview Questions": "The questions were all scripted - tell us why you want to work for the WWF, how do you manage competing demands on your time."}, {"date": "18 May 2016", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Woking, England)", "Interview Descriptions": "The window for job applications was short - only 2 weeks.  I submitted my application with a week to spare and was then emailed the day after the applications closed to ask me to come along to an interview.  The interviews were the following week and you could use the online system to choose a time of day that suited you for the interview.\r\nI was told ahead of time that I needed to give a 5-minute presentation on a topical and controversial wildlife conservation issue that they had specified.\r\nThe interview itself went well.  There were three members of staff interviewing me, including the direct line manager, her manager, and a manager that works closely with them in a different department.  They were all very friendly and nice and put me at ease from the beginning.\r\nWe started off with my 5-min presentation and I then had to answer some technical questions about the topic of the presentation afterwards.\r\nFollowing that, I was asked some more in-depth questions about my specific skills and experience related to the job, and how I would fit into the role and use this experience to benefit the organisation.\r\nThe interview lasted approximately 1 hour, including a few questions that I asked at the end.\r\nThe line manager then called me up a few hours later and offered me the job!", "Interview Questions": "Specific questions related to the presentation\r\nWhy I applied for the role\r\nWhy I think I'd be good at the role\r\nProject management experience\r\nMedia experience\r\nDealing with stakeholder conflict"}, {"date": "16 Mar 2016", "title": "Technical Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Wildlife Fund (Woking, England) in Mar 2016", "Interview Descriptions": "This job was based in the U.K. The application process had positives and negatives.\r\nI'll start with the negatives: The application process took a really long time - I didn't hear that I had been offered an interview until three weeks after the application deadline had passed.  I was notified of the interview two weeks before the interview date, but wasn't told the outcome of the interview until a week after the interview had taken place. From the initial application deadline to being told I was not  being taken to the second round of interviews took around 42 days. The other downside was that recruitment never answered any of my emails when I had requested information on one or two occasions. For example, before applying I had requested more information about the job role, but nobody got back to me.\r\n\r\nThe positives were that everyone I met at WWF- UK on the day of the interview were very friendly, from the reception staff to everyone on the interview panel. The three interviewers seemed very nice, and did their best to make me feel at ease. \r\n\r\nThe interview itself was different to how I had expected, there were no waffley questions such as 'tell me about yourself' or 'describe yourself in three words' or 'why would you be the best person for this job' or 'what animal would you be' - none of that. All the questions were very specific and wanted to get straight to the heart of my experience, and exactly what relevant experience I had, and how I had gone about it. They wanted clear examples of relevant experience, and wanted to find out my understanding of how things (i.e. project management or stakeholder negotiation) should be done. There didn't seem to be much room for talking about other skills and experience, or trying to elaborate on why I could be best for the job. This is the part I found difficult - I was quizzed in some detail about very specific experience, but there was little room to 'show off' in other areas or tell them about other things I had done or achieved, or additional skills I had. I also had to do a 5 minute (pre-prepared) presentation. The topic, set by WWF, was the impacts of trophy hunting on wildlife conservation. As this was a Technical Adviser role (which would involve giving expert wildlife conservation advice) , candidates were expected to have a strong knowledge of conservation science, hence the technical nature of the presentation.\r\n\r\nMy experience may not be typical of WWF interviews for other job roles - I suppose different interview panels ask different questions, so an interview for an HR or Communications position would likely be completely different.", "Interview Questions": "What made you interested in this job and working for WWF?\r\n\r\nDescribe a project you have managed, and detail how you managed the budget and planned/ implemented the project.\r\n\r\nDescribe a situation where you have solved a problem.\r\n\r\nDescribe your experience of engaging with the media.\r\n\r\nIf you were approached to give comment on something you are unfamiliar with, how would you respond?\r\n\r\nDescribe how you have worked through issues with stakeholders. How did you achieve this?\r\n\r\nDescribe your experience of advising other projects, and departing information to them when they have requested it.\r\n\r\nThere were also a number of questions following those above, to find out more with regards to my answers (e.g. how I had gone about achieving certain things, what steps I had taken, measures of success). \r\n\r\n(Also - five minute presentation on the impacts of trophy hunting on wildlife conservation)"}, {"date": "11 Mar 2016", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Woking, England) in Mar 2016", "Interview Descriptions": "The interview was very relaxed and more of like a conversation.I was briefed about the software's and the Hr systems in use. \r\nNothing intense very generic questions about my previous work experience and how I would handle situations and scenarios.\r\n\r\nOverall a very relaxed interview. :)", "Interview Questions": "What do you think is good customer service ?"}]]