[[{"date": "31 May 2023", "title": "Nurse Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ProHealth Care (WI) (Waukesha, WI)", "Interview Descriptions": "It was easy and engaging. The questions were: tell me about yourself and why should we hire you? Moving tot he in-person, it was easy depending on the manager you have. They talked about the history of the company, and then, I have my job shadow.", "Interview Questions": "Tell us why we should hire you."}, {"date": "31 Mar 2023", "title": "Family Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ProHealth Care (WI) (Waukesha, WI)", "Interview Descriptions": "Professional, efficient interview. Nothing that really stood out than any other interview. Overall quick and able to answer questions I had. Ended up going a different Avenue but seemed like a fine interview.", "Interview Questions": "Describe a difficult situation you were able to resolve."}, {"date": "19 Dec 2022", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ProHealth Care (WI)", "Interview Descriptions": "2 interviews, one with recruiter and one with hiring manager. standard interview with recruiter followed by with hiring manager who gives you a tour of the facility. overall it was an easy process, if you have the credentials you will get the job", "Interview Questions": "why do you want to work for prohealth"}, {"date": "19 Jan 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ProHealth Care (WI) (Waukesha, WI) in May 2022", "Interview Descriptions": "First, there is a screening phone call interview. The next step in the process is a virtual interview where you speak with the supervisors. Overall the process was very fast. Took about 2 weeks.", "Interview Questions": "What in your past work experiences will help you in this role? Why do you want to work for ProHealth? What about this role interests you?"}, {"date": "10 Aug 2022", "title": "Corporate Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ProHealth Care (WI) in May 2022", "Interview Descriptions": "Grueling and intimidating virtual review with 4 female panelists. Said the last 15 minutes would be for me to teach them about anything yet all their questions allowed me 10 minutes and I felt under\nimmense pressure although I’ve taught many different learners for years.", "Interview Questions": "How would you deal with learners who were on their phones during the training?"}, {"date": "13 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ProHealth Care (WI) (Waukesha, WI) in Dec 2021", "Interview Descriptions": "Wonderful interview process. Interviewers were very kind and made me feel at ease. They also answered many of the questions I had for them, before I even asked.  Prompt replies to phone calls and emails.", "Interview Questions": "Why I chose to apply there. "}, {"date": "27 Feb 2021", "title": "FNP-BC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ProHealth Care (WI)", "Interview Descriptions": "Smooth. The recruiter was phenomenal and kept in constant communication. The turn around for application submission to interview was quick and too the point. The staff was very informative and covered all aspects of the job.", "Interview Questions": "Describe a time I identified a trend in a patient’s chart that and how I addressed it. "}, {"date": "24 Sept 2020", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ProHealth Care (WI)", "Interview Descriptions": "They had a wonderful interview process online. This is only the first part I do have an in-person interview coming up.  The questions were pretty usual of a company who's looking to hire a lab .assitant.", "Interview Questions": "How do you handle the situation when an error is found? "}, {"date": "23 Sept 2022", "title": "Licensed Massage Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ProHealth Care (WI) (Oconomowoc, WI) in Sept 2019", "Interview Descriptions": "Applied for a part time job in waukesha cancer center. Was sent an email with interview details that sent me to an abandoned building in oconomowoc. Called my hr contact, hr office was already closed… before 4p. Eventually found my way to where my interview was (In oconomowoc, across town, at an outpatient PT dept) and the receptionist complained to my interviewer that someone ELSE was sent to that wrong address even though receptionist had contacted hr about it multiple times. \n\nTurns out, the job they were advertising as part time in waukesha cancer center was actually 90% working in the PT clinic in oconomowoc full time 32-40hrs/week and “maybe sometimes” going to waukesha cancer center. Despite leaving a message for HR contact while trying to figure out where i was supposed to be, letting her know the address she sent was wrong… never even got a call back from her until i was offered the job. I declined and told them i had zero interest in working for them after their interview process.  Job advertised wasn't even the job available. Pay rate was significantly lower than my first job out of school 9yrs prior. Nothing but red flags from start to finish over there. ", "Interview Questions": "So… why do you want to work here?"}], [{"date": "29 Jul 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ProHealth Care (WI)", "Interview Descriptions": "I had a total of three interviews.. They went well very detailed about the job. Was offered the job almost a month later.  I thought I didn’t get the job but they were waiting to fill other positions as well", "Interview Questions": "N/A"}, {"date": "22 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ProHealth Care (WI) (Waukesha, WI) in Apr 2018", "Interview Descriptions": "Very easy interview. Nice HR representative. Calls back. Answers questions. Good people. Quick response. Dedicated HR person to contact with questions. Phone interview first. Then in person with the department manager.", "Interview Questions": "N/A"}, {"date": "5 Dec 2017", "title": "Customer Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at ProHealth Care (WI) (Oconomowoc, WI)", "Interview Descriptions": "very easy at the time I started as an intern with oconomowoc years ago this is not a current interview, those that I interviewed with are no longer with the company and only a few that were in the department at the time are still around", "Interview Questions": "N/A"}, {"date": "20 Nov 2016", "title": "Non Clinical Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ProHealth Care (WI)", "Interview Descriptions": "I had a 45 minute phone interview with recruiter.  She was antagonistic and very argumentative about my reason for applying for the position as well as my work history.  I have exact matching experience for position I applied for and recommendation from current trusted employee which I believe the recruiter resented because she did not give me the opportunity to move on to in person interview with the manager who I was told planned to talk with me.", "Interview Questions": "Over an over asked why I left various jobs.  She asked why I was interested in job I applied for and then questioned my response when I provided it.  She questioned whether I would find the salary, hours and location acceptable.  All of that is normal except in the tone she used which was very conforntational"}, {"date": "5 Mar 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ProHealth Care (WI)", "Interview Descriptions": "Recruiter called to setup time for phone interview. Since we had been playing phone tag, when the recruiter finally reached me, we ended up doing the phone interview at that time. The recruiter then setup an in person interview with the hiring manager.  The in person interview was with the hiring manager and other people in similar roles.", "Interview Questions": "strengths/weaknesses, typical interview questions"}, {"date": "24 Jul 2015", "title": "Dishwasher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ProHealth Care (WI) (Milwaukee, WI) in Oct 2014", "Interview Descriptions": "It was very simple and only basic questions were asked. No questions were in depth. There were no issues and the employer showed me the whole building on the day that I interviewed", "Interview Questions": "What kind of animal would you be."}, {"date": "21 Aug 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ProHealth Care (WI) in Aug 2014", "Interview Descriptions": "Initial communication was by HR requesting a phone interview via email. Interview was promptly scheduled and at the end of the phone interview an interview with the hiring manager was scheduled for the following week. I received an offer within one week of the phone interview with HR so they were very prompt. Interview questions were typically what you would expect (a couple situational questions, strengths, weaknesses, etc.). During both interviews I was asked to go through all my past clinicals from school. Also asked if there were any clinical situations that were particularly rememberable. Nothing too difficult or unexpected.", "Interview Questions": "What do you like to do in your free time"}, {"date": "21 Mar 2017", "title": "Health Fitness Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ProHealth Care (WI) (Pewaukee West, WI) in Mar 2014", "Interview Descriptions": "First had a phone interview. At the end of the phone call we scheduled an in-person interview that consisted of going over my resume, a facility tour, and basic information about how the process of everything.", "Interview Questions": "Describe one time when you let something slip through the cracks."}, {"date": "27 Apr 2015", "title": "Human Resource Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ProHealth Care (WI) (Milwaukee, WI) in Jan 2012", "Interview Descriptions": "Applied online, phone screen, in for an in-person, in a second time for a group.  Completed pre-offer paperwork.  Pre-employment drug test, phyiscal and TB screening.  References took the longest so waited a few weeks before I heard back with a formal offer.", "Interview Questions": "Handle training, employee issues, strategic planning projects"}, {"date": "2 Dec 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ProHealth Care (WI) (Brookfield, WI) in Mar 2011", "Interview Descriptions": "The hiring manager was very pleasant and the questions were very straight-forward.  The interview itself lasted approximately 15 minutes or so and consisted of pretty standard, behavioral/situation-based inquiries.  The interview was much more casual than most I have had and I greatly enjoyed working with this particular manager for the first two years of my employment with the company.  However, ProHealth Care has changed significantly since this time and my undersstanding is that the current interview process is not nearly as laid back as it was eight years ago.", "Interview Questions": "Describe a situation when you had to deal with an angry customer.  What was your response, what actions did you take, etc."}], [{"date": "21 Sept 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at ProHealth Care (WI) (Menomonee Falls, WI) in Mar 2011", "Interview Descriptions": "Went to job fair, selected job interested in and applied. Interviewed on the spot. Job offer was a few days later. Several days later I was called and had a phone interview. Then the following week, I received my offer via phone.", "Interview Questions": "Typing skills? Used to a fast paced work environment.\r\n"}, {"date": "22 Nov 2009", "title": "Human Resources Specialist  Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at ProHealth Care (WI) (Waukesha, WI) in Sept 2009", "Interview Descriptions": "Did very well on phone interviews with 4 managers, thought an offer was coming.  after several weeks, they decided to upgrade the position and ruled me out", "Interview Questions": "Why are you interested in moving to Wisconsin"}]]