[[{"date": "9 Jul 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Steward Health Care System (Hialeah, FL)", "Interview Descriptions": "Panel interview with multiple stages, accepted offer within 2 interviews. General nursing questions and scenarios with a team of nurse managers and hospital executives. Facilities are big on team work.", "Interview Questions": "Describe a scenario you had a disagreement with a physician."}, {"date": "21 Mar 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "Employer asked very few questions, pretty much just gave me all the info about the hospital and asked when I could start. He kinda went off topic to talking about the environment and cost of living around the hospital. There were 2 other nurse managers from the med surge units to answer questions.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "7 Dec 2022", "title": "Revenue Integrity Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "A 1 hour in depth phone call. It took about a week before I got a a reach out with a verdict. Overall pleasant as the hiring manager was quite personable.", "Interview Questions": "Tell me about yourself, what is your greatest weakness."}, {"date": "17 Oct 2022", "title": "RN BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Hialeah, FL) in Oct 2022", "Interview Descriptions": "Professional,pleasant,made me feel good,if I have to give point have to given 100%I felt, comfortable,he listen to me with attention, he answer my question,It was very stimulatingly felt accepted from the first sentence he said to me", "Interview Questions": "My professional history, where prefer unit wants to work"}, {"date": "22 Sept 2022", "title": "Manager Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Steward Health Care System", "Interview Descriptions": "Interviewed over three years ago and it was a positive experience.  They go over all of the job roles and make sure that they vet you carefully.  I felt like the process was fair.  ", "Interview Questions": "Tell me about your most recent role"}, {"date": "12 Sept 2022", "title": "ER Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "Very easy and comfortable. Felt welcome the moment I walked in. The interviewers excitement matched mine. Received an immediate tour of the department and was shown the scheduling process and all my questions were answered.", "Interview Questions": "Typical interview questions. Qualifications, desires, expectations any questions you may have etc.\n"}, {"date": "4 Sept 2022", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (West Valley City, UT) in Aug 2022", "Interview Descriptions": "Good  I know almost everyone there. I word there for 5 years. I got a email asking me when I could come in for an interview. I told them what day and time would be best for me.", "Interview Questions": "How long have you been in security?"}, {"date": "31 Aug 2022", "title": "RN-OBGYN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Steward Health Care System (San Antonio, TX) in Aug 2022", "Interview Descriptions": "Interview went great. I was given a thorough walkthrough of the entire faciky and different units. It was informative and I was able to ask as many questions as I needed to. I felt very comfortable through the entire process.", "Interview Questions": "What is your greatest strength?"}, {"date": "11 Jul 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Steward Health Care System (Oakland Park, FL) in Jul 2022", "Interview Descriptions": "Interview was quick ! I applied 4 days before I received a phone call I spoke to the recruiter and worsts later a interview and was hired on the spot.", "Interview Questions": "How many patient can I handle\r\nI was asked clinical questions about patient care and priorities "}, {"date": "19 Nov 2022", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Steward Health Care System (San Antonio, TX) in Jul 2022", "Interview Descriptions": "Interview then phone call for an offer. Health screening, drug test . You also get to do on boarding before the actual orientation day for the hospital, and finally orientation.", "Interview Questions": "Where and for how long being an RT for? Do you like your job?"}], [{"date": "29 Jun 2022", "title": "ER Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "The process was very fast! I had a good experience and Jessinia was very patient and she made sure I understood every single step I needed to know about for this process.", "Interview Questions": "Tell me more about yourself?\nWhy did you choose this hospital?\nWhat would you do if a patient family member is upset?"}, {"date": "2 Jun 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "The interview was entirely about my healthcare experience and the various skills I had with Microsoft office. Overall, you may need some technical experience and the ability to comprehend health care terminology.", "Interview Questions": "What are your skills in Excel?"}, {"date": "30 Jun 2022", "title": "Hospital Sitter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Steward Health Care System in Jun 2022", "Interview Descriptions": "The interview process  went very well.  It felt welcoming.  They explained everything to me and asked questions in a professional manner.  It didn't take long at all. It went smooth and well.", "Interview Questions": "State one positive thing about myself "}, {"date": "16 Jun 2022", "title": "Hematology Laboratory Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Steward Health Care System (Hialeah, FL) in Jun 2022", "Interview Descriptions": "the interview process was really good, and fast and very effective. The right questions were asked. The manager was very welcoming and told me about all the expectations for the position.", "Interview Questions": "How you experience in your last position will help you succeed in this new position?"}, {"date": "23 May 2022", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Sebastian, FL) in May 2022", "Interview Descriptions": "I was greeted with a hello and a smile. I was asked how I heard about the position. Was given an overview of the position and what it intails. Was asked about prior work history and if I would be able to work any shifts .", "Interview Questions": "How did I hear about the position?"}, {"date": "2 Jun 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Steward Health Care System (Miami, FL) in May 2022", "Interview Descriptions": "Jessi from recruitment is so friendly and kind! \nShe responds quickly and is very willing to help.\nThe interview process was smooth and very clear. \nAll of the staff have great communication.", "Interview Questions": "What is my past work experience?\nAm I willing to continue my education? (ACLS, etc.)"}, {"date": "7 Apr 2022", "title": "ICU Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "Friendly staff and punctual. I was just chilly in the hospital, bring a jacket and make sure to do your research on the job you are applying for and the background of your interviewer.", "Interview Questions": "Why are you interested in ICU\r\nWhat is your current experience in critical care?"}, {"date": "9 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Steward Health Care System (Melbourne, FL) in Feb 2022", "Interview Descriptions": "I was pleased with the interview process. Comfortable, quick and painless, able to answer questions and felt like my concerns were being listened too. Definitely recommend this job to others", "Interview Questions": "They asked me about my previous experience"}, {"date": "16 Dec 2021", "title": "Regional Corporate Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "I was contacted by Julie to schedule an interview for the role. To my surprise I was ghosted by her. She did not call or even send an email to let me know why she was not available for our interview. I understand things come up but this approach is unacceptable and unprofessional. I won't be applying to anymore of their openings.", "Interview Questions": "I don't know what the interview questions were, I never got a call from the recruiter to conduct my interview."}], [{"date": "23 Feb 2022", "title": "Human Resources Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Steward Health Care System (Brockton, MA) in Nov 2021", "Interview Descriptions": "Applied online through Indeed and heard back the next day. I received a call from the recruiter at 7:30am and then an email to set up a time for another interview.", "Interview Questions": "Typical interview questions- tell me about your work experience, why do you want to work here, experience with labor unions"}, {"date": "8 Oct 2021", "title": "Medical Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "3 people were present for the interview.  They did not ask on credentials as much as basic job knowledge.   Somewhat disappointing for environment.   They proceeded to inquire about personal life.  Did not like the personal questions", "Interview Questions": "What did you dislike about your last job?"}, {"date": "17 Jun 2021", "title": "Patient Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "Simple and easy questions, there were 4 interviewers, no hard or difficult questions to answer. just your basic what are you interested in, where are you from, tell us about yourself. Nothing major.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Jun 2021", "title": "IT Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Steward Health Care System (Rockledge, FL) in Jun 2021", "Interview Descriptions": "I  was 15 minutes early and was escorted by the person I was replacing. He was retiring and wished me luck for the interview. I met with the super of the IT group who hardly asked me questions. It was mainly him rambling about how much of a perfectionist he is. To be honest, I was more prepared for the interview then he was since I was the one asking all the questions. Every question I asked circled back to how he runs a tight ship and everything must be held to the highest standards. So... in other words he was blowing hot air. After about 30 minutes of this I met with another member of the IT group. Not the super but I'm guessing the 2nd in command, because he actually had some interview questions. But to be honest he didn't exactly do a great job with asking the questions as they were completely open ended and I have no idea how they setup their equipment. In total I was given 3 interview questions. I had over 40 questions I could choose from, depending on how the interview went. I also learned about their executive management, board members, company hiring trends, and the amount of growth the company was experiencing.", "Interview Questions": "Tell me about yourself?\r\n\r\nYou get a trouble call saying a printer won't print, what do you do? \r\n\r\nNext Q: You get a trouble ticket saying the monitor doesn't work, what do you do? "}, {"date": "29 Apr 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System in Apr 2021", "Interview Descriptions": "I applied online and received a request from HR to interview. I selected a meeting time from the list of options sent to me. Never heard back from HR. I followed up to confirm the meeting time and received no response. I never received a call for the interview or any other communication from HR.", "Interview Questions": "Was ghosted so never received a call"}, {"date": "28 Jan 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Akron, OH) in Jan 2021", "Interview Descriptions": "Everyone was super nice.  It took a couple interviews till I got placed but I'm glad they wanted to make sure they had a good fit for me being a new graduate.", "Interview Questions": "Had I worked with EMR?"}, {"date": "16 Mar 2022", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Steward Health Care System (Miami, FL) in Jan 2021", "Interview Descriptions": "It was quick and easy and they wanted to proceed quickly. I had an offer within a month. I would recommend. Super easy and fast. Blah blah blah. I am done typing a response to the question now.", "Interview Questions": "How many years experience do you have"}, {"date": "14 Jul 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Dallas, TX) in Nov 2020", "Interview Descriptions": "2 rounds with the team, one with the manager and another one with the whole team. Each round takes around half an hour to 1 hour. There is no tech test but many bq.", "Interview Questions": "self introduction and Tech experience"}, {"date": "22 Apr 2021", "title": "Grievance and Appeals Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Steward Health Care System in Nov 2020", "Interview Descriptions": "Very professional, relaxed. It started on time and ended on time.  Asked questions about writing, insurance, and health care experiences. Compared to other interviews, it was similar in context but shorter.", "Interview Questions": "What is your experience with  insurance companies. "}, {"date": "19 Oct 2020", "title": "Senior Staffing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Phoenix, AZ) in Oct 2020", "Interview Descriptions": "I sat with 2 people and it was a relaxing environment. They asked behavioral questions. They were both very nice and made me feel relaxed and comfortable. I was expecting to have at least 4 people in the interview so I was relieved when I saw only two people.", "Interview Questions": "Tell us about a situation when you overcame something. "}], [{"date": "25 Sept 2020", "title": "Patient Care Liason Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "Positive experience! Difficult questions. Multiple people interviewing at one time. Challenging and informative, though. It was a great learning experience for me. Obviously, be well prepared to answer very detailed inquiries in regards to your past experience and the position you are applying for.", "Interview Questions": "Walk me through your typical work day."}, {"date": "16 Aug 2020", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "It was fine. Average interview. Predictable. It was okay. It was decent. It was fair. It was reasonable. It was acceptable. It was adequate. It was sufficient. It was great. It was amazing.", "Interview Questions": "Why do you want this job?"}, {"date": "23 Jul 2020", "title": "Patient Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Steward Health Care System (Brighton, MA)", "Interview Descriptions": "I applied online and did a little networking to get the interview and for a company who is generally incredibly unreliable about scheduling interviews or even any correspondence I was actually surprised how quickly I heard back.\r\nI met with the director of the department for about an hour or so and it was more or less a generally positive and friendly conversation but it was pretty clear that they were not interested in hiring me this position nor did they even really seem interested in hiring anybody since it had been open for months which apparently not much headway on getting someone in even though she stated it was an in need job.\r\nShe probably said \"is that your last question\" three or four times with a very dismissive tone which I understand they have other things to do and many responsibilities but just the way they went about conducting interviews seemed like it was very unprofessional and with the benefit of hindsight I could tell that this would have been a difficult position not because of the role but because of the management.", "Interview Questions": "how do you deal with difficult patients?"}, {"date": "18 Feb 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Steward Health Care System", "Interview Descriptions": "It was the basic interview questions- what is the easiest task you have ever had; name a time when you missed a deadline? It took about 45 minutes. It was with the hiring Manager.", "Interview Questions": "What is the one thing you can improve or change yourself?"}, {"date": "19 Feb 2020", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Steward Health Care System (Watertown, MA) in Feb 2020", "Interview Descriptions": "The first thing with Steward was a phone interview for about an hour.  If the phone interview goes well then you have to do an excel modeling. The last step was in-person interview which involved the whole team and took about 3 hours.", "Interview Questions": "Questions regarding P&L, your day to day job, how one handles multiple projects, etc. "}, {"date": "27 Nov 2019", "title": "Crisis Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System", "Interview Descriptions": "Low key and easy going.  Management was eager to hire people for graveyard and weekend shifts. Management was pleasant and down to earth. Did not feel stressed during the interview process.", "Interview Questions": "How would you handle difficult patients? "}, {"date": "7 Sept 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "Phone screen, modeling test, then 5 round superday. Interviews primarily  based upon fit, and behavioral questions once modeling test is out of the way. Use staffing companies to place these particular finance roles", "Interview Questions": "Why healthcare, why M&A, why steward"}, {"date": "16 Aug 2019", "title": "Athletic Trainer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System", "Interview Descriptions": "A few days after I submitted an application I received an email to set up an interview time and was provided with an address for the interview location.  The interview was 1-1.  A week or so after my interview I received an email informing me that I was not hired.", "Interview Questions": "There was not many questions asked about my abilities or experiences.  I was asked more about a conference we both attended and football team I once worked with. "}, {"date": "18 Jul 2019", "title": "MedicalAssistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Steward Health Care System (Brighton, MA)", "Interview Descriptions": "I was sent an email to come in for an interview. It was a very pleasant experience and I shared examples of how good I get along with people and my soft skills", "Interview Questions": "What do I do if there is a conflict between me and a co-worker ?"}, {"date": "14 Jun 2019", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Steward Health Care System (Westwood, MA) in Jun 2019", "Interview Descriptions": "On the spit offer job fair. I applied online then got an email for a job fair. I went to the job fair with my resume. Got an interview with HR then the manager. Got the job on spot. The whole process did not even last an hour.", "Interview Questions": "Why am I interested in being part of this company?\nTell me 1 thing that you think might stop you from getting hired? \nThe manager throws a scenario at me and how would I respond to it?"}], [{"date": "17 Apr 2019", "title": "Revenue Cycle Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Steward Health Care System (Richardson, TX) in Mar 2019", "Interview Descriptions": "had one on site interview. Received phone call would I be available to interview and it was set for the same day as the call.It was a very laid back interview The people I met with where very down to earth and we spoke about they type of background they had", "Interview Questions": "what are your strengths and weaknesses "}, {"date": "22 Feb 2019", "title": "Appeals and Audit Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Steward Health Care System (Westwood, MA) in Feb 2019", "Interview Descriptions": "Went for an in person interview, it was very laid back and the manager was super nice. No behavioral type questions (“give me an example of a situation when...” sort of questions). Then had a quick phone interview with the corporate director about a week later (they told me this was just a formality before they would offer the job) and then I got the offer the next day. Took a total of 2 weeks from first interview until offer.", "Interview Questions": "Tell me about yourself"}, {"date": "19 Mar 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Boston, MA) in Feb 2019", "Interview Descriptions": "I met with HR first and then met with hiring Manager and some of the staff. Lasted about 30 mins and was very low key.  Everybody seemed very knowledgeable. Very nice building.", "Interview Questions": "Example of  problem solving in my current job"}, {"date": "14 Apr 2019", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Steward Health Care System (Lehi, UT) in Feb 2019", "Interview Descriptions": "Met with office manager and spoke for about 20 min.  Was very nice but not very clear. Not overly impressed with manager. Easy and basic interview. Accepted the offer but will probably not end up staying with this company", "Interview Questions": "Where I say myself in 5 years "}, {"date": "14 Nov 2018", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Steward Health Care System", "Interview Descriptions": "Met with a  few people.  The people there were really nice and relatable. I got some insight on the role and expectations. Company is growing quickly and they are hiring a lot of people.", "Interview Questions": "Experience"}, {"date": "3 Mar 2019", "title": "Business Intelligence Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Steward Health Care System in Nov 2018", "Interview Descriptions": "Interview process went for about 2 to 3 weeks. Initial round was taken by a technical team. After 1 week I was asked to come down to the office for a One-On-One In-Person interview. 5 persons interviewed from VP, Director to Data analyst. Each person interviewed for about 30 minutes. They checked with my expertise in the field of BI reporting. After a week they have requested for one last interview which was a group panel interview where they requested to show some screenshots of previous Dashboards I developed and interviewed as a group.", "Interview Questions": "1. Techincal Round:\r\n3 tier Architecture? Difference between QlikView and QlikSense? Knowledge in other BI tools like Tableau and Power BI? Apps deployment procedure in QlikSense? Nprinting questions.\r\n2. VP and other senior management round:\r\nMy background and introduction? Experience in working directly with End users? Challenges faced? Long term goals? they explained their current work flow and asked if I can suggest any resolutions or best practices that can improvise their existing workflow."}, {"date": "6 Mar 2020", "title": "Front End Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Steward Health Care System (Lower Mills, MA) in Sept 2018", "Interview Descriptions": "It went by pretty quick, I met him one day and got a offer a few days later. They asked me to tell them a little about myself, asked about my experience, school background, what experience I had with jQuery, PHP and powershell.", "Interview Questions": "Asked about what I did in recent roles. How I felt about jQuery and what experience I had with it."}, {"date": "16 Feb 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Steward Health Care System (Boston, MA) in Sept 2018", "Interview Descriptions": "Really thorough and upfront interview process. All my questions were answered and constant communication throughout the interview process. I was provided the opportunity to interview with peers as well to be sure it was a good fit overall.", "Interview Questions": "What are you looking for in an employer?"}, {"date": "27 Aug 2018", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Steward Health Care System", "Interview Descriptions": "I was called in for an interview a week after applying online. I went in & was offered the position based on my work history. The following day I was given a TB test & filled out all of my new hire paperwork. However, when reaching out to my references the Human Resources woman had difficulty contacting one of my employers due to it being an at home call center position. From that point on it was a complete headache. She asked for a reference to confirm my employment at a place she was having issues reaching, after a week I was able to get in touch with one of my old supervisors who was willing to speak with her. She called him & claimed he had told her he’d only known me for 6 months, which was bogus because he had been my supervisor the last year I had worked there & had no reason to lie about it.  She then asked for my tax returns for the past 3 years, which would have been fine had I not been in the middle of a move & was unable to locate them. I went ahead & withdrew my application due to her refusing to move forward until I was able to find them. It was too much work for the amount of pay they were offering & the hours weren’t that great either. I turned down two job offers at different places that were paying higher because I wanted to work in a hospital environment due to me going to nursing school just for her to make it as difficult as possible for me to have the job. \r\n\r\nShe also kept referring to my call center history as ‘secretarial work’. I’m pretty sure that isn’t the same thing at all.", "Interview Questions": "Tell me about your work history."}, {"date": "21 Aug 2018", "title": "Assistant Vice President Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Bountiful, UT)", "Interview Descriptions": "the interview was fine.. seemed fair and balanced.  good experience.  seemed to include enough detail for them to get to know me and my experience.  thank you", "Interview Questions": "example of leadership experience "}], [{"date": "1 Dec 2018", "title": "Performance Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Steward Health Care System (Mesa, AZ) in Jul 2018", "Interview Descriptions": "Quick and efficient and given alot of details about the applied position enough to be fully prepared for the job and what its requirements would be. friendly interviewer who was informative.", "Interview Questions": "Why are you right for this job."}, {"date": "13 Feb 2020", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Steward Health Care System (Boston, MA) in Jun 2018", "Interview Descriptions": "I Can't remember how I was contacted for interview, but I had an initial group interview with everyone I'd be working with before I was offered the position. I later learned that my co-worker, who was hired at around the same time, did not have a group interview, just a few people.", "Interview Questions": "Have you lead group counseling before?"}, {"date": "29 Dec 2018", "title": "Contract Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Steward Health Care System (Dallas, TX) in Jun 2018", "Interview Descriptions": "The interview process was extremely easy...actually the easiest interviews I've ever been  through  in my  career.  There were two phone interviewd; one with the direct Manager and the very next day with the department VP.  The following week the VP flew to Dallas for a face to face interview and made me an offer on the spot.", "Interview Questions": "I was asked questions related to my past contract management experience and databases I had used in the past."}, {"date": "26 Apr 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Steward Health Care System", "Interview Descriptions": "This was a group interview held in a conference room. I was the last of three interveiws, and was told that time was restricted due to another meeting happening soon after. Each of the participants asked a few questions, though they did not seem to be terribly engaged. At one point, one of the interviewers seemed to be checking Facebook on their phone, and was laughing over a joke with one of the other interviewers. Excepting my initial HR contact, none of the interviewers seemed at all invested in the process, and seemed to have determined that I was not a candidate for hire the second I stepped in. Overall, it was a big waste of time, and in retrospect I should have excused myself within minutes. \r\n\r\nAlthough the interior spaces of the office were fairly well maintained, the parking area was a wreck, with numerous potholes and garbage strewn about the green spaces. The reception area was not pleasant either, with boxes awaiting delivery in almost every corner, and the receptionist was extremely rude.", "Interview Questions": "name a situation where you dealt with persistent stress. "}, {"date": "11 Apr 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Dallas, TX) in Mar 2018", "Interview Descriptions": "Had interview late in evening (after 5:30 pm) and was told I had what the director was looking for. Then had a few other Phone interviews with various leadership. Most questions were not specific to the job, more of what the company is doing and how big they are growing. Difficult to interview for a job when the interviewer doesn't know what he/she wants.", "Interview Questions": "Do you have experience with patient access?"}, {"date": "13 Mar 2018", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Steward Health Care System (Phoenix, AZ) in Mar 2018", "Interview Descriptions": "A brief telephone conversation with the senior recruiter followed by a series of questions to answer relative to recruiting and how I would handle different scenarios.   The Senior Recruiter seemed very \"green\" in her role and somewhat unprofessional, as well as a \"know it all\".", "Interview Questions": "My age"}, {"date": "22 Jan 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System", "Interview Descriptions": "Applied online, few days later received a call from HR, met with a nurse manager, offered the job at the end of the interview. This hospital only hires new grads, it's ridiculous. So, if you're a new grad and you give a decent interview, you'll be hired.", "Interview Questions": "describe how you dealt with a difficult patient"}, {"date": "26 Feb 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Steward Health Care System (Boston, MA) in Jan 2018", "Interview Descriptions": "Scheduled to meet with 2 people, only 1 could make it.  Pretty straightforward process, they were friendly enough and asked fair questions. These days things are standardized with the online vetting process beforehand.", "Interview Questions": "They described a simple care scenario and asked how I would respond in the situation."}, {"date": "30 Mar 2019", "title": "Accounts Payable Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Steward Health Care System (Westwood, MA) in Jan 2018", "Interview Descriptions": "Very friendly open and truthful about job description. Interviewers were casual and easy and generally questions were noninvasive. The process is first a phone interview about your work history and experience in a specific area or job function. After which they may set up a face to face interview. Upon 1:1 with department supervisor", "Interview Questions": "They wanted early starters- so will you be able to open shop and stay late"}, {"date": "10 Jan 2018", "title": "ACO Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Steward Health Care System (Dedham, MA) in Dec 2017", "Interview Descriptions": "Short 30 minute interview; interviewer prefaced with he has something to do in half an hour so he needed to wrap this up quickly, a great first impression of a potential supervisor who makes it apparent that his time is more important than yours.  Asked follow up questions that didn't seem to relate to getting at whether I would be a fit for the job.  Not friendly, badly feigned interest and when asked questions, just recited off the job description instead of going more in depth about what was expected from the person who would get the job.  Not sure why I was asked for an interview that didn't seem like it was of importance in the first place, a waste of time on both ends aside from knowing I would not want to report to this person.", "Interview Questions": "What is your background experience, how does it apply to this job, why do you want to work for this organization"}], [{"date": "2 Nov 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Steward Health Care System", "Interview Descriptions": "Interviewed with 3 different team leads after a phone interview. Everyone was very friendly and very informative about the company, and job role. Also only had great things to say about everyone else and how good  a job they do.", "Interview Questions": "Why am I interested in this career path. "}, {"date": "20 Oct 2017", "title": "HR Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Steward Health Care System (Melbourne, FL) in Sept 2017", "Interview Descriptions": "I had a phone interview with the head of HR. She took the time to give a brief overview of the company and their tremendous growth over the past year. I was definitely not getting a good feeling that they have things in place for the unprecedented growth they have experienced. They need to fill a large number of key positions and without that infrastructure in place I don't see the immmediate future as being a positive place to be. If you were looking for an opportunity to come in on the ground floor with the understanding that there would be a lot of uncertainty this would be a good job. The position involved driving among three locations working with each area to manage their HR concerns. They do not pay for your vehicle and only pay mileage when you go to a second office in one day. The drive time alone (without even considering the uncertainty and lack of pressures in place) would not be worthwhile.  I did not get the impression that employees are highly valued.", "Interview Questions": "What is the most difficult / complex employee relations situation you have dealt with. "}, {"date": "7 Nov 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Steward Health Care System (Houston, TX) in Sept 2017", "Interview Descriptions": "I went to a job fair they had. I got there and gave them my resume, I got interviewed right away by one of the med surg charge nurses and then by the director.  The interview took no more than 15 min.", "Interview Questions": "tell me about yourself "}, {"date": "25 Aug 2017", "title": "Cnt Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Fall River, MA)", "Interview Descriptions": "Went in for an interview & it went well. They told me they would call me back and its been over a month and no call on whether i got the job or not. I did receive an email that the position was filled. Very bad practice.", "Interview Questions": "What would you do if your getting yelled at and the patient doesn't respond to you."}, {"date": "2 Aug 2017", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Steward Health Care System", "Interview Descriptions": "Interview was very easy. The process was not painful and was very simple. Questions pertained to job very well. Interviewer was pleasant and well informed, very easy to talk to and made the experience very pleasant. The office staff when I was greeted were unpleasant and corrected me when a name was stated incorrectly. Overall a good experience.", "Interview Questions": "Life expectations"}, {"date": "8 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Ayer, MA) in Jun 2017", "Interview Descriptions": "I applied for the job online back in May. I saw when checking for status updates that the position was filled, so I took it as they hired someone else. Later in June I got a call from the Lab Supervisor looking to schedule an in-person interview, which was scheduled that following Monday. I interviewed with the Lab Manager and the MD together. What was scheduled to be a 1/2 hour interview turned into an hour long interview instead. Afterwards the Lab Manager called HR for me to meet with them so that I would not have to make 2 trips. While meeting with HR, we reviewed benefits and salary. She then stepped away and came back a few minutes later saying I was being offered the job! HR gave me the paperwork to review and allowed me a few days to think of the offer before giving the final answer. Once I accepted, I was scheduled to have my employee screening a couple weeks later and then started a couple weeks after that! They were very supportive of me and the time I needed to give for my notice at my former employer.", "Interview Questions": "Are you willing to cross-train in other parts of the lab?"}, {"date": "20 May 2021", "title": "Support Center Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Dorchester, MA) in Jun 2017", "Interview Descriptions": "Yesrs ago a test was required in addition to three interviews over a period of three months . The last interview as with the Manager and Director of the department. \nCons - proven experience was not weighed fully or reflected in salary offer.", "Interview Questions": "Basic  technical and analytical based questions "}, {"date": "24 May 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Steward Health Care System (Boston, MA) in Apr 2017", "Interview Descriptions": "I was scheduled a 30-minute interview with the hiring manager. The interview turned out to be with 3 folks at one, which isn't a big deal, but I would have wanted to prepare and research the folks I was interviewing with.  Pretty standard questions regarding my resume, background and work experience.", "Interview Questions": "Do you like coffee? Dunkin or Starbucks"}, {"date": "7 Apr 2017", "title": "Financial Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Steward Health Care System (Brighton, MA) in Mar 2017", "Interview Descriptions": "Went through a phone interview, a modeling exercise, and then a 2 hour one-on-one interview with 4 staff members from the Finance department. The process was faster than i'm used to because the company just bought 8 additional hospitals and needed to expand the department.", "Interview Questions": "How would your peers/co-workers describe you in 3 words?\r\nCan you budget?\r\nHow did you tackle the modeling exercise?"}, {"date": "24 Jan 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Dorchester, MA) in Jan 2017", "Interview Descriptions": "computerHow to handle patients, how to do procedure; adls, feeding,  I and o, foley, colostomy bags, emergency, dressings,  computer skills (Chas put on computer), how. Do you get along with co workers, experience  in nursing field, type of experience, companies worked for, how long there", "Interview Questions": "N/A"}], [{"date": "19 Aug 2016", "title": "Population Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Steward Health Care System", "Interview Descriptions": "Had a phone screen with HR. Then met 1:1 with the manager of the program. She was nice and asked straight forward questions. The interview was about 30 - 45 minutes long. After 1 week I was offered the position and accepted.", "Interview Questions": "Tell me about your current position"}, {"date": "1 Aug 2016", "title": "New Grad RN Per Diem Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Steward Health Care System (Fall River, MA)", "Interview Descriptions": "Got an date for the interview two days after submitting my application. Building where the interview took place was some what out of the way and difficult to find. Interviewed with one person.", "Interview Questions": "Tell me about a time with a challenging patient and how you handled it and what you would do differently?"}, {"date": "3 May 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Westwood, MA) in Aug 2016", "Interview Descriptions": "Was brought in one week after applying, met with the president and CFO who are both amazing guys. They explained the position and the companies values in detail. They talked about a lot... Didn't leave much room for me to talk about... Anything.", "Interview Questions": "Asked me what it's like to work at Starbucks because you know, they'd probably never know"}, {"date": "6 Jan 2018", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Steward Health Care System (Brockton, MA) in Jun 2016", "Interview Descriptions": "Applied online, received call from department about 4 weeks later requesting interview. Interview was smooth and offer made. Human Resources calls to negotiate pay, and offered me a number so low I laughed and declined. They call back and we begin to play the wage game. Was given a final price and took it. Then, I had to wait over a month for them to get me into an orientation.", "Interview Questions": "How do you handle angry, mean, aggressive people?"}, {"date": "4 Jan 2017", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (New York, NY) in Nov 2015", "Interview Descriptions": "Easy process. Basic interview questions. Phone interview is first. It will take about a week after application to hear from them. Then interview with hr. Then lastly with the manager. They will all be fairly short interviews. Talking about qualifications and background and about benefits and salary.", "Interview Questions": "Why st. E?"}, {"date": "22 Jun 2019", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Steward Health Care System (Tampa, FL) in Sept 2015", "Interview Descriptions": "Very smooth and welcoming with the head RD. Interview was very relaxed. I had my file and resume with me to provide an extra document. We interviewed with the other dietitians and the Food services manager.", "Interview Questions": "What do you expect from this role?"}, {"date": "7 Mar 2018", "title": "Cycle Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Steward Health Care System (Westwood, MA) in Jul 2015", "Interview Descriptions": "very informative interview, very helpful with questions asked and was able to meet managers and talk to them.  tour of office and benefits packages, met coworkers and tour of building.   discussed family and salary", "Interview Questions": "why looking for new job"}, {"date": "21 Apr 2017", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Steward Health Care System (Boston, MA) in Jun 2015", "Interview Descriptions": "It was very simple as my manager (who hired me) did a very short, informal interview process as I was recommended by a previous colleague. She asked me very simple questions about my experience and seemed pleased with the answers. We didn't have to negotiate salary. I spoke on the phone with HR after the offer letter arrived about salary, however, they were not willing to negotiate.", "Interview Questions": "Tell me about yourself."}, {"date": "25 Jul 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Phoenix, AZ) in May 2015", "Interview Descriptions": "Interview with CEO CNO COO interview with department employees, First interview was with the HR Director- I had a total of four interviews, when the first job offer was made I turned them down due to pay.", "Interview Questions": "How can you improve our work environment"}, {"date": "27 Mar 2015", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Steward Health Care System (Westwood, MA) in Feb 2015", "Interview Descriptions": "Very nice and knowledgeable. Friendly and courteous. Met with several people for the interview. Everyone seemed pleasant. Company seems like it would be nice to work for. Asked lots of questions. Was given a tour of the facility and introduced to several employees. Offer excellent benefits and is at a great location.", "Interview Questions": "Length of experience"}], [{"date": "8 Mar 2015", "title": "Intake Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Steward Health Care System (Norwood, MA) in Jan 2015", "Interview Descriptions": "HR will call you then schedules you to meet the Access Manager.  The Access Manager does not return phone calls and cancels often so it can be very challenging to meet with her.  She will ask you a few questions, but largest concern is do you have a independent license.", "Interview Questions": "how many hours can you work?  Can you work evenings and weekends and holidays?"}, {"date": "7 Dec 2014", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System", "Interview Descriptions": "I heard back within a day. The interview went well. I am just waiting for HR to finalize everything. The interviewer was very nice and I look forward to becoming an employee!", "Interview Questions": "Explain a memorable patient care experience "}, {"date": "18 Sept 2014", "title": "Denial Prevention Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Steward Health Care System (Quincy, MA) in Aug 2014", "Interview Descriptions": "Applied online and after 1-2 weeks received a phone call to schedule an interview. I am surprised because I do not have the exact working experiences for this job position. I was interviewed by 2 of the managers, they have about 3 pages of interview questions and the questions are pretty straight forward. Then they will have you to do an online typing test and record your result on your resume. At the very end, they shown me around the office and told me how the office works and how teams are working.", "Interview Questions": "Explain one of the most difficult customer service experience from your past job. "}, {"date": "20 Jun 2014", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Steward Health Care System", "Interview Descriptions": "It seems as if when one hospital in this system doesn't want to hire you, they simply pass your name along to others... Without giving you a definitive \"no, but we know of another position...\"", "Interview Questions": "What would you do in (insert highly critical emergency situation here)?"}, {"date": "8 Jun 2017", "title": "Claims Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Phoenix, AZ) in Jun 2014", "Interview Descriptions": "Very pleasant good questions, two supervisor came in and ask some personal questions then ask what experience I had. Told me what I was going to be doing and what was expected of me, They gave me a chance to ask questions so I like how they responded it was very easy to feel I wanted to work there", "Interview Questions": "Can't remember "}, {"date": "7 Mar 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Steward Health Care System (Brighton, MA) in Apr 2014", "Interview Descriptions": "Very short and very informational.  Didn't think i got the job because it was so brief but then I did. I was happy with the experience but the briefness made it feel like a waste of time.  Could've gotten all that info over the phone", "Interview Questions": "Why do you want this job?"}, {"date": "13 Oct 2017", "title": "Behavioral Heath Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Steward Health Care System (Boston, MA) in Nov 2013", "Interview Descriptions": "It was an in person interview with the hiring manager.  When I interviewed, the team was small, so it was a pretty simple process.  I am sure things have since changed.", "Interview Questions": "Why would you like to work here?"}, {"date": "2 Jan 2014", "title": "Practice Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Steward Health Care System (Boston, MA) in Oct 2013", "Interview Descriptions": "I was referred by a colleague of the hiring manager and was very impressed that I received a  very quick response and an invitation for a group interview with multiple senior members of the organization.  One was the prior incumbent who had been promoted after only 1 year with the company.  \r\n\r\nThere were a lot of questions about prior relevant experiences and I was glad that I had prepared for a behavioral interview where I could offer examples of success in prior positions.  All the interviewers were very pleasant and offered insights into the position and the challenges of the job.", "Interview Questions": "Questions were asked about managing in situations of limited authority."}, {"date": "23 Aug 2013", "title": "Help Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Steward Health Care System (Norwood, MA) in Jun 2013", "Interview Descriptions": "Interview went pretty well in my opinion. Just be honest with your experience and what you know. The position that I went for was a call center role. The manager and supervisor was very specific and detailed about the role offered.", "Interview Questions": "If you are an already experienced Help Desk Analyst in the past, the most difficult question may be talking about yourself. "}, {"date": "7 Jun 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Steward Health Care System (Methuen, MA) in Jun 2013", "Interview Descriptions": "This was a very lengthy process. I started working with a travel agency and the took a per diem position which was the only position offered. I was still required to go through all the orientation even though I had been working there 6 months.", "Interview Questions": "What are your weaknesses? "}], [{"date": "14 Dec 2012", "title": "Billing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Steward Health Care System (Stoughton, MA)", "Interview Descriptions": "First met with office manager, second and third interivews were with m.d's", "Interview Questions": "Please give a scenerio of how you dealt with an irrate patient"}, {"date": "2 Aug 2014", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Steward Health Care System (Brighton, MA) in May 2010", "Interview Descriptions": "Had two interviews, weeks apart, was called in for a job making 10k less than asked and HR process took forever!  There were multiple interviews and it was unorganized.  Conflicting info was given out and everyone I spoke to didn't seem to be working there by the time of my next interview.", "Interview Questions": "Where do you see yourself in ten years."}, {"date": "9 May 2014", "title": "RN Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Steward Health Care System (Westwood, MA) in Jan 2010", "Interview Descriptions": "Was brought into the company by my former boss. Very informal interview. I already knew everyone I met with so the whole process was a folrmality. I was brought in at 9AM and met with 3 managers for 30 minutes each. I was out the door by lunch time.", "Interview Questions": "N/A"}]]