[[{"date": "6 Jun 2023", "title": "Financial Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New Mexico State University (Las Cruces, NM)", "Interview Descriptions": "Two step interview. First one is straight to point. Second interview is a presentation. Both interviews you have a panel individuals observing you throughout your interview. Both interviews ranged from an hour to two hours.", "Interview Questions": "What would you do if you didn’t get along with someone you worked with?"}, {"date": "7 Feb 2023", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New Mexico State University", "Interview Descriptions": "it was good nothing was too bad about it was actually not bad I liked it was not bad everything went well and smoothly so I felt good about it.", "Interview Questions": "How do you describe yourself?"}, {"date": "4 Feb 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at New Mexico State University", "Interview Descriptions": "I complete a full day virtual interview over Zoom. I had meetings with the dept faculty and dean. They were very organized and upfront with me about expectations. Very friendly interactions.", "Interview Questions": "How does your work interface with that of your advisor's?"}, {"date": "11 Mar 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New Mexico State University (Las Cruces, NM) in Apr 2020", "Interview Descriptions": "It was a typical interview for an academic job. Most of the questions are related to research, teaching styles, and services.  Courses taught and my previous experiences. Eligibility to work in US.", "Interview Questions": "Typical questions on teaching and research plans"}, {"date": "2 Feb 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at New Mexico State University (Las Cruces, NM) in Jan 2020", "Interview Descriptions": "I walked into the main office and asked if anywhere on campus was hiring. Thirty minutes later I had the job as a student aid in the Dean of the Engineering Colleges office.", "Interview Questions": "If I would be able to show up on time and perform any reasonable task they needed me to in a timely manner."}, {"date": "11 Oct 2019", "title": "Researcher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Mexico State University", "Interview Descriptions": "A brief introduction of their university and department, communication over projects and potential work, nice people and interesting work and projects, but the position is not as competitive as the others I interviewed.", "Interview Questions": "expertise"}, {"date": "1 Jun 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at New Mexico State University (Las Cruces, NM) in Jan 2019", "Interview Descriptions": "It is a study job, The interview was a one on one interview with the professor you will be working with. The interview lasted for ten minutes of basic interview questions. Talked about research and some other academic works that I have done in the past.", "Interview Questions": "Do you have experience working as a graduate assistant?"}, {"date": "9 Apr 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Mexico State University in Dec 2018", "Interview Descriptions": "Video interview, 30 minutes. Four professors asked questions by turns. 2 questions for each, Some are nice, but some didn't even talk. They cared about grants more than the research and teaching.", "Interview Questions": "Talk about your research? What is your teaching philosophy? Do you have any grant experience?"}, {"date": "6 Jul 2018", "title": "Assistant Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at New Mexico State University", "Interview Descriptions": "Skype followed by in person interview. Was a panel followed by various stakeholders and tours of facilities. Was a series of about 6 interviews over a multi day process. Was very friendly and conversational.", "Interview Questions": "Tell us about yourself."}, {"date": "2 Jul 2021", "title": "Public Health Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at New Mexico State University in Mar 2018", "Interview Descriptions": "Use the STAR method to answer behavioral questions:\n\nS ituation — the context of what happened\nT ask — what you were supposed to do\nA ction — what you did to accomplish the task\nR esult — what you accomplished", "Interview Questions": "Related on my general skills"}], [{"date": "8 Feb 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at New Mexico State University (Las Cruces, NM) in Jan 2018", "Interview Descriptions": "A friend of me recommended me and then the process was so fast. They contacted me to send them my resume and then they called me to see my availability to have an interview. They were so flexible because I was out of town and they were agree to have a Skype interview. They hired me the next day.", "Interview Questions": "How do you feel speaking in front of people?"}, {"date": "19 Jul 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Mexico State University", "Interview Descriptions": "I went in for an interview scheduled with the program director, but instead was interviewed by someone else. It was about 20 minutes long and not many questions were asked. \r\n\r\nIn the end, I believe that they had a candidate already selected for the position, but due to HR regulations, they were required to interview a minimum number of people. This is because the \"position filled\" email was sent 24 hours after my interview.", "Interview Questions": "How do you handle competing priorities in a busy and sometimes hectic office space?"}, {"date": "28 Mar 2021", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Mexico State University (Las Cruces, NM) in Jan 2017", "Interview Descriptions": "Straight forwards cookie cutter questions. Information regarding working hours and responsibilities. Job requirements and proper work study paperwork on hand. 1-2 week process. Simple and quick process once interview has been conducted", "Interview Questions": "Work study students can work up to 19 hours a week. Does this align with your interests?"}, {"date": "19 Oct 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at New Mexico State University", "Interview Descriptions": "Got three references within the college of business. Interview included basic questions about my grades, what classes I like the most and why did I specialize in a certain department and what I would like to do in the future. Interviewd with 2 different people within the college of business and was mostly conversational. Felt more comfortable as I knew the professors beforehand.", "Interview Questions": "What are you going to do with the degree you get here after graduation?"}, {"date": "1 Feb 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at New Mexico State University in Sept 2016", "Interview Descriptions": "Applied online to graduate school. Received acceptance letter three months later. Gave me 2 weeks to accept the offer. Accepted after one week. The official letter came through mail within two weeks.", "Interview Questions": "None. Al contacts were through email."}, {"date": "17 Aug 2016", "title": "Professional Development Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at New Mexico State University (Daytona Beach, FL) in Jun 2016", "Interview Descriptions": "I was interviewed by the Marketing Director who spent approx. 90 mins. with me asking many questions and giving me two tests, including a personality test. This came AFTER I had spent 4 hours at home on-line filling out the application and completing other required tests to get to the first interview. The process consists of the above plus two additional interviews, the last with the company CEO.  --- Despite, or maybe because of, my considerable experience and expertise in the field, I was not asked in for a second interview. I'm not sure if it was because I have a PhD and 20+ years of experience and the position called for a Bachelors degree and two years experience, or because I have silver hair and the person interviewing me appeared to be twenty-something. Perhaps I didn't get another interview because I suggested that, based on the job description they advertised, the company required an individual with far more knowledge, skills, and abilities to accomplish the goal they sought to achieve.", "Interview Questions": "How much I wanted to be paid."}, {"date": "23 Aug 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New Mexico State University in Jun 2016", "Interview Descriptions": "The interview process was focused on behavioral questions . There were 4 interviewers (panel interview) who took turns asking me questions. All questions were already printed out (~10-15 questions), reviewers were taking notes.", "Interview Questions": "What would be the first 5 thing you did at this job?"}, {"date": "8 Nov 2017", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in Jun 2016", "Interview Descriptions": "Phone interviews, followed up by an on-campus visit that was over the course of one day.  I had sessions with multiple campus partners and stakeholders.  It was a very redundant process, and they also brought me in against someone I was competing against which was awkward.", "Interview Questions": "What is some of the current trends impacting students in Higher Education."}, {"date": "9 Mar 2016", "title": "Student Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Mexico State University", "Interview Descriptions": "Fast.\r\nI applied and then I was called for an interview.\r\nLater that same day they called me with an offer and I started working within the week or the week after that.\r\nThere was two people interviewing but they were very nice, I was very nervous and I still got the job.", "Interview Questions": "Basic interview questions"}, {"date": "13 Jan 2017", "title": "Lab Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in Oct 2015", "Interview Descriptions": "It's not lengthy and it's real simple. The usual questions you can google about in basic interviews. I interviewed with the manager and her assistant. You do the usual introductions and then tell them a little about yourself. Then they ask you simple questions and you answer it. They ask if you have any other questions, and then you're off on your way.", "Interview Questions": "What was is your strength/weakness?\r\nThere are good and bad weather, how do you feel about working in harsh conditions?\r\nWhat is your availability like?\r\n"}], [{"date": "24 Feb 2016", "title": "Guest Services Event Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New Mexico State University (Las Cruces, NM) in Sept 2015", "Interview Descriptions": "Submitted application online, was called to come for a group interview a week later. Showed up to interview with 40 or so other people. The whole interview lasted about two hours. Interviewers were late to begin but acted professionally. Board of 5 managers made up the interviewers and they took turns asking questions.", "Interview Questions": "What does customer service mean to you?"}, {"date": "3 Oct 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in Aug 2015", "Interview Descriptions": "Met with two hiring managers. Was able to chat about experience, past work history, etc. Felt pretty laid back and not stressful. The two ladies conducting the interview were very upbeat and made the process less stressful.", "Interview Questions": "Why I felt like I would be able to work with students?"}, {"date": "7 Mar 2017", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at New Mexico State University in Jul 2015", "Interview Descriptions": "A phone interview in April and a four hour plus Skype interview in July. I was not offered the opportunity to fly out for an on-campus interview which I really wish I had.", "Interview Questions": "What are your feelings regarding first generation students?"}, {"date": "19 Apr 2015", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Mexico State University", "Interview Descriptions": "I had a phone interview and two Skype interviews.  I was then invited to campus.  The on-campus was a day long interview.  They housing me in a residence hall they were about ready to shut down for good.  Process was very smooth and moved very quickly.  They kept me informed of their process the entire time.  Very helpful when I had questions.", "Interview Questions": "The student staff asked this question:  Red or Green?  It is a reference to the type of chili pepper you like most."}, {"date": "14 Jun 2015", "title": "IT Support Tech Senior Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in Apr 2015", "Interview Descriptions": "I received a phone call from the Hiring Department, asked me for my available time. I was interview by  the superior and two other teach in the in same room. It was an easy interview question about how would I deal with technical issues. What technologies I am know.", "Interview Questions": "Technical and behavioral questions. For instance, how you would deal with higher  level stuff members."}, {"date": "12 Jan 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at New Mexico State University (Las Cruces, NM)", "Interview Descriptions": "Contacted one of the lead engineers in the department I wanted to work in, they led me to another engineer who was looking to replace the current student who was graduating. Sent a resume, the engineer called me to set up an in-person \"casual\" interview at their building just to make sure I could communicate to others and would fit into the culture. While touring the department, staff repeatedly asked me when I started (as if I had already been offered the job), by the end of the interview I was offered on the spot. Coming in seemed to just by a formality to see if I could work there and if I wanted to work there. Everything was very casual. Had to bring an ID to sign into the secure building for the interview", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Nov 2018", "title": "Extension Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at New Mexico State University (Las Cruces, NM) in Nov 2014", "Interview Descriptions": "For this faculty (Ph.D.) position, I was \"interviewed\" over a two-day period. The process consisted of presentation to faculty members including the Dean, one-on-one interviews with other faculty members and county faculty members, city private tour, plus a lunch and dinner with with different faculty members.", "Interview Questions": "What was your conclusion in your dissertation?"}, {"date": "23 Jun 2014", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at New Mexico State University", "Interview Descriptions": "I contacted the supervisor by email about the job, which I found online advertisement. The supervisor contacted me in a day or so by email, and we set up for the phone interview in few days. After the interview, I officially applied though NMSU online application system. After they got all the necessary documents from me, I got offer letter. the entire process took about 3 weeks.", "Interview Questions": "N/A"}, {"date": "19 Nov 2015", "title": "Work-Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in Apr 2014", "Interview Descriptions": "The interview process varies depending on where you would be working. For me it was very simple as I was interviewing for a clerical position. I applied through the career services website and was interviewed 1:1 within a few weeks. I received an offer from the department shortly after and accepted.", "Interview Questions": "General question about time management, prior experience, and willingness to commit to job."}, {"date": "4 Mar 2014", "title": "Extension Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at New Mexico State University", "Interview Descriptions": "Extension (outreach) plan presentation, which was followed by Q& A about anything. Extension Dean was also present. There were greet and meet with other faculty members and professionals. One-to-one interviews with Department Head and Extension Dean. Oh! And there was lunch with faculty and county agents (faculty). Everyone was nice.", "Interview Questions": "Experience dealing with diversity audience? What do you do when county agents or faculty do not contact you for programs?"}], [{"date": "14 Dec 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at New Mexico State University (Las Cruces, NM) in Jan 2014", "Interview Descriptions": "one on one interview, took about 30 minutes, They called me to fix an appointment for the interview. Then the interview happened. They said they will tell me next week. The after that week I got a call from higher person and they told to come to the office for hours and salary.", "Interview Questions": "are you a fast learner ? tell me about yourself."}, {"date": "12 Jun 2017", "title": "Student Affairs Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at New Mexico State University (Las Cruces, NM) in Nov 2013", "Interview Descriptions": "Group interview with required presentation. Lengthy process based on HR procedures. No firm handshake left me with a strange feeling. After preparing extensively for the interview and receiving the offer I declined the position .", "Interview Questions": "What is one mistake you've made and how did you address it."}, {"date": "18 Sept 2017", "title": "Admin Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New Mexico State University (Las Cruces, NM) in Sept 2013", "Interview Descriptions": "It took a long time after applying to get an interview.  Once the interview was set, it took a long time to get a call back with any kind of news.  The actual hiring process is quite lengthy and full of bureaucracy.", "Interview Questions": "Why should we choose you over any other candidate?"}, {"date": "23 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New Mexico State University in Aug 2013", "Interview Descriptions": "Spoke on the phone to a professor (now my advisor). We hit it off immediately, and he was extremely friendly and accommodating to my slightly nervous disposition. I was informed about the nature of working in the environment NMSU provides, and the expectations of me from the department. I was also informed about lifestyle and recreational opportunities at Las Cruces (not much, but nice to be informed).", "Interview Questions": "Why did you pick NMSU for grad school?"}, {"date": "7 Aug 2016", "title": "Usher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in May 2013", "Interview Descriptions": "I interviewed with one other candidate and was questioned by two people. The questions were simple and common-sense based. I made sure to confidently answer before the other person I was being interviewed with but in the end we both got hired.", "Interview Questions": "What would you do if you encountered a lost child?"}, {"date": "24 Jun 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in May 2013", "Interview Descriptions": "formal educational interview, asked about my educational background, which area I am interested in, what do I like to do, what is my future plan, what do I want to do after getting a US degree from New Mexico State University", "Interview Questions": "do I have any papers"}, {"date": "6 Apr 2016", "title": "Temporary Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at New Mexico State University (Las Cruces, NM) in Aug 2012", "Interview Descriptions": "It was very easy. My qualifications were verified, and I was hired on the spot. I felt that they were trusting, easy to work with, and professional all the way. When I would receive a further call back to work again, I found the process to be painless, professional, and easy to navigate.", "Interview Questions": "Q: What do you have to offer us that no one else does?"}, {"date": "6 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New Mexico State University (Las Cruces, NM) in Feb 2012", "Interview Descriptions": "Talk to potential supervisor, discuss relevant experience, answer normal interview questions (strengths, weaknesses, etc.).  Talked about previous projects that I had worked on in the past.  I was asked to email the supervisor a writing sample after the interview. We shook hands and I left feeling fairily positive about the whole experience. I made sure to send thank you emails to every person on the interview committee shortly after I got home from the interview. I did not hear back from them for several days.", "Interview Questions": "I was asked to describe my abilities to work in groups."}, {"date": "17 Jan 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at New Mexico State University (Las Cruces, NM) in Jan 2012", "Interview Descriptions": "Interviewed with a professor, then when admitted into a lab I applied to the department.  Because there is a 50 word minimum I will also say that if you have a lab to support your research you will be able to enter the department as a PhD seeking student.", "Interview Questions": "Why did I want to pursue a PhD?"}, {"date": "21 Aug 2013", "title": "Social Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in Oct 2011", "Interview Descriptions": "I applied using an online database. I got a call telling me I was selected to be interview for the position and to call back. Then we schedule the interview for next week and 5 members of the Career Services Office were involved in the interview process. I showed some of my work samples and explain it to them. Finally I received a call and an email telling me that if I were interested about the position.", "Interview Questions": "I did not expect to be interviewed by 5 people. "}], [{"date": "13 Aug 2012", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at New Mexico State University (Las Cruces, NM) in Jul 2010", "Interview Descriptions": "This position is based on your undergrad GPA and \"personal connections\". Many accepted graduate students are mislead into believing they will be given consideration for a position after they commit but are often not offered such hours.", "Interview Questions": "Just the application process was confusing. "}, {"date": "28 May 2014", "title": "Drafting Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at New Mexico State University (Las Cruces, NM) in Jan 2010", "Interview Descriptions": "Great experience, good people and a honest assessment. The interview knew what questions to ask to find the best person for the job. When it came to the drafting test, he knew exactly how to administer it.", "Interview Questions": "Where do you see yourself in ten years?"}, {"date": "20 Aug 2009", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at New Mexico State University (Las Cruces, NM) in Mar 2009", "Interview Descriptions": "Professional and no surprises.  It was pretty straightforward.  They were mostly interested in technical skills - the ones specific to the job.  I got the impression that they preferred an exact skillset over the best person for the job concept.\r\n\r\nThe phone interview was very straight forward.  They didn't plan it in advance but they were only looking to make sure you met the basic requirements and were setting up an on site interview later.", "Interview Questions": "N/A"}]]