[[{"date": "24 Mar 2023", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "The interviewers were really nice and enjoy talking about their research. Some of them enjoy talking with you about anything to everything, and make you feel at ease. But that also depends on which lab you interview with.", "Interview Questions": "Where do you see yourself in 5-10 years?"}, {"date": "7 Apr 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School in Mar 2023", "Interview Descriptions": "Three rounds of interviews one with hiring manager, one with team and one with VP. The hiring manager and team interviews were great, they seemed really great. The one with the VP , not so much. Vague questions expecting specific answers.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School in Mar 2023", "Interview Descriptions": "Interviewers were great! Asked great questions and very considerate of my answers. Definitely reviewed my resume before. Provided some honest answers to my questions that I did not expect. The team seemed very passionate about the research project.", "Interview Questions": "Most important question was \"what motivated you to apply for this position?\""}, {"date": "17 Jan 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMass Chan Medical School", "Interview Descriptions": "Super easy! Seemed like it was organized and they were friendly! Would recommend. Not too many rounds and didn’t feel like it was drawn out. Did a good job and seemed to do well and got along", "Interview Questions": "What are some of you strengths"}, {"date": "18 Dec 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Really nice and friendly staff. Director was very attentive of my questions and concerns. Interview felt very comfortable. Director let me know that I would hear back whether it was good or bad news .", "Interview Questions": "Asked about my knowledge with project lifecycle"}, {"date": "6 Nov 2022", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "first round: 30 min screening interview. Talked about experiences on resume. Second round: did a practice (1.5 hours) then discussed the answer with the PI (30 min) Third round: interviewed with another 3 people. Mostly behaviour questions", "Interview Questions": "Why are you interested in this position"}, {"date": "9 Aug 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "First round was a virtual screening  phone call, followed by a virtual interview with prospective team. Was shocked by how low the salary offer was, tried to negotiate and was given 24 hours to accept or decline by HR. Then had to complete background check for past 7 years which was confusing and stressful.", "Interview Questions": "How would you manage multiple competing priorities"}, {"date": "24 Jul 2022", "title": "Clinical research budget analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at UMass Chan Medical School in Jul 2022", "Interview Descriptions": "There were 3  interviews with various members of the Clinical Research Operational team.  I didn't have prior experience in budgeting or working on industry-funded research, but the team was able to find connections between what the job requires and in what tasks I did have former experience (e.g., writing and interpreting detailed protocols, drafting SOPs and project timelines, etc.). They made sure I understood how different my previous roles were to what the job would entail, but responded well when I explained that I like a work environment that challenges me. Overall, it was a great interview process. \n\nThey were urgently hiring, so all the interviews took place within a week. I'm not sure how long it may have taken if they weren't urgently hiring.", "Interview Questions": "How do you handle competing deadlines and priorities?"}, {"date": "15 Jun 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UMass Chan Medical School (Boston, MA)", "Interview Descriptions": "I had a couple of virtual interviews.  A couple people were OK but one person was rude.  2 months later she emailed me asking to call her, which I did.  She was rude again and then I never heard from her.  She asked me to send her the presentation that I had done over the interview but apparently did not want to hire me.  I felt like she wanted to use my material for free.  Very bizarre.", "Interview Questions": "Which jobs on your resume were contract or part-time?"}, {"date": "22 May 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Worcester, MA) in May 2022", "Interview Descriptions": "The interview process was easy and quick! After applying to a few positions, I received two requests to interview in just two days! From my experience, the interview itself was more of a conversation getting to know the PI than a formal interview.", "Interview Questions": "What type of researcher experience do you have?"}], [{"date": "25 Feb 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UMass Chan Medical School", "Interview Descriptions": "The interview process at UMass Chan Medical School was thorough and timely.  UMass communicated with me throughout the process.  I met numerous people which helped in my decision process.  Their interview process is better than most in the industry.", "Interview Questions": "How do you establish the key needs in a project?"}, {"date": "29 Jan 2022", "title": "PhD In Biomedical Sciences Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UMass Chan Medical School (Worcester, MA) in Jan 2022", "Interview Descriptions": "35 min of interview with three faculty members. You can select the faculty members and date you want but you may not be able to have interview with a faculty member who conducts research on your interested field because the selection of faculty member is rolling basis and most of faculty members would not participate in official interview.", "Interview Questions": "A specific question from the faculty members' recent study. i.e., To find novel antitumor agents utilizing toxic metabolite generated in endogenous metabolism, which protein (enzyme, transporter, etc.) would be most appropriate?\r\nTransporter (I have already read the publications of each faculty members which published in past three years and I was able to know the purpose of this question)"}, {"date": "4 Feb 2022", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Jan 2022", "Interview Descriptions": "After a long wait post-application submission, a PI reached out to schedule a virtual interview; met with PI and discussed my experience and the open position. The interview lasted about 30 minutes.", "Interview Questions": "Describe your professional and/or academic research experience."}, {"date": "21 Dec 2021", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMass Chan Medical School", "Interview Descriptions": "The interview was fairly quick and over zoom. Met other people in the lab before starting. Talked about my research and how I could contribute to ongoing projects. Was offered the job days later.", "Interview Questions": "Please describe your previous research experiences."}, {"date": "20 Dec 2022", "title": "Sr. Manager, Operations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at UMass Chan Medical School in Aug 2021", "Interview Descriptions": "Casual, virtual, fast. Took a while to get a formal offer even after positive interviews. Interviewed with 2 different current staff members and the recruiter. Good to brush up on the current strategic plan of Umass Chan, which is public, to get a feel for the University's objectives. Checked references last.", "Interview Questions": "What do you want to do? What types of stakeholders have you interacted with?"}, {"date": "22 Jul 2021", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Jul 2021", "Interview Descriptions": "Fairly simple, one over the phone interview with HR. One panel style zoom interview. Typical \"Describe your experience\" questions\" and \"How do you work in teams\". Interview was only 30 minutes and covered all your typical questions. One thing that I was rather taken back by was when they finally made me an offer for the position, it was 20% less than what I put on the application. I advised HR after being offered the job that I couldn't accept at the offered salary and they came back with an offer 15% below what I put on the application. The process was simple, I just wish they didn't waste my time or theirs and just looked at what I was looking to make.", "Interview Questions": "What experience do you have working with teams and different personalities?"}, {"date": "15 Jul 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (New York, NY) in Jun 2021", "Interview Descriptions": "The issue was after presenting to about 5 different groups of people, the committee did not have the courtesy to send an email to say you did not get the position. This is unprofessional.", "Interview Questions": "The typical interview questions. Asking about strengths and difficult situations."}, {"date": "6 May 2021", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMass Chan Medical School", "Interview Descriptions": "Phone interview initally with the PI, then a video meeting with the whole team, very easy going and informative. No presentation required, got a good feel for the dynamics of the group through this format.", "Interview Questions": "Describe your career path up to this point?"}], [{"date": "20 Sept 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UMass Chan Medical School", "Interview Descriptions": "I received an email asking if I wanted  an interview and was easily able to visit the campus. I received free parking for the day and met several lab members in the medical school for an interview.  The interview lasted about 1 hour.", "Interview Questions": "What interested you about this position?\r\nTell me about yourself.  "}, {"date": "20 May 2021", "title": "Project Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School in Aug 2020", "Interview Descriptions": "I had interviewed with a few people that were associated with the project. They were all friendly and available for follow up questions. The HR contact with the offer was also very helpful and could answer my questions.", "Interview Questions": "Why are you interested in this position?"}, {"date": "2 Apr 2020", "title": "Physician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Great. Was a standard interview nothing crazy. I don’t have much to say about the interview. Was pretty basic and they gave me a tour.  I was overall happy with it but didn’t move on to the next step of the process.", "Interview Questions": "N/A"}, {"date": "27 Feb 2020", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UMass Chan Medical School (Worcester, MA) in Jan 2020", "Interview Descriptions": "Exhausting and pointless, the interview process was a sub human process that defies reason.  I was left with teh impression that there was a favored candidate and that my efforts were all in vein. I would not recommend considering Umass Med.", "Interview Questions": "why do you want to leave your current position"}, {"date": "11 Sept 2019", "title": "Policy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UMass Chan Medical School (Boston, MA)", "Interview Descriptions": "30 minute standard phone screen interview process with HR followed by a chat with a member of the staff. Took a few weeks for this process to occur. \r\nOffice is located in Boston, and I applied for the position online via Glassdoor.", "Interview Questions": "Why are you interested in UMASS Medical School? "}, {"date": "28 Aug 2019", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Around end of January-beginning of February a day long interviews are held in campus- Worcester,MA . You will ideally meet with 5 PIs for your interview and discuss your research, their research, how good  of a school UMass is etc", "Interview Questions": "They will ask about your previous projects and try to dissect what your role in that process? Then they will talk about their own project and will probably expect you to comment on some of the issues he raised along the way. "}, {"date": "29 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "PI got in touch and I had interview with the lab. I had the lab tour and talked to each member of the lab. After I got the offer, HR got in touch with the official letter.", "Interview Questions": "Q: previous research experience and future plan"}], [{"date": "11 Feb 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Sent in application and within two weeks I was reached out to by the PI to set up an interview. For the interview, I first met with the PI and then with each of the members of the lab individually. Each of the interviews were very relaxed and comfortable!", "Interview Questions": "What is your previous research experience?"}, {"date": "18 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Feb 2019", "Interview Descriptions": "I applied to the position via the online career portal and received an email from the PI within two weeks time. The PI laid out the job description and what type of research work I'd be doing under her supervision and asked if I was interested. I responded that I was interested and she asked to speak on the phone to get to know me better. After the initial phone screening, she invited me in for an in-person interview. The interview was very informal and mostly consisted of a lab tour and asking about my research experience and interests. I was offered the position 2-3 weeks later via phone.", "Interview Questions": "What are your plans in the next few years?"}, {"date": "28 Feb 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Dec 2018", "Interview Descriptions": "Emailed for job, easy discussions with lab PI and members for experience and overall fit. Did 1x1 with PI and met with members of lab in smaller groups. Mostly informal and when they decided they wanted to hire me the official job posting was made and offer extended", "Interview Questions": "What is your relevant experience?"}, {"date": "9 Nov 2018", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "fair interview process. took about 4 weeks from the time of submission of resume. HR , technical, hiring manager rounds of interviews. on location interview process. it was all done within one day and then heard from HR about 10 days after that", "Interview Questions": "java and oracle related questions"}, {"date": "21 Jun 2018", "title": "Case Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Interview was set up by temp agency. In interview, job was described in detail,  they were friendly yet still professional, and they asked the usual interview questions. Employers/company gave off a great vibe and great atmosphere", "Interview Questions": "How might you handle yourself with a disgruntled customer"}, {"date": "25 Jan 2019", "title": "Research Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Jun 2018", "Interview Descriptions": "Met with 2 PI's and other member of the lab to discuss what their lab was about. They asked me a couple of questions to see how familiar I was with lab equipment and terminology as well as the scientific process.", "Interview Questions": "How familiar are you with cellular biology and do you know what RNA and DNA do for a cell?"}, {"date": "11 Oct 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School in Apr 2018", "Interview Descriptions": "Facility seemed dated, met with the PI, and had a pretty good talk with him about his work, my background, and my ambitions.  After that I talked to two other PhD researchers that do work in that lab.  Seemed to go well, but they went with another candidate.", "Interview Questions": "One of the interviewers asked how PCR worked."}, {"date": "3 Dec 2019", "title": "Data Entry Operator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Jan 2018", "Interview Descriptions": "Got an e-mail if I'm interested in the position. Did some online tests which was mostly practice for the work and typing tests. After this was completed and passed, I got an e-mail to schedule an in-person interview.  I received a call with an offer after about 2 weeks.", "Interview Questions": "Tell me about yourself"}, {"date": "22 May 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UMass Chan Medical School (Worcester, MA) in Jan 2018", "Interview Descriptions": "-30-minute interview outlining relevant coursework, past research experience\r\n-interests, assessing my knowledge on lab's research\r\n-very kind, understanding\r\n-accommodating on date and time of the interview\r\n-screened for GPA, major\r\n-I was allowed to tour the entire and meet the principal investigator to get a better understanding of my role as an undergraduate research assistant", "Interview Questions": "What projects interest you and why?"}, {"date": "1 Jun 2018", "title": "Project Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Dec 2017", "Interview Descriptions": "I applied online and heard back two weeks later for an in person interview, which lasted one hour. Standard interview questions. Following this, I had a second interview with one of the project leads and a third interview with team members. The latter two asked field specific questions, while the first interview focused on skills for the position.", "Interview Questions": "Why would you like to work for UMass Medical School?"}], [{"date": "11 Jul 2017", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Applied to the position online through the career website and was contacted almost a month later to schedule an in-person interview. Got asked a few questions and was shown around the lab.", "Interview Questions": "What other lab techniques can you offer?"}, {"date": "16 Jul 2017", "title": "IT Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Shrewsbury, MA) in Jul 2017", "Interview Descriptions": "The interview took 3+ weeks consisted of three rounds.\r\nFirst  \r\nHR screening call lasted for 30 mins.(Brief you more about job and responsibility)(Tell me about yourself. What are your strength and weakness? Walk me through one of your Data Analysis projects.)\r\nSecond \r\nOnline Assessment consists of 30 questions each  Excel, powerpoint, Word, Outlook.(Try to score at least 25 in each).\r\nThey also send the report of your assessment. \r\nThird\r\nOnsite interview with Project Manager.", "Interview Questions": "Onsite interview questions\r\nLearn about the company from the website.\r\nPractice basic database and data analysis interview questions."}, {"date": "30 Jul 2017", "title": "IT Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (South Shrewsbury, MA) in Jun 2017", "Interview Descriptions": "There were in total 3 rounds of interview and the entire process took more than 3 weeks. \r\n1st Round - HR screening\r\n2nd Round- Online assessment\r\n3rd Round F2F with hiring manager", "Interview Questions": "Tell me about your data analysis experience. \r\nWhat tools have you used?"}, {"date": "11 Sept 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Worcester, MA) in May 2017", "Interview Descriptions": "The interview was simple and had multiple portions within the day. Met with several members of the department as well as department head. There were simple questions to get a sense of my experience and work ethic but most importantly my sense of professionalism and benefit I could bring/receive from the internship.", "Interview Questions": "How might you approach working on [blank] for us?"}, {"date": "2 Oct 2017", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Apr 2017", "Interview Descriptions": "Submitted online, initial phone interview, then an in person interview followed by formal offer two weeks later. Interviewer was my direct supervisor, program director and current employee also interviewed me.", "Interview Questions": "What relevant experience do you have"}, {"date": "12 Feb 2018", "title": "Benefits Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School (Shrewsbury, MA) in Mar 2017", "Interview Descriptions": "They emailed me for a phone interview and then called me in for a in person\r\nIt was a quick and easy process  and the people were great. The overall process was very organized", "Interview Questions": "My  strengths and weaknesses "}, {"date": "15 Jul 2019", "title": "Regulatory Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School in Feb 2017", "Interview Descriptions": "A half-day in person interview with a few key members of the team. This was after a phone call asking if I was still interested. Then it took a week or so to hear about their decision.", "Interview Questions": "Usual questions, but asked a lot about ethics, regulatory issues, confidentiality, and working with challenging personalities. "}, {"date": "3 May 2018", "title": "Environmental Health and Safety Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School in Oct 2016", "Interview Descriptions": "It started by a recruiter contacting me, then the hiring manager along with other mangers in the department and director. I believe 4 interviews total. They asked a lot of questions, each interview lasted about an hour.", "Interview Questions": "How do I manage multiple projects?"}, {"date": "5 Jun 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UMass Chan Medical School (Shrewsbury, MA) in May 2016", "Interview Descriptions": "Simple basic questions. Wanted to know if you were a fit for the company. Everyone was really nice and expressed the culture of the company well. I was also screened by a department employee.", "Interview Questions": "Tell me a time you overcame adversity to reach a goal ?"}, {"date": "25 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMass Chan Medical School", "Interview Descriptions": "1) Phone interview, which led to an in-person interview. The latter was very relaxed and informal. Just wanted to talk to me in person before I started.\r\n2) Asked about my previous lab experiences and was briefed about what the lab does.\r\n3) Discussed about possible project.", "Interview Questions": "What relevant classes have you taken during college?\r\nHave you ever worked in a clinical lab?"}], [{"date": "2 Mar 2016", "title": "Bioinformatician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMass Chan Medical School", "Interview Descriptions": "A short tour within the hospital and research facility. Many employees there look very nice. Worcester is a nice town to live. I also talked to every colleague that I will potentially work with. They are all very nice. I also did a presentation on my past projects, which received positive feedback from the audience.", "Interview Questions": "They asked me some basic algorithms, like sorting, removing duplicates, finding overlaps. They also tested my python coding."}, {"date": "9 Apr 2016", "title": "Grants & Contracts Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Mar 2016", "Interview Descriptions": "Was called to come in at a mutually convenient time for interview. Set up a time to go in and was interviewed separately by 3 different people that I would work with. Was called in a second time and met with the team I would work with. Also met with the Director of the group during the second interview.", "Interview Questions": "Tell us why we should hire you over other candidates?"}, {"date": "21 Mar 2019", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Worcester, MA) in Feb 2016", "Interview Descriptions": "Called for a presentation, you will be giving a presentation to the department and questions will be asked. You will be toured the labs and introduced to the co workers and finally a one and on meeting with the Professor.", "Interview Questions": "Why do you wanna join our group?"}, {"date": "20 Jan 2020", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UMass Chan Medical School in Jan 2016", "Interview Descriptions": "They asked questions to gauge my science as well as my personality. Also, each interviewer explained to me their project and goals. There as plenty of opportunities for me to ask questions too", "Interview Questions": "Describe your project"}, {"date": "16 Jun 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Shrewsbury, MA) in Jan 2016", "Interview Descriptions": "we discussed my career goals and current interests in research as well as the design of the study in question. There was plenty of time for me to ask questions about methods and to get a feel for the work environment I would be joining. The interview was with both a research associate and with the principle investigator for the study.", "Interview Questions": "what my long term career goals were"}, {"date": "16 Mar 2016", "title": "Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at UMass Chan Medical School (San Diego, CA) in Oct 2015", "Interview Descriptions": "There was multiple times of phone interview with managers, director and HR related persons, and on-site presentation about my research, dinner with director.  After that, there was salary adjustment.  Also, my visa status was always asked in the beginning of interview with HP persons.", "Interview Questions": "My future plan for research field, academia or industry"}, {"date": "27 Oct 2016", "title": "Senior Compliance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UMass Chan Medical School (Boston, MA) in Oct 2015", "Interview Descriptions": "It was a two round interview process that took about 3 months from the time I applied to the time I accepted the offer. First I met with my future boss and a coworker. For the second interview I met with the Executive Director.", "Interview Questions": "They asked me why I was interested in this job?"}, {"date": "26 Aug 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at UMass Chan Medical School (Worcester, MA)", "Interview Descriptions": "Apply via application form. Took the GREs, applied through a standard process. After a few months, heard back and was invited to interview. Interview was a three day event, with presentations on the University itself and what research was done here (with example projects from current students). Interviews involved 5 one on one interviews with faculty, each being about 40 minutes long. Interviews involved talking about one's past research experience, and listening to current research by the professor themselves.", "Interview Questions": "Why do you want to come here to study research?"}, {"date": "15 Jun 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at UMass Chan Medical School", "Interview Descriptions": "I applied through my college job board. After I submitted my resume to the PI, I received a response within a week asking for a personal interview. During the interview, I met with the PI, along with other PIs in the department, and then took a tour of the laboratory that I would work in if I got the position. I was accepted a few days later through email.", "Interview Questions": "Why do you want to work in our laboratory?"}, {"date": "5 Oct 2016", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in May 2015", "Interview Descriptions": "interviewed with all staff in research department. Got a phone call a few days later with an offer from HR. They gave me a week to think about it and I accepted", "Interview Questions": "What are your short term goals (2-3 years)?"}], [{"date": "8 Jun 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UMass Chan Medical School (Worcester, MA) in Apr 2015", "Interview Descriptions": "I received an e-mail from the PI asking to arrange an in-person interview. At the interview, I met with the PI and a graduate student from the lab. The conversation was fine, but unfortunately it was clear they hadn't even glanced at my resume. My experience matched the job advertisement perfectly, but when I arrived at the interview the majority of job requirements were no where close to what the job ad described. Based on these new requirements, I was not a good fit for the position. I just wish they had looked at my resume before hand, or offered to talk to me on the phone to save me 4 hours of driving.", "Interview Questions": "Why did you get your Master's degree?\r\nWhat techniques would you feel comfortable doing if you walked into the lab tomorrow?"}, {"date": "16 Apr 2015", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at UMass Chan Medical School (Worcester, MA) in Apr 2015", "Interview Descriptions": "I contacted the PI directly via his profile/lab page describing interest in working in his lab. The PI asked for my resume, list of references, unofficial transcript, etc. We then had a Skype interview for an hour to discuss future goals, interest, and potential research projects that I may work on.", "Interview Questions": "What are you future goals?"}, {"date": "10 May 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Mar 2015", "Interview Descriptions": "The interview process was great. I was contacted by my boss via email and we arranged a preliminary interview over the phone. Then I came to the Medical School for an in-person interview. My boss is just great and she was very relaxed. I never felt intimidated or demeaned during my interview.", "Interview Questions": "What would I do if I had doubts about what to do"}, {"date": "26 Mar 2016", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Shrewsbury, MA) in Feb 2015", "Interview Descriptions": "I got a call to schedule interview.  I interviewed with 3 people and I thought it went well.  I got an email a few weeks later that I did not get the position.", "Interview Questions": "various questions asked"}, {"date": "31 Dec 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School", "Interview Descriptions": "phone and then 2 in person interviews to include in the hiring process  this was done by the HR department and not the hiring manager.  That is all I can say about the hiring process.", "Interview Questions": "why do I want to work in the public sector."}, {"date": "13 Jul 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Dec 2014", "Interview Descriptions": "Phone interview with the PI, followed by an on site interview. The phone interview was more of a conversation about my background. The in person interview took all day and I met with the PI, toured the lab and met other PIs in the department of Medicine.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "6 Feb 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UMass Chan Medical School (Worcester, MA) in Nov 2014", "Interview Descriptions": "The process began with a phone screen, then progressed to an in-person interview. Staff was extremely friendly and professional. All questions were expected. There were a few behavioral questions, so it's important to be prepared for those. Otherwise, nothing unexpected. Providing a sample of my work (e.g., writing sample) helped them better assess my skills.", "Interview Questions": "Please tell us about a time your had to handle a difficult situation with a coworker. "}, {"date": "17 Jul 2015", "title": "Bioinformatician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Nov 2014", "Interview Descriptions": "I first find the position online;\r\nI submit the job application online;\r\nI got response from the employer;\r\nI first interviewed by the hiring manager;\r\nthen I was scheduled to be interviewed by the department chair and other faculty members of the department;\r\nIt took one whole day on site.\r\nI then talked with HR.\r\nFinally I got hired.", "Interview Questions": "Why you want to work here?"}, {"date": "28 Oct 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Oct 2014", "Interview Descriptions": "Applied online. Interviewed within a week through Skype. Mostly HR type questions and took around 1 hr. Second round was presentation through Skype for about 1 hr, then received offer.", "Interview Questions": "Did you ever face with a scenario when you had to convince someone?"}, {"date": "8 Sept 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Extremely slow process and their Human Resources department is not helpful but only provided misinformation.  I was never told many things about the job until I was in it.  They expect you to do the job of two people and the salary is not sufficient enough for one person.", "Interview Questions": "What is your biggest fear about this job?"}], [{"date": "3 Sept 2014", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UMass Chan Medical School", "Interview Descriptions": "I was referred by another employee of the institution and as a result my resume was given top consideration. Process as straightforward and took less than one week. Met with two people and was given the job after the second interview.  Did not contact HR until after I interviewed with the PI.", "Interview Questions": "What did you like and dislike about your previous position?"}, {"date": "3 Oct 2014", "title": "Director of Applications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at UMass Chan Medical School in Sept 2014", "Interview Descriptions": "phonescreen by HR who asked the typical knockout question. Had 30 minute phone screen by hiring manager while driving.  While in two weeks had an in person one hour interview with hiring manager. She took no note and didn't appear to have defined questions. Was told it would be a few weeks until they scheduled second round interviews with larger group.  After a month with no communications, I followed up and was told \"we have decided to go in another direction.\"", "Interview Questions": "tell me about your biggest failure "}, {"date": "10 Sept 2015", "title": "Research Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Sept 2014", "Interview Descriptions": "I found the job on the UMMS site and applied online. I was contacted via email to set up an interview with one of the managing lab assistants. It was a simple one-on-one interview asking questions about my previous job and how comfortable I was with various lab techniques and other aspects of the job. I was asked about my future plans and if I was interested in pursuing more education, how long down the road, etc. It took about an hour. I was emailed about 5 days later to come back for another in person interview, this time with the three PIs of the lab one at a time. I was given a tour of the lab and met the other research assistants there. I was given plenty of opportunity to ask questions. I was emailed later that week with an offer.", "Interview Questions": "Do you plan on getting more education, if so when?"}, {"date": "26 Jun 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Jul 2014", "Interview Descriptions": "Applied online. Received an email from the lab manager. Interviewed directly with the lab. There was no phone screen. Job description was given (although it greatly changed from what I ultimately did after about a month). Technical questions regarding previous lab work was asked. It wasnt very long. About 2 hours in total. But the offer letter came after about a week or two.", "Interview Questions": "Technical questions about past work"}, {"date": "12 Jun 2014", "title": "Bio Statistician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at UMass Chan Medical School", "Interview Descriptions": "There are phone interview and on-site interview. Talked about the experience and background. There were not many technicall questions since it's for fresh graduate.", "Interview Questions": "The questions asked were easy.                                                                                                                                         "}, {"date": "13 Jun 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at UMass Chan Medical School (Worcester, MA)", "Interview Descriptions": "Guidelines, process, and practice are highly variable.  Presentation was given to those within Division, but was not advertised University-wide. No HR involvement until after I was hired.  Apparent subjectivity introduces distrust in process.", "Interview Questions": "What is the theme of your research program"}, {"date": "10 Jun 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMass Chan Medical School", "Interview Descriptions": "The PI called me and asked some technical questions, then offered me the position after receiving  my future research plans. The overall time is less than 15 minutes, shorter than I expected", "Interview Questions": "N/A"}, {"date": "30 Apr 2015", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Chan Medical School (Boston, MA) in Jun 2014", "Interview Descriptions": "Two interviews on two separate days. First interview was a rather lengthy interview, but was asked various questions on goals, interests, skills. Afterwards, was asked to come in for a second interview. The second interview was asked by a different set of people. They also asked questions to gauge my skills and interests. The second interview does seem to focus more on personality and the fit with the team. Afterwards, waited less than a week to receive an offer for the position.", "Interview Questions": "What would be the most difficult part of this job?"}, {"date": "29 Aug 2016", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UMass Chan Medical School (Worcester, MA) in May 2014", "Interview Descriptions": "Applied via online portal, was contacted within 48hrs by the department's administrative assistant to be invited for an interview. Interviewed the next day directly with the supervisor I was going to be working under, lasted approx. 20 minutes. Then interviewed with another member of the lab, and also with the employee whose position I was to be taking (he was still working there at the time), lasted another 20 minutes. The next day was invited back for a second interview with the department head, and the department manager/head admin, approx. 30 minutes total. That afternoon was contacted by HR with the official job offer, and was given up to 48 hrs to make my decision.", "Interview Questions": "Why I wanted to work as a research technician"}, {"date": "23 Nov 2015", "title": "Marketing Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UMass Chan Medical School (Shrewsbury, MA) in Apr 2014", "Interview Descriptions": "Started with a background check and initial phone screening with Office manager. Standard behavioral interview, met with Director of New Business and Associate Manager. Interview took 1 hour and just involved interview questions and more information about current business status. Very not stressful, I would recommend full professional attire.", "Interview Questions": "\"describe a time where you worked with a team and the project didn't go well\""}], [{"date": "4 Jun 2014", "title": "Research Associate II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UMass Chan Medical School (Worcester, MA) in Mar 2014", "Interview Descriptions": "Hiring is done primarily through the UMass HR website. The candidate will receive an email invitation for an interview. Some primary investigators like to do a phone interview first, others will do an in-person interview. In order to maintain due-diligence, all candidates are required to be asked the same interview questions. Any person involved in the hiring process is required to fill out a post-interview evaluation. The candidate with the highest evaluation score gets the job.", "Interview Questions": "The most difficult question was to give an oral summary of my work experience."}, {"date": "24 Oct 2013", "title": "Research Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 8 weeks. I interviewed at UMass Chan Medical School", "Interview Descriptions": "I moved with my supervisor to this institution. Since I was at instructor level on track for independence, I was allowed for a slight promotion to this position that allows independence.", "Interview Questions": "How did you handle difficult colleagues?"}, {"date": "13 Sept 2013", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at UMass Chan Medical School", "Interview Descriptions": "You may send email to the PI to ask if they have any openings there. Got phone interview and then onsite interview. Meet all the persons in the lab and give a talk. Talk with the PI and then get oral offer. official offer will send out in a few days.", "Interview Questions": "Why did you choose us?"}, {"date": "27 Jul 2015", "title": "ACIO - Project Management Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Sept 2013", "Interview Descriptions": "It was a three round interview process.  Phone and two face to face. Very collegial. Met with peers, staff and Sr. management. They explained in good depth the nature of the position as well as the current and future shape of IT.  They spent a good amount of time allowing me to get to know of the members of the staff.  During this time I got more comfortable with the type of environment that I would be working in.", "Interview Questions": "How would I transition staff from waterfall to Agile development framework?"}, {"date": "5 Aug 2016", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UMass Chan Medical School in Jun 2013", "Interview Descriptions": "Fast process nice people , good questions , \r\n\r\nIt was a good experience. Some behavior questions are tricky , be prepared , all questions on your resume\r\n\r\nVery detailed questions ,", "Interview Questions": "How you work under pressure"}, {"date": "20 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Very basic questions with a few bio related topics,along with programming questions", "Interview Questions": "Programming questions"}, {"date": "12 Nov 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UMass Chan Medical School (Bridgewater, MA) in Mar 2013", "Interview Descriptions": "Got a phone call for interview went to speak with the nursing unit administrator.She interviewed me and got all my credentials and told me that the HR will contact  and the HR contact me to offer me the job.", "Interview Questions": "Briefly describe yourself"}, {"date": "14 Feb 2013", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at UMass Chan Medical School", "Interview Descriptions": "Moved with lab so there was no interview process", "Interview Questions": "No relevant as I moved with my PI from a different place"}, {"date": "1 Mar 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Feb 2013", "Interview Descriptions": "If you are invited for an interview, you will most likely have interviews with 5 professors (either you chose previously depending on your interests or chosen by the school). These interviews are semi informal. Apart from these interviews, you will also have social time with current students or faculty members to learn about the school, program, etc.", "Interview Questions": "Why did you apply to UMass Medical School? What other schools did you apply? Did you get any offers from other schools you have applied? What are your research interests? "}, {"date": "7 Apr 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UMass Chan Medical School (New York, NY) in Sept 2012", "Interview Descriptions": "It was very brief for my case. I had a phone interview in the beginning. It was a direct conversation with the hiring faculty. A reference letter was required from my previous employer at that time. Decision was made within 2 days. I got the offer and gave an presentation after join.", "Interview Questions": "what's your experience and skills?"}], [{"date": "31 May 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Worcester, MA) in May 2012", "Interview Descriptions": "Selected based on online application, interview was over the phone, was very brief and two senior faculties were involved, then direct one-one after being selected as final candidate, prior supervisors were contacted for referral.", "Interview Questions": "Prior work experience, reasons for opting for this position, how soon are you looking to move etc."}, {"date": "13 Nov 2016", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at UMass Chan Medical School (Charlestown, MA) in Feb 2012", "Interview Descriptions": "They called in for an interview where you are reviewed by a team that has no expertise in your work. Sometimes it seems as they don't know what the job description is.", "Interview Questions": "What are the stages of a Product Lifecycle in RUP"}, {"date": "17 Aug 2016", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UMass Chan Medical School (Worcester, MA) in Jan 2012", "Interview Descriptions": "4 to 5 25-minute interview sessions with school faculty followed by reception. There was also a tour of the campus and presentations from current PhD students. We were each assigned a student guide to get us to our interviews.", "Interview Questions": "My research experience"}, {"date": "1 Sept 2015", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Chan Medical School (Worcester, MA) in Apr 2011", "Interview Descriptions": "Submit resume - wait a Long Time.  HR is really responsive once you are here, but very slow before you are called - months is the norm between submitting for a person and finally getting them in  the building.  Then get a call, schedule a face-to-face interview, get asked a few questions (nothing awful) about what you have done (general competency) and then shake hands and go home.  It is a union job, so I was asked if that was a problem - it was not.  I love unions.  They make sure you are treated like a regular person and nobody tells you that people are overpaid when they make a living wage.", "Interview Questions": "Can you find this room on the floor plan.  What did you do in the job you think was like this in the other hospital?  Are you available if the coverage for the next shift does not come in?"}, {"date": "15 Jun 2013", "title": "Instructional Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at UMass Chan Medical School (Worcester, MA) in Nov 2010", "Interview Descriptions": "I interviewed with 15 different people over 5 months. The process was a bit ridiculous for a low level project manager job making 60k.", "Interview Questions": "All the questions were quite easy. I was overqualified for the position it seems. "}, {"date": "23 Oct 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at UMass Chan Medical School (Worcester, MA) in Aug 2010", "Interview Descriptions": "2 informal (and informative) interviews in his office.  We discussed his research work in detail.  he asked me about my training and whether I thought I could solve the problems he was facing in his work.  We discussed what kind of software I'd written and my mathematical research and dissertation.", "Interview Questions": "This was not that kind of high-pressure interview.  We discussed his research work in detail.  he asked me about my training and whether I thought I could solve the problems he was facing in his work."}, {"date": "5 Nov 2012", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UMass Chan Medical School (Worcester, MA) in Jul 2010", "Interview Descriptions": "It was on Skype. Nothing special just chatted with my prospective PI", "Interview Questions": "He did not asked me anything since he knows me quit awile"}, {"date": "21 Apr 2012", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at UMass Chan Medical School (Worcester, MA) in Jan 2010", "Interview Descriptions": "The interview process was very easy an informal in my particular case. I was contacted via email asking to set up a phone interview, where I spoke directly with the person who became my supervisor. He explained the job to me, and did not ask extensive questions (I was expecting to have to explain myself much more). At the end he asked if this was something I was interested in, which obviously I was. He set up a 1 on 1 interview for later that week. I came in and spoke mainly with him, though he did introduce me to some other members of the lab. Again, this was very casual. After checking my references, I received an offer from the school, pending a check on my degree status. That went through very quickly and I started the job in a matter of weeks.", "Interview Questions": "Tell me about your previous work"}, {"date": "14 Oct 2012", "title": "Clinical Policy Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UMass Chan Medical School (Boston, MA) in Apr 2009", "Interview Descriptions": "The hiring process is painfully slow and will seem to have stopped.  After initial communication several weeks may lapse until the candidate here's from the employer again.  Often there is a disconnect between the hiring managers and the HR dept.  HR at this organization is TERRIBLE.  If you get to interviews, you'll likely meet with your future colleagues who are mostly bright, friendly, and underpaid.  Demonstrate that you're a good team player and detailed oriented.  Striking the right balance of reserved and out-going is key.  Good to air on the side of reserved.", "Interview Questions": "MassHealth is the biggest client of the organization.  Do your homework on MassHealth and  what comprises policy making.  You may get a question like, \"What would you do if you had a difficult client with whom you had to work?\"  "}]]