[[{"date": "26 Jul 2023", "title": "Account Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "The interview took place online. Be prepared for company culture, collaboration, and working with a team. Make sure your answers are organized. I was also asked questions about previous clients and past work challenges.", "Interview Questions": "The company culture and collaboration"}, {"date": "17 Jul 2023", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Straightforward competency based questions following a written exam. The questions related to the job description. Two panel members. One hour in duration overall. The panel members were the hiring manager and one other technical staff member.", "Interview Questions": "Give us an example of how you managed a difficult project? Give us an example of when you had to adapt to change?"}, {"date": "30 Apr 2023", "title": "Marketing Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "The interview was virtual with three people. It was lovely and friendly however, their feedback was much harsher than was made out by them. The interview lasted nearly an hour.", "Interview Questions": "Tell me about a time you dealt with a difficult colleague"}, {"date": "28 May 2023", "title": "Community Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Stoke-on-Trent, England) in Apr 2023", "Interview Descriptions": "It was competency-based interview questions and was very friendly and the questions were about communications in the Financial Innovation work. There was a lot of focus on financial innovation, research, and presentation. Very tough overall.", "Interview Questions": "Tell us about a complex communications challenge you have been faced with. How did you face it and what was your challenge"}, {"date": "17 Feb 2023", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Dec 2022", "Interview Descriptions": "I had an interview and was told I’d hear back within 2 weeks. I never heard from anyone despite making the time to follow up a month later. Pretty poor approach to interviews. Complete time wasters and disrespectful of your time.", "Interview Questions": "What can you bring to the role?"}, {"date": "18 Jul 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Very nice process. I felt comfortable, the team was interested in both personal and professional skills. They were looking for a young professional with demonstrable experience in the field. The interview took around 40 minutes.", "Interview Questions": "What challenges I can identify about the context"}, {"date": "30 May 2022", "title": "Marketing Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "An easy going conversation with a panel of 4 interviewers. Great questions to be expected at all interviews such as describing a marketing campaign and how I was involved, company values and culture, overcoming difficult obstacles and building relationships.", "Interview Questions": "N/A"}, {"date": "2 Apr 2022", "title": "Senior Programme Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "No test, just a single interview with a line manager and a specialist. Both interviewers were late to start, and it took longer than the expected duration (over an hour). Focus was on subjective topics in relation to the job, which was interesting, but highlighted the lack of an objective focus. They took over 6 months to make a decision, by which time I'd already accepted another position", "Interview Questions": "What would be your short-term strategic focus in this position?"}, {"date": "9 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Two interviews, both very short and pointed; first was the Director and current intern, second was with the two team members I would actually support. All were very nice and easy to talk to", "Interview Questions": "Why did you apply? What would you like to get out of this internship?"}, {"date": "18 Feb 2021", "title": "Marketing Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at UNICEF", "Interview Descriptions": "Temporary role advertised through a recruitment agency.   Agency submitted application and emailed interview link for an online zoom interview. Pleasant 1:1 interviewer but have never heard anything since from the agency so I guess I wasn't successful! A simple email on feedback would have been nice.", "Interview Questions": "Give an example of an occasion when you made a mistake,  what you did and what you learned."}], [{"date": "12 Jan 2021", "title": "Team Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (London, England)", "Interview Descriptions": "Competency-based online interview with a panel of 3 people - everyone was very nice. The questions were quite straightforward and I could drew from my previous experiences. After 1 week, I received a call informing that I was unsuccessful.", "Interview Questions": "Why do you want to work for UNICEF UK? "}, {"date": "20 Sept 2022", "title": "Full Time Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Jan 2021", "Interview Descriptions": "A long but positive process. Well, thought-through questions and a friendly interviewing panel. It took around 2 months from the interview to a job offer. Only one round of interviews was involved.", "Interview Questions": "- Interest in the positions.\r\n- Previous experience with similar jobs. \r\n- 3 technical questions.\r\n- Knowledge of the region. \r\n- Understanding of global priorities on the topic. "}, {"date": "23 Jan 2020", "title": "Digital Content Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UNICEF (London, England)", "Interview Descriptions": "I was an internal applicant so didn't have to do the gigantic and unwieldy online form. Submitted resume and cover letter and then was invited to interview and do a 45 min written test which were on the same day.", "Interview Questions": "Why do you think you are a good fit for the role?"}, {"date": "29 Apr 2021", "title": "Planning Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (London, England) in Dec 2019", "Interview Descriptions": "Had to fill out online application form on their system with my CV details and answer set questions. I was then invited for an interview where they told me to prepare a presentation and I had to talk through it during the interview.", "Interview Questions": "I got the sense they didn't read my online application because the interview questions were very similar so that felt like that was a waste of time. things like 'give an example when you worked well under pressure?'"}, {"date": "9 Feb 2021", "title": "Public Relations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (London, England) in Aug 2018", "Interview Descriptions": "I was interviewed by three people in the marketing dept. All very friendly and the interview was relatively informal and chatty, although each had specific questions and my answers were marked on a scoring system", "Interview Questions": "If UNICEF's Soccer Aid social media team began to receive social media posts from people annoyed at being relentlessly chased for donations, how would you handle the situation? "}, {"date": "23 Jul 2018", "title": "Education Role Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Called to a 3 person panel interview. A line manager, a potential colleague and a schools person.  They were friendly enough and are one of the few who bothered to give informative interview feedback over the phone.", "Interview Questions": "What would be the challenge of getting schools involved in this project? "}, {"date": "4 Mar 2020", "title": "Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (London, England) in Jul 2018", "Interview Descriptions": "1 interview only but I did meet the line manager before hand. I submitted a cover letter and aCV as well as showreel. There were 3 people on the interview panel.", "Interview Questions": "What is the piece of work you feel the most proud of?\r\n"}, {"date": "7 Apr 2018", "title": "Brand Manager (Mat Cover) London Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at UNICEF (London, England) in Mar 2018", "Interview Descriptions": "Poor communication with internal HR team, initial call, followed up with an invite to interview with incorrect information.\nInterviewed by 2 people, felt very hostile and fake, read questions off one after another without any dialogue or interaction with me. \nFor a charity brand like UNICEF you would hope the people who work there are at least pleasant, the 2 that interviewed me weren't.\nMade my mind up when leaving that even if I was offered the role I wouldn't want to work there.\nShame as it does such great work.", "Interview Questions": "Tell me why you want to work at UNICEF?"}, {"date": "11 May 2018", "title": "Production Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Dec 2017", "Interview Descriptions": "The interview process lasted just over an hour in their main London. I was interviewed by 2 members of staff who were polite and friendly. The interview felt informal and relaxed which was good.", "Interview Questions": "Give an example of a time you overcame a challenge"}, {"date": "4 Apr 2017", "title": "New Ventures Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Mar 2017", "Interview Descriptions": "Online application to even get to interview is really really lengthy, is online and requires a 1000 character answer for each competency from the JD, in this one there were 10 to get through.  Then also a 2000 character supporting statement based on their 7 common approaches. \r\n\r\nThe actual interview, I was interviewed by 3 people when I was told it would be 2, they were running late and I found them pretty cold and difficult to connect  with.  I did a presentation in my interview and just found the atmosphere in there kinda odd.", "Interview Questions": "Some questions were a little odd and lengthy, the kind where you are asked 3 long questions in one go so by the time they finish asking, you've totally forgotten what was asked.  I was asked questions around insight, strategy, business planning.  I then never even heard back either way after the interview which I think is pretty poor. Interviews can be nerve wracking and require a lot of preparation, If felt like I really prepared for this interview so not to even get any answer from them is pretty disappointing."}], [{"date": "3 Sept 2016", "title": "Public Affairs Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (London, England)", "Interview Descriptions": "Invited to interview at their London offices. Was asked to complete two written tasks, one was writing a letter to an advocacy target from the previous years report, the other was a brief to accompany the letter. The interview was with three members of staff good mixture of theoretical and practical questions", "Interview Questions": "What are the current long term issues facing the industry"}, {"date": "19 May 2016", "title": "Media Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF", "Interview Descriptions": "Before the interview I was asked to write a press release based on information that was provided to me. The writing test lasted for 30 minutes.\r\nI was then interviewed by three employees: head of communications, HR and another person on the communications team. \r\nThe interview lasted about 20 mins. The interviewers took turns in asking the questions.", "Interview Questions": "They asked standard interview questions : competency etc., they also asked me about current affairs and news stories."}, {"date": "2 Mar 2016", "title": "Philanthropy Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Feb 2016", "Interview Descriptions": "There was a written assessment lasting 25 mins. This was a letter to a donor thanking them for their donation and asking them to donate again in 2016. A two page Unicef document was given to extract information from. \r\n\r\nThis was followed by an interview with panel members. The interview was average-hard and the questions were competency based as well as a few role play questions of handling different work situations. There were about 10 questions in total and the interview lasted about 40 mins.", "Interview Questions": "1. Why do you want the job?\r\n2. How do you prioritize competing priorities?\r\n3. What is your experience of using spreadsheets?"}, {"date": "8 Apr 2017", "title": "Digital Marketing Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Jan 2016", "Interview Descriptions": "One hour-long interview,it was competences based with 3 people asking questions and writing down answers. Not too much interaction, it's definitely not a chat. I felt quite uncomfortable. I was not selected for the job and never had a feedback on my interview. Overall quite stressful.", "Interview Questions": "can you tell me a time when you missed a deadline"}, {"date": "22 Feb 2016", "title": "Creative Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (London, England) in Jan 2016", "Interview Descriptions": "Computer based test + panel interview. \r\n\r\nTask:\r\ncopy editing (edit 200 words from a 1500 words document)\r\nselect an interesting fact from the document\r\nselect an image\r\ncreate a facebook post\r\n\r\nInterview:\r\nThe panel was friendly and approachable\r\nInterview questions were primarily competency based: relevant experience, project management, priorities, collaboration, communication, dealing with conflicts, etc\r\n\r\nSuggestion:\r\nPreparation is key. Research about Unicef work, their audiences, tone of voice and brand.", "Interview Questions": "Main differences between printed information and digital communications"}, {"date": "16 Sept 2015", "title": "Direct Marketing Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (London, England) in Sept 2015", "Interview Descriptions": "A very lengthy application process followed by a test and panel interview (2 hours). I was invited back for a second interview the following week, but when I arrived, nobody was expecting me. The receptionist told me my interviewers were in an external meeting, but somebody else told me they were off sick. I was made to wait 20 minutes in the reception area and was eventually interviewed by two people from a different team, as opposed to the Head of Marketing and DM Manager. The two people who interviewed me had not read my application and could not answer many of my questions about the role. I waited 5 days and eventually got in touch with Unicef myself, when they told me I had been unsuccessful. The whole experience seemed very unprofessional and gave me a bad impression of the charity.", "Interview Questions": "Tell us about a time something went wrong on a project you were working on and what did you do to fix it"}, {"date": "16 Apr 2015", "title": "UNV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Hard, all sorts of questions. I showed passion and commitment and it was highly valued. The type of interview in any UNICEF selection process is competency based interviews. There is  panel of evaluators, and each member of the panel asks questions. The interview could be in different languages, according to what is mentioned in your CV.", "Interview Questions": "How do you deal with conflcts."}, {"date": "19 Mar 2015", "title": "Public Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNICEF (London, England) in Mar 2015", "Interview Descriptions": "Had to do a 15 minute test first: this involved drafting a short letter of thanks to a UNICEF supporter, and then prioritising 6 tasks with justification for their order.\r\nThen the interview, which was a panel interview with 2 leaders of the Public Fundraising team for approximately 40 minutes. Generally competency based.\r\nQs:\r\n1. Describe a time when you had to explain a complex concept to different audiences\r\n2. Describe a time when you have had to juggle several commitments at once and how you managed your time\r\n3. Describe a time when you had to organise an event and how you went about prioritising your time.", "Interview Questions": "Tell us about your experience and why you want to apply for the Community Fundraising role"}]]