[[{"date": "25 Apr 2023", "title": "Admissions Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Southern Mississippi (Hattiesburg, MS)", "Interview Descriptions": "Great. Honestly very comforting to know who I was going to be working with on a daily basis. It felt like a great fit and it was! Loved the interview process.", "Interview Questions": "What qualifies you to represent USM?"}, {"date": "14 Apr 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Apr 2022", "Interview Descriptions": "It was a panel of four professors. Questions were asked and the conversation was pleasant. They were receptive and supportive as I answered and were happy to answer my proposed questions.", "Interview Questions": "What are your weaknesses and strengths in research?"}, {"date": "7 Jun 2021", "title": "Assistant to Dean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Southern Mississippi", "Interview Descriptions": "It was a virtual interview. The Panel consisted of 3 people. Drs. Weinauer, Heinhorst, and Haley. They were very kind people. I felt like the interview questions were very good ones. There were easy questions and then there were a couple harder one that made you think for a second. Unfortunately, I was not offered the position but I am glad I was about to meet and speak to the ones on this panel.", "Interview Questions": "N/A"}, {"date": "8 Jul 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Jun 2021", "Interview Descriptions": "Fairly easy, they ask if you have social media knowledge, why you want the position, how you could recruit students and explaining more about yourself and why you’d be a good fit for the job.", "Interview Questions": "Why do you think you would be a good admissions counselor? "}, {"date": "26 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in May 2021", "Interview Descriptions": "Typical interview: asked about interests and studies, asked why I was interested in pursuing degree. Talked about past work experience in office setting. Talked about how projects will align with school work.", "Interview Questions": "How well do you work in a team?\r\nHow well do you work by yourself?"}, {"date": "23 Jul 2020", "title": "Library Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Southern Mississippi", "Interview Descriptions": "I went to the administration office. I filled out the form and submitted it to the hiring supervisor. She gave me a call for the interview. I was asked the following interview questions and was hired quickly.", "Interview Questions": "Tell me about your past job interviews\r\nDo you have a flexible schedule\r\nDo you prefer working day shifts or night shifts\r\nCan you work on the weekends"}, {"date": "4 Mar 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Southern Mississippi in Jul 2019", "Interview Descriptions": "Referral process from a current staff within the college, with an application and less formal interview conversation with the head of the college. Transcript review and acknowledgement of experience to successfully teach.", "Interview Questions": "Q. Why do you want to teach?"}, {"date": "15 Apr 2019", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Southern Mississippi", "Interview Descriptions": "It was fairly simple. We looked over my resume, and we talked about my job experience. She asked me questions related to customer service and my social skills. Afterwards I was pretty much offered the job.", "Interview Questions": "What is one of the most challenging situations you’ve dealt with in the past and how did you handle it?"}, {"date": "24 May 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Southern Mississippi", "Interview Descriptions": "I had two in person interviews. They were 10-15 minutes each and I was communicated with quickly. The first was with my direct supervisor and the second was with the office director. I began working a week or two after the offer, which happened 1-2 days after my interview.", "Interview Questions": "Why do you want this position?"}, {"date": "29 Mar 2018", "title": "Instructor, Spanish Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Mar 2018", "Interview Descriptions": "A few weeks after applying, I received an email from the hiring chair asking my availability for a Skype interview a few days later. During the Skype interview, there was a panel of 4 faculty members from the department who each took a turn asking questions (probably asked 2 questions each). \r\n\r\nWeeks later, I received another email saying I had been selected for an on-campus interview and that they would fly me down and put me up in a hotel for two nights. The on-site interview was semi-informal but intense! The main purpose was to meet all faculty members and teach a lesson to an existing class. Though these \"meetings\" were less intimidating than a formal interview, I was assured that the entire visit was indeed an interview. I was taken out for meals, showed around campus and around town, and introduced to the dean, the department chair, graduate students, and all other members of the department. It was an intensive two days, but I felt that they really took the time to get to know me in a low-pressure way, and they really cared about finding the right fit.", "Interview Questions": "Skype interview:\r\nTell us about your teaching experience and background.\r\nWhere do you see yourself in 5 years?\r\nWhat information have you learned from your students' course evaluations?\r\nWhy are you interested in this position?"}], [{"date": "31 Jan 2017", "title": "Union and Programs Facility Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Southern Mississippi", "Interview Descriptions": "Difficult for an on-campus job, but necessary. This is truly a professional interview, so look and act the part. This is the most elite position that one can have on campus, so it is selective in nature.", "Interview Questions": "What is it about this job that interests you?"}, {"date": "22 Jun 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Southern Mississippi in Jan 2017", "Interview Descriptions": "Went through two interviews and it was very quick with response. Asked application questions and previous work experience. Provided scenarios and gave examples of job duties. The first interview was a group interview and the second interview was one on one.", "Interview Questions": "What is a strength and weakness?"}, {"date": "14 Aug 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Jun 2016", "Interview Descriptions": "An online application was required through the USM employment portal. I received an email and telephone call to schedule an interview. I was interviewed by a panel. I was offered the job.", "Interview Questions": "Why do you want to leave your current job."}, {"date": "8 Aug 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Apr 2016", "Interview Descriptions": "Expressed interest online and then went and met the head of the department. Mostly standard questions asking about my past experiences and what I was looking for in my future.", "Interview Questions": "Are you okay moving around? \r\n\r\n"}, {"date": "23 Aug 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Mar 2016", "Interview Descriptions": "The interview process was short and to the point. I had other interviews and offers but chose Southern because of its location. First round phone interview with 3 administrators, then on campus interview was a breeze.", "Interview Questions": "What's your qualifications? \r\nWhat can you contribute to the university? \r\n"}, {"date": "10 Sept 2017", "title": "Greek Life Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Jan 2016", "Interview Descriptions": "First was a phone interview with the search committee then a second round phone interview. After the second round phone interviews 3 candidates were selected to interview on campus. A full day interview included a meeting with the search committee and various staff members. Then a presentation was given to students and we were all given a tour", "Interview Questions": "What are your future career goals"}, {"date": "12 Nov 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Southern Mississippi", "Interview Descriptions": "almost all doctoral students will get this job. most master's students will get this position depending on the budget that year. Just a few formal questions and students will be assigned to specific faculty to either teach or assist teaching.", "Interview Questions": "N/A"}, {"date": "27 Nov 2018", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Southern Mississippi in Jan 2015", "Interview Descriptions": "Received a phone interview several months after applying online.  Had an in face interview several weeks later.  The process was very drawn out and it seemed that they finally hired someone when the situation was dire.", "Interview Questions": "What are your long term goals?"}, {"date": "13 May 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Southern Mississippi", "Interview Descriptions": "I applied online and received an email asking to set up a phone interview. From there, I scheduled a phone interview and a few days later got a phone call asking to schedule a on-campus interview. On my on-campus interview, I had three different interviews. First round one-on-one, second round panel of students, and third round panel of higher ups.", "Interview Questions": "If you were a raindrop and you could fall anywhere in the world where would it be and why?"}, {"date": "25 May 2016", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Feb 2014", "Interview Descriptions": "Very easy going and laid back. It was easier than I thought it would be. I thought it was a great process overall. The largest aspect was trying to get in the door and getting through the entire process of HR and getting through the interview scheduling. Academics go slow so I understand why it took a while but still it is hard to wait so long.", "Interview Questions": "What my teaching style was"}], [{"date": "13 Jun 2017", "title": "Musician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Sept 2013", "Interview Descriptions": "There was no interview for this small contract work.  An interview was not required for this work. Because there was no interview, there were no questions asked at all. The interview process was a non-issue with this particular matter.", "Interview Questions": "There were no questions because there was no interview."}, {"date": "11 Apr 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Southern Mississippi in Sept 2013", "Interview Descriptions": "Sat down with the coordinator and had to answer questions based on working with difficult students as well as tutoring methods. This was followed by almost an hour long session of \"mock tutoring\" where I had to pretend that the interviewer was a student who I was tutoring.", "Interview Questions": "How to factor a polynomial?"}, {"date": "27 Jul 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Southern Mississippi (Hattiesburg, MS)", "Interview Descriptions": "The interview spanned 2 days of interviews, presentations, dinners, and meetings.  The people appeared very nice and seemed to be a great place to work.  There were signs of the problems that arose in the future that, had I been more experienced, I would have noticed.", "Interview Questions": "All of the questions were pre-scripted and not unexpected.  However, the real estate agent that took us on a tour of the city asked some personal questions because she remembered meeting me six years prior."}, {"date": "18 Apr 2017", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Jul 2013", "Interview Descriptions": "Interview process was initially a phone interview then acceptance/decline phone call when I got the position. Interviewer was very nice and she didn't make me nervous. They call randomly so you won't expect the phone call.", "Interview Questions": "Why should we hire you?"}, {"date": "13 Oct 2015", "title": "Postdoctoral Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Mar 2013", "Interview Descriptions": "They sort listed the candidates. They provided me the date for the phone interview and I prepared for that. There were four professors and administrators to ask questions. I was little bit nervous at the beginning but they asked me about personal matter first and asked about my research and future plans in my work. I am pretty sure I answered confidently. The process was not that much long. But I really enjoyed. They were friendly and helpful. That was my second interview in my job search. That's all.", "Interview Questions": "What is your hobby? which is different that I expected."}, {"date": "31 Aug 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Aug 2012", "Interview Descriptions": "Met with several employees from the IT team.  Was asked general background questions regarding my prior work experience and general knowledge of the tasks required in the job..  It was very relaxed.", "Interview Questions": "Describe a project you worked on in the past.  What went well?  What went wrong?"}, {"date": "6 Jun 2012", "title": "Moving Crew Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Aug 2011", "Interview Descriptions": "I called the human resources manager who brought me in for a interview, first with him, and finishing with the Assistant Director of the Physical Plant. The interview was very laid back.  The job called for physical labor so the questions asked were mainly about past work experience.", "Interview Questions": "Have you ever preformed manual labor?"}, {"date": "11 Feb 2012", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Southern Mississippi (Hattiesburg, MS) in Sept 2010", "Interview Descriptions": "It is a very rigorous series of interviews and group tasks as you apply for this job interview.", "Interview Questions": "If you were to have a disagree with your supervisor, how would you handle it?"}]]