[[{"date": "14 Apr 2023", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Martins Point Health Care (Scarborough, ME) in Apr 2023", "Interview Descriptions": "Excellent interview. They were kind and informative. They gave a lot of information and answered all my questions. This was technically for a phone interview and I did not decide to move forward for a formal interview due to the pay not meeting my needs.", "Interview Questions": "What are your 3 greatest strengths."}, {"date": "7 Jan 2023", "title": "Utilization Review Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Martins Point Health Care in Jan 2023", "Interview Descriptions": "I was initially contacted by a recruiter assistant to set up an interview with the recruiter following my application submission. Recruiter had all necessary information on the role and did refer me to the manager for an interview. The interview included multiple managers, including the hiring manager. Questions we’re organized and each manager took turns asking questions. The questions were typical. I did have time to ask my questions at the end of the interview.", "Interview Questions": "Why do you want to work at Martin’s Point Healthcare?"}, {"date": "5 Apr 2022", "title": "Director Contact Center Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Martins Point Health Care (Portland, ME) in Feb 2022", "Interview Descriptions": "The recruiter Jordan was excellent to work with and was very engaged throughout the process.  \r\n\r\nAfter the initial FIT interview, there was a video call with the hiring manager followed by three more video interviews with other stakeholders.  \r\n\r\nEveryone throughout the process was fantastic and although I was not extended an offer, I would recommend this company just based on the team that I spent time with.  At the end, the recruiter actually called me (instead of emailing) and gave me the unfortunate news with feedback from the team.  She was remarkable!", "Interview Questions": "Describe how you would change processes that impact other areas of the business."}, {"date": "18 May 2021", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Martins Point Health Care", "Interview Descriptions": "Very professional recruiting system.  Even though I did not ultimately get the position, I was impressed with their process.  Their communication pre and post interview were very timely and greatly appreciated.", "Interview Questions": "How would I build trust with staff that I manage?"}, {"date": "5 May 2023", "title": "Sales Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Martins Point Health Care in Aug 2019", "Interview Descriptions": "One interview with manager, asked basic entry level questions such as why are you interested and where did you hear about the role. Reviewed job description and qualifications for the position.", "Interview Questions": "Why are you interested in working here?"}, {"date": "25 Feb 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Martins Point Health Care (Portland, ME) in Sept 2016", "Interview Descriptions": "Submitted application and within 2 days got a call from a recruiter who fully explained the role and expectations to me. Had a phone interview with her, was told my application would be passed along, the next day got a call to interview in Portland for the call center. That interview was 2 people, very friendly and open communication wise. I did not get that role due to more experienced candidates applying, but the next week was called for an interview in South Portland (now Scarborough) for a dual role of call center and check in (time is split in this location). This was a 1:1 interview and flowed like a conversation. The manager was extremely friendly and open and had very strong questions for me. At the end the lead was brought in and asked me a few questions about how I learn. Less than a 48 hours later I had the job. Started 2 weeks later. Hiring process was the most seamless of any job I've ever had.", "Interview Questions": "What do you think your communication style is (direct, considerate)? How do you handle communicating with different styles?\r\nWhat is your learning style?\r\nTell me about a time you had to help an angry customer; what did you do and how did it end?\r\nWhat do you like best about your current role? And least?"}, {"date": "11 Apr 2016", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Martins Point Health Care (Portland, ME) in Feb 2016", "Interview Descriptions": "First, a recruiter called me for a phone screen.  Then she scheduled an on-site interview with the hiring manager.  After that, I was asked to come in for a half day of interviews with various people from the departments I would be working with.  I met with two or three people at a time. Each group took about 30-45 minutes.  I was asked a lot of questions but I also got the opportunity to ask many questions and really get a feeling for the organization.", "Interview Questions": "Several different interviewers asked about leadership style and experience managing people.  It seems like something they take very seriously here."}, {"date": "20 Apr 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Martins Point Health Care (Richmond, VA) in Jan 2016", "Interview Descriptions": "Went through 4 interviews.  Interview with executive management was cold and rude.  The interviewer kept looking around the room and outside when I was speaking as if he couldn't care less about what I had to say.  I have never been treated so poorly in an interview.  After reading other reviews, I count myself lucky that things did not work out with this company.", "Interview Questions": "Behavioral interview questions."}, {"date": "22 Dec 2015", "title": "Health Information Management Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Martins Point Health Care (Portland, ME) in Dec 2015", "Interview Descriptions": "I applied for this position through Monster.com and heard back from their Human Resources department fairly quick to set up an interview for that very same week. Their instructions and directions for my interview were sent by email and were very helpful. I have not received a job offer yet.", "Interview Questions": "The person I interviewed with asked basic questions but also threw in some extras based on my answers to previous questions. For instance, asking if I had ever dealt with an angry customer. And when I responded with a detailed example, they'd ask me another question about some of those details."}, {"date": "15 Aug 2016", "title": "Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Martins Point Health Care (Portland, ME) in Jan 2015", "Interview Descriptions": "The amount of interview (8 total) interviews very lengthy.  Drawn out, met with at least 12 people in a 3 month period.  Interviews were fun and engaging however could have been condensed into less.  The company prides itself of the long interview process which is a positive, however it is so lengthy that it can be rather inconvenient for the potential candidate.", "Interview Questions": "What do you do for fun, What systems have you worked with"}], [{"date": "20 Sept 2014", "title": "Member Services Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Martins Point Health Care", "Interview Descriptions": "Took weeks to get the initial interview set up. Human Resources Department seemed confused, disorganized. Many back and forth phone calls, rescheduling of my interview. The person who was supposed ot ionterview me wanst at the interview.", "Interview Questions": "Questions were all behavioral. They seemed to only care about culture, not qualifications for the position."}, {"date": "19 Mar 2014", "title": "CIO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Martins Point Health Care (Portland, ME)", "Interview Descriptions": "Slow in response but once contacted, moved quickly to schedule full day of interviews, including lunch with C-level staff", "Interview Questions": "During lunch, the HR person came in and told me they had decided to not pursue my candidacy - which is fine - but then asked me leave ... right then.  She said I would be contacted with feedback and follow-up, no one ever did nor did they respond to inquiry."}, {"date": "30 Jul 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Martins Point Health Care in Oct 2013", "Interview Descriptions": "The first interview was over the phone with an HR rep, the second interview was with the manager, and the third interview was with the PSR team. It was a little intimidating to interview with the whole team, but it was actually great being able to meet them all. Once I started it was like I already knew people on my first day which made it that much easier.", "Interview Questions": "Why did I want to work with patients?"}, {"date": "13 Sept 2016", "title": "Data Warehouse Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Martins Point Health Care (Portland, ME) in May 2012", "Interview Descriptions": "One phone interview with HR, followed by a phone interview with the hiring manager. Also had a full day of interviews with the senior data warehouse team, the departmental director, and the entire team.", "Interview Questions": "What kind of a sense of humor I had"}, {"date": "18 Mar 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Martins Point Health Care (Portland, ME) in Aug 2011", "Interview Descriptions": "phone interview, followed by face to face and then hired. It was overall pretty easy as far as interviews goes. The phone interview was 20 minutes and face to face was about an hour. It maybe took a couple of weeks after the phone interview to hear back.", "Interview Questions": "How do you handle stress?"}, {"date": "15 Aug 2011", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Martins Point Health Care (Portland, ME) in Apr 2009", "Interview Descriptions": "Process was a little bit jumbled from HR, to interviewing on site twice. Second on site round was a full day and even after that it took quite awhile to get an actual offer.", "Interview Questions": "Walk me through your education and experience. "}]]