[[{"date": "23 Nov 2021", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Caminar", "Interview Descriptions": "The interview process went well. I arrived early and they were able to accommodate my schedule. The interviewers were friendly and forthcoming with information I needed for the position. They asked about my background, experience, and my clientele preference.", "Interview Questions": "what is my therapeutic approach? "}, {"date": "2 Aug 2021", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Caminar", "Interview Descriptions": "so friendly and easy-going! asked the right questions and gave us space to ask questions. really responsive to burnout and supporting their staff. responsive to covid and take extra precautions", "Interview Questions": "what do you like about this position "}, {"date": "7 Jul 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Caminar (Fairfield, CA) in Aug 2021", "Interview Descriptions": "long he takes forever and they stall forever. must consistently bug the crap out of them to get a response. they make you wait on the background clearance which takes basically a whole month.", "Interview Questions": "why do you want to for our company"}, {"date": "16 Dec 2020", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Caminar", "Interview Descriptions": "The whole process had very simple questions. They asked a lot of questions. Even though there were a lot of questions, they make you feel comfortable. Questions they asked included both situational and basic .", "Interview Questions": "Tell us a situation where you had to deal with an upset customer."}, {"date": "10 Nov 2020", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Caminar", "Interview Descriptions": "Probably one of the most unprofessional and strangest interviews I've had. It should have been a huge red flag to me from the beginning when they couldn't commit to communicating with me when they said they would and would constantly push things back. I wasted about 3 weeks of my job search waiting for this company to follow through. \n\nI immediately found it strange when they didn't start off the interview asking me a single question to get to know me, but rather, the entire interview was just a number of people reading from a list of questions. No introduction, no overview of the position, no explanation of the role either, just nothing. They jumped straight into the questions and rushed through all the questions. There was no attempt whatsoever to get to know me, no attempt to make me feel comfortable, and there was zero conversation except for when they gave me the chance to ask questions at the end. I felt completely disrespected and felt like my time had been wasted by the end of it. Interviews are supposed to feel like a conversation, not an interrogation. Strange that they apparently don't care about what a potential member of their team is going to be like as a person? That gives off the impression that they're more interested in filling the position with just anybody who qualifies and can do the job instead of someone who they feel would genuinely fit in with their company. Is that a place that I would want to work for? Absolutely not. The people who interviewed me either have no idea what it takes to conduct an interview or just cared more about filling the position with the \"perfect\" candidate than honestly trying to get to know each interviewee and what they personally have to offer. It is seriously concerning for a company to specialize in social work and care more about what their workers can do than they do about the character of their workers. \n\nI read a lot of reviews from others who has worked for this company and the general theme seemed to be that they do not care about the wellbeing of their workers. I gave this place the benefit of the doubt and showed up to the interview anyway but I can now see clearly why people have had such bad experiences working for this place. If they can't even be bothered to get to know you during the interview, I wouldn't be surprised at all if they won't bother to get to know you or care about you as a member of their company either. This kind of attitude is unacceptable in a field that experiences high rates of burnout. A company who cares for their employees is integral. They also made some strange comments while they were explaining their billable hours that made it pretty obvious that they only care about the money. \n\nSave your time and efforts and work elsewhere with a good company culture!", "Interview Questions": "Tell me about a time you dealt with a stressful situation"}, {"date": "26 Jun 2020", "title": "Clinical Case Manager II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Caminar", "Interview Descriptions": "Much more intense than I expected, and off-putting in some ways. Had me do a time online test with SAT type questions. Interview was over an hour with 3 managers. They then wanted 5 professional references within 24 hours.", "Interview Questions": "Tell about a time where you've disagreed with a supervisor."}, {"date": "10 Oct 2019", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Caminar", "Interview Descriptions": "Professional and good interview. hiring process requires about 2 weeks. The review process requires references along with 3-4 interview directors, depending on the position. Overall, the interview process was not that bad. The interview is about an hour long.", "Interview Questions": "Who is your ideal "}, {"date": "22 Jul 2020", "title": "Database Billing Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Caminar (San Jose, CA) in Jul 2019", "Interview Descriptions": "The interview process was relatively easy and straightforward. Interviewer asked many questions about my resume and why I was pursuing this position when I have a background in Chemistry. I was interviewed by my manager first then was interviewed by the EHR manager after. The position asked for a high school degree or associates but I had a Bachelors of Science so met the qualification. I did have a hard time finding the location since there were two Family and Children Services, a division of Caminar buildings. But I was redirected to the right location across the street.", "Interview Questions": "Do you know how to work with Microsoft Excel?"}, {"date": "30 Jul 2019", "title": "Bicycle Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Caminar (Chico, CA) in Jun 2019", "Interview Descriptions": "A laid back, easy going interview. Interviewers are not interested in your experience but more so are interested in how they can help you. Whether through training or whatever, they want to see you grow and move forward and offer their assistance. So, just be yourself and be honest when answering their questions.", "Interview Questions": "Do you work better alone or in a team?"}, {"date": "4 Aug 2018", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Caminar (Fairfield, CA) in Jul 2018", "Interview Descriptions": "Sat down with two directors. Interview lasted about an hour. Asked about your background, why you are in the field, and got a feel for who you are as an individual as well as aspiring clinician. They asked about your availability and informed you up front that there is a 1 year commitment.", "Interview Questions": "They provided you with a vignette and asked for you to complete it to the best of your ability. "}], [{"date": "24 Oct 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Caminar (San Mateo, CA) in Sept 2017", "Interview Descriptions": "I interviewed with the Executive Director in her office. It was a very straight-forward process where I was asked about my background, work experience, and then I was tested on Excel and Word skills. There was a drug test and reference requirement where I had to provide 3 people that could vouch for me.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "9 May 2017", "title": "Job Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Caminar (San Mateo, CA)", "Interview Descriptions": "Applied online via Indeed; received a phone call the next morning scheduling an interview.  Attended an in-person interview for approximately 45 minutes with program directors.  Sent a follow-up thank you email.  Things were pretty quiet for several weeks with no updates.  Provided copies of education transcripts and diplomas, references, background check, drug test, and physical before receiving offer.", "Interview Questions": "What is your experience with job development?"}, {"date": "3 Jan 2016", "title": "Counselor, Residential Monitor II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Caminar (Las Vegas, NV)", "Interview Descriptions": "Easy, essential, presenting credentials.  I met with George Puddephatt at the West Charleston Boulevard location, I wan introduced to other team members.  I was hired that same day and began working full-time the following Monday morning.", "Interview Questions": "References"}, {"date": "17 Feb 2015", "title": "Job Coach Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Caminar (Vallejo, CA) in Jan 2015", "Interview Descriptions": "Basic interview. People in the office and the interviewer were very nice and welcoming. The interviewer mentioned multiple times her frustration with the Caminar HR team and how quick they were to reject candidates and how she'd lost a lot of people she wanted to hire. After a great in person,  i was offered the position pending cleared background checks and a physical. I was concerned about being denied the position due to a medication  I am on that could show up on the panel. I was told to tell my concerns to a personal assistant which I refused to do. I understand HIPPA laws and was not about to talk about protected medical items with a secretary. When I finally got the phone number for the HR Generalist (not an email since I bet they didn't want a paper trail)I called and she clearly was not educated very much in Human Resources. She also didn't understand when  talked about HIPPA or GINA. But since she was all I had, I talked to her about the medication and she said it shouldn't be a problem and I would still have the job. So having disclosed everything, I went to the physical. The physical itself was intensive and may have injured me as I was told to repeatedly lift in 5 lb increments up to 50lbs. It wasn't just lifting but it was squats with the weight and I'm not sure that my interviewer could have done this. My chiropractor said that I have injuries from this and the medical staff said they have NEVER done such an extensive physical. I made sure that the practitioners noted my  medications multiple times so imagine my surprise when I was denied the position based solely on the panel. It was so much work for a low low paying job and the whole process took about a month. I would think that a company who places people in jobs who are on medication would not discriminate against an applicant due to medical information received. Maybe my interviewer was right. Maybe they need a new HR team so that down the line they are not sued for discrimination. I'm not pursuing this avenue since I now have no interest whatsoever in working there", "Interview Questions": "Very very basic. \r\nWhy are you interested in position, etc"}, {"date": "16 Nov 2014", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Caminar", "Interview Descriptions": "Submitted resume and cover letter via email through a listing found online. Received a phone call 3 business days later and had a short phone interview, afterwards was invited for a panel interview with one other interviewer which lasted approx. 1 hour. Was told that I'd hear back by the end of the week.", "Interview Questions": "Nothing too out of the ordinary. Was asked the basic strengths and weaknesses questions."}]]