[[{"date": "9 Nov 2022", "title": "Senior Social Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Whittier Health Network (Newburyport, MA) in Oct 2022", "Interview Descriptions": "I applied for the job and was given a phone interview first and then invited for an in person interview about a week later. My interviewers were the hiring manager I had my phone interview with, as well as someone from HR. They were very welcoming and wanted to hear about my experience and why I personally wanted this position.", "Interview Questions": "What made you want to work here?"}, {"date": "9 Nov 2022", "title": "Social Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Whittier Health Network (Newburyport, MA) in Oct 2022", "Interview Descriptions": "After I applied I had a phone interview with the hiring manager. I then had an in person interview with the same person, as well as an HR rep about a week later. I was then offered the job at the end of that week. They were extremely welcoming and asked me a lot about what interested me about this position as well as how we could collaborate successfully.", "Interview Questions": "What made you want to work for Whittier?"}, {"date": "14 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Whittier Health Network (Westborough, MA) in Aug 2021", "Interview Descriptions": "Easy, awkward. Will say anything to get you to accept offer. Red flag was when D.O. N walked on the floor and said hello, no staff said hello back. HR was not very pleasant", "Interview Questions": "What made you want to be a nurse\r\nWhy whittier"}, {"date": "6 May 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Whittier Health Network", "Interview Descriptions": "Very welcoming and friendly environment. Easy to apply and company was very responsive. The department I had applied for contacted me via phone and discussed orientation and what to expect. I toured the facility and met some staff.", "Interview Questions": "Why I had I decided to get a CNA license."}, {"date": "10 Aug 2016", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Whittier Health Network (Essex, MA) in Jul 2016", "Interview Descriptions": "Applied for job online. heard back for an interview after about a week. very easy interview. interviewee was very nice and welcoming. very professional experience. learned a lot about the company and workers from interview. will be excited to start working there in the next week or so. Glad i got the opportunity to work with this company", "Interview Questions": "Where are you currently working?\r\nWhy do you want to switch jobs"}, {"date": "22 Apr 2016", "title": "Menu Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Whittier Health Network", "Interview Descriptions": "Applied online through a job search engine. Was contacted for interview within a few days of applying. Interviewed with the food service director. The interview was very easy with very few questions about qualifications. It was more of an explanation of the job description and what is expected: ability to work weekends, holidays etc.", "Interview Questions": "What made you apply for this position?"}, {"date": "11 Sept 2020", "title": "Director of Recreation Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Whittier Health Network (Ghent, NY) in Mar 2016", "Interview Descriptions": "It was fairly basic. I met with HR to start. Questions are asked off of a sheet of paper that they use for pretty much everyone. Then I was interviewed by HR and the administrator.", "Interview Questions": "What traits do you have that will help you do this job? "}, {"date": "20 Mar 2016", "title": "Medical Records Personnel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Whittier Health Network (Haverhill, MA) in Aug 2015", "Interview Descriptions": "Submitted an application and resume online, received a phone call from the hospital Administrator and set up a time for an interview. It definitely helped that I knew someone to get my foot in the door. But I interviewed for any job (after graduating college), and ended up with a better job than I applied for! The first interview was 1:1 going over my resume and what made me qualified for the job, the second interview was meeting my co-workers and learning how to do the job and shortly after I was offered the job.", "Interview Questions": "Why do you want to work here (in this position)?"}, {"date": "21 Nov 2014", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Whittier Health Network (Haverhill, MA)", "Interview Descriptions": "Interviewed with the Administrator and Scheduler, it was if the Scheduler was leading not the Administrator. The administrator would start asking a question, and then say to the scheduler, well so we still have those 16 hours or did we split them already with 2 other Aides?", "Interview Questions": "They were in a major staffing crisis.... So Unexpected was only after approximately 5 minutes... \"When can you start\""}, {"date": "3 May 2012", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Whittier Health Network (Westborough, MA) in May 2012", "Interview Descriptions": "They advertised Baylor positions as a bait and switch.", "Interview Questions": "How did you hear about us?"}], [{"date": "13 May 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at Whittier Health Network (Ghent, NY) in Jan 2012", "Interview Descriptions": "Casual process, not many questions. Typical interview questions, focused mostly on experience and where training was completed. One on one with HR department. Two day group orientation then 2 week orientation on the floor.", "Interview Questions": "Why do you want to work here? Tell us about your previous work experience."}]]