[[{"date": "17 Apr 2023", "title": "Adminstrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Zayed University (Dubai) in Jan 2023", "Interview Descriptions": "Applied online through their website. Got a phone call from the recruitment team to arrange a time for interview. Everything went smooth, but apparently did not pass the interview. Applied online through their website. Got a phone call from the recruitment team to arrange a time for interview. Everything went smooth, but apparently did not pass the interview.", "Interview Questions": "State your strength and weakness."}, {"date": "9 Dec 2022", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Zayed University", "Interview Descriptions": "If you know someone to assist with an introduction, that is great. Otherwise, the process includes meeting with the Chair or Dean of the college to express your interest in an adjunct position.", "Interview Questions": "Why are you interested in this position?"}, {"date": "14 Sept 2020", "title": "Office Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Zayed University", "Interview Descriptions": "Friendly and welcoming interviewers. I was a bit nervous at first but they introduced themselves and talked about the department and what they do. They spoke in friendly yet professional manner. And that managed to ease my nervousness. I did well at the interview and landed the job.", "Interview Questions": "Tell us a little about yourself."}, {"date": "26 Mar 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Zayed University", "Interview Descriptions": "Smooth, straightforward and professional.  Questions were mainly about my previous research experience and knowledge of statistical software and programs. They informed me of their decision within 2 weeks. Professors and lab technicians were very friendly and helpful.", "Interview Questions": "Previous research experience"}, {"date": "8 Feb 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Zayed University (Dubai) in Nov 2019", "Interview Descriptions": "Skype was arranged while the technological glitches marred the whole interview process. One guy was supposed to join from the Abudabi campus with his Dubai counterparts while another wa sin perth Australia. I was in a North American location. After 20 minutes of ineffective communication the interview ended and the team was in a hurry to wrap it up. I found the team inefficient in following faculty recruitement procedure.", "Interview Questions": "What I teach in my particulr course/class."}, {"date": "13 Apr 2020", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Zayed University (Abu Dhabi, Abu Dhabi) in May 2019", "Interview Descriptions": "Very easy and relaxed - little pressure questions that could easily be answered - they already knew what type of person they wanted and had done all the background checks prior - the interview was just confirmation for them.", "Interview Questions": "Why have you chosen our institution?"}, {"date": "17 Mar 2019", "title": "Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Zayed University (Abu Dhabi, Abu Dhabi) in Mar 2018", "Interview Descriptions": "Easy and straightforward.  Friendly people. more about strengths and weaknesses. The panel seems to investigate the resume. They seems to look for person with pre-specified qualifications.  I expected to have technical interview and also to give a presentation.", "Interview Questions": "Strengths and weaknesses "}, {"date": "23 Mar 2018", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Zayed University (Dubai) in Mar 2017", "Interview Descriptions": "Video Conferencing Using Vidyo. Very unorganized. Interview was canceled due to technical problem first time. HR was least bothered to check . When interview was finally scheduled Video conferencing link was sent 2 minuets before the interview. \n\nInterview was smooth and friendly. But even after one year I haven’t got any confirmation for selection or rejection .They did not  have the curtesy even to send the results. When contacted they said results will be declared after Eid Holidays. One Eid holiday is already over. Second Eid also will be over soon. Still waiting for the result. Really Disgusting attitude.\n\nDon’t waste your time applying and appearing for the interview. Your time and effort does not have any value.", "Interview Questions": "On teaching method and Research"}, {"date": "17 Nov 2016", "title": "English Language Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Zayed University (Dubai)", "Interview Descriptions": "I was interviewed by conference call.  The interviewers were chosen from faculty and administration and all asked a variety of different questions regarding my prior work experiences, my educational philosophy, other contributions I had made to my former workplaces, and my reasons for wanting to work at Zayed University in particular.  There weren't any especially unusual questions asked, but the team was very thorough.  They were also very forthright about the benefits and challenges of working at the university.", "Interview Questions": "The interviewers asked several questions regarding my experience and approaches working with students from other cultures with different language and educational backgrounds.  The university program is very determined to promote cross-cultural awareness and understanding, and they seek employees who can bring positive experience and intelligent discourse in these areas to the table."}, {"date": "21 Apr 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Zayed University (Dubai) in Jan 2015", "Interview Descriptions": "bland interview, stupid questions, just based on cv, nothing interesting was asked, it felt like they hadn't actually read my cv at all, pretty disappointing considering the amount of time I spent preparing", "Interview Questions": "tell me something about yourself"}], [{"date": "14 Dec 2014", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Zayed University (Dubai)", "Interview Descriptions": "Applying was fine. The interview was bizarre (four very tired-looking faculty with I think 2 publications between them). Negotiations following the interview were slow, then stopped. I quit before accepting contract. Human Resources were shockingly unprofessional - I can understand why most people want to leave.", "Interview Questions": "Questions were not difficult or unexpected."}, {"date": "9 Dec 2015", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 months. I interviewed at Zayed University (Dayrah) in Sept 2014", "Interview Descriptions": "Professional interview. There were four people on the panel. Two from the Dubai campus and two from the Abu dhabi campus. The interview was formal but I was made to feel very relaxed. The interview process was relatively straightforward and very quick from the offer of interview stage. It did take some weeks before I heard after submitting my application but once the ball was rolling it seemed fine.", "Interview Questions": "How would you approach teaching our students?"}, {"date": "22 Jul 2014", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Zayed University", "Interview Descriptions": "I had an English exam followed by a panel interview later. The English exam was computer based. The panel interview was both technical and HR. I had to later go in for a HR discussion", "Interview Questions": "N/A"}, {"date": "1 Jun 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Zayed University", "Interview Descriptions": "One inperson interview in the US. The Dean and his colleage had a very informal meeting with me. My credentials preceeded me and they wanted to hire me. The interview was more about whether I was congenial and whether my vision was aligned with theirs.", "Interview Questions": "None of the questions were difficult or unexpected."}, {"date": "19 Mar 2014", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Zayed University", "Interview Descriptions": "phone and face to face", "Interview Questions": "N/A"}, {"date": "6 Jul 2016", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Zayed University (Dubai) in Mar 2014", "Interview Descriptions": "One-hour interview following completion of online form including statement of teaching philosophy. Many questions are factual, but some encourage reflection, e.g on your own strengths and weaknesses. The interview format is generally informal and seems like a conversation. The aim may be not just to find out what kind of teacher you are but what kind of person you are and how easily you will fit in with and support the current team. There is time for questions from the interviewee at the end: ask about culture, housing, but bear in mind that many more detailed questions are best asked to HR after a job offer.", "Interview Questions": "How important do you think technology is in successful teaching?"}, {"date": "26 Nov 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Zayed University", "Interview Descriptions": "Nice interview.", "Interview Questions": "Teaching low motivation students."}, {"date": "16 Nov 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Zayed University (Dubai)", "Interview Descriptions": "Consisted of a skype interview, quite easy, and pleasant people", "Interview Questions": "Really nothing unexpected - because it is a professor position, asked about courses I could teach, etc. "}, {"date": "26 Aug 2013", "title": "Instructor, ABP Program, Zayed University Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 9 months. I interviewed at Zayed University (Dubai)", "Interview Descriptions": "The process was fine for me as, like many others, I came to ZU from a program in Turkey where about half the instructors came from. As with everything, who you know matters a great deal! This also meant that I knew most people who interviewed me. \r\n\r\nThe process consists of an online form, followed by a video conference panel interview", "Interview Questions": "No difficult or unexpected questions - I was fortunate to have been briefed in advance by my friends on the interview panel"}, {"date": "11 Feb 2016", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Zayed University (Abu Dhabi, Abu Dhabi) in Jan 2012", "Interview Descriptions": "Unorganized; HR staff who scheduled the interview was completely unprofessional and disorganized - I had to instruct her on next steps because she was clueless and could barely speak English. They wanted me to spend a lot of money to certify my degrees BEFORE they gave me an offer. What a joke. Interview panel started arguing with each other when they were interviewing me.", "Interview Questions": "Do you have children? Are you married? Does your spouse have coverage [because they would prefer not to cover]?"}], [{"date": "7 Aug 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Zayed University (Abu Dhabi, Abu Dhabi) in Jun 2011", "Interview Descriptions": "Video conference with two people. Supposedly, others were supposed to be there, but they weren't. Very relaxed and informal. Traditional interview questions - why are you the right candidate for this role? Why do you want to work at ZU? How will you do this job? Only the single video call, no phone screen before, no in-person after, so kind of crazy to accept the job without going there or meeting anyone.", "Interview Questions": "What do you know about students in the UAE?"}, {"date": "6 Oct 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Zayed University (Dubai) in Nov 2009", "Interview Descriptions": "First I was asked to fill in a website application with student evaluations, job history, school transcripts , cv etc.\r\nI was then asked to participate in a video and or phone conference and interviewed with a panel. The session was simple question and answer.\r\nI was hired and had a  personal interview and that administrator decided to keep me rather than move me to the other campus which is where I was originally hired to work.", "Interview Questions": "How would you deal with a sick Emirati female student in a colleagues classroom? To answer this question I needed to know a bit about the customs and culture of the area and what was appropriate or not in dealing with female students."}]]