[[{"date": "1 Nov 2021", "title": "Finance Related Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Unitarian Universalist Association", "Interview Descriptions": "Pre-interview call, email scheduling, 2 or 3 interviews with the staff team, project to review skills that took about 4 hours. Super positive and upbeat throughout, suggesting I was a shoo-in. Hired form within instead.", "Interview Questions": "Asked about dismantling white supremacy. For a finance position."}, {"date": "23 Oct 2020", "title": "Childcare Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Unitarian Universalist Association", "Interview Descriptions": "Very quick and to the point.  They informed me in order to work there you have to be accepting of all people.  Someone who is not bias would be great at a church like this.", "Interview Questions": "How would you deal with crying children?"}, {"date": "12 Jul 2019", "title": "Classroom Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Unitarian Universalist Association (Calgary, AB) in Aug 2017", "Interview Descriptions": "It started on time. Went on for half an hour. I was asked about my education, Experience,  faith and values. I was also given a tour of my work place.", "Interview Questions": "Have you experience working with special needs children?"}, {"date": "8 Oct 2016", "title": "Database Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Unitarian Universalist Association (Boston, MA) in Apr 2016", "Interview Descriptions": "Found the job listing online and submitted resume and cover letter via email. Heard back quickly that they were reviewing my application. Quickly scheduled for a phone interview, then two in person interviews. There was discussion of my work history and relevant skills but the interviewer also made a point of trying to understand my background as a person. The last interview was a quick skills check. They did check with my references once I was a serious candidate in the last round of interviews.", "Interview Questions": "Why do you want this job? What are your shortcomings as a worker?"}, {"date": "7 Apr 2015", "title": "Communications Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Unitarian Universalist Association (Boston, MA) in Mar 2015", "Interview Descriptions": "Within a day of submitting application, received email confirmation someone received it. Was called about a week later for a first round phone interview, then on-site in-person interview a week later.", "Interview Questions": "What is one thing a former employer would say you need to work on?"}], []]