[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Culture, Mission, and Teamwork", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Sept 2021", "job_title": "Vice President in Washington, DC", "duration": "N/A", "pros": "Servant CEO leadership, equity, inclusion, and benefits. CEO leads by example and values people. Organization is forward thinking, focused on improving health care and employees act with integrity. Great work environment and culture.", "cons": "None I can think of."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Sept 2022", "job_title": "Help Desk Support Specialist in Washington, DC", "duration": "N/A", "pros": "Great bonus structure (when I worked there)", "cons": "At the time the opportunity to work remotely was minimal. Not much opportunity for growth"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good environment and good co-workers but always room for improvement", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Aug 2018", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "CEO is transparent, states expectations clearly and practices teamwork. Small office allows for quick turnaround for answers.  Good opportunity to broaden knowledge across organization.  Respectful and congenial work environment for the most part..  Given all resources necessary to perform job.  Great benefits!", "cons": "Some senior leaders have an \"I'll have my staff do it and take credit\" attitude.  Some have an expectation that staff should provide excellent or above average customer service but do not think they should do so.  Need some senior leaders to practice integrity because it goes a long way and says a lot about your character. No telework (even though we have  mobile technology...)  Due to size there is limited upward mobility."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Like The Office, just not funny.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Jul 2019", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "The employees outside of the executive team and one or two of the directors are great to work with. They're smart, engaged, funny people with great work ethics. They are the best part of the organization, and the reason why you will keep coming into work. The benefits are pretty good, and many positions are paid decently well. The location is great, within short walking distance of three Metro stops in DC, making commuting in a breeze. The organization has recently implemented a work from home policy, although its inception is uneven company-wide.", "cons": "This review is intended to help others who are looking at URAC as an employer make an informed decision on whether or not to apply or accept a job offer. If you have prior experience working at Inova, you will fit in here. If you are highly tolerant of dysfunctional organizational practices, then you will be fine working at URAC.\r\n\r\nURAC is an independent quality healthcare accreditor. The bread and butter of their business is to ensure that the organizations who earn their accreditations follow best practices and seek to improve quality. So, it may be a surprise to you that if forced to submit an application for accreditation, that URAC would be denied  their own accreditation. Or, maybe you expect this level of hypocrisy and dysfunction from your experiences with prior employers. If so, I'm sorry you've been hurt in the past. If you decide to accept a position here, please understand that your training will be minimal, you will not have policies and procedures to serve as a guide when you attempt to train yourself, and you will encounter difficulty or even slight hostility when attempting to ask questions. Hopefully you are an expert in this niche part of healthcare already, and have an entrepreneurial mindset, which will be helpful when working in this 25 year old organization with a start-up spirit and practices. You will be expected to implement and/or adhere to new processes, policies or procedures, although the executive team does not inform you of changes within the organization decided at their weekly meetings.\r\n\r\nThe dysfunction starts at the top here. URAC recently welcomed a new CEO and President, and in the beginning, the employees below the director-level were hopeful and excited for change to the dysfunction and disrespect they experienced at the hands of the other executive team members. However, we soon realized that the new CEO is more concerned with making sure people like him on the executive team, and telling you about his brood of adult children than learning the ins and outs of the business and making desperately needed change. He thinks pleasing the executive team members inspires goodwill towards him, but it's clear that they lack respect for him. There are several things that the prior CEO would not let happen, such as not partnering with other organizations due to conflicts of interest, and not allowing some of the more half-baked ideas to see the light of day, but in his pursuit to make others like him, the new CEO is giving the green light to asinine ideas which are negatively affecting the organization and therefore its customers. In addition, do not expect any level of confidentiality if you work up the courage to take a problem to him, because it does not exist. Your entire interaction with him will be related to other individuals, and he will not protect you from any retaliation.\r\n\r\nThe other members of the executive team are extremely dysfunctional, and do not work together as a cohesive group. They fight their battles through their employees, instead of having difficult conversations with each other, and refuse to engage their employees after decisions have been made. You may encounter a team member who is a snake in kitten heels; completely overwhelmed in her role, and often works to undermine people and projects behind the scene; has had at least two departments, several processes, and at least one direct report taken from her within her two or three years at the organization; and has lost important business opportunities due to complete disorganization, being generally unqualified for the demands of her position within the company, and her inability to make decisions out of what is probably an abject fear of being held accountable for them. Yet, she continues to hold onto her job, a miracle if you believe in them. Another member of the executive team will call a meeting for you to essentially read a detailed email sent to her out loud; cannot use even basic technology (i.e., cannot navigate to another sheet in Excel without confusion); and loves telling the other people of color in the office that she is treated unfairly in the office because of her ethnic background instead of understanding that people don't like working with her because she's rude, disrespectful, and incompetent. Inconsistency is rank in answers given for vital business operations and contracts, which are not based in established policies, procedures, or precedent, but instead will change based on...astrological events? Who knows. Yet another member of the executive team is a misogynist and male chauvinist who thinks URAC is a big tech company instead of what is essentially a small business, is completely inflexible, unimaginative, unable to accept constructive criticism of any kind, and should not be allowed to manage any being more sentient than a houseplant. One other member of that team is nice although awkward (i.e., ask a woman of color in a corporate-wide meeting if she's wearing a wig, and if she's wearing a wig because she has cancer, awkward), but the project deliverables are a disaster. The product launches always have the same issues of disorganization with products pushed to market which are incomplete, at best.  \r\n\r\nYes, this all sounds catty and personal. However, if you choose to accept a position within this organization, the biggest source of your frustration and probably your undoing will be because of the individuals and their behaviors as described above. You will most likely be micromanaged without receiving clear instructions, your leader will take credit for your work in meetings while questioning your competency in private, and you will probably experience outright disrespect and unprofessional behavior with no remedial actions taken, even if you file a formal complaint. You will be told to be a team player, but will be actively discouraged from speaking to people in other departments, but do it anyway, because otherwise you may not receive information vital to doing your job well. This sounds like silly interpersonal drama, and I would normally agree if it wasn't week after week, as well as even serious offenses, like someone in management making fun of an employee's stammer in front of other employees and business partners, or women experiencing pay discrimination at the hands of their male superior who favored their junior male counterparts, do not provoke a strong rebuke. You may not even receive a tepid apology.\r\n\r\nNo organization is perfect, but if you have a choice of employers, and are not desperate for employment, wait and/or accept that other job. Especially if you are a young person. There will likely be no room for growth for you here under current management."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "URAC Does Important Work that Protects Healthcare Consumers", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Jul 2019", "job_title": "Healthcare Professional in Washington, DC", "duration": "N/A", "pros": "URAC has given me many opportunities to contribute to its important mission.  I value what we do here, am comfortable in the workplace, and plan to stay a long, long time.", "cons": "It is unfortunate that some of my colleagues feel so negatively. I wonder why they stay in a place they dislike so much. Public whining solves nothing."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Transition has created a strong and growing leader in healthcare", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2014", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "URAC is a strong and growing leader in healthcare accreditation. In 2012 financial performance and employee morale had plateaued. In August, 2013 a new CEO, Kylanne Green, was hired. COO William (Bill) Vandervennet joined URAC in 2012. New and successful products and partnerships were created in 2013-2014. Therefore, staffing was adjusted to align with the new business priorities. Full year 2014 metrics will likely result in a record for new business development, renewal sales and customer satisfaction scores.", "cons": "Organization is innovating at a fast pace."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Horrible place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Apr 2016", "job_title": "Anonymous Employee in Brasília, Federal District", "duration": "N/A", "pros": "The pay is good and benefits. The non executives are very nice and easy to work with.", "cons": "Executive team is horrible and set a negative tone with poor treatment of staff. The execs do not care about the meaness of the office environment and turnover is huge.  People coming and don't stay long and just disappear.  Very poor morale and dysfunctional environment.  Organization is not moving forward.  Rely totally on one product with no sales or marketing strategy."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Petty and childish environment", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2015", "job_title": " in Washington, DC", "duration": "N/A", "pros": "Great downtown location. Benefits and pay are reasonable", "cons": "There is a \"me, me, me' culture around the office. Everyone whines when things don't go as planned. High turnover and constant change in employee staff responsibilities and roles. Hard to know who does what."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Company is struggling with new management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Sept 2014", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Wide variety of products makes job interesting for small company\r\nConsultative based reviews are liked by customers\r\nStrong products for a few lines (pharmacy, health management)\r\nBonus program", "cons": "Executive team in disarray with most replaced in 2013, including CEO. \r\nPoor planning and coordination led to revenue shortfall,and loss of bonus.\r\nMajor layoff at end of year. Turnover very high.\r\nStaff not valued or motivated by executive team.\r\nFew opportunities for advancement due to small size."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "My experience and URAC was very educational, the knowledge gained can be effectively applied to the health care industry", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jun 2012", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Great staff and friendly environment.", "cons": "There is a need for better communication amongst departments."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "account manager", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Sept 2020", "job_title": "Account Manager in Washington, DC", "duration": "N/A", "pros": "Good platform to help provide quality care", "cons": "Poorly run company that lacks the ability to grow the company"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Toxic Culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jan 2020", "job_title": "Marketing in Washington, DC", "duration": "N/A", "pros": "High Salaries, Great Software, Metro Accessible", "cons": "Hostile Environment, Counterproductive, Unhappy Employees"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "URAC", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Jul 2016", "job_title": " in Oak Hill, VA", "duration": "N/A", "pros": "Exciting accreditation products were available.", "cons": "Short staffed meant that you were always busy."}]]