[[{"date": "27 Aug 2021", "title": "Health Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Concern Worldwide (Dublin, Dublin) in Jul 2021", "Interview Descriptions": "The interview process was lengthy spread across several days. They conducted the interviews online which required applicants to record a video answering 10 questions, make a powerpoint presentation, and several one-on-one question and answer.", "Interview Questions": "1.  Recall a work situation where you handled a challenging manager?"}, {"date": "23 Jun 2021", "title": "Administration Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Concern Worldwide", "Interview Descriptions": "Tricky but friendly, good easy system from start to finish, I understood all the steps. I didn't get the job but I would apply again, I think I can do better the next time. The offices are nice and I did find the process good. Bad coffee but not sure I'd that matters! The hiring and interview process was overall OK and I couldn't really complain about it except of course i didnt get the job I wanted", "Interview Questions": "Are you organised "}, {"date": "1 Apr 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Concern Worldwide (Dublin, Dublin) in Oct 2020", "Interview Descriptions": "CV sent online, then receive an email requesting a interview. First a video interview with machine with around 5 questions. Then a task to be completed prior a panel interview with managers. It's all managed in a website system.", "Interview Questions": "How did you manage a difficult situation that happened with you? "}, {"date": "15 Oct 2019", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Concern Worldwide", "Interview Descriptions": "Applied online through their website. Application included full cv and cover letter. Received a call from HR approx one week later. First round interview was panel based on competency based questions and looking at previous experience combination.", "Interview Questions": "Last media article I read regarding any international aid agency"}, {"date": "12 Nov 2019", "title": "Door to Door Sales Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Concern Worldwide (Dublin, Dublin) in Aug 2018", "Interview Descriptions": "Customer service working with a team. How to deal with upset customers and how would you deal with people on a team and how to keep pushing forward as a team", "Interview Questions": "Customer service working with a team. How to deal with upset customers and how would you deal with people on a team and how to keep pushing forward as a team "}, {"date": "7 Sept 2018", "title": "Programme Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Concern Worldwide (Dublin, Dublin) in Jun 2018", "Interview Descriptions": "First an online video interview, with more technical questions, followed by a skype interview with questions on management and code of conduct as well as some technical. The questions were asked by an HR person and a desk officer", "Interview Questions": "What will you do when you meet your new staff for the first time"}, {"date": "18 Sept 2017", "title": "Major Donor Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Concern Worldwide in Jul 2017", "Interview Descriptions": "Interview by way of computer programme. Not a skype phone call as I initially thought. Instead I was asked to record short 3 min answers. Unusual but not awful. A bit nerve wracking.", "Interview Questions": "What would you do on your first day at work?"}, {"date": "29 May 2017", "title": "Research Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Concern Worldwide (Dublin, Dublin) in May 2017", "Interview Descriptions": "I applied online and then received and email saying I was to complete an online interview with Sonru. It was my first time using Sonru and it was quite hard, I wasn't fully prepared for the more 'technical' questions. Then I had a face-to-face interview with two members of staff which went well also.", "Interview Questions": "Organising my work/ General skills in the area "}, {"date": "13 Jul 2017", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Concern Worldwide (Dublin, Dublin) in Mar 2015", "Interview Descriptions": "Two panel interview, was quite informal and just seeing why I was interested in the organisation and what I felt I could bring to the role. Quite quick turn around and I received offer after confirmation of references.", "Interview Questions": "Why Concern in particular, would I be interested in carrying out any work overseas if I was to be given the opportunity down the line. "}, {"date": "18 Jan 2016", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Concern Worldwide (Cork) in Dec 2012", "Interview Descriptions": "I applied in December and was called to interview within two days. The day following the interview I was called with an offer. The contract took another couple of days to draw up and I started in January. The process was very easy and the hiring manager stayed in contact throughout.", "Interview Questions": "What experience do you have in target driven environments which you feel can be applied to this position."}]]