[[{"date": "24 Jan 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wisconsin Oshkosh", "Interview Descriptions": "Straightforward process, lots of communication, you always know what stage of the process you’re at. I had a phone interview with a panel of people and was then invited for an in-person interview, which could have felt intimidating but everyone was very relaxed/professional/friendly.", "Interview Questions": "How to handle a coworker with a different working style "}, {"date": "3 Oct 2022", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin Oshkosh (Milwaukee, WI) in Jan 2022", "Interview Descriptions": "Virtual, easy, they are desperate for CAs so you will get the job as long as you don't make any huge mistakes. In my interview I talked a lot about campus involvement and my previous experience with mediation skills.", "Interview Questions": "What would you do if you witnessed someone you would consider a close friend breaking a campus rule?"}, {"date": "1 Nov 2021", "title": "Veteran Resource Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin Oshkosh in Oct 2021", "Interview Descriptions": "The first interview was a conference call in which I was called over 45 minutes past my scheduled time. I both called (left voicemail) and e-mailed my point of contact to confirm the time when it was about 15 minutes late. I took the call late, but it was never even acknowledged nor apologies given for the situation. It was ignored completely. The second round was via Zoom and scheduled for 2 hours, at 30 minute segments with a variety of staff. This went fairly easily and seemed to work well.", "Interview Questions": "Why do you want to work here?"}, {"date": "23 Apr 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wisconsin Oshkosh", "Interview Descriptions": "No response to any application. Many openings seek Master's degree with a starting salary as low as $36k a year.. Not a great balance of expectations for compensation. Even without meeting their expectations you would think informing applicants they did not receive an interview would be helpful.", "Interview Questions": "No interview even occurred. Lack of response from team."}, {"date": "15 Aug 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin Oshkosh (Oshkosh, WI) in Aug 2019", "Interview Descriptions": "The search and screen process can be long.  A phone interview, if moved forward, the on-site interview is several hours of interviews.\nA search and screen panel, the leader of the functional area and finally the hiring manager.", "Interview Questions": "Why are you interested in the position."}, {"date": "15 May 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Wisconsin Oshkosh (Oshkosh, WI)", "Interview Descriptions": "Basically nonexistent. They needed someone immediately because of an unexpected retirement. It was an emergency hiring, and my name and interest were known because of someone I knew who worked there.", "Interview Questions": "Can you start right away?"}, {"date": "6 Sept 2016", "title": "Office Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Wisconsin Oshkosh", "Interview Descriptions": "The interview was very comprehensive and involved multiple people from around campus. Despite the difficult interview schedule, the interviewers were very warm and welcoming. Neat campus, parking was a bit difficult to find since they are so big and only have a few staff lots available.", "Interview Questions": "Tell us about what books you've read that have helped you professionally develop. "}, {"date": "30 Sept 2015", "title": "University Staff II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3+ months. I interviewed at University of Wisconsin Oshkosh (Oshkosh, WI) in Jan 2015", "Interview Descriptions": "Met with direct supervisor and director of the department, then was interview by the entire department staff who in turn read a question from a sheet.  It took about 4 months from application to starting on first day.  Do not expect a fast process.  Very little information on the training process was shared.", "Interview Questions": "What part of the job description makes you most excited and what part makes you most apprehensive?"}, {"date": "7 Nov 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin Oshkosh (Oshkosh, WI) in Sept 2014", "Interview Descriptions": "Once a recommendation from a professor was secured, you are required to attend a paid tutor development session. After that is complete, you wait for potential clients to email you and set up times to meet.", "Interview Questions": "What classes would you like to tutor?"}, {"date": "31 Jul 2014", "title": "University Services Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin Oshkosh", "Interview Descriptions": "After submitting requested materials, it took them about a week to schedule a phone interview. There were 8 questions, 3 panel members via phone conference. Quick, 15-minute interview. Opened up for questions at the end.", "Interview Questions": "The standard--explain what it means to be a team player...how well do you work with others.."}], [{"date": "19 Oct 2016", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Wisconsin Oshkosh (Oshkosh, WI) in May 2014", "Interview Descriptions": "Fill out a job application on Handshake, allow a few weeks/months for a manager to contact you. They will sit you down for an interview towards the end of the semester. It is fairly laid back and just want to know what you know.", "Interview Questions": "Identify specific computer components."}, {"date": "10 May 2014", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin Oshkosh in Oct 2013", "Interview Descriptions": "Interview was a general dialogue. The intervieers were very friendly.They ask normal questions that I was asked in prior interviews. Only tow people ask me questions  and all question had something to do directly or indirectly with  the job position.", "Interview Questions": "Normal question, nothing out of this world"}, {"date": "22 Apr 2015", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Wisconsin Oshkosh in Mar 2012", "Interview Descriptions": "The interview was very straight forward asking about your tech history.  The importance of having a job like this in college will propel you into the future of your development.  If you can work as a student I strongly recommend trying to work here.  If you have the ability to learn quickly this job is for you.", "Interview Questions": "Tell me a time when you failed."}, {"date": "9 Dec 2015", "title": "LTE Position With CON Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Wisconsin Oshkosh (Oshkosh, WI) in Mar 2011", "Interview Descriptions": "The interview process went well. The university is run very well, and the CON is an especially well-oiled machine so it was very smooth, organized, and professional. The trio or quad of execs/managers that met with me for a panel interview were both caring and professional and asked very thorough questions but were not intimidating or belittling. It was a very good experience and I would recommend anyone, especially LTEs or young office admins trying to get their foot in the door or become more established in higher ed management, working there.", "Interview Questions": "Why are you interested in the CON?"}]]