[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "5 reasons to work for Big C", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Sept 2019", "job_title": "Human Resources Officer in Norwich, England", "duration": "N/A", "pros": "5 reasons to work for Big C\r\n\r\n1. Benefits\r\nA variety of employee benefits, such as a 5% Pension contribution, Cycle to Work Scheme, 33 days holiday per annum, discounted parking and food from the cafe at the Centrum building in the Norwich Research Park, staff discounts via Edenred, Company Sick Pay and Life Assurance*\r\n \r\n\r\n2. Wellbeing and Inclusion\r\nAs part of our commitment to inclusion and respect for individuality and diversity across the organisation plus recognition that metal health commitment, we have signed up to being Disability Confident Committed, have Workplace Health Champions and Mental Health First Aiders within our teams to support you at work\r\n \r\n\r\n3. Credible\r\nAs members of NVCO (the National Council for Voluntary Organisations) we receive expert support and advice which keeps the organisation up to date with important news within the sector. \r\n \r\n\r\n4. Support\r\nA dedicated and supportive team – whether you want to work in one of our shops, centres or office, you will be working with people who are committed to helping you succeed\r\n \r\n\r\n5. Make a difference\r\nThe most important reason by far is knowing that the work that you are doing is helping local people affected by cancer and being able to see the impact of your work on a regular basis.\r\n\r\n\r\n*All benefits are subject to eligibility/ scheme rules\r\n\r\nIf you would like to join our mission and have the skills and experience we are looking for, we would love to hear from you.", "cons": "Any downsides are balanced up by knowing that what we do makes a difference to so many people affected by Cancer."}]]