[[{"date": "19 Jul 2023", "title": "Digital Copywriter Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "Application - invite - interview - task. Interview was via zoom. The interviewers weren't friendly? The questions were basic and not diverse, they didn't seem like they could be bothered. I then never heard back even though I spent a long time on application/ preparing presentation / interview AND follow on task", "Interview Questions": "Why Red Cross? They also asked me to prepare a presentation"}, {"date": "31 May 2023", "title": "Evaluation Support Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross in May 2023", "Interview Descriptions": "Final interview had a three person panel. The questions were sent 24hrs in advance of the interview slot via email and additional sub-questions were asked during the interview. Received constructive feedback following rejection.", "Interview Questions": "What attracts you to this role? Tell me about a time when you’ve gathered and analysed evidence to explore an issue and presented your findings. Could you give me an example of when you’ve overcome a challenge to build a successful working relationship? Can you tell me about a situation where you needed to tailor information to suit different audiences? Can you describe a time when things didn’t go according to plan at work? How would you like to develop in the role? Diversity and inclusion are important to the organisation. Describe how your experiences and understanding might aid your ability to perform this role?"}, {"date": "2 May 2023", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "- Tour around the shop, Day at the back, Sorting through items. - any work experience? What are you looking to help with? What are your strengths and weaknesses? show you know some bits about the organisation", "Interview Questions": "What do you know about the company?"}, {"date": "7 Apr 2023", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "Described as an \"informal chat\" however I was pre-warned they would have 4 questions for me. Standard questions such as why do you want to work for the BRC, how does your experience align, how do you manage a high workload.", "Interview Questions": "How do you manage a high workload?"}, {"date": "18 Jul 2023", "title": "Brand Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Red Cross (London, England) in Apr 2023", "Interview Descriptions": "One round with a 3-person panel. Competency-based questions were provided ahead of the interview which I found really helpful and enabled me to demonstrate strong examples of experience. The interview lasted roughly 1 hr with plenty of introduction to the role and time for questions at the end.\r\n\r\nMy biggest frustration was the post interview communication. I was told I would hear quickly (within 24hrs) and then waited over a week for a generic unsuccesful email.  I felt the interview went really well and that I demonstrated every example the role was looking for. I also felt I built a good repour with the panel and so I requested feedback which was never recieved. \r\nI would have liked to understand where I wasnt successfull and any areas of improvement. \r\n\r\nI was impressed with the brand however the experience and poor communication does have an impact on perception of what it might be like to work as part of that organisation and team and so given the overall experience I wouldnt apply for roles with the British Red Cross in the future.", "Interview Questions": "What excites me about the role. Use of Data & Insight to form a strategy Example of tools created for teams to create their own content D&I specific campaign example"}, {"date": "4 Jul 2023", "title": "Global Head of Institutional Funding and Strategic Partnerships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at British Red Cross (London, England) in Apr 2023", "Interview Descriptions": "A panel of 3 with no experience and expertise in institutional funding. The process was rushed, felt a tick box exercise and there was no efforts whatsoever to ensure questions were clear. Questions were not fit for the job profile. Asked for feedback twice but received nothing at all.", "Interview Questions": "What tools you use for team's performance manager?"}, {"date": "21 Feb 2023", "title": "Care Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Quick and easy Nothing to hard I applied online and I heard back within a couple of days, interview was booked 2 weeks from forty applying Had to drive an ambulance", "Interview Questions": "How much experience do I have"}, {"date": "31 Jan 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Very simple and easy. I applied on indeed but you can apply on their website. All I did was send in my CV and got my friend to be my reference, but you can get a teacher or boss to do that as well.", "Interview Questions": "When I would be available"}, {"date": "20 Jan 2023", "title": "Senior Service Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "Two stage. Provided with case study 2 days prior to interview.  Initial interview 30 minutes (but late letting me on call and interviewer eating).  Panel of 2.  One of the panel had an extremely aggressive interview style, going off topic and making off the cuff remarks in a very acerbic manner.   No questions regarding management experience only casework. No opportunity to ask any questions at all.  Very odd questions unrelated to role.  The whole interview was bordering on the surreal (reminder to the BRC - interviews are a two way process and 2 seconds in, I was fully aware that I could not work in this environment).", "Interview Questions": "What did you want to be when you were a child?"}, {"date": "17 Dec 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Two stage interview. Basic questions, focused on experience and generic give an example of when interviews. recorded the interviews. Lack of clarity on the role. Mixture of experienced and inexperienced personnel conducting the interviews. Job advertised during covid in an evolving situation. Clear lack of proper Human Resources process and procedure in the recruitment process.", "Interview Questions": "Focused on experience and generic give an example of when interviews."}], [{"date": "22 Nov 2022", "title": "Data Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (Newyork, Argyll and Bute, Scotland)", "Interview Descriptions": "The interview was so easy and the panel was friendly. I was not expecting that. I will keep on looking for other opportunity with Red Cross. The team is professional as compared to other Civil Organisations", "Interview Questions": "Why do you want to work for Redcross"}, {"date": "6 Dec 2022", "title": "Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (Cardiff, Wales) in Sept 2022", "Interview Descriptions": "Competency based interview lasting an hour , one stage interview, with two people in attending, interview was conducted remotely using zoom asking questions on experience and skills, got back to me with in the week, interview was friendly and positive experience", "Interview Questions": "What do you know about our values"}, {"date": "13 Feb 2023", "title": "Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (Leeds, England) in Aug 2022", "Interview Descriptions": "Very smooth and efficient, all questions were relevant to the role and about how strongly I feel about helping out people in need . They have special significance to health and safety issues in order to help vulnerable people", "Interview Questions": "How important it is to ensure the safety and well-being of a client."}, {"date": "15 Jul 2022", "title": "Governance Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross (London, England)", "Interview Descriptions": "Interview consisted of a pre interview case study sent thirty minutes before a traditional question and answer interview panel made up of two interviewers, consisting of six to eight questions.", "Interview Questions": "What inclusion and diversity means to you"}, {"date": "14 Jul 2022", "title": "Refugee Case Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "For people in crisis, as a result of their migration status, in need of protection, displaced and often having experienced family loss and separation our Refugee Support and Restoring Family Links team will deliver on our unique position and responsibility as part a truly global humanitarian organisation, present at every stage on the migratory trail to:\r\n\r\nReduce destitution and exploitation\r\nRestore family links and facilitate reunion\r\nChallenge stigma and build inclusion\r\nEnsure protection and empower people to make positive decisions to regain control of their lives \r\n\r\nWe will do this by mobilising the power of humanity through three distinct vehicles for change - advocacy, service delivery and by creating the right environment.\r\nWe will engage with our service users and use their experience and evidence to inform our development and delivery and will seek out opportunities to build productive alliances across the UK, wider movement and beyond to enable delivery on our mission at the earliest opportunity", "Interview Questions": "Reporting to the Casework Coordinator, you will work with people of all ages, depending on the casework requirements at the time; this includes single adults and families."}, {"date": "14 Jun 2022", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "STAR interview, took around 30 mins. Interview was easy and the people were friendly. Just do some research and also make clear you want to help people, its a charity.", "Interview Questions": "Name a situation where you dealt with difficult cusomter"}, {"date": "3 May 2022", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "One short exam, 45 min interview with a panel of three. Waited a week to hear from them. Don’t think they appreciated international experience. Exam was blind, not knowing what to expect.", "Interview Questions": "How I handle conflict - annoying recycled question "}, {"date": "8 Nov 2022", "title": "EMT Ambulance Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (Newcastle, England) in May 2022", "Interview Descriptions": "Telephone interview lasting about an hour it was informal and more of chat to see if the role was a fit for me and if I had enough time to commit An induction driving the ambulance and meeting the team.", "Interview Questions": "What drove you to apply for the role?"}, {"date": "10 Mar 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (Paisley, Scotland) in Mar 2022", "Interview Descriptions": "I had two interviewees, they asked questions one by one. First they had a set of  formal questions about my knowledge of the company, what I'd do in certain situations,why I would like to join the company, etc.\r\nThen we went to the bit more informal questions about my formal experiences, and how is my personality.\r\nFinally I had to opportunity to ask questions from them.\r\nThe interviewees were friendly, open-minded, and honest, they answered all my questions and gave me good vibes, it was a pleasant experience.", "Interview Questions": "What do you know about the British Red Cross?\r\n- Why did you applied for this position?\r\n- Have there been any situations when you encountered a problem at work? How did you resolved the situation.\r\n- Have you ever worked in a multicultural team before? What do you like and dislike about it?"}, {"date": "27 Feb 2022", "title": "Volunteer Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Modes of communication: Online Application form, telephone conversation, chat online,  Email interview appointment. Friendly and welcoming,  Passionate and motivated humanitarian approach. Interviewee skilled at interpersonal communication and unconditional positive regard.", "Interview Questions": "Why do did you choose British red cross"}], [{"date": "18 Feb 2022", "title": "Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "set questions, fairly organised between two interviewers, well paced, understanding environment and took time to listen to my answers. \r\nI had to send in id documents beforehand and there were plenty of dates and times to choose for the slot, and it was all done remotely.", "Interview Questions": "Describe a time you have worked as part of a team"}, {"date": "9 May 2022", "title": "Sales Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at British Red Cross in Feb 2022", "Interview Descriptions": "Teams - remote so no issues.  2 person panel.  All links sent before hand and understanding people if any tech problems- but there wasn’t- it was a nice interview which lasted an hour.", "Interview Questions": "How did you cope with the pandemic "}, {"date": "16 Jan 2022", "title": "Emergency Response Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "The process was thorough. They got back to me very quickly about the interview and the procedure was very clear. They followed up promptly. They want you to answer in STAR format.", "Interview Questions": "When have you managed conflict in a team?"}, {"date": "27 Aug 2021", "title": "Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Lengthily and unclear. The online application advertised was very appealing stating full time hours and great training however upon the actual interview the post was for 7 hours only and not guranteed more", "Interview Questions": "What methods would you implement to support emotional outburst "}, {"date": "21 Aug 2021", "title": "Head of Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Very efficient and well managed. Heard frequent updates about my application. I didn’t get the role but overall a positive experience and everyone was very friendly. I would apply for another role with British Red Cross.", "Interview Questions": "What interested you in the role "}, {"date": "19 Aug 2021", "title": "Shop Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "It was to some extent a relaxing interview that lasted for 10 minutes. The manager was very nice and asked me some basic questions such as when I was available. She recognised my personality.", "Interview Questions": "Why do you choose British Red Cross?"}, {"date": "26 Jul 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "There was an online application form and I was then invited for an interview with two interviewers. When rejected, I was offered feedback. I felt some of the feedback was unfair as they complained I did not speak enough about my career ambitions, despite this not being mentioned in any of the interview questions.", "Interview Questions": "Why did you apply for this role?"}, {"date": "15 Oct 2022", "title": "Head of Strategic Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Jul 2021", "Interview Descriptions": "It was pretty straightforward. The team explained the role and purpose well and asked a series of competency and scenario-based questions. They offered an opportunity for questions at the end, which they answered to my satisfaction.", "Interview Questions": "What would your process be of setting up a communications strategy"}, {"date": "6 Dec 2021", "title": "Project Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross in Jun 2021", "Interview Descriptions": "It was very organized and I was allowed to relax and given opportunity to answer questions to the best of my abilities.\n\nTaking the pressure out helped a lot in coordinating my answer", "Interview Questions": "How will manage my time on the job?"}, {"date": "10 May 2021", "title": "Summer Work Experience Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Completed online application describing why I want to work at the Red Cross. Had an in-person interview with 2 members from HR, asked me typical interview questions. Was quite relaxed, not too daunting.", "Interview Questions": "What are some of your weaknesses "}], [{"date": "8 May 2021", "title": "Fundraising Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "One interview that was roughly an hour long at British Red Cross headquarters in London.  There were two interviewers, one of which was the line manager. There was also a short written test at the end that lasted about 30 minutes.", "Interview Questions": "What are you strengths and weaknesses?"}, {"date": "7 Jun 2021", "title": "Analytics Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in May 2021", "Interview Descriptions": "This was a two stage interview for a new 12 month FTC role. Prior to both interviews they sent the questions over, both interviews came with a task. \r\n\r\nThe first round was set for 1.5h (but took more than 2h) which included a 30min excel/sql test. There were 3 interviewers (hiring manager and two stakeholders). The next day I received an email from one of the interviewers saying they’d like to invite me to the next and last round - again a 1.5h interview with 3 interviewers (hiring manager and one stakeholder from the first round, joined by another stakeholder). In preparation they asked me to put together a presentation about a project that I was proud of/that had a lot of impact.\r\n\r\nAbout a week after that final interview I got an automated email telling me I was unsuccessful but with no further feedback. So after almost 4h of interviewing and several hours preparation they couldn’t even drop me a personalised note. I emailed the interviewers about this but so far nothing. Not impressed with that at all.", "Interview Questions": "N/A"}, {"date": "30 Mar 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross", "Interview Descriptions": "I was contacted about a written task where I was asked to write a sample letter to a donor 24 hours before the interview. The interview consisted of questions followed by a discussion about the written task.", "Interview Questions": "They asked 20 questions about the skills for the role, my experience, and more specific hypothetical questions about the fundraising role "}, {"date": "15 Feb 2021", "title": "Emergency Response Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Red Cross", "Interview Descriptions": "2 on 1 interview, they asked a series of competency based questions. They were friendly but based on their behaviour it seemed like they had already identified another candidate for the role and were simply going through the motions. Interview questions were mostly competency based, some tested the applicants knowledge of the British Red Cross  activities, values etc. Anyone without prior volunteer experience would be at a distinct disadvantage", "Interview Questions": "Tell us about how you react when things don't go according to plan?"}, {"date": "9 May 2021", "title": "Innovation Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Red Cross in Feb 2021", "Interview Descriptions": "Thee was a normal application with CV and cover letter. Then there was a 15 minute interview which was only three questions. I was rejected at this point but I believe there was a longer interview if you moved on and that was the last stage.", "Interview Questions": "Name three ways you would speed up a dominos delivery"}, {"date": "5 Jan 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "Very friendly and the interviewers carried out the interview process in a calm manner which helped me relax abit. The majority of the questions were scenario based on real work situtation. I was offered a break for 5 min during the interview during which one of the interviewers showed me around the office.", "Interview Questions": "What do you know about the values of the British Red Cross?"}, {"date": "11 Dec 2020", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Red Cross", "Interview Descriptions": "First interview was with the Manager and was selected for next interview with local branch manager. I needed to take 2 trainings before joining. The process was lengthy but quite enjoyable.", "Interview Questions": "Most of the questions were Safeguarding Related."}, {"date": "4 Dec 2020", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "Short interview with a panel, there were two or three others on the panel. The interviewers were friendly and it was generally a pleasant process. It didn't feel very formal, and they were both very personal although this is likely due to the nature of communications.", "Interview Questions": " I can't remember the specific questions, but a lot of questions about how to build social media engagement. "}, {"date": "13 Oct 2021", "title": "Multimedia Production Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (London, England) in Dec 2020", "Interview Descriptions": "First interview with 3 people via zoom, they sent over interview questions so I could prepare which was really helpful, was an hour long. Feedback within a few days, as per their schedule. Second interview was in two parts - 20 mins with additional questions, and then meet two members of the team (separately, 20 mins each). Again via zoom. More relaxed and informal. Before 2nd interview there was an assignment to follow a brief and plan a shoot", "Interview Questions": "Share recent campaign you've enjoyed\r\nYour approach to planning a shoot, things to consider\r\nHow would you resolve conflict and manage client comms\r\nShare an example of an integrated project you've worked on"}, {"date": "29 Nov 2020", "title": "Inclusion and Diversity Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "Was required to provide four minute presentation, provided with main interview questions upfront. All 3 members of interview panel were very friendly. However, received generic rejection email after and was very disappointed.", "Interview Questions": "Please tell me about a time where you have created content to provide education on a complex topic – and any follow-up activity you undertook to enhance the understanding of the topic."}], [{"date": "16 May 2021", "title": "Emergency Response Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (Croydon, England) in Nov 2020", "Interview Descriptions": "I applied for multiple positions at this company. Fair enough, looking back, I wasn’t really suited for the roles and I don’t expect this company to spend a whole lot of time on me for feedback, especially in a pandemic.\n\nBut what really irritated me about this company in particular was how they not only refused to give any kind of feedback at all, they actually have the cheek to ask YOU for feedback on how their recruitment processes were! \n\nIf you can’t be bothered to treat your candidates right and give a tiny summary of what I did right and wrong, why should I bother applying again or even giving you guys feedback on your internal systems? \n\nFor a charity that does a lot of good in the world, you need to look inwards, I dread to wonder how your staff are treated.", "Interview Questions": "What personal traits and qualities do you feel is right for the British Red Cross? (Not exact phrasing)"}, {"date": "1 Mar 2021", "title": "Volunteering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at British Red Cross (London, England) in Oct 2020", "Interview Descriptions": "It was very laid back. The interviewer simply asked me a few questions about my availability and why I would like to volunteer. We ended up chatting about her daughter as she is of a similar age to me and university life. Very lovely.", "Interview Questions": "Why would you like to volunteer?"}, {"date": "7 Feb 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Red Cross in Sept 2020", "Interview Descriptions": "Conducted via zoom with 3 people participating in the interview taking it in turns to provide information and ask questions. Lasted around 40 minutes. Rather straight forward, friendly atmosphere and helpful staff.", "Interview Questions": "Who is your biggest inspiration?"}, {"date": "4 Feb 2021", "title": "HR Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross in Aug 2020", "Interview Descriptions": "Easy with an external recruiter and later during the interview head of HR joined. Was stressful as any interview but if you confident with your experiences it should be fine. Few questions asked at the beginning about my organisations skills and approach to job. After EXCEL test was required.", "Interview Questions": "About my attention to details "}, {"date": "19 Oct 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at British Red Cross (Cambridge, England) in Feb 2020", "Interview Descriptions": "Protracted on Teams and poorly run. Got the feeling they were going through the motions. Asked for feedback eventually received some which did not make any sense. Came away from it very dispirited. Knew a great deal about the Red Cross because prior to this I had been a volunteer.", "Interview Questions": "Why do you have gaps in your CV?"}, {"date": "9 Jan 2020", "title": "Refuge Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "An interview and a written test. Questions were pretty generic and scored on a points based system. The written part was scenario-based answering questions about how you would respond to a situation that would typically arise in the job", "Interview Questions": "Fairly standard foreperson panel with generic competency questions"}, {"date": "5 Jan 2020", "title": "Admin Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at British Red Cross", "Interview Descriptions": "Online application, broken down into easy sections - the personal statement can be pretty time consuming. Interview was given quickly and told of results straight away. Interview panel were friendly", "Interview Questions": "An example of working with an unreliable team member"}, {"date": "28 Jan 2020", "title": "Marketing Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (Paisley, Scotland) in Jan 2020", "Interview Descriptions": "I was contacted  very quickly after the closing date and invited along to an interview which consisted of a presentation and competency questions. The interview slot was for one hour but took an hour and a half in total.", "Interview Questions": "What do you think of our current marketing campaigns? "}, {"date": "23 Mar 2022", "title": "Public Affairs Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Jan 2020", "Interview Descriptions": "Interviewed by two staff members with whom I discussed an assignment done prior to the interview.  Went through standard job interview questions, none of which very challenging. Overall not a difficult interview.", "Interview Questions": "Which of your work experiences makes you most suitable for this role?"}, {"date": "21 Dec 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Red Cross (Edinburgh, Scotland) in Jan 2020", "Interview Descriptions": "Half-day assessment centre at their headquarters in Edinburgh. Started early and seemed to be mostly about ascertaining whether each candidate would get on with the others. Had a 1-1 interview at the end of the day.", "Interview Questions": "Why do you want to work for the BRC?\r\nWhat is your biggest weakness?\r\n"}], [{"date": "14 May 2020", "title": "Assistant Store Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (Cambridge, England) in Nov 2019", "Interview Descriptions": "The interview lasted one hour and was conducted by the shop manager and recruitment manager. They were great! They made me feel really comfortable and welcome. They had my CV and cover letter in front of them with lots of notes and overall they were really well prepared and organised. They didn't ask any generic questions (which I really don't like) and basically asked follow-up questions about things I mentioned in the application.  About 30m of the interview consisted of hypothetical scenarios type questions. They test your personality, experience and common sense.  \r\n\r\nI didn't get the job and asked for feedback. They replied rather quickly and were very kind. I didn't have enough sales experience in their view so they suggested volunteering with them and then applying again if possible.\r\n\r\nI would definitely recommend applying for a job with the British Red Cross! I was really impressed with the people and the process.", "Interview Questions": "What would you do to increase sales if you think you won't be able to meet next week's target?"}, {"date": "11 Oct 2019", "title": "Refugee Support Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Sept 2019", "Interview Descriptions": "The recruiters contacted me by email to set up for an interview which took place over the phone. The panel was constituted of 3 members: HR and Manager. They asked questions one by one.", "Interview Questions": "They asked me to introduce myself and explain why I was interested in the position. \r\nSome technical questions related to case management, staff management and managing a budget. They asked about my capacity in working under pressure, prioratising and dealing with emergencies. "}, {"date": "26 Aug 2019", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "Contacted by letter to invite me to interview.  On the day interviewed by a panel of two. A Line Manager and a Manager. Quite informal as they wanted to get to see the 'real' me and not 'interview' me!", "Interview Questions": "What did I know about the Red Cross and it's history"}, {"date": "7 Aug 2019", "title": "Customer Service Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (Manchester, England) in Jul 2019", "Interview Descriptions": "Offered interview, call to book appointment, interview took place within a week.\r\nNice, airy and clean big conference room, sat opposite two team leaders (male and female).\r\n\r\nI actually googled in advance the type of questions id be asked, and a lot said there was plenty opportunities to use the STAR technique, which there definitely was, I found this really hard because of my memory so I know this is where I let myself down. I prefer to be asked how to tackle an issue refer than reflect back... BUT the interviewees was so friendly, if you can nail down some solid STAR examples you will give yourself a better chance.\r\n\r\nThis was my first interview in few years from being off sick but I definitely had worse interviewers.", "Interview Questions": "Give an example of how I've handled conflicting views with a colleague?"}, {"date": "28 Sept 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (Leeds, England) in Feb 2019", "Interview Descriptions": "Two interviewers were asking questions about my experience and interest in the role. This lasted around 20 minutes. They were both friendly and the interview felt laid back. It was held in a small meeting room.", "Interview Questions": "What experience I had for the role.\n\nWhy I was interested in the role. \n\nWhat fundraising experiences I had / what I understood about fundraising. "}, {"date": "29 Dec 2019", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (Dundee, Scotland) in Jan 2019", "Interview Descriptions": "I had no background in care so they asked me some basic interview questions and a fairly straightforward handful of safety questions regarding how to deal with vulnerable users. There were the usual strengths and weaknesses questions and they asked whether I had transferable skills that are relevant to the roll.", "Interview Questions": "If a service user asks you to add them on Facebook what do you do?"}, {"date": "18 Jan 2019", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Red Cross in Jan 2019", "Interview Descriptions": "Two managers and myself were in the room, lots of questions written on a sheet that they asked you and you had to answer. Some of the questions were hard and took me a few moments to gather my thoughts, they were really friendly and said take your time.", "Interview Questions": "How would you increase sales?\r\nCan you think of a time where you were faced with a challenge and how you resolved it?\r\nHow would you handle abuse?"}, {"date": "28 Feb 2021", "title": "Summer Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Jan 2019", "Interview Descriptions": "Online interview  with two people from the philantropy team. They were friendly and easygoing. The questions were typical, there were some situational ones. I recieved a feedback later on saying there was a better fit.", "Interview Questions": "Tell us about a time where you had to come up with a quick solution to a problem?"}, {"date": "14 Nov 2018", "title": "H R Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "Submitted CV on the site. On shortlisting, I was called for 1:1 interview. Interview was done by 2 officials. Interview was smoothly streamlined and held in friendly environment and it was effficient process of interview.", "Interview Questions": "What will be your contribution to the orgnaisation?"}, {"date": "8 Jul 2019", "title": "International Programmes Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at British Red Cross (London, England) in Oct 2018", "Interview Descriptions": "One test (excel and budget related questions) and a short interview with the usual questions you might expect. The decision was made very quickly with an offer made on the same day", "Interview Questions": "What I knew about the organisation"}], [{"date": "29 Mar 2022", "title": "Youth Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross in Sept 2018", "Interview Descriptions": "There was only one round of interviews and there were two interviews who asked questions. The questions were motivation and competency based, and what you would expect for an entry level role. The interview lasted about 20-25 minutes.", "Interview Questions": "Why are you interested in working the British Red Cross?"}, {"date": "2 Aug 2018", "title": "Team Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross", "Interview Descriptions": "I applied online and was emailed asking me to come in for an interview. I came in and was interviewed by two members of the team (including the manager). It was very friendly and relaxed.", "Interview Questions": "What do you know about the work we do and our values"}, {"date": "17 Aug 2018", "title": "Event First Aid: Logistics Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Aug 2018", "Interview Descriptions": "Had a pre-selection interview over the phone, and got offered an interview where the atmosphere was informal and easy-going.\r\nThe recruitment and selection coordinator was very nice and explained to me about the training and provided with a paper based copy of the job roles.", "Interview Questions": "Give an example of a complicated situation you have dealt with"}, {"date": "24 Nov 2021", "title": "Refugee Support Case Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at British Red Cross (Coventry, England) in Aug 2018", "Interview Descriptions": "A simple conversation over zoom. Found that they were very accommodating as to the format that it took. Following the interview, they got back to me within the next week.", "Interview Questions": "Why do you think you are suited to this role?"}, {"date": "8 Jul 2019", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (London, England) in Jul 2018", "Interview Descriptions": "Standard point systems and was asked few things about how to troubleshoot network and was done  quickly. Few quesitons on generally what techs you have used etc. and before you know it it was over. Tell me about yourself style quesiton too.", "Interview Questions": "How do you troubleshoot laptop or network not conencted to the internet"}, {"date": "22 May 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "I initially applied online with CV and cover letter followed by a face to face panel interview with two interviewers, where they asked some questions regarding previous work experience and how it related to the role. Was also asked to bring a small written task with me to the interview.", "Interview Questions": "Why the Red Cross?"}, {"date": "29 Jun 2018", "title": "Fundraising Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (Sheffield, England) in May 2018", "Interview Descriptions": "Applied online via the organisation's job portal. Invited the next week for a 20 minute written task and followed by a competency based panel interview with three members of the fundraising team.", "Interview Questions": "Why I was interested in the position, what I knew about the organisation, my experience of fundraising etc. "}, {"date": "28 Apr 2022", "title": "Service Manager - Emergency Response & Resilience Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Red Cross in May 2018", "Interview Descriptions": "I was invited for an interview for the role which covered the Fife, Lothian and Borders region. As part of the interview process I was required to prepare a presentation, which I took 2 weeks working on. Upon arrival the hiring manager dismissed the presentation, saying that it was \"something Head Office had implemented\" and wasn't even bothered about hearing it. I left the print outs I had brought along. The rest of the interview continued in the same vein, the interviewer had no interest in me and it was clear he already had a preferred candidate in mind. I left with a bitter taste in my mouth and a very negative impression of how that particular branch was run.", "Interview Questions": "What would stop a charity providing aid in a specific region? "}, {"date": "10 Apr 2018", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (Dundee, Scotland)", "Interview Descriptions": "Interview was pretty straight forward was interviewed by 2 managers and they just asked which care experience you and which you would do in a situation I.e how would you convince a service user to get out of bed.", "Interview Questions": "Which care experience do you have?"}, {"date": "13 Jan 2020", "title": "Philanthropy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Red Cross (London, England) in Mar 2018", "Interview Descriptions": "I applied online and was invited for an interview, but because I don't live in London I did a video interview. It went on for about 30 minutes including skill based questions and some situational questions. I was interviewed by two people from the team.", "Interview Questions": "What can you bring to this role?"}], [{"date": "20 Jan 2021", "title": "HR Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Feb 2018", "Interview Descriptions": "Standard competency questions.  They ask you about your experience why you want to work for this place ? Previous Charity experience helpful. \r\nRead their values\r\nRead their website \r\nSee their current work they do online \r\nFollow third social media.\r\nCheck them out on LinkedIn\r\nThink about your Why? Why do you want to be here compared to say another charity?", "Interview Questions": "Tell us about yourself ?\r\nWhy do you want to work here? \r\nHow do you handle this situation ? "}, {"date": "8 Oct 2018", "title": "Refugee Work Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at British Red Cross (Manchester, England) in Feb 2018", "Interview Descriptions": "I was interviewed by two staff members who were really friendly and warm and who made me feel very comfortable. They first explained the role in detail and then asked me a set of questions relating to the role.", "Interview Questions": "How do you stay organised?"}, {"date": "5 Feb 2018", "title": "Property Support Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (Paisley, Scotland) in Jan 2018", "Interview Descriptions": "Online application with 900 word essay on how you meet the competences. 1st Interview: CV overview then competency questions but more informal as it was conversational. The 2nd interview was to go over my areas where I lacked experience and how I would deal with certain situations.", "Interview Questions": "Describe a time you've had competing demands and you did you manage these?"}, {"date": "19 Jan 2018", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (London, England) in Dec 2017", "Interview Descriptions": "it's only one interview which lasts for 45 minutes; they ask 10 questions; they give you their feedback few days after the interview; they 're very nice and professional and always make you feel very comfortable", "Interview Questions": "they ask 10 questions related to previous job experience, the reason why working with the red cross, how the person's skills can be useful to the job, centered person approach, how to improve the service, how to deal with a dangerous or difficult situation, team work,  etc"}, {"date": "23 Jan 2018", "title": "Implementation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (Swansea, Wales) in Dec 2017", "Interview Descriptions": "Interview panel very friendly and welcoming. Panel consisted of Manager, department Officer and a former service user of their Independent Living Team. Competency based interview questions with a 30 minute Excel data input task", "Interview Questions": "Why do you want to work for British Red Cross?\r\nWhat was the last qualification you gained and why did you do it?\r\nGive me an example of how you planned and managed your time to complete a task?\r\nHow would you approach dealing with people who have an array of vulnerabilities?"}, {"date": "28 Sept 2018", "title": "Senior Direct Marketing Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Red Cross (London, England) in Dec 2017", "Interview Descriptions": "Online application, 2 rounds of interviews, an (informal) presentation and 2 skills tests as part of the interview process.", "Interview Questions": "Examples of campaign management experience, in detail"}, {"date": "20 Feb 2019", "title": "Tiffany Circle Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (London, England) in Nov 2017", "Interview Descriptions": "Interviewed at their London office. I was interviewed by two staff members (both working in the Philanthropy team), consisted of 12 structured questions - mainly competency/scenario based. \r\nI was not offered a position and did not receive any feedback (despite them offering this by email and  having following up several times to ask for it).", "Interview Questions": "What are the principles of the Red Cross?\r\nDo you have experience with XX system/database? (used by fundraising department at BRC)\r\nExperience with caring for donors/building relationships with external stakeholders"}, {"date": "7 Oct 2019", "title": "Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (Manchester, England) in Nov 2017", "Interview Descriptions": "Questions were provided in advance and were mainly competence based and covered topics such as safeguarding, negotiation skills and managing expectations.  Two people led the interview both were friendly and welcoming and made me feel at ease immediately.", "Interview Questions": "Negotiation skills "}, {"date": "17 Oct 2017", "title": "Training and Quality Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "Competence based interview - lots of questions requiring examples as answers.  Answers and examples of questions that were asked were already in my supporting statement and cover letter do I felt as if either they hadn't read them or were asking me to repeat them!", "Interview Questions": "How do you manage both internal and external stakeholders harmoniously"}, {"date": "23 Nov 2017", "title": "Volunteer Caseworker for Refugees and Asylum Seekers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross in Oct 2017", "Interview Descriptions": "Informal interview, lasted 35 minutes. Friendly interviewer, she made me feel at ease. In general, you are asked to talk about your experience, tested on your ability to empathise and to understand and respect the rules of the organisation.", "Interview Questions": "What is confidentiality to you and how you think this applies to the role."}], [{"date": "29 Oct 2017", "title": "Direct Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at British Red Cross (London, England) in Oct 2017", "Interview Descriptions": "Application, short- listed for interview. Interview and then test. \r\n\r\nInterview was with two senior people from the same department. Neither particularly friendly.  Test after 45 minutes of questions, which last 30 minutes.", "Interview Questions": "What does equal opportunities mean to you"}, {"date": "28 Oct 2017", "title": "Trust and Statutory Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (London, England) in Sept 2017", "Interview Descriptions": "It consisted of a 45 minute verbal interview and a one hour test. The test has two parts and involves analysing a spreadsheet and writing a report.\r\nThe interview was skills and experience based", "Interview Questions": "How would you steward a donor to increase gift value?"}, {"date": "1 Nov 2017", "title": "Restricted Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Jul 2017", "Interview Descriptions": "There are multiple stages enforce the interview online including questions, CV, education history, reasons for applying etc. The interview process was two stages: 45min-1hr competency interview and 1hr written test.", "Interview Questions": "Why the Red Cross?"}, {"date": "7 Aug 2017", "title": "Corporate Partnership Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Jul 2017", "Interview Descriptions": "I went through an initial  face to face interview with two employees  and then two practical tasks: writing a thank you letter to a donor and completing an Excel task in 30 minutes", "Interview Questions": "What is fundraising? "}, {"date": "4 Jan 2020", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at British Red Cross (London, England) in Jun 2017", "Interview Descriptions": "Group interview where we talk about ourselves and learn about the company while being assessed. It’s a three day process because it’s training and the interview at the same time. So whether you get the job or not, everyone gets trained", "Interview Questions": "What’s my greatest achievement this far"}, {"date": "4 May 2017", "title": "Innovation Fundraising Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Red Cross", "Interview Descriptions": "Two interviews - First one based on a simple test to describe how you would innovate a product and conversation questions about 'Tell us about a time'\r\nSecond interview with more senior team 'Tell us about a time'", "Interview Questions": "A time when you have overcome conflict"}, {"date": "9 Mar 2020", "title": "Shop Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in May 2017", "Interview Descriptions": "Thorough.  Lots of situational questions - emphasis on the core principles.  Was asked to prepare a SWOT analysis in advance. After the interview I was notified within a week. Some delay in receiving my official offer, symptomatic of the organisations poor administration.", "Interview Questions": "How would you support a colleague who was struggling at work."}, {"date": "17 Mar 2017", "title": "Community Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Red Cross", "Interview Descriptions": "Telephone interview and then face-to-face interview. The recruitment process was efficient and quick. The team were very friendly and I would have accepted if circumstances were different. A positive experience overall.", "Interview Questions": "What are our fundamental values and how are they reflected in your work?"}, {"date": "23 Sept 2018", "title": "Finance Development Delegate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at British Red Cross (London, England) in Apr 2017", "Interview Descriptions": "Three stage process that included a test. First and third stages included a panel interview process with the second stage being a test.  The test was thorough, relevant and challenging.", "Interview Questions": "Motivation to apply for this post"}, {"date": "15 Mar 2017", "title": "D2D Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "I send the application and 1 hour later I received a call for attending an 'assessment' on the same week at the headoffice in London. \r\n\r\nYou will be placed in a room with other applicants and will be asked to present yourself, other applicants and products. \r\n\r\nThey will give some information about the job and what is expected, it's all very informal and relaxed.", "Interview Questions": "Previous work experience, how you handle rejection."}], [{"date": "17 Nov 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Feb 2017", "Interview Descriptions": "One stage, competency test with two managers. Went through pre-written questions and answered accordingly.  The two managers were kind and patient. The interview was done in a Red Cross office.", "Interview Questions": "What challenges might you expect to find? "}, {"date": "12 Feb 2018", "title": "Business Support/Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Feb 2017", "Interview Descriptions": "Online application with 900 word essay. Two people interviewed me and they were really lovely. First part of the interview question was about my CV and what I know about the company. The second half focused on competency based questions and I think scenarios.", "Interview Questions": "why do you want to work for us ? what skills can you bring ?"}, {"date": "1 Mar 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (Paisley, Scotland) in Jan 2017", "Interview Descriptions": "i applied , got an interview email. had an interview  which was easy enough. The interviews asked me few easy questions and got a call pretty soon afterwards about the outcome.", "Interview Questions": "mostl some easy questions about "}, {"date": "4 Nov 2017", "title": "IFT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Red Cross (London, England) in Jan 2017", "Interview Descriptions": "Standard interview, nothing unexpected. Applied online and then got an invitation for an interview. Did the interview over the phone. A few days later I received a phone call telling me that I had got the position.", "Interview Questions": "Usual interview questions regarding the skills outlined in the job advert. "}, {"date": "29 Mar 2017", "title": "Innovation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Jan 2017", "Interview Descriptions": "I applied online. Once I was invited to the interview, I was asked to prepare a presentation.\r\nWhat I was not informed was that I also had a computer test. The test lasted 30 minutes and I had to prepare a letter and a Powerpoint presentation\r\nThen, I was interviewed by 2 people. I delivered my presentation and was asked questions about it. The interview followed with other questions relevant to the position. The interview was friendly but long.", "Interview Questions": "What attracts you to this position?"}, {"date": "8 Feb 2017", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (London, England) in Dec 2016", "Interview Descriptions": "It was a group interview, staff was warm and welcoming. Very friendly. I couldn't say one bad thing about the experience. A great charity to work for and are truely helping people worldwide and here in the UK. Thank you", "Interview Questions": "Describe yourself"}, {"date": "9 Nov 2016", "title": "Service Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Red Cross (Birmingham, England)", "Interview Descriptions": "On arrival at the offices, i was greeted by the receptionist and offered refreshment. interview process was straight forward and the questions in the interview were based on the knowledge of the organisation in the UK and internationally.", "Interview Questions": "Why do you want to work for the British Red Cross?"}, {"date": "23 Oct 2016", "title": "Corporate Partnerships Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England)", "Interview Descriptions": "Applied online, contacted 2 weeks later with an interview date. Interview was by two very nice employees, the questions were very basic interview questions about the role, ie. what is corporate funding? what examples do you have of fundraising? How would you write a thank you letter to donors? Then there was a small task to write a thank you letter and complete a very basic excel exercise", "Interview Questions": "What is corporate funding"}, {"date": "14 Nov 2016", "title": "Retail Support Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (Grangemouth, Scotland) in Oct 2016", "Interview Descriptions": "Applied online and heard within a week of the closing date that I had been invited for an interview.\r\nThe interview consisted of an excel and word assessment followed by a competency based interview, before a panel of 2, with approximately 10 questions.  The whole process took about an hour.  I received an email 3 working days after the interview to say that I had been unsucessful and that if I wanted feedback then I should let them know.  I emailed back to ask if feedback could be provided in writing or whether they only gave verbal feedback and despite chasing, I am still waiting on a response/acknowledgement over 2 weeks later which I find more disappointing than not getting the job.", "Interview Questions": "Can you give me an example of a time you worked as part of a team?"}, {"date": "24 Sept 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross", "Interview Descriptions": "Online application process using red cross system\r\nInterview within 2 weeks\r\nResult of interview same week as interview\r\nInterview 2 people.\r\n10 behavioural interview questions about use of skills and experience\r\nExercise on prioritising series of admin tasks. Read scenario and then answer question on how you would handle different types of priorities. \r\nOnline computer skills test for word, excel, PowerPoint and internet", "Interview Questions": "Tell us about a time when you had competing priorities what were they and how did you handle them"}], [{"date": "23 Oct 2019", "title": "Business Support Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Sept 2016", "Interview Descriptions": "Standard competency based interview with around 10 questions. Applied for the post in September and started in October so took a fairly long time to start however loved my time here.", "Interview Questions": "What attracted you to this role?"}, {"date": "11 Aug 2016", "title": "Event First Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (Dundee, Scotland)", "Interview Descriptions": "I applied, received an invite to start, then after I had been working 6 months, I was \"formally\" interviewed by my line manager. Which she never seemed to understand either. Basically, I probably shouldn't have been working there. Especially for the part where I was working with vulnerable children for the biggest part of the job!", "Interview Questions": "Why do you want to work for the British Red Cross"}, {"date": "8 Sept 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Jul 2016", "Interview Descriptions": "The red cross interview actually came through a little program they had planned, through that, I became a young ambassador. The interview is more of a friendly chat and questions were very generic.  Questions such as why would you like to volunteer, and what inspired you came up often.", "Interview Questions": "Of Red Cross's 7 fundamental principles, which one do you consider most important?"}, {"date": "16 Jul 2016", "title": "Street Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at British Red Cross (London, England) in Jul 2016", "Interview Descriptions": "Group Interview with over 20 people in a packed room, asked two pre-prepped questions. First an Introduction of yourself and work experience .Second about your passion. If given more time would have debated but there where so many of us in the room, and it took a long time. If this is your first big group interview can be intimidating, especially when most candidates have good experience. If I could do this again I wouldn't be a conservative, as they want to see how you interact with others as you will being that in the job.", "Interview Questions": "What is your passion ?"}, {"date": "16 Apr 2016", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Red Cross", "Interview Descriptions": "Test your knowledge and skills.  Normally two plus interview.  Ensure you read up about them lots of knowledge questions.  Standard questions asked, why do you want to work for us etc.,", "Interview Questions": "What are the fudemental principles and explain what they mean."}, {"date": "11 Sept 2019", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (London, England) in Apr 2016", "Interview Descriptions": "Had a group interview with Bespoke recruitment which involved around 30 people. I was successful and they placed me to interview with two further charities. BRC was an hour long group interview with around 10 people.", "Interview Questions": "Describe something you’re passionate about."}, {"date": "18 Feb 2016", "title": "Senior Training and Quality Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at British Red Cross (London, England) in Feb 2016", "Interview Descriptions": "One hour interview - lots of related questions but not a recap of the supporting statement info I had already submitted - so I felt that they were trying to know more", "Interview Questions": "How would you represent our brand and across different methods of fundraising"}, {"date": "9 Sept 2020", "title": "Shop Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (Aberdeen, Scotland) in Feb 2016", "Interview Descriptions": "Lengthy but plenty of time and opportunity to sell yourself. There is a scoring points system on the interview so it depends on how much you score on both peoples paparrs", "Interview Questions": "Do you know how to work with KPI’s"}, {"date": "7 Apr 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at British Red Cross (London, England) in Jan 2016", "Interview Descriptions": "I didnt have to do a formal interview with British Red Cross. I already knew someone, so I basically got the volunteer position. Try to network and get to know someone within the organization in order to get the job. It seems like you have to start at the bottom in order to advance in the organization.", "Interview Questions": "How can you help us?"}, {"date": "1 Feb 2017", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at British Red Cross (London, England) in Jan 2016", "Interview Descriptions": "One day interview, it didn't take more than 5 hours in total, including a lunch break. It's a group interview and you are asked to answer questions and interact with co-interviewees. Your communication skills are the most important, followed by multicultural awareness and motivation. Overall an easy and great experience which got me the job.", "Interview Questions": "Q: What are your hobbies?\r\nQ: What are your goals in life?\r\nQ: Why fundraising?\r\nQ: Why Red Cross?\r\n"}], [{"date": "9 Feb 2016", "title": "Logistics Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Jan 2016", "Interview Descriptions": "First of all I was invited to do an exercise compose by two main part:\r\n- questions about logistics (fleet management, warehousing, remote management, transport management, Shelter)\r\n- review of an Emergency Appeal\r\nThe exercise was exactly the same in November 2014 and January 2016.\r\nSecond stage was a in person interview with a lot of question mainly about logistics. The interview lasted for 90 minutes.", "Interview Questions": "Looking at the job description. Is there any particular area where you will need support to catch up?"}, {"date": "13 Jan 2020", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at British Red Cross (London, England) in Jan 2016", "Interview Descriptions": "Nice, calm, didn't felt pressure at any time. Interviewer was very nice and genuinely interest in what I had to say and contribute. We actually went over time and didn't realise the time pass.", "Interview Questions": "What sort of projects I had worked in the past, what were my hobbies and interest in personal life. "}, {"date": "8 Aug 2020", "title": "Sales Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (London, England) in Jan 2016", "Interview Descriptions": "Not engaging and they didn’t seem to listen to my expertise and experience I hope they can learn for this post to help when they hire future employees im actually just filling in 30 words because they require it for glass door uk for some reason?", "Interview Questions": "My hours "}, {"date": "14 Oct 2015", "title": "Take Over Day Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at British Red Cross (London, England) in Sept 2015", "Interview Descriptions": "Plain meeting with 2 interviewers who took the time to question me in rows. Friendly environment. They made me feel comfortable. Engaged with me the whole time and kept nodding and encouranging me to tell them more", "Interview Questions": "What do you know about BRC? Why did you choose to apply for this role? How do you see Equality and Diversity coming into play at your work with us?"}, {"date": "3 Dec 2015", "title": "Street Fundraiser Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at British Red Cross (London, England) in Sept 2015", "Interview Descriptions": "Group interview, multiple candidates. First stage to establish suitability for role and personality fit. \r\nA bit about the role, expectations. Bit more info on what the charity does, both in the UK and globally.", "Interview Questions": "Interesting fact about yourself"}, {"date": "23 Aug 2015", "title": "Door to Door Sales Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (London, England) in Aug 2015", "Interview Descriptions": "There was a group interview. They asked you to introduce yourself. From here they then group you with other people where you create an imaginary product and attempt to sell it to the interviewers.  Fairly easy interview however only about 2 or 3 out of up to 15 people from each interview progress to training. The interviewers are extremely friendly and attempt to relax you. You get free coffee and water. I would advise turning up a bit early to prepare yourself. At this stage you don't need to know any information on the company but it could end up being useful.", "Interview Questions": "Sell me and imaginary product but it has to be for £10 a month sign up for life."}, {"date": "30 Jun 2015", "title": "Digital Fundraising Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at British Red Cross (London, England) in Jun 2015", "Interview Descriptions": "Stages weren't clear - had 1st interview which was a panel interview of 2, then a test. Followed up with a 2nd interview which was a presentation, a panel interview of 3 and then another test.", "Interview Questions": "lots of competency based questions. Not many focused on Digital Fundraising. More around management and prioritization of your time. "}, {"date": "21 Jul 2015", "title": "Driver Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at British Red Cross (Ferryhill, England) in May 2015", "Interview Descriptions": "Basic two person interview which felt relaxed.Didnt feel nervous but I should have prepared more as some of the questions threw me off guard,but i felt job could be lost easily because of the trackers on the van which check speed and it is very difficult to keep to exact speed limit without going over even the tiniest bit.", "Interview Questions": "What would you look for when out on the road driving ?"}, {"date": "1 Jun 2015", "title": "Country Support Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in May 2015", "Interview Descriptions": "I did the application online and they wrote back to me within a couple of days inviting me for a one one interview. When i arrived i had to complete a finance test, which was simple enough had Excel been working correctly. The dated IBM computer was slow and therefore had problems with completing the whole test. Other than that, i think the interview was fine and the people who interviewed me were very pleasant.", "Interview Questions": "What sort of budgets have you managed?"}, {"date": "15 Oct 2015", "title": "Corporate Partnerships Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Feb 2015", "Interview Descriptions": "Entire process went really quickly. Interviews was a series of normal questions related to the post, no surprises, followed by an excel exercise and a written questions 1. Writing a letter", "Interview Questions": "What does corporate fundraising mean?"}], [{"date": "23 Feb 2015", "title": "Senior Community Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Red Cross (Inverness, Scotland) in Feb 2015", "Interview Descriptions": "Online application followed by interview where I was to complete two scenario based questions (15mins provided) then completed a 5min presentation and then interview questions. \r\n\r\nIt felt very much like all the information provided in the application wasn't even read or taken on board as all of the questions were very basic and common sense and I felt like I had repeated myself so many times. When it came to the presentation, the panel seemed completely surprised that I brought along some supporting documentation for them to look at while I did the presentation! One panel member clearly had no interest in the whole process, was rude multiple times and couldnt wait to leave - quickly threw on her jacket as I was about to leave the room. The one question I had for them about what its like working for BRC they couldn't even answer which made me feel like it wasn't the right place for me. \r\n\r\nNo follow up or feedback provided since the interview which is very disappointing considering the Red Cross need all the support they can get. I'm unlikely to do any volunteering with them now either.", "Interview Questions": "How do you like to be managed?"}, {"date": "19 Apr 2015", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Jan 2015", "Interview Descriptions": "The information before the interview was clear. I was invited to the interview within 2 days from the deadline. I was interviewed by panel made of 2. There was also a writing test after the interview. The  interviewees were very friendly. The questions weren't very challenging and mainly from the job spec", "Interview Questions": "Competency based and writing test"}, {"date": "5 Feb 2016", "title": "Refugee Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (London, England) in Jan 2015", "Interview Descriptions": "Met with the two managers I eventually worked closely with. Was relaxed and informal, asked basic questions regarding the position, refugees, and the organization as a whole. I had interned with the American Red Cross before this, so that worked in my favour.", "Interview Questions": "What do you know about the Red Cross? What are your experiences in human rights/non-profits? Why this position?"}, {"date": "9 Nov 2017", "title": "ITSM Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Red Cross (London, England) in Jan 2015", "Interview Descriptions": "Casual but well conducted and very thorough, both interviewers were very knowledgable and delved into a lot of detail regarding certain aspects of my history. It lasted little over an hour and I felt I had the chance to get everything I needed to across.", "Interview Questions": "all experience based questions"}, {"date": "13 Mar 2015", "title": "Unspecified Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 6 weeks. I interviewed at British Red Cross in Nov 2014", "Interview Descriptions": "Most of the staff appeared to be relaxed at the time I had a good impression of the company at the time. It was a relaxing atmosphere. Interview seemed like a standard, competency based interview. Unfortunately some companies don't get back to you, even after an interview. I felt that this company would be different, based on their values and what they do. No response even though I was told would hear back from someone by a certain time. Since they weren't courteous enough to adhere to what they told me, it certainly changed my impression of the company, especially since I took time off to attend.", "Interview Questions": "Why do you want to work for British Red Cross?"}, {"date": "13 Sept 2017", "title": "Refugee Support Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Red Cross (London, England) in Apr 2014", "Interview Descriptions": "An online application followed by an interview with two members of staff who were very nice. They asked competency based questions and scenario based questions. They want to know if you have enough common sense. No tricky questions.", "Interview Questions": "What would you do if a refugee called and wanted advice but you couldn't give it? Who would you contact?"}, {"date": "29 Aug 2015", "title": "Care In Home Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Red Cross (Gloucester, England) in Dec 2013", "Interview Descriptions": "I applied via their website. I got an email a week after, followed shortly by an interview. The interview was very straight forward. One : One interview with the classic questions", "Interview Questions": "Why do I want to this job?\r\nWhat are my related experiences?"}, {"date": "1 Nov 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Red Cross (Edinburgh, Scotland) in Mar 2012", "Interview Descriptions": "Straightforward, very friendly. I was a volunteer at the Red Cross, so I was already familiar with the people conducting the interview. After the general questions, which included a question on personal values and other volunteering experience, there was a skills portion where I had to use Word and Excel. I think they have a big staff turnaround, so when I was there they were looking for someone they could keep around and train for the Admin team.", "Interview Questions": "How compatible are your values with the Red Cross?"}, {"date": "2 Mar 2016", "title": "Youth Leadership Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at British Red Cross in Feb 2012", "Interview Descriptions": "Process took a couple of months. Initial phone interview, followed by an assessment centre with 20 applicants, eventually 12 were offered positions. Assessment centre included various exercises including multiple group exercises. Efficient, well organised process. Assessment centre took place in Manchester over the course of half a day.", "Interview Questions": "Why do you want to be a part of the YLT?\r\nWhat can you bring to the team?"}, {"date": "8 Jan 2015", "title": "Regional Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Red Cross in Oct 2011", "Interview Descriptions": "standard competency based question along with a required presentation piece (15mins) around the expectation of a Regional Manager. This was conducted by two members of the senior management team and a member of HR.", "Interview Questions": "Explain how you would overcome some of the major issues (provided example) within this role?"}], [{"date": "9 Nov 2009", "title": "Shop Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at British Red Cross in Apr 2009", "Interview Descriptions": "There were three interviewers: the area manager, a reserve manager, and the assistant manager for the shop where I'd applied to manage. The area manager asked 3 or 4 questions, then the other two asked a couple of questions each. The area manager then spoke a bit about the shop and the role, and what would be expected. They then asked if there were any questions I had.\r\n\r\nOverall, the questions were fairly straight forward. How would you increase sales? What would you do if your store was suffering losses to make up the deficit? It is a normal working day, tell me how you would run the shop? What things would you do?\r\n\r\nIt was a fairly relaxed atmosphere, and they were all very friendly.", "Interview Questions": "What would you do if a volunteer wasn't performing?"}]]