[[{"date": "4 Dec 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Integral Care", "Interview Descriptions": "had a video call with two employees where they asked me several questions about mental health, why i was interested, and explained what the position entailed, which was honestly alot", "Interview Questions": "why i was interested and why mental health was important"}, {"date": "12 Sept 2022", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Integral Care (Austin, TX) in Jul 2022", "Interview Descriptions": "The interview process was simple and the individuals I interviewed with were very kind and engaging. The interviewers were genuinely interested in getting to know me and keep in touch with me continuously.  ", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "13 Apr 2022", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Integral Care", "Interview Descriptions": "Virtual interview. Facilitator began by going through the role and gave incredible detail about what work would be expected and what the position is currently working on. Second half was your typical interview questions and it was very conversational. I never once felt any pressure or \"forced\" responses. Overall left feeling very happy with the entire interaction.", "Interview Questions": "(Questions were mostly job specific and situational)\r\nQ: How would you manage a task given to you that is out of your scope of knowledge/job description? "}, {"date": "30 Aug 2021", "title": "QUALIFIED MENTAL HEALTH PROFESSIONAL Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Integral Care (Austin, TX) in Aug 2021", "Interview Descriptions": "The interview process was scheduled quickly. The interviewer communicated promptly through email and/ or text message. My interview lasted about an hour and half. The first part of the interview she went over the job duties and the duties of MCOT in general. The remaining portion was dedicated to answering three pages of interview questions. I believe it would have been a shorter interview if my interviewer didn't have to continue to answer her phone during the interview. I took this more as a reflection of the agency rather than the person interviewing me.", "Interview Questions": "What are some things you would assess a child for?"}, {"date": "19 Oct 2020", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Integral Care", "Interview Descriptions": "First interview was with just the Director of L&D dept. The second interview was with the entire L&D dept. which at this time was 3 people. The first interview was standard question and answer and for the second interview I had to prepare and give presentation in front of the entire department and then they'd ask me questions.", "Interview Questions": "How would you behave if you'd be leading a workshop and you'd have one participant who'd disrupt you all the time and ask questions or make comments at times when you're amidst of your training? What would you do?"}, {"date": "15 Feb 2018", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Integral Care in Feb 2018", "Interview Descriptions": "They called me and conducted a mini-interview.  They asked me why I wanted to work for them and what questions I had about the position.  The lady shared why she had chosen to work for this company, which was personable and good to know.", "Interview Questions": "N/A"}, {"date": "4 Mar 2021", "title": "IDD Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Integral Care (Austin, TX) in Oct 2017", "Interview Descriptions": "It was a panel interview across three people. They took turns asking questions and the interview was relatively short. They gave an offer very quickly after the interview process. There was never a second interview.", "Interview Questions": "What my previous work experience was. How I respond to conflict. My strengths and type of time management. "}, {"date": "5 Feb 2021", "title": "Rehabilitation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Integral Care (Austin, TX) in Jul 2017", "Interview Descriptions": "I was contacted for a phone call with HR, then scheduled for an  in-person interview with the program manager. I only had one in-person interview and then had a phone call with the program manager where I was offered the position.", "Interview Questions": "Lots of situational questions related to case management scenarios."}, {"date": "7 Apr 2017", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Integral Care (Austin, TX) in Dec 2016", "Interview Descriptions": "I was given the questions upon arrival and had 15 minutes to review the questions and prepare my answers. This was really helpful. There was no awkwardness and the interview flowed well.", "Interview Questions": "They asked about a time when I was challenged and what I would do to overcome challenges? "}, {"date": "1 Oct 2015", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Integral Care", "Interview Descriptions": "It was simple.  I had two interviews one with my manager and one with the head of the department.  Very informal standard counseling questions. In general, it was one of the easiest interviews I've had.  The hardest part about the interview was getting through the screening process. In general, you need to have quite a bit of experience or know someone.", "Interview Questions": "Have you dealt with difficult cases before? what&#039;s you experience with addiction?"}], [{"date": "29 Dec 2014", "title": "Qualified Mental Heath Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Integral Care", "Interview Descriptions": "Rn referred to DON by MD.  Intro to Program Director, pleasant conversation, discussion of my pertinent experience.  Secondary introduction with description of services provided and on-site visit.    Extensive orientation including cultural sensitivity, PMAB, Safety & Vehicle Use.", "Interview Questions": "knowledge of clients."}, {"date": "10 Apr 2010", "title": "Behavior Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Integral Care (Austin, TX) in Jul 2008", "Interview Descriptions": "I applied online and received a follow up call for a personal interview on site. A detailed background check and reference check took place before an offer was made. A drug test had to be passed and presentation of a valid driver's license, auto insurance, and social security card was necessary as well before beginning work.", "Interview Questions": "What do you do off the clock in order to take care of yourself and alleviate stress?"}]]