[[{"date": "6 Apr 2023", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Billings Clinic", "Interview Descriptions": "Phone interview with clinical coordinator then in person group interview with department. Typical interview questions asked. Option to ask questions about work and department given. All questions about pay or benefits deferred to HR.", "Interview Questions": "Tell us about a time when you had to advocate for a patient."}, {"date": "27 Apr 2022", "title": "RN for Intermediate Care Unit Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Billings Clinic", "Interview Descriptions": "Had a fabulous recruiter and the interview was not an intimidating one. Both the educator and manager of unit were present for interview. \nI was excited about the job, but the pay came in low at 31.5 with 7 years experience : ( \nNurses need to start negating higher pay nationwide. This is a hard job & shouldn’t be undervalued! On that basis, I declined.", "Interview Questions": "Asked  me to give an example of a medically difficult patient. What was the case scenario & how I navigated it."}, {"date": "10 Nov 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Billings Clinic in Nov 2021", "Interview Descriptions": "It was a four person panel interview of the nursing managers of different units I could possibly be working on. Very laid back and relaxed and had more of a conversational tone to it. I was more kind of shocked by the type and lack of additional questions. Nothing to super stress about just be prepared!", "Interview Questions": "Tell me about yourself and why you wanted to become a nurse?\r\n\r\nTell me about a time you and a coworker had a disagreement and how you overcame it?\r\n\r\nWhat are you looking for in your leadership team?\r\n\r\nWhat are your 2-5 year goals? \r\n\r\nWhat were your clinical experiences like in nursing school and what did you like most about them? "}, {"date": "12 Oct 2021", "title": "Security Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Billings Clinic (Billings, MT) in Sept 2021", "Interview Descriptions": "Called by department manager and had quick interview over the phone. Set up follow up in person interview while I was in area (relocating) \n\nBrief in person informal conversation regarding the department and my background.  Shadowed lead officer for approx. 25-30 min after ward around the campus.", "Interview Questions": "Did you in your past experience have any training in patient restraint when needed and appropriate? "}, {"date": "9 Sept 2020", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Billings Clinic", "Interview Descriptions": "Lengthy with several days of interviews. Met with several groups of leaders and other providers. Had busy schedule and not much break between interviews. Overall a good process. Didn't take too long to hear about selection for the job.", "Interview Questions": "Traditional interview questions about experience and personality, fit."}, {"date": "5 Feb 2020", "title": "IT Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Billings Clinic (Billings, MT) in Nov 2019", "Interview Descriptions": "They interviewed very briefly. It was short without any Technical questions. Overall the interview process was decent. First was the phone screen then spoke with the Manager and a panel, then had an face to face panel interview.", "Interview Questions": "They asked about my experience(s)"}, {"date": "29 Aug 2018", "title": "Monitor Unit Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Billings Clinic", "Interview Descriptions": "I was early, as usual, the interviewers were on time, and very cheerful and friendly. I was taken into a room and talked with the two people giving the interview. The attmosphere was very relaxed and easy going.", "Interview Questions": "What position would you want full time or part time?"}, {"date": "10 Mar 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Billings Clinic (Billings, MT) in Mar 2016", "Interview Descriptions": "Comfortable, lead formal interview. Interviewers did not ask the standard leading questions but we were able to talk about previous experiences and jobs I had. They were flexible with scheduling my interview to a time and place convenient to me.", "Interview Questions": "What were your responsibilities at this previous place of employment?"}, {"date": "2 Mar 2016", "title": "Medicare Claims Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Billings Clinic (Billings, MT) in Oct 2015", "Interview Descriptions": "I quite enjoyed the interview process with Billings Clinic.  My future boss explained what my daily work would be in this role, showed my around the office, and gave great insight into the company.  I received one interview that probably lasted about a half hour.  Human Resources called me about three weeks later to offer me the position.", "Interview Questions": "If you could take out an ad in the New York Times, what three words would you use to describe yourself?"}, {"date": "10 Jan 2019", "title": "PAs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Billings Clinic (Billings, MT) in Jun 2015", "Interview Descriptions": "5 panel person, it was very chill. seemed overwhelming with that many people, but it turned out to be relaxing. great group of people, would recommend anyone to work there", "Interview Questions": "if i was a kitchen utensil what would it be"}], [{"date": "19 Nov 2019", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Billings Clinic (Billings, MT) in Mar 2015", "Interview Descriptions": "The process was fairly standard applying on the company website. Overall they asked standard questions. As I recall they listed the job title but didn’t provide much detail about the actual duties of the position. That was provided more during the sit down interview.", "Interview Questions": "What specifically interests you about this position?"}, {"date": "19 May 2015", "title": "Licensed Practical Nurse - Primary Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Billings Clinic (Billings, MT) in Jan 2015", "Interview Descriptions": "I found the employment opportunity at and online site and applied thru that site. I then received and confirmation email stating the my application with resume attached was received. Next I was contacted by Billings Clinic HR department to set up the initial interview with the Office Manager of the Department I applied for. I interviewed with the Office Manager first then had a second interview with select office staff (peers).", "Interview Questions": "What is your definition of team work?"}, {"date": "26 Feb 2016", "title": "Operator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Billings Clinic (Billings, MT) in Mar 2014", "Interview Descriptions": "Multi-stage, with stake holders.  In actuality, I began interviewing for the specific position two years before, when I was assigned to help this department create a new function.  We did vendor bid and evaluation, purchased equipment and actually began setting up operations.  I was stunned when I was passed over for someone with no previous involvement, fewer years of service and fewer skills.  I had no problems with personalities and an overall familiarity and good rapport with the group of interviewers", "Interview Questions": "The general stuff, why are you interested, where do you see this going, etc..."}, {"date": "7 Aug 2013", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Billings Clinic (Billings, MT) in Jan 2011", "Interview Descriptions": "interview with both local and regional personnel, application process online.", "Interview Questions": "I was presented with a difficult work situation involving conflict with another employee and had to offer a resolution"}]]