[[{"date": "7 Mar 2023", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "Phone interview then meeting others in the team. Interviews were on phone and Zoom. Then a background check which took 10 days. Very flexible process for me and it was quite smooth overall.", "Interview Questions": "In your last performance review what were two areas for improvement"}, {"date": "3 Mar 2023", "title": "Advancement Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "It was a pretty straightforward process. There were three rounds of interviews with various leads in the department. The interviews were 30 minutes each. I was asked typical questions like \"Why do you want to work here?\" and \"What are your strengths and weaknesses?\"", "Interview Questions": "N/A"}, {"date": "2 Feb 2023", "title": "Accounts Payable Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "23 Aug 2022", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "Only has one call over Teams with direct manager and manager above the direct manager. Call lasted about an hour and it was more of a conversation about their needs and what they are looking for as well as what I am looking for in the position.", "Interview Questions": "Why do you want to work for Smithsonian?"}, {"date": "4 May 2022", "title": "Retail Sales Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Smithsonian (Washington, DC) in May 2022", "Interview Descriptions": "It was pretty self-explanatory - I was selected to take a virtual interview on the Microsoft Teams app. I was asked questions about my experience and how it is relevant to the job. While I wouldn't say the questions were super generic, they weren't anything that wasn't to be expected in an interview for a retail position.", "Interview Questions": "What was your best/worst customer service experience ever?"}, {"date": "15 Feb 2022", "title": "Sales Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "Really great, superb. They were supportive throughout the process and clearly wanted you to answer the questions to the best of your ability. It was tricky but ultimately they wanted tou to do well", "Interview Questions": "Why do you want to work here "}, {"date": "8 Jan 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Smithsonian", "Interview Descriptions": "Very friendly interviewer. This was a research internship at the national air and space museum, and the interviewer was very interested in knowing what research areas I was passionate about. Also a discussion on my previous experience. Not overly technical.", "Interview Questions": "N/A"}, {"date": "17 Nov 2021", "title": "Research Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "It can take a long time to process as a federal institution, but the interview process is fairly straightforward once you do hear back. Sometimes you won't hear back for awhile and then you have an interview scheduled, so be ready to be flexible.", "Interview Questions": "What skills and experience do you bring to this position"}, {"date": "9 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Smithsonian (Washington, DC) in Oct 2021", "Interview Descriptions": "Had a single video interview with about 15 questions asked (around 4 of them were technical questions). Interviewer was very nice and helped me out when I didn't know the answer to one of the technical questions.", "Interview Questions": "Tell me about a time you had to manage a workplace conflict."}, {"date": "17 Sept 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "It was a good inteview overall. There were clear objectives, a clear timeline and the expectations were very clear from the beginning. They communicated the further steps in a timely manner.", "Interview Questions": "I don't remember, it was a long time ago."}], [{"date": "8 Sept 2021", "title": "Production Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "The process was quick and straightforward. There were friendly interviewers who wanted to learn about my career aspirations. I never heard back from them and after reaching out a few times, assumed they went with another candidate.", "Interview Questions": "What are your career goals?"}, {"date": "29 Aug 2021", "title": "Parking Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "In-person job interview. Typically a one-on-one interview between the applicant and a hiring manager. Series of questions are asked. They want to see if you’re a fit for the job.", "Interview Questions": "When is a time you were in a stressful situation? How did you deal with it?"}, {"date": "19 Aug 2021", "title": "Archives Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "Submitted application online. Received a phone interview with general questions on why I wanted the internship and how many hours I needed. Received an email saying I got the internship.", "Interview Questions": "Why do you want this internship?"}, {"date": "4 Aug 2021", "title": "Air and Space Video Production Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Smithsonian", "Interview Descriptions": "The interview was with my two supervisors in the video production department. It was around 20 minutes and on Zoom. They were accommodating with interview times and scheduling as well.", "Interview Questions": "One thing they asked me was how I would set up/go about filming an interview with someone. "}, {"date": "1 Jul 2021", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smithsonian", "Interview Descriptions": "I had a very positive initial interview, where I met all qualifications, had a personal and educational  connection to the work, and was told by the interviewer that I’d hear back for the next step in a couple weeks. I sent a thank you note and heard nothing back, and even months later (and a second note just to see if they made a decision) I never heard back from them again. I don’t appreciate that level of disrespect for candidates.", "Interview Questions": "What is your favorite piece in the museum? "}, {"date": "15 Nov 2021", "title": "Human Resources Liaison Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Smithsonian in Jun 2021", "Interview Descriptions": "After applying via Indeed, I was contacted via email approx. 1 week 1/2 later to submit my answers to an in-depth 4-part writing evaluation and it was stated from this step, that once reviewed this will be used for candidates  for the next phase of the process which was video interviews via Zoom or MS Teams. I submitted my questionnaire responses within 2 days and then I followed up via email a wk later and didn’t hear back. Very off-putting process. Please have the decency to respond back to candidates after putting them through such a tedious process. Even if sending a simple rejection. Communication is everything!\n\n\nThis was for Smithsonian’s Museum of Asian Art.", "Interview Questions": "No intertiew, only writing evaluation (Samples and questionnaire responses)."}, {"date": "24 Jun 2021", "title": "Videographer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Smithsonian in Apr 2021", "Interview Descriptions": "Had an initial phone interview with someone in the department. They told me that I would hear from them around the end of the month regarding the next steps or status, but I never heard back.", "Interview Questions": "How do you respond to difficult situations?"}, {"date": "12 Mar 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "it was easy but i enjoyed all the questions that was asked about me. i took a math test and had a couple personal life questions. after that, I waited til everything was finalized for me to leave and when I'd be contacted. i would do the interview all over again.", "Interview Questions": "what's a weakness of yours?"}, {"date": "17 Feb 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "Straightforward interview process.\r\nReceived a call directly from the department I applied to for an interview after submitting application online. \r\nIt took about two weeks to hear back the result.", "Interview Questions": "Tell me about yourself\r\nWhy Smithsonian \r\n"}, {"date": "6 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "Applied over email, received a response within a week. Had one interview over zoom with direct manager. Really quick turn around time for decision, average interview questions relevant for the position", "Interview Questions": "Are you interested in and willing to work in the office and in the field?"}], [{"date": "5 Feb 2021", "title": "Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "friendly, informative, detailed, hosted by two people,\ninitially looked controlling, but, if fact was the opposite, very relaxed. asked background questions about myself as well as a brief history of company", "Interview Questions": "why do i want to work there"}, {"date": "15 Dec 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Smithsonian in Dec 2020", "Interview Descriptions": "I was emailed by a person in the department I applied for about three weeks after my application was submitted. He scheduled an interview with me the week of the email and it was over the phone. I was asked about why I wanted the position, what I wanted to learn from the experience, and what I had done in college. It was a relaxed interview that gave me the opportunity to talk about my interests and experiences and I felt like that was what they wanted and encouraged.", "Interview Questions": "Why do you want to work here? What do you hope to learn from this experience?"}, {"date": "21 Oct 2020", "title": "Retail Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "It was a group interview and it did take a couple of weeks to get a response as it’s a government job and you have to pass clearance but, it was well worth it. I enjoyed every minute working for this company", "Interview Questions": "What were your job duties at your previous job? "}, {"date": "20 Sept 2020", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "The interview process was smooth and painless. I felt fast-tracked through the process as I was joining at an odd time. No complaints here. Yup yup yup.  Oh mama, Sure does.", "Interview Questions": "Why do you want to work here?"}, {"date": "31 Aug 2020", "title": "REU Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "It was very simple, they asked standard questions. They were very positive and nice when interviewing me. I think that to stand out you should have deep understanding of what type of research you are going to be doing for them.", "Interview Questions": "What background do you have?"}, {"date": "3 Apr 2020", "title": "Robert F Smith Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Smithsonian", "Interview Descriptions": "It was a phone interview with three other people and myself. Questions were basic job interview question. All but one of the interviewers actually seemed interested in my responses. The question themselves aren't difficult but the interview just seemed awkward because once you answered they just moved on...never acknowledging what you had previously said.", "Interview Questions": "What is your communication style?"}, {"date": "22 Jun 2022", "title": "Summer Internship Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smithsonian in Apr 2020", "Interview Descriptions": "The process started with a 15 minute phone interview. They asked really straight and to the point questions. Honestly was a little awkward because there wasn't a lot of conversation.", "Interview Questions": "Describe a time when you explained something complicated to someone"}, {"date": "20 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Smithsonian in Dec 2019", "Interview Descriptions": "Interview was a brief 30 minute phone call. Research the curatorial staff before you interview thoroughly. She was very impressed by my knowledge of the institution and its staff.  Interview felt like a conversation and I found out I was accepted in a week.", "Interview Questions": "How does interning for the Smithsonian align with your future career goals?"}, {"date": "1 Jul 2019", "title": "Website Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "First interview was over the phone and very organized, and the second was a more in-depth, multi-person interview at the Smithsonian offices. I met with four different higher-ups and it was clear that they had spent a lot of time going over my cover letter and resume, asking me interesting questions about my previous work experience and how I could transition that to their open position.", "Interview Questions": "What is one thing you think could be improved on our website in terms of efficiency?\r\n"}, {"date": "28 Apr 2019", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Smithsonian (Washington, DC)", "Interview Descriptions": "They told me that they were going to ask me about my answers from the job application.  They went question for question from the application and asked me to explain what experiences related to my answers.  The way to prepare for that interview is to go over your answers and make sure that you can provide an example for every question asked.", "Interview Questions": "Provide an example of why you answered this question like this."}], [{"date": "30 Jul 2020", "title": "Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC) in Apr 2019", "Interview Descriptions": "I submitted my application online on Smithsonian Application System. After two to three weeks, I received an interview invitation from my later supervisor. And then I did the interview at Smithsonian Office with him.", "Interview Questions": "Tell me about your self. Which courses did you take at school? Can you use adobe softwares proficiently?"}, {"date": "14 Dec 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian", "Interview Descriptions": "I submitted my application to their online application system and was contacted by the hiring manager shortly after. The interview went fairly quickly, and wasn’t too hard or technical. It lasted for about 20 minutes and half the time was spent learning about the roles you would be responsible for as an intern.", "Interview Questions": "How do you manage a high workload?"}, {"date": "9 Jan 2019", "title": "Cash Accountant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Smithsonian (Herndon, VA) in Sept 2018", "Interview Descriptions": "The company conducts panel interviews and don't delve into skills. It's more of a personality test to see if you can conform to their archaic practices. They will tell you they want you on board but will not disclose all positions are contract to hire.", "Interview Questions": "Do you know the history of the Smithsonian?"}, {"date": "27 Aug 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "I applied first, and I passed with my resume and pdf portfolio. After that, I  did in person interview with personal portfolio. I interviewed with two people from the work place and it took around 30mins", "Interview Questions": "What is your strength?"}, {"date": "10 Aug 2018", "title": "Retail Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC)", "Interview Descriptions": "Group interview with about 5-6 other applicants. They go down the line and ask you questions. The questions are easy. They have about 4 supervisors asking the questions. Only hard part is coming up with new answer as all the good answers are used up if you don't answer first.", "Interview Questions": "Describe a bad customer experience. Describe a time you received bad customer service, and how did it make you feel??"}, {"date": "29 Oct 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Smithsonian in Aug 2018", "Interview Descriptions": "I applied online marketing and fundraising intern at Smithsonian. It was a phone interview and there are just a couple of questions which are easy to answer regarding university experiences and my interests of Smithsonian.", "Interview Questions": "What did you do during university?"}, {"date": "23 May 2018", "title": "Parking Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "The process was easy. The manager called me in after the completion of the online application. Following this I was interviewed in the office.... lastly I took a test and passed.", "Interview Questions": "How to diffuse an angry customer?"}, {"date": "28 Oct 2022", "title": "Assistant Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Smithsonian (Washington, DC) in May 2018", "Interview Descriptions": "The interviewee posed straight forward questions. It was generally a nice flowing conversation. Nothing to be nervous about if you possess qualification they are looking for. Be prepared to discuss previous work related scenarios.", "Interview Questions": "experience related to the position and strengths vs. weaknesses"}, {"date": "21 Oct 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Smithsonian (Los Angeles, CA) in Apr 2018", "Interview Descriptions": "I applied through my school program and got phone interview. The interview is not too difficult and I got an offer 2 months later. The process is different with others", "Interview Questions": "Behavior questions"}, {"date": "8 Apr 2019", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Smithsonian in Apr 2018", "Interview Descriptions": "I applied on their application portal and was contacted for a phone interview a couple of weeks later. The phone interview was pretty straightforward and the questions were mostly just about my work experience and what I wished to learn from this internship.", "Interview Questions": "How do you manage your time and make sure everything gets done?"}], [{"date": "24 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "Phone call interview lasted for less than 30 minutes. The interviewer only asked one question, then introduced Smithsonian and the position to me. The whole process was easy and casual.", "Interview Questions": "Why Smithsonian?"}, {"date": "27 Jan 2018", "title": "Explainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Smithsonian (Chantilly, VA)", "Interview Descriptions": "In-person interview. Casual and fun. Prepared a science level in advance, about at a middle school level, and shared it. Make sure to show that you're not only knowledgable, but also sociable and likable as a person.", "Interview Questions": "How does a plane take off initially?"}, {"date": "27 Jun 2022", "title": "Digital Archive Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Smithsonian (Washington, DC) in Jan 2018", "Interview Descriptions": "The interview process was very smooth, though slow at times. They ask questions about your background & skills with different Adobe products. They are primarily interested in Photoshop,  though asked about all of them. Overall, everyone was very nice.", "Interview Questions": "They asked about my familiarity with Adobe products."}, {"date": "7 Feb 2019", "title": "Retail Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Smithsonian (Washington, DC) in Jan 2018", "Interview Descriptions": "It was a panel interview with three interviewers, and four candidates. Since the Smithsonian recruits for many stores throughout their museums, it makes sense they would want to interview multiple candidates simultaneously.", "Interview Questions": "What was the worst customer service experience you ever had, and why?"}, {"date": "15 Sept 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC) in Jan 2017", "Interview Descriptions": "The interview was friendly and laid-back. They calmed my nerves. The employees clearly love their job and it showed. It went so well and, luckily, I got the position. It's a once in a lifetime opportunity, really.", "Interview Questions": "What is your greatest weakness?"}, {"date": "12 Dec 2019", "title": "Explainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Smithsonian in Sept 2016", "Interview Descriptions": "I was asked to come in for an in-person interview. I was interviewed by a Lead Explainer and the head of the Explainer Program. I was asked to prepare a quick, 5-minute demonstration on any topic that I'd like and present it at the interview, as well as answer standard behavioral questions.", "Interview Questions": "Explain how an airplane flies"}, {"date": "2 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian", "Interview Descriptions": "I applied online through SOLAA. Two months after submitting the application, I received a phone call and was asked if I was still interested in the position. A few days later, I was offered the internship and I accepted.", "Interview Questions": "Are you still interested in the position?"}, {"date": "3 Oct 2016", "title": "Advancement Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC) in Aug 2016", "Interview Descriptions": "I received an email for a phone interview which went well. Afterwards I was invited for an in person interview which was very laid back and only lasted about 35 minutes. No real difficult questions, just a get to know you conversation. I did not hear back for 2 weeks and I emailed the secretary who stated they were still in the hiring process. I never heard back from them after that email.", "Interview Questions": "What is your experience with sharepoint?"}, {"date": "21 Dec 2017", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Smithsonian in Apr 2016", "Interview Descriptions": "Lengthy application process and portfolio collection. The demonstrative portfolio served as the prescreening interviews. Sell yourself well, include detailed work samples, and explain why YOU are the best candidate.", "Interview Questions": "Explain your experience with the C3 standards in the classroom. "}, {"date": "22 Jul 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian in Mar 2016", "Interview Descriptions": "It was an informal interview over the phone with  two employees at NMAH. Very friendly and generally wanted to get to know you. The entire interview took around 30 minutes. I heard back within 2 weeks of the interview offering me the internship.", "Interview Questions": "The overall questions weren't difficult to answer. They asked me about me resume, classes I was taking, and my digitization and research experience. "}], [{"date": "18 Dec 2020", "title": "Chief of Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC) in Jan 2016", "Interview Descriptions": "Formal process with specific questions and had to do a presentation on what I would accomplish in my first 90 days.  Specific subjects were also specified such as my knowledge of sustainability initiatives, etc.", "Interview Questions": "What was my most significant career accomplishment to date?"}, {"date": "22 Oct 2018", "title": "Education Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smithsonian in Jan 2016", "Interview Descriptions": "One phone interview. And then 1 week turnaround time, which was good. Overall process was easy and the people were nice to talk to.  asked behavioral questions and such", "Interview Questions": "Why are you interested in anthropology "}, {"date": "18 Dec 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC)", "Interview Descriptions": "There was a 30 minute phone interview followed by a panel interview and then one where I gave a presentation. So two separate in-person interviews and then there was a final Skype interview with the management team. So four interviews in total before receiving an offer for the position. Then they needed to do background checks. So it was a lengthy process.", "Interview Questions": "What makes you qualified for this job?"}, {"date": "3 May 2016", "title": "Digital Media and Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Smithsonian (Washington, DC) in Oct 2015", "Interview Descriptions": "Incredibly fast! I applied the day of the deadline, got a call the next day and on the same day as my call I got the internship! I think it has to do with the department at SI that was hiring me, as I heard it can oftentimes be a much slower process. They emailed me the next day, we set up a phone call for the following day, and I heard back I got the internship within 3 hours of my interview.", "Interview Questions": "Why do you want to work for Smithsonian? How do your past internships mesh with the requirements of this job? Can you come in for full days?"}, {"date": "3 Nov 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Smithsonian in Oct 2015", "Interview Descriptions": "Contacted me via email for a 10 to 15 minute phone interview to tell me more about the job, ask about my experiences and screen me. Started out with simple chatting where she got to know me a little and it progressed to questions more typical of a normal interview that specifically related to the job. Very friendly interviewer made it relatively low stress.", "Interview Questions": "Do you have any experience writing scientific/technical papers? What was the hardest thing about working in (last job)? Do you have experience with cross cultural encounters? Have you ever been in charge of planning an event?"}, {"date": "31 May 2015", "title": "Visitor ServicesAt the Air and Space Museum Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smithsonian", "Interview Descriptions": "I was contacted for a phone interview because I was not in DC at the time. I was interviewed by two of the coordinators who were very friendly. I cannot remember how long it took me to hear back (for interview or their decision) but I emailed them asking when I would hear back since I was offered another internship else where. One of the interviewers said I would hear soon and I received the call the next day.", "Interview Questions": "Why I wanted to intern for the museum. "}, {"date": "10 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Smithsonian", "Interview Descriptions": "I submitted an application through SOLAA, which is the Smithsonian's online application management site. The application asked for two recs, a resume, and a cover letter. I got an email about a week later scheduling a phone interview; we then had a phone interview. The interview was pretty easy, got the offer essentially on the spot.", "Interview Questions": "What's your interest in the internship?"}, {"date": "3 Mar 2016", "title": "Training Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Smithsonian (Washington, DC) in Apr 2015", "Interview Descriptions": "Honestly, the interview questions did not reflect the work that I currently do. It is not the interviewers' faults. They were not L&D people. They represented possible stakeholders. But, to be honest, I have not interacted with any of them on a meaningful level since my interview.", "Interview Questions": "N/A"}, {"date": "30 Jul 2018", "title": "Museum Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smithsonian in Mar 2015", "Interview Descriptions": "short, 15 minute interview with basic questions that are common for all interviews (just Google) and a required five to ten minute presentation on scientific principles at the end of the interview", "Interview Questions": "Who is your role model?"}, {"date": "14 Jan 2016", "title": "OFEO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Smithsonian (Washington, DC) in Mar 2015", "Interview Descriptions": "For the applications for the various Smithsonian internship programs, I wrote essays highlighting why I was a goo fit for the programs that they were offering. They want the experience to benefit me and them in the long run. For the interview there was a five person panel which though intimidating gave me a good idea of the people and environment there.", "Interview Questions": "What do you want this internship to do for you? What do you hope to learn from this internship? Have you handled artwork and artifacts before? What would you add to the Smithsonian through this internship?"}], [{"date": "14 Jul 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC) in Mar 2015", "Interview Descriptions": "I applied online and got a phone interview, which was all that was required for the job. Different departments might have different hiring, but it's pretty easy for an intern.", "Interview Questions": "Biggest challenge you've ever experienced?"}, {"date": "15 Feb 2016", "title": "Content Development & Strategy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Smithsonian (Washington, DC) in Feb 2015", "Interview Descriptions": "No interview for this internship position. Positions offered based on qualifications. Office is always looking help for there is always work to be done. Supervisor and team are very helpful and enthusiastic about their work and its purpose. Slower-paced work environment.", "Interview Questions": "Why"}, {"date": "6 Jan 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Smithsonian", "Interview Descriptions": "Interview was day-long process. Some staff were significantly tardy. The room for the interview was in disrepair. The questioning was standard, nothing unique. Although I interviewed all day, my direct reports were not included on the schedule.", "Interview Questions": "How do you handle complicating approval processes? "}, {"date": "10 Mar 2015", "title": "Program Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Smithsonian (Washington, DC) in Jan 2015", "Interview Descriptions": "They contacted in 2-3 weeks .They took the interview & said they are interested &  asked for written  documents & technical paper. Then they did not replied back for months and when I did a follow up came to know they want to interview more people and reopened the position. Then after  4 months they said they are again interested and wanted me to come for second round of interview .In the second interview they said we downgraded the position for lower pay scale let us know if you are still interested. The salary they offered was less then what I am earning right now . so I declined the offer .", "Interview Questions": "We have downgraded the position grade Are you still interested in joining the Company ?"}, {"date": "27 Jul 2015", "title": "Orchid Collection Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian in Dec 2014", "Interview Descriptions": "Phone call lasted about an hour. Interviewer was informal and friendly, making it easy to share work experiences and get a feel for the position. Also, they clearly communicated the need for the position .", "Interview Questions": "Tell me what experiences lend you to apply for this position."}, {"date": "30 Sept 2014", "title": "Retail Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Smithsonian", "Interview Descriptions": "I submitted an application and was contacted within a day. An interview was scheduled for the same week. The interview was a standard form package of about three pages, and the questions were all your standard \"What's a time when you've gone above and beyond for a job?\" and \"What makes you a team player?\" They were so general that I actually had a little bit of difficulty thinking of an answer that didn't sound phony or naive. After those questions was a very basic math test to make sure you can give a customer change correctly.", "Interview Questions": "\"If you suspected someone of shoplifting, what would you do?\" This one was hard because the procedure really varies from employer to employer, but your basic \"Watch the customer, then notify a supervisor and security\" pretty much covers it. Again, all the questions seemed very general and cutesy to me, so they were all difficult to answer without coming across as obnoxious."}, {"date": "27 May 2014", "title": "Museum Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Smithsonian (Washington, DC)", "Interview Descriptions": "Initial contact and interview were clear but informal. The person conducting the interview was detailed about the expectations of when, where, and who of the interview including the dress code (which was informal). A single in person interview was conducted with introductions (after the interview) to other members of the work unit.", "Interview Questions": "The interviewer asked technical questions directly related to the mechanics of doing the actual job. Although potentially difficult, these are questions that a person interviewing for this position would be comfortable answering. In fact I found the interview easy and relatively low stress (if such a thing is possible)."}, {"date": "13 Mar 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC)", "Interview Descriptions": "This was fairly simple. So long as you had the appropriate qualifications and a work ethic it seemed that they could accept you. The questions were very much along the lines of where you want to go in life. The interview was over the phone and was not stressful at all. As for after the acceptance there was a simple background check and everything else was fairly straight forward.", "Interview Questions": "I wouldn't say that there was anything truly unexpected."}, {"date": "7 Mar 2014", "title": "Editorial Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Smithsonian (Washington, DC) in Feb 2014", "Interview Descriptions": "Sent application via email in late January, interview happened in early February; didn't find out about company decision until early March. \r\n\r\nWas told repeatedly that the position was very competitive, many, many applicants received. \r\n\r\nEmailed first for a very brief phone interview basically confirming my interest and asking for an in-person interview. Came in for the in-person interview and spoke with two editors. Questions were more casual, personal, not the usual job interview questions. Shown around the office, asked about my background, etc. \r\n\r\nI received a personal phone call when I wasn't selected for the position; the interviewer actually apologized and expressed her regret that she couldn't hire me, which I appreciated, even if I was still deeply disappointed. Did not, however, receive feedback as to WHY I wasn't hired.", "Interview Questions": "\"If you weren't hired here, what job would you be working?\""}, {"date": "4 May 2015", "title": "Greeter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smithsonian (Washington, DC) in Feb 2014", "Interview Descriptions": "The interview process was simple and easy and very helpful to get the job. They were very simple and easy and i ended up getting the job on the spot which made life very easy and i was very thankful for the opportunity and yeah and yeah and yeah and yeah", "Interview Questions": "N/A"}], [{"date": "11 Oct 2013", "title": "Sergeant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Smithsonian (New York, NY)", "Interview Descriptions": "I applied online through USAjobs. I received notice that I got the interview. I went in front of a panel of interviewers whom each asked different questions. The interview lasted 45 minutes to an hour. The panel consisted of one security manager, one higher level supervisor, and the building manager.", "Interview Questions": "N/A"}, {"date": "13 Feb 2017", "title": "Volunteer Guest Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Smithsonian (Washington, DC) in Sept 2013", "Interview Descriptions": "Interview was relaxed for the position. Spoke with the head of front desk and their supervisor for about 10 minutes about my background and how I'd fit with the schedule there. Also discussed certain situations and how'd I'd deal with them but none were out of the blue or needed preparation. Very straightforward. Started orientation which was a full day on a weekend about 2 weeks after interview.", "Interview Questions": "How would I deal with an upset guest?"}, {"date": "31 Dec 2013", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Smithsonian in Aug 2013", "Interview Descriptions": "I received a very timely response requesting to meet for an interview. The support, management, and executive staff were all extremely friendly and personable. I met with the hiring director and executive director at once - this was very efficient for them and for me. During our interview, I really felt they'd taken the time out to look at my experience and skill set individually to consider how it would complement the other members of the team and their new goals. The interview felt very much like a team strategy meeting and less like a judge's panel; I found this to be a great way of getting a good send of how we could all work together. This was one of the better interviews I've had - no rapid-fire, cookie-cutter questions were asked in order to check them off a template.", "Interview Questions": "What do you think will be the most difficult challenge to taking on this higher role - the aspect of the job which you have the least amount of experience in and the highest learning curve to achieve the desired results?"}, {"date": "28 Mar 2017", "title": "Advancement Specialist (Executive Assistant to CDO) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Smithsonian (Washington, DC) in Jul 2013", "Interview Descriptions": "The hiring process can be long due to the background and security clearance check. The interview process was not bad at all. When you get the email from Security department make sure you read the entire email and follow the instructions.  Make sure you have a government-issued ID.", "Interview Questions": "What are your strengths as an Executive Assistant?"}, {"date": "21 May 2013", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "First round selection, the resume and coverletter;\r\nthen, if you pass, you would obtain the interview opportunity;\r\nand the interview would be through skype or telephone.\r\nOnly one interview is needed.", "Interview Questions": "several questions about your weakness and strength."}, {"date": "26 Oct 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Smithsonian in Mar 2013", "Interview Descriptions": "After applying online for an internship, indicating preferred departments/thematic areas, I was emailed by the director of my top-choice program and, as I was living out of state for college, arranged an interview by phone. The interview was very straight forward and less an assessment of my skills and preparedness and more a conversation about my interests and priorities to see if they corresponded well with current museum projects.", "Interview Questions": "What academic background to do you have with immigration?"}, {"date": "22 Feb 2013", "title": "E-Marketing Intern Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Smithsonian", "Interview Descriptions": "The interview was brief as I was on the train when I received the call. For the internship, no previous experience was required, just a basic understanding of what marketing entails and enthusiasm and passion for hard work is needed. Mastery of english and problem solving skills is a bonus.", "Interview Questions": "N/A"}, {"date": "31 Jan 2013", "title": "Development Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Smithsonian", "Interview Descriptions": "I had a phone interview with the Development office, and there are two people in charge of the office, a male and female. They were both very friendly and professional. The female lady has an interest in Renaissance art. During the interview, they were focused on asking about the background and interest in this position. Very professional and knowledgeable about nonprofit fundraising.", "Interview Questions": "What would you like to bring to this position?"}, {"date": "18 May 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smithsonian (Washington, DC) in Jan 2013", "Interview Descriptions": "The first step was a phone interview with standard interview questions, followed by an in-person interview consisting of one-on-one interviews, a group interview, and a skills test assessing verbal, quantitative, and technical skills. After the in-person interview, the supervisor asked for and checked in with references before making an offer.", "Interview Questions": "Which publications do you read regularly?"}, {"date": "25 Aug 2017", "title": "Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Smithsonian (New York, NY) in Jan 2013", "Interview Descriptions": "Spoke to department head who needed assistance. Discussed work required and I made proposal on how I would handle it. Contract was offered to me within a few weeks after the interview.", "Interview Questions": "Will I be able to accomplish work needed within a certain time frame?"}], [{"date": "12 Feb 2013", "title": "New Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Smithsonian (Washington, DC) in Jan 2012", "Interview Descriptions": "Lesson learned: Be assertive.\r\n\r\nInitially, I received an email stating that I did not quality for the position, but since I was close to finishing college, and getting rejected left and right at the time, I really wanted to know why I did not qualify. Someone from the Center called me a few days later, and told me that they realized that they would need more than one candidate for the position, and that if I was still interested, I should come in for an interview. And I did! The interview was conducted by 4 people, whom were all very friendly, and easy to talk to. I think the biggest thing is to be confident, even if you may not have the best answer, be as confident as you can be because it can make up for other things.\r\n\r\nThey asked about all my work experience, had written all over a copy of my resume ready to be asked, they asked about my different work situations, how I handled school and work, etc.\r\n\r\nIn the end, no offer, but they did say that they loved talking to me and that I was an excellent candidate.", "Interview Questions": "What is your greatest weakness? This was expected, but I hate answering this question. And I don't think I gave the best reply. "}, {"date": "6 Jan 2016", "title": "Museum Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Smithsonian (Washington, DC) in Jan 2012", "Interview Descriptions": "Interview came at the tail end of a 6 week internship and was conducted by my supervisor. Very informal - conducted in supervisors office over coffee. The decision to hire me had already been made it seemed. This seems to be the way with a lot of contractual work - take on interns after on-the-job vetting.", "Interview Questions": "How would you complete the project that you will be working on?"}, {"date": "1 Mar 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Smithsonian in May 2011", "Interview Descriptions": "a series of phone interviews", "Interview Questions": "tell me about yourself"}, {"date": "2 Oct 2015", "title": "Explainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Smithsonian (Washington, DC) in Apr 2011", "Interview Descriptions": "Found an opening online on their website, lopked at description of job, was interested at the position and i sent in a transcript and an application, went in for interview, sat down in bosses office, had the interview and we talked about how i would fit in this position and other questions, and then i was given a short tour of the place.", "Interview Questions": "How do airplanes fly?"}, {"date": "16 Aug 2013", "title": "Retail Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Smithsonian (Washington, DC) in Feb 2011", "Interview Descriptions": "I handed in my resume to one of the gift stores. The store manager contacted me for an interview for which I was accepted. They proceeded to run a background check on me. I went to get fingerprinted and get a badge. I attended an orientation class and started work.", "Interview Questions": "Generic interview questions. You should give detail about previous work experience and why you are qualified for the position. Some questions about what you do in this or that situation if it happened."}, {"date": "27 Oct 2011", "title": "Senior Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Smithsonian (Washington, DC) in Feb 2011", "Interview Descriptions": "Great experience. Senior management were kind and respectful.  The interview was full of orientation expectations and information about my specific responsibilities. I recommend working for this organization.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Apr 2014", "title": "Museum Police Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Smithsonian (New York, NY) in Nov 2010", "Interview Descriptions": "I sat before a interview panel of three people.", "Interview Questions": "The unexpected question:\r\nWhy do you have a Fire Guard License?"}, {"date": "22 Jan 2011", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 days. I interviewed at Smithsonian (Washington, DC) in Nov 2009", "Interview Descriptions": "Extensive interview process requiring four separate interviews with different people and entire team. Had to demonstrate skills live in front of entire team. Originally, they had lost my information and I had to re-send it. Entire process (from sending the resume, to them losing it, to going on four interviews, to offer) took about six weeks.", "Interview Questions": "Most questions were behavioral in nature - tell us about a time when you......"}, {"date": "26 Jul 2010", "title": "Exhibit Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Smithsonian (Washington, DC) in Jun 2009", "Interview Descriptions": "connections to person from previous work experience", "Interview Questions": "Will you get a certification for certain experience level?"}, {"date": "17 Oct 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3+ months. I interviewed at Smithsonian in Mar 2009", "Interview Descriptions": "interviewed by supervisor.", "Interview Questions": "N/A"}], [{"date": "15 Jun 2012", "title": "Museum Police Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smithsonian (Washington, DC) in Jul 2008", "Interview Descriptions": "I applied via usajobs.gov and got an e-mail 6 months later saying that my application had been received. A few weeks later, I got a call to come in for an interview. I went in for a panel review, which lasted roughly 20 minutes, most of it focused on my background, VERY little discussion of the actual job. Afterwards, I was offered the position and asked to walk to the Dept. of the Interior for a drug test.", "Interview Questions": "Have you ever been convicted of a felony?"}, {"date": "26 Sept 2009", "title": "Education Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Smithsonian in May 2008", "Interview Descriptions": "Sent resume, got a email invitation to an interview, went to the interview, references were checked, was hired.", "Interview Questions": "What is the most difficult situation you've ever faced when dealing with a group in a museum?"}]]