[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Supportive leadership", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Mar 2023", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Feel well supported and part of a team.", "cons": "Salary not competitive with hospitals in the area."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Hospital - Lazy team", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Apr 2023", "job_title": "Registrar in Houston, TX", "duration": "N/A", "pros": "Guaranteed hours; good position to get your foot in the door in the medical field on the insurance side", "cons": "Low salary for the job duties"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Nepotism at its finest. Coworkers are ILLITERATE.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 May 2022", "job_title": "Food and Nutrition Worker in Houston, TX", "duration": "N/A", "pros": "Decent pay but not enough for the verbal abuse you have to listen to and the mental abuse knowing managers prefer underperforming employees because of nepotism.", "cons": "The most disorganized and dysfunctional workplace I’ve ever worked for.\n\nIt was never investigated by any of the managers AND the CEO that the night cook is illiterate and cannot read and almost poisoned a patient that has celiac disease. Or the fact that new employees rarely last a week because of the machísimo attitudes as well as the racism against them especially if they aren’t from the same race as the perpetrators. If you wanna get away with murder, as long as the managers love you you’re set."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Lower pay, close to same stress", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Sept 2022", "job_title": "Registered Nurse in Houston, TX", "duration": "N/A", "pros": "TOH does have a nice \"family\" feel were people really do care for one another. Doctors are extremely good and nice. They own 40% of the facility, making it an overall nice place to work.", "cons": "Pay has been considerably lower than other jobs. Stress has been increasing over the past years so more and more people are looking for comparable jobs with more pay."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Respiratory", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Aug 2022", "job_title": "Respiratory Therapist in Houston, TX", "duration": "N/A", "pros": "Awesome job to work for", "cons": "N/a no cons about the job"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Fast paced but fun", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Feb 2022", "job_title": "Certified Surgical Technologist in Houston, TX", "duration": "N/A", "pros": "A very fast paced, high volume facility. Good for gaining experience or keeping yourself busy. Very little on call requirements.", "cons": "Can lead to burnout with the volume this facility does. Can also pigeon hole you into very specific surgeries."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Employee", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Dec 2021", "job_title": "Registered Nurse in Houston, TX", "duration": "N/A", "pros": "Nice hospital to work at", "cons": "Low pay for nursing staff"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Under appreciated", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Jul 2021", "job_title": "Certified Surgical Technologist (CST) in Houston, TX", "duration": "N/A", "pros": "The environment usually runs like a family. Employees that have been there for some time will help you. Free parking", "cons": "Favoritism by upper management. Over worked and under payed"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Good place to start", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Apr 2018", "job_title": "Cst in Houston, TX", "duration": "N/A", "pros": "Very friendly doctors and staff.  Usually leave work on time.  Most requests to leave early are granted.  \r\nFree parking.  \r\nFlexibility to take time off for family/school if needed.", "cons": "Lower pay.  No sick leave.  Poor communication between management and staff; micromanagement.  Favoritism.    \r\n\r\nHigh turnover.  New graduates start here for a couple of years, then transfer to a larger hospital for better pay.  Company also fires people out of the blue while telling staff they left voluntarily, upper management is not immune.  It is unsettling.\r\n\r\nEquipment is old and breaks frequently.  Computer system is also antiquated and very difficult to work with.   Recent 'upgrade' has made charting even more tedious.  Nurses spend around an hour after their cases to finish charting.\r\n\r\nBonuses have switched to a point system.  Get enough points and you can obtain a gift through their website.  Obtain points through birthdays, company anniversaries, and staff recognition.  No more cash/gift card bonuses offered.\r\n\r\nStaff asked to leave early or leave without lunch if census is low.\r\n\r\nCSPD needs a larger space area.  It is extremely cramped.  Flashing instruments for scheduled cases are common."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Great Hospital, Great Staff, Poor pay and Overworked Outdated Computer System", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Mar 2013", "job_title": "Room Server in Houston, TX", "duration": "N/A", "pros": "The Hosptial is small, which is great, easier to find your way around. The doctor and nurses and other staff members are nice, friendly, and helpful. Free parking (or free validation if your PRN;on call) Free meals in the Cafe area.", "cons": "The computer system used to commumicate to other department is super old and outdated (they are still using DOS) which caused alot of delay in  processing paperwork The pay for Food and Nutrition Workers is really low ( its a lot work in the Kitchen area) and PRN don't get any benefits(Health and Dental) of any sort. The uniforms you are required to wear in the kitchen area and Housekeeping Area are cheaply made, so they strink and unravel over time."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Pros and Cons", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Aug 2016", "job_title": "Surgical Technologist in Houston, TX", "duration": "N/A", "pros": "Great surgeons.  Friendly and professional.  They are willing to help you and speak up for you.  Because of this, many employees are fiercely loyal to their surgeons.  New employees may have problems getting \"in\".\r\n\r\nPaid parking.  Rare in the Medical Center.\r\n\r\nHelpful and friendly staff.  I receive more support from coworkers than management.\r\n\r\nSmaller hospital; you get to know everyone.\r\n\r\nMain surgery has an RN OR training program.  It is designed to help train new nurses into the orthopedic OR.  This was done in response to an inability to hire experienced nurses.  This is a great Pro because surgery is not taught in schools and the experienced nurses are retiring...or going elsewhere for better pay.  A certificate is issued after so many months.\r\n\r\nNext to St. Nicholas private school, although it is expensive.  It is planning to move in a couple of years.  It cares for babies up to 9th grade.\r\n\r\nStarting to hire 10-hr shift people; this helps the call crew from working too late, too much.\r\n\r\nOvertime is offered almost daily and is encouraged.  Looks good at evaluation time.  This is a con if you don't want overtime.\r\n\r\nFree Holiday meals, although the quality changes frequently; it is outsourced.\r\n\r\nTry their best to offer 30-minute lunches.  If it's not possible, management buys pizzas or sandwiches and offers 15-minute breaks.  It's a con if you're trying to eat healthy!  \r\n\r\nNice yearly company party held on Saturday every late January or early February at a hotel.  Buffet food and gambling (for prizes).\r\n\r\nOutside the Medical Center, so most of the traffic in the area is avoided.\r\n\r\nNew 5th floor offers a Starbucks coffee shop with a view.  They also serve simple sandwiches.  Open from 6am - 6pm.", "cons": "Lower than average pay for area.  For techs, usually $5/hr less than the bigger hospitals nearby, despite what HR says.  Benefits not as good either.  No sick pay.\r\n\r\nLow or no bonuses offered.  Usually $25 gift card every Thanksgiving, Christmas and Birthday.  75$ quarterly gift cards if certain quality measures are met, usually reached only once a year.  Bonuses are taxed.  Quality measures are increased if bonus is met.  Must be full time to receive bonuses.\r\n\r\nIt is partially owned by HCA, formally known as Colombia Hospitals.  This may be a pro or con depending on your experience with them.\r\n\r\nHR waits until they can't hire anyone before they give everyone a raise or adjustments.  In 2015, nurses received a large salary adjustment because of that.\r\n\r\nLack transparency.  Big time gossip mill, yet it's the only way to get information while avoiding the intimidating director.  Management does nothing to manage the gossip.\r\n\r\nPolicy discourages discussion of salary and bonuses that you must sign prior to employment.  Never sure if you are being paid fairly.\r\n\r\nDifficult to get vacation time off; must plan several months ahead of time.  Director discourages making plans over 6 months to be fair for everyone.  However, people in general try their best to work vacation time in.\r\n\r\nStrict and strange rules on absenteeism.  Measured on a point system.  If you are late (1 minute or 2 hours), it's a point.  If you have to leave early (within 4 hours), it's 1.5 points.  If you call in sick within 4 hours or less for your shift, it's 2 points.  Verbal warning after 4 points, written warning after 6 points, firing happens after 7? points.  Points reset every year.  Don't get sick!  Management MAY sympathize if there is flooding/natrual disaster going on.\r\n\r\nUnusual call system.  Do not get paid for simply holding a beeper.  Call bonuses ($50 for surgical techs, more for nurses) are given after you work your 8 hours.  So, you don't get a call bonus if you get called in on your day off (which sometimes happens), however you can get a call bonus for having to drive in to work.  Yeah, confusing.  Must make a written request and have it signed by a manager to receive call bonuses every time.\r\n\r\nCall can last well into the night.  Must work normal shift the following day, although management trys to work in a leave-early request if you want to.\r\n\r\nNo sick leave/time off.  Must use PTO, expecially if you've worked less than 30 hours that week.  Don't get sick!\r\n\r\nMandatory call 3-5 days a month, depending on which department you work in.  Call is a necessary evil.  In general, surgical techs take more call than nurses.  Outpatient surgery department takes more call than Main Surgery becasue Outpatient is smaller.  Outpatient surgery is expected to cover for Main Surgery if short staffed, it rarely works the other way around because Main Surgery has the longer and more difficult cases.  Usually stay late 1-3 hours past your shift when on call. Main surgery department is expected to take weekend call, which includes Friday through Sunday; luckily, there are crew teams that prefers weekend call. Holiday call is rotated and includes both Outpatient and Main surgery departments.  Rarely called back in after working your shift.\r\n\r\nFavortism.  Brown-nosing PAYS.  It will help you with general flexibility in work and getting your ideas heard (unpopular employees that have excellent ideas or valid concerns are dissmissed).  If this doesn't bother you and can work this system, then this is a great Pro.  \r\n\r\nLack of leadership at the management level\r\n\r\nUnprofessional director.  Has yelled at people, made discourageing comments, belittles; very intimidating person.\r\n\r\nDifferent CEO/CFO every 2-4 years\r\n\r\nSalary caps after about 10 years of service.  \r\n\r\nLack of day care centers in area.  St. Nicholas is the only school nearby, and it's moving. \r\n\r\nWork load varies daily.  Can work overtime on one day and leave early the next.  Employees often pushed to clock out before their shift ends (except for \"favorites\").\r\n\r\nUndignified way they fire people.  Firing usually takes place on Fridays at the end of a shift.  Two security guards walk with you as you empty your locker and walk to your car.  Everyone on the way watches.  They have fired people who where employee of the year before.  They have fired pregnant women before. If they want you to go, they'll find a way.  Goes back to favortism.  \r\n\r\nHR and management have told me they are like a family; don't buy it!  It is a company like all others and should be treated as such.  When the lion is fed, he's happy, if there's something better, you're the food.  Not really a Con, just the truth...it's not your family.  Knowing this should help separate personal issues with company issues, don't mix the two.  In the end, despite what management says, TOH doesn't care about your personal problems when there's a bottom line to be met.  Those who have worked here since it opened may be shocked, because it really was once a smaller, family-like environment.  It has grown substancially since, so don't drink the kool-aid."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Medical Records HIM", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Feb 2010", "job_title": "HIM Analyst ! in Houston, TX", "duration": "N/A", "pros": "Parking is free.  It is a small hospital and focused on Orthopedic injuries only.  Overall, the people are friendly. Low stress.", "cons": "Unless you are in management, you are not paid well.  The managers have been completely out of line with employees.  Bonuses are paid out well to managers, but low to staff."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Really", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Nov 2015", "job_title": " in Spring, TX", "duration": "N/A", "pros": "Great family environment, good place to work.", "cons": "Poor management a little to laid back tenured employees know the ropes and will not do their job."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Sept 2020", "job_title": "Pain Management RN in Houston, TX", "duration": "N/A", "pros": "I’ve had nothing but great experiences working at Texas Orthppedic! Everyone makes you feel like family. Management is supportive with open door policies.", "cons": "I’ve had no bad experience working here"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "one of the best places to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Oct 2020", "job_title": "Patient Care Assistant (PCA) in Houston, TX", "duration": "N/A", "pros": "Great management and teamwork. Takes care of staff and patients like family.", "cons": "cannot think of any. it is truly a great environment to work in."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Pbx operator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Apr 2017", "job_title": "PBX Operator in Houston, TX", "duration": "N/A", "pros": "Excellent health benefits and you can post out to different departments.  Tuition reimbursement if you take classes pertaining to medical", "cons": "Small hospital sometimes hours get cut when not that busy."}]]