[[{"date": "15 Mar 2023", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Large panel interview with multiple advisors. Everyone was nice but there were 5-7 advisors at the conference table. The university is great. The interview was for world wide but that wasn’t a choice for this.", "Interview Questions": "Tell me why you think you would be a good fit."}, {"date": "9 Mar 2023", "title": "Assistant Campus Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Worked with HR mostly through the process and interviewed with campus director. I heard back quickly and everyone was friendly and respectful. Asked about experience, skills, and knowledge of working with different student groups.", "Interview Questions": "Tell me a little about yourself."}, {"date": "6 Feb 2023", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "The interview process has changed but usually it is a round robin where previous RA's ask you questions on how you would handle certain situations and what being an RA means to you.", "Interview Questions": "What does self-advocacy mean to you."}, {"date": "10 Oct 2022", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "To receive the job as a researcher, I was first interviewed by the professor heading the department of aerospace engineering. After such I was given tasks to test my ability to perform Root Cause Analysis.", "Interview Questions": "Why do you want this position?"}, {"date": "10 Jun 2022", "title": "Food Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "The interview was intense. There was a general tell me about yourself section, a hardware identification section, a scenario based what would you do for xyz problem, and a soft skills section. The interview took almost an hour, and was overall pretty pleasant.", "Interview Questions": "Why are manhole covers round? "}, {"date": "5 Feb 2022", "title": "Career Services Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Three stage interview. First was video chat with Director and Executive director. Second was with entire section team members over video chat. Third was a campus visit, tour, and one on one interviews with the entire section.", "Interview Questions": "Standard top 26 questions from LinkedIn page."}, {"date": "27 Jan 2023", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Embry-Riddle Aeronautical University (Prescott, AZ) in Feb 2022", "Interview Descriptions": "There are 3 steps to the interview process - the written application, the individual interview, and the group interview. In the individual interview, you are expected to start off with a 5 minute creative presentation about yourself and why you are fit for the role. The group interview consists of a bunch of group activities, and you are judged on how you act in those situations.", "Interview Questions": "Q: What is a conflict you had with someone with authority, and how did you deal with it?"}, {"date": "24 Jan 2022", "title": "Flight Dispatcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Just show up. Allow the interview to speak and be polite and flexible. Interview consisted long overview of job not really any-questions besides are you ok with this or will this work for you.", "Interview Questions": "No questions just general real overview "}, {"date": "12 Jan 2023", "title": "Certified Flight Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach Shores, FL) in Jun 2021", "Interview Descriptions": "Received a call to ask for a date. Gave me a maneuver to teach which was slow flight. After the interview, received a call within 30 mins that I’ve passed the interview.", "Interview Questions": "What got you into aviation, if you see a fellow IP doing their night currency and not doing a thorough preflight what would you do"}, {"date": "1 Apr 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Two rounds, first zoom interview then campus visit. The campus visit would evolve both teaching demo and research talk. It would be quite challenging in the one day long campus interview.", "Interview Questions": "Why do you choose ERAU"}], [{"date": "19 Jan 2021", "title": "Student Support Technician Level II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Interview was fairly easy.  Went through several baseline level IT questions as well as a thorough review of class schedule to make sure that you can put in an appropriate amount of work.", "Interview Questions": "What are the steps you would take to troubleshoot a computer not connecting to the internet?"}, {"date": "6 Jan 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Jun 2020", "Interview Descriptions": "Multi round interview, the first being with department heads, the second usually with coworkers/people on the same level as you/campus partners, and the the last (depending on department) interview with students in the department.", "Interview Questions": "Situational and behavioral questions were asked to get a fit for how you would fit with the team."}, {"date": "5 Sept 2019", "title": "Assistant Campus Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "I saw a Facebook posting for a local job and emailed my resume to the director.  It was a one on one interview. I do believe other locations also required a second interview with a power point presentation too. That was not the case for me. Following the  interview it was 3 weeks until I was hired.", "Interview Questions": "Organizational skills were stressed, and they gave a few student scenarios to handle"}, {"date": "1 Feb 2019", "title": "Shipping Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Jan 2019", "Interview Descriptions": "Very quick response from employer, apply and interviewed in the same week.   Interview was with department head and current manager.  We spent about thirty five minutes reviewing the position requirements and expectations with situational questions", "Interview Questions": "If you had a next day, 2nd day, and ground package to ship and you only had time to get one shipped which one would you prioritize ?"}, {"date": "28 Jun 2019", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Embry-Riddle Aeronautical University (Prescott, AZ) in May 2018", "Interview Descriptions": "Round 1 consisted of a phone interview with the supervisor of the role. Round 2 consisted of an on-Campus interview where we go on a campus tour, present a slideshow, and are interviewed by a team.", "Interview Questions": "What are you weaknesses and what have you done or are doing to overcome them? "}, {"date": "25 Feb 2019", "title": "Campus Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Embry-Riddle Aeronautical University (Forest Home, AL) in Mar 2018", "Interview Descriptions": "Skype interviews with management. Several leaders Skype and go through a conversation type interview addressing the basic interview questions. There is a second interview and the same process is followed.", "Interview Questions": "It varies but basic why are you qualified and have you done this work previously. "}, {"date": "25 Oct 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Applied online and then received email regarding request for interview. The interview was scheduled through email and conducted two in-person interviews. Usually consists of 2 or more people currently working at the place you have applied for.", "Interview Questions": "What is your biggest weakness that you would consider for yourself?"}, {"date": "20 Feb 2019", "title": "Finance Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Embry-Riddle Aeronautical University (New York, NY) in Oct 2017", "Interview Descriptions": "Not a flashy role but very nice people to work with.  Methods and tools are outdated but seems to be due to department budget and lack of IT strategy & resources.\n\nIt's a non profit so don't expect a high rate of pay, The time off, 401k and tuition benefits are impressive and often the reason why people work here and don't leave.   \n\nThis is the type of place to work if you are not looking for growth and internal opportunities, but more for job stability in a role and a positive environment.", "Interview Questions": "systems knowledge"}, {"date": "2 Aug 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Aug 2017", "Interview Descriptions": "Given that I was hired based on my professors referral to the head of the department, the interview was very brief and informal. The professor already knew most of my skills and qualifications and the interview with the head of the department was just a formality.", "Interview Questions": "What my ambitions were and plan for the future."}, {"date": "16 Sept 2017", "title": "Assistant Director of Procurement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Aug 2017", "Interview Descriptions": "Very in depth process. Started out with Skype interviews then second round of phone screening with upper management then on site visit and day of round table style interviews. Very informative process as well.", "Interview Questions": "Experience with systems and systems roll outs."}], [{"date": "11 Oct 2020", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Embry-Riddle Aeronautical University (Prescott, AZ) in Jan 2017", "Interview Descriptions": "Embry Riddle Aeronautical University has a typical interview process.  My experience was comparable to other companies.  Nothing notable in this interview process.  Hiring process was was fairly typical and an easy process.", "Interview Questions": "N/A"}, {"date": "8 Dec 2016", "title": "Labor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "It has pretty nothing to say, if you are a student of Embry-Riddle Aeronautical University, you can get a temporary job whenever you want. I help moving the desks and chairs during the hall on university center.", "Interview Questions": "N/A"}, {"date": "20 Jul 2018", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Dec 2016", "Interview Descriptions": "Online application submissions followed by telephonic interview with hiring manager and face to face interview with a panel includes Assistant Director of Admissions, Assitant Director of Operations and Admissions Counselors.", "Interview Questions": "will you be able to work during summer and winter breaks"}, {"date": "20 Nov 2018", "title": "Student Field Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Sept 2016", "Interview Descriptions": "Only took about 30 minutes.  They gave me a paper exam to do, which I did, handed back, and was told I got the job.  This was a one on one interview", "Interview Questions": "Why are manhole covers round?"}, {"date": "27 May 2016", "title": "Campus Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Embry-Riddle Aeronautical University in May 2016", "Interview Descriptions": "I applied online and was contacted for a group skype interview. I was then contacted for a second group skype interview. The people who interviewed me were extremely nice and supportive. Unfortunately the salary did not line up with the demands of the role, especially as this role was responsible for two campuses, so I withdrew before the final interview as something else came up. I enjoyed the people I met with, but another downside was they were all based in FL, and this position is in CA. I wish they had included at least one person from each campus that this role was responsible for.", "Interview Questions": "How would you describe your leadership style? "}, {"date": "9 Oct 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in May 2016", "Interview Descriptions": "Very rushed and non professional. Not like most institutions. They don't seem to care much about academic credentials. Helps a lot to be former military or pilot.  Most of the existing faculty have weak credentials, it is easy to impress them.", "Interview Questions": "How can you help ERAU to be seen as a real university?"}, {"date": "10 Apr 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL)", "Interview Descriptions": "It was a classic style interview with manager and director, they explained what my position will be and ask questions based on the position, overall very good interview. It was a very thoughtful interview.", "Interview Questions": "can't really remember but was pretty easy, it's was more of what i will like to know about the position"}, {"date": "20 Nov 2015", "title": "ELearning Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Phone interview, followed by a face to face team interview with the whole team asking questions. After questions were asked an opportunity was presented to ask questions to the team as well. At the end of the interview I was escorted out, and the team discussed pros and cons. I was notified three days later.", "Interview Questions": "How do you keep up with modern technology?"}, {"date": "13 Feb 2017", "title": "Website Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Embry-Riddle Aeronautical University (Prescott, AZ) in Nov 2015", "Interview Descriptions": "After filling in a student application and emailing someone in IT, we had a lot of back and forth online until finally I was told to come in for an interview. He was very easy going and asked simply about my experience with specific tasks and made me feel slightly overqualified. Eventually I was told the position ended up being outsourced.", "Interview Questions": "What is [my] experience with copy-writing? This was unexpected because I thought the job was more technical."}, {"date": "13 Mar 2017", "title": "Assistant Campus Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Embry-Riddle Aeronautical University in Sept 2015", "Interview Descriptions": "Somewhat odd, as the director kept asking odd-ball questions, they most likely picked out favorites based on personality as well as my experience. Certain questions caught me off guard and they talked more than I did.", "Interview Questions": "Are you involved in community volunteering?"}], [{"date": "28 Sept 2015", "title": "Faculty Contract Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Sept 2015", "Interview Descriptions": "One phone interview with manager.\r\nFirst in person interview was with manager and team lead. Same questions in phone interview reviewed, then additional from team lead. Professional, friendly.\r\nSecond interview was most of the team including manager and team lead again. Same questions from first in-person reviewed, new questions from new additions to the interview. Very friendly.", "Interview Questions": "Give us an example of how you would handle relations with a customer that is having a issues at one of your previous jobs."}, {"date": "23 Jul 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "I talked to the two managers. The questions were ranging from work ethic to internet protocol. After a couple of days i got an email with my hiring information. The process was easy.", "Interview Questions": "-What is your gpa?\r\n-Do you know anything about programming?"}, {"date": "1 Aug 2015", "title": "Assistant Campus Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Embry-Riddle Aeronautical University (Tyndall AFB, FL) in Jul 2015", "Interview Descriptions": "Nothing challenging. Phone interview and  then a F2F at the office. I was contacted via email. The interviews where planned to be short and to the point. The director was the interviewer for both interviews and was very welcoming and very honest about the process. For someone getting back in the job hunting process, they made the experience positive.", "Interview Questions": "Tell me a time when you made a mistake in a previous position...what did you do and what was the outcome?"}, {"date": "20 Jul 2016", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Jun 2015", "Interview Descriptions": "The interview process was smooth and easy. The interview was for a part-time student technician job and it was quite simple. The interviewer checks if you have the right attitude and the willingness to learn new concepts. You'll be asked to complete a questionnaire which has questions relevant to the department you're interviewing. Another important discussion is regarding your class schedule and available hours for. Different departments have different interview procedures.", "Interview Questions": "Relevant experience"}, {"date": "6 Nov 2018", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in May 2015", "Interview Descriptions": "Apply online and wait for the decision. Submit around three letters of recommendation for the consideration. Exhibit very good academic skills. Post some research papers, journal papers and articles. Hone your teaching skills.", "Interview Questions": "What are you interested in researching?"}, {"date": "28 Jan 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "One face to face interview on site.  Job offered and accepted one week later.  General interview questions followed by casual conversation. It was a very easy and quick process.", "Interview Questions": "Basic interview questions"}, {"date": "4 Nov 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Jan 2015", "Interview Descriptions": "Professor recommended me. I interviewed with tutoring center supervisor, and got an email response. Interview was purely technical, did some physics problems and some chemistry problems. It wasn't difficult, but you do have to know your stuff because they will ask you questions in between. Problems were basic Physics I and Chemistry I course problems. The atmosphere was friendly and comfortable.Overall it was good", "Interview Questions": "I was asked to solve physics problems"}, {"date": "15 Dec 2014", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Embry-Riddle Aeronautical University in Nov 2014", "Interview Descriptions": "The whole interview lasted 30 minutes. At first, they explained my the position and they asked my four to six really easy questions. Most of them were related to my previous educational backround and especially about my projects. They also asked me if I participate in any student group. More than that they infored my that I have to work 20 hours per week.", "Interview Questions": "What is your greatest advantage for this position?"}, {"date": "14 Oct 2014", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "All positions are posted and applied directly via ERAU website.  Initial response was very quick, possibly due to the position being posted for a while.  Phone interview was with the hiring manager.  Discussed position and background in depth.  Was asked for an in person interview but at end of the conversation found salary range was too low for me.  Shame it sounded like an interesting environment.", "Interview Questions": "Questions were pretty standard.  "}, {"date": "8 Feb 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Jul 2014", "Interview Descriptions": "They asked about 40 questions and had two people present at the interview.  We sat at a table and talked.  The interview lasted about 45 minutes.  We laughed and had fun.  They provided drinks and cookies to munch on.  The lady was pretty. The man was dressed on a suit and tie.", "Interview Questions": "Will you follow directions no matter what?"}], [{"date": "10 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Embry-Riddle Aeronautical University in Apr 2014", "Interview Descriptions": "The interview was not very hard. Fir about 20-25 minutes, all the questions were related to personality (HR questions), and then they explained about the job description in detail and started with the technical round. A few questions were hard but you just have to be very strong in the basis of the field you are applying for graduate research assistant position.", "Interview Questions": "They asked about my software skills and asked several questions from one software."}, {"date": "2 Jun 2016", "title": "Area Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Apr 2014", "Interview Descriptions": "Three types of interviews, phone, in person at conference and on-campus. There is a screening process prior to the interviews to ensure that you match the \"Riddle Culture\". The on-campus is very much a dog and pony show in that there is little content that the candidate will take away from the on-campus. The phone interview is really where you want to get the most content across.", "Interview Questions": "What are you looking to get out of Riddle? How do you work on a team? How do you deal with change? What is your experience within supervising student staff?"}, {"date": "6 Jan 2014", "title": "Assistant and Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Embry-Riddle Aeronautical University", "Interview Descriptions": "Phone and in person", "Interview Questions": "Basic HR Questions and scenarios"}, {"date": "10 Aug 2015", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Aug 2013", "Interview Descriptions": "It was easy going interview since it was a part time job. just asked common knowledge about the computer, how to change printer toners and It was easy going interview", "Interview Questions": "Why did you apply for this job"}, {"date": "21 Aug 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Jan 2013", "Interview Descriptions": "Very simple and quick process.  Emailed resume and had a phone call within a week.  Within another week I had an interview.  Interview was not very formal and took about 30 minutes.  Asked general questions about experience and future plans.", "Interview Questions": "Asked questions to test my knowledge of Microsoft programs.  One program was one I had never used, Microsoft Project"}, {"date": "21 May 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Sept 2012", "Interview Descriptions": "I had one very casual interview since I had already worked for the department.  I was told what to expect from the job, I was given a gist of the project concept.  I was asked for my schedule and we worked on a time table that fit both my supervisor and myself.  I was told what they expected from me and if I thought I could accept it.  It went really well.", "Interview Questions": "Regarding my knowledge and expertise with a particular software tool used for simulations"}, {"date": "10 Oct 2013", "title": "Student Technician - IT Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Sept 2012", "Interview Descriptions": "Interview process was lengthy although the person who hired me ot fired a month later.", "Interview Questions": "the most unexpected question for the position of Student \"Technician\" was asking me to write an essay on leadership."}, {"date": "12 Dec 2012", "title": "Flight Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Aug 2012", "Interview Descriptions": "Being a graduate there is too much bias from me. It was pretty easy considering what I had to do. The basic interview was 1:1 and since they are hardcore on their SOPs the questions were easy to answer. The sim and flight was just as I expected, but, like i said, know those SOPs.", "Interview Questions": "Pretty Basic, know G1000 systems"}, {"date": "28 Feb 2013", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Jul 2009", "Interview Descriptions": "I received an email about coming in for an interview that day after I applied. I met initially with the hiring manager, then the rest of the team on the first day. I was asked to come back in a few days later to meet with a VP.", "Interview Questions": "What do you think you could bring to this team?"}, {"date": "15 Aug 2010", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Apr 2009", "Interview Descriptions": "Was a current adjunct and applied for full time on campus.  They knew me and I knew them.  I had recently been informally offered a similar position there but the position was eliminated due to the economy.  In both one on one, and panel interviews, the interviewers did not seem to be serious.  When they were, they were very adversarial.", "Interview Questions": "Why do you want to leave your present position?"}], [{"date": "13 Oct 2010", "title": "Instructor Pilot Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in May 2008", "Interview Descriptions": "Basically the interview comes down to a written test followed by an HR/Technical interview with two Managers. After this process you move on to a Simulator Interview followed by a Flight Interview. Basic Flight maneuvers on each 2 private pilot (gnd ref / air work) and 1 commercial maneuver (chandelles/lazy eights). All performance landings/takeoffs were tested. In the SIM interview the focus is on instrument flying, ILS / DME Arc, use of the garmin G1000 system.", "Interview Questions": "What is a magneto?\r\nExplain Gyroscopic Precession"}, {"date": "1 Feb 2010", "title": "Strategic Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Embry-Riddle Aeronautical University (Daytona Beach, FL) in Apr 2008", "Interview Descriptions": "Embry-Riddle is a great place to work. The people that land jobs there tend to stay for very long tenures. Many of my colleagues have been there for more than 10 years and have no plans of leaving. Typically the hiring process involves people you will work with repeatedly. Unless it is an upper-level position, you may not experience the panel interview format. More likely is the format that reqiuires multiple interviews with the people that will interact with you the most.", "Interview Questions": "Describe the attribute you possess that will make you successful in this position and additional positions within this organization."}]]