[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Director/Administrator", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "15 Oct 2017", "job_title": "Director in Fresno, CA", "duration": "N/A", "pros": "Heald College was very student oriented and had a family atmosphere. Employees had fun while working hard to help students succeed.", "cons": "Since it was a quarter system, sometimes the pace could be too fast for some new employees. The biggest con was Heald being purchased by Corinthian Colleges and ended up being closed."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Well they screwed everyone", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 May 2022", "job_title": "Instructor in South San Francisco, CA", "duration": "N/A", "pros": "Students were great, faculty was great", "cons": "Corporate greed and illegal activities"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "High pressure work environment", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Jul 2021", "job_title": "Admissions Advisor in Portland, OR", "duration": "N/A", "pros": "Good pay and benefits, great team", "cons": "High pressure sales env\r\nNo Job Security"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Instructor", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "17 May 2021", "job_title": "Instructor in Walnut Creek, CA", "duration": "N/A", "pros": "Co workers, students, flexibility, quarter system", "cons": "Hours, low pay, no room to grow, nepotism"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Great Co-workers, but the work sucks the life out of you...", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Feb 2014", "job_title": "Admissions Advisor in San Francisco, CA", "duration": "N/A", "pros": "I loved my coworkers. They were the best. The company had good benefits although taking vacation time was frowned upon.", "cons": "The work: At first it was fulfilling. Changing the lives of students, but then you realize that they recruit disadvantaged students and promise support and then other departments to do not deliver the support. Students gradate (if they do at all) with tons of debt and fewer career aspects. What was most heart-breaking was seeing students quit, with tons of debt, and then try to come back only to learn they had to make monthly payments to come back. Some students make it work; but they have to be strong. As an admissions adviser I started having some serious doubts about the morality of what I was doing. It became all about the numbers and I stopped sleeping at night with guilt.\r\n\r\nThe work environment: Its stressful, sometimes fun, but stressful. When you meet your numbers and you are on top, everyone loves you. When you have a bad start and miss your numbers, everyone hates you. There are tons of rules you must follow and you see co-workers come and go. You are always wondering \"am I next\"."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Not a great company for me, but great for others.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Sept 2014", "job_title": "Anonymous Employee in Concord, CA", "duration": "N/A", "pros": "Some of the students were a joy to work with and some of the instructors were nice.", "cons": "Required to call students relentlessly. It was almost embarrassing how we were required to chase students around. The pay and the benefits are below par considering some of the insurance plans cost 600 monthly for a family plan. People are very stressed out and not very nice to one another.\r\n\r\nPersonally, I felt unchallenged by the job and it was not a good fit for me. Another con is that the educational benefits are only given after 2 years and many of the perks have been cut out completely (if you call getting toner for a printer a perk). No 401 K match contributions, furloughs, and layoffs.\r\n\r\nSome of the instructors are entitled and difficult to manage. They take advantage of the company by working partial days. The company then has to pay out substitute hours which is ridiculous considering lay offs. Point here is to be more conscientious of other people and go to work each day. That money savings might save another persons job."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "This company will not survive another five years", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Sept 2013", "job_title": "Financial Aid Advisor in Rancho Cordova, CA", "duration": "N/A", "pros": "There is no way to come up with twenty words that describe the pros of working here other than to say there is no heavy lifting.", "cons": "A once great school with 150 years of changing people's lives has become a cesspool obessed with profit. Middle management is vindictive and incompetent. There is little to no training in anything, the MO is \"just go and do it, but if you do it wrong we will write you up\". This is disturbing in such a highly regulated environment. \r\n\r\nProfit comes ahead of student learning outcomes. The Admissions Department preys upon the poorest of the poor, recruiting \"students\" from homeless shelters and rehab facilities, enrolling people who are pushing all of their worldly possessions around in a shopping cart. \r\n\r\nThere is little to no work/life balance. With eight starts a year mandatory overtime is a nearly weekly occurrence. Middle management will make you feel guilty for needing to fulfill family obligations or being sick."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "My experience working with Heald College was very exciting, interesting, and most of all, working as a team.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 May 2014", "job_title": "Financial Aid Receptionist in Fresno, CA", "duration": "N/A", "pros": "The best reason to work at Heald is that, first of all, you have to have a high GPA, excellent attendance, well like, well known, and well respected.  Not every student can work for Heald College, you have to earn it.  It was as honor for me to work there and be a student at the same time.  They recognize you as a student first so that you can attend to you studies.  I would recommend it to any student that takes their schooling seriously.", "cons": "The challenges working for Heald College is that you have to maintain your high GPA and excellent attendance record.  You must maintain these in order to keep your employment with Heald College."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Dialing till your fingers bleed", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2014", "job_title": "Admissions Advisor in Portland, OR", "duration": "N/A", "pros": "Salary is very competitive\r\nHealth Insurance begins immediately at hire\r\nInstructors are good and coursework sound\r\nCollege is accredited - i.e. you can transfer credits to another State University", "cons": "Few of those gaining admission are actually educationally qualified to pass the course offered - high drop out rate\r\n\r\nTuition is nearly 1/2 time MORE than a standard University or College and with the high drop rate - many of these folks - economically disadvantaged to begin with - find themselves saddled with debt that can not be discharged.by \"mirrored online sites with devious information capture\r\n\r\nThe Admissions office is a \"churn'em and burn'em\" model - you are dialing off lists of phone numbers secured mostly ...lots of hang up and you need to dial 200 people per hour.\r\n\r\nIf you do not convert someone off the old lead list(s) - you will not be given any \"walk-ins' - or your name to receive a \"walk-in will be so far down the list - you may get called to interview someone one time per day. If you don't \"meet your quota\" three times in a row - you are fired."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awesome Individuals, terrible company", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Jul 2014", "job_title": "Instructor in Salida, CA", "duration": "N/A", "pros": "Training and support varies from campus to campus.  Experienced instructors are willing to assist new instructors and the mentor program is strong.", "cons": "You will not be paid industry standard or competitive rates.  If you love to teach and don't care about money, you'll be happy.  Bonuses and merit increases do not exist.  We teach because we are called and love to dispense of ourselves to our students; however, we still want to be appreciated by being compensated, not monthly awards and parking spaces.\r\n\r\nEthics are an issue with this/these school(s) on an individual basis and a corporate basis.  Morality and ethics could use a serious review.  Students are generally underprivileged or coming from difficult circumstances.  These students are obviously targeted and pigeon-holed and are forced to finish programs they will overpay for."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Experience at Heald College (Salinas, Ca Campus)", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Sept 2012", "job_title": "Anonymous Employee in Salinas, CA", "duration": "N/A", "pros": "Alows return to school adults the oportunity to obtain an education", "cons": "Students are lazy: The students expect to pass classes. The majority of the students are in their 20's and some find it hard to study. These same students copy their homework assignments from each other and expect to obtain full credit on the assignments. When students are offer office hours to review problems, the students do not show up and management do not provide adequate space. It is also a managements problem since they (top guys) keep insisting that its a \"for profit\" college. On guy in management said \"These students are not university caliber\" and \"they need special attention\". Special attention as in let them pass. \r\n-Majority of Students don't care\r\n-Instructors don't care or are not qualify to teach certain topics\r\n-Management cares even less. All they care about is \"for profit\""}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Ridiculous demands, low pay, sinking morale", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Aug 2012", "job_title": " in San Jose, CA", "duration": "N/A", "pros": "Great co-workers, students are sweet., Before being bought out by COCO, Heald was a reputable institution.  Just as a nice girl's reputation can get sullied by hanging out with a thuggish guy, Corinthian bought Heald thinking it would make them look good because of their hard earned WASC accrediation.", "cons": "Ridiculous demands, low pay - Nothing about Corinthian Colleges, inc. is genuine. Watch on You Tube or read the Senate Report by Tom Harkin regarding his recent two year investigation.  Exploitation of students and employees.  I think it is fine to work there and the faculty are hard working and caring but I would advise students to never, never,  enroll here or at any other for profit college.  It won't help you get a decent paying job and you'll spend your life paying back your loans."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Teaching at Heald", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "12 Oct 2014", "job_title": "Instructor in Roseville, CA", "duration": "N/A", "pros": "The best part of teaching at Heald was helping non-traditional students succeed in college. Students who would otherwise not go to college in an academic setting were able to succeed in a business setting.", "cons": "Heald was a for-profit institution that cared more for money than for their students. When I started it was non-profit but was bought out and turned into a money-making machine. Academic standards dropped dramatically and we were pressured to keep failing students in class in order to generate profit. When a student finally had had enough and quit, we were required to call him/her every day to try to get him/her to re-enroll. Bringing the same student back two or three times generated huge profit. We teachers knew the student had no chance of success, but we had no choice--if we wanted to keep our jobs. We were under enormous pressure to pass students who didn't want to drop out, didn't want to do homework, didn't study for tests, and who felt that they paid their money, so they should get their degree."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "First Rate College", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 May 2015", "job_title": "Student Services Advisor in Roseville, CA", "duration": "N/A", "pros": "Though I only worked there four and a half months, I am honored to have worked with such dedicated, intelligent leadership, instructors and students. I truly believe that the campus I worked at deeply cared about the students and serving them well. The parent company, CCI was unfortunately negligent and cost us all our positions and thousands of current and future students their right to obtain a first rate Heald education. I wish Heald students and my colleagues well.", "cons": "CCI as a parent company was a huge con. If only those completely avoidable mistakes had not been made by CCI, Heald would have had a chance to be sold by a viable buyer and lived in for at least for another 152 years."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "All About the $$$", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jun 2014", "job_title": "Admissions Advisor in Stockton, CA", "duration": "N/A", "pros": "Overall culture at the campus is positive, company benefits were good, some of the staff genuinely care about students' success.", "cons": "Terrible work life balance, corporate feeds employees propaganda that they're \"all about the student,\" when really all they want is money in their pocket, many highly paid management members can't write even a paragraph to save their lives, money-hungry corporate drives every last drop of energy that they can from Admissions until they are miserable, and veil this ill-treatment under the excuse of \"the students,\" but it is ALL money."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Major changes have occured over the past year and they are definately for the better!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2012", "job_title": "Admissions Advisor in Concord, CA", "duration": "N/A", "pros": "Faculty and Staff genuinely care about the students.\r\nFacilities are extremely well cared for and the company is great about investing in resources for the students.\r\nStaff is fun and works together for the benefit of the students.\r\nGreat benefits.", "cons": "Tough to take time off due to frequent start schedule.\r\nWork/Life Balance is a struggle.\r\nMarketing and lead opportunities lack creativity and forward thinking approach."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Math and Science Teacher", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jun 2015", "job_title": "General Education Instructor in Portland, OR", "duration": "N/A", "pros": "I change lifes every single day.  I am a gifted Teacher.  I was able to break through racial, socio-economic, and sexual barriers to get inside the problem and unleash the students full potential.  My typical students was left behind by public education and convinced they were not intelligent.  It was very rewarding to see the lights come on and know that the student was more confident and more ready to grow.  I loved my job.", "cons": "I worked for a for-profit private college and was subject to corporate greed and political maneuvering.  As a result Heald College closed its doors permanently after a 152 year history."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Rampant cronyism invalidates Heald as an academic institution", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Mar 2018", "job_title": "Anonymous Employee in Honolulu, HI", "duration": "N/A", "pros": "Some of the Program Directors were capable leaders and administrators.", "cons": "1. Cronyism recycling the same individuals for different posts.\r\n2. Blocking advancement of individuals worthy of full time posts\r\n3. Demoralized faculty, even the full timers, hurt the student experience.\r\n4. Reverse sex discrimination only assigning male instructors to work until 10 PM. Male instructors and their families care about their safety too.\r\n5. Recycling the same personnel led to stagnation and hidebound ways of doing things that rendered the college unable to adapt to the changing government regulations.\r\n6. Recruiters deceived, cajoled and bullied students into enrolling.\r\n7. Same recruiters applied for loans in the students name putting them deeply in debt."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Terrible experience", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Mar 2014", "job_title": "Admissions Advisor in San Francisco, CA", "duration": "N/A", "pros": "If you enjoy talking to people over the phone all day long, or meeting new people face to face then this is a great job. I really felt like I made a difference in some students lives.", "cons": "-MAJOR micromanaging\r\n-Directors will get mad if you clock in 3 minutes late (they'll write you up)\r\n-Directors will listen in to your phone calls to make sure that you're \"following the script\" while speaking to students\r\n-no fun energy\r\n-management picks favorites \r\n-you can't trust anyone\r\n-other employees are nice and helpful at first, but then they forget about\r\n-no sense of a family bond in the office\r\n-office feels and looks like a dungeon\r\n-working Saturdays at least twice (or more) a month."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "It's a good transitional job", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Feb 2010", "job_title": "Instructor in San Francisco, CA", "duration": "N/A", "pros": "Students can be very appreciative.  Many have had hard lives.  If you are dedicated, you can help someone turn their lives around. I met some great people and dedicated teachers among the staff, too, and learned an enormous amount of patience.", "cons": "The school's management might be more concerned with profits than it is with academic performance.  Many of the administrators were more concerned with doctrinaire compliance than they were with the teaching staff's needs. Overall, it was a good place to get some legs and move on, but not a place I'd stay at."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Admissions Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "1 May 2015", "job_title": "Admissions Advisor in Hayward, CA", "duration": "N/A", "pros": "It had a long standing history of educating the community. Being able to actually watch students grow into prospective employees through the education and training they received at the school was very rewarding.", "cons": "The attorney general Kamala Harris and DOE blocked the sale of Heald as a political move so I and all of my co-workers are now unemployed and the students are stuck with little to no help in being able to continue the education they started."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Career Services Representative", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 May 2014", "job_title": "Career Services Advisor in Fresno, CA", "duration": "N/A", "pros": "You truly do help individuals try an obtain a career in their field of choice. They also had good benefits.", "cons": "You are held to sales \"numbers\" meaning you have to get people employed in their field or you will be let go. You do not get to choose the students you work with so you may get some students that aren't looking for work but they still count against your sales numbers. You have to work some nights and weekends. The work atmosphere is full of gossip, even people higher up talk about other co -workers."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This place is a dark hole", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 May 2014", "job_title": "Admissions Advisor in San Francisco, CA", "duration": "N/A", "pros": "The only thing that was positive was meeting new people every day, and also obviously once the day was over.", "cons": "terrible training, if you don't improve you get a condescending email saying that they don't understand why you don't get it. There's \"blackout\" week almost every week so good luck requesting days off. You work 6 days a week, and work late on Friday. There is absolutely no room to move up or progress within the company, unless you want to become a Director, but there's nothing good about that position either. It makes you hate your job and your life. You're always afraid of losing your job. There is an extremely high turnover rate. There is nothing fun about working here."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Trying to Squeeze Water from a Rock", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Sept 2013", "job_title": "Instructor, College Or University in Rancho Cordova, CA", "duration": "N/A", "pros": "Making a difference in the lives of students who really want to grow\r\nTeaching is a rewarding, engaging activity\r\nMany colleagues are committed to students and to each other", "cons": "Irregular and difficult work schedule\r\nIncreasing work without increasing pay\r\nLayoffs/downsizing result in insecure job outlook\r\n\"Customer\"-oriented educational model - goal of company is to keep butts in the seats, not actually educate\r\n\"You should be glad you have a job\" messages from management\r\nParent company is losing money from other divisions, wants Heald to make up the difference"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "A place to make money, but not much more than that", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Feb 2016", "job_title": "Admissions Advisor in Milpitas, CA", "duration": "N/A", "pros": "At the time I worked there, my salary was commensurate to the work I did and the time I put in to do it. I can't speak for all Heald locations, but there was a sense of camaraderie in my department (Admissions Advisors).", "cons": "Do not be fooled: this employer is a profit-making institution first and an educational institution last. Although there is some rapport between the admissions \"advisors\" and the students, the admissions advisor position is essentially a sales position. Although outright lying is discouraged, statistics on post-graduate job placements are vague and skewed. It's not a fulfilling job unless all you care about is your biweekly paycheck."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Admissions Advisor", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2016", "job_title": "Anonymous Employee in Honolulu, HI", "duration": "N/A", "pros": "I got the opportunity to work with some of the best people at Heald College Honolulu. Although I worked in the Admissions Department, it felt like the campus as a whole was dedicated to the success of the students.", "cons": "I had a love and hate relationship with my work hours. In the beginning I loved the idea of started later than usual, but then I realized I was missing out on important personal events."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Heald Review", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Jun 2015", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Great employees who cared for its customers (students), but putting them first.  The company enjoyed 152 years of helping students become better citizens of this country.", "cons": "What can I say that's not good.  There isn't anything negative with Heald except that it doesn't exist anymore.  Its parent company closed its doors when cash ran out so Heald had to close its doors as well."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great benefits, low pay, lower morale, gangs", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jun 2011", "job_title": " in Milpitas, CA", "duration": "N/A", "pros": "Teachers get much (although shrinking) time off\r\nLocal staff is friendly\r\nCan be meaningful work\r\nLocal management is great!\r\nChoice of many benefits (life, health, AFLAC, vision, dental, 401K, EOP, law services)\r\nLower pay than at other local career colleges", "cons": "Emphasis is on making sure students are in class at all costs (Classroom was recent converted to Student Services offices, demonstrating corporate values)\r\nTeachers are evaluated on how many students attend & how many pass\r\nSwitched from non-profit to for profit\r\nUpper management seems to keep changing\r\nWorkload keeps increasing as school focuses on adding more and more students"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Best Job Ever", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 May 2015", "job_title": "Instructor, College Or University in Concord, CA", "duration": "N/A", "pros": "Heald College has unfortunately been unceremoniously closed by the State Attorney General. Until it was forced out of business it helped lift students out of generational poverty into meaningful work.", "cons": "The only real con is the for-profit model in general. It helped a lot of people get in the door that otherwise would have no other opportunities but the flip side is that a lot of people were in school who were unable to do the work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great College with caring administrators", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Aug 2015", "job_title": "Online Instructor in San Francisco, CA", "duration": "N/A", "pros": "I have a lot of positive feelings about my experience with Heald College.  The staff consistently demonstrated nothing but caring and concern regarding students and their academic experience.  Administration constantly offered in-service sessions that I found educating and challenged me to do more in my class.", "cons": "CCI purchased Heald College back in 2010 and because of the Department of Education and an unreasonable California Attorny General, this college that was open for 100years closed."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "taught  English & Business", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Nov 2012", "job_title": "Instructor in Hayward, CA", "duration": "N/A", "pros": "Heald provides structure and basic education to the most disadvantaged students in the East Bay. Teaching there is very rewarding because the students appreciate teachers who respect them and are sincere in their desire to help them improve their lives.", "cons": "Students leave with huge debt they can never repay because most still are unemployable, and even if they got a job, the jobs for which they may qualify are very low paying. Academic management is unqualified because the college is primarily concerned with making money from enrollment.  Quality of instruction is an afterthought."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Intense, Intense, Intense", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Jun 2014", "job_title": "Admissions Advisor in Salinas, CA", "duration": "N/A", "pros": "Benefits were excellent and great co-workers.  The faculty truly cared about the students and wanted all to succeed and that was quite refreshing.", "cons": "Poor work life/balance and hated being told to work a Saturday (on Thursday) because we were behind run-rate.  Unfair at times how walk-ins were handled, too."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Could have been so much better...", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 May 2014", "job_title": "Dean of Business Programs in Salinas, CA", "duration": "N/A", "pros": "I worked with some good, dedicated people.  Some instructors were great.  Many of the students tried hard, and sincerely wanted to get an education.", "cons": "Too much in the way of politics.  Having to call students at home who don't come to school.  Upper management only cares about money, not students.  They sell getting a degree in eighteen months, at MUCH more cost than attending a community college and attending just six months longer.  Constant turnover in staff."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "The work hours were unrealistic. You are expected to work 9 am - 9 pm for weeks at a time.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Sept 2011", "job_title": " in Stockton, CA", "duration": "N/A", "pros": "Very nice and friendly employees.", "cons": "No work / life balance. High turnover in upper management. Incompetent co-workers, but got the job through friends/relative referral. This leads to favoritism within departments by Directors and Supervisors."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Compnay sucks, pay sucks, students suck. Dont waste your time.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Oct 2012", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "The only pro's I can address are that you might find some good co-workers, but overall all the majority of the staff are lazy and content with life. They beat around the bush and finger-point to the next person.", "cons": "I don’t know where to start?...I don’t know which one is worse, the students or the FOR PROFIT corporation? Let me be straight and honest, the students at Heald College or any other for profit institution are a joke. I have never met a lazier group of so called, “students”. These students couldn’t even pass a class if you were handing out A’s. You pretty much have to babysit adults and listen to their endless complaints and issues. The students do not know how to take responsibilities for their actions and are always looking for a easy way out or handout. Heald feels more like a daycare then a so called “College”. I have seen more physical fights between the students, then at a rowdy bar! The students do not appreciate anything and are so ungrateful for your time and effort in trying to find them a job/career/education…ect. Overall, since I have worked with these students/adults  and seen how difficult they are and I truly believe they deserve to get ripped off for a Heald certificate or so called “Degree”. \r\n\r\nNow for the Heald, this place is nothing more then a chop-shop. They specifically target, market and pray for under-classed minorities. I am so disgraced and disgusted that this place is only open for MONEY. They don’t care if any of their students get hired, the only thing they care about are the NUMBERS! All you hear is, “what are your numbers? What is your conversation rates? How many calls have you made?”....ect…This place could care less about it’s students as well as their own employees. They beat down on their employees to make a profit and rip off their students to make a profit.  They expect you to dedicate your life to them, as if they were doing you a favor of having a job. The pay is awful and the hours suck!  \r\n\r\nMessage for students….DONT ATTEND ANY FOR PROFIT SCHOOL\r\nMessage for future employees….GET IN AND GET OUT! This place will suck you dry and use your soul to fill their wallets!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor administration", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Jan 2014", "job_title": "Instructor in Roseville, CA", "duration": "N/A", "pros": "Reaching out to students; changing lives", "cons": "Poor communication, more work/tasks placed on instructors, canceling classes without notifying instructor-no compensation or additional hours offered after prepping for a completely new class. My director didn't know what some of the content was or meant.. Very scary! She said to just do your best..."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Wonderful people, sad to see it end!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "15 May 2015", "job_title": "Anonymous Employee in Honolulu, HI", "duration": "N/A", "pros": "Heald was a great place to work.  We made a difference in a niche market of students who did not typically perform well in traditional settings.  It was a wonderful place to grow with management who cared about your personal and professional success.", "cons": "Poor work life balance due to needing to constantly be available to service students at all hours."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Heald College or Heald Degree Mill?", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jun 2008", "job_title": "Instructor in Honolulu, HI", "duration": "N/A", "pros": "The students represent a population that is needy, motivated and hard-working. Seeing them grow and transform over their time in school is humbling. Many of the faculty and staff have good working relationships and show respect and kindness toward each other and the students - in spite of the local and corporate administration.", "cons": "There have been multiple, dramatic changes over the past ten years (six different - sometimes corrupt - presidents).  The newest 'takeover' (Aug, 2007) is by a for-profit LLC that governs strictly top down and has shown no interest in academic quality or employee retention - only in profits (increasing the numbers of students enrolled, and lowering costs).  They have also allowed entrenched administrative 'leaders' to perpetuate the vacuum of responsibility that prevents even any local changes or improvements."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Nice place to work.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Jul 2011", "job_title": "Instructor, College Or University in Honolulu, HI", "duration": "N/A", "pros": "The staff and leadership were kind and supportive; the students were very interested in learning. Everything needed was located onsite.", "cons": "The lack of available parking was a negative.  Also, the curriculum was very structured, with very little room for academic freedom."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Downsized after purchase by consortium", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Aug 2014", "job_title": "Director of Facilities Maintenance, Safety and Security in Fresno, CA", "duration": "N/A", "pros": "Started as a small-school environment and was happy to be part of a school helping young men and women get ahead.", "cons": "The school was purchased by Corninthian Colleges and the small-school atmosphere was replaced by a corporate mindset.  My position was eliminated and my tasks were absorbed by others."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Good Experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Feb 2012", "job_title": " in Rancho Cordova, CA", "duration": "N/A", "pros": "Faculty and Staff are passionate about the students.\r\nFacilities are extremely well cared for and the company is great about investing in resources for the students.\r\nOverall Staff is fun and works together for the benefit of the students.", "cons": "Tough to take time \r\nWork/Life Balance \r\nTechnology resources"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Some great people, terrible overall culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2015", "job_title": "LRC Coordinator in Salinas, CA", "duration": "N/A", "pros": "My immediate coworkers were great, as were some others at the school, and many instructors were really amazing and clearly cared about their students deeply. \r\nMost of the students were also great, and helping them to succeed after they had struggled in traditional academic environments was very rewarding. There are a lot of students there who are genuinely trying to turn their lives around and are willing to work hard to do so.", "cons": "I started at Heald as it was really transitioning from a non-profit career college to a for-profit after being bought by major for-profit chain Corinthian Colleges. What seemed to have formerly been a respected option for non-traditional college students was rapidly decaying into a money-grubbing organization that valued profits first and employees and students last. Techniques used to squeeze every penny out of students included adding on extra coursework than was originally implied and creating such difficult \"test-out\" exams for basic classes (i.e. Microsoft Word) that even an expert would be hard-pressed to pass. The \"admissions officers\" are salespeople pushing expensive education programs on students who often don't have the savvy to recognize false promises and grasp the amount of student debt they may end up with. The school promised that certain classes would transfer to the CSU or UC system that did not.\r\nAlthough a few of the people in upper management were genuinely good people, many of them - and much of the overall staff - was so cliquey it reminded me of high school. Things were not managed well and there was a lot of gossip and stabbing coworkers in the back.\r\nThere was no work-life balance, in that we were expected to work an odd or erratic schedule (i.e. starting very early some mornings and staying until 10:00 some nights),  yet there was no flex time on the employees' end (for instance, on \"Graduation\" nights we were expected to work regular hours, and take a 2 hour or longer lunch in order to not surpass 8  hours/day including the evening graduation, but if you ever wanted flexible hours to accommodate a doctor's appointment or something, forget it."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Legal Director", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Jun 2015", "job_title": "Anonymous Employee in Stockton, CA", "duration": "N/A", "pros": "I worked with a very good team. My boss was an efficient and caring leader. The benefits were good. We all got along very well.", "cons": "The parent company was only concerned about money. The constantly raised tuition. They always talked about retention. Academic standards were watered down under the parent company."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Adjunct Faculty", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "1 Sept 2016", "job_title": "Criminal Justice Instructor in Stockton, CA", "duration": "N/A", "pros": "Part time paid great, schedule was nice, good support from management.", "cons": "They went out of business."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good but can be very stressful and do not plan on having much time off.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jun 2011", "job_title": " in Roseville, CA", "duration": "N/A", "pros": "The people are great!  Loved working with students.", "cons": "The hours.  Sometimes didn't feel any appreciation for the job you did because they always wanted more.  Don't plan on having much time off. Bottom line..this job is about #'s!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Prob not again", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Apr 2016", "job_title": " in Fresno, CA", "duration": "N/A", "pros": "This was a flexible role where I was able to learn alot and still attend school and get my bachelors degree. I was able to work an additional job without having a conflict of interest. i did", "cons": "I think that there was a lot of room for improvement. People often would not act professionally and wouldn't recommend working there."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid working.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Mar 2015", "job_title": "Program Director in San Jose, CA", "duration": "N/A", "pros": "People are not held accountable for their actions so if you are someone who likes to get away with not doing your job you will love it here.", "cons": "No one is held accountable for their actions.  If you actually care about what you are doing you have a lot of work dumped on you to compensate for employees who always make excuses."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible Company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Apr 2013", "job_title": "Anonymous Employee in Milpitas, CA", "duration": "N/A", "pros": "You become close with your colleagues. You get to help students that want a better life", "cons": "They do not care about their employees.  Mandatory Overtime, 12, 13, 14 hours a day. Sometimes until 11pm.  Holidays are non existent, basically the same schedule as the mall.  Some of the students they enroll are iffy, they literally pick them up from the streets and enroll them."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Glad they closed, sad for students & for employees who really were investing in students' lives.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Jun 2015", "job_title": "Admissions Advisor in Hayward, CA", "duration": "N/A", "pros": "It was a large pay increase from previous job with great medical benefits.", "cons": "Everything else. There was a lack of work-life balance, we worked 50+ hours a week, consistent pressure for numbers and management consistently under-minded staff and built up stress on staff. During my 18 months of working there out of a staff of 18 people, 3 had to go on leave for no less then 8 weeks because of being over stressed."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Good pay and benefits but that's about it", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Sept 2014", "job_title": "Career Services Advisor in Hayward, CA", "duration": "N/A", "pros": "The pay and benefits are good", "cons": "Upper management is terrible. No room for advancement. No collaboration between departments. Annual increases are minimal if anything. Practices at this college are sketchy it's not surprising the mess their in."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to work before the unfortunate shut down", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 May 2015", "job_title": "Anonymous Employee in Milpitas, CA", "duration": "N/A", "pros": "Pay, Benefits, Staff and Faculty, Students.  Overall a good school for what it did.  It's a shame that it no longer exist.  RIP Heald.", "cons": "Corithian Colleges taking over and ultimately ruining a college that has been around for over 150 years."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great History, CCI was not good for it", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Oct 2015", "job_title": "Admissions Advisor in Sacramento, CA", "duration": "N/A", "pros": "Great co-workers. It was rewarding to see see students who wanted to succeed really benefit from the education and the programs.", "cons": "It became a for-profit institution after CCI took over, and this was the worst thing that could have happened to Heald College"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "educational", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Apr 2011", "job_title": "IT Technician in Rancho Cordova, CA", "duration": "N/A", "pros": "The company is very foward looking and spends the time to make sure you are trained proplery and you get free schooling after you are benefited.", "cons": "The salary is low compaired to a standard IT technicians salary. I would assume you could make more working for a IT consulting company."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Many Changes", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Apr 2014", "job_title": "Financial Services in San Francisco, CA", "duration": "N/A", "pros": "Heald has some very good people working there. You can learn a lot and get some good experience.", "cons": "Since they were bought out by Corinthian Colleges there have been lay offs every year. Enrollment is also declining which leads to lay offs. Not a very stable employment at this time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Horrifying Experience - PLEASE READ", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Oct 2013", "job_title": "Admissions Advisor in Milpitas, CA", "duration": "N/A", "pros": "- \"Chance to change the quality of prospective student's lives\"\r\n\r\n-  Respect from the students\r\n\r\n-  Bonding/friendship amongst coworkers", "cons": "- Only concerned about $, not students\r\n- Forced students into outrageous student loans\r\n- Cold Calling to repetitive prospectives that have stated, \"DO NOT CALL\"\r\n- Continual harrassment of peoples phone numbers\r\n- Management doesn't know how to do their job so they take it out on you\r\n- Mentaliy of staff is that of middle/high school"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "My home away from home", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Nov 2015", "job_title": "Front Desk Assistant in San Francisco, CA", "duration": "N/A", "pros": "a comfortable environment, professional demeanor while at the same time making us laugh while attending school. great teachers, great staff and faculty.  my entire experience has been a memorable experience that I will take with me.", "cons": "no cons from what I remember."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Job Environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Aug 2016", "job_title": "FINANCIAL AID ANALYST/ADVISOR in Madera, CA", "duration": "N/A", "pros": "I got to work with great people and liked working with students", "cons": "A corporate corruption that only bought Heald College because it was a profitable school. They then changed the business model to match other less successful operations they own, thus reducing the effectiveness. Line managers got so much pressure to conform that they created a job protection environment and let people go on a whim."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "as an employee, it has been nice", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2013", "job_title": "Tutor in Fresno, CA", "duration": "N/A", "pros": "family style environment, lots of events to get to know eachother", "cons": "with budget cuts, those things all ended, even though tuition went up for students"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "typical trade school", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Dec 2013", "job_title": "Admissions Advisor in Hayward, CA", "duration": "N/A", "pros": "Great pay but that's about it.", "cons": "High end sales without commission. They talk about empowering people but with the exception of a had full of staff members, it's all about meeting the numbers regardless of the students personal interest."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Full time Psychology and Gen Ed. Instructor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "17 Dec 2015", "job_title": "College Instructor in Hayward, CA", "duration": "N/A", "pros": "Great colleagues and a very rewarding teaching experience.", "cons": "Was owned by Corinthian which turned out to be a very unethical company and because of this, the college was forced to close."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Oct 2012", "job_title": "Adjunct Faculty in San Francisco, CA", "duration": "N/A", "pros": "Students are motivated in spite of hardships.\r\nWASC Sr. accreditation.", "cons": "Pay is lower than competing colleges. However, it is more fulfilling work than with their competitors."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Micro-Managed", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jul 2015", "job_title": "Program Director in Salinas, CA", "duration": "N/A", "pros": "Great people to work with, very student centered. It was inspiring working with the students in achieving their success", "cons": "All about numbers and money. Too many changes, little training, expect a lot for little pay"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "It has been a pleasure to work at Heald College", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jan 2013", "job_title": "Anonymous Employee in Hayward, CA", "duration": "N/A", "pros": "Working with academics department staff including the advisors and program directors are one of the best experiences I had.", "cons": "Long hours of work at some point every quarter."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "A positive experience as long as student enrollment is up", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Mar 2015", "job_title": "Instructor in Rancho Cordova, CA", "duration": "N/A", "pros": "Schedule flexibility, great coworkers, enthusiastic and motivated students", "cons": "Terrible management, fear-based company culture"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Heald College has gone away...", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Nov 2015", "job_title": "Instructor, College Or University in Stockton, CA", "duration": "N/A", "pros": "Helping students, getting things done with wonderful co-workers, fun gatherings and events.", "cons": "After 152 years in education, the company ceased all operations."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Heald not CCI", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Apr 2015", "job_title": "Network Technician in San Francisco, CA", "duration": "N/A", "pros": "Coworkers were like family. The Heald family. Good learning environment. Good IT group.", "cons": "Corinthian Colleges, Inc. No bonuses. No raises. Pay freeze. No promotions. Hard to get time off. Needy schedule."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Director", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 Jan 2016", "job_title": "Business Site Developer/Director of Recruitment/Regional Director in San Francisco, CA", "duration": "N/A", "pros": "To be able to change lives and help so many students earn income to feed their families", "cons": "No cons except that Corinthian colleges bought us and run us to the ground"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great school to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Mar 2015", "job_title": "Busy and Fun in San Francisco, CA", "duration": "N/A", "pros": "Friendly staff, great students, good benefits!", "cons": "Not enough hours in the day to enjoy the atmosphere of learning!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Medical Instructor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Jul 2013", "job_title": "Instructor in Salinas, CA", "duration": "N/A", "pros": "helping students the students getting ahead", "cons": "management changing and rule changing on a daily"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "great people to work with but no where to go", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jul 2014", "job_title": "Adult Admission Advisor in Sacramento, CA", "duration": "N/A", "pros": "The employees and Campus President", "cons": "no upward mobility, late hours"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible work enviroment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Jul 2015", "job_title": "Admissions Assistant/Front Office Coordinator in South San Francisco, CA", "duration": "N/A", "pros": "I enjoy helping the students other than that the job and the company was horrible.\r\nBad management from top to bottom, no one cared about anything but enrolling as many students as they can.", "cons": "Everything from top to bottom management is bad! I left in 2009 not 2011"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Pros and Cons", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Sept 2015", "job_title": "Director of Research in Modesto, CA", "duration": "N/A", "pros": "I n n o v a t i v e.", "cons": "No longer in e x i s t e n c e."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Adjunct Professor", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Sept 2015", "job_title": "Business and English Adjunct Professor in Salinas, CA", "duration": "N/A", "pros": "Great staff and faculty.", "cons": "Parent company forced the closure of the college."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Loved teaching", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Apr 2015", "job_title": "Adjunct Instructor in Roseville, CA", "duration": "N/A", "pros": "Students were fabulous.  Eager to learn", "cons": "I had to work at night on occasion, but all in all, I loved it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Engaging & challenging", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Feb 2016", "job_title": "Adjunct Professor in San Jose, CA", "duration": "N/A", "pros": "Opportunity to work with and inspire people.", "cons": "Many of the students were not motivated to perform well"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "You work hard so others can slack off", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Apr 2013", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Benefits are good, salary is decent.", "cons": "Working 12 hour shifts at the beginning if each quarter, and I wasn't allowed a break. The harder I worked, the more my co-workers slacked off."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Pleasant", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 May 2012", "job_title": " in Concord, CA", "duration": "N/A", "pros": "Heald College has great teamwork", "cons": "The workload is abundant and can use some shaving"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not Surprised By The Latest News", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jul 2014", "job_title": "Admissions Advisor in San Francisco, CA", "duration": "N/A", "pros": "If all you want to do is work, work, work and no desire for outside life then Heald is your place", "cons": "Let's see where I can start: No work life balance, too many unqualified people in key positions, outdated sales tactics, etc........."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Heald College", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Aug 2015", "job_title": "Human Resources Designaye in Roseville, CA", "duration": "N/A", "pros": "Great atmosphere working with faculty and employees who have a common goal of helping students succeed.", "cons": "Company closed as of April 2015."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Director", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Jun 2016", "job_title": "Director in San Francisco, CA", "duration": "N/A", "pros": "Nice place to work. Clear expectations", "cons": "It's a machine and it's was closed"}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "It's a stepping stone", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Dec 2013", "job_title": "Admissions Advisor in Honolulu, HI", "duration": "N/A", "pros": "Nice people and good location to shops and restaurants", "cons": "No room for growth, low salary, no raises or bonuses, benefits are ok."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "For Profit Education is a tough business", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jul 2015", "job_title": "Admissions Advisor in San Francisco, CA", "duration": "N/A", "pros": "Not too many goo things to say.", "cons": "Felt unethical, like you were stealing money from the students."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Admission Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "18 Jan 2016", "job_title": "Admissions Advisor in San Francisco, CA", "duration": "N/A", "pros": "Love working with students..assisting in shaping their future", "cons": "sad they went from non profit to profit...was it greed?"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Toxic Environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 May 2014", "job_title": "Admissions Advisor in Fresno, CA", "duration": "N/A", "pros": "Co-workers are fun, great people", "cons": "Management is terrible and disengaged"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Environment, but hardly opportunities for advancement(compensation-wise)", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 May 2015", "job_title": "Admissions Advisor in Rancho Cordova, CA", "duration": "N/A", "pros": "-Great Work Environment\r\n-Decent Bridging between Departments", "cons": "-Bad Marketing\r\n-Corporate under the thumb of Parent Company, bad business decisions"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "PT Adj Instructor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jul 2015", "job_title": "Adjunct Instructor in Concord, CA", "duration": "N/A", "pros": "Excellent support from all in admin and tech(IT)", "cons": "school closed by DOE on April 28, 2015"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Director", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "2 Feb 2018", "job_title": "Director in Honolulu, HI", "duration": "N/A", "pros": "Good place to work--great for students", "cons": "None--the company closed unfortunately--Good employees"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Financial Aid Advisor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Apr 2015", "job_title": "FAO in San Jose, CA", "duration": "N/A", "pros": "Great Coworkers. Great students. Community there is good.", "cons": "Ridiculous Hours. Forced to work overtime and barely any time off."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "admission advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Jul 2015", "job_title": "Talent Acquisition in Patterson, CA", "duration": "N/A", "pros": "assisting students with careers and education", "cons": "college closed down without notice to faculty and students"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best experience, ever!!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "28 Apr 2015", "job_title": "Full Time Faculty in Rancho Cordova, CA", "duration": "N/A", "pros": "Family environment, student centered, sucess. 152 years, Heald Strong", "cons": "Long hours, busy, and it closed yesterday"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "A great place to grow", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "1 May 2015", "job_title": "Instructor, College Or University in Honolulu, HI", "duration": "N/A", "pros": "Good pay and nice campus", "cons": "Working in paradise is not so great"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Federal Work Study", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Mar 2016", "job_title": "Administrative Assistant in Antelope, CA", "duration": "N/A", "pros": "I would be able to work around my school schedule", "cons": "I was always at school."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Teacher", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "21 Apr 2015", "job_title": "Anonymous Employee in Stockton, CA", "duration": "N/A", "pros": "Some good associates; some good benefits", "cons": "Management did not believe in their teachers."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Overall", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Aug 2015", "job_title": " in Honolulu, HI", "duration": "N/A", "pros": "Great boss, location in town.", "cons": "Lack of management support, no room for growth, and workers work in cliches."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Program Director", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Jun 2015", "job_title": "Program Director in Brentwood, CA", "duration": "N/A", "pros": "Great Place to work. Great team and great students.", "cons": "Unfortunately the school was closed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Best Place of employment ever", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Aug 2015", "job_title": "Medical Instructor in Modesto, CA", "duration": "N/A", "pros": "Great people, wonderful support staff amazing management.", "cons": "The place closed down"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Admin", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Aug 2015", "job_title": "Administrative in Rancho Cordova, CA", "duration": "N/A", "pros": "I liked working there it was great", "cons": "I hate that the company closed"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Hmmmmmm", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 May 2015", "job_title": "Anonymous Employee in Stockton, CA", "duration": "N/A", "pros": "Used to be a great educational institution", "cons": "Company is closed down because of legal issues"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Students are s", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Oct 2013", "job_title": "Instructor in Stockton, CA", "duration": "N/A", "pros": "The students are wonderful, the programs are dynamic and provide real world experience", "cons": "Management couldn't manage themselves out of a paper bag with a road map and a flashlight"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good For Me!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Jul 2014", "job_title": "LLRC Coordinator in San Francisco, CA", "duration": "N/A", "pros": "Colleagues, Benefits, Time Off, Students", "cons": "Monotony, Promotion, Pay, Teamwork, Students"}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "So So", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 May 2014", "job_title": "Career Services in San Francisco, CA", "duration": "N/A", "pros": "Stuent Focus Culture (at the beginning)", "cons": "Too much Upper Management Change since Acquisition"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "So much potential to help students, but the administration needs to feel the same level of commitment as the instructors", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jul 2014", "job_title": "Adjunct Instructor in Salinas, CA", "duration": "N/A", "pros": "Help a student population that is frequently overlooked.  Most of the instructors are committed and enthusiastic about helping the students.", "cons": "Management, room for advancement, salary"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Teaching", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 Aug 2015", "job_title": "Anonymous Employee in Fairfield, CA", "duration": "N/A", "pros": "Very good and happy teaching environment", "cons": "Commute was terrible daily task"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Teacher", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jul 2018", "job_title": "Teacher in Salinas, CA", "duration": "N/A", "pros": "It was a well run academic department", "cons": "The school closed cause of predatory practices"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Instructor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "20 Jun 2015", "job_title": "Information Technology Instructor in Concord, CA", "duration": "N/A", "pros": "Like to help students with new careers", "cons": "Management was not very motivating"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Administration asst.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Nov 2016", "job_title": "Anonymous Employee in Salinas, CA", "duration": "N/A", "pros": "Free education, paid holidays. Wonderful campus president.", "cons": "Horrible upper management. Only cared about the number."}]]