[[{"date": "23 Feb 2022", "title": "Donor Experience Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Second Harvest of Silicon Valley (San Jose, CA)", "Interview Descriptions": "The process took quite some time and spanned several months.  There were multiple panel interviews along with singular in person interviews and phone screens.  All of the interviews were standard and there weren't any questions I wasn't anticipating but one of my panel interviews had more than three people so it was a little more intense than I'm used to.", "Interview Questions": "Why Second Harvest?  What other non-profit work have you done?"}, {"date": "11 Dec 2020", "title": "Senior Social Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Second Harvest of Silicon Valley (San Jose, CA)", "Interview Descriptions": "Seamless and Hands-On Interview Process\r\n\r\nThe interview process for a marketing position with Second Harvest of Silicon Valley took roughly about a month. It consisted of a preliminary phone screening, two-panel interviews, and a brief project prompt. Everyone I met with from the organization was friendly and hands-on throughout the interviewing process. They were kindly willing to answer all of my questions and got back to me in a timely manner.\r\n\r\nIf you are looking to bring your talents to an organization that is working together for the common good, this is the place!", "Interview Questions": "1. Tell us about yourself.\r\n2. Why Second Harvest?\r\n3. Why are you looking to leave your current position?\r\n4. How do you manage the prioritization of tasks? How would you manage and prioritize requests from different departments?\r\n5. Tell us about a successful marketing campaign you have run in the past."}, {"date": "24 Jun 2019", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Second Harvest of Silicon Valley in Mar 2019", "Interview Descriptions": "I got an online test first. It has 5 questions and took me 2-3 hours to finish it. Then after one week, I got a phone interview for 30 mins. Went through the resume and asked some details in my previous experience, and asked some questions related to data analysis. No very technical.", "Interview Questions": "Do you have any experience regarding collecting data from different sources? What is your favorite part of data analysis?"}, {"date": "4 Nov 2018", "title": "Senior Marketing Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Second Harvest of Silicon Valley (San Jose, CA) in Oct 2018", "Interview Descriptions": "Phone interview followed by team interview. 3 levels from team interviewed in conference room. Phone interview with hiring manager, panel with hiring manager, boss and team member. A little general on questions.", "Interview Questions": "General Background\r\nDescribe marketing campaigns you have previously managed"}, {"date": "6 Aug 2019", "title": "Brand Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Second Harvest of Silicon Valley (San Jose, CA) in Sept 2017", "Interview Descriptions": "Interviewed in-person first with a team member, then with the hiring manager. General brand/marketing management questions. Came back for another interview with VP, but did not result in a job offer.", "Interview Questions": "Experience in managing projects and in managing teams."}, {"date": "30 Aug 2017", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Second Harvest of Silicon Valley (San Jose, CA) in Aug 2017", "Interview Descriptions": "The interview process was extremely professional. I submitted a cover letter online and received an automated message that they would be back to me in a few weeks. I got an email 3 weeks later about setting up a time for an in-person interview. Went to the HQ to interview with the whole marketing team in a panel style interview. The interview lasted about an hour.", "Interview Questions": "What would your previous employer/coworkers say about you? "}, {"date": "2 Sept 2016", "title": "Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Second Harvest of Silicon Valley", "Interview Descriptions": "Long process and did not even have the respect to email me when I was no longer in the running. I emailed them as they were not planning on doing so.", "Interview Questions": "What would you do if you were too busy to get anything done because you were on the phone?"}, {"date": "25 Apr 2016", "title": "Donor Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Second Harvest of Silicon Valley (San Jose, CA) in Mar 2016", "Interview Descriptions": "Immediately got a response the next day after applying. Had a 30min phone interview the following week, and then a one-to-one interview with the same person after that. It was very easy going and relaxed. The hiring manager was very friendly and easy to talk to. Thought I was scheduled to have a 3rd panel interview but it took awhile to get back to me and found out they went with someone else.", "Interview Questions": "What do you already know about this position?\r\nWhy SHFB?"}, {"date": "21 Aug 2017", "title": "Business Applications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Second Harvest of Silicon Valley (San Jose, CA) in Feb 2015", "Interview Descriptions": "It took a long time from my initial online submission before I heard a response, but fortunately for me there was a phone screening then two in-person interviews.  During the first in-person interview it was with a panel of five employees at once.  The second panel was four employees.", "Interview Questions": "What would I do if a user came to me with a report that didn't work."}, {"date": "10 Jan 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Second Harvest of Silicon Valley (Santa Clara, CA) in Jun 2014", "Interview Descriptions": "I sent an email and we set up for an interview the following day. It was very brief normal interaction and later I was told to fill the form stating my enrollment as ac volunteer.", "Interview Questions": "Tell me about your self?"}], [{"date": "10 Aug 2015", "title": "Calfresh Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Second Harvest of Silicon Valley (San Jose, CA) in Jun 2012", "Interview Descriptions": "It was a 3 part interview: Phone interview and 2 in person interviews. There was also a language test which was a written and speaking part with one of the bilingual staff.", "Interview Questions": "How do you handle a situation with clients? A scenario was given"}, {"date": "6 Sept 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Second Harvest of Silicon Valley (Spokane, WA) in Jan 2011", "Interview Descriptions": "There was no formal interview, I heard about these opportunities through word of mouth such as church services asking for volunteers as well as school advisors who would announce when events were taking place, transportation options, meeting time, etc.", "Interview Questions": "Why do you want to volunteer?"}]]