[[{"date": "22 Apr 2023", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "it was short and easy, not very complicated, relaxed and in a coffee shop. I don't really have a lot more to say that that, overall fairly typical; it's really hard to fill up the required word allotment", "Interview Questions": "N/A"}, {"date": "10 Dec 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish in Dec 2022", "Interview Descriptions": "Submit online application and had to complete computer generated interview to ask about qualifications. Then scheduled in person interview for about a week later. I found out I got the job within a few days of the interview", "Interview Questions": "What are three things I look for in a workplace"}, {"date": "26 Oct 2022", "title": "Associate Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "Professional but relaxed -- I had already known the interviewer so it was not as high stressed. It was a long conversation, question and answer and discussion format. We met over Zoom but the interview was during the Pandemic so that may have changed by this time.", "Interview Questions": "Tell me about your previous work experience"}, {"date": "8 Sept 2022", "title": "RN New Grad Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "I was interviewed in a panel with 5 people. They each took turns asking me questions. It was straight forward. Mostly behavioral questions and 1 question about nursing. I got asked about my definition of teamwork, tell me a time when... type of questions.", "Interview Questions": "Tell me about a time: \n... when you went above and beyond for a patient, \n... when you had a difficult patient and what did you do\n... when you made a mistake. \n\nHow do you define teamwork? \nWhat was your least favorite and most favorite clinical rotation?"}, {"date": "9 Oct 2022", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish in Sept 2022", "Interview Descriptions": "Questions were straightforward. Recruiter was easy to talk with, and allowed the opportunity for interviewee to ask as many questions as they would like. Recruiter also was open to receiving questions after the interview via email if there were any outstanding issues.", "Interview Questions": "How would colleagues from your most recent position describe you as?"}, {"date": "13 Jul 2022", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "I had interviewed with Shannon and she was very kind, she was thorough with her questions but was very patient while I figured my answers out. She was very communicative and got back to me in a very quick time frame", "Interview Questions": "1. What do you think you can offer to the team?"}, {"date": "11 Aug 2022", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Jul 2022", "Interview Descriptions": "Had interviews for several roles. First one the interviewer no showed. The second one they sent a cancelation email with no option to re-schedule. I sent several follow up emails and no one bothered to respond. I had a phone interview and the interviewer sounded bored and annoyed. Maybe the interviewer was having a bad day. I would not re-apply in the future as the company seems to not care about applicants at all.", "Interview Questions": "Standard STAR type questions were asked "}, {"date": "14 Jun 2022", "title": "PCC Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish", "Interview Descriptions": "The hiring process took about 3 weeks. The interviews were very easy and conversational. There were two rounds of interviews, first with the hiring manager and then with members of the team", "Interview Questions": "What relevant experience do you have"}, {"date": "3 Jun 2022", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Swedish (Seattle, WA) in Jun 2022", "Interview Descriptions": "I passed all he interview process and was given an interview time slot for several units just to be cancelled a few days ahead and be told that the hospital doesn't sponsor visas. I explicitly told them I required sponsoring throughout the application process and they decided to not tell me until the VERY last step.", "Interview Questions": "N/A"}, {"date": "31 May 2022", "title": "RN Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Edmonds, WA) in May 2022", "Interview Descriptions": "I applied to an RN fellowship position at Swedish Edmonds childbirth center. A day later, I received an invite to schedule an interview. I originally scheduled on a certain day, but they canceled and told me they can't do it on a holiday. I rescheduled, got time approved off of work, and checked my email an hour before the interview only to see that they canceled it last minute without the option to reschedule. This seemed very unprofessional to me and I am glad I happened to check my email to see the cancellation.", "Interview Questions": "N/A"}], [{"date": "28 Oct 2022", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Mar 2022", "Interview Descriptions": "Applied online, received an email from HR about setting up an interview with the hiring manager. Meeting was over zoom and was approximately an hour in length for the entirety of the interview. we went over the job description before asking me questions. I was given the offer fairly soon after. Either same day or the next day", "Interview Questions": "Q: Strengths/Weaknesses Q: Why work at Swedish? Q: Why are you interested in working in the ICU setting?"}, {"date": "17 Feb 2022", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Recruiter was wonderful but the management team seemed disinterested and wanted to rush the interview. It was a Friday before a three day weekend. So that could have been the reason for the rush.", "Interview Questions": "Have you had any difficulties with any coworkers and how did you handle it. "}, {"date": "10 Jan 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "First interview with HR over the phone and then are scheduled to in person interview with unit manager and nurses. I interviewed with panel of nurses and manager. Heard back relatively quickly.", "Interview Questions": "Tell us a time you went above and beyond"}, {"date": "19 Oct 2021", "title": "Regulatory Affairs Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish", "Interview Descriptions": "Three rounds. First text round, second phone interview, and third the second round. The interview process is average. The HR team is excellent and friendly. They want to know how your experience and mindset align with their environment.", "Interview Questions": "Tell me about yourself, Why do you want this role?"}, {"date": "28 Nov 2021", "title": "RN Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Oct 2021", "Interview Descriptions": "Difficult to connect with hiring manager due to lack of communication with recruiter. Interview was very straight forward- no really difficult questions to answer. Very straight forward and prompt response for offer.", "Interview Questions": "What are your greatest strengths? I actually cant remember one that was anything different than the general interview questions that you can g**gle. "}, {"date": "25 Feb 2022", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Sept 2021", "Interview Descriptions": "Applied for the role on company website. Got an email around 3 months later to schedule a video interview. The video interview lasted about half hour, questions generally about past roles and how I would react to distressed patients coming into the clinic and teamwork. Got an offer email a few days later.", "Interview Questions": "Past roles/experiences, how would you handle patients that are distressed"}, {"date": "1 Jul 2021", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "Standard behavioral questions in less than an hour. Be ready with scenarios of past health care experiences and you will be fine. Takes 45-60 minutes. Got a response within 2 weeks.", "Interview Questions": "Name a time you went above and beyond."}, {"date": "1 Jul 2021", "title": "Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Swedish (Seattle, WA) in Jun 2021", "Interview Descriptions": "I applied online then got to interview with the clinical nutrition manager. The process went smoothly. It was a structured interview with a lot of behavioral based questions. She was really nice and told me how things work and what kind of training they provided to newly hired dietitians.", "Interview Questions": "Why do you want to take this job"}, {"date": "1 Jun 2022", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Apr 2021", "Interview Descriptions": "There was a lengthy wait time for an interview. The interview itself was very welcoming and helpful to get a picture of what the job requirements would be. Once the interview was complete, it was only a matter of time before I knew I had gotten the job.", "Interview Questions": "Why are you interested in this position?"}, {"date": "9 Jun 2021", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Swedish (Seattle, WA) in Apr 2021", "Interview Descriptions": "Online, self-paced interview where you record your responses to questions that are given to you at that time. It's nice because you get to think of your responses before recording and you can re-record your response as often as you'd like.", "Interview Questions": "Why are you a good fit?"}], [{"date": "16 Mar 2021", "title": "Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "Sit down, relaxed and casual interview process. Comfortable discussion in a non-pressure atmosphere. Made it easy to talk about the job position with ease and to talk about experience and what to expect from the job position.", "Interview Questions": "Where do you see yourself in five years from now?"}, {"date": "11 Aug 2021", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Feb 2021", "Interview Descriptions": "It was pretty straight forward, filled out online, phone, then waited to hear back from them. I did not get the job but it was overall a good experience. I did enjoy working with HR they were quick to respond.", "Interview Questions": "Why do you want to work here, why are you leaving your current position. "}, {"date": "9 Jun 2023", "title": "Quality Control Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Swedish (Seattle, WA) in Jan 2021", "Interview Descriptions": "The interview started with a phone call interview with the manager. After that, there was an in-person panel interview with a tour of the campus and meeting individuals at the hospital.", "Interview Questions": "Why do you want this role rather than the current role you are in?"}, {"date": "25 Jan 2021", "title": "Patient Services Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Dec 2020", "Interview Descriptions": "On two different occasions and for two different job postings I had virtual interviews scheduled with no shows. I would then email and let them know that no one showed up to interview me and then it would take at least week to schedule another interview. Very lame and a waste of my time and energy.", "Interview Questions": "What does delivering excellent patient care mean to you?"}, {"date": "5 Nov 2020", "title": "Business Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish in Oct 2020", "Interview Descriptions": "Relatively easy interview. Classic questions.\nBoth of the managers were late to the zoom meeting.The hiring manager clearly stated that a specific healthcare software, Epic, is crucial for the role. It was not mentioned in the job description as advertised. \nThey asked for 5 people to fill out a reference survey before the first interview.  They received the reference information in detail before they spoke with me.\nTwo weeks after the interview, I asked for a feedback. They said they are still interviewing the other candidates and I am still considered for the role. Same thing happened in 3rd week. In the 4th week, when I asked a feedback (or at least an official refusal decision at that moment) they got silent. \nI sent a withdrawal email in the 4th week. In my 13 years of business experience, I saw many unprofessional organizations. I have never seen anything like that.", "Interview Questions": "What data management software have you used in the previous roles?"}, {"date": "26 Aug 2020", "title": "Manager, Clinical Research Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Jul 2020", "Interview Descriptions": "An HR rep called pretty quickly.  Instead of emailing and scheduling a time to speak for 30 minutes, she called and launched in to questions that are more typical of a longer interview.  (Describe a  time you  met a challenge;  Tell me about a time you dealt with a difficult colleague; the standard list)  She responded to some serious responses with \"ok no worries\" or \" no problem\" and seemed to be rushing me.  Sorry, ask a serious question, get a serious answer.  She stated I was being forwarded to a hiring manager... then the next day I received a rejection email.   It was just an odd experience.", "Interview Questions": "Describe a  time you  met a challenge  "}, {"date": "20 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish in May 2020", "Interview Descriptions": "Initially, you have an interview with HR over the phone. Swedish has their HR outsourced and therefore it was someone reading scripted over the phone. No matter what I said, I felt as if the response was scripted.  It was frustrating for me at times. \n\nMy second interview was with my director/manager for my position and that was done by video via Microsoft Teams. This interview went fine with no issues with video or sound.", "Interview Questions": "Tell me of a time you had conflict with someone at work. How did you handle it?"}, {"date": "14 Apr 2020", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Swedish (Seattle, WA) in Apr 2020", "Interview Descriptions": "Emailed and scheduled the interview time. I emailed the dates and the times I will be available and they accomodated to my schedule because I had school. Then the interview was scheduled and I got an email regarding the date and the time.", "Interview Questions": "Strengths? How do you handle conflict? What do you add to the team?"}, {"date": "14 Jan 2020", "title": "Housekeeping Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "The interviewers didn't carefully look at my application.  I don't think they knew I'm a disabled person, from their printout of my application and resume. Maybe I should've told them I'm Autistic.", "Interview Questions": "Am I comfortable cleaning up human waste"}, {"date": "3 Nov 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish", "Interview Descriptions": "Applied online with cover letter and resume attached. I got a phone call from the recruiter for a phone interview and that went well and I was called in for an in person interview with hiring manager and charge nurse. They asked me critical thinking questions as well as basic medical questions.", "Interview Questions": "How did you handle a conflict with a coworker or a patient/family member?"}], [{"date": "14 Oct 2019", "title": "Pharmacist Per Diem Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Swedish (Seattle, WA) in Oct 2019", "Interview Descriptions": "One hour panel interview with two pharmacists and pharmacy director. As has been my experience in all pharmacies, the interview was disorganized, there was cross-talk and arguing amongst the interviewers, as pharmacists used the opportunity to power-trip and bicker with each other. \r\n\r\nOne pharmacist was particularly disruptive and 20 min into my interview, I was reminded of all the reasons I left inpatient pharmacy work to begin with. Utterly unprofessional environment and HR really should sit in on all interviews.", "Interview Questions": "One pharmacist asked if my current job was a conflict of interest with the position and derailed the entire interview fixating on this point. "}, {"date": "23 Oct 2019", "title": "Clinic RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish (Portland, OR) in Oct 2019", "Interview Descriptions": "First, contacted by HR via phone which takes about 20~30 mins \r\nThen I got a email informing me to come in for in-person interview about 5 days later.\r\nInterview was for 1 hour and basic questions were asked.", "Interview Questions": "How would you deal with angry patient?"}, {"date": "15 Nov 2019", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Swedish (Edmonds, WA) in Oct 2019", "Interview Descriptions": "It was long!! I am still going through the interview process, and it has been 3 months. Started with video interviews, then an an person, just waiting on the next steps now. Hopefully soon, because I would really love to work here.", "Interview Questions": "My experience. "}, {"date": "20 Sept 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish (Seattle, WA) in Sept 2019", "Interview Descriptions": "I applied online and received an email inviting me to interview. It was simple and straightforward. Was interviewed by the director of rehab and a physical therapist. Lasted about an hour.", "Interview Questions": "Tell me about what sets you apart from other candidates."}, {"date": "17 Aug 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Edmonds, WA)", "Interview Descriptions": "I applied online as an experienced RN. I recieved an email 4 weeks later asking to set up a phone interview. The interview was set for about a week out. I rearranged my current work schedule to get off work early enough to complete the phone interview. I left work early that day and arrived home with about 20 minutes to spare to review my notes before the phone call. I looked at my phone only to realize HR had called me 30 minutes prior to my scheduled interview and left a VM saying if I was still interested to call and/or email. I immediately checked my email to make sure I didn't mess up on the time and sure enough, I was not the one who made the mistake. I called back right away and the call went to voicemail. I left a professional message apologizing for missing her call and explained I was still very interested in the position.  I figured maybe she would realize her mistake and call me at the correct time. 4pm (the agreed upon phone interview) came and went. My heart sank. I emailed around 4:30 once again apologizing and looking to reschedule. HR got back to me the following business day but explained she couldn't reschedule me for another week and a half. Okay, I really wanted the job so I patiently waited for the interview. I emailed a day prior to confirm our time. This time, she called at the correct time. She asked about my previous experience,  had 3 behavioral based questions for me, and asked if I had any questions. I had several questions, all of which she said she didn't know the answer and said I would have to ask at the in person interview. She then told me if she felt I met the qualifications she would forward my application to the hiring manager, but an in person interview would be at least a week and a half out. She also informed me they do a 10-panel drug screen (totally fine I guess) which included nicotine and alcohol. I'm sorry, it just seems ridiculous. I realize the hiring process can take time but several months? And a drug test for nicotine and alcohol? I've never even heard of that. This organization seems very disorganized, HR doesn't own up to their mistakes (somehow I felt guilty for missing HR's phone call when they screwed up the time), and a bit intrusive for drug testing for totally legal substances. This seems so be a sign and maybe speak to the bigger picture. Sorry Swedish, I don't want to work for you guys that bad. Applied at another hospital last weekend, got an in person interview within 5 days, and was hired on the spot today. I think I'll go with the facility that actually wants me.", "Interview Questions": "Tell me about a situation where you disagreed with another coworker?"}, {"date": "12 Oct 2021", "title": "Registered Dietitian Nutritionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Swedish (Edmonds, WA) in Aug 2019", "Interview Descriptions": "2 in-person interviews were conducted by the department manager.  Various staff members attended each interview. Asked fairly general interview questions-strengths, weaknesses, goals, etc.. Also gave examples of MNT scenarios and asked how I would respond. One scenario was \"What would you do if an MD prescribed a keto diet to a patient with Prader-Willis syndrome?\"", "Interview Questions": "Asked fairly general interview questions-strengths, weaknesses, goals, etc.. Also gave examples of MNT scenarios and asked how I would respond. One scenario was \"What would you do if an MD prescribed a keto diet to an adult patient with Prader-Willis syndrome?\""}, {"date": "3 Aug 2019", "title": "Patient Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Swedish (Seattle, WA) in Jul 2019", "Interview Descriptions": "Applied online, phone interview then followed by in-person interview. Five References check next day. In-person interview was extremely easy. Clinical supervisor was nice and friendly. Still waiting for a call or email", "Interview Questions": "Strength & weaknesses, behavioral questions "}, {"date": "18 Jul 2019", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Jul 2019", "Interview Descriptions": "Mine was very straight forward, I'm a current system employee so I believe some formalities were skipped over. I went straight to an in-person interview after applying online. The interview was with the direct supervisor, one on one, it lasted about 45 minutes. Every question was relevant, nothing felt rehearsed so it came off as very genuine which I can appreciate.  Immediately following my interview the hiring manager reached out to my current supervisor, which I can't blame them for doing but it was a bit surprising. I think it was done just as a quick reference check to verify the information I had provided them before they moved forward with a decision. So if you're a current employee looking to go elsewhere don't be shocked if this happens, and then your current department is aware you're actively applying for other jobs. But overall it was a great experience.", "Interview Questions": "How do you resolve conflict with others?\r\n"}, {"date": "30 Apr 2019", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "I sat with the supervisor of the department in a windowed room. The process itself takes about 30 minutes and had a very casual feel to it. Questions were generally basic (pros and cons of yourself) and did not require any major knowledge on US healthcare", "Interview Questions": "How would you deal with difficult patients?"}, {"date": "10 Jan 2020", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Swedish (Seattle, WA) in May 2019", "Interview Descriptions": "It's a panel interview. Focus on A&P and med term. Must have CPC, ok to have CPC-A. The manager does not do coding but the supervisory team will be in the interview too and they are very knowledgeable.", "Interview Questions": "Do you have medical terminology training?"}], [{"date": "19 Jan 2020", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Jan 2019", "Interview Descriptions": "I applied online. Got a call from a recruiter and scheduled an interview. I had an interview a few days later and then was offered the a position a few days later by the recruiter.", "Interview Questions": "  Whats the reason why  you are looking for a new job?"}, {"date": "1 Apr 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Jan 2019", "Interview Descriptions": "Phone screening first,in person interview with the supervisor,then with the Incharge pharmacist. interview was average. Started on time,about 30 minutes long,followed by tour of the pharmacy.Got a call after few days.", "Interview Questions": "Describe a stressful situation?"}, {"date": "9 Mar 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Swedish in Jan 2019", "Interview Descriptions": "Standard, behavior questions. Fairly easy.  Panel interview.   First with hr and then panel of nurses.   Fair questions.   Tell me about a time when questions.   Have a tour after.   Sometimes offer on the spot.", "Interview Questions": "Time management skills how do you manage time "}, {"date": "17 Oct 2018", "title": "Nac Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Issaquah, WA)", "Interview Descriptions": "Recruiters get back to you quickly and schedule everything for you and potential managers in a timely fashion. Panel interviews are typically nerve wracking but everyone had a smile on their face and didn't make it any more difficult than it had to be. Quick responses from hiring managers as well.", "Interview Questions": "Tell me about a time when you and a coworker experienced conflict and how you resolved it.  ( All behavioral and scenario based questions- preparation is key!)"}, {"date": "28 Jun 2018", "title": "Manager, Cancer Center Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Had a great phone interview with Dee in January. Expected manager interview a few days later. Followed up with Dee after a week  - said she'd check back. Followed up again a month later - said she'd check back. Followed up 4 months later - said she'd check back. Lack of follow up is appalling.", "Interview Questions": "The interview questions on the one phone interview just reviewed my experience and skills in each bullet listed on the job posting. "}, {"date": "19 Jun 2018", "title": "Patient Registration Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "About a week after I applied I received an invitation to do a Hirevue interview, which is a video interview, where you are asked questions and you have a set amount of time to respond.  Really awkward. About  a week later I was contacted and asked to come in for an in person interview. In the meantime they asked for references before the in person. I did the in person about a week later and didn’t hear anything, but checked in after a week. I was told the hiring manager hadn’t made a decision. I expressed I was still interested but also interviewing for other jobs. I checked in once more after it had been about 3 weeks and was asked to come in again for a second interview with a different supervisor. This was a waste of my time.  I was there maybe 10 minutes.  I’m the first interview they asked almost all the same questions as the video interview. The second interview the supervisor asked me a couple of the same and said I’d hear something by a set date. That date came and I reached out. I had received a couple of job offers but wanted to weigh all my options so I was holding out. I asked them to let me know if I was no longer being considered so I could move on. They dragged me along for more days before I finally pulled the plug. Ludicrous amount of time (2 months) for a fairly entry level position. Communication was poor and disrespectful of my time. HR put the blame on the hiring manager. But they had issues too. If this is what the process is like to get hired, I can’t imagine what it would be like to work in that department.", "Interview Questions": "Why Swedish?"}, {"date": "5 Feb 2020", "title": "School Based Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Swedish (Seattle, WA) in Jun 2018", "Interview Descriptions": "I spoke with a recruited first. Then I was invited for an interview with 3 team members, the manager and a school district representative. In the interview they asked my preference on age group and discussed how they place employees at schools. While this position is through the medical organization it is closely partnered with the school district who holds the most power in hiring and placing.", "Interview Questions": "Behavior based questions: what would you say to a parent demanding to know what you're talking to their kids about during sessions? If the child is 14 and seeing you and has not given you explicit permission to discuss treatment with the parent how would you proceed?"}, {"date": "22 Oct 2019", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Swedish (Seattle, WA) in May 2018", "Interview Descriptions": "This was a very brief interview that was carried out mainly by the staffing agency recruiter.  My time as a staffing agency nurse was like an extended job interview for the temporary to permanent hire transition.   I didn't interview for the transition, just let them know I was willing to stay.", "Interview Questions": "What my base knowledge was about liver function and diagnoses"}, {"date": "8 Jul 2018", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Swedish (Seattle, WA) in May 2018", "Interview Descriptions": "The overall interview process felt natural and I thoroughly enjoyed meeting the pharmacy team.  \r\n\r\nI live out of state, so there were phone interviews that preceded in-person interviews.  The initial phone interview was with HR.  Upon passing that, the next phone interview was with members of pharmacy management.  Upon passing that, the final interview was an in-person interview with members of pharmacy management as well as a few staff pharmacists.  \r\n\r\nEveryone was extremely polite, conversational, engaged, and I felt very welcome and open with the panel.  They asked questions that I was able to answer and relate to any questions I had, so the interview felt more like a conversation than other ones where people just have lists of questions to ask you.  After the interview, one of the staff pharmacists graciously took me on a quick tour of the hospital, which made me feel even better about the process.\r\n\r\nThe follow-up was the most nerve-wracking part of the process.  I didn't hear back with an official offer from the team for almost 2 months.", "Interview Questions": "Went off my  CV -asked about specific duties of each of my previous jobs at various hospitals/places of employment"}, {"date": "25 Sept 2018", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at Swedish (New York, NY) in Apr 2018", "Interview Descriptions": "I was brought in for an interview back in April that went well. I left the experience with a positive impression of the pharmacy team.\n\nHowever, after weeks of no response, I reached out to the HR department. They told me that an internal candidate was chosen, which is fine, but it was strange that I had to reach out for this.\n\nOver the next several months I've seen rotating posts for the same pharmacist positions going unfilled or closed then reopening. \n\nI have applied for over 20 positions over several months, and since my interview I have gotten ZERO communication from the HR department. They consistently ignore e-mail, respond slowly (if at all), and provide no feedback to help you improve as a candidate.\n\nAs a professional with a doctorate, I find it incredibly unprofessional to \"cold shoulder\" your candidates. I have the impression that I will not be considered for another interview, but even after directly asking if this is what is going on, I continue to be ignored. I am merely left wondering. \n\nIt would be far more productive to let a candidate know if they will not be considered moving forward, so you don't waste company and candidate time.\n\nHR should learn to treat the people they work with like people, and maybe it's time to rethink how we actually use the term Human Resources.\n\nTo the C-suite: this department is profoundly broken and you would do well to do something about it.\n\nI would call Swedish/Providence HR gatekeepers if they weren't so inept at their job.", "Interview Questions": "Standard questions from a sheet"}], [{"date": "7 Mar 2018", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Swedish (Seattle, WA) in Mar 2018", "Interview Descriptions": "The first stage of the application process is an online video interview. You are video recorded (talking to yourself) and answer questions one by one. It feels very uncomfortable at first, but you get more used to it with each question. They give you a practice question before as well.", "Interview Questions": "Why did you pursue a career in nursing?"}, {"date": "28 Feb 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Swedish", "Interview Descriptions": "First had to submit the regular online application, then was asked to do an online video interview, and finally invited to an in-person interview. It is a step-by-step process. Most communication is via email. Must respond to each stage of interview in timely manner.", "Interview Questions": "Why did you choose Swedish?"}, {"date": "29 Nov 2022", "title": "PSR I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish in Mar 2018", "Interview Descriptions": "Easy. Basic interview questions, but they ask a lot of scenarios on your past work experience and over coming situations. Then they talk about what you like to get paid. The pay is not good.", "Interview Questions": "What was your most difficult work experience?"}, {"date": "19 Jan 2019", "title": "Quality Improvement Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Swedish (Seattle, WA) in Feb 2018", "Interview Descriptions": "I had an interview with a recruitment agent, then one phone interview with a manager. After that, I flew to Seattle to meet with a few of the team members in person.", "Interview Questions": "They asked the standard interview questions regarding my experience, background, passions, etc. "}, {"date": "1 Feb 2018", "title": "Patient Registration Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish in Jan 2018", "Interview Descriptions": "Completed application online and received a request to complete a HireVue interview. Received a phone call from recruiter a week later and set up an In-Person Interview. Met with three interviewers, who were very nice and easy to speak with. Still waiting to hear back.", "Interview Questions": "What are your career goals?"}, {"date": "22 Dec 2017", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish (Seattle, WA) in Dec 2017", "Interview Descriptions": "The process was very thorough. Am being scheduled for a panel interview at this time so process has not been completed.  Prior to interview there was a lengthy phone screening process.", "Interview Questions": "What would you do differently in this leadership position?"}, {"date": "15 Nov 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Got the interview through a company connection. Interviewers seemed disinterested and tired. It was difficult to engage them. They seemed to be winging the questions. Questions were of average difficulty.", "Interview Questions": "What qualities do you feel are most important for a Patient Service Representative to have?"}, {"date": "13 Nov 2017", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Swedish", "Interview Descriptions": "Lots of questions, lots of people on the panel. my interview was 2 hours long. The manager went on and on about herself. The panel of 5 people asked about 20 questions. I was super tired by the end of it.", "Interview Questions": "Tell me about a time when you disagree with your supervisory"}, {"date": "4 Feb 2021", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Nov 2017", "Interview Descriptions": "applied and a few days later, 1 call with recruiter, 1 in person interview with clinic supervisor and nursing supervisor. basic interview questions. very friendly and relaxed.  not much room for salary negotiation.", "Interview Questions": "Q:  past patient experience\nQ: Goals\n"}, {"date": "5 Nov 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish (Issaquah, WA) in Oct 2017", "Interview Descriptions": "Many emails coordinating interviews. A little confusing as some communication comes from Providence and some from Swedish. It seems to depend on the position applying for. I did accept an offer and am waiting to start in a couple weeks.", "Interview Questions": "Tell me about your experience."}], [{"date": "14 Dec 2017", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Swedish (Issaquah, WA) in Oct 2017", "Interview Descriptions": "Application submitted through web portal. Hireview online video interview (recorded). Meeting with supervisor. The meeting consisted of various standard interview questions. Then I was made an offer through HR. I negotiated hiring salary, then accepted.", "Interview Questions": "What are your strengths?"}, {"date": "11 Jun 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Swedish in Sept 2017", "Interview Descriptions": "You submit an online application, they contact you for a virtual interview, then an in person interview. Sometimes they will have you do a job shadow then they give you an offer letter.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "7 Sept 2017", "title": "Clinic Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Aug 2017", "Interview Descriptions": "Took roughly a month from initial contact by recruiter to in person interview.\r\nWhen I walked in to interview with the director, she asked me to remind her what position I was applying to. Not engaged at all, interview lasted less than 5 minutes!", "Interview Questions": "Why do you want to work for Swedish?"}, {"date": "19 Jul 2017", "title": "Clinical Competency RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Swedish (Seattle, WA) in Jun 2017", "Interview Descriptions": "As an internal candidate I reached out to the hiring manager directly and was then contacted by talent acquisition to schedule interview. Contact with the talent acquisition coordinator was frustrating, at best. Following the interview my attempts to reach out to both talent acquisition and the hiring manager for follow up were ignored. I was not contacted again by anyone with Swedish or Providence. I found out I was no longer being considered by logging into the Swedish Careers site.", "Interview Questions": "Many of the questions centered around my experience as an educator in my previous and curren roles."}, {"date": "16 Jun 2017", "title": "Registered Nurse PICU Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish in Jun 2017", "Interview Descriptions": "The recruiter was nice. She called me about a week after I applied to set up a time to talk. When she called back later she informed me that they decided I was not a good fit. She noticed that I was in school and working on my PNP-AC, and the manager did like to hire people in school. I told her that I would not be graduating for at least 2 years, but she said she didn't feel like it was a long enough commitment. Definitely not education friendly.", "Interview Questions": "Why did you apply to Swedish Medical?"}, {"date": "11 May 2017", "title": "Regulatory Affairs Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Screening phone call followed by a group interview with various team members and managers. Relaxed and friendly setting, but they asked good questions and seemed honest about the position. There was a bit of a delay for the offer to be made, as HR evidently had some miscommunication with the hiring manager.", "Interview Questions": "What is a common misconception people might have about you."}, {"date": "14 Jun 2017", "title": "Oral Surgery Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Swedish (Seattle, WA) in May 2017", "Interview Descriptions": "I met with two supervisors that I would be working with directly in the clinic as well as the two CA's assigned to my clinic. It was fairly casual with all of the expected questions.", "Interview Questions": "Explain your work history and your experience you gained from those positions."}, {"date": "3 Jul 2018", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Swedish (New York, NY) in May 2017", "Interview Descriptions": "Everyone I was in contact with was friendly and professional, however communication with the recruiter and hiring manager was extremely slow. Ultimately I would have taken the job that was offered, but I took another position after waiting nearly 2 weeks for a response.", "Interview Questions": "What does your average day  look like?"}, {"date": "17 Apr 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Completed online application, then a phone interview with the clinic manager, was then asked to come in person a few days later. Arriving to the clinic, I completed multiple forms with similar questions and answers as the one online. I was then given a group interview  by all the doctors and nurses with some administration coming in and out within 2 hours. I was asked a series of questions that included scenarios and what my previous work experiences were like.", "Interview Questions": "What experience have you had with difficult patients?"}, {"date": "11 Apr 2017", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Brief phone interview four weeks after applying online. Basic questions of experience, skill set, professional characteristics, etc. Was invited to do an in person interview the same day. Met with clinic manager and administrator for more in depth questions and introductions. Was a very friendly and professional interviewing experience.", "Interview Questions": "Was asked about who my role models are, was not actually expecting that question. "}], [{"date": "23 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Swedish", "Interview Descriptions": "I first spoke with a recruiter who referred me to the manager, I then had a phone interview and then group interview with fellow staff members and senior management. Group interview was not intimidating but a great learning experience and overall enjoyable. Employees were friendly and honest with me. Spent 2 hours with them.", "Interview Questions": "What is your weakness?"}, {"date": "15 Mar 2017", "title": "Cope Health Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "It was a group interview that went well overall. Finding the location was one of the most confusing things. They asked a series of group questions and then one or two individual questions.", "Interview Questions": "What is one word you would use to describe yourself and why?"}, {"date": "5 Mar 2017", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at Swedish", "Interview Descriptions": "Connected via recruiter. In person interview with several managers. Questions about how you handle stress, multitasking, conflicts of interest, and ethics. Opportunity to explain how my past experience made me a good candidate.", "Interview Questions": "How an employee approaches multi-tasking. "}, {"date": "21 Feb 2018", "title": "Medical Office Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Swedish (Seattle, WA) in Feb 2017", "Interview Descriptions": "I was contacted via e-mail with a request to interview/obtain more information about myself. I was given a link, and from there it was a video interview - not like skpye where someone is on the other side. Rather, you recorded yourself answering a question as it poped up on the screen.", "Interview Questions": "Explain what you did with your last employer and why you left that position"}, {"date": "3 Mar 2017", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Swedish (Seattle, WA) in Feb 2017", "Interview Descriptions": "I applied on www.swedish.org - then I had a meeting with my manager a couple weeks later, after the interview I was told that I will hear from a recruiter within a week.", "Interview Questions": "Do you have a favorite clinic? How do you like floating around to different clinics?"}, {"date": "18 Nov 2016", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Oct 2016", "Interview Descriptions": "I was chosen for a \"digital interview\" via HireVue. Essentially they have a typed question and you record your response and your entire submission is sent to them to look at. I never spoke to another human being. The questions were pretty straight forward phone interview type questions. Recording my responses did throw me off - it was uncomfortable and they wanted you to speak for a minimum time (I believe it was for at least 30 seconds or more) and would not let you end the recording until that time. This proved difficult with questions like, \"What salary requirements are you looking for?\" and other short-response questions. I ended up responding and then just looking at the camera like an idiot until my time ended. They sent me an email shortly after I completed the email saying someone would be in touch with me. Surprise, surprise.... I heard nothing. It has been over a month since.", "Interview Questions": "What are you salary requirements?"}, {"date": "11 Oct 2016", "title": "Medical Staff Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Submitted application in person after searching online for the position. First there was a telephone screening interview with Human Resources followed by an invitation (via telephone) for a panel interview with three people. The in person interview was probably an hour or so long. Got a brief tour of the facility.", "Interview Questions": "What can you bring to the position? Describe how your experience in your previous job will prepare you for this position."}, {"date": "2 Mar 2017", "title": "Critical Care Nurse - BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Swedish (Seattle, WA) in Oct 2016", "Interview Descriptions": "Great HR that will hold telephone interview, then clinical interview with hiring manager, online onboarding where you upload everything electronically when an offer is made, assigned to a orientation date with minimal paperwork.  Everything is done electronically.", "Interview Questions": "Why Swedish?"}, {"date": "22 Sept 2016", "title": "Certified Nursing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "I applied online and after a week or so I received email fr. Swedish HR saying I have to create an account for their account so I can access to the process of interview and it's a very first time I to have this virtual interview.  So it took me couple of days or so just to go online to access the virtual interview meaning you will read the question then you will answer infront of the camera you will record then you will submit so I have like 14 question. It feels \"weird\" your reading a question then your answer thru video.", "Interview Questions": "why do you to work in Swedish hospital"}, {"date": "26 Sept 2016", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Palo Alto, CA) in Sept 2016", "Interview Descriptions": "The 1:1  telephone interview I had with Swedish Medical  3 weeks ago was comprehensive and very telling of how the company I am applying for is indeed one of the best hospitals in Northern America. The company sets high standards in hiring competitive and exceptional nurses thats why the 40 minutes interview turned out to be satisfactory. I didn't get the job I wanted, but because of the experience, it made me brush up on my interview skills and communication which will prepare me for the next interview. (thumbs up!)", "Interview Questions": "What sets you apart from the other candidates?"}], [{"date": "7 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Aug 2016", "Interview Descriptions": "Panel interview, behavior-based questions. It was stressful to be in a room with so many people (5-6) all looking at me and taking note of my answers, but I had very encouraging interviewers who prompted me to elaborate and highlight my experiences.", "Interview Questions": "Tell us about your decision-making process when you encounter an unexpected situation."}, {"date": "12 Apr 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish (Seattle, WA) in Jul 2016", "Interview Descriptions": "first i had a phone interview that lasted maybe around 15 minutes where i was informed of the job and all that would be required and then i was asked a couple of questions that to be truthful i dont remember, however i was called later that week and informed that i was going to move onto the second part which was a one on one interview with the clinic manager, she was kind and polite, she asked me questions regarding my experience, the reasons i joined the medical field and so on, after that she said they would contact me in a week or so, one week later i got another call and then i was told id come in for my final interview, at that interview i met all of the staffing, the nurses, medical assistants, receptionists, billing office and so on. then afterwords i was told id be called if i got the job, I did.", "Interview Questions": "What made you want to join the medical field."}, {"date": "3 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Swedish (Seattle, WA) in Jul 2016", "Interview Descriptions": "Initially I had a phone interview with the HR representative. She then proceeded to ask me basic job questions including my experience, work history, and career prospects for the future. I was then forwarded to the head of the department I was wanting to work in. He too was a phone interview (as I lived in a different state). The interview started on time and ran a little longer due to the great rapport I had with him.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Aug 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Swedish in Jul 2016", "Interview Descriptions": "First I applied online, after a long wait I received an email from recruiter setting up a phone interview, after the phone interview they schedule an in person interview with a recruiter, then finally a panel interview with the department manager and nurses from the department.", "Interview Questions": "What makes you a good candidate for the new grad RN program at Swedish?"}, {"date": "7 Apr 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Swedish (Seattle, WA) in Jul 2016", "Interview Descriptions": "You are taken into no particular room and ask informal questions, Usually done by a supervisor.  They went over my resume and ask a few questions pertaining to previous employers.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "7 Feb 2017", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Swedish in Jun 2016", "Interview Descriptions": "it is a training program for about 2 weeks learning and orientation. performs administrative duties, such as scheduling, and relays information within a company or organization, usually in the healthcare field. They typically need at least a high school diploma or its equivalent, but many employers prefer someone with a degree.typically work in office settings within the medical field, and are responsible for ensuring that a patient's insurance allows them to access the services of the specialist's health care providers.omputer skills and software aptitude\r\nCommunication and customer service skills\r\nInsurance coding and medical terminology\r\nMulti-line phone proficiency.", "Interview Questions": "My experience in healthcare"}, {"date": "24 Jul 2017", "title": "Digital Innovation Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Jun 2016", "Interview Descriptions": "I was first asked how I would organize and and create a dog walking service. This went for about an hour. Then they brought in a few software engineers to ask more technical questions. These engineers had some trouble asking about binary trees because their questions were described incorrectly. It seemed they were not used to doing Interviews.", "Interview Questions": "Q: What do you know about this company?"}, {"date": "18 Sept 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish in Jun 2016", "Interview Descriptions": "Start off with a phone interview and it you were a great fit then you have an interview with the manager of the clinic. The manager have you come in for the interview and ask questions to see if you are a great fit,", "Interview Questions": "Why do you think you are a great fit."}, {"date": "11 Aug 2016", "title": "Development Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Swedish (Seattle, WA) in Jun 2016", "Interview Descriptions": "I submitted my resume and cover letter through their online Taleo portal. I made sure my cover letter contained many of the same words as the job description. I was called for a 30 minute phone interview with HR, and then had an hour-long in person interview with the hiring manager. Further steps would have included several panel interviews, a writing sample and an interview with the President of the Foundation, but I was not asked back.", "Interview Questions": "If you could have a boss from the movies or TV, who would you choose?"}, {"date": "5 May 2016", "title": "RN Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Swedish (Issaquah, WA) in May 2016", "Interview Descriptions": "The process moved fairly smoothly. I initially went through a quick in-person HR interview and was then contacted a month later to schedule an interview with the specific floor and nurse manager. I interviewed on the floor with a panel of 6 managers and nurses.", "Interview Questions": "Tell us about a time when you encountered conflict and how did you handle it."}], [{"date": "19 Apr 2016", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Swedish (Seattle, WA) in Apr 2016", "Interview Descriptions": "It went very smoothly and I was asked questions more specific to the position during the in person interview. The person that set up the interview was also very helpful when it came to giving me the details of the interview in regards to location, parking and the individuals that I would be meeting with for the interview.", "Interview Questions": "How would you be able to handle doing multiple tasks at once?"}, {"date": "15 Sept 2016", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Apr 2016", "Interview Descriptions": "An email stating that I got the interview, a hire view(recording of yourself answering interview questions via Web cam) interview, an in person interview, recruiter contacting me to make an offer.", "Interview Questions": "Why I choose Swedish? What was I looking for in an employer? Was it flexible with time?"}, {"date": "4 Nov 2017", "title": "Advanced Practice Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Swedish (Seattle, WA) in Apr 2016", "Interview Descriptions": "Scheduled interviews were planned in advance with appointments to visit with multiple providers over the course of 2 days and the itinerary was closely followed and coordinated by an administrative coordinator.", "Interview Questions": "Questions ranged from inquiries regarding professional experience, career motivation, reason for interest in institution and location, relevant clinical education, to hypothetical professional/ethical dilemmas. "}, {"date": "11 Mar 2016", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Multiple interviewers from leads to charge nurses and PA's.  The ER is a tight knit group so a lot of the interview was personality questions...basically to see if you fit in.", "Interview Questions": "Work ethic and education"}, {"date": "30 Mar 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Swedish (Issaquah, WA) in Mar 2016", "Interview Descriptions": "I originally applied for a position with Swedish mid/late February. I got a phone interview and was told that if I impressed them, I might get an in person interview. I waited and unfortunately did not hear back. I kept applying to positions and a week later I was requested to come in for an in person interview. The in person interview consisted of the unit's manager and three nurses in the unit. It was a very chill and conversational interview experience. They referenced answers from my phone interview and asked me to elaborate on those answers.", "Interview Questions": "What brought you here to Issaquah? How would nurses at your previous employer describe you?"}, {"date": "29 Mar 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Mar 2016", "Interview Descriptions": "Very relaxed. We started with details about the job and the clinic. My interviewer told me about themselves and their role. We reviewed my resume then went over the interview questions. Questions were pretty standard i.e. how would you handle certain situations/stress. A lot of scenario type questions. Some questions about what you value in a work place and why.", "Interview Questions": "How do you handle stress?\r\nWhat would you do in a scenario where a co-worker is not being nice to you?\r\nWhere do you see yourself in 5 years?\r\nHow do you deal with a difficult patient?\r\nBasically, a lot of scenario questions. "}, {"date": "23 Jan 2016", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Before I continue, it's important I note that I was in fact over qualified for the job and was not hired because I didn't smile enough. First off, rude. Second off, I was smiling adequately given the professional situation. Additionally, I have a naturally serious demeanor, doesn't mean I can't execute a job properly. Third, that would not have been a problem had I been a man. Bland, uncultured, sexist personalities.", "Interview Questions": "How does this position fit into your career goals?"}, {"date": "15 Dec 2019", "title": "RN Staff Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Feb 2016", "Interview Descriptions": "I filled out an online application. I was able to use a friends name as an employee referral. I was then contacted by the nurse manager for a phone interview. Within the week she called back to schedule an inperson interview and tour of the unit. I took another job before the inperson interview took place.", "Interview Questions": "How long have you been a nurse? Why are you chosing Swedish?"}, {"date": "30 Jan 2016", "title": "RN Residency Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Swedish (Seattle, WA) in Jan 2016", "Interview Descriptions": "Took a month to get a phone interview and 2 weeks to get a peer interview. Said I would know by the end of the week and got no phone call. Interview was very informal with typical questions thought I did a great job at being myself and being professional. No call was made.", "Interview Questions": "What was a time you went above and beyond for a patient?"}, {"date": "18 Mar 2017", "title": "Certified Nursing Assistant (CNA) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Swedish (Issaquah, WA) in Jan 2016", "Interview Descriptions": "Asked about previous work experience and how to react in various situations and various typical HR questions. Was in an office building though it wasn't clear where I was supposed to meet him for the interview and the front office wasn't very well able to direct me as they don't have access to see those meeting times themselves.", "Interview Questions": "if you see someone doing something out of protocol, how to you or how have you handled the situation?"}], [{"date": "7 Aug 2019", "title": "RN Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Swedish in Jan 2016", "Interview Descriptions": "The first interview was a phone interview with an HR person. Standard questions. The second interview was a phone interview with the manager of the unit.  From what I understand, there is usually a panel interview with the manager and staff members.", "Interview Questions": "Tell me about a difficult situation and what was the outcome."}, {"date": "29 Dec 2015", "title": "RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Dec 2015", "Interview Descriptions": "Most of the questions were behavioral interview questions. There was a panel of 5 people, including the manager, RN's, etc. Everyone was very friendly and took turns asking questions. I believe there were maybe 6 total questions and they took notes while I spoke. Overall, it was an average interview - definitely didn't feel overly difficult.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Mar 2016", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Swedish (Seattle, WA) in Nov 2015", "Interview Descriptions": "Manger was about 10 to 15 minutes late. Interview was ok. Standard questions where asked and answered. Manger was unclear, rude and started show signs of being verbal abusive. I brushed off the general rudeness of manager as she was seemed overwhelmed. Over all the interview was unremarkable. I didn't expect a call back. But was hired and fired after 5 months due to not being a good fit. Verbal abusive manager added insult to injury by not paying me for all time worked on last paycheck. HR sided with horrible manager.", "Interview Questions": "basic interview questions; nothing special."}, {"date": "15 Jul 2017", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Nov 2015", "Interview Descriptions": "The hiring process was frustrating. I applied for the job in September and got a denial email within a month or so. Then I got a phone call in November asking me if I was still interested in the job. I said yes and I was offered a job. I was given a choice of FTE that I wanted and said I wanted the 0.6. I was sent an email confirming that this is what I was going to be working and then a week later, I got a phone call from the same lady who said that the position she offered me was taken by another employee and that they could offer me a per diem position. So I took that. That process was frustrating. \r\nThe interview process was a little nerve wracking because it was an interview panel and I didn't know until I walked into the room.", "Interview Questions": "Tell us about a difficult situation while working in the ER and how you handled it. "}, {"date": "28 Dec 2015", "title": "Internal Medicine Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Swedish (Seattle, WA) in Nov 2015", "Interview Descriptions": "I had a pre-screen over the phone by the director. Flew out there. Took a taxi. They arrived late to the interview. Interview was informal. Basic questions asked. No tour of the facility.", "Interview Questions": "Do you know anyone in Seattle?"}, {"date": "16 Dec 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish (Port Orchard, WA) in Nov 2015", "Interview Descriptions": "The process took about a month. Submitted application online 2 weeks got an email to set up a phone interview. Phone interview was pretty basic questions, was offered to set up a in person interview for different position that was a lot closer which I accepted. Met up with the manager, pretty basic questions as well. During this interview a lot of information was given about the position and where I will be working at. Received a call with an offer 2 weeks later.", "Interview Questions": "Tell me what a regular day was like at your previous employment."}, {"date": "26 Feb 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Swedish (Seattle, WA) in Nov 2015", "Interview Descriptions": "I was interviewing for a per diet RN position while I was near the end of my travel assignment at an inpatient unit at Swedish. The nurse manager the referred me to the manager at the outpatient clinic, who then interviewed me with another nurse manager at the same time.", "Interview Questions": "What was my last job like?"}, {"date": "12 Oct 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Swedish (Seattle, WA) in Nov 2015", "Interview Descriptions": "My interview was very relaxed. I was able to learn a lot about the clinic I was interviewing for and tell a bit about my past experiences in similar settings.", "Interview Questions": "What are your career goals?"}, {"date": "10 Oct 2015", "title": "Patient Registration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "initially a phone view with a recruiter, where you go over your resume and answer basic questions about the job you are apply for, and then in person interview where you meet with the Supervisor and Lead, maybe about 34-45 min long", "Interview Questions": "lots of \"name a time when\" questions\r\nexamples of when you worked on group projects\r\nexample of when you and another employee disagreed and how you overcame"}, {"date": "17 Nov 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Swedish (Seattle, WA) in Oct 2015", "Interview Descriptions": "Went through a recruiter. The managers reached out to me and were very nice. The whole process went smoothly. I was in their office for about 45 minutes and then I got offered the job. My managers at the time were great. Very kind, asked general interview questions and nothing too difficult.", "Interview Questions": "What does empathy mean to you?"}], [{"date": "12 Oct 2015", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Oct 2015", "Interview Descriptions": "I was contacted by a recruiter to schedule an interview for a position beginning at the end of the month. I participated in a phone screen and then was invited for an in-person interview. I met with a panel of 6 other staff members from the unit and was asked a series of behavioral based interview questions. The interview concluded with a tour of the unit.", "Interview Questions": "Describe a time when you completed a project that someone else had started."}, {"date": "13 Oct 2015", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Swedish (Seattle, WA) in Oct 2015", "Interview Descriptions": "The hiring manager and the team coordinator hosted the interview.  The atmosphere is loose.  I felt comfortable.  The hiring manager explained about the job in more detail than the job posting.  She explained about the work culture as well as scheduling flexibility. The overall experience was good.  I felt I would get a job offer.", "Interview Questions": "Are you flexible with the schedule?"}, {"date": "20 Sept 2015", "title": "Nursing Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Swedish", "Interview Descriptions": "The process began with an easy phone interview and was followed by interviewing with a panel of nurses in the department. This residency is very competitive and you go up against the best of the best. I felt that the interview went well, but was not given an offer. I have other interviews on other floors, so hopefully something works out", "Interview Questions": "Tell me a time you had to work in a team and what was the outcome"}, {"date": "28 Oct 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish (Seattle, WA) in Sept 2015", "Interview Descriptions": "Panel interview with three separate people. Typical interview questions which included why you want to work here, what makes you think you would be a good fit for the job, and are you prepared to work in a versatile work environment?", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "12 Oct 2015", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Sept 2015", "Interview Descriptions": "As someone else described in another review, it was disclosed to me during the interview that they hire temps from the staffing agency NuWest for this position and that they had pretty much already decided whom to hire for the job.  I didn't know this and found their hiring practice a bit unethical in that they lead you to believe that they are truly considering you as a candidate while their full intention is of only using a staffing agency.  The interviewer was nice and polite, but he was assigned to interview me at the last minute (as in when I arrived for the interview), so in all fairness, he was probably unprepared.\r\n\r\nThis was supposed to be a peer interview w the hiring manager and members of the team, but the original manager did not show for the interview.  Shame because Swedish seems a great place to work for.", "Interview Questions": "What part of your previous job did you enjoy the most?\r\nWhere do you see yourself in five years?"}, {"date": "11 Jul 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Sept 2015", "Interview Descriptions": "It was a lot of behavioral questions, there were 3 managers in the interview process who were very friendly and pleasant to talk with. They paid for my parking when the interview was over.", "Interview Questions": "Why should we hire you?"}, {"date": "23 Aug 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Comfortable and welcoming. I met with the manager and was introduced to the rest of the team present that day.  No questions were tricky or meant to stump me; just obvious questions to get a sense of whether the job might be a good fit after getting to know each other.", "Interview Questions": "About my work history and sense of ease coming to new type of nursing."}, {"date": "6 Jul 2015", "title": "Certified Child Life Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "The process took a very long time. It began with a phone screening and then a face to face interview with only one person. The person who interviewed me was really rude and sarcastic and didn't seem like she enjoyed her job working with children. Swedish also does not have a playroom or any \"play outlet\" for kids on their unit. I was NOT impressed.", "Interview Questions": "How did you get into the field of Child life?\r\n\r\nHow would you handle an interpreter who said that the family didn't \"need you\"?"}, {"date": "5 Aug 2015", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Swedish (Seattle, WA) in Jun 2015", "Interview Descriptions": "Swedish only hires through the temp agency nuwest. I tried to apply directly, but would always get considered. but not interviewed. If you would like to work there go through Nuwest.", "Interview Questions": "What do I think about working on a team?"}, {"date": "17 Jun 2015", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Jun 2015", "Interview Descriptions": "This was a group interview with two hiring managers and four people. It was a little odd, as I've never had one of these. It was different than a panel interview as we went around and we asked the same identical questions, and some of them were a little stressful.", "Interview Questions": "What makes you the best at customer service?"}], [{"date": "16 Feb 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Swedish (Seattle, WA) in Jun 2015", "Interview Descriptions": "Experience based questions. Be prepared with examples of times you dealt with difficult patient experiences. A lot of \"tell me a time when such and such happened, what did you do?\"", "Interview Questions": "Tell me a time when...."}, {"date": "6 May 2015", "title": "Systems Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "The senior (c-suite) interviewer  felt the discussion went well and I was asked to travel out there for an onsite interview. I found the interchange to be condescending rather than collegial in tone and that is not a work dynamic I would consider voluntarily entering into. It was basically 55 and half minutes of rapid fire questioning on how my current organization conducted operations followed by occasional commentary, sometimes outright disdainful culiminating in an opportunity to ask a single question of the interviewer that he chose to answer by reciting the history of Swedish and barely addressing the question at all and abruptly ending the call. Being that this is the person to whom I would directly report to I feel that an onsite visit would be a waste of Swedish’s time and my time and money.", "Interview Questions": "Why do you want to come here."}, {"date": "15 Jun 2015", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Lynnwood, WA) in May 2015", "Interview Descriptions": "I did a phone interview with a recruiter. He was supposed to interview me for three positions at one time. The recruiter tried to get me to agree to interview for a different position in a different city, a position that I did not apply for. When I declined he stated that he was cutting the interview short, after 5 minutes. I asked about interviewing for all three positions, he responded \"I'm not the recruiter for two of those positions\". He only had interest in talking about a position I did not apply for.", "Interview Questions": "Why don't you want to interview for this position?"}, {"date": "24 May 2015", "title": "Grants & Contracts Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Swedish (Seattle, WA) in May 2015", "Interview Descriptions": "Formal interview, about an hour and a half in length. Asked what I had to offer Swedish, what kind of experience would help me perform adequately, etc. Good experience overall.", "Interview Questions": "What do you have to offer Swedish?"}, {"date": "5 Nov 2017", "title": "CNA/HUC Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Apr 2015", "Interview Descriptions": "The manager interview's you on phone.  Then you come in and you are interviewed by 5 people from the floor.  I was told my salary what I would be doing  I would of been on call and have to work 2 shifts a month for sure.", "Interview Questions": "A time you went above and beyond your job"}, {"date": "24 Jan 2018", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Swedish (Philadelphia, PA) in Apr 2015", "Interview Descriptions": "It was a bit complicated but was able to get help from company to help me complete the process needed to be hired.  For and online process it was great.", "Interview Questions": "What am I most passionate about when it comes to surgery"}, {"date": "4 Mar 2015", "title": "Refund Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish", "Interview Descriptions": "went in for an interview after the phone interview got the job but they didnt contact me after 3-4 weeks then random called to set time to meet for first start date.", "Interview Questions": "what superhero would u be?"}, {"date": "2 Mar 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "Several levels of interview starting with an hour phone screening with an HR recruiter then over an hour with the hiring manageri and a panel interview with the team. Also interviewed with peers from  cross- functional teams.", "Interview Questions": "What can you bring to this company? What was your major contribution at your last job?"}, {"date": "18 Aug 2015", "title": "Medical Administrative Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Swedish (Seattle, WA) in Mar 2015", "Interview Descriptions": "The interview process went well.  I applied on line 2/15/15 and Swedish online job portal allows you to check the status of your application from beginning to end which is a nice feature.  I had a phone interview 3/11/15 and then a set up for an in person interview 3/13/15.  In person interview 3/19/15.  After the in person interview I had another phone interview with the manager instead of the supervisor and we both agreed that the position would not be a good fit due to hours and pay.", "Interview Questions": "Why did I apply for the position?  What did I think about the position?"}, {"date": "11 May 2016", "title": "Senior Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Swedish (Seattle, WA) in Mar 2015", "Interview Descriptions": "Interviewed with the person I would support and three of her direct-reports.  It would have been MUCH more helpful to meet with other EAs who really understand the role.  The folks who interviewed me had little idea what was needed.  Interview was very unstructured/casual.  HR made me turn in a series of projects to move forward, such as an excel example, executive summary, gant chart, etc.", "Interview Questions": "What's your biggest failure?"}], [{"date": "3 Dec 2018", "title": "Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Mar 2015", "Interview Descriptions": "Applied on line, then got a phone interview, then went in person to interview; met the department manager and then she had me interview with the charge nurses and take a rhythm test.", "Interview Questions": "What would you do if a patients rhythm became critical."}, {"date": "5 Mar 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Swedish (Seattle, WA) in Feb 2015", "Interview Descriptions": "I had a 1 hour interview with the executive medical director of the hospitalist team after receiving a recommendation from a fellow hospitalist. After I was put in contact with the medical director the interview occurred in under 6 days. The director was very professional and informative.", "Interview Questions": "Strength? Weakness? What would your coworkers say about you?"}, {"date": "5 May 2016", "title": "Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Swedish (Seattle, WA) in Feb 2015", "Interview Descriptions": "I applied for job in late December, and then was emailed regarding setting up a phone screen. I then had the initial phone screen with HR, with a follow-up Skype interview with the hiring managers in my department. My offer came in February.", "Interview Questions": "Asked for examples of problems solved in the workplace and what my plan of action was in solving them."}, {"date": "4 Apr 2015", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Feb 2015", "Interview Descriptions": "After filling in an application form online, I was contacted through email several weeks later for a chance to set up a general interview. During the interview general questions were asked, what the salary would be and what to expect for the SECOND interview, which would be with the actual hiring team for the specified floor that you chose to interview. There would be 6-8 team members during the second interview. The interview processes is extremely slow and it takes time for them to set up interviews and answer back.", "Interview Questions": "Why Swedish Medical Center?"}, {"date": "5 Mar 2015", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Feb 2015", "Interview Descriptions": "First Round on campus, one case followed by a behavioral.  A second round was offered at their office and was rather informal.  \r\nThe first round interview will be with two team members from the department, most likely a hiring manager and a senior team member.", "Interview Questions": "Tell us about how you handle situations where you are faced with something you do not know how to do?"}, {"date": "6 Jan 2015", "title": "Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish", "Interview Descriptions": "friendly staff, interview coordinated by an admin through Google Calendar. Very quick follow up. Offered 2nd interview before I left from the first one. Offered the job before I left the 2nd interview", "Interview Questions": "how would your friends describe your personality? What part of your personality do you hope this position will accentuate?"}, {"date": "20 Dec 2014", "title": "Human Resources Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Swedish", "Interview Descriptions": "Very structured behavioral interviewing with strict adherence to interview questions.  I experienced no flexibility in the interviewers to ask exploratory questions based on what you said - always used the boxed questions.  Made the interview a bit awkward and stiff feeling to me as the interviewee.  Just be prepared for this very structured approach.", "Interview Questions": "N/A"}, {"date": "22 Jan 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Swedish (Englewood, CO) in Dec 2014", "Interview Descriptions": "I was transferred from another facility. No interview usually was required. I got good referrals from another facility.       I worked already 1 year in same facility but in different location.", "Interview Questions": "N/A"}, {"date": "10 Jan 2018", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Swedish (Seattle, WA) in Oct 2014", "Interview Descriptions": "The interview process is long and tedious. If HR believes you do not have the degree they desire or the minimum experience of 5 years, they will not contact you. If you have a manager who wishes to hire you even without a degree, they must work around HR to hire you.", "Interview Questions": "Are you interested in growth, medically?"}, {"date": "19 Jul 2014", "title": "Pateint Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Swedish (Seattle, WA)", "Interview Descriptions": "Scattered and unorganized - as the company is transitioned into Providence systems, the quality of people and level of experience is exceptionally low with very few people coming from a medical background. The process was crazy - first HR, then multiple clinic directors, all with different agendas and needs, and no solid clarification on the direction or the needs of the position. Constant mention of replacing \"seat fillers\" - be wary - not even woth the experience on your resume at tyhis point.", "Interview Questions": "How do you tolerate verbal and sometimes physical abuse?"}], [{"date": "16 Jul 2014", "title": "PSC Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Swedish", "Interview Descriptions": "phone interview, in person interview, meet and greet. Time from application submission until they contact me for an interview was long- months! But after interviewing, I was offered the position right away. new employees go through a  2 day corporate training upon hire", "Interview Questions": "How do you prioritize?"}, {"date": "22 Aug 2014", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Edmonds, WA) in Jul 2014", "Interview Descriptions": "My hiring manager was really nice, honest and direct. She asked me how to describe myself as a worker and gave me an opportunity to discuss my work experience. Then she talked about what she was looking for an employee. We had a match which was perfect!", "Interview Questions": "Everything was straight forward. I wasn't thrown off guard with any particular question."}, {"date": "23 Feb 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Jun 2014", "Interview Descriptions": "Video interview, phone interview, and face interview.it was to the point and I was offered the job the same day as the face interview.the manager and assistant manager was very nice , gave a tour of the clinic, and gave staff a chance to ask me questions.it was very easy.", "Interview Questions": "How do you handle stressful situations"}, {"date": "10 Jul 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Swedish in Jun 2014", "Interview Descriptions": "3 interviews; with HR, manager, and panel. competitive, but it was a straight forward process. be able to talk about experiences and show your personality- engaged, motivated, and desire to learn are all important over knowing specific RN tasks. ask questions at the end!", "Interview Questions": "conflict management, making mistakes and owning up, communication. very straightforward. think behavioral questions and have some scenarios that highlight your ability to communicate, use resources, and work well within a team."}, {"date": "16 Dec 2018", "title": "Dispatcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Swedish in Jun 2014", "Interview Descriptions": "Professional and really thorough. Was a little nervous, the manager was really intense at the time of the interview. I was asked alot of questions about situations having to do with the job I applied for.", "Interview Questions": "How would you handle a difficult co-worker"}, {"date": "30 May 2014", "title": "Registered Nurse Resident Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Swedish (Seattle, WA) in May 2014", "Interview Descriptions": "I initially filled out a general online application for the RN resident program. I was contacted by HR to schedule an initial interview which had to be on the phone due to me being out of town. I didn't hear anything after the interview for 2 weeks and I had to reach out for them to tell me I was selected to continue on. It was another 2 weeks between that point and my in person peer interview. This interview took place on the specific unit with two nurse managers and two current floor nurses. They \"graded\" each interviewee and supposedly ranked each one and decided from there. I had no issues with the actual interviews.\r\n\r\nHowever, the hiring/interview process for this specific RN resident program was a disaster. The first \"hiccup\" happened for the phone interview--the interviewer had no idea that it was a phone interview thus calling me 50 minutes late after I spoke with the recruiting coordinator. The time lag between initial application and in-person interview was over two months and the time it took to make the decision was unexpectedly long. I felt as though I would never have been contacted if I didn't reach out several times along the way. It seemed as though the communication between the various departments was rather disorganized. The coordination HR and the unit managers seemed disjointed. I know I am not the only one who had such difficulties with this process through Swedish.", "Interview Questions": "The questions were as to be expected. The phone interview was typical questions such as why Swedish? Why (insert specialty here)? Can you commit to working two years for Swedish? etc. The in-person peer interview questions looked for specific examples of situations where you had to adapt, lead, etc."}, {"date": "26 May 2014", "title": "NICU RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Swedish (Seattle, WA) in May 2014", "Interview Descriptions": "I applied online for the residency position and emailed HR to check in. I was eventually given a date for a phone interview and afterwards received a call back to schedule an in person interview. This particular unit used an interview team with a variety of employees for a behavioral interview before giving me a tour of the NICU.", "Interview Questions": "All were behavioral questions, just remember to work on developing specific examples you can apply to a variety of questions. My most difficult question was regarding how I handle conflict. But I believe they just want to make sure you are well spoken and manage conflict in a responsible, respectful manner."}, {"date": "20 Mar 2014", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish", "Interview Descriptions": "lots of behavioral questions, and \"name a time when\" questions.\r\nIts good to  kind of write down some past experiences where you had to go above and beyond, or when you dealt  with an irate customer ect", "Interview Questions": "the questions where all pretty standard"}, {"date": "28 Jul 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish (Seattle, WA) in Mar 2014", "Interview Descriptions": "group style peer interview with questions more aimed at your problem solving skills.  They seemed to be checking into your interpersonal skills.  The were checking to see if I would fit into the culture and team on that particular floor.  They were very honest concerning the staffing matrix and my expected duties and competencies.  The interview team was comprised of multiple members of other floors from all levels including managers, CNA, and staff RNs.", "Interview Questions": "name a difficult situation that you have had in the hospital setting and how you handled it safely to the patient's satisfaction"}, {"date": "12 Oct 2013", "title": "Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Swedish", "Interview Descriptions": "It can be hard to get your foot in the door. It does help to know someone who can give your resume directly to the manager in addition to going through HR. That is what I was finally able to do after trying to get a job here for a couple of years. The hiring and interview process is quite prolonged and thorough. At the time I was hired, new employees had to take a behavioral test which asked questions like \"Would you take home office supplies for personal use?\" I don't believe they do that anymore, however. Current interviewing usually involves an individual and panel interview. Once you are hired, there is an extensive background check.", "Interview Questions": "I don't really remember. But I know that current interviews involve questions about specific scenarios and how you would handle each one."}], [{"date": "1 Oct 2013", "title": "Patient Access Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Swedish", "Interview Descriptions": "The hiring process starts with a phone interview with a recruiter. Once this is complete, an interview is scheduled with the hiring manager and possibly two team members. In most situations this is the end of the process and the manager of the department will make a selection. HR will then call and make a job offer. \r\n\r\nDuring the process, I had a second interview and was interrogated by the a senior leadership person. This should have been a huge red flag. The red flag was ignored. The department manager offered the job over the phone. The rate of pay was significantly less that what a contract person was making for the same position. The manager was embarrassed. The manager contacted HR to obtain a pay range to offer. It was a little better that what the contract pay was.", "Interview Questions": "The most difficult was to keep my composure while being interrogated by a senior leader. It was awful and very unexpected. I had never experience anything like this before. She was rude, demeaning, and very unprofessional."}, {"date": "22 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Swedish (Englewood, CO) in Jun 2013", "Interview Descriptions": "met with assistant director, then they wanted me to meet some of the staff.  We talked about the typical interview questions.  asked a few clinical questions. showed me around the unit", "Interview Questions": "where do i see myself in 5 years"}, {"date": "19 Jan 2013", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Swedish", "Interview Descriptions": "After applying online it took a little over a month before I received a call from HR. A quick phone interview was conducted and then an in person interview was set up for the following week. The interview was fairly standard. We went over my resume and then went over some scenarios that could come up, and some past scenarios that were related to issues that could come up in the job. The interviewer was very friendly and I felt very comfortable! After that I met with the clinic supervisor for another interview. That was very general. We went over my resume and skills and discussed the position and work environment. Very laid back.", "Interview Questions": "For me, I did not find any questions to be particularly difficult. I would say be prepared with examples of past difficulties in customer service settings, or examples of good and bad experiences with customers and/or co-workers."}, {"date": "7 Mar 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Swedish (Seattle, WA) in May 2012", "Interview Descriptions": "Basic, typical questions in a peer setting. \r\nInterviewed with HR over phone first. Interview was with a few RN's from the floor as well as the unit manager.  Everyone made me feel comfortable.  They asked about prior experience and why I wanted to return to floor nursing, as I was working as a transplant coordinator for the same hospital system.", "Interview Questions": "Tell us about a positive patient encounter"}, {"date": "3 Nov 2015", "title": "Revenue Cycle Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Swedish (Seattle, WA) in May 2012", "Interview Descriptions": "First interview and last interview were approximately two months apart.Phone interview with recruiter. In person, panel interview that involved recruiter and two managers. Third interview involved hiring manager and team. Overall, this was a pretty standard interview process.", "Interview Questions": "Asked about education and prior healthcare experience."}, {"date": "16 Apr 2014", "title": "Webmaster Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Swedish (Seattle, WA) in Feb 2012", "Interview Descriptions": "They reached out to me (following my initial application) rather quickly. The recruiter was engaged and personable. The interview went very well and I felt there was a real professionalism and humor (it was an interview with two executives). The questions were pretty standard.", "Interview Questions": "Tell us the reason you want to leave your current employer."}, {"date": "4 Apr 2013", "title": "Pharmacy Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Swedish (Seattle, WA) in Feb 2012", "Interview Descriptions": "Recruiting process, application submission via PhORCAS, interviews with 6-8 members of selection committee", "Interview Questions": "Have you ever stolen a pen?"}, {"date": "3 Apr 2014", "title": "Insurance Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Swedish (Seattle, WA) in Feb 2011", "Interview Descriptions": "Had a phone interview with a recruiter, basic questions.  I have plenty of experience in this field but she just stopped calling me back, no word on the job.  I knew someone at the company who just passed my resume to the hiring manager, and she immediately noticed that I was perfectly qualified...HR is just a roadblock really. They called me in for an interview with 4 people, couple of supervisors and the department manager, someone from HR.  After the interview they had me take a 3 page test on billing terminology and practices, as well as basic coding.  Didn't know all the definitions but I don't think they expect you to get a perfect score.  They called me within a week with an offer, and I started shortly thereafter.  Pretty quick once I actually got past the initial HR phase.", "Interview Questions": "They asked about my posting experience, and really focused on how many dollars worth per day because this company is huge and posting is non-stop.  "}, {"date": "1 Jan 2011", "title": "Volunteer/Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Swedish (Edmonds, WA) in Dec 2010", "Interview Descriptions": "Contacted the Volunteer Services Manager by phone and left a message to inquire about volunteering to complete my internship. She returned my call and stated they had one position and I would need to fill out an application first. I filled out the application and returned it the following day in person. I left two follow up messages and have not received a call back. Its been two weeks. I also, was referred to the Birth and Family Clinic and emailed my resume to the Manager and did not receive any acknowledgement about an internship, again I was referred by the Educational Mgr at Stevens. I am really disappointed at the lack of follow up and communication from Stevens Hospital personnel. Its been two weeks going on three and I have not heard back yet.", "Interview Questions": "Would you mind working in an different area than your area of studies?"}, {"date": "14 Jun 2014", "title": "Grant and Contract Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Swedish (Seattle, WA) in Sept 2010", "Interview Descriptions": "As I lived out of state when I applied for my position, all 4 of my interviews were conducted by phone. The first was with the HR recruiter. The second was with the hiring manager. The third was with the hiring manager and the team I would be working with. The fourth was with the hiring manager and the managers of the departments I would be supporting in the organization. Further, because of the economy when I was interviewing (2010), Swedish was unable to bring me in for an in-person meeting/interview. Because of that, I met with the Team Lead for the hiring manager when she was traveling to my area. We met for coffee and she further interviewed me to address concerns raised by the team and departmental managers about my seeking a position in a city to which I had never been. She was gracious and offered pointers to cement my position as the top applicant. I was contacted by HR a couple of days later with an offer of employment. I rated the interview difficulty as \"Difficult\" because the process was long with multiple interviews (essentially 5 interviews total including HR's interview to establish my qualifications).", "Interview Questions": "I was asked if I would be willing to pay for a trip to Seattle to interview without the possibility of being reimbursed. "}], [{"date": "4 Aug 2011", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Swedish (Seattle, WA) in Jul 2010", "Interview Descriptions": "You are called by a Swedish recruiter if your résumé meets their qualifications and you are interviewed over the phone. If you pass, you then are set up for an interview in person. For me this took at least a month.\r\nThe in-person interview was easy as the position itself is pretty simple. You are asked about your food handling experience and customer service experience. Any hospital or related experience will of course increase your chances of getting this.\r\nAfter having a job offer it took Swedish six months to hire me. No calls from the recruiter, nothing. One day out of the blue I got an e-mail asking me if I was still interested in the position.", "Interview Questions": "How would you deal with a difficult or angry patient."}, {"date": "6 Feb 2013", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Swedish (Seattle, WA) in Apr 2010", "Interview Descriptions": "1st one is phone interview\r\nthen with hiring managers", "Interview Questions": "why this facility"}, {"date": "8 Sept 2010", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Swedish (Seattle, WA) in Jan 2008", "Interview Descriptions": "Was contacted by HR via a referral from a former co-worker.  I had one phone interview and then was invited in for an all day interview with several staff members as a group and then several one on one interviews.  It is a very corporate atmosphere and there is a definitely an attitude of everyone should be doing more (a lot more) with less.", "Interview Questions": "How do you feel about data?"}]]