[[{"date": "29 Jan 2022", "title": "Human Resources Generalist/Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MSPCA Angell", "Interview Descriptions": "Recruiter reached out to schedule a phone interview which was a great conversation.  I was invited to interview virtually with 2 Generalists and the Director.  The interview and discussion was a great experience.  Everyone was so personable and they asked good questions.", "Interview Questions": "It was a behavioral style interview where I was asked how I would handle certain situations or recalling a time when i faced a certain situation."}, {"date": "24 Sept 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MSPCA Angell", "Interview Descriptions": "Very easy interview with department head. Lasted about 30 minutes, and involved a random ice breaker question that made it all feel very personable. I would recommend the job to someone.", "Interview Questions": "how do you handle difficult clients "}, {"date": "31 Dec 2020", "title": "Veterinary Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MSPCA Angell", "Interview Descriptions": "I interview with several different members of the department team, and shadowed another technician for a little while while he did his job.  I was given a tour of the place, and was able to ask lots of questions.  They talked about my skills and resume, and what my career goals were.", "Interview Questions": "What I was looking for in a job"}, {"date": "15 Feb 2020", "title": "Kennel Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at MSPCA Angell (Waltham, MA) in Nov 2018", "Interview Descriptions": "In applied online, it took 2 weeks to hear back from the hiring manager. I received an email from the technician supervisor to schedule an interview. A date was set during the same week and  I had a pleasant interview. I got to know more about the position and responsibilities. I received a tour of the facility and met some of the team members. And just before concluding the interview, I was asked to return for a working interview. We scheduled something the following week and it was about 3-4 hours long. \r\n\r\nI showed up in my own scrubs and got to shadow a kennel attendant and help out as needed. After 3-4 hours, I met with the supervisor again and was asked how I liked it and whether I was still interested. I was, and the next steps after that were references and then HR paperwork. She emailed me a reference sheet to fill out and after some time (1-2 weeks). I was emailed the offer for the position for HR after that and asked to go to the next upcoming orientation.\r\n\r\nThe whole process took about 6-8 weeks from the online application to the first day on the job.", "Interview Questions": "Give me an example of a time you've dealt with an emergency at work and how did you handle it?\r\n\r\nDo you have animal handling experience?\r\n\r\nAsked about what type of hourly wage I'm looking for?\r\n\r\nWhat are you hoping to gain here?\r\n\r\nHow are you\r\n\r\n"}, {"date": "8 Jan 2022", "title": "Vet Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MSPCA Angell (Boston, MA) in Aug 2018", "Interview Descriptions": "Asked valid questions, gave a good description of job expectations. They are flexible with scheduling and very timely with getting back to you about next steps for the interview process.", "Interview Questions": "What is your biggest weakness"}, {"date": "18 Apr 2018", "title": "Client Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MSPCA Angell", "Interview Descriptions": "Initially was contacted for a phone interview and was not contacted the first time. Had to reschedule and did not hear from the interviewer the second time. Tried to reschedule again and did not hear from the interviewer for two weeks to then set up an interview. Very frustrating, given I gave a very broad availability for calls and took extra time off during my current job to wait for calls that did not come, with no followup for days/weeks. Very off-putting and unprofessional.", "Interview Questions": "There were no questions, as I was not even contacted via phone. "}, {"date": "22 Jan 2018", "title": "Client Care Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MSPCA Angell (Boston, MA)", "Interview Descriptions": "Applied online and got an email back within a few days for an interview. Aftee going in twice, they waited almost 2 weeks to get back to me and were still staying silent on salary and I felt they were dragging the process out. Second interview was very awkward and the people interviewing did not know what to ask. Many quiet silences. I decided to stop pursuing this position.", "Interview Questions": "Along with the generic what are your strengths/weaknesses I was asked \"What new color crayon would you be?\" And \"What is your spirit animal?\" "}, {"date": "18 Mar 2018", "title": "Client Liaison Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at MSPCA Angell (Boston, MA) in Dec 2017", "Interview Descriptions": "It took weeks. I was originally contacted for the interview in December. Had two interviews (one phone and one in person) both lasting over an hour. After the interview s concluded, I was told I would be contacted after the holidays (understandable) to schedule a part three of the interview process. The last step would be a working interview. I patiently waited till after the holidays to email the hiring manager and after MULTIPLE attempts, I was completely ignored. No one even reached out to answer my questions, let alone talk about the position. Poor professionalism.", "Interview Questions": "What's your favorite animal?"}, {"date": "28 Aug 2011", "title": "Administrative Assistant/Law Enforcement Dispatcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at MSPCA Angell (Jamaica Plain, MA) in Feb 2011", "Interview Descriptions": "After applying to the job through Craigslist, I got a response almost immediately.  They asked me to come in that week.  The interview was relatively short (20 minutes).  It was one-on-one one with the head of the law enforcement department.  He didn't seem to have any prepared questions.  He asked me why I was interested in this specific position and where I would see myself in 10 years.  The interview was not very \"conversational\" and there was very little small talk, he was very down to business.  He mentioned he had interviewed a lot of candidates, and I was the last one.  He would pick three people to go on to the second round of interviews. \r\n\r\nI received a call from him the following week to schedule a second interview.  This time, I met with two people I would be working with directly.  This interview was more conversational and again, there was no prepared interview questions.  This interview took an hour and a half, and I did most of the talking.  They seemed very pleased with me and gave me a tour of the building before I left.  They told me they would get back to me in a week with their final decision.\r\n\r\nAfter a week and a half, I sent an email inquiring about the status of their decision.  They sent me an impersonal, generic email stating that they had decided to move forward with another candidate.  \r\n\r\nI had met or exceeded all of their requirements and had two positive interviews, so I replied to the email, asking what factors influenced their final decision.  I also asked if they had any critiques that would help me in my job search.  They never responded.", "Interview Questions": "We deal with high stress and highly confidential situations?"}]]