[[{"date": "7 Dec 2022", "title": "Academic Coach Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hudson County Community College", "Interview Descriptions": "Not interview only need to pass a test according to the subject you are applying for and demonstrate interest for the subject. The process is fast and is better to apply at the beginning of the semester", "Interview Questions": "N/A"}, {"date": "26 Oct 2022", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Hudson County Community College (Jersey City, NJ) in Jan 2020", "Interview Descriptions": "It was smooth but detailed. I was nervous but my interviewer was very welcoming and asked great questions. I felt comfortable answering them and asking my own questions. They had great answers to offer. I felt seen and listened to and during the interview my self-talk was, \"I hope they hire me\" and it just seemed like a great opportunity.", "Interview Questions": "How would you contribute to this role."}, {"date": "3 Mar 2017", "title": "PC Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Hudson County Community College (Jersey City, NJ) in Dec 2016", "Interview Descriptions": "Applied for the job.\r\nA person called back giving details of the job / payment information.\r\nTold me we set an interview where I will be tested on my hardware and software skills.", "Interview Questions": "Had to take a test on hardware and software."}, {"date": "21 Dec 2015", "title": "ESL English As A Second Language Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Hudson County Community College (Jersey City, NJ) in Aug 2015", "Interview Descriptions": "It depends on both interviewee and interviewer's schedules. If the company finds me qualified, there may be a background. Questions are usually about abilities and experiences and methods, especially the way a teacher may response to the students' misbehaves.", "Interview Questions": "How do you teach an abstract word that has no synonyms in the language you are teaching?"}, {"date": "4 Jul 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Hudson County Community College (Jersey City, NJ) in Jan 2015", "Interview Descriptions": "I attended an  info session with a group of other people to learn about about the tutoring position, what is required, which tutor needs were at the college, the difference between the different tutoring centers, the number of hours one can work, the salaries calculation (depends on the tutor's level of education and experience).  Then we met one on one with one of the coordinators, depending on the curriculum position such as math, English, or science.   At this time, I had to submit my transcripts, and they were reviewed on the spot.", "Interview Questions": "Asked about previous work experience, why we wanted to apply for a specific tutoring position.  How do we get along with others in groups and one on one.  How would we handle varied tutoring situations."}, {"date": "25 Feb 2016", "title": "Part-time Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Hudson County Community College (Jersey City, NJ) in Jul 2014", "Interview Descriptions": "The interview process was kind of informal. I spoke to the immediate supervisor, and was asked about what subject area would I be interested in tutoring the students. There was a scheduled written customized test on Math. Some problem solving. It was a little difficult, but the immediate supervisor was more concerned if you could explain your answer clearly. If you passed, you will be required to attend the orientation, which is paid.", "Interview Questions": "Asked to do Problem solving, Work and word problems, Algebra, Basic Math"}, {"date": "20 Feb 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Hudson County Community College", "Interview Descriptions": "The c.v. is sent to HR but the person who ciphers through them is a current student, not a recruiter!", "Interview Questions": "Describe your work experience. "}, {"date": "13 Jun 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Hudson County Community College (Jersey City, NJ) in May 2013", "Interview Descriptions": "I had an initial interview , then was sent to the desired department to be interviewed by the department supervisor. I was sent in the office asked to have a seat, the interviewer was very respectful and cordial. I was asked few questions then asked to wait for their response. They contacted me shortly within a couple of days to start.", "Interview Questions": "If I called your former boss to describe you, what he/she will say about you?"}, {"date": "14 Jun 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Hudson County Community College (Jersey City, NJ) in Aug 2012", "Interview Descriptions": "After being asked what I'd like to tutor, I was asked to: Write an introductory paragraph for the following:  Are school uniforms mandatory? Why or why not?  I was surprised.  This was an assessment, not an interview! That was it.", "Interview Questions": "Are you applying for English/Humanities or Math/Sciences?"}, {"date": "16 Sept 2012", "title": "Y Clerk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hudson County Community College (Jersey City, NJ) in Oct 2010", "Interview Descriptions": "Smile be your self always be very respectful, dress formal . Always be punctual and honest also when you talk make eye contact . The interview process is not to ask intimidating questions but to determine your personality , qualifications and your response to questions. It is not testing your knowledge and it is not a oral test.", "Interview Questions": "There is no difficult question the questions are more based off of you and how you can communicate well with others , personality and having the qualifications mentioned on the application."}], [{"date": "15 Jul 2014", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Hudson County Community College (Jersey City, NJ) in Jan 2010", "Interview Descriptions": "After you apply, you get called into a series of three or four interviews. In order to proceed, you need to pass a series of tests. In the first session, you write a summary of a short reading to demonstrate you can write at a college level. The subsequent sessions involve testing on chapters of the handbook you receive. You must present in front of your group on a topic of your choice to demonstrate your ability to hold a classroom. You must also role play a tutoring session. You also have an \"exit\" interview where they ask you about why you are so interested in the position and why you would be good.", "Interview Questions": "You have to do live role play of tutoring sessions."}]]