[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great organization", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Dec 2021", "job_title": "ESL Instructor in Aliso Viejo, CA", "duration": "N/A", "pros": "Nice coworkers, who are like family.", "cons": "Low pay and wish there were benefits."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Best Place if you can adjust to change", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Aug 2021", "job_title": "Admissions Representative in Towson, MD", "duration": "N/A", "pros": "Great Pay, benefits decent, open communication", "cons": "Alot of changes, departments not all on same page"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Enjoyed my time at Kaplan", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 May 2021", "job_title": "SAHM in Palatine, IL", "duration": "N/A", "pros": "People, some opportunity for advancement", "cons": "sometimes the reputation of for-profit education got in the way."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Mar 2021", "job_title": "Program Manager/Business Analyst in Boca Raton, FL", "duration": "N/A", "pros": "Able to grow in company", "cons": "Restructuring and merging always taking place"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Can't find a job making more $ for what we do...", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Jan 2015", "job_title": "Admissions Specialist in Orlando, FL", "duration": "N/A", "pros": "High salaries for those who've been in the business/company for 5+ yrs (not so much for new employees). Great benefits package compared to the competition.", "cons": "Easily replaceable by others who will work for far less $ and that point is driven home daily. KU used to be a great place to work. Now, only the salary and benefits package are keeping me here. It went from a university to a sweatshop. Our goals are constantly increasing, but our salaries are stagnant. Favoritism and unequal opportunities abound, but everyone on a team has the same goal. So it doesn't matter if one advisor gets 20 good leads and another gets 2, you both have to have 20 enrollments to keep your job. We're not allowed to drum up our own business so you better hope you can take enough to get by (from those who are fed and aren't able to follow up like they should). There is enough business at the table for everyone to eat, but some are given steak while others get beans. Why can't we all have hamburgers?"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Admission's Advisor", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Aug 2012", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Great training program but long, 3 weeks long and very detailed.  When you hit the sales floor many of the things you learned in the training class didn't match up with the various floor managers way of doing things. But the Ass. Director was quick to let you know how he wants things done.", "cons": "The overall culture consisted of reverse racism.  If you are not Black or Hispanic then your chances of a promotion as close to none.  There was a lot of internal pettiness and one step out of line could have you setting in an \"interrogation\" type of interview with 3 to 4 managers demanding you confess your crime.   Which anyone could say something negative about you, without giving their name.  In this high pressure sales positions you need to watch your back.  Not a place I would recommend working do to the lack of stability within the company and the hostile working conditions.    This company laid off about the interior Financial Aid team and closed down multiple teams ( 20+ people per team) one day.  The next day they had a champagne toast for not getting laid off with the promise no one else would be laid off.  Then later walked 25 more people out the front door with security."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "depends on position in the company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Feb 2021", "job_title": "Program Manager in Boca Raton, FL", "duration": "N/A", "pros": "Role is critical in determining your experience, can be very supportive.", "cons": "not every role allows for self actualization"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Used to be great", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Jan 2021", "job_title": "Customer Service in Orlando, FL", "duration": "N/A", "pros": "Only remote work is currently available", "cons": "Customer service is completely disorganized"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Sinking Ship", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 May 2016", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Free education, lifelong friendships , The training I recieved was the best however when I left efforts to coach and train had endedq", "cons": "I jumped ship last year as I witnessed every positive that had attracted me to KU become a negative. Management has made many unhealthy decisions that have depleted the organization of quality people. When you witness the best leaders and advisors  leaving  for other companies you know something is wrong. Many advisors have inflated salaries and  earn even  triple of what newer employees make even if the newer employee out performs. The  upside down salaries are known by all and is very demoralizing. Rules and policies change weekly and then change again. People are scared and confused of what happens next and most are seeking employment and searching for other jobs. All it takes is to visit the campus and see the empty parking lot and see rows of empty desks to know that this is not a growing organization. A very , very sad situation because this once was a thriving, happy environment full of loyal and happy advisors."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "What to really expect", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jan 2015", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "You meet a lot of wonderful people who have years and years of experience in the industry who are more than willing to help you. There is definitely a since of team unity since every employee is assigned to a team which normally consists of the people you go through training with and maybe some veterans. Even though  you are on a specific team other people are still very willing to help. The culture is very much so that the advisors take care of one another and maybe a few associate directors are helpful. The compensation is great the pay and the benefits all kick in on the first day of training.", "cons": "The cons mainly lie with management. If you're lucky you will end up on a team where you have an associate director who is genuine and really cares about helping their team grow and learn. If you are like the majority you will unfortunately end up with an associate director who is more concerned about themselves than their team. Its a very numbers driven environment. You are really forced to take people who really are not aware or qualified for this level of education, not ready for an online environment, and the financial aspect of being enrolled at Kaplan University. The associate directors micromanage with an attitude of beating you down with negativity instead of teaching you how to improve. The directors of admissions are even worse. Their priority is numbers only and they have a very hands off approach to really helping employees succeed."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Great Company Vision with Misaligned Growth/Salary Opportunities", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Jan 2014", "job_title": "Senior Manager in Fort Lauderdale, FL", "duration": "N/A", "pros": "Some really great people to work with.  I was able to perfect my craft, but only because I was self-driven to excel.  Opportunity to grow, but unfortunately capped.", "cons": "1. Company core values changed so frequently that it was hard for them to stick and create a true company culture.\r\n2. For some roles the work/life balance was weighing more on the work and less on the life \r\n3. Management was not consistent with managing employees on the same team and on the same role although KPI's were exactly the same, the inconsistency was unprofessional.  A lot of favortism"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good courses and good pay to treat students as customers.  N.B. Last year was 2009 but 2011 was the oldest option.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 Jan 2015", "job_title": "Online Faculty in Palm Beach, FL", "duration": "N/A", "pros": "The courses in Humanities are very good in regard to content and presentation and the terms were short at ten weeks long.  The pay is leveled by degree and experience and went up to 2800.  If you can be enthusiastic about a for-profit educational corporation where the students are customers and the \"brand\" is all, then this is definitely for you.", "cons": "The program has the flaws of the for-profit educational institution; viz, they treat students as customers.  The staff treats faculty well but it is understood one will do what can be done to help the students \"succeed,\" it's all about the cash flow and enrolling students.  The weekly one hour webinars are not bad but the students only receive five points so they have less interest.  Multiple discussion boards each week (at least two, sometimes three) and the demand that one posts at least eight times to each.  That's not bad but the expectation is that one will post 36+ times each week.  Tedious extra work to monitor student progress is not hard but does not enhance the position.  The staff does not back up faculty well and, generally, concentrates more on one student complaint in contrast to multiple good reviews.  Of course, this is the \"student as customer\" mentality."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Call center telemarketing", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "7 May 2012", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great group of co-workers. One giant family. Opportunity to obtain degree at no cost through Kaplan online.", "cons": "Pays less than competitors. Very slim opportunity for upward mobility.  A lot of pressure placed on the number of enrollments needed in a very clearly put \"sales environment\" without the pay.  No bonus or commission but you have expectations that need to be met. Management operates under under a very tight knit good old boys club where corporate politics will play a role on where you end up."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Another Call Center Masquerading as a University", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Jan 2014", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Training is very top notch and informative I felt very prepared for my role as an Admissions Advisor. The pay is good and you receive benefits and PTO from the first day, which you don't see very often from most companies. Finally, there is a cafeteria on site so you don't need to go out for lunch (1hr)", "cons": "Well after training and all the dog and pony shows...you come out into production. During the interview, I was told we are helping students improve their lives, which is true to a point. That changed when the manager informed us that \"this is a sales job.\" They weren't wrong neither when they said that since if you didn't hit your targets it was strike one. If it happens again strike two, and finally strike three...Your'e Out!!! I've done lots of phone work before and to this day, that was one of the most stressful jobs I've ever had. Management has been known to play favorites, so if you're not on The A Team, then its a long ride uphill. Since then they have changed some things, so if you decide to interview ask lots of questions,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Place to Work Grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Jul 2012", "job_title": "Associate Director of Admissions in Orlando, FL", "duration": "N/A", "pros": "Excellent Product, a school with a curriculum rigerous and substanial provides real working knowledge for current and future professionals.  Great core group of management staff and advisors who truly care about our main mission \"Changing Lives\", as well as keeping it a great place to work. I have referred friends to Kaplan for both education and employment and I tell you there is no better feeling than to see you friends succeed.  Watching a friend walk across that stage knowing that school was the futherest thing from their minds years ago, now they are changing careers, getting a promotion or actually \"Have a career now\".  Or the communication from your employment referrals on they appreciate the opportunity, how they are outperforming their peers, how they are moving up within their departments. Refering the right people makes you feel good all the way around.", "cons": "Tough times create some uncomfortable situations.  Things have been lean and some tough decisions made. But as tough as those decisions have been, I believe it has put the company in a better position to grow. \"Already seeing the positive results\""}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Terrible job!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Mar 2013", "job_title": "Admissions Advisor II in Fort Lauderdale, FL", "duration": "N/A", "pros": "Benefits on first day and free tuition. The best decision upper management ever made was firing my former manager in July 2012. He was the worst and most unhelpful manager I have ever encountered, yet had a huge ego. Upper management finally realized to fire him based on performance and that they shouldn't keep him based on where he was from. That same manager didn't even have a degree, yet his admissioins advisors were expected to have at least a bachelors.", "cons": "Management constantly talks down to their employees and everyone is treated like a number. Job is a very low level inside sales job. You need to hit a certain quota every month which constantly changes and if you don't and your not one of managements favorites your fired. Some people are given good leads and some are assigned poor leads, your success will be determined by how much managers like you. Some admissions advisors job roles were changed back in July to\r\njust simply answering the phone with no sales goals. They kept the same pay but had job security because how can you screw up answering the phone. Although many of these phone receptionists quit out of boredom. Constant layoffs and a feeling that you could get fired any day."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Has potential but fading fast!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 May 2013", "job_title": "Management in Fort Lauderdale, FL", "duration": "N/A", "pros": "The pro's here are that the company does have some great people in high positions that do try and make a difference all the time. The training department is awesome and they really do get you ready to do the job. A lot of good solid people working here in the trenches.", "cons": "The cons are that there are just as many bad apples in high positions as the really good one's. There is favoritism and a lot of the time this determines who gets the \"good leads\" (the job is goal based), favoritism also decides who gets promoted. Performance will get you noticed, however \"cozying up\" to management is the only way to really excel here. Unfortunately it drives away top talent."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Student Accounts Representative", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 May 2015", "job_title": "Student Accounts Representative in Plantation, FL", "duration": "N/A", "pros": "The pros are.. the pay and benefits.", "cons": "Management ..What management??   \r\nManagers don't know how to manage or respect their employees.  Management and Human Resources work together to encourage bad behavior.  Managers do not receive training on how to deal with human beings and how not to show favoritism.  Bad review don't phase them either they only blame the employees.\r\n\r\nFavoritism is rampant.  Management show who they like and dislike on the floor all day everyday.   I have never experienced anything like this where its all about who you know with all management across the board.  \r\n\r\nThere is a lot of talented and educated people they do not recognize or like because they obviously feel threatened by anyone who can read or write.  No chance of moving up the corporate ladder in this place ever unless you are bff's with someone at the top."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Kaplan is worried more about student reviews than anything else", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Feb 2019", "job_title": "ESL Instructor in San Diego, CA", "duration": "N/A", "pros": "Most of the students were amazing! Eager to learn and they were so helpful to eachothers needs as well. I really really loved my students.", "cons": "Some of the students were completely catered. They were on student visas and would come check in and leave the classroom for the rest of the day and never come back. Kaplan was more worried about negative reviews than reiterating to students that they were on student visas... AND they would expect very thorough reviews on students every 6 weeks- some on students who may have only been in my classroom for a couple days— and would not went to compensate for time spent on these reviews, I.e. would be called into management office explaining any logged time for reviews or lesson planning. Keep in mind—- Kaplan rarely employs full time teachers!!! You’re part time even if you’re basically working full time!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great co-workers, Horrible Management", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Jun 2012", "job_title": "Admissions Advisor II in Orlando, FL", "duration": "N/A", "pros": "Training was fun, good co-workers, and if you like talking on the phone, then you will enjoy your position.", "cons": "Micromanagement is rampant within Kaplan.  You literally have to set a status on your computer to let your direct manager know where you are.  Bathroom break?  Make sure you let someone know.  You are treated like you are in high school, but even then I had more freedom.  Also, management is extremely based on favoritism.  If your direct manager likes you, you can scoot by without problems.  But if they do not, you are constantly waiting to be \"called into an office\" or walked out the door."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Long Time Kaplan Employee - An Honest Assessment", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Jan 2018", "job_title": "Project Assistant in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great people, stable company, good work atmosphere, excellent benefits, covered parking, on-site cafeteria.", "cons": "Little or no career path, tiny annual raises (no matter how much you excel at your job), top heavy management structure,  difficult to post or move around in the company, insanely complicated review process that takes up too much time and results in no action or plan,  the company is always crying poor, but the executives make gobs of money, and the workers sometimes get 1% raise (or zero some years).  Apparently, the only way to move up and earn more money is to go somewhere else. They have a good time off policy, but there is never a good time to use it.  The entire company is very, very understaffed, and very, very overworked.....and there is a lot of attrition because of it."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Kaplan is Great...It's this particular dept.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Oct 2014", "job_title": "Support and Solutions Representative in Fort Lauderdale, FL", "duration": "N/A", "pros": "You have a job and free education.", "cons": "There are no schedules changes. They hired someone off the streets and gave them the schedules we asked for. You will take 70+ calls per day. You cannot take breaks if someone else is on break. You cannot have lunch with a coworker. You will be doing the menial tasks of other departments. You will not be doing anything technical. The job is now customer service. They have implemented to new scale, which means no more raises. You will be taking calls, chats, and emails simultaneously. You will required to complete tasks that take approx. 2 min. in 30 secs time meaning another call will be coming through. They have combined us with Registars which means you are getting yelled at daily for something you have no control over and cannot fix."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Kaplan University Indianapolis - Company Good, Management Bad", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Apr 2018", "job_title": "Anonymous Employee in Indianapolis, IN", "duration": "N/A", "pros": "The company promotes volunteering, which is excellent. They also try to have open communication, so there are many meetings where we can watch videos on what's happening.", "cons": "The management team there talks badly about other employees to other employees, they complain about one another behind each other's backs and they discriminate based on age. If you're young, you will be expected to do much of the workload while older staff can relax more. One member of management was never even in the office because she felt like \"working from home\" every week. Another was able to slack on deadlines while the younger ones would get a firm talking to if they weren't met. Special privileges given to older staff members and those \"favorited\", others must comply by the rules. Some members of management didn't care about the ideas of other employees, they just wanted to be controlling."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great place to work, if you can't find anywhere else.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jun 2010", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "The best reason to work at Kaplan is that they will actually hire you.  They hire EVERYONE.  They give you a shot for about 3 months and you either make it or you don't.  If you're struggling to find a job in sales, they'll give you a salary while you look for something else.", "cons": "They bill it as a sales job, but you get none of the benefits of being in sales. i.e. commission, time off when you want, freedom to work independently.  You DO however get to put up with cheesy sales floor tactics - rah rah meetings everyday, pointless \"games\" with no spiffs attached, daily pressure from management. - not a sales job, just a holding pattern. Also, if you are looking to move in to management, you better come in as such.  Over 90% of management is brought in from outside sources."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Kaplan is claiming to change but hasn't that much.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Oct 2010", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "If you can get employment outside of Admissions, then it should be a great opportunity.  If you are able to get employed right now, at least it's a job with better pay than unemployment.", "cons": "Tremendous amount of micromanagement with you being monitored in all accounts of the job.  Calls are closely monitored and if you make mistakes, no second chances are given (hence the revolving door).  They have no problems firing employees no matter how long they have worked for the company, even for petty mistakes.  Many of the management staff still continue to put high amounts of pressure on the advisors to sell, sell, sell.  You are expected to follow a strict schedule that is given to you weekly telling you when to take breaks and lunch."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good place to work only if you can sell", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Jun 2010", "job_title": "Admissions Representative in Boca Raton, FL", "duration": "N/A", "pros": "Kaplan university is a nice environment to work. Everyone at the work place is super nice and very helpful. The management is very flexible about schedule and time off as long as you can produce as in sell education.", "cons": "Kaplan university is a revolving door, they are always hiring and always firing. When they hire you they give you a three month time period to make a minimum number of sales and if you can not cut it they will fire you after three months. As such it is not uncommon to see your whole team get fired and you get left with new hires. The recruiters tell you that if you can not sell they will shift you over to a different position but that is a lie and you will be fired if the numbers are not met."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Unqualified cold call sales nightmare", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Apr 2013", "job_title": "Admissions Advisor in Phoenix, AZ", "duration": "N/A", "pros": "If there are any, none come to mind.", "cons": "Production is king. Whether you're doing the best thing for the student or not is secondary. Your numbers are more important. Poor leads . . . these are folks that are, for the most part, looking for work and led to believe, by the aggregaters, that they are in the right place. The advisor is then supposed to get them into school. Finally, until the very end, management led everyone to believe that they were not going to close the site. They even lied to all of us."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "It's not about the Student, it's about the Numbers", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Aug 2010", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "There is the opportunity to make upwards of 6 figures. However of the 1500-2000 admissions advisors there are less than 10 in the company. Benefits from day 1 and the opportunity to take apart of the Gift of Knowledge which is free education after 30 days. This includes the Masters program if you have a bachelors already.", "cons": "It's a numbers game. Pressure tactics to enroll students. Encouraged to come in on your day off if you are behind in your numbers otherwise your job will be on the line. Micro managed on every thing you do. Strict adherence to breaks and given lunch times. Favoritism in promotions and no clear path on how to move up. If you boss likes you than you are given a shot."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Education Advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Feb 2015", "job_title": "Education Advisor in Chicago, IL", "duration": "N/A", "pros": "An opportunity to learn about the online college and ever expanding education industry, has pretty good benefits.  The work life balance is good.  If you love people it gives you the opportunity to have a positive impact on people, by building relationships and helping them to achieve their career goals through higher education.", "cons": "As the economy suffered, like many companies they've learned to run on a leaner staff.  The day to day task are extremely out of line and don't commiserate with the salary.   They've gotten away from the culture that challenged you, but left you feeling fulfilled.  There is a workhorse mentality that doesn't do well to show appreciation in valuable ways that make their employees feel truly appreciated."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": 0, "review_title": "Adjunct Instructor", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Nov 2016", "job_title": "Adjunct Instructor in Fort Lauderdale, FL", "duration": "N/A", "pros": "The students are wonderful and work hard. Some instructors forget that this is not a brick and mortar institution, but a school where the students, have many other obligations. They are parents, employees with many having more than 2 jobs, grandparents, some are still taking care of their own and grandkids, etc . . So, they do deserve extra consideration and they pay a lot of money for the classes.", "cons": "The school is making a lot of money on each student, but keeps the adjuncts at a max of $2600/per class of 24. Most of the classes have way more students, but you are only incrementally raised by a $100 over 30/class and similar for more. You can max out at 40/class and may only make $2800/class. Adjuncts receive no bennies and it is less costly for the school to hire them, and their is a large pool of applicants to choose from."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Meh", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jun 2012", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "-Decent Pay\r\n-Decent Product behind you\r\n-Interesting Coworkers surrounding you\r\n-Good Pit Stop on your way to another career", "cons": "-Can be very stressful\r\n-Leadership (Above the site level) do not convey strength or motivate staff \r\n-Supervisors at all levels tend to be disconnected at times\r\n-Communications has always been and will probably always be a bad part of Kaplan University\r\n-Lack of growth opportunities (has been improved a little as of Summer 2012)\r\n-Misleading marketing makes the job a lot more stressful and even poses internal moral debate when your job (implied) is a bait and switch.  \r\n-Non Stop rumors of Orlando getting shut down and layoffs really bring the morale down."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Unprofessional Work Environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Oct 2018", "job_title": "Financial Aid Officer in Fort Lauderdale, FL", "duration": "N/A", "pros": "The health benefits are great and they are somewhat flexible with scheduling. You can start as early as 6:30 AM if you prefer and sometimes management will buy lunch for the team.", "cons": "Managers will yell in your face at meetings, even if you are sitting right next to them. People were afraid to ask questions after the first 3 meetings and I was there for a year. Managers play favorites and will threaten to fire employees at least once a week. There is a high turnover rate. Promotions happen because of this high turnover rate, not because someone is competent. They are now Purdue Global, maybe the people are better since I've left."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Phoenix admissions is an excellent place to work.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Nov 2012", "job_title": "Admissions Representative in Phoenix, AZ", "duration": "N/A", "pros": "Clear direction from local management, good team atmosphere and realistic individual goals.  Local management is very open and honest about both the process and results of the organization.", "cons": "Kaplan is HQ in Florida.  The HQ organization is highly fractured, seems to be operating in a panic mode and every policy and every issue seems to require an extended review by the legal department before anything can be done.  Senior management is very territorial and risk averse and the net result is that while local management in Phoenix is consistent, open and honest, the level of confusion on virtually everything to do with the state of the business coming from Florida makes it almost impossible to understand where the business is going and what the mode of operations will be at any given time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Military Admisssion Officer", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jul 2015", "job_title": "Military Admission Advisor in Orlando, FL", "duration": "N/A", "pros": "Was a paycheck and it taught me what a terrible company is.", "cons": "Everything! The management did not care about any of their employees. They looked for ways to fire you. The favoritism and corruption was rampart. Some of the things that thee company directed the managers to enforce upon the admission were out right illegal. One of my bosses had no college degree and a thug mentality, she should have never been allowed to be employed at a so called university while never having gone to one herself. My other boss was a \"yes man\" to upper management with a napoleon complex, he would throw you under the bus right in front of you. We were given a what to say to reporters when the for profit industry got caught doing un-ethical business practices. \r\n\r\n It is by far the worst company and I do not know how they are still in business. DO NOT work there unless you are about to be homeless, but have an exit plan."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Kaplan is where good professors go to whither on the vine", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 May 2013", "job_title": "Professor in Davenport, IA", "duration": "N/A", "pros": "In the beginning Kaplan was a great place to work. That is when the academics were in charge and the focus was on the education part rather than the profit part. That has changed drastically.", "cons": "Professors at Kaplan have absolutely no academic freedom whatsoever. The curriculum and teaching is all \"canned\" and controlled not by academics but by the coorporate side. The classes are so automated that professors really could stop showing up for weeks and the students wouldn't even notice it. Professors do not create the assignments, nor the exams, nor select the books, or any other part of the course. Professors at Kaplan don't teach, they are just renting out their credentials. It is all controlled by the man/woman behind the curtain."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Started out as a flexible, employee-supportive organization and turned into a corporate shell masquerading as a school", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Mar 2015", "job_title": "Administrative in Los Angeles, CA", "duration": "N/A", "pros": "Stable employment (if you hold to their ideas of 'service' to your customers, er, students -- and don't make waves in trying to point out the differences in management of a business versus success of a school).", "cons": "Limited (read: almost no) advancement opportunities, no incentive for employees to remain loyal to the company, hypocritical management, being a cog in a giant machine that only functions to take money from its educustomers."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A college created by lawyers to manipulate government funding...", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 Nov 2015", "job_title": "Associate Director of Admissions in Boca Raton, FL", "duration": "N/A", "pros": "I made over 100K per year..", "cons": "I defrauded the government and everyone I sold this program too.  \r\n\r\nMy wife at the time told me to look at our life and out home... it was all funded by financial aid.\r\n\r\nKaplan executives will argue that they are giving educational/career opportunities to people who would not normally have them.  The truth is Kaplan University sought out the most financially destitute people regardless of whether they were prepared for college because our politically correct government will unbiased-ly pay for education.\r\n\r\nFrom VP's snorting cocaine to commission based compensation for 9 years I saw it all.\r\n\r\nI was as guilty as anyone.  I feel dirty thinking about it.\r\n\r\nI learned a lesson in karma and I now live with principle and integrity at the forefront of my life.  I owe Kaplan in a way.  I've experienced the dregs of humanity from top to bottom."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Financial Aid", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Aug 2015", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Teaches you how to multi-task\r\nMultiple training opportunities and programs\r\nFree tuition\r\nGreat benefits\r\nCompetitive Salary", "cons": "Travel policy is horrible.  No corporate card. Must pay upfront to get reimbursed.\r\nBureaucratic promotions\r\nWill give you a title with a job description, but have you filling in for all the roles that were laid off or fired instead of promoting you or paying you for that role\r\nCommunication is a failure;\r\nSneaky tactics on firing people\r\nWill allow those who don't work to stay in their role w/ no corrective action, and make the busy bees make up for what that person doesn't do --shifting workload \r\nOnly room for Growth in Florida offices; none in Chicago or other locations"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "High stress sales position", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 May 2015", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "You learn alot about sales and refine your sales skills. The high pressure environment can actually make you a better sales person.", "cons": "Always feel like you're one bad cycle away from losing your job. Job is not like any other sales position where the deal is closed and the prospect pulls out a credit card and its over. You get no credit if the student enrolls but doesnt start. These are things you cannot control. You cannot make someone start if they dont want to. Your job depends on lazy, umemployed, slackers doing their part to better themselves. High buy in required from prospects."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't work at KU", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Apr 2013", "job_title": "Financial Aid Manager in Fort Lauderdale, FL", "duration": "N/A", "pros": "If you're good with corporate politics might be good for you. I was promoted 3 times within 2.5 years.", "cons": "Management has no idea what they are doing. They promote people with no management experience and expect them to run teams of 10+ employees. In the time I worked for the Financial Aid department they changed HR contacts 6 times in 2.5 years so that if you had to complain you could never get a hold of anyone. If your manager didn't like you they WILL find a way to fire you. Teams are poorly trained and training team really doesn't know Financial Aid regulations or company policies. Each location - Fort Lauderdale, Orlando, and Chicago all do different things and hate each other. Company values are a joke. Students don't come first and never will. If you make it at this company for more then a year you'll be wondering how this company is still in business."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Just an amazing place to work!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Sept 2016", "job_title": "Tech Support in Orlando, FL", "duration": "N/A", "pros": "The atmosphere is absolutely amazing. One of the best call center environments I've ever been in. What makes this job great is the people. You make friends that'll last a lifetime and the resources provided by management are wonderful. If you have the desire to do well a manager will take you under their wing to help you reach your career goals.", "cons": "Things change in the education industry very quickly and it seemed like Kaplan fell behind the competition regarding optimizing mobile platforms. They've just recently got on the ball about it but they still have a lot of work to do."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "This company will chew you up and spit you out", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Jun 2013", "job_title": "Instructional Designer in Chicago, IL", "duration": "N/A", "pros": "Few: some employees can work from home, hours were not monitored and I was generally not micromanaged", "cons": "Toxic work environment, terrible corporate culture, extreme top-down management, no communication from higher up whether it's company benefit changes or raises or your new boss or your day to day work. I was on a need-to-know basis. Your job description can change on a dime. Egomaniacal managers are allowed to run amok. Different employees in the same division, even with the same job title, can have wildly different job duties, salaries and perks depending upon who their manager is. It is not a meritocracy: good work is not rewarded, only sucking up. No opportunity for advancement. Extreme focus on the bottom line--which is not that unusual, but this is an EDUCATION provider. All the best people bailed. The Chicago office couldn't keep an HR director for more than 8 months. Can't believe they're still in business."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Mixed Feelings", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jan 2017", "job_title": "Anonymous Employee in Fort Lauderdale, FL", "duration": "N/A", "pros": "The company does a lot of community work and makes it a point to recognize outstanding employees.", "cons": "Employee experience and recognition depends heavily on direct supervisors. Although there are employee surveys, it doesn't seem that the leadership is truly paying attention to what employees are saying.  This results in department heads who are taking advantage of their control, and employees who would otherwise have a lot to offer being stifled by management."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Nepotism to its MAX", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Oct 2012", "job_title": "Admissions Advisor in Plantation, FL", "duration": "N/A", "pros": "Benefits are good, and you get to take classes for free, but the education you receive is not of quality at all.", "cons": "The admissions advisor position at Kaplan University is a pure sales position. If you think that you are going to be working in academia, think again. It is a high pressure sales environment with an extremely uneven playing filed where nepotism and favoritism are at their maximum level. If the management happen to like you (for whatever reason), then you are in luck, there is nothing that you can do wrong, even if you don't hit your sales goal, they will figure out a way to keep you. BUT, if you are not a favorite, either because you refuse to lie on the phone to perspective students, or refuse to mislead people on the phone, then good luck.  This is not a professional job for someone who is college educated. Do not waste your time with them."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Stressful and unorganized.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Oct 2011", "job_title": "Student Accounts Representative in Fort Lauderdale, FL", "duration": "N/A", "pros": "Compensation not too bad and a free education.", "cons": "Management, employee drama, and favoritism. No training of any kind and backward computer programs which have constant issues."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Admissions Advisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "19 Mar 2015", "job_title": "Admissions Advisor in Plantation, FL", "duration": "N/A", "pros": "I've been here for a decade and Kaplan has always taken care of me and my family. Kaplan has fair pay, good benefits, a friendly work environment (especially if you are successful), and many of the Directors make an active effort to help you improve. The Gift of Knowledge program is awesome...I earned a Masters degree for the cost of the textbooks.", "cons": "I've seen a lot of people come and go through the years, but that's with any challenging job. Its definitely not for everyone. Not every advisor has the skills and ability motivate a student to begin their classes in an expensive program like ours. If you cannot"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Senior Military Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Nov 2012", "job_title": "Senior Military Advisor in Orlando, FL", "duration": "N/A", "pros": "Benefits package from Washington Post was strong compared to most proprietary schools. Has a true pension plan if you can last more than three years. Health insurance is tiered based on your salary. Work life was descent. Nothing from work to bring home. When you are finished for the day, you are finished for the day.", "cons": "Call center environment/ Online programs are too easy with questionable educational results. Overall atmosphere was high pressure sales to clients and representatives.  You live by the time clock as every possible metric is measured, analyzed and used to \"train you\" Bathroom breaks are timed by Orion. If you are gone to long you will have a conversation with your DOA or ADOA when you return."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Adjunct Faculty", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jul 2014", "job_title": "Adjunct Professor in Jacksonville, FL", "duration": "N/A", "pros": "Ability to teach online. Good curriculum design. The pay is reasonable, given the responsibilities.", "cons": "Kaplan University is trying to avoid the federal scrutiny, but also do anything they can to let their students be successful - including cheat. They put in place policies which allow the students to learn how to fake the plagiarism checkers, and also penalize (or get rid of) faculty who object to the policy or don't allow their students to \"try again\" when they turn in plagiarized material."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Perks but not great for an admissions advisor", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Aug 2009", "job_title": "Admissions Representative in Fort Lauderdale, FL", "duration": "N/A", "pros": "Nice Perks, like health benefits, employee cafe, everyone tries to stay positive", "cons": "If you are an admissions advisor, be prepared to work 60 hours/week with no overtime to meet your goals. You will be viewed as a \"cog in the machine\" and they will quickly replace you if you are not performing. There is no work-life balance, if you have to leave early take a personal day be prepared to be guilt-tripped as to why you shouldn't take time off. Be prepared to call prospective students on the day after thanksgiving and Christmas eve."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Solid Company but a bit confused on direction", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Jul 2015", "job_title": "Director in Parkland, FL", "duration": "N/A", "pros": "Solid financial backers\r\nmid level employees and managers are hard workers\r\nstudent best interest at heart", "cons": "To conservative at times\r\nupper leadership between departments dont speak enough\r\nchange of strategy to often\r\nno local community ties"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Headless department running SharePoint team", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Feb 2010", "job_title": "Sharepoint Developer in Fort Lauderdale, FL", "duration": "N/A", "pros": "The office location on Cypress Creek is very nice, new and clean. They have a great on-site cafeteria. The two covered parking garages for employee use are a plus. Most of the employees I interacted with or observed at this office seemed young and energetic.", "cons": "Lack of technical leadership was a major cause of concern.  In my case it was the primary reason for terminating my contract.  Millions of dollars are recklessly spent on SharePoint technology without giving the proper training to the team that needs to support the investment."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2016", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "The company has a lot of long time employees. Albeit, there is a good amount of attrition among new hires. If you are looking to move upward within this organization, you better be very competitive and ready to drink the kool-aide. Dress code is casual. Jeans and t-shirts are the norm.", "cons": "Lack of upward mobility. Highly competitive environment to get ahead, you better be a golfing buddy or be friends with the CEO. Lack of qualified leads"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Admissions Advisor for more than 4 years", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Aug 2016", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Some pretty cool co-workers- peers. At first, really felt like helping students change their lives,  The school/education itself matches that goal, but just too expensive.", "cons": "Have never worked for a corporation, that day in and day out , made me feel my job was going to be just swept away. Except for a few supervisors , never worked for a more inept group of self serving flunkies in my life. Numbers, numbers, numbers- pushed by used car salesmen ( and women !). Goals changing every 2-3 months, but with a lead operation that is clueless.. not sure how it has lasted this long, but it was a paycheck!!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Last Resort Job", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Nov 2010", "job_title": " in Fort Lauderdale, FL", "duration": "N/A", "pros": "The best reason to work at Kaplan is the salary range which is fair compared to the national average.", "cons": "Kaplan does not have a standard they go by as far as training or changes in the company.  They do not listen to or care about employee or student feedback on how to make changes or improvements.  Kaplan's only concernis about the bottom dollar and numbers not a positive image with students or faculty."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Student Loan Counselor/Mail Research Specialist", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Apr 2016", "job_title": "Student Loan Counselor/Mail Research Specialist in Harvey, IL", "duration": "N/A", "pros": "I enjoyed the interaction with the students on providing and giving them an opportunity to get their student loans in order..They wanted to do what was right most of the time, but at times they needed more coaching on what the impact of what this could be to them later on down the road.", "cons": "The students felt mislead about what they had signed up for, it was not explained to them as to what they had committed to. I felt for them and tried to reassure them they have to push forward."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Hear no evil, see no evil, speak no evil.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Jul 2012", "job_title": "Admissions Representative in Fort Lauderdale, FL", "duration": "N/A", "pros": "Assisting different people achieve through education. Company provides free education. Diverse co-workers. Great sales training. Academic offerings are very good.", "cons": "Business and Academics don't know what the other is doing. Business Leaders from the president down, runs the company like an assembly factory. Individual thought or ideas are frowned upon. This is a job speed bump to most. No career growth. Company values are a show."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Admissions Advisor", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Dec 2016", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "The consultative sales techniques you're taught are easily transferrable to other positions and the ability to take classes for another degree are nice.", "cons": "Where do I start. The calls are sent to you from another call center who is just trying to hit their numbers of calls transferred. These people filled something out saying they may be interested in pursuing higher education while browsing facebook or applying for jobs because they're out of work. These people are typically lazy and won't help you hit the insane sales goals set for you every month. Management has no idea what the hell they're doing as policies seem to change every day. The price of a bachelors degree from an online college shouldn't be $64000. That is predatory."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Current Professor: Sad and Pessimistic", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Aug 2013", "job_title": "Adjunct Professor in Town Line, NY", "duration": "N/A", "pros": "On-line learning tools are powerful and it's possible to develop real relationships with students. Some of the faculty are excellent and care about everything they do.", "cons": "There is no opportunity for growth or advancement. The school's business model is based on not paying faculty a fair rate. I am working more hours today than I was three years ago for about 40% less pay. Although I enjoy much of what I do for Kaplan University I feel as if I am being cruelly taken advantage of."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Admission Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Apr 2016", "job_title": "Team Lead-Admission Advisor in Plantation, FL", "duration": "N/A", "pros": "Kaplan supports employees who strive to do well and work on improving your skills. I had a great experience working with them. Not only do they offer free education, but they stand by you when your in school. The work load is absolutely overwhelming at times, but if you work hard at perfecting your craft, skills and success, they will assist you in becoming the best advisor on your team.", "cons": "Minimum cons, they do micromanage at times, and pick on aspects of your day that could be overlooked, but overall it is to simply improve productivity."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Pay ok, Company and benefits ok, beware of layoffs", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Sept 2012", "job_title": "Anonymous Employee in Plantation, FL", "duration": "N/A", "pros": "Kaplan University is an employer that gives its employees very good wages. The pay is good as are the benefits. Benefits include health, dental, and enrollment discounts should you wish to take classes. The overall environment of the job can be fun and celebratory at times. While you are there you feel appreciated.", "cons": "The company has unfortunately been going through layoffs for the past three years. Management does its best to puts employees at ease, and if you are laid off the company still does it's best to help you."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great Company to Work for Depending on Where You Get In...", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jun 2009", "job_title": "Temporary Assistant in Fort Lauderdale, FL", "duration": "N/A", "pros": "The Fort Lauderdale location has a cafateria with reasonable pricing!\r\nThe Facility is very nice with 2 very large parking garages and plenty of security\r\nFellow Employees generally have a good attitude and are 'youthful' and light hearted, but respectful.\r\nLots of room for advancement. Kaplan promotes from within and they actually mean it! Once you've been with the company as a permanent employee for 6months, you're free to apply to other divisions with the approval of your manager.\r\n\r\n\r\nIf you get in through a temp agency, you have the ability to work directly under Directors and upper management. I was assigned to work at Kaplan for a 2 week assignment and it's turned into several months. If you dress appropriately, work very hard and carry yourself well, they'll take interest in you and keep you on for much longer. They've already mentioned about bringing me on permanently and it's only been a few months! But not everyone is hired on this way.So be warned!", "cons": "It's a business. No matter if you're running a Business, a Church, or a non-profit company, MONEY is going to eventually come up. Kaplan is focused around it, as they should since they're growing exponentially. If you get into this company as a Admissions Advisor, be ready to WORK! It's typically an out-bound call type job, but they're usually warm leads--meaning these people have requested more information and it's your job to screen them and try to sell the school to the prospective student should they be made of 'the right stuff'. It can be very frustrating because there are a lot of lazy students that just want a degree. There's a lot of scum bags who'll never call you back, or give you the run around. You're held responsible for meeting numbers of calls, interviews, emails, and enrollments."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Thankful I Don't Work There Anymore", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Oct 2013", "job_title": "Full Time Faculty in South Portland, ME", "duration": "N/A", "pros": "I liked working at Kaplan University at first - great co-workers, enthusiastic students, flexible hours and decent pay and benefits.", "cons": "There is no local control, everything, including what instructors do in their classrooms (down to the quizzes and assignments given) is dictated by corporate employees who have never stepped foot in a classroom. The local management is vindictive. Overall it is run like a business not a school and it looks out for its own business interests, not the best interests of students and staff. There is no communication between departments and no job security."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great people, not so great school", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Dec 2015", "job_title": "Academic Advisor in Chicago, IL", "duration": "N/A", "pros": "Pay is competitive for the experience that they require.  \r\nOffice is in a great location in the West Loop and is easy to get to by public transportation.", "cons": "Emphasis was not placed on the student and helping them succeed but on enrollment numbers and in advocating for degree programs that weren't fully staffed with teachers to teach the curriculum.  Turnover was also high with the occasional mass lay-off."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Kaplan University in the Grad Psych program", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Mar 2018", "job_title": "Adjnct in Los Angeles, CA", "duration": "N/A", "pros": "Great supervisors, good support, great teaching and learning center, good professor education,  a family type of feeling, supervisors care about the professor's experience, great company conferences, opportunity to get more involved in the company activities, offers gift of education and discount for family members.", "cons": "sometimes there are not enough students in certain tracks, so if not full time, can go months without a class.  Compensation could be better."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Awful... just awful", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Mar 2015", "job_title": "Education Advisor in Chicago, IL", "duration": "N/A", "pros": "Great co-workers, benefits are ok.", "cons": "Leadership is terrible at all levels: no management skills, treat people like commodities; some are uneducated and many promoted past their edge of competence, which they try to cover up by micromanaging. Kaplan's moral compass broke many years ago. Professional development opportunities are slim to none; morale is non-existent. Most people stay because they have become complacent. Employees are expected to be like little worker bees- pound out the phone calls and make sure to hit their daily metrics."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Company to learn about all steps of admissions I worked for about one year as an Admissions Sales Representative.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Apr 2015", "job_title": "Admissions Representative in Fort Lauderdale, FL", "duration": "N/A", "pros": "The training is excellent and continuous to success. This is no doubt a team orientated Company. There is some flexibility as long as you keep up with training and work heard. You have to enjoy working with a large company of well over 100 in one area.", "cons": "Metrics are sometimes difficult to meet. Often time it can depend on the team you are on and your mentor from the beginning is so important."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Kaplan is a sinking ship laying off many", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Dec 2014", "job_title": "Human Resources in Fort Lauderdale, FL", "duration": "N/A", "pros": "Good, hardworking coworkers. The people are mostly great to work with.", "cons": "There is no job security because Kaplan stil lays off people in large numbers due to never recovering from controversy and they continue to make poor decisions. The politics are overwhelming and the favoritism is sad. Recently, they remodeled the executive suite instead of investing in ways to retain disappearing students. Kaplan operates like a business and not a school. Little emphasis is placed on the students. Poor communication and senseless business practices have left employees overworked and frustrated. Don't expect to get promoted unless you're one of the favorites."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A complete whirlwiind as Management did not know what they were doing.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Dec 2011", "job_title": "Chair In the Business Area in Fort Lauderdale, FL", "duration": "N/A", "pros": "* work in remote therefore, you do not have your boss on top of you all the time.\r\n* if you do a good job they leave you alone.\r\n* the best position is to be an instructor.", "cons": "* changes for the sake of change.\r\n* management ranks were not stable, they changed constantly and everyone had a different vision.\r\n* few opportunities for advancement.\r\n* management does not want to hear new ideas.\r\n* management's mentality is completely as in traditional colleges where instructors do not participate.\r\n* very few praises given for work well done.\r\n* strong emphasis in the bottom line instead of building quality programs.\r\n* any management responsibility you take exposes you to retaliation if you do not conform."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great for innovation and personal growth but always at the expense of employees work-life balance (imbalance)", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2015", "job_title": "Curriculum and Innovation in Chicago, IL", "duration": "N/A", "pros": "Awesome place to learn and achieve personal growth. Truly cares about students and providing the best possible service.  Students definitely benefit and earn their degree in a nurturing and well designed environment. Company always has a student focus. Benefits are generally good.", "cons": "Work life balance is horrible for employees. The amount of work expectation is never considered when requiring new projects.  Being a virtual company seems to allow the company to ignore the constant unrealistic demands that are put on employees and this is never considered when asking for more out of employees. Even though there is a yearly survey to try to fix the work-balance, which indicates concern, the intention quickly becomes forgotten until the next survey a year later. This seems to be due to the desire to have the work done without wanting to obtain the resources that would make it possible. So the leaders making these decisions  forget the life balance in favor of pushing their own agendas. This has been going on for years. Most people love the company until they are just used up and have to leave to regain their life back.  Even with raises we make less and less per hour every year so leaving eventually becomes the best solution."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Kaplan University was a very challenging place to work!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Oct 2012", "job_title": "Admissions Advisor in Chicago, IL", "duration": "N/A", "pros": "The potential salary could be very attractive and aggressive.", "cons": "Higher salary also translated to higher goals and could very easily mean losing your position if you could not meet those goals. The company doesn't treat it's employee's very well and pressures them to perform which leads to fraud."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Leads were burnt out", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Mar 2016", "job_title": "Military Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Loved my coworkers they were pretty much the only thing that made it bearable. Since all the lead my team received were burnt out the minute we got them we spend our days being hung up on and threatened the second we called them because they had already gotten tons of phone calls every day.", "cons": "Leads were burnt out the minute I got them so the chances of my making my goals were very slim."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Negative Outlook/Don't Recommend", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "31 Aug 2017", "job_title": "Adjunct Faculty in Fort Lauderdale, FL", "duration": "N/A", "pros": "Keeps Faculty aware of changes with communication\r\nFlexibility as an online faculty member\r\nVarious scholarship opportunities", "cons": "Earning less while KU expects more (literally had an opportunity to teach 2 classes twice during the 10 years of being employed.)\r\nLimited diversity in upper management\r\nLimited opportunity for growth within KU (they overload with adjuncts and have limited full-time faculty members)."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Mediocre", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Apr 2015", "job_title": "Director in Fort Lauderdale, FL", "duration": "N/A", "pros": "Good benefits, including free education\r\nGood people - it depends where you land", "cons": "Culture of paranoia, delusion, dense politics and double standards.\r\nThey hire very smart people and not listen to them, eventually they leave, its a revolving door, its the opposite of the Apple culture.\r\nThey hire VP, Senior VPs and the like in hope that they will solve the problems, they dont, they dont even make decisions, in the meantime, they need real people to solve problems."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great place to work.. Horrible upper management staff", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jul 2015", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great employee benfits and great people to work with!", "cons": "Upper management has turned higher education into a sweat shop. More emphasis is placed on numbers than quality of students. Horrible leads are provided, byt advisors are expected to convince anyone to go to school. Management is not held accountable when ineffective decisions are made,  yet advisors are held accountable for unattainable goals, which can cost them their job if not met on a month by month basis.."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Disappointing -", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Jul 2012", "job_title": "Admissions Advisor II in Fort Lauderdale, FL", "duration": "N/A", "pros": "Nice physical plant, free parking", "cons": "Poor management in the admissions department. Everything is done ATM. ATM means AT THE MOMENT. Very little is any advance warning of internal desk relocation or department moves until the very last moment. A floating lunch schedule that dictates your lunch today might be at noon , tomorrow at 2:00 the day after at 11:30 and following day at 4:00pm."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "At least I got a paycheck", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Sept 2012", "job_title": "Adjunct Professor in Greenbelt, MD", "duration": "N/A", "pros": "Not much in the positive to say.  There were some excellent teachers who genuinely wanted to educate the students.", "cons": "Everything bad you hear about for-profit schools are true.  Classrooms with not enough or the right equipment,  books showing up weeks after a class begins, outdated or broken learning materials, admitting students who are unable to pay or admit students who should not be there.  There were students who could not do basic math, students who could barely read or write, students who were there because a judge ordered them to go to school or they would have to go to jail.  Constant mandatory meetings that were unpaid.  \r\n\r\nThe list could go on and on and on..."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Kaplan is why teachers quit teaching", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Dec 2013", "job_title": "Adjunct Professor in Greenbelt, MD", "duration": "N/A", "pros": "I would like to say Kaplan provides students the ability to learn a profession and skills to advance in the real world...  For a select few, it does.\r\nThere are teachers there who genuinely care for their work and their students.", "cons": "The school didnt provide the materials needed for class.\r\nThe school admitted students who could not afford to attend.\r\nThe school admitted students who were uneducated - they could barely do basic math, read or write.\r\nThe school admitted students who did not want to be there - I had students that were ordered to attend by a court.\r\nThe school hired teachers who were not qualified to teach the subjects they were teaching.\r\nThe school required teachers to do hours of unpaid work per day.\r\nThe list goes on and on..."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Avoid working for Kaplan University at all costs!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 May 2014", "job_title": "Military Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "The people that you work with on your team, the people on your level, not the high and mighty managers.", "cons": "The management, from Associate Directors all the way up the chain, it seems that the management team has zero idea of how to treat their employees with respect. They focus only on numbers and treat people like expendable trash. The strange thing is that the high paid managers are not held accountable for sales numbers, only the advisors are, and are given three strikes and then they are out, literally."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good idea, poor execution...", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Jul 2016", "job_title": "Anonymous Employee in Plantation, FL", "duration": "N/A", "pros": "Excellent health benefits, many good people there.", "cons": "Too many decisions made by executives on high with little or no regard to how the front lines employees must implement them. Driven by numbers, not service, they have evolved a mediocre-call center mentality."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Enthusiastic People but Discouraging for Teachers", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Jan 2014", "job_title": "Adjunct Professor in Saint Louis, MO", "duration": "N/A", "pros": "The people at the Learning Center level are all enthusiastic, positive, and dedicated to student success.", "cons": "Curriculum is designed by corporate and not flexible enough to accommodate all types of students. Admissions procedures do not take into account whether students are actually prepared for college level courses. There's a real disconnect between expectations and reality."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Senior Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 May 2015", "job_title": "Senior Admissions Advisor in Miami, FL", "duration": "N/A", "pros": "Good health benefits, and PTO . Ability to make a good salary and increase it in a short amount of time. You meet great people from many different walks of life.", "cons": "Salary can change every six months and you can go from making $ 90 K to $ 30K  just that fast. There can be favoritism and you can be set up for success or failure. You will have to at least one weekend day and some nights."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Frustration with bureaucratic ineffectiveness", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Aug 2014", "job_title": "Analyst in Chicago, IL", "duration": "N/A", "pros": "Casual atmosphere, including casual dress. Young, fun staff. Lots of opportunities for lateral movements to other departments. Decent benefits - health, dental, 401K, discounts.", "cons": "Senior leadership is very disconnected from the day-to-day and makes knee-jerk decisions to make massive changes without taking into account the impact or requirements of bringing that change to fruition, which leads to a stressful environment where necessary tools are often not yet available or not effective. Leadership driven by politics rather than competence."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Arrogance", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Aug 2014", "job_title": "Adjunct Professor in Chicago, IL", "duration": "N/A", "pros": "Remote work environment... the convenience of working from home can't be beat. Helping students is one of the greatest feelings one can hope to experience, no matter what educational institution you work for.", "cons": "\"Leadership\" is very arrogant and constantly promotes how great they are and how Kaplan is a \"GREAT PLACE\". Ever hear the saying... \"a fish stinks from the head\"? This is the case in both academics and curriculum. They can care less about the faculty! The pure arrogance of the Deans and Chairs is like no other educational institution! This is a \"For-Profit\" organization and office politics rules the day!"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Not a bad place to work as a part-time college student or recent grad.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Feb 2013", "job_title": "Admissions Advisor II in Orlando, FL", "duration": "N/A", "pros": "The pay is pretty lucrative if you're working through your degree while you're employed. They try to show employees their graditude through formal lunch functions that are catered by elite groups.", "cons": "No potential for upward movement. Pay is stagnent because of the new laws on for profit schools. The industry is dying and probably won't be around long."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A stressful temporary work situation", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Aug 2013", "job_title": "Admissions Advisor in Plantation, FL", "duration": "N/A", "pros": "Fun working with peers at times\r\nVery fulfilling working with students because you're making a difference\r\nGood job to have if transitioning jobs", "cons": "High rate of turnover (about every 6 months there is a mass firing)\r\nStressful to meet quotas\r\nDepartment and individual goals constantly changing which sometimes puts you in the less favorable position\r\nJob is never secure\r\nCare about profits over employes \r\nManagement deceives employees that it will be a new prosperous career but its a people mill"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Disappointing Roller Coaster", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jan 2013", "job_title": "Admissions Advisor in Boca Raton, FL", "duration": "N/A", "pros": "Wonderful co-worker's, descent pay at the time, good benefits.", "cons": "Unstable work environment, rules changed too frequently.  You'd be trained over and over again as the policies and job function changed at least every month, sometimes more often.  Everything was monitored, measured and evaluated.  Big Brother was watching every move.  This is a high pressure sales job.  Think twice before accepting a position."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor Communication", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Jan 2019", "job_title": "Adjunct Faculty in Chicago, IL", "duration": "N/A", "pros": "Great colleagues and flexibility to work from home", "cons": "I never had less than a great review from my dean or assistant dean and had high marks on reviews from my students for 7 years.  Then enrollment drops and they don't even explain why you cannot get a class --- ever.  I finally found something else but communication after 7 years would be the classy thing to do.\r\nAlso the live webinars every week HAD to be in the evening, which was a drag."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Former adjunct", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "31 Jan 2013", "job_title": "Adjunct Professor in San Francisco, CA", "duration": "N/A", "pros": "Generally good students, reasonably decent pay, more relaxed pace with ten-week classes.\r\n\r\nLess administrative/grading burden than others (Phoenix, et al.)", "cons": "Rules that change - unlike Phoenix et al, there are no clear and hard and fast rules about student assignment submissions, grading policy, etc.  Heaven help you if you're \"late\" in grading, but students must be \"accommodated\" at all costs including submitting work weeks late, ridiculous hand-holding of adults, etc."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Kaplan", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jul 2009", "job_title": "Program Director in Fresno, CA", "duration": "N/A", "pros": "The corporation takes care of their employees.  If you have a concern, you can approach management at anytime and if your request is reasonable, most of the time you will be accommodated.", "cons": "Policy.  I came from a law enforcement background where policy was the standard.  Not to say that their is no policy, it is just not readily accessible like law enforcement."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Admissions Advisor: Decent pay for the work that is expected.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Dec 2012", "job_title": "Admssions Advisor in Phoenix, AZ", "duration": "N/A", "pros": "This is a great job to get a steady paycheck and benefits, don't expect to get rich.  Don't be afraid of layoffs, they have previously been very fair with giving notice and compensation.", "cons": "Career progression is limited.  You can move up, but you can't move down, so if you want to promote, be prepared to perform at a much higher level."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Recruiter", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Oct 2015", "job_title": "Recruiter in Fort Lauderdale, FL", "duration": "N/A", "pros": "I worked in the recruiting department - I worked with a great team. The environment was fun but we knew what needed to be done. The company has an onsite cafeteria as well as a small gym that employees can us during breaks or before/after work. Salary was fair and was able to take college classes while working there.", "cons": "Nothing I can think of - great place for recruiters to work. You have to have some recruiting experience, I wouldn't recommend the position for someone new to recruiting as it is a fast paced environment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Best Company I have ever worked", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Mar 2014", "job_title": "Admissions Associate in Plantation, FL", "duration": "N/A", "pros": "Kaplan University is very professional and corporate environment, yet very comfortable to work as an employee and fun.  They care about their employees. Although not a lot of incentives, there is enough to make you want to stay. Their health benefits are great as well, good working hours and wonderful staff including management.  Best place I have ever worked in the USA.", "cons": "Like any other job, the sales aspect of it, if you are not meeting your goals, then you will eventually lose your job."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Admission Adviser", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Jul 2015", "job_title": "Anonymous Employee in Plantation, FL", "duration": "N/A", "pros": "1.  GREAT PEOPLE- if you come in with the right attitude and aren't afraid to work\r\n2.  Work/Life- they really try there best to help make your life as easy as possible\r\n3.  Free College\r\n4. Independence- if you work hard they will not micro manage you.", "cons": "1. Advancement- Unless you fit into quota categorizes you will NOT advance here\r\n2. Pay- if you haven't done sales before its pretty good- but once you learn then you can make money else where"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Only if you are absolutely desparate", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Aug 2012", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Co-workers (excluding management) were great.  Most everyone was on the same page.  Pay was decent, but not great.", "cons": "Management was very poor.  They are big on you seeking out additional training, but never respond to requests.  Minimum requirements (usually 3 students per month) are unrealistic.  Those minimums are set to the average number of students per year, however you are only allowed to miss minimum requirements 3 times per year.  Statistically it just doesn't work.\r\n\r\nMoreover the training does not prepare you for the reality of the job.  In reality it is hard sales, but trainers and recruiters lead you to believe it is customer service."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great Benefits. No Job Security.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Dec 2016", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "The company has some of the best benefits (health, dental, PTO, etc.) I have had. The dress code is very casual (T-Shirts and jeans are ok).", "cons": "Absolutely no job security. The company seems to focus more on writing employees up and setting unrealistic goals that are not attainable. They obviously fire employees constantly and then just hire new ones to replace those who have been lost."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Admissions", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Jul 2015", "job_title": "Admissions Representative in Fort Lauderdale, FL", "duration": "N/A", "pros": "The best thing about Kaplan is the great people that work there. They are a group of talented and intelligent people.", "cons": "Pure sales environment. It used to be a great place to work and then new VP took over and now morale is at an all time low and of course they blame the front line staff,  as they always do. It's really disheartening how much they do not value their employees."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "A perfect job for me right now", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Oct 2012", "job_title": "Adjunct Professor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Completely online, never have to leave my home to attend meetings or teach house, no need to commute, arrange childcare, etc. Most of the students are wonderful and very diligent.", "cons": "The pay for large classes is the same as for much smaller classes. Same pay for 9 students as 30. Some of the students are not prepared."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "admissions advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jun 2015", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Great benefits, wonderful coworkers who really care about each other and the students.  Nice work environment.", "cons": "Leads come in too slowly, too much down time which makes the day drag.  Hi pressure for sales  and employee is made to account for situation over which he no control.  One month you can be on top, the next fearful of your job.  Your job depends on stacked rankings."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Admissions/ Sales", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Aug 2016", "job_title": "Admissions Representative in West Palm Beach, FL", "duration": "N/A", "pros": "U are in Florida, the best part of the day is gettin to take a step outside. I had to remind myself I had always wanted to live in Florida", "cons": "U Got to sell someone what they may or may not want and u know it's fixing to create all kinds of debt in student loans, that is more pain than gain and Kaplan knows it"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Nothing good to say...", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Jan 2016", "job_title": "Admissions Advisor in Pompano Beach, FL", "duration": "N/A", "pros": "I did not end up having anything good to say about them once I got through the training program.", "cons": "Cold hearted company - you are expected to make people feel so bad about themselves that they are left feeling they will never amount to anything if they don't register for one of the healthcare programs. Sad really. You are encouraged to NOT be friends with fellow workers - to be an island to yourself for fear that if your friend has a bad experience, it will in turn affect you. Hated working there and have heard from other employers that they hear the same stories from other previous Kaplan employees. Makes you go, \"Hmmmmmmmmmm.\""}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Admissions Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Jan 2017", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Good people employed here, you won't find better. Good benefits, work/life balance. Job is not difficult.", "cons": "No job security. Goals impossible to attain consistently month in and month out. For-profit universities declining in enrollment (non profits are now playing in this on-line space) so leads are poor. You can be a top performer and still lose your job."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Jobs are Running OUt", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "30 Sept 2017", "job_title": "Adjunct Faculty in Fort Lauderdale, FL", "duration": "N/A", "pros": "It is good for those very early in their academic career.  It can provide some online experience.", "cons": "Lots of touchy feely and unnessary trainings on things that experienced college professors know.  My salary has actually gone DOWN because of an \"equity adjustment\"  I was with KAPLAN 10 years as an adjunct and NEVER received a raise.  NOT recommended for PH.D. degree holding professors, even as a retirement job."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Admissions", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Nov 2015", "job_title": "Admissions Advisor in Cedar Rapids, IA", "duration": "N/A", "pros": "Compensation was competitive and work schedules were fairly flexible. Lots of opportunity to get away from your desk and move around.", "cons": "The managerial staff was incompetent; there was lots of staff drama and obvious favoritism. Employees will go out of their way to reach the top, no matter who they hurt. Managers don't get involved and training is minimal. A great lack of professionalism on all accounts."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Education Advisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "1 Dec 2016", "job_title": "Education Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Respect for employee....Kaplan has a good company culture and the benefits are good.  They really do try to adhere to their claim of \"a great place to work\"", "cons": "Shaky environment right now due to current industry issues.  Declining enrollments due to government restrictions.  Kaplan is being proactive with this hurdle, trying to implement new technology and a 3 week trial period for students"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Overall a great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Sept 2019", "job_title": "Instructional Designer in Orlando, FL", "duration": "N/A", "pros": "So many activities and events for staff, including fun holiday parties, events in the parking lot, Volunteer Time Off with organized volunteering events each year, etc. Some managers there tried to make sure we had interesting work and felt empowered.", "cons": "The worst thing about Kaplan was they turned a blind eye to some leaders' toxic behavior, such as bullying, controlling, threatening, etc."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "They are very helpful in making you secede in the field of you studies.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Oct 2013", "job_title": "Library/Tutor in Urbandale, IA", "duration": "N/A", "pros": "We can work around our schedule for school and be able to help ones that are in need of help .", "cons": "I really have not found anything bad about it here as when a person has a problem they are right there to help get it resolved."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Admissions Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jan 2016", "job_title": "Admissions Recruiter in Plantation, FL", "duration": "N/A", "pros": "K.U. is a great company to be a part of, work environment is wonderful and laid back as long as you are doing what's required of you. Flexible schedule, come in early and work additional time if needed.", "cons": "The downside with this company is that it is a quota based environment, you are as good as your last monthly quota."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Very employee friendly a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2011", "job_title": " in Fort Lauderdale, FL", "duration": "N/A", "pros": "Can work remotely\r\nCompetitive pay\r\nGift of knowledge benefit (free education for employees)\r\ngreat work life balance\r\nsolid company\r\nmedical benefits available immediately\r\nvery professional", "cons": "Gift matching program for charitable donations does not take effect as soon as you are hired as an employee (like benefits)"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Kaplan University, you do not want to work here", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Apr 2014", "job_title": "Financial Aid Specialist in Fort Lauderdale, FL", "duration": "N/A", "pros": "You get a paycheck and that's about it.  Some of your co-workers are nice.  Convenient location in Cypress Creek but parking is horrendous.", "cons": "Benefits are just okay.  Leadership is awful, they want you to basically be a robot without any feelings or emotions, blindly lead the students into thinking this a great opportunity, when it is not.  No real room for advancement, extremely high turnover except for mid management, which is mostly the problem."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Academic Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Jun 2015", "job_title": "Anonymous Employee in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great team,  manager cared. Ability to attend College for free with the 100% tuition waver waiver after 30 days of employment.", "cons": "Horrible work environment.  Had to basically force perspective and current students to register and attend classes.  Held accountable for students that weren't interested in attending school. Students cared more about their financial aid."}], [{"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "My experience at Kaplan University is Ever Changing.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Mar 2011", "job_title": "Academic Advisor in Chicago, IL", "duration": "N/A", "pros": "Great Benefits Package, Free Tuition, Consistent opportunities for career training and growth.  There are extensive training programs to help groom you for various management positions.", "cons": "Some of the downsides of working at Kaplan are that the pay is below industry standard and too many changes that cause service issues."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A growing company with great vision", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "21 Dec 2013", "job_title": "Operations Coordinator in Fort Lauderdale, FL", "duration": "N/A", "pros": "I worked here for 8years truly enjoyed my time. Unfortunately, I was laid off. They are a continually growing company with a great vision. Open door policy with most managers. Great benefits and work/life balance is important to them", "cons": "Recent major layoffs throughout the company"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Sept 2014", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "2 week training, benefits ok, no 90 day wait to start benefits (even for pregnant women who were new hires), start salary was ok at $35,000.", "cons": "High stress!!! MUST reach a minimum goal of enrolling students or you will lose your job! No personal life, because of long and consuming hours."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Student Service Coordinator", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jul 2016", "job_title": "Student Service Coordinator/Verification Specialist in Aurora, IL", "duration": "N/A", "pros": "co-worker are great , benefits are ok, management is understanding as far as using PTO", "cons": "negative work environment, manager are in their own little world, no room for growth, management team is clueless, only way to move up in the company is to be apart of their click"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Fallen Soldiers", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Aug 2012", "job_title": "Military Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Structured workplace with minimal flexability.", "cons": "College like atmosphere with cheering pom-poms. Many of the employees I started with were phased out because of non-aggressive tactics. Managers focused on their own goals and employee reviews were all about numbers. Favoritism at its highest."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "While t was still Kaplan", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Sept 2018", "job_title": "Faculty in Vista, CA", "duration": "N/A", "pros": "Supportive Management. Autonomy to change and adapt curriculum as needed to keep pace with industry standards. Good amount of prep time.  I worked there when it was Maric College and then it transitioned to Kaplan.  I am not sure when it became Brightwood.", "cons": "Admissions counselors would make unrealistic promises to students and then I would be the one that had to tell the reality."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "It used to be fun working here but.......", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Mar 2016", "job_title": "Senior Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Well if you like to talk ton the phone then this job is for you and their paid tuition benefit is great if you are seeking another degree", "cons": "Too many damn changes for changes sake no rhyme or reason why they change something that is working to something they don't know but they do it just to see,,,,"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Job was great until I there were no classes for me to teach", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "23 Feb 2017", "job_title": "Adjunct Professor in El Centro, CA", "duration": "N/A", "pros": "Been here for 8 years and love working here. Love the students and colleagues", "cons": "This year is the first time in all that time where I do not have courses to teach for the first two terms of the year. The department chair plays favorites."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Are they ready this time?", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Apr 2017", "job_title": "Senior Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "By comparison slightly higher pay than the industry in Admissions. If you do well, flexible time schedule with potential for work from home", "cons": "Low raises 1%, management/leadership introduce initiatives before they are ready. Programs are offered by simply don't have the potential for students to complete and make a good living. Retention for students in in 20% range, while graduates is less than 5%"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Kaplan University Review", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Aug 2012", "job_title": "Admissions Advisor in Chicago, IL", "duration": "N/A", "pros": "Great insurance and a few other benefits.\r\nOK place to work if you are unemployed, its stop over until something better comes along.", "cons": "Zero job security, layoffs are made with no apparent rhyme nor reason about who gets axed.\r\nZero employer loyalty, it's hard to be loyal after seeing what I've seen.\r\nLow pay for most, good pay for a few, especially management.\r\nFavoritism for a few, most of us are just numbers."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Pays the bills", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 May 2013", "job_title": "Financial Aid Counselor in Chicago, IL", "duration": "N/A", "pros": "Relaxed work environment. Typical 8-5 jobs, no late hours, casual dress code, opportunity to voice concerns, and take on projects of interest. open door environment, great people to work with", "cons": "little to no advancement. low employee reward, or recognition, upper management disconnect. in house management can be very unprofessional. constant lay offs from department to department. very little raises"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Working for Kaplan in a wonderful experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Apr 2011", "job_title": "Management in Chicago, IL", "duration": "N/A", "pros": "Kaplan is a wonderful company to work for.  Kaplan uses the latest innovative technology, has a diverse population and professional development opportunities.", "cons": "Kaplan should focus more on promoting from within and be more open to at least speaking with employees who are interested in advancing in other departments."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great people!", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jun 2015", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Managers are always ready, wiling and able to coach and help their people get better. Self-development is encouraged. Good benefits package.", "cons": "It's a fairly monotonous job. It can be difficult at times, especially when expectations are raised when it's obvious they can't be reached. When your best advisors have trouble reaching their goals, there's a problem."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Include your team members in decision making. This add power to your strategy,", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Aug 2015", "job_title": "Manager in Fort Lauderdale, FL", "duration": "N/A", "pros": "Higher Education is changing and drastic measures are needed to be taken to survive. Thinking outside the box is needed.", "cons": "Thinking outside the box is needed. Not all employees are involved in their decision making. This eliminates the team power."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Okay", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Nov 2013", "job_title": "Admissions Associate in Orlando, FL", "duration": "N/A", "pros": "Great pay with benefits, if you can meet your quota the job is a breeze. Come in to work do what you gotta do and no work is brought home.", "cons": "No room for advancement, the level of nonprofessional is high, the is no consistency between management, needs more transparency across the company"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Immaturity is a Major Issue", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "18 Mar 2016", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "The opportunity to change a life through conversation is outstanding.  Some of those conversations lead to enrollment, some not but if you leave a conversation with something for the individual to think about you have accomplished a goal. Albeit personal. \r\n\r\nGreat compensation, benefits, training and ability to get a fantastic education.", "cons": "The individual that manage you are people who, at one time, were advisors. Many of them, too many, are immature. They lack the skills to be good leaders. The stress of making numbers, I am sure, is hard on them. However, if you get a manger who just doesn't like you for whatever reason, they can make your daily experience hell. There is childish behavior, cattiness between the female diectors and ADOA's. \r\n\r\nThey tell you they don't play with the lead flow and that is an outright lie. They set you up to fail, to enroll a body to make numbers.  There is a faint line between KAPLAN as a university or sales organization based on metrics. \r\n\r\nWhile the pay is outstanding if you have been here long enough you are held hostage to it. You either make your numbers or lose your job. Many, many advisors working there are making 55k to over 100k a year. If you lose your job you will not find that salary out there in the general admissions jobs. Not even with a degree. \r\n\r\nIt was a great place to work years ago until the government came in. Now you get penalized for taking vacation or getting sick. They use it against you. \r\n\r\nThere is NO work/ life balance. If you work from10-7, 11-8, 12-9 you have no time for a life, especially if you are an older advisor.  You spend 8 hours a day talking to other people you need time to decompress when the day is over, and that takes from your ability to have a life outside. \r\n\r\nYou have to be committed to KAPLAN, they have to see that comittment to trust you. However, being committed , proving comittment, added to those who kiss up, or are favorites for what they are willing to do is no guarantee you will have your job. I have seen people who were long time advisors have a bad run and get shown the door, there is NO loyalty. \r\n\r\nThere is no chance to advance because the managers you work for make less than you in many cases. You can't go to another department because you take a cut in salary."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "This job is not for everyone", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Sept 2010", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "This job is very flexible you work o your own pace unlike other call centers there is no micro management", "cons": "The compensation plan is not very fair and it is very frustrating to try to enroll people. This job is not for everyone and is very challenging"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "If you need to get a job quick for a short period of time, this is ok", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Jan 2013", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "* Training is useless but it is fun\r\n* There are Some good people there \r\n*nice building with a nice cafeteria", "cons": "Where do i start. All the managers, including the trainers tell you about hoe much money  can be made in this role. That is all BS, most of them are lacking an impressive paycheck. The trainers will tell you in the first week, that they were making oodles of money but then decide to start training because they just love teaching and don't care about money (yeah right)\r\n\r\nThe truth is that they hire a new class of admission advisers every two weeks. The class starts with 30 people and after a month you see about 10 of those people or less because the rest didn't make it. Each class they brought it was reported to have a lower and lower base pay (24k, really!??)  They hire anyone who can speak decent English and has a degree of some kind. For a while they hired without a degree if you were willing to get a degree through them. (now you will owe them more than you ever make:0)\r\n\r\nThe pay scale is pathetic because almost no one gets into the 2nd tier, which is where you would need to be just to be earning a normal paycheck. Very few succeed and the ones that are doing well are getting a lot of new leads and inbound calls. In other words, they get leads from people who actually want to go to school. Everyone else gets a couple good leads a week and the rest of the leads are people who have been called and harassed by the company for the last month. You know this because the notes are actually in the computer. You see things like (student said to \"go to hell\" and hung up the phone) and they you are supposed to call the same person and turn them around. hahahahaha\r\n\r\nThey will hire you right away, on the spot. If you need a job for a few months while you are interviewing for other jobs, this is a good place. After the first week of training, they you will have at least one weekday off, so you can interview elsewhere."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible culture.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 Oct 2013", "job_title": "Director in Fort Lauderdale, FL", "duration": "N/A", "pros": "Having worked at Kaplan makes me appreciate how much better other companies are to work for.  The experience made my skin so thick, I can take anything.", "cons": "Overall, most of the employees are negative, miserable, unpleasant, and unapproachable. The handful of employees who don't fit into this category only stay there because they feel trapped, since management continually reminds people that they should \"be grateful that they have a job\".   The overall culture is one where everyone is out for themselves and it's a big CYA environment.  It is common practice to be in a meeting where people are openly criticized in front of everyone.\r\n\r\nThere are a core group of employees who have been with Kaplan for many years and have formed their own group that has the same feel as a high school clique.  They treat everyone else like an outsider, they only support the agenda of those inside of their clique, and the company forgives them for their lack of maturity and professionalism because of their institutional knowledge.  \r\n\r\nThere are huge gaps between the intent of the company that is articulated by the CEO and what actually happens in the day-to-day operations.  High performers who are unethical are continually rewarded by upper management who turns a blind eye to their practices.\r\n\r\nThe executive leadership believes that being an employee-focused employer means to deploy programs such as allowing employees to wear jeans everyday, when they miss the mark on truly appreciating the contributions of each individual.\r\n\r\nIt is a common practice to promise a promotion to someone, only to continually pile on more and more work to be used as a carrot to get the promotion.  And even when the employee meets the performance criteria set forth, the carrot is continually moved and excuses are given as to why the promotion doesn't occur.\r\n\r\nThe HR department is not an employee advocate and will retaliate against employees who speak up about their leaders using fear and intimidation practices. Workplace bullies are rampant and protected."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Political Corporate Culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "4 Feb 2015", "job_title": "Director of Admissions in Fort Lauderdale, FL", "duration": "N/A", "pros": "Lots of opportunities for personal growth. Individuals take on myriad responsibilities in any given role. Typically, we perform job functions one to two levels above actual title.", "cons": "Actual advancement however is limited.  Advancement opportunities many times seem limited to those in the \"in crowd\" There are a lot of politically driven decisions within the executive and C level ranks."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Career Services Advisor", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Nov 2016", "job_title": "Career Services Advisor in Phila, PA", "duration": "N/A", "pros": "The pay check is decent", "cons": "This company is not good to work for. They do not value their employees. Kaplan is a quintessential corporation-the money and having the employee chained to their desk is more important than anything else. Having a family or health crisis? They will pressure you to come to work anyway. They also have some less than ethically sound practices when it comes to enrolling students. For example, they will don't always make it clear to Pharmacy tech students that they wont be able to get jobs in the field if they have criminal background."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "n/a", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Sept 2016", "job_title": "Education Advisor in Gary, IN", "duration": "N/A", "pros": "I have been with the company for 8+ years and was encouraged to pursue degrees to advance my career. During this time my employer was very flexible and will to work with me to make sure I had time to dedicate to completing my degree .", "cons": "There is no room for growth within my department and not very many opportunities to move to other departments at this tome/"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Admissions is a low pay pie in the sky job.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 May 2010", "job_title": "Admissions Representative in Phoenix, AZ", "duration": "N/A", "pros": "They have a training department that alerts you on what to watch out for once you are actually doing the job.\r\n  They actually tell you what to expect in most cases during training. But it is so much worse than the trainers realize..\r\nThe benefits are pretty good.", "cons": "This week we watched people who had been with this company for 2-3 years walk out. None of the management did anything to stop them. Your treated like a number, no matter what you do there is evidence somewhere that you have done it wrong. It's amazing how they are in a continual change mode. They have changed the pay program to the point that a good. adviser can not make much more than 35K a year. The stress level is high. Senior Management  from Florida have no clue as to how they are making money.\r\n During the last ad blitz they recruited people to work odd shifts telling them how many calls they expected to get from additional advertising. When it didn't work, senior management showed up, took questions and told lies about how the advertising was to provide a HALO effect. \r\n I would have loved to have been the Television sales rep that sold them this bill of goods.\r\n \r\n Most of the advisers were told a few months back, that we were allowed to call ALASKA and Hawaii as soon as we received the lead.. This was from an ADOA at a huddle of about 70 advisers.\r\nWhen questioned the ADOA told the advisers that we were not held to the same rules as other call centers. The management will do anything to make their goals for their bonuses. They must be paid as poorly as the advisers and funding advisers.\r\n\r\nIf you accept employment at this company be prepared to be fired at anytime for any reason.\r\nYou won't make much money, no one does.... you are a number in a seat."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Kaplan University Has No Clue", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Jul 2013", "job_title": "Admissions Advisor in Plantation, FL", "duration": "N/A", "pros": "Kaplan provides good work stations, adequate numbers of leads, and has good medical insurance. Training is also quite good.", "cons": "Management has no clue. They establish policy then change it within 3 months. Upper mgmt is self-serving and  fundamentally does not care about their advisor staff. Quotas are raised or changed as needed to keep those they like and get rid of those they no longer need."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The recruiters are good liars!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2012", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "-Benefits are good, in my opinion.   \r\n-Programs are accredited\r\n- The teachers are pretty good.", "cons": "-School is marketing to potential students that cannot read or write beyond an elementary grade- school level.\r\n\r\n- The school has a large drop-out rate, which has been hurting the company's bottom line.  The culprit is low student academic performance. As a result;\r\n\r\n-Poor lead quality results in minimal anual revenue.  Either the CFO's and CEO's of the company  have not made that connection, or they are making short-sighted decisions intentionally.\r\n\r\n-They have re-structured three times for the last year and a half. The company has changed their \"Group name\" three to four times within two years. \r\n\r\n- The company continually changes CEOs and CFOs but they do not fire or layoff-just switch them around to different departments but with equal titles.  It is not your normal company restructuring. \r\n\r\n-Company has massive layoffs to only rehire three months later to only have a company wide layoff seven months later to only rehire again.  This cycle has gone on for the last year and a half.  After each layoff, the company admits their  biggest mistake was that they begin to hire way too soon after the layoff.  However, the company repeats their mistakes.\r\n\r\n\r\n- Four massive company-wide layoffs in the past year and a half makes  it hard to plan life or big family   events, i.e. buying a house, taking a family vacation,  selling your house.\r\n\r\n- ADOAs and DOAs will tell advisers to sell the student a program that is not in their best interest (i.e. putting a student in a program that will not enable them to teach in their state if they want to be a teacher). This is the biggest and most disappointing of all-the company has lacks integrity."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Records Auditor", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Dec 2014", "job_title": "Records Auditor in Chicago, IL", "duration": "N/A", "pros": "Health and dental insurance, paid days off.", "cons": "Big divide between the upper management of the company and everyone else. High turnover rate in most large departments due to noncompetitive wages and lack of job satisfaction. There is little emphasis on employee retention, company would rather continually use its resources to train and hire more people rather than paying its employees a fair salary that will retain and make employees happy. \r\n\r\nLow value product leaves little to be desired from an employee satisfaction standpoint. \r\n\r\nComputers used by many of the departments are over 5-6 years old and barely run, which is troubling for a company where the internet and information technology is vital to its operation. Small percentage of employees have new PC/MAC computers whereas everyone is left working with last decades technology; as previously mentioned you're either one of the employees that is given the tools to succeed or you're like most and given the bare minimum. \r\n\r\nPromotion and advancement practices within the company leave little to be desired. If you are promoted to another position regardless of what it is, you will earn a 10% raise, up to 15% if you beg for it. With most positions in the 35-40k range, this is not a large increase. Prior experience, skills and credentials play no factor in your salary, only what your previous position is.  \r\n\r\nThere is also a lack of accountability in many departments, poor job performance is tolerated and almost encouraged as their are no consequences for poor performance. It often times takes years for employees to be terminated, which can be attributed to the lack of an HR presence within the company. \r\n\r\nPoor communication exists among many departments within the company which results in confusion and errors that are ultimately passed on to the students. It's not uncommon for students to be taking classes that they don't need to, but as previously mentioned there is not a ton of accountability.\r\n\r\nFront line management does not have very many tools to combat issues. Upper management is largely absent."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "If you want to go back to school, this would be a great opportunity.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jul 2015", "job_title": "Academic Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Education benefit after 30 days, family oriented. Helping students achieve their educational goals and aspirations. Very accommodating to military students, active duty and veterans. Fostered an environment of learning.", "cons": "Overworked, Call Center environment, because it is an online school."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great People", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jan 2017", "job_title": "Anonymous Employee in Fort Lauderdale, FL", "duration": "N/A", "pros": "There are a lot of really good people at this company, most very helpful and friendly.  Good opportunity for long tenure if you can make the cut.  Escellent pay and benefits.  Nice facilities.", "cons": "Not sure what the strategy was other than make your numbers - as a college we should have been on the cutting edge of higher education innovation.  Layoffs."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Kaplan Unviersity - Omaha Campus", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "10 Feb 2017", "job_title": "Admissions Advisor in Omaha, NE", "duration": "N/A", "pros": "Pay is higher then average, decent benefits including free tuition for employees.", "cons": "Low employee morale, no opportunity for advancement, micromanagement is a huge problem, inconsistent training, there is also a huge disconnect in management and culture between campuses and Kaplan University as a whole."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Barely Working", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "29 May 2017", "job_title": "Adjunct Professor in Fort Lauderdale, FL", "duration": "N/A", "pros": "When Kaplan is working, it is decent employer though the pay like all adjunct faculty gigs is poor and benefits non existent.", "cons": "They haven't contacted me in ayear to teach a class, this happened once before, yet they seem to expect one to waste hours and hours of uncompensated time on training and staff meetings."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Hard to get clean", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Jul 2017", "job_title": "Director Marketing in Miami Beach, FL", "duration": "N/A", "pros": "There are some smart people here that probably don't know they would be even more valuable somewhere else.", "cons": "The product is suboptimal, takes a long time to get promoted. Not really a true higher education group. If you want to move into traditional higher education, this will work against you in anything other than admissions."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poorly managed, an emotional roller-coaster of a ride, do research before you take the job!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Apr 2012", "job_title": "Admissions Advisor in Miami, FL", "duration": "N/A", "pros": "The medical and dental benefits are pretty good. For the most part, you will work with really nice advisors in the admission department. The majority of the admissions advisors really care for their students and their fellow employees.", "cons": "The management team is the worse.  There is no room for growth at all. The upper management team is always expressing a career progression to new employees, but they hire outside the company for their managers.\r\n\r\n Managers do not show much respect to their employees. I have heard many advisors get talked down too by their managers in front of other employees. It is embarrassing for the employee being \"disciplined\" and the employees that are in ear shot of the conversation.   \r\n\r\nThere is inconsistency and ambiguity as to the direction the company is moving towards. It was told to us in December that the company does not know exactly the business plan for the new year. I have never worked for a company before that did not know their business plan for the next year when the new year was less than a month away. But this lack of visions is also evident on a day-to-day basis.  One day the company encourages advisors to have interactions with potential students with honesty and sincerity, and the next day the company pressures the advisors to move the students  along the enrollment process so the managers monthly numbers are reached-despite what is actually \"best for the student.\" \r\n\r\nHOWEVER, the biggest obstacle when working at Kaplan, as an admission advisor, is to depend on other departments (i.e. academics, office of student management and financial aid)  to help the potential student with enrolling into school. This enrollment helps the advisor reach their benchmark standard to sustain their job. But other department employees  do not have benchmarks subsequent to their position. These employees in other departments for the most part are inefficient,  irresponsible, and are rude to students and the advisors. \r\nAs an admission advisor, you are responsible to keep the company successful and in operations, but other department employees are not bought into the vison."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Smile, dial, enroll, repeat.  Again.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 May 2016", "job_title": "Admissions Advisor in Miami, FL", "duration": "N/A", "pros": "Lots of training and compensation potential. Some teams are better than others. Good variety of programs and certificates. Decent benefits.", "cons": "Not a healthy organization, lots of secrets and unfair policies. Potential student Lead quality varies significantly. Lots of pressure.  Inconsistent rules."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The Good and the Bad", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Nov 2016", "job_title": "Financial Aid Officer I in Bogotá, Bogota", "duration": "N/A", "pros": "Good benefits, training is good, various work schedules to choose from.", "cons": "They do not promote from within, the pay increase each year is at most 3%, depending on who  your manager is, they may not have your back or provide your good ideas to upper management."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Constant change", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Apr 2014", "job_title": "Education Advisor in Edmonton, AB", "duration": "N/A", "pros": "coworkers, opportunity to advance, training was offered as a new advisor. I had an 8-5 schedule which worked well for me", "cons": "I felt micromanaged. There was constant change with hardly any training offered to learn the curriculum, content of the courses, catalog changes, or career advising."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great place to work if you are a monkey", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Mar 2011", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "They paid very well if you enrolled. Otherwise,  advisors are treated as objects", "cons": "Management that never did the job."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Need developmental layer", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Sept 2013", "job_title": "Adjunct Professor in Orlando, FL", "duration": "N/A", "pros": "They offer a path to those who cannot attend a traditional college", "cons": "Too many of the students are vastly under skilled and unable to perform course requirements.  Very Very low pay for adjuncts. An embarrassment."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Definitely a sales job with a constant pressure to meet expectations.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Sept 2014", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "A nice working environment....cool people and overall relaxed setting.  Good experience for someone out of college but not a long term career unless you move to a different position.", "cons": "A true hustle and bustle environment and job security isn't the best.  Everything is great while you're meeting the expectations."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Jul 2015", "job_title": "Manager in Greenacres, FL", "duration": "N/A", "pros": "Kaplan offers great benefits, tons of development opportunities, a great education (if you take classes there), competitive pay, and a positive work environment.", "cons": "It can be stressful.  Kaplan is very metrics driven, and they expect a lot from their people."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Take the bad with the good", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Feb 2017", "job_title": "Marketing in Chicago, IL", "duration": "N/A", "pros": "You will learn a lot and if you work hard and pay attention to politics you'll get promoted.", "cons": "Some nice people, but a lot of jerks. Constant state of flux with annual re-orgs."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good Place To Start", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Sept 2017", "job_title": "Senior Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Good pay, 1.5x pay for any time over 40 hours. 100% free graduate/undergraduate/certificate education for employee & 50% off tuition costs for immediate family members.", "cons": "Hard to reach numbers at times, precarious situations, frequent layoffs,  no room for advancement."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Place to Work...if you are patient", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Sept 2010", "job_title": " in Fort Lauderdale, FL", "duration": "N/A", "pros": "You have the ability to get great cross functional experience\r\nEasy to work on very visible projects\r\nVery entrepreneurial--there is a lot of opportunity to run with your ideas", "cons": "Poor internal communications prevent anyone from knowing what anyone else is working on"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great peers...suspect upper management", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Mar 2015", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "health benefits are great...enjoy working with the people there and the ADOAs in military is awesome", "cons": "Upper management doesnt have a clue as towards showing employee appreciation..always constant change"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Personal rating on this organization", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Aug 2015", "job_title": "Project Manager in Coral Springs, FL", "duration": "N/A", "pros": "Prior management willing to stand up for what is fair and just.  Counter parts and team building", "cons": "The organization being under investigation.  Metric not being realistic for goal setting.  Change metric and goals in the interim just before performance review.  Constant turn around in the organization"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "The grass is not always greener.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "17 Sept 2012", "job_title": "Training and Development in Chicago, IL", "duration": "N/A", "pros": "I was exposed to a lot of experiences in business and was able to stretch and grow over the years.", "cons": "When I was with them we experienced rapid growth and struggled with hitting the right people in Admissions in Chicago."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Paid great, excellent benefits....", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Dec 2015", "job_title": "Admissions Specialist in Orlando, FL", "duration": "N/A", "pros": "Great pay, amazing benefits and had fun", "cons": "Inter department communication was horrible. Admissions is always the last to find out about anything, yet we are in the phone with students and potential students first."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Good but stressful", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Sept 2013", "job_title": "Admissions Representative in Plantation, FL", "duration": "N/A", "pros": "The people are great with Good personalities.  Very good food in the cafeteria.  Employees worked together even though there wasnt much career advancement.", "cons": "Work too hard for the money.  Management was ok but lead us the wrong way.  Very unorganized.  Relocation was too far."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "I would recommend this as a place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Nov 2013", "job_title": "Admissions Associate in Orlando, FL", "duration": "N/A", "pros": "Free education. The only cost is for books. Decent pay. Good company values. Good work environment. Training is provided.", "cons": "They start you off with good leads and then slowly lower the quality of the leads and make you work for your enrollments."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Finance Advisor", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Feb 2016", "job_title": "Finance Advisor in Lincoln, NE", "duration": "N/A", "pros": "Low stress, decent benefits and vacation", "cons": "No advancement opportunities, low salary, no annual bonuses and little to no annual raises"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not the best", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Aug 2016", "job_title": " in Des Moines, IA", "duration": "N/A", "pros": "They give you free donuts on Friday. That about sums up the good for this with this job. It really was horrible", "cons": "Bad Management\r\nIt's a sales job even though they try and tell you its not.\r\nYou lie to people and give them a worthless piece of paper that they paid $30k for."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "19 Oct 2018", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Pay and benefits are not bad.", "cons": "Stressful Environment at times with monthly expectations."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "online instructor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Feb 2016", "job_title": "Business Instructor in Cedar Rapids, IA", "duration": "N/A", "pros": "Online instructors work from home. One live session per week.", "cons": "Too many staff meeting webinars for adjunct professor.  Difficult to teach students how to write a sentence and spend time on subject matter."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "The Management was the issue", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "14 Jul 2017", "job_title": "Enrollment Auditor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Good benefits and decent opportunities for advancement.  The \"Gift of Knowledge\" program is also very helpful", "cons": "inefficient management and a disconnect between company goals and everyday practices."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "It was a very good experience, mainly because I worked on the Military Team", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Nov 2013", "job_title": "Director in Fort Lauderdale, FL", "duration": "N/A", "pros": "Good benefits, good group of people, great benefits", "cons": "Upper Management does not listen to the mid level managers"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "It has its upsnamd downs", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Dec 2013", "job_title": "Academic Ops in Fort Lauderdale, FL", "duration": "N/A", "pros": "Multiple schedules, great benefits, multiple locations, great product", "cons": "Terrible management,  no room for growth,  constant layoffs, little employee recognition,  favoritsm and high employee turnover"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "High turn over", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Oct 2014", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Decent  pay and benefits for Florida. Perfect for a college grad. There is room to grow if you speak to the right people.", "cons": "Tough sales environment, so the turn over rate is high. All you do is dial all day, go in to the occasional meeting, then dial some more."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Admission Advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Jun 2016", "job_title": "Senior Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Decent compensation and benefits available", "cons": "Too much internal politics; not many opportunity for individual development, growth, and promotion"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Sept 2016", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Great benefits, good people overall, lots of down time to get things done.", "cons": "Too much instability of processes and lack of communication. Expectations change too often to give you a sense of what you're working towards ."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "good people, good pay", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jun 2011", "job_title": "Admissions Representative in Fort Lauderdale, FL", "duration": "N/A", "pros": "good pay\r\ngood opportunity to advance, but if you are too good at sales, you will not advance because they wont let you leave", "cons": "small working space, and a lot of old women who complain a lot. i didnt like sitting in a chair all day either."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Lower the class size or quality can diminish", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "4 Jun 2015", "job_title": " in Stevens Point, WI", "duration": "N/A", "pros": "Excellent communication with staff and department meetings", "cons": "Large class sizes, which means longer work hours for less pay.. staff expectations keep increasing but pay rate actually took a cut"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Adjunct Professor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Jun 2015", "job_title": "Adjunct Professor in Jacksonville, FL", "duration": "N/A", "pros": "Great place to teach. Lots of support and students are expected to be challenged not coddled.", "cons": "They reduced salary for teaching graduate level courses to match that of college level. It's now per student enrolled which is ridiculous for graduate courses."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I LOVE Kaplan!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 May 2016", "job_title": "Instructor in International Falls, MN", "duration": "N/A", "pros": "My opinion matters in the eyes of management. They actually take suggestions. I also enjoy the feeling of family that Kaplan promotes. I've been there three years now and love them!", "cons": "No annual face-to-face meetings."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Admission Adviser has learned lesson", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Aug 2012", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Great pay and benefits.Free continuing education.", "cons": "I worked for Kaplan for 3 years. The compensation plan was changed every 3 to 6 months making it impossible to increase your salary based on the goals set for admissions. Very stressfull work environment. DOA's were very subjective to employees.Ask a lot of questions before accepting employment with this company."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Good pay, managed like a bakery on Calle 8!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Apr 2014", "job_title": "Director in Fort Lauderdale, FL", "duration": "N/A", "pros": "Good pay. Good benefits. Young atmosphere, fast-paced.", "cons": "Crippled leadership, lack of transparency, great at burning students/customers and employee out. Lack of interest in employee development, satisfaction, recognition. They don't walk the talk when it comes to hiring/retaining talent."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Sept 2016", "job_title": "Admissions Advisor in Atlanta, GA", "duration": "N/A", "pros": "Great environment. Great benefits. Many opportunities for advancement. \r\nManagement takes time to make sure employees are well trained and student focused.", "cons": "The schedule is difficult at times since most everyone works evenings or weekends. \r\nThey offer flex time but it's rare that we get it."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "admissions", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jul 2012", "job_title": "Military Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "nice co workers, very helpful", "cons": "made it very difficult to grow in the company, lots of pressure to perform without adequate training, most management did not really help you-lots of standing around and talking.  when you had questions, it seemed like it was an issue to get an answer."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Kaplan University has a high turnover rate!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Sept 2013", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "A paycheck while it lasts, great training program.", "cons": "You never have job security, if you are doing well you better continue to maintain those results or you will be gone in 3 weeks maximum!!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "admissions advisor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Dec 2014", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Benefits good , co-workers friendly , bosses flexible", "cons": "no real motivation except to keep your job"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Greed is good", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Aug 2013", "job_title": "Manager in Fort Lauderdale, FL", "duration": "N/A", "pros": "Work life balance if in right department", "cons": "They like to sell to anyone who will listen that they are in it for the students. Complete lie. The senior execs, from Andy Rosen to Greg Marino (who got to his position because he is related to the former president of Kaplan Jonathan Grayer, not because he is qualified per rumors) are in it for the money and could care less about the students imho."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "A bit messy", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Apr 2011", "job_title": " in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great benefits\r\nFairly good work/life balance", "cons": "Projects started and stopped for no apparent reason, making it difficult to get work moved forward. There was minimal rhyme or reason for some decisions. Question strategic thinking at the C-level/SVP level."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great school", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Apr 2014", "job_title": "IT Analyst in Des Moines, IA", "duration": "N/A", "pros": "Nice people, nice environment. Lot's of capabilities to enable you to have the highest ability to learn and succeed in jobs that are demanding in the world of technology.", "cons": "Never met the teachers to see how they enable students to learn in this environment."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Apr 2016", "job_title": "Education Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Core Values, solid platform, strong teachers, and competitive in the market overall", "cons": "Disconnected with the needs of employees. Low morale. Questionable lower-leadership"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "LOVE KAPLAN!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 Oct 2014", "job_title": "Director of Admissions in Boca Raton, FL", "duration": "N/A", "pros": "Benefits, promotion opportunities.  You are elevated based on merit and there is continued skillset training that will assist for those that use it.", "cons": "Kaplan is a lifestyle that will pay off in the end"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Student Finance Coordinator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Apr 2015", "job_title": "Student Finance Coordinator in Orlando, FL", "duration": "N/A", "pros": "Benefits and location, \r\n\r\nTime off 1-5 tears is equivalent to 21 days.", "cons": "Mobility and advancement is few and far. The industry has changed since gainful employment updates and there are far less opportunities to advance."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Meh.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Dec 2014", "job_title": "Admissions Advisor in Phoenix, AZ", "duration": "N/A", "pros": "The people I worked with were great, but other than that it was nothing special. If you're into sales work, then you'll probably like it I guess.", "cons": "CRAZY micromanagement - I understand some but this was way over the top crazy in my opinion\r\nOffice culture\r\nCompensation"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I would give zero stars if that were possible", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jun 2015", "job_title": "Assistant Professor in West Palm Beach, FL", "duration": "N/A", "pros": "None, zero, nada, zilch.  I hated this place!", "cons": "Students were nice people (most of them) but ill-prepared for college.  I wanted to tell the few that were ready for college to leave and go to a REAL college/university.  Instructors' expertise not respected.  It's all a numbers game for them--keeping students is a priority."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Current Admission Advisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2015", "job_title": "Admissions Advisor in South Milwaukee, WI", "duration": "N/A", "pros": "Great benefits, great leadership team, amazing support and a company with high integrity toward education and student welfare.", "cons": "Upward mobility is limited due to the small size of the campus, but lateral steps are possible and transfers to other campuses internally."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Everything changes", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Dec 2012", "job_title": "Admissions Advisor in Phoenix, AZ", "duration": "N/A", "pros": "Work environment is decent. Good co-workers", "cons": "Every 3 months everything completely changed from schedule adherence to performance expectations. Then they closed us down."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Financial Aid Officer", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Dec 2015", "job_title": "Financial Aid Officer in Orlando, FL", "duration": "N/A", "pros": "Benefits are great and Pay is decent", "cons": "Micro-managing Management, Management is unorganized, and the Executive Leadership is clueless as to what happens with the ground employees. Constant Lay Offs. No Job security."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work remotely", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Oct 2017", "job_title": "Academic Department Chair in Remote, OR", "duration": "N/A", "pros": "Super for those who prefer to work remotely. Structure your own day; work with minimal supervision.", "cons": "Computer equipment supplied could be upgraded; employee engagement activities are sometimes a bit much."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "It was a very rewarding experience I learned more about Financial Aid than I knew before", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Sept 2013", "job_title": "Student Loan Counselor in Chicago, IL", "duration": "N/A", "pros": "They believe in learning, they offer training to expand your experience the managers are very approachable, very friendly atmosphere.", "cons": "Not enough area for breaks and lunch times"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible experience", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Sept 2014", "job_title": "Student Recruiter in Phoenix, AZ", "duration": "N/A", "pros": "People believe they are actually changing lives.  Many of the reps are wanting to help others improve their status through education.", "cons": "They are signing people up for a lifetime of student loans that they will not be able to afford.  ADOA wanted us to sign anyone up that was willing to sign on the dotted line.  It was as though the minimum criteria was to simply have a pulse."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Sept 2015", "job_title": "Career Services Coordinator in Lewiston, ME", "duration": "N/A", "pros": "This is a great place to work! Open to new ideas, able to work independently and as part of a team. Good benefits", "cons": "If your not into change, education is rapidly changing as online education increases."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Scamming Prospective Students!", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Sept 2016", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "good benefits -excellent insurance nice work atmosphere, nice colleagues", "cons": "the pay structure isnt fair and they are scamming students into being on the hook for exorbitant amounts of money"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Collegial environment", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Apr 2009", "job_title": "International Student Advisor in New York, NY", "duration": "N/A", "pros": "access to practice exams was helpful.  work environment was collegial.", "cons": "rudeness of students and too much pressure (office was too understaffed to properly handle student volume)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Nice place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Nov 2013", "job_title": "Graduate Admissions in Plantation, FL", "duration": "N/A", "pros": "Great training to keep skill set sharp, good benefits and great co-workers", "cons": "Pressure to. enroll students. It doesn't matter if the person is grad student material."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Admission Specialist", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "22 Apr 2015", "job_title": "Admissions Specialist in Pompano Beach, FL", "duration": "N/A", "pros": "Great employee benefits for health insurance, tuition benefits", "cons": "When your numbers are down, management makes you feel like a worthless waste of space."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "ok", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Jul 2015", "job_title": "Academic Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Benefits were good... that is really all the pros", "cons": "Everything else... not an environment conducive to a good work/life balance"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It's ok.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Sept 2015", "job_title": "Manager in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great people! Atmosphere is great!", "cons": "Not so many opportunities for growth. If they see you are good at something, you are stuck there."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "ADMISSIONS ADVISOR", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Aug 2018", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Loved job; great health care benefits", "cons": "High pressure sales not appropriate for admissions advisor"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "VIRTUAL ENVIRONMENT WORK", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Aug 2014", "job_title": "Teacher/Tutor in New York, NY", "duration": "N/A", "pros": "You can do some of this work at any time, from your computer.", "cons": "Can seem confusing and unnecessarily complicated.  Too many websites.  Good pay when your teaching but low pay for prep times."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Kaplan University Online", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Aug 2015", "job_title": "Associate Director of Admissions in Orlando, KY", "duration": "N/A", "pros": "great benefits and pay, good opportunities if you are willing to relocate, great training", "cons": "Better realigning best practices as it relates to retaining great talent and building and maintaining employee morale"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Mediocre", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Feb 2020", "job_title": "Financial Aid Counselor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Opportunities for advancement will come up.", "cons": "Micromanaged, On the phone the entire day with 3 seconds between each call."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Admission Advisor", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jul 2014", "job_title": "Admissions Advisor in Plantation, FL", "duration": "N/A", "pros": "Great work environment. Team was always willing to help. Management is very hands on with employees.", "cons": "no incentives. They make you work overtime . The training is very cult like and they try to brainwash you."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Admissions Advisor", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Nov 2015", "job_title": " in Omaha, NE", "duration": "N/A", "pros": "Pay within the industry is great.", "cons": "The company tries to tackle too many initiative at once, which creates confusion for employees and students.  Extremely high stress, poor communication, and complete uncertainty about the future."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Kaplan University Employment", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "9 Feb 2016", "job_title": "Quality Assurance Manager in Lauderhill, FL", "duration": "N/A", "pros": "Kaplan is a great place to work.", "cons": "They have been laying off employees a lot lately. I'm sure it's for a valid reason for the best interest of the company."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Currently employed", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "12 Apr 2016", "job_title": "Senior Admissions Advisor in Boynton Beach, FL", "duration": "N/A", "pros": "Great opportunity to serve others who are looking to make life changing decsions", "cons": "Too many missed opportunities; too many changes throughout the admission process affecting student satisfaction."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Adjunt Professor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Sept 2016", "job_title": "Adjunct Professor in Terry, MS", "duration": "N/A", "pros": "Nice place to work! Monthly webinars assisted in making you feel at home even though you didn't work on the campus.", "cons": "There was an overabundance of teachers and not enough classes.  Some semesters you were not utilized."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Decent pay, back and forth with processess", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Feb 2017", "job_title": "Management in Orlando, FL", "duration": "N/A", "pros": "Decent pay, good benefits, casual work environment.", "cons": "Performance expectations, lead volume and Executive Directors"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Work study as a student", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Nov 2017", "job_title": "Anonymous Employee in Augusta, ME", "duration": "N/A", "pros": "It was great! I loved the people, and also as a student I got to know my teachers, the school and more about the campus.", "cons": "Only allowed 20 hours cause I was a student."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Financial Aid Administrator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jun 2013", "job_title": "Anonymous Employee in Orlando, FL", "duration": "N/A", "pros": "Great group of co-works overall", "cons": "Job processes that do not make any common sense"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "FRESH PERSONALITIES", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Sept 2014", "job_title": "IT Support in Fort Lauderdale, FL", "duration": "N/A", "pros": "Everyone is so diffrent nice, they are real. For an office building  with support and help so diffrent.", "cons": "Personaly it was a long drive, but the company itself is good."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Senior Business Development Associate", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Jun 2015", "job_title": "Senior Business Development Associate in Fort Lauderdale, FL", "duration": "N/A", "pros": "great multi-cultural environment, interesting marketing budget", "cons": "Unorganized, no clear path or goals, too many people that do not meet qualification requirements to work there and as a result processes and rules are not properly followed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Student Finance Coodinator", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Aug 2016", "job_title": " in Orlando, FL", "duration": "N/A", "pros": "Wonderful company with excellent pay and benefits. Work life home balance.", "cons": "To much changes and too many lay offs over course of a few years. Management not well trained on how to conduct business with employees"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Excellent place for smart, hard working people to work, especially in South FL", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Aug 2011", "job_title": " in Fort Lauderdale, FL", "duration": "N/A", "pros": "Feels great to work for a University who serves adults who need the education we provide.", "cons": "Long hours are necessary at times."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "I have grown through the years at Kaplan.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2012", "job_title": " in Fort Lauderdale, FL", "duration": "N/A", "pros": "There are growth opportunities within the school.", "cons": "The morale in each department depends greatly on the manager."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Good intentions, horrible direction. Slow pace in getting the job done.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "15 May 2013", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Casual dress for the office.", "cons": "Too much red tape involved in getting anything done quickly."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Feb 2014", "job_title": "Specialist in Fort Lauderdale, FL", "duration": "N/A", "pros": "Competitive pay and they work hard to promote employee engamgement and recognition.", "cons": "No different than any other company in the marketplace."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good Company", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jul 2015", "job_title": "Team Lead in Orlando, FL", "duration": "N/A", "pros": "Good Management, good working environment", "cons": "A lot of Micro Management"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Going through alot of changes", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Jun 2017", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Good benefits, decent pay, good coworkers.", "cons": "Culture has changed for the negative. Stressful. Pressure on advisors to get enrollments."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "I was responsible for enrolling students into the university", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jul 2010", "job_title": "Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "Excellent comission - good online school in comparison to competition", "cons": "high turn-over - micro-managed environment"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Release Engineer II/ Release Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Jun 2015", "job_title": "Release Engineer II/Release Management in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great benefits.\r\nGreat culture.\r\nAbility to work from home.", "cons": "Lack of leadership.\r\nRumors of curtailing work from home benefit."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Student Finance Rep", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 Nov 2016", "job_title": " in Cypress, FL", "duration": "N/A", "pros": "Great work atmosphere, great culture and pay was okay.", "cons": "Management Team needs to be managing. Favoritism seems to be another issue and its based on departments."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good benefits but very stressful - Not a career plan", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Oct 2013", "job_title": "Senior Manager in Fort Lauderdale, FL", "duration": "N/A", "pros": "Health, Dental,401K, vacation policy, Free tuition", "cons": "Not a place to retire - very poor middle management - every employee is looking for a new job."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Disorganized", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Jun 2014", "job_title": "Adjunct Instructor in Des Moines, IA", "duration": "N/A", "pros": "It was an alright job for part-time, the students were fun (some more than others)", "cons": "Poor training, I did not get access to the grading system until mid-term. I was forced to use tests from another instructor and I did not receive them until moments before the test was to start."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Admissio Advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Dec 2015", "job_title": "Anonymous Employee in Fort Lauderdale, FL", "duration": "N/A", "pros": "Decent compensation package, great coworker;", "cons": "Poor work like balance; poor culture; sales/enrollment drive; very high turnover; the work environment is constantly changing so don't get use to anything"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Talented Professionals", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Mar 2016", "job_title": "Career Specialist in Plantation, FL", "duration": "N/A", "pros": "There are many talented individuals that are committed to student success and a positive student experience.", "cons": "Some nepotism as with anywhere, but you can get cross departmental experience."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Financial Aid Coordinator", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Nov 2016", "job_title": "Financial Aid Coordinator in Chicago, IL", "duration": "N/A", "pros": "There are good people working there that care about the students. Casual dress code.", "cons": "This is a business, it's all about numbers not the students. You won't enjoy people students in more debt."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good working conditions but high turnover", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Oct 2017", "job_title": "Adjucnt in Remote, OR", "duration": "N/A", "pros": "Working from home is convenient especially when you work at night or weekends.", "cons": "High turnover.  Too many people leaving.  Good people leaving."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "One of the most disappointing employers of my professional career!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jul 2012", "job_title": "Director in Fort Lauderdale, FL", "duration": "N/A", "pros": "The benefits are very good.", "cons": "A constant changing environment without little to no strategic plan or Senior Executive alignment."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Career Services", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2015", "job_title": "Career Services in Chicago, IL", "duration": "N/A", "pros": "Management is good, they care about the students and their team", "cons": "Don't make people commute into work after a blizzard"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "General", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Apr 2016", "job_title": "Adjunct Faculty in Remote, OR", "duration": "N/A", "pros": "Flexible some of the time.", "cons": "still had to maintain hours per week to get job done.  Need internet connection so if go out of town, need to stay at hotel with access."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Poor and unfair management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Nov 2016", "job_title": "Admissions Advisor in Rockville, MD", "duration": "N/A", "pros": "Salary, benefits, flexibility, team, workshops", "cons": "Our manager at the Rockville campus was two faced, displayed favoritism, unfair and unpleasant.  She is probably still there because she lied and deceived upper management over and again. Micromanagement to the max.  She Only cared about getting numbers.....didn't care about what the students needed."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Career Specialist", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Mar 2016", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Flexibility, great people, reasonable pay, decent pto,", "cons": "Only 2 health insurance options, nepotism, little room for advancement"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "SR Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Oct 2016", "job_title": "Senior Admissions Advisor in Boca Raton, FL", "duration": "N/A", "pros": "Benefits package was good, constant training and feedback.", "cons": "constant pressure from supervisors, micro management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Marketing Technology Manager", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jun 2017", "job_title": "Anonymous Employee in Fort Lauderdale, FL", "duration": "N/A", "pros": "Employees are knowledgeable and it felt like family environment.", "cons": "None as this company has  great teams and positive environments. Employees focus on best actions for students."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "\"My experience here is very forgettable\"", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Dec 2014", "job_title": "Financial Aid Specialist in Fort Lauderdale, FL", "duration": "N/A", "pros": "The pay is ok and they have a phenomenal training that will help prepare you for the job.", "cons": "Management is not helpful and take advantage you."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good job/compnay over all", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Mar 2016", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Good benefits, great co-workers, flexible hours, option to work remotely.", "cons": "Leadership differs by person - some amazing managers (some less so). Lack of communication from top-down."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work but wihout advancement opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Aug 2016", "job_title": "Anonymous Employee in Coconut Creek, FL", "duration": "N/A", "pros": "Great people to work with in a mostly low stressful environment", "cons": "No real opportunities for advancement in IT."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "It has been rewarding and I've had the opportunity to grow.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 May 2012", "job_title": "Academic Advisor in Chicago, IL", "duration": "N/A", "pros": "It can be a place of opportunity.", "cons": "There is a lot of upper management turnover."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Promises Everything but delivers little", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Apr 2013", "job_title": "Admissions Advisor II in Fort Lauderdale, FL", "duration": "N/A", "pros": "Culturally diverse employee population\r\nGreat office envionment for cubicles", "cons": "Very little chance for upward movement\r\nNew employees produce or are fired"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Student Finance Coordinator", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Dec 2017", "job_title": "Student Finance Coordinator in Orlando, FL", "duration": "N/A", "pros": "education reimbursement benefit is great for those looking to go back to school", "cons": "weak management unreal expectations....flawed pressure due to flawed crm"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Admissions department at Kaplan University", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Dec 2014", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great benefits that will suck you in", "cons": "Extremely sales driven, which if you are not a sales person wouldn't be good for you"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible place to wok", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 May 2015", "job_title": "Dean of Curriculum in Chicago, IL", "duration": "N/A", "pros": "It used to be a good place to work. The university grew too fast during the first five years. While there is a lot of growth, there is no job stability.", "cons": "Very bad leadership. Focused on profit since Andy Rosen got promoted out of the university. It became only focused on profits."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Student", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Oct 2015", "job_title": "Sand Chief Operator, PCM Operator, Pump Operator, Blender Operator in Tucson, AZ", "duration": "N/A", "pros": "The ability to interact with individuals that have a same goal as I do.", "cons": "The group is highly competitive and sometimes are in control of the wrong objective."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Kaplan it's Kaplan", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Dec 2016", "job_title": "Anonymous Employee in Fort Lauderdale, FL", "duration": "N/A", "pros": "Relax environment, The environment is fun and people are like family", "cons": "Benefits are not the best, lay offs still going."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Associate Director", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Apr 2018", "job_title": "Associate Director in Cedar Rapids, IA", "duration": "N/A", "pros": "Big company, 401k, and some room to grow", "cons": "Poor C-level management and leadership at the top"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to teach", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "28 Mar 2017", "job_title": "Adjunct Professor in Croton-on-Hudson, NY", "duration": "N/A", "pros": "Great work / life balance\r\nConsistent teaching assignment\r\nPlenty of opportunity to collaborate with co-workers", "cons": "Enrollment is down, so no more teaching multiple courses"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Decent job experience.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Aug 2013", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Decent pay and tuition is covered %100.", "cons": "Working every Saturday and having a tough quota to meet."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "My Kaplan Review", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Oct 2014", "job_title": "Financial Aid Officer in Orlando, FL", "duration": "N/A", "pros": "Compared to other schools, pay and benefits are good. Professional environment and more structured than other schools.", "cons": "This company has too many layoffs"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Education Avisor", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Oct 2016", "job_title": "Orientation Facilitator in Chicago, IL", "duration": "N/A", "pros": "Get to be a personal life coach and it is a job!", "cons": "No internal growth, lack of support, and lack of culture in environment"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Associate Director of Admissions", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Sept 2017", "job_title": "Associate Director of Admissions in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great People and a great place to work", "cons": "Too long commute of a commute"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to work and grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Jul 2014", "job_title": "Director of Admissions in Plantation, FL", "duration": "N/A", "pros": "willing to help you grow and expand", "cons": "at the moment changes can be disrupptive"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "It's a meh place to be", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Feb 2016", "job_title": "Education Advisor in Chicago, IL", "duration": "N/A", "pros": "Co-workers, Weekends off, Downtown location", "cons": "Stingy with pay and pay increases, mediocre PTO and benefits"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Admissions Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jul 2016", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Great compensation, good benefits, bi-yearly review and raise, positive work enviornment", "cons": "Glass ceiling, not a lot of upward mobility, strict sales goals."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "great", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Oct 2016", "job_title": "Student Default Counselor in Fort Lauderdale, FL", "duration": "N/A", "pros": "awesome fun place to work", "cons": "need to bring more temps & contracted employees permanent"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Admissions Adviser for a good company", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2015", "job_title": "Admissions Adviser in Plantation, FL", "duration": "N/A", "pros": "Great work culture, respect, sales environment but with options to get better", "cons": "No respect for people's chosen schedules."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Constant changes", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Feb 2016", "job_title": "Instructor in Pittsburgh, PA", "duration": "N/A", "pros": "Working with non-traditional students to give them second or third chances at success.", "cons": "Individual positions and entire corporate always in peril of extinction"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Kaplan Inc.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Nov 2016", "job_title": "Program Manager in Fort Lauderdale, FL", "duration": "N/A", "pros": "Work Schedule, Education Benefits, Culture and Values", "cons": "You will not get rich working in education."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Associate Director of Admissions", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Mar 2017", "job_title": "Associate Director in Fort Lauderdale, FL", "duration": "N/A", "pros": "Growth opportunity in some areas.", "cons": "Decline in business at times"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Kaplan Career Move", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Jul 2014", "job_title": "Director of Career Services in Omaha, NE", "duration": "N/A", "pros": "Flexibility, Continued Professional Development, and Excellent Employee Benefits", "cons": "Lack of Diversity in Leadership"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Career Service Advisor", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 May 2015", "job_title": "Career Advisor in Omaha, NE", "duration": "N/A", "pros": "Great company with opportunities for growth!", "cons": "Not much on-campus/face-to-face interaction with students because a majority take online classes."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Work Study Student", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Sept 2015", "job_title": "Bookstore & Library Assistant in Mason City, IA", "duration": "N/A", "pros": "Professional Management and friendly employees", "cons": "No cons or complaints that I can think of"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A university that focuses on sales", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Mar 2017", "job_title": "Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Easy to get employed here", "cons": "Management constantly pushing sales"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Professors", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 May 2015", "job_title": "Professor in Washougal, WA", "duration": "N/A", "pros": "Easy work, low expectations, some decent colleagues.", "cons": "Evil, vindictive management with multiple agendas, none of which benefit students or teachers. Taking veteran's benefits while delivering one of the lowest quality educational experiences."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Admissions Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Feb 2016", "job_title": "Admissions Advisor in Oakland Park, FL", "duration": "N/A", "pros": "Pays for college, great upper management", "cons": "No chance for advancement. Odd hours"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Adjunct", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Jul 2016", "job_title": "Adjunct Professor in Estes Park, CO", "duration": "N/A", "pros": "Great support for faculty and student centric teaching", "cons": "No full time positions for professors"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Advisor Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Dec 2016", "job_title": " in West Palm Beach, FL", "duration": "N/A", "pros": "Flexible environment, great people & culture, leadership is very supportive of their staff", "cons": "Continue gathering input from the staff"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great educational experience.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Jan 2014", "job_title": "Anonymous Employee in Framingham, MA", "duration": "N/A", "pros": "Challenging, rewarding, and lots of great instructors.", "cons": "The on-line system minimizes interaction."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Admissions Advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Nov 2015", "job_title": "Admissions Advisor in Hollywood, FL", "duration": "N/A", "pros": "Get to help students change their lives", "cons": "Sales position where we do not get paid commissions."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "financial aid", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "19 Jan 2016", "job_title": "Financial Aid Officer in Orlando, FL", "duration": "N/A", "pros": "good benifits , many shifts to choose , nice co workers", "cons": "on the phone all day ,,, very strict rules"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great company  to work for.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Sept 2017", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Benefits \r\nManagement \r\nWork life balance\r\nChallenging \r\nEducation", "cons": "High pressure \r\nSales \r\nQuota \r\nMicromanaging \r\nSmall work space"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Ready to move on", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Aug 2015", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Culture and work environment are perfect.", "cons": "No advancement opportunity and pay is below average for industry."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Receptionist", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Dec 2015", "job_title": "Receptionist in Miami Gardens, FL", "duration": "N/A", "pros": "No micro-managing, very friendly environment, excellent hours, gym on site", "cons": "Not always paid on time, according to permanent employees"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Kaplan Financial Aid", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Sept 2016", "job_title": "Financial Aid Officer in Indianapolis, IN", "duration": "N/A", "pros": "stable job, good co-workers, risk averse, high growth", "cons": "bad hours, lot's of phone calls, pushy admissions"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "admissions advisor", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Feb 2017", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "decent hourly rate\r\nthats it", "cons": "mass hiring is done and then mass layoff within 1st year\r\ncommunicate termination structure before offering positions to people\r\nnot about the student, its about the sales numbers only\r\nunrealistic sales goals\r\narrogant leadership\r\nmicro management at its finest"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Admissions Adviser", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Nov 2018", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "None, it was absolutely soulless. Encouraged to play upon people's weaknesses in a time of terrible for our economy.", "cons": "This is a employment mill. Quite possibly the sort employment experience of life."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Decent company to work for", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Oct 2019", "job_title": "Education Advisor in Chicago, IL", "duration": "N/A", "pros": "Decent benefits, set work hours", "cons": "Turned into more of a sales environment than advising"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "ok workplace high turnover", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Sept 2013", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "good pay and benefits for the current market", "cons": "high turnover little to no growth."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "FA Student  Services", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Aug 2014", "job_title": "FA Student Services in Fort Lauderdale, FL", "duration": "N/A", "pros": "Time off policies, great building and benefits", "cons": "Poor management, poor advancement opportunities, and limited truth"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "AA II", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Sept 2014", "job_title": "Admissions Advisor in Boca Raton, FL", "duration": "N/A", "pros": "The pay was enough to keep you there", "cons": "Nearly impossible for advancement in the admission advisor role."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Adjunct Instructor", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Sept 2015", "job_title": "Adjunct Instructor in Cincinnati, OH", "duration": "N/A", "pros": "Good communication, excellent support, collaborative", "cons": "Given the nature of enrollment class assignments are not fixed"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Manager", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Mar 2016", "job_title": "Manager in Chicago, IL", "duration": "N/A", "pros": "Very good working hours and schedule", "cons": "High attrition and lower pay"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Student Coordinator", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Oct 2016", "job_title": "Student Coordinator in Orlando, FL", "duration": "N/A", "pros": "Laid back work environment, good benefits.", "cons": "Underpaid and overworked, often a  hostile work environment"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Solid benefits, moderate pay and little opportunity.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Mar 2017", "job_title": "Career Services Advisor in Chicago, IL", "duration": "N/A", "pros": "Predictable schedule, and some flexibility.", "cons": "little mobility or opportunity within departments."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "no job security", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Dec 2012", "job_title": "Admissions Advisor in Boca Raton, FL", "duration": "N/A", "pros": "easy, good benefits and PTO", "cons": "boring, leads are not of quality"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jan 2016", "job_title": "Adjunct Professor in Atlanta, GA", "duration": "N/A", "pros": "You are encouraged to work independently.", "cons": "It is hard to move up"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Kaplan", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "2 Aug 2016", "job_title": "Sales Associate in Boca Raton, FL", "duration": "N/A", "pros": "excellent pay structure each month", "cons": "stress to meet goals every month"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Great University", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Nov 2014", "job_title": "Adjunct Instructor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Easy access, friendly professors, excellent training opportunities", "cons": "Must be able to work independently"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Sept 2016", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "Fun place to work and benefits are great~", "cons": "No room for advancement"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Salary", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jan 2015", "job_title": "Education Advisor in Chicago, IL", "duration": "N/A", "pros": "Business Casual dress code. Office accessible by train.", "cons": "Too many rapid changes to processes."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good Environnement", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Apr 2016", "job_title": "Senior Software Engineer in Boca Raton, FL", "duration": "N/A", "pros": "The peoples are cool, good benefits", "cons": "Too much turn over on management side"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Registration specialist", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 May 2015", "job_title": "Registration Specialist in Chicago, IL", "duration": "N/A", "pros": "Learned a lot from managers", "cons": "Low pay for the amount of stress."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Fun environment", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Sept 2019", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great work environment. Very positive.", "cons": "I don't have any cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Admissions Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Jan 2017", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Great Employees. Healthy competitive environment", "cons": "Sometimes too competitive. No cons"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "_", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 May 2015", "job_title": "Production Coordinator in Chicago, IL", "duration": "N/A", "pros": "Flexible schedule\r\nHigh salaries given work demands", "cons": "Lack of growth and advancement opportunities."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Micromanaging sweat factory", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Sept 2012", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "None that I can think of.", "cons": "Upper Management had the worst pep talk meetings almost everyday. Super micromanaged. Interviews with students expected to be 45 mins in length...who is going to stay interested???"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Faculty Criminal Justice", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "27 Jan 2018", "job_title": "Faculty in Naples, FL", "duration": "N/A", "pros": "Good colleagues who are professional at their skill", "cons": "Greedy management, ruthless employer. Excessive work demands. They pay poverty wages, some of the lowest in the nation."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Unethical", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Dec 2016", "job_title": " in Plantation, FL", "duration": "N/A", "pros": "Not many pros other than scheduling", "cons": "HR department is truly vicious. I was released while on medical leave."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "not what you think it is", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Sept 2010", "job_title": "Admissions Representative in Chicago, IL", "duration": "N/A", "pros": "Can advance quickly and make more money", "cons": "senior management is incompetent with web of politics unparalleled"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Oct 2011", "job_title": "Director of Admissions in Orlando, FL", "duration": "N/A", "pros": "Opportunity to make money before DOE regulation. Now the opportunities for growth are non existent.", "cons": "Promotions for \"favorites\" - strategies poor"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Admissions Advisor", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "3 Jun 2017", "job_title": " in Cedar Rapids, IA", "duration": "N/A", "pros": "Compensation was ok for the job stress", "cons": "Worse Management Team EVER they need to fire and rehire"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Beware....misleading Management", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Sept 2015", "job_title": "Administrative Assistant in Omaha, NE", "duration": "N/A", "pros": "They off a Flexible schedule", "cons": "No HR representation, rude management, unethical practices"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "student finance coordinator", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Mar 2018", "job_title": "Sfc in Fort Lauderdale, FL", "duration": "N/A", "pros": "there are a lot prejudice and discrimination", "cons": "there is no no room for growth"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Horrible", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Oct 2013", "job_title": "Student Coordinator in Fort Lauderdale, FL", "duration": "N/A", "pros": "There are no pros for working at this establishment.", "cons": "Environment, Training, atmosphere and management."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Advisor", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jan 2016", "job_title": "Anonymous Employee in Orlando, FL", "duration": "N/A", "pros": "Pay was good at hire", "cons": "Management has had on going issues"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Big Brother", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Jul 2013", "job_title": "Financial Aid Servicing Counselor in Chicago, IL", "duration": "N/A", "pros": "Nothing I can think of.", "cons": "Micromanagement, impossible incentive compensation schemes."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Chaotic at best", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2015", "job_title": " in Fort Lauderdale, FL", "duration": "N/A", "pros": "The on-site cafeteria was the best part", "cons": "Constant turnover, lackluster management, no visibility"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Admissions Advisor", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Oct 2015", "job_title": "Admissions Advisor in Coral Springs, FL", "duration": "N/A", "pros": "Reasonable physical working conditions and nice co-workers", "cons": "Too much uncertainty in job security."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poorly Managed", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Jan 2017", "job_title": "Admissions Advisor in Fort Lauderdale, FL", "duration": "N/A", "pros": "Fun atmosphere with good people", "cons": "salary, management micromanages and bad lead distribution"}]]