[[{"date": "2 Jun 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Altru Health", "Interview Descriptions": "fair interview process for hiring.  Non biased. Interviewed for a handful for positions as a new graduate.  Submitted online. Waited just a few days to hear back from someone. Interviewed in person.", "Interview Questions": "Please tell me about yourself "}, {"date": "20 Apr 2022", "title": "Education Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Altru Health", "Interview Descriptions": "Phone interview with a recruiter who asked questions as if they were on a script. No acknowledgement after I answered a question, just moved on to the next question (one of the most robotic-feeling interviews I have ever had). Next step was an interview with the hiring manager followed by an interview with three other team members/colleagues. Position ended up being filled by an internal candidate.", "Interview Questions": "Describe a conflict with a co-worker and how you handled it. "}, {"date": "9 Aug 2021", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Altru Health", "Interview Descriptions": "Everything went well during interview but you will feel like that's all lie. The manager said he will help the employee to move on and improve their performance but actually he did not. He literally doesn't know how his team is doing for their job.", "Interview Questions": "How was your work before?\r\nWhat do you think of your weakness in working?\r\nHow to deal with the relationship with coworkers and leaders? (Finally you will know how you should deal with it)"}, {"date": "7 Aug 2021", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Altru Health", "Interview Descriptions": "Phone interview first, then video interview. Roughly 30 mins each. It’s kind going well in interview, but after you’re hired they would try their best to picky on you. Like if you’re doing things in the different way, they will say you’re wrong. Lots of blames and talking behind you when you’re working here. Finally, you’ll get discontinued on your job because they find more easy to complain, even bully and cheaper labor than you.", "Interview Questions": "What did you do in your last job?\r\nHow do you resolve the difficulty situations?\r\nCan you give an example of how did you deal with the relationship with your manager and coworkers? "}, {"date": "22 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Altru Health in Sept 2020", "Interview Descriptions": "I have interviewed for several positions with this company. They seem to ask similar questions every time. The questions focus on a problem, how you solved it, and what the outcome was.", "Interview Questions": "Describe a situation where you disagreed with or had a problem with a coworker. How did you solve this problem and what was the outcome? "}, {"date": "22 Jul 2019", "title": "MT/CLS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Altru Health (Grand Forks, ND)", "Interview Descriptions": "Interview process went smoothly. First I did a phone interview with the recruiter, then a second phone Interview with the lab supervisor. Finally I did an in-person peer interview and got a tour of the lab.", "Interview Questions": "Name a time you used teamwork in your job, or something like that."}, {"date": "20 Nov 2019", "title": "Professional Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Altru Health in Jan 2019", "Interview Descriptions": "Lengthy process, strange questions, odd choice of interviewers, confusing steps.  \r\n\r\nAfter several phone conversations, multiple call onsite interviews and delays in hearing back, I tried to reach out for follow-ups and, ultimately, inform them I accepted an outside offer, but to no answer.  The next week, a form email was sent stating many applications were received and they are no longer processing my application.  \r\n\r\nThis was for a professional level role and I have never experienced such a lack of professional communication and respect.  It's a disappointment to have gone through such a process and travel to have conversations, only to be 'ghosted' by the in-house recruiter.  I wish them well, though hope the team can build from this feedback and provide a better experience for others.  The greater community is too small to leave such impressions when resources are scarce.", "Interview Questions": "Behavioral based buestions (Tell me about a time when....)"}, {"date": "31 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Altru Health (Grand Forks, ND) in Jan 2019", "Interview Descriptions": "2 direct manager about the experience and previous practice it took around 30 minutes..it was kind of friendly talk ..\r\nExplore my area of experience and different situations in work place", "Interview Questions": "Why u like to work here "}, {"date": "23 Oct 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Altru Health", "Interview Descriptions": "HR will call and set up a time to meet with you. Directly after I met with the Phlebotomists and Clerical manager. I got a call a week later that I got the job.", "Interview Questions": "What is one of your weakness’s "}, {"date": "28 Dec 2017", "title": "EMT-B Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Altru Health (Grand Forks, ND)", "Interview Descriptions": "Applied online, 2 weeks later I got a call to set up a phone interview and a in person interview for the following week.  Phone interview lasted 20 minutes and the in person interview lasted 30 minutes.", "Interview Questions": "what kind of ethic/value situation have you been in and how did you handle the situation?"}], [{"date": "26 Sept 2017", "title": "Sonographer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Altru Health (Grand Forks, ND) in Mar 2017", "Interview Descriptions": "I was taken for a tour of the hospital first  and then they took me to a room to ask questions. It took me around 3 hours to interview with them", "Interview Questions": "What exams are you proficient in?\r\n"}, {"date": "12 Sept 2017", "title": "Clinical Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Altru Health (Grand Forks, ND) in Jun 2016", "Interview Descriptions": "The hiring process moves at a glacial pace. They have specific days they arrange their interviews to be completed, and if your schedule does not allow for those days, they will have to arrange a special date to meet with their interview team. They will interview you in a round robin style with three or more interviewers. It typically takes anywhere from 45 minutes to over 1 hour. The callback and determination length of wait is quite a bit - can be up to three weeks before they make their determination. \r\n\r\nThey will call your current employer for employment verification prior to your interview, so be prepared for your current boss to have questions for you. \r\n\r\nTheir questions are meant to be answered in three parts: Situation, what steps you personally took, and how was it resolved.", "Interview Questions": "Describe a difficult situation in which you had to ensure patient and family satisfaction was met. How did you resolve the situation?"}, {"date": "1 May 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Altru Health (Grand Forks, ND) in Apr 2016", "Interview Descriptions": "I have had multiple interviews here, very professional. They communicate the process very well, however the wait time between application ->interview -> offer is very long. I also went through peer interviewing at the time. The process was enjoyable and I was able to meet future coworkers who came prepared with their own questions, and were able to answer questions about the department. It was a fun process.", "Interview Questions": "What attracted you to this position?"}, {"date": "18 Jun 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Altru Health (Grand Forks, ND) in Jan 2016", "Interview Descriptions": "first off, you wait for the interviewer to call your name out. Then you get up walk up to her and in troduce yourself. Firm hand shake is a must. She then walks you in her office and has you take a seat. She then tells you she will ask about 13-15 questions and I answer the best I can. And so I did.", "Interview Questions": "what are your weaknesses?"}, {"date": "1 Aug 2014", "title": "COTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Altru Health (Grand Forks, ND) in Jul 2014", "Interview Descriptions": "Altru takes along time to get back to you after the interview process, didn't get responses from the human resource department or the supervisor who interviewed me for over 2 weeks. May have been on vacation since it was summer.", "Interview Questions": "what can you bring to the department that know one else can."}, {"date": "27 Jul 2016", "title": "Financial Information Analyst/Planning Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Altru Health (Grand Forks, ND) in May 2013", "Interview Descriptions": "Four years prior to applying for this job, I did an internship in the same division.\r\nI applied for this job online\r\nReceived an invitation to interview in person\r\nInterviewed with future supervisor and co-worker which consisted of 7 situation/behavior/outcome questions.\r\nWas offered the job within 5 days\r\nHad to pass a drug screening and background check\r\nAttended a one day orientation\r\nStarted job within three weeks of receiving the job offer", "Interview Questions": "Describe a situation when you had to collaborate with a team to achieve a common goal."}, {"date": "25 Jul 2013", "title": "Dietary Four Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Altru Health (Grand Forks, ND) in Apr 2012", "Interview Descriptions": "It doesn't take long for them to get back to u after submitting an application about 1 week. But after that u go in for the actual interview which is another week or less depending on their availability to get u in. And after the hiring that's what can take the longest I wanted to start as soon as possible so I called the manager a couple times to let him know I was cleared for the drug and health test so it took me about two weeks before I actually started after that. But other employees said it took them a good month or two. So if your persistent like I was there shouldn't be an issue. Along with it depending if they tell u u have the job in the first interview or not. For me they hired me on the spot but there has been other employees that have to come back for another interview or wait a week before they hear back from them if they got the job or not.", "Interview Questions": "What are your expectations with us here at Altru."}, {"date": "24 Jul 2012", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Altru Health (Grand Forks, ND) in Jan 2012", "Interview Descriptions": "Applied on tthe company website followed by her call, followed by telephonic interview followed by in person interview", "Interview Questions": "Had a situation when you disagreed witth you manager"}]]