[[{"date": "24 Apr 2023", "title": "Web Developer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Touro College and University System", "Interview Descriptions": "Interview was average it took a month to get job offer. after second though and research I find out it does not worth it. They need to raise their salary offers.", "Interview Questions": "interviewer asked about github. general questions about JS"}, {"date": "3 Mar 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Touro College and University System in Jan 2022", "Interview Descriptions": "I had a first round interview. The interviewers gave a thorough overview of the position, discussed salary, and discussed next steps regarding who I would meet with for a second round interview.", "Interview Questions": "What interests you in this position?"}, {"date": "28 Apr 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Touro College and University System", "Interview Descriptions": "A Brief, prompt interview of 15 minutes with two Deans and the Director of Undergrad Admissions. Interview held within a small room. Questions were Customer Service oriented with some scenario questions.", "Interview Questions": "How would you handle a difficult situation?"}, {"date": "20 Sept 2022", "title": "BURSAR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Touro College and University System (New York, NY) in Apr 2021", "Interview Descriptions": "An easy process if they like you from the beginning. They go over the resume and ask a couple of questions. It is two round interviews, first with the manager and second with the department head. ", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "14 Feb 2022", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Touro College and University System (New York, NY) in Mar 2021", "Interview Descriptions": "The first step was phone screening from the team lead that asked if I’m interested in working in higher education. The second interview was a group interview with the whole team, it was mostly about self introduction and work experiences/ skills review. After that, they have me a home assignment, and I came back a month later to present my project with the team. A week later, they asked me for background check. After the check, I received the offer.", "Interview Questions": "Tell me about your work experiences and how does it relate to this position.\r\n\r\nWhat is your biggest weakness?"}, {"date": "26 Jan 2021", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Touro College and University System", "Interview Descriptions": "The interview process was a combination of meeting all of the library staff for quick introductions, viewing the library, concluding with a friendly conversation about the positions and my qualifications.", "Interview Questions": "What experiences do you have? "}, {"date": "16 Feb 2022", "title": "Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Touro College and University System (New York, NY) in Jan 2021", "Interview Descriptions": "No interview. Said hello. They asked me what I was interested in doing at touro. No questions about qualifications or past work history. No chance to ask them about anything either. A real joke", "Interview Questions": "What do you want to do here "}, {"date": "10 Nov 2020", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Touro College and University System", "Interview Descriptions": "Spend day at the school with large group of interviewees. We got taken out in smaller group to be interviewed by a pair of Professors each. I was questioned about my research and we spent a lot of time discussing that.", "Interview Questions": "Why are you interested in Osteopathic Medicine?"}, {"date": "10 Sept 2020", "title": "IT Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Touro College and University System", "Interview Descriptions": "Very easy. Sign up and if the times works right then your probs good unless someone else took it.  thwip   thwip   thwip   thwip   thwip   thwip   thwip   thwip   thwip", "Interview Questions": "What is your availability during school?"}, {"date": "24 Mar 2020", "title": "Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Touro College and University System", "Interview Descriptions": "I submitted a resume and cover letter. The interview was informal and questions mostly concerned when I was able to work. The resume portion seemed to speak to whether certain qualifications were met.", "Interview Questions": "How flexible is your schedule? "}], [{"date": "20 Oct 2020", "title": "Site Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Touro College and University System (New York, NY) in Mar 2020", "Interview Descriptions": "The interview process consisted of speaking with a bunch of other directors via video call about my credentials, interest in the position, and questions about the position. There was a break in the interview process due to COVID.", "Interview Questions": "What is the reason behind your interest in switching careers?"}, {"date": "20 Jan 2021", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Touro College and University System (New York, NY) in Feb 2020", "Interview Descriptions": "Good interview process. I am happy that they condensed it all to one day. Interviewed with multiple members of senior leadership. Pretty straightforward process and received offer shortly after.  Overall, it was a very smooth interview process.", "Interview Questions": "What experience do you have in this field?"}, {"date": "4 Sept 2019", "title": "Benefits Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Touro College and University System", "Interview Descriptions": "A series of three interviews. Phone interview first, then you meet with the Benefits specialist, and then with the HR director, senior HR Partners and finally the VP of HR.", "Interview Questions": "Why Touro College? What do you know about Touro? How do you stay organized? What benefits are you familiar with?"}, {"date": "23 Mar 2019", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Touro College and University System", "Interview Descriptions": "The first round was an initial telephone interview, about 30 minutes. The second round was an in-person interview with the hiring manager. The third round comprised two sessions, one an with executive manager and another one with team members, respectively future colleageus.", "Interview Questions": "Given your prior professional experience, what value can you bring to specifically this position?\r\nSince you will be in a customer-facing role, how do you deal with difficult customers?"}, {"date": "23 Oct 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Touro College and University System in Oct 2018", "Interview Descriptions": "was very informal. asked why I wanted the job and why I would leave my current job. I explained that I enjoyed teaching and explaining and interacting with students and had done when i was very young", "Interview Questions": "Why did i want the job?"}, {"date": "8 Sept 2017", "title": "Internal Auditor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Touro College and University System (New York, NY) in Jul 2017", "Interview Descriptions": "The interview is very easy. All behavior questions. International students will be asked to provide their ssn#. You might need to know the difference between external audit and internal audit, and explain the reason why you apply for a  internal auditor position.", "Interview Questions": "Why apply for Touro?"}, {"date": "22 Mar 2021", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Touro College and University System (New York, NY) in May 2017", "Interview Descriptions": "Long process, interviewed with the department and after two received an offer. The interview was long, lasted for 45 minutes and they asked me very detailed questions about my experience.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "27 Oct 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Touro College and University System (New York, NY) in Jan 2017", "Interview Descriptions": "They were especially fair, and concise. Asked plenty of technical and behavioral questions. They were especially fair, and concise. Asked plenty of technical and behavioral questions. They were especially fair, and concise. Asked plenty of technical and behavioral questions. They were especially fair, and concise. Asked plenty of technical and behavioral questions.", "Interview Questions": "What are your goals in the next 5 years?"}, {"date": "9 Aug 2017", "title": "Internal Audit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Touro College and University System (New York, NY) in Nov 2016", "Interview Descriptions": "I applied through my school website and received a call a couple days after. I was asked to come into the office for an interview with the Chief Internal Auditor. The interview itself consists of two parts. Part one is the typical interview questions and it's more of a conversational interview. Part two requires you to take part in a written assessment. You are given two audit scenarios and asked for your recommendation. Once the interview is over, your assessment is reviewed and are given a response on the spot.", "Interview Questions": "What is the difference between internal audit and external audit ?"}, {"date": "24 Aug 2016", "title": "Field Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Touro College and University System (New York, NY) in Aug 2016", "Interview Descriptions": "Warm, friendly interview conducted by a highly professional employee with extensive knowledge in the field. The interview began with a brief discussion of the overall position and job responsibilities. After the initial discussion, two other employees with experience in the position provided an overview of their insights about working with students in the field.  This prompted a lengthly discussion about the challenges of the position and the benefits of utilizing specific strategies to overcome them.", "Interview Questions": "What was a recent challenge you overcame working with your assigned students?"}], [{"date": "5 Jul 2016", "title": "Assistant to the Registrar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Touro College and University System (New York, NY) in Jun 2016", "Interview Descriptions": "The interviewer was late and it was very informal. She didn't have my resume in front of her and asked me many questions that were stated on my resume.  The interview questions were geared to knowing what I currently do at he job.  This interview was not challenging, not what I expected.", "Interview Questions": "If you were provided a task but the task instructions were incorrect, would you correct your supervisor?"}, {"date": "21 Apr 2016", "title": "Internal Audit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Touro College and University System (New York, NY) in Apr 2016", "Interview Descriptions": "Applied in the fall, got an email for an interview in the Spring. Went to interview at the New York Office, met Ms. Charles, had my interview. She took a chance on me as I am as green to interviewing and the entire corporate process. A completely genuine person.", "Interview Questions": "To be honest come prepared to this interview like never before because there are people that would probably literally fight for this position. Asked things like where do I see myself in a couple of years, what interests you about audit, explain some things about audit and the likes. Also received an assessment that required me to fix an audit report."}, {"date": "30 Apr 2019", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Touro College and University System (New York, NY) in Jan 2016", "Interview Descriptions": "A written portion that includes questions about the profession and  then an interview with many faculty. Meeting with students from classes above to ask them questions about how they like the school.", "Interview Questions": "Difference between PA and NP?\r\nWhy do you want to be a PA?\r\nWhy touro college?\r\nHow to deal with difficult patients?\r\nCome prepared with some patient scenarios\r\n"}, {"date": "5 Oct 2015", "title": "Internal Audit Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Touro College and University System (New York, NY) in Jun 2015", "Interview Descriptions": "immediate response by email, 1 on 1 on-site interview next day, not that hard written test about auditing in a real life case, asking regular interview questions, such as why you want to work here, did you search me on likedin, do you have any more questions about me, got the offer immediately. they work pretty effectively", "Interview Questions": "did u search my profile on linkedin"}, {"date": "14 Dec 2018", "title": "Associate Bursar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Touro College and University System in Apr 2015", "Interview Descriptions": "Quick and efficient.  I was called the day after my resume was received.  Went for 2 interviews in a short time frame. Received offer the day after my second interview", "Interview Questions": "Why Should I hire you?"}, {"date": "3 Nov 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Touro College and University System", "Interview Descriptions": "interviewing experience was pleasant. Everyone was friendly and welcoming. Interview was with direct supervisor and a few other faculty members.Interviewer was direct with questions and easy to talk to to. Seemed genuinely interested in my past experiences.", "Interview Questions": "Questions were primarily about past experiences. Nothing too difficult."}, {"date": "5 Feb 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Touro College and University System", "Interview Descriptions": "The interview process was fair, quick, and pleasant. I initially applied for a different job that was already filled. The staff member was nice enough to forward it to a different department and I was hired to teach.", "Interview Questions": "All of the questions were professional and reasonable. "}, {"date": "19 Nov 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Touro College and University System (Bay Shore, NY)", "Interview Descriptions": "The first interview was a panel interview with the Chair, the Assistant Chair and a Faculty Member. Standard questions, \"tell us about yourself, tell us about what you do and why you want to work here.\" Second interview a week later with the Chair, Faculty member and Admin Asst. Standard stuff.", "Interview Questions": "N/A"}, {"date": "20 Nov 2013", "title": "Medical Student Admissions Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Touro College and University System", "Interview Descriptions": "Basic orientation of program, financial aide overview, example class session and tour of school. Interviews were held during time there, points at which applicants were interviewed varied throughout the day. Interviews were give in a 2 on 1 fashion. Very general questions about application and points of interest on application.", "Interview Questions": "Why do you want to be a DO?"}, {"date": "31 Jul 2014", "title": "IT Systems Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Touro College and University System (New York, NY) in Oct 2013", "Interview Descriptions": "Interview in person but before that telephone interview is must and it is sub-sequential interview over the phone with Technical person and HR department as well.The most delay part is verification part which takes a long.Once you are hired you cant get any single day off within six months of period which some times for some people really difficult and even if you are fallen in sick or accident no matter what you have to come otherwise you will be fire just very simple and they never tell you why they fire. It is happening a lot since more than 7 years many people get hire and fire.", "Interview Questions": "Would you take vacation within six months during your first six months of employment"}], [{"date": "20 Dec 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Touro College and University System (Central Islip, NY) in May 2012", "Interview Descriptions": "The interview process was straightforward. First I interviewed with the coordinator of the clinics. Next, I interviewed with several department chairs before being selected for 1 clinic. Overall, the questions focused on my academic curriculum (e.g., courses and grades in each course) more so than my work experience because of the nature of the position.", "Interview Questions": "Grades in courses relevant to the type of research I would do."}, {"date": "30 Jul 2015", "title": "Student Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Touro College and University System (New York, NY) in Aug 2011", "Interview Descriptions": "Interview process usually involves 2-3 staff members, includes the department's director and dean of the school. The entire interview process is about two hours. Common interview questions are asked and a background check is required.", "Interview Questions": "Why do you want to work in the Student Services department?"}, {"date": "19 Jul 2011", "title": "Tutoring Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Touro College and University System (New York, NY) in Feb 2011", "Interview Descriptions": "The process is quite easy. First you have to be a Touro College student and and if you hold over 3.5 GPA then you could be considered an a potential candidate. after going through this part the dean will decide based on your grades and cover letter whether you should deserve the job or not. The procedure is actually very easy but time consuming.", "Interview Questions": "Did you ever tutored?"}, {"date": "12 Mar 2011", "title": "Clinical Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Touro College and University System (Brooklyn, NY) in Oct 2010", "Interview Descriptions": "Lots of phone tag with different employees , even students answering the phone. Kept waiitng 45 minutes in crowded clinic waiting room . Directors cordial but seemed vague about  job requirements", "Interview Questions": "Availability in late evening and weekends "}, {"date": "6 Mar 2014", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Touro College and University System (Brightwaters, NY) in Sept 2010", "Interview Descriptions": "Two interviews. One with Dean and the other with the department chairmen", "Interview Questions": "N/A"}]]