[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent employee support", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 May 2021", "job_title": "Principal Lecturer and Subject Group Leader in London, England", "duration": "N/A", "pros": "Excellent employee support and proactivelly helps you when things wrong", "cons": "Seasonal contrcts only meaning less job security"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic environment", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Nov 2020", "job_title": "Director in London, England", "duration": "N/A", "pros": "Some dedicated and wonderful staff at other study centres", "cons": "In my time at the London office, I witnessed and/or experienced bullying, racism, and high staff turnover. Staff were encouraged not to share information between teams and not to speak with HR. Safety 'training' was focused on how to report incidents in a system (online course), rather than how to support students or staff on the ground (little to none on the ground planning or discussion), with some on-call staff not even living in London.\r\n\r\nStudy centre directors berated staff in meetings, lied, shared unprofessional opinions about colleagues behind their backs, and created a culture of bullying, fear and mistrust. \r\n\r\nIt was a poorly kept secret that the London study centre was being mismanaged by its study centre directors and yet no one in CIEE offered help or support to staff.\r\n\r\nFrom my time there, it is clear that CIEE prefers 'yes' people and cares more about image (£40 grand chandeliers and performative diversity and inclusion programmes) rather than substance, content, and student and staff support. \r\n\r\nThis was all before the pandemic.\r\n\r\nThe handling of staff redundancies in the London office due to Covid-19 was shameful: very little communication, no oversight from outside parties to ensure proper protocols, and zero kindness. \r\n\r\nI would recommend against joining CIEE in the London office with current leadership (in London and CIEE-wide) and be very careful about joining CIEE in other locations. It is simply not worth your health and sanity. I do believe some study centres were healthy work environments, so it would be worth checking with someone before joining."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Supportive to all employees", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Jun 2021", "job_title": "Adviser in Leeds, England", "duration": "N/A", "pros": "Willing to listen to your thoughts", "cons": "Not always a chance to work intelligently"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Appalling organisation with little awareness of how low their standards are - A race to the bottom for those who stay", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Feb 2017", "job_title": " in London, England", "duration": "N/A", "pros": "I worked in the London office in Russell Square and there are some fantastic people working here who excel at their jobs.  The London office building is stunning.", "cons": "CIEE study abroad is rotten to the core, especially the new GI models which are essentially about getting as many bums on seats as possible.  Inevitably this model severely hampers quality and this comes across at all levels in CIEE programs; poor staff retention, incompetent management, failing program quality and lack of basic training for current staff on things such as health and safety.  I personally know some full time members of staff who do not know basic information about CIEE programs such as what the programs are called and how long they last/when they begin.  What's worse is that CIEE claims to to be best provider when anyone who has worked with other providers knows this is simply NOT true.  \r\n\r\nThere is also a clear culture of sexism and tokenism of ethnic minorities in the organisation and this is supported by both men and women.  This filters down into how some average white men are readily promoted as long as they bully and control/micromanage other people.  And this apparently is how CIEE, in embracing diversity, are setting an example for other study abroad providers.  In short, they basically lie about their belief in being inclusive to students from non-traditional backgrounds. It's pure marketing speak.\r\n\r\nOn top of this, I have seen people be promoted at CIEE simply because they do not complain and as a result there is a huge amount of title inflation at CIEE even at the lower levels where people with less than 2 years experience get promoted to managers.  It's a way of buying off people in their 20s and 30s.  What's more is that CIEE as an organisation is struggling financially to stay out of the red and the GI model is a way to try and combat this.  Hence why programs have been rolled out much faster than anything that would usually be seen in study abroad.\r\n\r\nThere are also a lot of toady and unskilled people in CIEE and this comes across in how they promote themselves as the 'CIEE family'.  Anyone with experience can see that this is a way of creating an insider/outsider culture and incompetent and untrustworthy staff can hide in the 'CIEE family'."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Friendly team, community feel", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Aug 2020", "job_title": "Office Assistant in London, England", "duration": "N/A", "pros": "This company has very healthy working hours, rarely saw any of my colleagues leave later than 1830. Very hands-on work, you truly get to see the impact of your work in the students.", "cons": "Might not be your cup of tea if you prefer admin work over engaging with students, as you inevitably will."}], [], []]