[[{"date": "21 Jun 2022", "title": "Auxiliar De Limpieza Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CIMMYT (Texcoco) in Jun 2022", "Interview Descriptions": "Hay filtros pero es para mejorar la calidad del trabajo de cada empleado, al principio hay que postularse en el sitio de Internet oficial y hay que hacer evaluaciónes antes de la primera entrevista presencial. Después hay entrevista técnica.", "Interview Questions": "Preguntas sobre experiencia y conocimientos"}, {"date": "8 Feb 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CIMMYT", "Interview Descriptions": "The interview was undertaken after we passed the written exam/ STATA test.  The exam contains both the common interview types and competency-based Interview( CBI) e.g. Give an example of a time you handled conflict in the workplace", "Interview Questions": "Field experience challenge with example. "}, {"date": "20 Jun 2020", "title": "Biometrics Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CIMMYT", "Interview Descriptions": "The recruitment process was overseen by an external head hunter company based in the US.\r\n1) Phone meeting with external head hunter 40 min\r\n2) Phone meeting with external head hunter 20 min\r\n3) Emails from external head hunter \r\n4) Skype slideshow presentation to panel members on my plans for the job (job about  which I received very limited information). \r\n\r\nLof of pressure from the external recruitment company about how I am supposed to behave during the  skype interview with recruitment panel, and what questions I can ask and not ask. In particular, CIMMYT has very bad reviews as an employer on Glassdoor, they told me not to  confront the panelto this fact. \r\n\r\nThe external recruitment company seemed to have only one objective in mind during the whole process: to get someone at the lowest salary and secure their bonus. \r\nPanel members were dressed like for  going to the beach, slouching on their chair and eating noisily snacks. So unprofessional and disregarding. \r\nOf note, the line manager for this position did not show up at any point in this 2-month long process. Really weird...", "Interview Questions": "How would you propose to run a Biometrics unit given the constraints and gaps mentioned in the attached document"}, {"date": "13 Nov 2019", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CIMMYT (Texcoco)", "Interview Descriptions": "Hay un comite compuesto por miembros de otros departamentos asi que es importante conocer bien lo ue se realiza también en otras áreas. Se tiene que preparar una presentación en .ppt por adelantado", "Interview Questions": "Cuál es tu visión en 5 años\r\nQué parte de la investigación de gusta más\r\nTienes disponibilidad para viajar"}, {"date": "18 May 2021", "title": "HR Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at CIMMYT (Texcoco) in Jun 2019", "Interview Descriptions": "El proceso de la entrevista fue muy bueno, todos se comportaron de forma muy profesional y me avisaron siempre del paso siguiente dentro del proceso de reclutamiento. Fue intimidante que las ultimas entrevistas fueron hechas en grupo con el Comite Executivo.", "Interview Questions": "Preguntas especificas de mis actividades en mi trabajo anterior.\r\nPor que te escogeriamos a ti en lugar de otra persona"}, {"date": "14 Jan 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CIMMYT in Mar 2019", "Interview Descriptions": "The call med for an online written test after 3 months of applying for the position. The written test last for three hours. The provide some information and I have to develop a project charter.", "Interview Questions": "Preparing project charter for the information provided"}, {"date": "31 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CIMMYT (Nairobi) in Jan 2016", "Interview Descriptions": "Interview panel (3-4 people) with questions on your communication skills, research skills, experience, conflict management,  driving experience, then and written test which has calculations on seed rate, fertilizer rate, yield calculation, driving test, agronomy, pest and disease identification", "Interview Questions": "How do you lay out a demonstration plot"}, {"date": "12 Aug 2019", "title": "Coordinador Administrativo Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CIMMYT (Texcoco) in Apr 2015", "Interview Descriptions": "Muy buena, preguntas coherentes, respuestas claras a mis inquietudes y siempre abiertos a  atender mis dudas en cualquire momento. Me citaron con antelación, siempre me atendieron en tiempo y forma y no me hicieron esperar", "Interview Questions": "Expectativas sobre el trabajo"}, {"date": "3 Aug 2012", "title": "Science Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at CIMMYT (Nairobi) in Apr 2009", "Interview Descriptions": "There was an initial flurry of activity and consecutive interviews followed by an almost month-long silence before an offer was made", "Interview Questions": "How would you handle conflict in the workplace?"}], [], [], []]