[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Meaningful Work for Animal Lovers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "26 Dec 2022", "job_title": "Manager", "duration": "N/A", "pros": "Animal welfare is incredibly rewarding due to the meaningful work being done resulting in saving lives. The staff and volunteers are all very understanding of the hard work that needs to be done and everyone is willing to pitch in and help. Pay is better than most animal welfare organizations in the area and benefits are competitive (full medical package and paid time off). Some of the perks we receive are discounts on retail, vet care, training classes, medications, food for our pets, and additionally we get 8 paid holidays (Juneteenth and MLK were recently added). The CEO is incredibly involved and genuinely cares about all the staff, volunteers, and animals. Teams are flexible with schedules when coverage is met. Teamwork is the main component of the success of the shelter and because of that, we have built meaningful relationships with each other across departments.", "cons": "Animal welfare in any organization can be incredibly difficult and is not for everyone. There are sensitive cases that are tough for the staff and volunteers to experience and can leave people feeling emotionally drained at times. You have to work some holidays because there are animals in our care that unfortunately can't take the holiday off. There is a lot of work to be done in an animal shelter, so there is a constant feeling that you can't get everything done and at times you have to prioritize what you are able and unable to do."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Plains will revive you!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Mar 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fantastic shelter to work. Staff is very involved and communicative. Leadership makes it a point to get to know their teams and involve them as much as possible. Transparency is important and leadership works hard to be available for their teams and open to any and all discussions. Staff is made to feel valued and respected and leadership really want to know opinions. They are constantly working to improve the lives of the shelter animals as well as the staff. Staff meetings are actually fun! It's rare to find leadership that is so involved (in a helpful way, not micro-managing) and who make even tough days manageable. This is the best shelter to work in the Kansas City area.", "cons": "Staff is encouraged to use their PTO but it accrues very slowly."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "The good and the bad", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Apr 2023", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "The work that is done here really is top in the area. Animals are treated well", "cons": "A lot of compassion for the animals and for the people who own them, but not a lot of respect for employees. If you are a skillful employee they will exploit that, then punish the employee for trying to put reasonable boundaries in place. There is a \"culture of kindness\" that the directors spout as GPSPCA's goal, yet while they pat themselves on the back for being kind and compassionate, there are so many employees to whom they have been neither."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Thankful for Great Plains SPCA", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Dec 2022", "job_title": "Associate in Merriam, KS", "duration": "N/A", "pros": "I’ve been thinking about the things I am thankful for in my life. Working at Great Plains SPCA is at the top of my list. Beyond working with animals, it’s an amazing experience to have leaders who have skills and talents that are super but beyond that, we know they have real concern for all of us employees, making sure we have everything we need to do our jobs and everything they can possibly offer to even make our personal lives better. Seems like they’re always asking what more can they do for us. Like, one employee was injured, and some senior managers bought her dinner gift cards while she was healing. And they give us get gift cards, thank you cards, flowers, rides to work, meals and treats! Who does that? Our pay and benefits are good, we get great training and tons of communication so we all know what’s what every day. You see why I love Great Plains SPCA and everyone there?", "cons": "Seeing and knowing that some pet owners don't take good care of their animals."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to really make a difference, and love what you do!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Mar 2023", "job_title": "Volunteer Manager in Merriam, KS", "duration": "N/A", "pros": "GPSPCA is a fantastic facility. The animals are extremely well cared for. The Volunteer department is top notch - and their volunteers are THE best! Management is supportive and very empathetic. Everyone is welcome. It is a small company so advancement opportunities are limited, however management really tries hard to create positions and offer more responsibility. If you are looking for a career where what you do really matters, look no further!", "cons": "Healthcare costs are fairly high. Any job here is good, hard work!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fantastic place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Oct 2022", "job_title": "Office Manager in Merriam, KS", "duration": "N/A", "pros": "The culture is amazing: very kind, caring, and inclusive, and the people are wonderful. The animals are front and center with everyone's role as well. People work very hard and genuinely care about what they do, and the impact they have on animals. Leadership is fantastic about giving people opportunities in different departments/areas after you have been there for a while, as well as career growth into promotions and management opportunities. They show appreciation in numerous ways to the employees with random treats (free ice cream on hot days, incentives for fund raising, etc..). Just like the expression, \"When you love what you do, you'll never work a day in your life\". GPSCA is one of those places. I was very sad to leave and will always treasure the time I worked there.", "cons": "As a non-profit organization (and especially one where animals need care 24/7), it's hard for them to compete with other corporations that can afford to give benefits like more flexible schedules which was hard for my family situation. If only they could afford to give more PTO or sick time without taking that money away from the animals in desperate need of so many services....but that is the nature of non-profits so you just have to know that you are signing up for that."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Kindness, Grace, Accountability, Gaslighting and Hypocrisy.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Dec 2022", "job_title": "Manager in Merriam, KS", "duration": "N/A", "pros": "-Clean shelter -Strong medical team -Strong lower and mid employee relationships -80% of people are actually there for the animals", "cons": "-Senior leadership picks and chooses favorites -Toxic call out culture that makes other employees feel under valued -Pressure to not use PTO or take sick/mental health days -Senior leadership host inappropriate relationships with each other, CEO and directors go on vacations together leaving times where employees in the org to not have a manager to report too. -Senior leadership takes PTO at a moments notice but require all other employees to provide time off requests 3 months in advance. -Ideas, opinions and suggestions are not cultivated."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing shelter, awful management, toxic culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Jul 2022", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "-Clean shelter with adequate space\n-Great medical team\n-Great outreach program\n-Staff care, even the ones with misplaced priorities\n-Lower-level staff are hardworking and caring, amazing workers when given a chance\n-Growing volunteer and foster network", "cons": "-Culture focuses on “kindness, grace, and accountability” —the kindness and grace are given to some while others shoulder all the accountability. If you’re not in tight with the CEO then consider yourself an outcast. And even then—her favoritism fades fast and leaves you on the outs. \n-Leadership is incompetent and micromanages employees. \n-Constant gossip, lack of transparency, and the feeling that any day now another random “this employee has been fired and is no longer allowed on the premises” email is going to be sent out about your friend or beloved coworker. So so so much turnover, but leadership will give you no information and insist this level of turnover is normal.\n-Top-heavy organization. In a company of about 50 people, over half are managers!\n-Senior leadership will disregard your experience and expertise. If you disagree with them prepare to receive passive aggressive “directives” and further lack of transparency in the future.\n-Senior leadership will manipulate you to the fullest extent and gaslight you.\n-No work/life balance"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Many opportunities for improvement", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Dec 2022", "job_title": "Coordinator in Merriam, KS", "duration": "N/A", "pros": "Front line staff and middle management are awesome - everyone helps out however they can and it really does feel like a team effort. Most of the managers are really talented, compassionate, team oriented people. Can't say the same for the folks at the director level. The foster and volunteer base is incredible. If you enjoy being cross trained in several departments this is a great place to work - just don't expect to be compensated accordingly.", "cons": "Health insurance is very expensive. With no preexisting conditions or dependents, I was paying almost $300/month and struggling to afford access to the care I needed. Raises are annual and set to 5% MAX. With inflation, you can pretty much expect to make the same or less every year. Senior leadership leaves a lot to be desired - not much emotional intelligence at the top. This particular group of \"leaders\" kind of feels like working for a catty group of high school girls. Unprofessional at times, not consistent (different treatment for different people), inability to take accountability for their mistakes... as you can see from the comments on all the negative reviews. :) \"Open door\" policy is more of a \"we will open the door so you can leave\" type than a \"open the door to address the issue\" type. Makes it really hard to address problems. Serious lack of transparency and inclusive decision making. If you like to have a say in decisions that directly impact your day to day, this is not the place for you. There is a LOT of turn over, lately they have stopped backfilling roles when people quit which leaves everyone else with more work without the additional compensation. When pressed, they'll tell you that front line staff have gotten lazy and are just not used to working hard which is why they feel overwhelmed. I can tell you for a fact that is not accurate, front line staff work harder than anyone there and make the least. This is a good example of the mindset the directors operate from. They put people in charge of departments who have no idea what they're doing and it definitely shows. This place is a great example of \"who you know not what you know\". Plus side, as long as you can kiss a** you don't need any real knowlegde or skill to succeed here. A lot of unnecessary micromanagement which decreases the overall efficiency of the organization and leaves lower level staff feeling disempowered. Working in animal welfare is very emotionally taxing work. Upper management does not acknowledge this and shames people for taking mental health days, tells people its unprofessional to cry at work (sorry that some people have emotions about things dying?). I've never had a job of this nature that shames people for experiencing emotions and taking care of themselves. No work life balance, if you try to set boundaries you will be met with irritation and passive aggressiveness. Once again - little regard for employee mental health or lower level people in general."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Same story, different employee", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Every single person that works or volunteers here has a passion for animal welfare and animals are well loved while in GP’s care. There is a strong network of volunteers and fosters who show up for staff on a daily basis. Outreach Team does a lot of amazing work within the communities we work with.  Getting to see animals have a chance at a new life is very rewarding. You also get to hang out with these animals the whole day which can be an awesome way to destress. Discounts for veterinary services, pet accessories. Option to work 4 10-hr shifts and be off 3 days", "cons": "From day one you will hear all about the company’s culture of “kindness, grace and accountability”, but in reality GP is all about superficial appearances and money. There's definitely a clique mentality with \"higher level\" staff at GP, with eyes and ears everywhere ready to carry out all of the dirty work. There’s so much paranoia and fake interactions going on that it becomes hard to keep track of who you’ve managed to offend by simply questioning a decision or expressing a concern. You’ll know once you get a passive aggressive email or an indirect callout during a team meeting. It doesn’t matter how nice you are or how hard you work, the second you do something that rubs leadership the wrong way, you’re automatically labeled as a negative person and watched very closely moving forward so they can have an excuse to get rid of you. It literally feels like you’re walking on eggshells and you will be gaslighted for as long as you’re willing to take it. This whole place feels like a HR lawsuit waiting to happen. Employees that hardly contribute to the workload but suck up to management and turn a blind eye to all of the sketchy stuff going on behind the scenes can stay in leadership's good graces. Passionate employees are worked to their limits without the proper compensation or recognition. And when you do request a raise you’re guilt-tripped about the company’s lack of funds. They push you past your breaking point so you have no choice but to quit and they don’t have to take on the responsibility of firing you. They prefer to take the easy route and blame the high turnover rate on people not being able to handle the stress of working at a shelter, but we all know that’s just their copout. They’re willing to toss aside people who have given years of their life to this organization, so don’t consider yourself safe from also being ostracized. Employees are leaving on such a regular basis that it's hard to keep up. Management also takes their time hiring replacements, leaving teams constantly understaffed and just barely getting by. If it weren’t for volunteers the shelter would not be able to operate as is."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Work with a Purpose!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Oct 2022", "job_title": "Finance and Administration Manager in Merriam, KS", "duration": "N/A", "pros": "-Mission driven team that strives to provide the best love, support, and care for animals. -Contribute to animals being adopted and finding their forever homes. -Staff and Volunteers are very supportive, kind, and knowledgeable. -Get to be around animals all day and attend trainings to learn more about them and their behaviors. -Casual dress and flexible schedule. -Competitive compensation and benefits. -Discounts on pet food and veterinary services. -Perfect place for animal lovers.", "cons": "-Can't take all the animals home. -Watch animals you love get adopted."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working for Great Plains SPCA", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "16 Apr 2022", "job_title": "Shelter Director in Merriam, KS", "duration": "N/A", "pros": "Great Plains SPCA has a very positive work culture, where employees are always given feedback and room to grow, as well as opportunities to advance their career within the organization. The work that is done here is top notch and the animals receive the highest standard of care. Great Plains also offers a good benefits package and competitive pay, especially for a non-profit. Other perks include discounts on vet services and retail items, which is great for pet owners. Leadership at GPSPCA does expect their teams to be high performing and will hold you accountable to that as well.", "cons": "While not a true 'con' at all, you do need to be passionate about the work to thrive here. The work here can be taxing, both physically and emotionally. You will sometimes see neglect, cruelty, etc. that can take an emotional toll and requires resiliency. If you are not an animal lover/advocate, you will not do well here. Depending on the role you are in, you may also be required to flex your hours quite a bit and may work on days off (senior leadership roles only)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Dedicated and Passionate Team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jul 2022", "job_title": "Manager", "duration": "N/A", "pros": "The entire team (both employed/staff and volunteers) is passionate and dedicated to the mission. The work itself is challenging (physically and mentally!) but also incredibly rewarding. The HERO (Outreach) program is unique and one of many ways this organization stands out by giving back to the community.", "cons": "There is no \"finish line\", so the sense of never being able to \"do enough\" is very real (compassion fatigue/burnout is prevalent threat in this industry.)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Transparent, Supportive and Engaged Leadership", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2022", "job_title": "Senior HERO Program Manager", "duration": "N/A", "pros": "Great Plains SPCA is amazing place to work. Employees are given the opportunity to grow within the company and animal welfare field. Great Plains SPCA's leadership team is interactive and supportive, and the culture is \"one team\" focused. Its not unusual for the CEO or other executive staff to step in and support any department when needed. Management is accessible and understanding. Love my job!", "cons": "Emotionally draining at times due to the nature of the field. The work and emotional/mental investment can be 24/7."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful place for pet advocates", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Jul 2021", "job_title": "Behavior Specialist", "duration": "N/A", "pros": "I have worked at multiple animal shelters and this is by far the best animal shelter that I have ever worked for. This organization will go above and beyond when it comes to medical care, behavior modification, and housing/enrichment for their pets. They have a live release rate of 98%, which is currently the highest in the KC area and will go many lengths from pulling animals from other shelters needing help to taking in other legacy pets from surrounding shelters when they refuse.", "cons": "There are some staff that are incredibly ungrateful and disrespectful and complain about the free food and perks they receive. I have never worked at place where we receive so many perks, recognition, and gratitude and in return some (not all) of the employees will complain about what they get as a reward. In example: There are some staff that are upset that we receive cheese pizza instead of pizza with meat on it. This is an animal shelter and we advocate for animals, why on earth would they give pizza out with dead animals on it? We don't want to kill animals for no reason."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best animal shelter to work for in Kansas City!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Supportive and caring staff and management. \r\n-The animals well being is the top priority above all else. \r\n-Lots of fun employee engagement and appreciation is shown to staff and volunteers. \r\n-Genuinely good culture!!", "cons": "-You will tempted to adopt an adorable new pet around every corner!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Plains SPCA is a great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Mar 2022", "job_title": "Marketing and Events Coordinator in Merriam, KS", "duration": "N/A", "pros": "- Amazing work environment\r\n- Friendly coworkers and managers\r\n- Get to be around animals \r\n- Good benefits\r\n- Overall great place to work", "cons": "- Sometimes stressful and fast moving \r\n- Can be emotionally draining at times"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing shelter with great people!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Apr 2022", "job_title": "Animal Shelter Manager in Merriam, KS", "duration": "N/A", "pros": "- Great employee benefits\r\n- Able to destress by spending time with cats and dogs \r\n- Amazing staff with great teamwork from all departments!", "cons": "- We see a lot of sad situations\r\n- Compassion fatigue is very real"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Culture of kindness", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Culture focuses on kindness, grace and accountability, with the animals at the forefront of everything we do. Opportunities for growth, professional development and cross training are all a big plus. Focus on employee's mental health at the forefront.", "cons": "As with any animal welfare job, it can be emotionally draining at times."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great mission and caring coworkers, poor leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Jul 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The work to help animals in need is incredibly rewarding.", "cons": "Leadership is incompetent and micromanages employees. The culture is paranoid and gossiping, because senior leadership is obsessed with the idea that staff is rebelling against them. They put animals to sleep that can be saved and drive volunteers away. The major donor requires all food the organization provides to be vegetarian, hope you like cheese pizza as rewards. If you're critical of anything, they call you a bad fit for the organization and fire you."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "My Favorite Job", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jul 2021", "job_title": "Manager in Kansas City, KS", "duration": "N/A", "pros": "Caring and kind leaders\r\nBest coworkers!\r\nThe sweetest animals", "cons": "The hours and stress of seeing animals get left by their families"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wonderful Place to Work!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Dec 2020", "job_title": "Adoption Counselor in Merriam, KS", "duration": "N/A", "pros": "They say the key to a successful organization is not the challenges we face, but how we come together to meet those challenges, to adapt, improve, and overcome.\r\n\r\nCovid 19 has certainly been a challenge, not only for Great Plains SPCA, but for so many organizations, small businesses, communities and families alike.\r\n\r\nThe leaders of our organization recognized in mid-March that we needed to be proactive in response to the progression of the epidemic, and began implementing strategies to maintain the care of our animals as well as the safety and well-being of our staff and our guests. \r\n\r\n***Because of these measures that are continually evolving as things change, not ONE single employee has lost their job, been furloughed, or lost their health insurance. \r\n\r\n***Because of these measures, the excellent care the animals receive daily never wavered. \r\n\r\n***Because of these measures, employees who may otherwise have been afraid to come to work during the epidemic have felt safe and protected.\r\n\r\nI’m proud to say I work for an organization who’s 2 main priorities have always been the staff and the animals in our care. \r\n\r\nThe difference between Great Plains and other organizations that I’ve worked for is that this management team not only continually strives to maintain excellent care of our animals, but ALSO and JUST AS IMPORTANTLY cares for the people that come to work every day, day-in-and day-out, and sometimes on our days off. \r\n\r\nGreat Plains SPCA is an organization that is built upon the following principle:\r\n\r\n“GPSPCA is committed to creating a culture of kindness and grace with accountability, empowerment and without fear of judgement or isolation.” \r\n\r\nOur culture of empowerment, accountability, kindness and grace, without fear... These qualities are the guiding principles for everything we do - whether it’s helping an animal, helping a person, or taking care of our hardworking staff. \r\n\r\nGreat Plains SPCA in Merriam is not only an amazing animal shelter and an incredible organization to work for - it has become my home away from home, and has introduced me to to friends I know I’ll keep wherever life takes me.", "cons": "There aren’t any cons to list."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Intensive, yet rewarding work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Oct 2016", "job_title": "Adoptions Counselor in Merriam, KS", "duration": "N/A", "pros": "Great Plains SPCA is such a fun place to be.  I love that I work with animals every day and work with people who share my passion for animal welfare.  Everyone here is very dedicated - from the animal care team, veterinary technician team, marketing/development teams, and the VP/COO and CEO. Everyone is super hands on!  On our busy adoption events, the VP/COO, CEO, and other leadership are right alongside our staff - our VP even makes us pancakes!  My manager has always been helpful and flexible with my schedule when I need time off.  My other coworkers didn't hesitate to answer questions as I was learning the ropes.  I was pleasantly surprised with our shelter broke out with parvo and Courtney Thomas (CEO) was helping us clean and quarantine the dogs to prevent the spread of the virus.  I've never worked a job before where the leadership team has been so involved and hands on at the front lines.", "cons": "Everyone is as helpful as possible, but I felt like I could have been better trained at the very beginning.  Luckily my manager and the veteran staff and volunteers were helpful, but there are several learning curves with learning the business that can be a little intimidating!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Could be great if there was different leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Working there for so long, so many great memories and friendships were made. Working closely with the shelter animals and improving their quality of life as well as joining them with their forever families is extremely gratifying. Adoption/kennel/veterinary staff is dedicated and hard working.", "cons": "CEO Courtney Thomas is power hungry and tearing the organization down. She is 100% about money and numbers. They keep pets that are not safe to adopt out on the floor while they sit there for months and deteriorate mentally. All to keep their euthanasia rate low. Don't get me wrong, I loved these animals and it's extremely important and I love that they give pets a chance. But after working there for so long, you start to realize that in some cases, humane euthanasia is better than living in a cage for a year or more with aggressive tendencies and stress levels through the roof. Seeing this and working yourself to death is physically and mentally exhausted. Even when I wasn't there, my brain was because I was constantly stressed about the absurd happenings from the day and feeling upset that we could do more to focus on the animals instead of pouring resources into fancy new offices."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "For the most part I enjoyed working at Great Plains SPCA.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The staff are committed to the mission of saving the lives of animals and uniting them with families. Most of them work well as a team and help one another. The training could be a little more clear. It is rewarding when you get to send a pet that is in need of a family to its furever home. They are choosy when it comes to matching the right pet with the right family. Both are considered during the counseling process.", "cons": "No benefits and not much opportunity for advancement in this small organization. Income is lower and staff is stretched to the max. Everyone is trying to do the job of multiple people. You have to really be passionate about the mission and have another income in order to be able to survive financially in order to not burn out from being over worked and under paid."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Disregard negative posts from disgruntled EX employees that couldn't do their jobs..", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The staff and mission is wonderful. They strive daily to make Great Plains SPCA the absolute best it can be. I had the pleasure to see this first hand and am proud to have been part of such a great company. The CEO and COO and the ELT should be applauded for their work not bashed.  They like so many other employees and volunteers make it beneficial for the adoption of all pets.", "cons": "People who are posting bad reviews and negative comments are just folks who are hurt because they were inadequate in their job. It's sad that there are sites like this that allow people to post negatively with no retribution or validation of facts."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "It's not worth it", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jun 2018", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "Working in a shelter is an amazing opportunity to help animals and learn how to interact with different behaviors and rehabilitate them for adoption. Its a beautiful journey to be on with each individual animal.", "cons": "The favoritism and disrespect from management is beyond unacceptable. They do not care about individual employees and leave the most passionate people burnt out because of their lack of leadership. Instead of listening to the team or keeping it staffed, they stretch everyone out between both campuses and expect hard work and to do more than just your job, yet pay nothing and ignore your existence. There is already enough emotional turmoil and physical labor extended in this job, and the fact that management sees staff as disposable and doesn't invest in staff that run the organization is frustrating and disrespectful."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not work here", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Dec 2018", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "Cute puppies and kittens when you are crying in the corner", "cons": "The WORST MANAGEMENT I've ever experienced in 20 years. No vision, no strategy, treat people horribly, cliques, back-stabbing, CEO is a hair dresser who was hired by his client on the board. He has no experience in nonprofit, animal welfare, executive management, running a complex business, leadership - no applicable skills AT ALL. 100% turnover of the executive leadership team because of narcissistic, unethical board members. Completely dysfunctional organization - I'm surprised they are still standing. They truly should be audited and find out how many conflicts of interest and liability laws they are breaking. No one has any job security.  It is such a disservice to the animals who truly need them.  Awful, awful, awful place to work. I'm embarrassed to put it on my resume because the entire community knows what a joke it is and how unethical the board and so-called management is."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great Animal Welfare Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "For those interested in working at Great Plains SPCA, this is fabulous organization with some truly amazing people. In the last 6 months, we have went through some much needed change which has resulted in a new and exciting culture for our entire organization. I have had the pleasure of working with some of the most compassionate and hard-working staff that I have ever worked with in my entire life. The executive leadership team came in and was introduced with many challenges, but they have persevered and created a culture in which the team feel supported and recognized for their efforts", "cons": "This isn't so much a con, but as a challenge that everyone in animal welfare encounters is life-work balance. If you're aren't aware of it and don't manager it, then it can be all consuming."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "I really like where I work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Sept 2016", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "We have a very dedicated staff and I have always felt a part of the teams I've worked on.  I have never experienced the management team to be as some people on here are describing.  My boss is on the executive team and has been flexible with me, cares about me and works very hard to help all of us.  I also don't feel that it's fair to bash Courtney Thomas on social media when most of these people probably wouldn't do it to her face.", "cons": "I wish I made more but my pay is similar to what I would make at other places.  We have a lot of animals right now so I am working a lot of extra hours."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Plains SPCA", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great Plains SPCA is an amazing organization!  I work alongside some of the most passionate and hard-working individuals that unite to save and improve the lives of pets in our community.  There have been several organizational changes in recent months that have been implemented to streamline and strengthen the organization.  The current Presidents, CDMO and COO have an incredible vision for Great Plains SPCA!  They are creating a culture that consists of hard work, dedication, teamwork and positivity to focus on improving the lives of pets and the people who love them.  I am honored to be a part of Great Plains SPCA and cannot wait to see what the future holds for this organization and community!", "cons": "\"Progress is impossible without change and those who cannot change their mind cannot change anything.\"  -George Bernard Shaw\r\n\r\n\"Change is hard at first, messy in the middle and gorgeous at the end.\" - Robin Sharma"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Plains SPCA is a wonderful place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "If you are looking for a place to work where you will make a difference- this is the place.  The COO is one of the very best in the business and cares about the animals and the staff.  The ELT is professional and caring.  The negative reviews by a small minority is really heartbreaking.", "cons": "The negative reviews on this site are obviously written by a very few people who were unhappy- and probably still are.  I would suggest, if you are interested in working at Great Plains SPCA, you go and meet the wonderful staff and find out for yourself what an amazing organization it is... don't believe someone who would bash an organization anonymously on a site like this."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "So much potential...", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Apr 2016", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "Great mission at least in theory. Great facility. Folks not in upper management give everything they got and more.", "cons": "Burn out. Lack of support. Turn over rate. Preferential treatment. Culture is that of a female teen tv show drama and most of the day at least on the admin side is dealing with drama created by upper management that have not yet learned the fine art of adulting. It stopped being about the mission years ago. Donors would find the salaries for the inexperienced upper management completely offensive."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great People - Great Mission", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jun 2016", "job_title": " in Merriam, KS", "duration": "N/A", "pros": "Everyone is so nice and truly cares about the pets in our care. CEO Courtney Thomas makes a point to know your name and is more than willing to place people in positions that fit their skill set. I've also seen firsthand Courtney pitch in to help when we are short staffed - whether it's in the Vet Center or Animal Care or even taking out the trash. She doesn't ask anyone to do anything she isn't willing to do herself.\r\n\r\nGood insurance with step down premiums for time worked.", "cons": "It's a nonprofit - so you work a lot of hours, but as I stated above, the CEO works longer and harder than anyone, so most of us work hard to rise to her work ethic."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Sad place it has become.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I loved my actual job. I helped save animals.", "cons": "No leadership. Years ago I would have given this shelter a 5 but over the last few years with the leadership turnover they brought in an incompetent and disrespectful executive leader. Tam Singer has no regard for employees, makes it clear to staff that they are expendable and created an extremely toxic work environment where most everyone is unhappy and clearly not valued. The staff I’ve worked alongside have been amazing, good people who care about the life saving mission of GP but those values are NOT demonstrated by the president in any way. Good, caring, hard working  people have left in large numbers. It is truely sad what that organization has become under Tam’s tenure and I have no doubt it will continue going downhill. I’m honestly surprised their doors are still open."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This animal shelter is superior than any other in the area. Every, single person working there believes in the company, each other and the animals. They work hard every day to love on those animals until they go home to their forever family. The leadership in the company is driven and motivating. From the leadership on down, the staff focuses on caring for each and every animal and works diligently in being successful in the animals' futures.  I have worked in other types of companies, and it is rare to find one with management involved and willing to help out.", "cons": "I personally have not experienced any. I realize some employees do, but for the most part the camaraderie is great."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Good company under bad leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jun 2018", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "Working with the animals and feeling like you’re making a difference is great but since Tam has arrived that feeling is greatly outweighed by the level of disrespect she shows employees and her inability to lead a group of people who are incredibly hard working and big hearted.", "cons": "Things you can expect if you work here:\r\n-Degrading comments from leadership and management \r\n-Complete lack of respect for employees\r\n-Management will disregard your experience and expertise\r\n-Avoidance from management when you disagree with them \r\n-Constant feeling of company failing or your job being expendable \r\n-No work life balance\r\n-A lack of compassion for people which goes against the mission “a better life for pets and the PEOPLE who love them” \r\n-Laughter at your expense when you present your opinions or problems."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I couldn't imagine being anywhere else!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 May 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I've learned more than I could have ever imagined during my employment at Great Plains SPCA.  This organization is employed by compassionate, hard working people from the top down who care deeply about the pets and people that are served.  Courtney Thomas is a hands on CEO who not only medicates sick animals, triages emergency medical cases, walks dogs and picks up poop, but also responds to constant pleas for help to help needy animals across the Metro.  Great Plains SPCA is the agency that takes in critical cases when other agencies turn them away.  Courtney is always inspiring and encouraging her staff and giving them opportunities to grow professionally.  There are a couple of reviews that completely perplex me:  First being that it was unnecessary for Great Plains SPCA to manage the City of Independence.  Without Great Plains, healthy, happy and adoptable animals would still be euthanized for space.  This city was in dire need of Great Plains SPCA's resources - to say otherwise is completely ignorant.  To criticize Courtney and the leadership for being \"all about the numbers\" is completely naive - it's pertinent to be familiar with  numbers to measure the success of your mission and staff.  That's business 101.  I landed at Great Plains SPCA by chance, but am so glad this is the animal welfare agency where I ended up.", "cons": "This is an emotion field and there is no shortage of sad situations.  There are hundreds of different personalities at play between the volunteers and staff, and even though everyone is there for the same reason, it can be difficult to find common ground in the midst of conflict and different opinions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Caring organization that is true to its mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Nov 2019", "job_title": "Office Manager", "duration": "N/A", "pros": "It is a privilege to work at GPSPCA. The team is extremely friendly, smart, professional, positive and all pulling in the same direction to fulfill the mission of this incredible organization. The hours are reasonable. The work is not overly demanding. I feel a sense of accomplishment every day and I get to have a dog or cat as an office mate every day!", "cons": "Compassion fatigue in animal welfare is real and is a hazard of working at any animal shelter, but the good we do to save animals far outweighs the sad stories."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The most traumatizing toxic work environment ever!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The potential for this organization to really help animals in need is astronomical.", "cons": "The CEO has ruined this organization. The toxic work environment that is caused from the games this CEO plays with passionate staff is sickening. There has been so many talented and compassionate staff that have come through the doors but the CEO uses them as pawns in a game and the animals suffer.  Management makes a very hefty salary while staff on the ground make very little. If a member of the management team is not performing at their current position a new unneeded position is created. Hence the extreme salaries paid."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Making a difference", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Jun 2016", "job_title": "Adoption Counselor in Merriam, KS", "duration": "N/A", "pros": "It is so fulfilling to work somewhere that you feel like you are making an impact every day. It feels like a family that", "cons": "It's animal welfare, lots of sad stories. It is hard to not get angry.  Seeing the animals find a good helps a lot."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A beautiful company with great leaders", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Nov 2019", "job_title": "Adoption Counselor in Merriam, KS", "duration": "N/A", "pros": "I worked at Great Plains for about a year and a half. GREAT workplace culture. They pay is competitive based on other animal shelters in the area. They take magnificent care of the animals here and the shelter is always clean. All of the staff are friendly and helpful, especially with new hires. Even the managers and the CEO will all take the time to get to know you. All in all a great place to work. I would have continued to work there if not relocating.", "cons": "The only company-related downside is having to work all weekends."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Changes needed", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Staff in direct care of animals believe in the company's mission and are committed to animal welfare both in the adoption center and in the veterinary wellness clinic.", "cons": "Leadership is committed to promoting themselves and their agendas, with the animals coming second.  The quality and commitment you perform your job with is outweighed by the \"middle school popular girls\" who are in leadership - if you're not in with the popular group - you're out!  While leadership staff has changed multiple times, the CEO remains in charge - and blames all problems on those reporting to her. It is a mystery why the board continues to back the CEO"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Want a great employer? Work here!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I’ve never seen such passion for the constant well-being and comfort of animals.  The employees know their duties and they fulfill them with caring attention.  Every employee, including all managers, knows every single animal in the shelter which indicates a level of interest other companies would cherish. There are daily huddles to bring awareness to employees about what is important for the day.  Teamwork is not just a word at Great Plains SPCA….it’s the willingness to perform your duties with everyone in a way that benefits the animals.  Their care is what we all connect about, regardless of what our job is.  Sounds great?  It’s because our team leaders, starting with our CEO, Tam Singer, are completely on the same page and they work as one.  Tam has immersed herself in every level of our shelter operations and has radically changed the culture I knew before she arrived.  She knows every single one of us and cares about our ideas and input.  Compensation and benefits have improved and daily engagement by each of us is satisfying.  Do we work hard? Sure?  Do we have great motivation?  You bet. I love this place.", "cons": "I think we need public events so that lots of people can see the beautiful animal shelter, meet our animal caretakers, see how well-run it is thanks to Ann Runnion. I also think we need more public attention to the value of our amazing public animal behavior classes led by Ashley Flores and her team.  We need donors who value and believe in what we do.  Oh, and this is September match!  Make a donation and it will be matched dollar for dollar!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "An animal shelter and community partner", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I had a great experience, in my time at GPSPCA. I have seen a lot of changes. I know that the changes that are happening now are for the better. I will always be grateful for my time at this organization. Even though I couldn't continue my employment. I will always be a supporter of the great work being done at GP.", "cons": "I'm not sure that I would say something was a con. I feel as though, anytime things start to change, people consider them a con."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Place for Animal Advocates", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I would highly recommend working at Great Plains SPCA if you have a deep passion for animal advocacy. I truly believe that you will not find another place with such understanding leaders, staff, and volunteers. Our new co-president has been one of the most compassionate, sincere, driven, hard-working, and caring people that I have ever had the pleasure of working with. I feel that the culture at Great Plains SPCA is exponentially better and the staff enjoy having leaders that challenge and appreciate them for their hard work. There have been many changes, which comes with many challenges, in the organization in the last 6 months, but the staff, volunteers, and public seem to like the new processes and systems that have been put in place.  Major perk: you will get to work with tons of adorable animals that will make your heart melt.", "cons": "You will be expected to perform and show results (not so much as a con as just an expectation you should be aware of if you're considering working at Great Plains SPCA ) and life/work balance can be tricky especially when you get to know the animals and you want to do all you can for them.  The leadership team is incredibly supportive when it comes to taking time off for yourself or for your family. I feel that Great Plains SPCA goes above and beyond for these animals, but sometimes animals need to be euthanized and even though the decision makes sense rationally, it will still hurt your heart."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": "N/A", "review_title": "Great Place to work- they are just going through a long transition so there's lots going on!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "If you take pride in your work and it shows you'll be rewarded. I feel like that's common sense and the people who disagree are usually those that struggle to see themselves as they truly are. Show up on time, work hard, love the animals, work together and you'll do great!\r\nTam does a wonderful job at trying to get everyone's input. That can be difficult and she has tried many different ways to help staff feel comfortable to open up so she can find out what she can do to help.", "cons": "Some departments know how to work well with others and some do not. Everyone needs to remember that we all have a hard job and we are all in this together. We will not accomplish much if we do not work together. Don't be rude. Help each other out. Be professional. I'll never understand why some people just can't keep it professional/civil. We aren't in high school anymore (but this is with any job). \r\nI think it'd be a good idea if everyone were able to write down their questions/concerns and be able to have a group meeting with the other departments to get things taken care of rather than having to go through the manager. It's easier for the person that's seeing issues to be able to voice those issues to the department directly. When you go through a manager it can appear as tattling to some and that never went over well and it's just adding more and more people in the mix instead of being able to go directly to the person first and THEN if there is an issue, contact manager to take over. \r\nWhen someone quits in a department I wish they would hire a replacement instead of just continuing to let that department go under staffed. I was never given a clear reason from my manager as to why this kept happening."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Animal Shelter with heart", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 May 2020", "job_title": "Web/Graphic Designer in Merriam, KS", "duration": "N/A", "pros": "I joined Great Plains SPCA during a very transitional time for both the organization and myself. After CEO, Tam Singer took over, she took the time to understand my situation and concerns and worked with me to provide guidance and build confidence in my role as an employee. While a lot of CEOs I've encountered come off as \"unaccessible\" or \"unrelatable,\" Tam shows genuine concern and interest for her employees' well-being. Each director or manager has their own management style, Great Plains SPCA promotes a culture of positivity, grace and problem solving. This took me a bit to get used to because every other job I've had was about CYA(Cover Your ...). There is accountability for each employees' work, however, the mentality when issues arise is about resolution and not blame. There have been a lot of changes in the organization since I first started, but I feel like Great Plains SPCA is heading in the right direction.\r\n\r\n-Organization and Management show genuine concern for employees health and well-being.\r\n\r\n-Employees go above and beyond for the animals and each other.\r\n\r\n-Flexible work schedule.\r\n\r\n-Encourage all staff to interact with and take care of the animals, regardless of position.\r\n\r\n-Discounted adoption fees for employees after 6 months.\r\n\r\n-Promote positivity and problem solving.\r\n\r\n-Management promotes transparency and empathy through difficult times.\r\n\r\n-If you work hard, your efforts DO NOT go unnoticed.\r\n\r\n-Did I mention you get to play with animals?!", "cons": "-Funding for the nonprofit isn't always consistent, which can lead to budgetary setbacks.\r\n\r\n-Because of the nature of the organization, the work can become fast-paced, last-minute and a little hectic at times.\r\n\r\n-Passion Fatigue, you get to know a lot of great animals, but you also see a lot of sad stories come in. It can take a toll on you emotionally if you aren't prepared.\r\n\r\n-Email chains (a problem at most organizations from my experience)."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Work can be rewarding but completely exhausting", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-Working with animals can be rewarding", "cons": "-Pay was low\n-Hours were long\n-Job is emotionally taxing\n-Management changes were insane"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Organization Amongst Change", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "As a former member of the Leadership Team, it is important to understand that Great Plains SPCA is making impactful changes within their organization to enable them to provide behavioral enrichment, socialization and high quality medical care to homeless animals in the Kansas City area. Many of these changes have been scrutinized, but these changes are what is best for the organization, animals and community. I was happy to be a part of this organization and work with such passionate, caring people.", "cons": "None, changes have corrected many issues."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Leadership & Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Apr 2018", "job_title": " in Kansas City, KS", "duration": "N/A", "pros": "The leadership at this organization has a great passion for animals and is dedicated to doing the right thing for the community.  With new leadership comes growing pains and for the first time I am seeing progress under the new COO toward a better future for pets and the communities needs through this shelter.", "cons": "Employees who do not want to come to work and actually do the work they are paid to do"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Since CEO has been made aware of Glass Door there's a suspicious influx of positive reviews!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 May 2016", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "The animals, made lifelong friends. Learned much about what kind of leader not to be. There's not too much else!", "cons": "Amoral and unethical CEO. She's a micromanager and undermines staff at every turn. Stalks former employees and attempts to prevent them from finding new employment. She also fired one employee who noticed that there were fake employees collecting Paychecks."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Even volunteers aren't appreciated", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Dec 2015", "job_title": "Volunteer in Merriam, KS", "duration": "N/A", "pros": "I originally volunteered with No More Homeless Pets KC and endured through the merger with Animal Haven to Heartland SPCA and finally Great Plains SPCA. I've been an animal lover all my life having grown up with cats, but had never volunteered with a shelter as I was afraid I'd want to bring all the animals home with me. When I found No More Homeless Pets KC at the Pet Expo, I knew I'd found the perfect place to help as their focus was on spay/neuter as the primary path to over crowding in shelters. If all companion and community animals have been spayed or neutered, it prevents literally thousands of animals ending up in shelters. It was a wonderful place to volunteer - while it was No More Homeless Pets.", "cons": "Once Courtney Thomas arrived at No More Homeless Pets KC and engineered the merger with Animal Haven, spay/neuter was no longer important. Staff turnover quickly became astronomical - it appeared that anyone Courtney didn't like was sent packing. Suddenly, the merged organization's primary focus became making money more than taking care of animals. Spay/neuter clinics were discontinued. Part of making money is marketing and PR. I know several staff were not happy when the Affordable Care Act was passed - especially the provision that requires everyone to buy health insurance. Later, I discovered why - they were entirely on their own. Great Plains even leaves volunteers hanging if they should be injured while volunteering. I  know of no other organization that doesn't take care of their volunteers - and I volunteer for a number of other organizations. I don't volunteer for Great Plains SPCA anymore as it now seems to be all about Courtney now. If an organization doesn't care enough about it's volunteers to take care of them if they're hurt while on duty and doesn't provide even basic benefits for paid employees, it seems job seekers would pass on working for that organization."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst CEO I've ever worked for", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Jun 2016", "job_title": "Technician in Merriam, KS", "duration": "N/A", "pros": "The lower level employees are the heart and soul of this place and are truly passionate about the animals.", "cons": "The \"lower level\" employees, which is anyone that isn't the CEO or one of her minions( we call them the mean girls club) are treated terribly. The upper level  management team only cares about making themselves look good and will blame everything on everyone but themselves. Th CEO loves to exploit the dedicated employees to the point of exhaustion. This company and the CEO will suck out your passion and destroy you. The CEO cares nothing of her employees and will fire or push out anyone that stands up to her or disagrees with her. The CEO and COO are beyond toxic and will be the downfall of this organization. Which is very sad because the organization and the people working for it are great, dedicated people that always leave because they can no longer handle the poor culture and management. The CEO has been blaming the poor culture on employees that have been gone for years. She is the only common factor in this equation. Additionally this organizations mission is suppose to be to help the animals and people in the community through affordable care. Although this use to be the case the management team has now raised prices to the level of private practice clinics, gotten ride of sliding scale pricing, shortened appointment time to 15 minutes and no longer offers discounted services. None of this benefits the clients or the animals and the lower level employees certainly to see any of that extra money, but I can guarentee you that the upper management team that makes six figures do!\r\nIf you want to help do it at KC pet project, wayside waifs, the humane society or Midwest pet rescue. These places haven't lost sight of their mission or the animals they are helping."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Positive changes need to be made.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 May 2016", "job_title": "Customer Service Specialist in Merriam, KS", "duration": "N/A", "pros": "Slim to none.  The employees with the most heart and love for the animals are the lower level employees including low level managers. Not just the pets though the owners as well.   Some put in as many hours as possible to insure pets get the best care possible.  Some very great relationships were formed not just between co-workers but employees and pet owners.", "cons": "Money money money money money!   It's all about the money.  Non-profit, yeah right.  When we had staff meetings they all were about money nothing but money.  When I started there it was mainly about the animals and their owners.  There were discounts for clients based on their annual income.  Those are now gone.  I feel so sorry for our clients that depended on that discount so they can provide their pets the best they can especially when their pets are sick.  We gave that to every client then it went to only clients that asked about it after a meeting about money.  I was disgusted with the CEO and COO during a “financial crisis” and yet proceeded to discuss renovations to the Veterinary Care Center.  Animals were brought in from other shelters, quick checks done, then right to the adoption floor in a matter of minutes sometimes. In doing so brought in illnesses to pets that were otherwise healthy and some of those were adopted out some had to keep coming aback for treatment many, many times.  It didn’t use to be like that more care was taken before adopting out pets.  Then comes the upper management. Do you really need four “executives\"  to do one job? Some of the Executives use their power to get things that they need or want whether or not they follow the rules or laws.  If that's not bad enough then you bring in someone with absolutely no nonprofit experience and no animal experience whatsoever. And that someone climbs up the ladder in a matter of months and becomes the COO and VP. Courtney Thomas and Kelly Chamberlain just keeps making the wrong decisions for Great Plains.  Disgraceful."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "CEO Creates A Toxic Workplace That Creates Compassion Fatigue", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jun 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The people who work with the animals are some of the hardest working, caring, and compassionate people you will ever meet.  They want only the animals best interest, period. The same people are hampered in doing their job by the management focus on the bottom line, money and image.", "cons": "The current management likes to blame ‘previous culture’ for things that have gone wrong in the organization.  Yet, the common denominator remaining after shockingly low employee retention, disappearing donors, and clients who have left, is the CEO.  The job is at once an exercise in futility because of management and yet deeply rewarding because of the animals. The management create ethical dilemmas followed by employee frustration and confusion. There is no transparency.  They believe their employees to be ‘negative’ or disloyal when questions are asked  or explanations are requested.  \r\n\r\nRecent posts have mentioned the CEO’s participation in the lower level jobs on campus.  It’s untrue. She appears in the various areas on campus mostly when she’s giving a donor tour or talking to the media.  She will walk into a room and walk right by you and not even acknowledge your presence so forget about knowing your name.  There is a reason why her name is consistently brought up here.  The common denominator is the CEO if the employee retention rate is shockingly low (10-20%) due to the toxic work environment and when large donors decline to continue to support the organization. \r\n\r\nThe organization's veterinary clinic went from being a well-known and much needed 'low cost' clinic to a regular priced clinic.  They changed the wording of their mission ever so slightly on paper but it was a huge shift from helping under-served communities to becoming a for profit clinic seeking ‘better’ (upscale) clientele and their money.  The organization’s website was scrubbed of any prior mention of low cost.  The lower income community that was formerly served was left fend for itself. \r\n\r\nThe above, and more, cause people to become disillusioned with the job and leave.  The turnover rate is astronomical. The burnout level is high but not because of the stress of dealing with abused, injured, or unwanted animals.  The burnout is high because the management is focused on image vs. reality and that disconnect hurts employees and the animals they are supposed to be helping.\r\n\r\nIf you are a suspend better judgment and ‘just do it’ type of person, you will do very well with the revised mission, direction, and management of the organization."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Manager", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "They maintain their No Kill status and they have the right mission at heart.  The majority of the staff people work really hard.", "cons": "There are way too many chiefs and not nearly enough Indians.  All of the chiefs are female and they act like a bunch of teenage girls."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "If you want to feel appreciated, stay away from this place!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jun 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The best part of the job was working with animals and the \"lower-level\" staff.  Honestly, the animals were the only reason I stayed as long as I did.", "cons": "The best way I can explain it is I felt like I was in an abusive relationship.  You put your heart and soul into their mission only to not be acknowledged by higher management and constantly reminded you are disposable.  Management constantly focused on negative and never gave uplifting encouragement.  There was no work life balance and found myself doing 4 people's jobs without the salary to back it up. I saw volunteers berate employees in front of other employees AND the public and nothing as so much as even a conversation with the volunteer happened. A lot of the volunteers who put in the most hours (and $donations$) are allowed to do and say whatever they want to whoever with absolutely no consequences.  If someone has a problem with you they don't give you a chance to talk to you one on one and to correct it.   I was pulled into a meeting with the CEO to discuss another manager in a group setting with several employees and managers. She wanted to hear every issue or flaw we had with that person and why we thought they were bad at their job.   It felt like mean high school girls being pulled together to gossip about someone who wasn't there to defend themselves when it was clear it was a conversation that needed to happen between the CEO and manager only.  Not to mention I was close with this person and this put me in a very awkward position.  So much talk about culture and changing it for the better and nothing ever changed for more than a week at a time and no follow up.   Not given resources to help staff succeed but then get chewed out when things are done not to their \"standards\".   Craziest thing is when I left not ONE person asked me why like they understood and already knew why.  When I did leave it felt like 500lbs of BS was lifted off my shoulders."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inclusive Workplace Full of Driven and Compassionate Individuals", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Jun 2020", "job_title": "Foster Manager in Merriam, KS", "duration": "N/A", "pros": "great pay for nonprofit work, very understanding leadership, opportunities for advancement, can bring personal pets to work, employees encouraged to use work time to socialize with shelter pets, frequent social events involving free food", "cons": "the work never stops, compassion fatigue is inevitable"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great organization that is being run into the ground by awful CEO!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Oct 2016", "job_title": "Customer Service Specialist", "duration": "N/A", "pros": "Many dedicated employees and volunteers who truly believe in the mission and are there to help the animals. This organization has major potential if it were being led by a more qualified, objective, less self involved leader capable of actually taking responsibility for her own mistakes.", "cons": "Too many to list but they all stem from upper leadership and their total self involvement and constant goal of making themselves look good. They don't appreciate staff or volunteers who work tirelessly for the organization. They act like high school mean girls and you better watch out if you get on their bad side. CEO is too busy posting selfies to prove how awesome she is, and the COO is just a big bully! Many current staff are too afraid to speak up because they will lose their jobs. \nThe CEO makes it her mission to find out what people are saying about her and then works to destroy anyone who has negative remarks about her. She is more worried about her current staff talking to former employees and sharing information. She needs to take a closer look at the ELT team for the peeple sharing information  and stop blaming former employees for trying to ruin the organization. Not one person who has written a negative review had anything bad to say about Great Plains itself, just the inadequate Executives running the show. \nThese ladies are dishonest as well and the board needs to start investigating them. Perhaps they could start with the budget and 'Joe Schmo.' I know many would love an explanation on how this guy was in the budget and then suddenly gone!!!!"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "I'm saddened by my experience working here, it's supposed to be about the animals.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Aug 2017", "job_title": "Animal Care in Independence, MO", "duration": "N/A", "pros": "The employees that work directly with the animals on a day to day basis pour their heart and soul into their work. They're truly dedicated to the happiness and well-being of the animals and form very close bonds with the animals. It is for that reason alone I stayed as long as I did.", "cons": "New employees receive inadequate training, usually only shadowing multiple other employees for a few days before doing things on their own. When I began, management had more involvement in that process, but that dwindled down to hardly any involvement. Also, management hardly ever knew what went on in our department, and even though we frequently requested new cleaning equipment in order to do our jobs correctly, it took months to actually get anything. This left us having to share equipment between rooms on multiple occasions or getting soaked by leaking kennel sprayers. Most members of management were very kind, they just didn't... manage.\r\nAt first, we had enough staff members to do things efficiently, thoroughly, and correctly, but over a period of 4-6 months multiple employees quit or were fired and were never replaced, leaving only a fraction of people needed to do our job correctly, and it was the animals who felt those effects. Constantly we were told that there would be more people starting soon, but that never happened. Some staff would slack off and leave the rest of us to make up for them, but no disciplinary action was ever taken, I suspect due to the lack of staff in the first place. During my last 2 months or so, at least once every week only one person would be working in our department (plus whatever volunteers showed up that day), and being animal care, that person would be responsible for taking care of 150+ animals.\r\nWhile we were doing the work of 4 people at once while still being paid our starting salary, people were being hired in new upper management positions left and right and high-end fundraising events were held so often that it felt like every weekend. It seemed like it was always about the money...\r\n\r\nIt also felt like I was back in high school. There were cliques among volunteers, among different departments, among different shifts, you name it... with each group spreading their own gossip about each other. There was no sense of camaraderie or teamwork, despite what it may look like on the news when we come together to handle things such as puppy mill raids.\r\n\r\nOverall, I felt overworked, underpaid, and under appreciated (actions speak louder than words), and I know for a fact I am not the only one who felt that way. Even though I finally feel relieved and less stressed after quitting, I feel sad for the animals left behind if things don't change soon."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Beware, if you want to be appreciated, run away!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working with the cats and dogs.", "cons": "New president has created an environment of mistrust. We are discouraged from working together, there is no team. It is cuthroat and it is sad. Everyone is afraid of losing thier jobs, so they throw anyone under the bus. The job is stressfull and emotional enough without fearing is Tam is lurking around spying on you. Or having someone else spy for her. It is sad. As soon as I can find another job I am out."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "The people look out for each other and management is always available when we need them.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This organization goes above and beyond for the animals and the staff.  The CEO leads trainings, engages with staff and makes herself personally available to us.", "cons": "Compassion fatigue is real. We deal with injured animals and some of the things we see can be very painful"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Used to be a good place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Work to help animals and people. Make a difference in the community", "cons": "The politics that caused the previous CEO to leave; board with too much ego;"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Suspicious positive reviews about Great Plains spca", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Oct 2016", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "Do not work here! There are no pros! Run away if you want work life balance and to be appreciated!", "cons": "It's very obvious that the executives are on Glassdoor making all of the positive reviews! Very sad ladies! This place is going straight into the ground!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "High turnover", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Dec 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Wonderful opportunity to work with animals.  Most customers coming in to adopt or use vet services are very nice.", "cons": "Very few long term employees.  High turnover on the management team, which then trickles down to lower level staff.  Haven't issued raises to hourly workers in three years."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Wonderful Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jun 2020", "job_title": "Behavior Consultant", "duration": "N/A", "pros": "It is a place that cares about its employees' concerns, does great work with animals and for their community, and treats its workers with respect and value that is hard to find in other places.", "cons": "I honestly can't think of any."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Former Volunteer", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Used to feel appreciated and useful", "cons": "Tired of always finding Staff and Management  running away from work, hiding out, going on break and leaving Campus while Volunteers completed it all.  Staff and Management not following through with repairs in a facility build new from the ground up that now,  after 5 years  looks so run down, cluttered, and filthy."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Tam is a great!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Responsive, visionary, coaching-style leadership, full of gratitude and open to new ideas, receiving feedback and creating changes where needed. Encourages everyone to bring a voice to the table.", "cons": "Can come off as intimidating sometimes"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Educational but not life changing.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "It gives you the opportunity to grow on all skill levels from seeing clients, radiographs, dental, surgery/anesthesia, lab work, cytology, and emergency situations.", "cons": "Seeing what humans are capable of putting innocent animals through."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great company to work for, good work/life balance. Purposeful work.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jun 2019", "job_title": "Customer Service Representative in Merriam, KS", "duration": "N/A", "pros": "Family atmosphere, employees appreciated, open door policies.", "cons": "Not the same company since management changes in 2017."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Technician", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Rewarding roles where your work is genuinely appreciated.", "cons": "Long days, there’s always animals in need that will cause you to have to stay late."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Very happy here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Nov 2019", "job_title": "Animal Care Specialist", "duration": "N/A", "pros": "Love my job, love my team, LOVE THE ANIMALS!", "cons": "Want to save them all."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great work environment", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Aug 2020", "job_title": "Animal Care Manager", "duration": "N/A", "pros": "positive culture, accountability, encourages growth within", "cons": "small facility prevents from helping more animals"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Make a positive difference for shelter pets!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jun 2020", "job_title": "Donor Relations Manager", "duration": "N/A", "pros": "The highest quality of care for shelter pets.", "cons": "Best animal shelter in KC!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "do not work here!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Aug 2015", "job_title": "Veterinary Technician", "duration": "N/A", "pros": "It is hard to find a \"best\" reason to work at Great Plains SPCA.  The staff do care about the animals but burnout supercedes the caring eventually.", "cons": "Understaffed, underpaid, overworked, poor upper management."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Common sense", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Dec 2018", "job_title": "Anonymous Employee in Merriam, KS", "duration": "N/A", "pros": "Dedicated staff and volunteers are trying to hold it all together.", "cons": "Management has gone on a ridiculous power trip."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Animal Care Tech", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Jan 2019", "job_title": "Anonymous Employee in Mission, KS", "duration": "N/A", "pros": "ANIMALS!!! Love the animals, and making a difference.", "cons": "If you aren't part of the \"higher up positions\" you are basically disposable. Too much secrecy & worry over saving face to the public & impressing donors. Very little pay, raises are a joke."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Top heavy with little support", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jun 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The organization is great at fundraising and great at marketing.", "cons": "Little is really done for the animals or staff."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I hope they've changed their ways", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Jul 2020", "job_title": "Manager in Merriam, KS", "duration": "N/A", "pros": "Helping save the lives of animals.", "cons": "It was like working with mean girls. If your not in the clique then you're nobody."}]]