[[{"date": "3 Jun 2023", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Centre hospitalier de l'Université de Montréal (Montreal, QC)", "Interview Descriptions": "Very precise and fun, a lot of friendly scenarios occurred in this process. Answer to the job was given relatively quick also. Additionally, there was no confusing by tasks and later compensation", "Interview Questions": "What are your current job environment expectations"}, {"date": "30 Oct 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centre hospitalier de l'Université de Montréal", "Interview Descriptions": "it was more formal than expected it was more formal than expected it was more formal than expected it was more formal than expected it was more formal than expected it was more formal than expected", "Interview Questions": "Why do you want to work with us"}, {"date": "19 Oct 2022", "title": "Biomedical Engineering Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Centre hospitalier de l'Université de Montréal", "Interview Descriptions": "Virtual interview with different embers of the staff, HR, engineering. Each of them asks you different questions. You get scenarios and you have to explain how you would react. You get questions on how a biomedical engineer leads his job.", "Interview Questions": "What do you think a biomedical engineer do in his daily job?"}, {"date": "14 Jan 2017", "title": "Assistant Recherche Clinique Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Centre hospitalier de l'Université de Montréal (Montreal, QC) in Sept 2016", "Interview Descriptions": "Questions personnelles.Tu as des enfants ? Combien? Quel âge?  Mise en situation. Comment gérer un conflict.en général des questions loin de la partie technique. Pas d'expérience demande dans le domaine", "Interview Questions": "Tu as des enfants ? Combien? Quel âge?"}, {"date": "15 Apr 2016", "title": "Agente adminstrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took a year or more. I interviewed at Centre hospitalier de l'Université de Montréal (Laval, QC) in Nov 2015", "Interview Descriptions": "Première étape était de réussir trois tests d'embauche par écrit: une dictée, un questionnaire avec des termes médicaux, évaluation calculant le nombre de mots/minute sur l'ordinateur. \r\nEn deuxième temps, une entrevue orale d'embauche avec 2 autres candidates et 2 interviewers.", "Interview Questions": "Si vous constatez qu'un employé vole, que faites-vous ?"}, {"date": "4 Dec 2017", "title": "Agent Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Centre hospitalier de l'Université de Montréal (Montreal, QC) in Sept 2015", "Interview Descriptions": "Very methodic and applicable to the job at task. However, interview was biased towards experience and not si much towards proven results. Overall it was a lengthy process, but rewarding nonetheless.", "Interview Questions": "Data set analysis and how to decode it"}, {"date": "3 Sept 2014", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centre hospitalier de l'Université de Montréal", "Interview Descriptions": "Applied online in 2004\r\nFirst interview is phone interview\r\nthen went in to do practical tests such as typing, filing in alpha numerical orders & grammar. \r\nYou have 3 chances to do each test If I remember correctly.\r\nthen in person interview with HR and intern and a recruiter I think. Questions about your resume, where you see yourself in a couple of years, do you plan on going back to school etc. \r\nGo a call back about two weeks after final interview and was hired. You get one week in class training then 10 days shadowing someone. At the time they guaranteed I would do full time, but on orientation day the woman said and I quote ' we can not guarantee that you will work full time, we might not call you for 3 weeks\". Which is scary but I ended up working on call full time for 6 years before applying and getting a full time position so dont panic!", "Interview Questions": "How would you react if you where faced with an agressive/screaming patient."}]]