[[{"date": "22 Nov 2022", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Justice Resource Institute", "Interview Descriptions": "Met with 2 social workers and spoke to each at career fair. They followed up and offered an in-person interview, where I met with the site-specific team. They answered all my questions and gave me paperwork to sign. I also had to complete a background check.", "Interview Questions": "They asked about my previous clinical experience"}, {"date": "13 Nov 2021", "title": "Res Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Justice Resource Institute", "Interview Descriptions": "Zoom meeting and a phone call and tour afterwards. Discussion about kids/ great benefits etc. Promising growth opportunities. It was a positive experience. Everyone was professional, knowledgeable and kind. I would recommend.", "Interview Questions": "Are you a dependable person ? "}, {"date": "9 Feb 2021", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Justice Resource Institute", "Interview Descriptions": "Very short and vague interview. Interviewer did not ask questions about clinical views and treatment modalities. It was a 10 mins interview.  Interview was conducted in a very small and uncomfortable space.", "Interview Questions": "Why do you want to work in residential with kids?"}, {"date": "11 Nov 2019", "title": "TT&S Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Justice Resource Institute (Lynn, MA)", "Interview Descriptions": "The interview process was good I interviewed with 2 separate managers both of them made me feel very comfortable. Very nice people. I would recommend working at this location. They hire good people", "Interview Questions": "Tell me about ur self "}, {"date": "12 Jun 2019", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Justice Resource Institute (Concord, MA) in Jun 2019", "Interview Descriptions": "It was more like a conversation than an interview - which I am always fond of. The two women who interviewed me were very kind and understanding; made me very comfortable. Due to this, I felt like I did a good job during the interview.", "Interview Questions": "If a resident comes up to you after they had a nightmare, how should you respond?"}, {"date": "22 May 2019", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Justice Resource Institute", "Interview Descriptions": "It was a basic behavioral interview. After you applied online to the position, the company would review your resume very quickly. I got the interview schedule by phone the day after submitting my resume.", "Interview Questions": "How do you split the context which is separated by a comma within one column by SAS? "}, {"date": "16 May 2019", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Justice Resource Institute (Taunton, MA)", "Interview Descriptions": "Positive interview experience . Interview was quite pleasant. Professional interaction among all involved within the interview process. Wish salary offer was higher. Would consider working for this employer in the future with more post-graduate experience.", "Interview Questions": "Most challenging professional experience "}, {"date": "26 Jan 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Justice Resource Institute (Framingham, MA)", "Interview Descriptions": "Status quo if you have your paperwork ready.  Managers interview with directors and operations personnel and should expect a group home visit including group home staff and clients.  Staff would interview with managers and directors and should expect a home interview.", "Interview Questions": "Expect case scenarios regarding clients, families, staff etc"}], [{"date": "16 Oct 2021", "title": "Special Education Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Justice Resource Institute in Jul 2017", "Interview Descriptions": "Great introduction, meet the team, talk to the team, interview. \n tour the school, and if they feel you are a match shadow a class. They meet with the team to follow up. \nSelections are made in a average time frame", "Interview Questions": "How can you engage students who struggle to engage?"}, {"date": "15 Jun 2017", "title": "Residential Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Justice Resource Institute", "Interview Descriptions": "Easy, felt more like a brief conversion than an interview. Discussed the kinds of children they work with, and the availability of hours. Not the best schedules available. They were in the process of turning the school into a residential home (Littleton ma)", "Interview Questions": "Why do you want to work here "}, {"date": "17 May 2017", "title": "Academic Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Justice Resource Institute (Lexington, MA) in May 2017", "Interview Descriptions": "Applied by emailing resume and cover letter to contact listed on job description. Received email in about 1 week to set up interview. At interview first was required to fill out written application and several consent forms for background checks", "Interview Questions": "What kinds of exciting activities do you do outside of work that you could offer here on campus?"}, {"date": "9 Sept 2017", "title": "Assistant Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Justice Resource Institute (Taunton, MA) in May 2017", "Interview Descriptions": "It was an in person interview with a director and a vice president. Reviewed relevant work experience, asked how I would handle a hypothetical challenge, my philosophy of staff supervision, nothing out of the ordinary.", "Interview Questions": "How would you feel about a \"phone always on policy\"?"}, {"date": "8 Feb 2017", "title": "Residential Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Justice Resource Institute (Concord, MA) in Dec 2016", "Interview Descriptions": "I applied for the position and immediately received an email requesting that I come in for an interview. The managers I met with were extremely knowledgeable and professional. They were honest about the difficulties of the position and forthcoming about any perceived annoyances of the work. We conversed for about 30 minutes. They then gave me a tour of their facility and introduced me to other staff members, which gave me a feel for the environment. I also got to meet some of the girls in the residential facility and where they live, work, eat, and play. The entire process was very straight-forward, easy and positive.", "Interview Questions": "How will your prior experiences inform your attitude here?"}, {"date": "9 Aug 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Justice Resource Institute", "Interview Descriptions": "After I sent in my application I was immediately contacted (within the day) and set up my interview for that weekend. When I arrived I was unsure where to go, but eventually found the door. I then went and filled out paperwork and was met by an incredibly nice and friendly staff for my interview. She put me at ease and was extremely informative.", "Interview Questions": "What does safety mean to you?"}, {"date": "21 Aug 2015", "title": "Residential Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Justice Resource Institute (Site) in Aug 2015", "Interview Descriptions": "Spoke with residential manager for 30 minutes on Friday. Started on Monday. Many forms to fill out prior to start. Shaddow for 2 weeks. Extremely boring and training was pointless.", "Interview Questions": "None"}, {"date": "29 Nov 2016", "title": "School Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Justice Resource Institute (Boston, MA) in May 2015", "Interview Descriptions": "The interviewers were very welcoming. In addition to asking questions related to safety, professional boundaries, and overall experience, they also asked questions about me as an individual which showed they had interest in the type of person I was and not just the type of worker I was.", "Interview Questions": "What does a successful and safe school environment look like for you?"}, {"date": "18 Aug 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Justice Resource Institute in May 2015", "Interview Descriptions": "I was interviewed on previous work experience related to working with children, specifically troubled youth. They also ask personality questions and questions related to stress tolerance. I was also hired at a time where they were desperate for staff and assume it has become more difficult to obtain a job.", "Interview Questions": "What is one experience you had where you felt overwhelmed by the situation?"}, {"date": "10 Mar 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Justice Resource Institute (Thompson, CT)", "Interview Descriptions": "I had an interview last week and hoping to hear back. I felt very comfortable. I am waiting for them to let me know if they are interested in seeing me again.", "Interview Questions": "Asked if I was able to work overtime occasionally."}], [{"date": "6 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Justice Resource Institute (Attleboro, MA) in Nov 2013", "Interview Descriptions": "I met with the program director and she was incredibly kind, flexible with giving intern hours around a college schedule. Did not feel a ton of pressure or competition. Learned a lot about the program and responsibilities of an intern.", "Interview Questions": "What made you want to work at this program/with the adolescent population? "}, {"date": "23 Nov 2016", "title": "Overnight Awake Counsulor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Justice Resource Institute (Attleboro, MA) in Oct 2013", "Interview Descriptions": "it was very laid back. the house manager was very friendly and outgoing. she described the company as a whole and what is to be expected from me. she made me feel like I was already part of the staff and the staff was very helpful with any questions I had.", "Interview Questions": "just the basics: tell me about yourself"}, {"date": "25 Apr 2013", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Justice Resource Institute", "Interview Descriptions": "Very simple face to face interview with a higher management personal member. Lasted about half an hour and generally consisted of my goals and my desire to work with children.    Basically informing individual of the placement and the routines.  Most important part is a clean driving record and cori check.", "Interview Questions": "How would you feel about restraining someone?"}, {"date": "7 Mar 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Justice Resource Institute", "Interview Descriptions": "Went for a quick interview, found out I could do statistical research, and they hired me.", "Interview Questions": "Can you analyze data using SPSS?"}, {"date": "14 Jun 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Justice Resource Institute (Framingham, MA) in Aug 2011", "Interview Descriptions": "The questions asked have nothing to do with this position. It's based on wether or not they like you. Some questions where very basic and didn't seem like they really wanted to know if you would be good for the posistion", "Interview Questions": "What did you do for work previous to this?"}, {"date": "3 Apr 2013", "title": "Clinical Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Justice Resource Institute (Thompson, CT) in Oct 2010", "Interview Descriptions": "I submitted my application to JRI one week and was called for an interview the following week.  JRI had leased three new group homes and was pulling together a management team to run programming for adolescent residents.  The interview covered all areas of group home management.  The interviewers were most interested in my personal views and abilities: 1) pulling together teams to work with individual residents; 2) on community relations and communication with outside providers; 3) on the application of behavioral management techniques and mental health interventions.  There was only one interview during which salary and benefits were covered.  After completion of a background check, which took about two weeks, I was hired for the position.", "Interview Questions": "I was prepared to answer all questions.  There were no difficult or unexpected questions."}, {"date": "11 Jul 2010", "title": "Assstant Overnight Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Justice Resource Institute in Jul 2008", "Interview Descriptions": "I was hired on the spot...started within 3 days..trained for 3 days...that is it.", "Interview Questions": "How will you handle difficult clients?"}]]