[[{"date": "6 Jun 2023", "title": "Program Manager II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at L.A. Care Health Plan", "Interview Descriptions": "The interview process was simple, coordinated quickly with the Talent Acquisition team. The team I interviewed with was efficient and a pleasure to meet. We talked so much about my experience and what to expect we had little time left to go over questions I had.", "Interview Questions": "Explanation of my previous work experience managing programs in healthcare."}, {"date": "8 Jun 2023", "title": "Solution Center Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jun 2023", "Interview Descriptions": "The interview went very well with Jacqueline. She took the time to explain the process of the job and what was expected of me. She also made me feel very comfortable during the interview. I look forward to to being apart of the L.A. Care team.", "Interview Questions": "Q. Name a time you had to learn a new process very quickly."}, {"date": "6 Jul 2023", "title": "Community Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jun 2023", "Interview Descriptions": "I was able to interview in-person at a job fair and it went very well. They had a very professional setup and snacks for the interviewees. I was able to meet with a few managers in a large board room and sat down to talk to answer any questions they had for me. As nervous as I felt, they made me comfortable and as if we were just having a conversation. Once the interviews were over, I was directed to someone in HR that would follow up with me. It was all a very smooth process.", "Interview Questions": "What strengths from your previous positions would help you do well in this role?"}, {"date": "20 May 2023", "title": "Clinical Analyst III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at L.A. Care Health Plan in May 2023", "Interview Descriptions": "The entire process was very quick, professional, and a great experience. First interview was with the hiring manager and the 2nd (final) interview was with the hiring manager and analytics lead. In total it took 3 weeks from first contact to getting an offer. Interviews were all done remotely. Hiring manager and analytics lead were very friendly, prepared, and great communicators on what they're looking for in the role.", "Interview Questions": "How do you approach a data analytics project?"}, {"date": "21 Apr 2023", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2023", "Interview Descriptions": "After going through the wonderful women in HR, they had told me I was eligible for an interview. I had the pleasure of having my interview online via Webex with my potential boss. It was very easy to log in and most of all it was great to meet the person with whom I’d be working for !!!", "Interview Questions": "He had asked about my previous employment. He also asked about my opinion on coming into the office."}, {"date": "10 May 2023", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at L.A. Care Health Plan in Apr 2023", "Interview Descriptions": "I applied in February and didn’t hear back until sometime later in March. Interview process went by fast. Met with manager and then panel of four. First round was introductory and more conversational. Second round has more technical and scenario questions.", "Interview Questions": "How would you run a meeting?"}, {"date": "12 May 2023", "title": "Customer Solutions Representative III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2023", "Interview Descriptions": "I received a call from HR requesting an interview. I was given a couple of possible meeting times to select from which was convenient. Once I accepted the calendar invite, I was immediately sent a WebEx invite link to be used on the day of my interview. The managers that interviewed me were super polite and full of information. They shared everything they could think of about the position. All my questions were answered as well. There was only 1 interview before I was called with an offer. That took about 2 weeks at least", "Interview Questions": "Can you describe your duties with your previous employer?"}, {"date": "17 May 2023", "title": "Customer Solution Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2023", "Interview Descriptions": "The interview was very straightforward. Make sure you know what you are applying for and get a thorough of wha the company expects. The interview was a 30 minutes. If yo are thinking of applying, I’d say do it because La Care has a lot to offer", "Interview Questions": "Tell me a bit about why you want to join La Care?"}, {"date": "7 Apr 2023", "title": "UM Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2023", "Interview Descriptions": "Very professional upfront with what is required and overall awesome experience. Everything explained up front which helped make my decision a little easier to make in taking the job. It was a good interview process.", "Interview Questions": "What kind of skills I could bring to the team."}, {"date": "5 May 2023", "title": "Program Manager II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2023", "Interview Descriptions": "Submitted application in February, was contacted in April. The communication was clear and quick after my resume was reviewed and the interview/hiring team asked great questions. The reached out with their decision by the next week.", "Interview Questions": "The interview team asked me about creating workflows and information dissemination."}], [{"date": "19 Feb 2023", "title": "Information Technology Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at L.A. Care Health Plan", "Interview Descriptions": "Very fast process and applied through recruiter. The entire process took roughly 3 weeks. Recruiter acted professionally and I did not take the position. Company seemed disorganized and that is the primary reason I did not accept the offer given.", "Interview Questions": "What challenges did you face in your past job?"}, {"date": "4 Jul 2023", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Feb 2023", "Interview Descriptions": "LA Care has a thorough and well-structured interview process that typically consists of 2-3 rounds. I personally enjoyed every bit of it. The interviewers were professional, knowledgeable, and friendly, which made the experience comfortable and engaging.", "Interview Questions": "Can you describe a situation where you had to analyze a large amount of data and provide actionable insights?"}, {"date": "15 Jan 2023", "title": "Customer Solutions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "Very easy, was not as bad as I thought it would be. The interviewing manager was very nice and made me feel real comfortable when I answered questions. I'm pending a background check now, hope to get a start date real soon.", "Interview Questions": "What were my strength and weaknesses?"}, {"date": "15 Jan 2023", "title": "Intern HR Learning and Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "The interview was conducted via Cisco Webex. My interviewer was very courteous and approachable and I felt at ease during our entire conversation. The interviewer / manager gave me some background info on the company and then proceeded to describe the details of the job / projects that I would be directly involved in. And, of course, we discussed my knowledge, experience, and skills relevant to this position. Coming to the conclusion that my experience, skills, knowledge, and career path are aligned with this position.", "Interview Questions": "I was asked about my current position, specifically how my experience lines up with this new job."}, {"date": "26 Jan 2023", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "I’ve had a very positive experience with La Care Health Plan . I applied about 3 weeks ago got an interview about a week after I applied. I got an offer two weeks after interviewing. The company is very nice and professional and I am so excited for my new journey with them .", "Interview Questions": "Why do you want to work with us ? Why are you leaving your current job. Tell me about yourself."}, {"date": "28 Dec 2022", "title": "Compliance Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "Phone Interview with hiring manager. Second interview (Group) with Department leaders and team. Questions focused on past experience and what skills I would bring to new organization. Job offered within one week", "Interview Questions": "What skills I would bring to new organization."}, {"date": "17 Jan 2023", "title": "Program Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Dec 2022", "Interview Descriptions": "The talent acquisition team was incredibly prompt at scheduling the interviews and following up. The interviewing team was very kind and made the process stress-free. The questions asked were straightforward and engaging. The managers are clearly very passionate about the work they do with LA Care.", "Interview Questions": "What are some of your strengths and weaknesses?"}, {"date": "13 Sept 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA)", "Interview Descriptions": "Reached out by a recruiter and was taken through an interview process. The process was all online and I should have taken it as a red flag but nobody had their camera on ( I was expected to keep mines on).\n\nI get called a week later and given a verbal offer and then after that - radio silence for 2 weeks. I reach out and I am given the run around for 1 + month by the recruiter only to be ghosted by them. Thankfully I had another offer from a different company but if I waited on them, I would have missed opportunities.\n\nIf you value your time and respect yourself, don’t even bother with this company. The way I was treated by this recruiter was a clear indication how the company’s culture and environment is. Thank goodness I dodged a billet!", "Interview Questions": "What are your three strengths"}, {"date": "21 Sept 2022", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Aug 2022", "Interview Descriptions": "I applied online and the recruiter reached out to me 2 weeks later. I then went through 2 rounds of interview. First round with the manager, second round with the senior manager and creative. The interviewers were very nice, their questions were mostly about my experience and they answered all my questions. Overall experience was very positive. It took me 2 weeks to complete both interviews, and I received an offer the next week. ", "Interview Questions": "Why do you want to work at LA Care?\nTell me about your experience in managing different projects\nTell me about a time you failed\nTell me about your most accomplished experience"}, {"date": "16 Jul 2022", "title": "Quality Improvement Project Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jul 2022", "Interview Descriptions": "Quick and easy. Few technical issues with audio but was resolved quickly. Interviewer was nice and professional. Recruiter replied quickly and answered all my questions once a job offer was received and explained next steps in detail.", "Interview Questions": "How do I handle competing priorities. "}], [{"date": "30 Aug 2022", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan in Feb 2022", "Interview Descriptions": "Usual questions. Very friendly and had a great convo about entering into this field. Felt like talking with a friend about your interest instead of an employer. Can’t say that elsewhere that often.", "Interview Questions": "Why La care instead of ——-?"}, {"date": "5 Feb 2022", "title": "Case Management Specialist II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "The Interview was done by virtual, Webex platform. however only voice not video. The panel were made of native English speakers, which is why their non discriminatory value were the only thing that stood out. The questions they expected you to answer as if you are an inspirational speaker who speaks about the legit process to solve a problem. You would already know if you're interviewed 15 mins. less for a supposedly 1 hour. After the 2nd question, on problem solving, The interviewer asked me If I have questions. I sense Rejection instantly by Gut feel. This workplace is not supporting anti-discrimination law. To cut off an interview too early, not interested of getting to know the applicant.", "Interview Questions": "Describe a time you solve a problem that ended up with unexpected outcome?\nHow your skills relate to the position?\nQuestions about corporate and business-like. \n"}, {"date": "23 Nov 2022", "title": "CHW Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "was easy and had a point of contact was interviewed by 4 managers and had a second interview. but was then asked to apply for a different position . ........................................", "Interview Questions": "why was I looking for a different job"}, {"date": "4 Jan 2022", "title": "Medical Payment Associate Accounts Payable II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Dec 2021", "Interview Descriptions": "The hiring process was very professional! Regarding the interview, the interviewers were qualified individuals who asked quality questions in a mannerly fashion.  Never had an issue with delayed responses in emails. All my questions were answered accordingly.", "Interview Questions": "Tell us about your work experience related to this position's duties. "}, {"date": "25 Nov 2021", "title": "Utilization Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at L.A. Care Health Plan", "Interview Descriptions": "the interview process was very straightforward. It was such a quick & efficient process. Make sure to do research— Was asked about how company values aligned with mine. Thankfully I was able to begin right away. Orientation was very simple and organized.", "Interview Questions": "Why LA Care, work ethic."}, {"date": "15 Dec 2021", "title": "Grievance and Appeals Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Nov 2021", "Interview Descriptions": "Due to Covid it was over the phone. I was initially interviewed by the recruiter who then scheduled an interview with one of the Managers. We had a great conversation and I actually enjoyed the process.", "Interview Questions": "I had the normal tell me about your prior work experience.\nWe went through each position I've held and had a detailed discussion on each one. "}, {"date": "17 Nov 2021", "title": "Social Worker III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Nov 2021", "Interview Descriptions": "The interview process was direct, professional and fair. The two individuals that interviewed me provided a detailed description of the position as well as the expectations. They also inquired about professional skills, experiences as well as samples of achievements and problem solving.", "Interview Questions": "Tell us about your experiencing handling a difficult/stressful situation. "}, {"date": "15 Nov 2021", "title": "Licensed Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Sept 2021", "Interview Descriptions": "Very thorough and organized. Very welcoming and helpful. It was very clear that they are experienced and have a passion for what they do. They took the time to answer questions and get to know me to see if this would be a good fit.", "Interview Questions": "Where do you see yourself in your career? "}, {"date": "27 Jan 2022", "title": "A & G Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Sept 2021", "Interview Descriptions": "Interview was smooth and  they were happy to answer any questions you may have and call back was quick too. Even though I had no experience they gave me a chance and I learned how to do this job quickly and efficiently thanks to the training they provide.", "Interview Questions": "They asked questions about my knowledge and experience. "}, {"date": "16 Sept 2021", "title": "Business Analyst II (Temporary) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Aug 2021", "Interview Descriptions": "30 minute Webex telephone interview with the manager & two of her employees. The process was very easy and simple and felt fairly laidback. I felt very comfortable during the interview.", "Interview Questions": "Please describe previous job functions."}], [{"date": "9 Nov 2022", "title": "Information Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jul 2021", "Interview Descriptions": "Everything was done online. two rounds and an offer was made. I accepted. Was seemsless, and I recommend . Team is cool, and easy to work with. CEO has a great vision for the company", "Interview Questions": "Everything was done online. two rounds and an offer was made. I accepted."}, {"date": "24 Jun 2021", "title": "Compliance Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan in Jun 2021", "Interview Descriptions": "Interview process was conducted via WebEx. HR was thorough and provided regular updates each step of the way. The 1st interview was with hiring manager.  The 2nd interview was a panel interview.", "Interview Questions": "What specific skill set from previous roles would directly apply to this position?"}, {"date": "23 Apr 2021", "title": "Program Manager III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2021", "Interview Descriptions": "The recruiter verified schedule availability for interviews with sufficient advanced notice.  During these Covid times, the interviews were held via WebEx video meetings.  It was a comfortable experience overall.  Interviews were started on time and typically lasted the entire hour.  There were a series of interviews with the hierarchy of management personnel who are accountable for the execution of programs at the health plan.", "Interview Questions": "Describe a recent and/or memorable program that you managed in your past work experience.  How did you manage program risk?"}, {"date": "3 May 2021", "title": "Compliance Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2021", "Interview Descriptions": "The interview process was sufficient.  The recruiter was responsive, courteous, and helpful.  I had two panel interviews and the interviewers were respectful and detailed in the questions and answers.  Both interviews were a delight for me to attend.", "Interview Questions": "How would my experience suffice in their department/team?"}, {"date": "24 Mar 2021", "title": "Claims Training Specialist III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Mar 2021", "Interview Descriptions": "Quick response from a recruiter. She was professional and lovely to speak with and was able to arrange an interview within a few days. Had a webex type interview to which they did not show video, but I was expected to show mine. There was a series of questions regarding training troubled employees and background information. There was a presentation portion to which I shared my screen. Ended on asking questions about the company culture and background. Nice ladies who interviewed me.", "Interview Questions": "How would you handle difficult set in their ways employees who are unable to or unwilling to learn new information?"}, {"date": "31 Mar 2021", "title": "Clinical Assurance Compliance Nurse Specialist RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Plainsboro, NJ) in Mar 2021", "Interview Descriptions": "The flow was smooth and organized; interviewers asked very relevant questions and was actively listening throughout the meeting; interview had options for a call-in or meeting link and both were very convenient.", "Interview Questions": "Extent of experience with delegated vendor audits/monitoring and oversight"}, {"date": "17 Dec 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Dec 2020", "Interview Descriptions": "The interview process was smooth.  HR had great communication every step of the way.  Answered all questions in a timely manner and was a pleasure to interview with.  They left no questions unanswered and were supportive.", "Interview Questions": "All were normal interview questions"}, {"date": "24 Nov 2020", "title": "Customer Solution Center Data Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Nov 2020", "Interview Descriptions": "The interview process was really good experience. The first person contact me to inform about the job and if I was still interested. The second person that contact me was to schedule the interview. The third person was the hiring manager who I had the interview with. All the staff that contact me are professional and friendly.", "Interview Questions": "Talk to me about your previous job experience? \r\nHow do you feel working independently in data entry?"}, {"date": "20 Oct 2020", "title": "Organizational Development Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at L.A. Care Health Plan", "Interview Descriptions": "It was relaxed and fun and members were actively listening. Questions were accurate and members were engaging in conversation. All members introduced themselves. However, it seems it's a cultural norm that people in LAcare are not active in LinkedIn.", "Interview Questions": "Challenged, Conflict resolution, creativity, Individual development sessions"}, {"date": "2 Jun 2020", "title": "Solution Center Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in May 2020", "Interview Descriptions": "Delightful and very professional and very impressive. Loved her personality and style and obtain great advice for the future on punctuality and adherence and attendance. Further more what to expect from a team member of LA care to always have that customer service Representatives heart.", "Interview Questions": "What was my Role when I worked for Molina Healthcare?"}], [{"date": "4 Jun 2020", "title": "Care Management Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in May 2020", "Interview Descriptions": "Phone Interview with a team of 3 from the department.  Was not able to do in person due to Covid19 restrictions.  Was difficult to hear all the members on the call. Team was friendly and open and interview went well other than phone issues.", "Interview Questions": "Name a time you worked to change a problem or issue at work and how did you go about it?"}, {"date": "28 May 2020", "title": "Community Health Worker II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at L.A. Care Health Plan (Merced, CA) in May 2020", "Interview Descriptions": "There were no technical difficulties throughout the interview until we ran out of time. The interviewers had to resend another code to enter a different zoom meeting and finish the interview but the transition went smooth and was quick. The interviewers were very professional and made me feel comfortable. Overall I had a great first time experience interviewing with LA Care.", "Interview Questions": "What is resource you needed but didn’t have in order to go forward with a project? "}, {"date": "9 May 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at L.A. Care Health Plan in Apr 2020", "Interview Descriptions": "The interviewers were very nice. They explained everything in details and gave me a very good impression. They also helped me to feel comfortable and not nervous. Overall I had a very good experience.", "Interview Questions": "Tell me about yourself."}, {"date": "17 Mar 2020", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Mar 2020", "Interview Descriptions": "The interview process with L.A. Care went very smooth and orderly. Everyone in the interview as well as in the building were nice, direct and very helpful. The interview panel were very open, easy going and approachable. I had a great experience!", "Interview Questions": "How did you overcome a difficult situation while at work?"}, {"date": "27 Mar 2020", "title": "Care Management Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Mar 2020", "Interview Descriptions": "Sara, the talent acquisition advisor is amazing. So supportive and so helpful. The interview process was very easy. I was lucky enough to have my interview over the phone due to the corona virus pandemic. Although, it was hard to identify the tone of the interview due to the circumstances, I was offered the position and I am very excited to be joining this great company!", "Interview Questions": "Tell me about a time you faced a difficult situation and how you overcame it."}, {"date": "25 Feb 2020", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Feb 2020", "Interview Descriptions": "The interviewing process was wonderful  experience  to get to know the supervisors  point of view. You received  a majority  of intel on what the job description  is really going to be like.", "Interview Questions": "Are you ok with managing multiple task in one day ?"}, {"date": "4 Mar 2020", "title": "Solution Center Customer Service Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Feb 2020", "Interview Descriptions": "The interview was professional and flowed quite easily. She allowed me the opportunity to ask her about the culture of the department and was very honest about the production and availability.", "Interview Questions": "How would I handle being called out of my name"}, {"date": "3 Apr 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Feb 2020", "Interview Descriptions": "The interview was professional and friendly, she help me feel comfortable and not nervous. Felt like she did ask fair questions and showed me around the office to get familiar of how they work. \r\n\r\nShe explain how the training process would be  and what is expected from me.", "Interview Questions": "why should we choose you, compare to the rest? "}, {"date": "20 Apr 2020", "title": "Care Management Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Feb 2020", "Interview Descriptions": "I applied online and received a message from HR that same week to set up an interview. I was told the interview will be completed over the phone. I was interviewed by 3 supervisors in the department. I was asked about 5/6 standard behavioral questions required by HR. The interviewers and I then spoke about my experience and the position. I felt that the supervisors were very friendly and transparent. I did not end up meeting the team before accepting the position, but I had no reservations that I made the right decision. Very excited to start!\r\n\r\nSara from HR also kept me updated every step of the process and was very supportive on answering my questions.", "Interview Questions": "Tell us a time you had a disagreement with a coworker or supervisor"}, {"date": "2 Mar 2020", "title": "Health Education Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Feb 2020", "Interview Descriptions": "A pre-screening interview took place over the phone, followed by an in person interview a week later. The interview took approximately one hour with 2 panelists. The questions asked pertained to scenarios and other questions were specific about the candidate's resume and the work experience.", "Interview Questions": "What is your ideal work environment? "}], [{"date": "7 Nov 2019", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "I received an email invitation to do a take home assessment test. Was given a link to some data, given 2 days to finish, sent my answers, and never heard back.", "Interview Questions": "Pretty standard questions, like manual calculation of the area under the ROC curve."}, {"date": "29 Nov 2022", "title": "Customer Service Representative (CSR) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Nov 2019", "Interview Descriptions": "interview process was short. but background check took over a month. It was an extensive process and over a month of training before getting on the phone. Once you are on the phone all the training goes off the window.", "Interview Questions": "Tell me, what are your weaknesses?"}, {"date": "3 May 2022", "title": "Portfolio Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Sept 2019", "Interview Descriptions": "Initial interview was with HR. The HR rep was fairly well versed in the role and was able to answer more than just basic questions. I shared several requirements during the interview process with the HR rep and instead of responding in detail via email they preferred to speak on the phone. I understood after being hired that what they indicated as positive answers to my needs were later retracted/denied and I had little evidence that what had been promised by HR during interview was later denied. Get everything in writing!\r\n\r\nMet with 3 directors during interview in person (pre covid). Offer made within a couple weeks and I had followup interview with direct manager after offer to clarify a few things.", "Interview Questions": "Are you familiar with the technology we are using for project management?"}, {"date": "4 Aug 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "It starts with a phone screen from a recruiter than an in person interview with your team. Usually a panel interview. HR is usually the hold up in how long the hiring process can take.", "Interview Questions": "Describe yourself."}, {"date": "16 Apr 2019", "title": "Senior Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Mar 2019", "Interview Descriptions": "It was a good 35-40 mins on the first phone interview, where they wanted to talk, broad overview topics regarding my goals, my background and how I would be able to fit in at their organization.", "Interview Questions": "One of the questions they asked me was regarding my salary expectations."}, {"date": "20 Sept 2021", "title": "FRC Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Dec 2018", "Interview Descriptions": "I actually liked the process. The process consisted of 2 interviews that both were fairly straight forward.  The first one is with the recruiter and the second was with the actual hiring manager.", "Interview Questions": "Please Describe your work style"}, {"date": "21 May 2019", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Nov 2018", "Interview Descriptions": "Hiring blitz in the style of speed dating. You went from table to table interviewing with different mangers.  The whole process took over four hours. Many of the hiring managers have not worked as case managers.", "Interview Questions": "One time you went above and beyond for a patient "}, {"date": "2 Feb 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Dec 2017", "Interview Descriptions": "Applied through website, was quickly screened by phone and brought in for an in-person interview for two different positions. Only asked behavioral questions, nothing about my past qualifications or work experience. I was never followed up with by the recruiter or the hiring manager for either position, even after the in-person interview.", "Interview Questions": "Just behavioral questions."}, {"date": "14 Feb 2018", "title": "Director, Business Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Dec 2017", "Interview Descriptions": "Applied online..received a call from recruiter on Sunday! first interview with the recruiter who right away asked me for in-person availability .  Next was meeting hiring manager in person and then group Technical interview followed by group Business group.  I told recruiter that no-matter what the decision is, I would write a nice review for them because they really deserved it!  I did't get the job but I liked the company and the people...Good luck for the guy whose got the job...", "Interview Questions": "skill and experience based questions"}], [{"date": "20 Dec 2017", "title": "Delegation Oversight Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Oct 2017", "Interview Descriptions": "The interview was fine - fair, with relevant questions, and a good discussion with the hiring managet about the position. But two of three employees didn't show up at the interview because they wanted to see the \"costume parade\" of their co-workers, which is frankly somewhat childish in my opinion. I heard nothing for 6 weeks, in spite of emailing HR twice for an update. Today I got a call from a recruiter in house at L.A. Care for the same position. She was extolling my skills and work experience as excellent fit for the position as if I had never interviewed by phone and in person for the job in 10-2017. In addition, L.A. Care did a background check prior to the in- person interview and there was no record of that information. The recruiter was all gun ho on tracing down the results of the interview but I told her that I have moved on from a desire to work at L.A.Care. Healthcare is a highly regulated field and I doubt L.A. Care would be a good fit for me because I am a skilled compliance -audit professional who takes my work seriously.", "Interview Questions": "Skills and job experience relevant to the job?"}, {"date": "31 Mar 2017", "title": "Several Different Positions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "HR recruiters are unprofessional.  Will schedule phone interview, but never keep the scheduled appointment time and will not follow-up.  This has happened on numerous occasions. When the candidate follow-up the attempt is unsuccessful, left voice mail message and/or email, but they will not return the call. HR is the first point of contact for future employees, but their HR department is unprofessional, poor customer service, inefficient and poor follow-up.", "Interview Questions": "N/A"}, {"date": "29 Mar 2017", "title": "Talent Acquisition Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA)", "Interview Descriptions": "Interview with the director and supervisor in separate one on one interviews. Typical interview questions to start. Describing past roles, how you would handle situations and how you go about your job.\r\n\r\nThe interview with the director started out well, stating he wanted to get to know me as person and as a whole individual. Where questions started out with my education, career decisions and directions to where I am now. This is where the interview went south. The mood turned into more of a hostile interrogation. The director intensely and aggressively asked questions about my past employers and their internals processes, structures, policies and business practices as he took detailed notes. I answered his questions to start, but as his follow up questions became more and more detailed about specific process and structures, I knew I was brought in to be questioned on my past employers. From then, I fed him embellished details for the heck for it.\r\n\r\nThe next part he asked questions on how I did my job and tools or sources I used. When he was not satisfied with the answer with he would follow up saying that I could think harder or that I was holding back. Again, very aggressively hostile nature taking very detailed notes. The last part he asked questions on was my salary history and specific names of people I have reported to in past jobs. Same deal hostile nature, when refusing to answer on some, he would continue to pry and not take no for an answer.\r\n\r\nLooking back on this I should have excused myself from the interview when he started asking for specific details about my past employers. I think what got me was how the interview started.\r\n\r\nAt the end of the interview, he told me that he didn't think I would fit the department. The competitor in me, had to give a snippy response on why he is wrong. I ended up getting an offer, but it was for a different position then what I interviewed for and as I thought about the interview and the offer. My gut was telling me NO, they will use you and then split you out in a few months.\r\n\r\nTalking to others in the industry, my gut was right. LA Care is known to burn through employees fast and with any little friction they will let employees go in a heartbeat.", "Interview Questions": "Sourcing techniques?"}, {"date": "8 Jan 2018", "title": "HR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Apr 2017", "Interview Descriptions": "Recruiter was very positive and promised follow-through, then: crickets. Coincidentally an external recruiter contacted me for same position and commented that the internal recruiter was actually a \"clerical temp\".   Sounded to me like L.A. Care Health Plan was in midst of organizational change & barely keeping up if a \"clerical temp\" is assigned to recruiting.", "Interview Questions": "Tell me about your background."}, {"date": "3 Oct 2016", "title": "Health Plan Field Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "Overall a pretty easy interview. Mostly contained the basics (Asking about resume, past experience, etc). A lot of it was them telling me about the company and department objectives. Those I interviewed with were very polite. In total, interview lasted about forty five minutes to one hour. Total process takes a good amount of time, however.", "Interview Questions": "Why do you want to leave your current employer?"}, {"date": "23 May 2016", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "The candidate experience was in short, pretty terrible and was conducted without much professionalism. I arrived 15 minutes early and due to the long drive there, requested if I could use the restroom. The receptionist asked me if I actually really needed to go then conceded to try to scan me up to another floor. The elevator never opened so I went back to reception to try to get them to scan me back in. Instead of doing so, they simply informed me that \"it takes awhile\" and I was turned away. After about 7 minutes I returned to reception and I was then questioned on how badly I needed to use the restroom (at this point, it was pretty badly). They scanned me back and I ran up to use the restroom. Reception failed to alert the team that I was there 15 minutes early. Also, once I was finally taken to the interview conference room, the first interviewer WAS AN HOUR LATE. The individual then asked me how I was compensated at a previous position. I answered truthfully to which this hiring manager retorted with \"I KNOW they DO NOT pay that much.\" (which actually isn't much at all). Then the hiring manager proceeded to question me on the compensation and then go on a tangent about how competitive the team is. While the hiring manager was asking questions and I was responding, there was a lot of texting going on. I was then taken to a person of a higher level. To sum it up, this director level individual declared how they could go \"anywhere else\" and make xxx more money but they don't simply because of the mission. Overall, from just that experience alone, I can gather that it is likely an uncomfortable culture with leadership that has a sizable chip on their shoulders. It was a complete waste of my time since I had to take some time off of my current role to attend the interview. Also, no \"thank you for your time but...\" communication. I come from a background of customer service = candidate experience and if the company does not have a culture of respect or awareness for their employer brand, then they likely do not have that awareness internally for culture.", "Interview Questions": "What tools do you use to source."}, {"date": "3 Oct 2016", "title": "Call Center Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jun 2016", "Interview Descriptions": "There were open interviews and I was refereed by a friend. I showed up to the interview waited about 30 mins to be called. The interview took less then 20mins.", "Interview Questions": "have you ever handled an escalated call?"}, {"date": "12 Nov 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "The recruiter contacted me via email to set up an on-site interview after they reviewed my resume. I interviewed the following week with the hiring manager and then her supervisor. Afterwards, I was taken in for software testing/evaluation. It took a little over a week to receive a call with an offer.", "Interview Questions": "What do you know about Medi-Cal?"}, {"date": "7 Mar 2016", "title": "Clinical Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Nov 2015", "Interview Descriptions": "Was interviewed by Director and two managers.  Interview was a combination of them asking about my experiences within research and industry as well as my knowledge of the structure of claims data and how I would handle certain analytic situations using the SAS programming language.  Face to face interview was followed by a brief SAS quiz as well as a quiz using EXCEL and preparing a written document.", "Interview Questions": "Calculate inpatient length of stay with multiple record per patient per episode."}, {"date": "9 Oct 2015", "title": "Human Resources Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at L.A. Care Health Plan (Los Angeles, CA)", "Interview Descriptions": "I had a phone interview with the recruiter. She was very nice and asked easy questions.  I was then scheduled to interview with the HR Manager who was also pleasant to speak with. Right away she asked about my salary expectations and replied that she probably could not afford that.  Honestly, my expectations weren't that high because I just moved from out of state and was unemployed w/ a newborn. She wanted me to interview with the former HR Analyst who moved into another role.\r\n\r\nI came back a few days later to meet with the former Analyst and we had a wonderful 1 hour interview/conversation about the job and organization.  I thought it went well and passed my computer tests with flying colors.  However, I NEVER HEARD BACK FROM THE RECRUITER.  I get it, I have 10 years HR experience and I am not disappointed I didn't get the job.  I was disappointed that the recruiter never replied when I followed up 1.5 weeks after my 2nd interview. \r\n\r\nRECRUITER - out of courtesy, just let the candidate know with a quick 1 sentence email or even an automated email from your system when you close out the requisition, especially when they did 3 interviews.", "Interview Questions": "Tell me about your experience in auditing?"}], [{"date": "13 Aug 2015", "title": "Member Service Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at L.A. Care Health Plan (Los Angeles, CA)", "Interview Descriptions": "good,  i had prior experience so it assisted me to get through,  passed background check,  bilingual over the phone test,  took a computer test to see computer skills, with in 2 weeks I received an email advising of my hire date with benefits to start after 60 day probation period however that was a dispute because if wasn't offered right away.", "Interview Questions": "experience"}, {"date": "13 Oct 2015", "title": "Manager, Appeals & Grievances Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jul 2015", "Interview Descriptions": "1st interview was with an exec in the A & G dept; it was supposed to be with 2 execs, but one was absent. I was later told I'd speak with her in a 2nd interview if I passed the 1st; I passed.\r\n\r\n2nd interview was panel-type. \r\n\r\nOne panelist asked me an odd \"gotcha\" question, & as I answered in a way that seemed to bug her, she glanced at the exec who 1st interviewed me & gave her a look to convey that I didn't cut it; she'd used the interview to flaunt her smarts.\r\n\r\nMostly, it went well.  Within 2 weeks I heard from the TA rep who'd recruited me; she told me I'm the \"top pick\" & that she'd like to ask me about my job history in order to fill out a \"worksheet\" to determine my pay.  When I asked if I'd gotten the job, if an offer would be made, she stumbled through her response, finally telling me she'd call in a few days.  When I asked for clarification -- i.e., if I'm the \"top pick\" & you're creating an offer worksheet, doesn't this mean I have the job? -- she couldn't answer.  To see if I could get a real answer, I asked if instead of popping the cork on champagne, how 'bout I have a glass of my favorite soda?  She said, \"Sure, & share some with me.\"\r\n\r\nBizarre; if I'm the \"top pick\" & an offer worksheet is underway, then why can't the rep give me an answer re am I to be HIRED?  BAD conduct by the rep.\r\n\r\nWhen I heard back from the rep, she said: \"I have bad news for you -- the job's gone to someone else.\"  Shocked, I asked what became of my \"top pick\" status; she stammered.  Finally, she said she'd “never” tell a candidate he was the \"top pick,\" that she'd told me I'm in the \"top 3.\"  She'd LIED to cover-up her misconduct; I told her I’m filing a grievance against her.\r\n\r\nI then contacted her sup again & asked her where to send my grievance.  The sup told me she'd like a honcho in TA to call me.  I gave her my number & set a time for him to call. The call was brief; I just wanted to know where to send my grievance; he replied that I should send it to him.\r\n\r\nI wrote a detailed grievance against the rep serving under him, including dates/ times & copies of all relevant emails.\r\n\r\nHere's the reply from the TA honcho:\r\n\r\n\"Dr. Mr. ___\r\n\r\nThank you for providing us with feedback about your experience with ___during the recruitment process. Your input is appreciated. We regret that your experience did not reflect the level of customer care that we’re committed to and regret any inconvenience.  We wish you all the best in your professional endeavors.\r\n\r\nBest Regards,\r\n\r\n____\"\r\n\r\nSo, instead of tackling my complaint, this arrogant hack had the gall to attack me, say my customer care skills are sub-par.  My customer care skills were never questioned in either interview, as it is self-evident from my resume, references & many awards that my \"customer care\" skills are top notch and, in one instance, contributed greatly to the saving of a member's life.\r\n\r\nAppalled by L.A. Care's hiring process, I escalated my complaint to a honcho in HR.  I added the honcho from TA to the complaint & cc'ed the CEO.  An employee representing the CEO wrote back, telling me the CEO ordered the HR honcho to look into my complaint against the TA rep & her boss.\r\n\r\nI heard back from the HR honcho; his response was no better than any prior response, DESPITE THE FACT the CEO had ordered the HR honcho to handle the matter properly.  Here’s the HR honcho's \"response\" to my complaint:\r\n\r\n\"Mr. ___, \r\n\r\nYou have previously received a correspondence from us regarding this matter.  We will not be taking any further action nor respond to any further communication from you on this matter.\r\n \r\n ___\"\r\n\r\nMy complaint was blown off by yet another imperious stooge, DESPITE THE FACT that the CEO had told him to treat the matter properly.\r\n\r\nThis is UNACCEPTABLE. \r\n\r\nSo, I put together an e-mail containing all the correspondence between me & the employees of L.A. Care with whom I'd interacted & forwarded it to the L.A. Care Board of Directors.\r\n\r\nAbout a week later, I got a certified letter from a lawyer in L.A. Care's legal dept., a cease & desist  letter, demanding that I no longer contact anyone at L.A. Care or face legal action.  Incredibly, the letter stated, in part: \r\n\r\n\"You applied for a job at L.A. Care and the job offer was made to another individual .... It appears that you are displeased with this result and have made a number of inappropriate communications to various L.A. Care staff, despite L.A. Care's responses to your inquiries.\"\r\n\r\n\"Displeased with the RESULT\"?\r\n\r\nIn NONE of my exchanges with L.A. Care did I say I was \"displeased with the RESULT.\"  Rather, I'd expressed outrage at the hiring PROCESS, & the CONDUCT & PERFORMANCE of a TA rep, a TA honcho, & an HR honcho.\r\n\r\nI’m filing with the CA Bar Assoc a complaint against the L.A. Care lawyer who sent me the libelous C & D letter.\r\n\r\nL.A. Care has some decent folks, but at the upper echelons it’s a dysfunctional, amoral abyss.\r\n\r\nI urge you to STAY AWAY from L.A. Care.", "Interview Questions": "I was asked what I would do to take charge of the Appeals & Grievances dept. within the first 100 days of my employment."}, {"date": "17 Jul 2015", "title": "Project Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jul 2015", "Interview Descriptions": "Very professional panel asked standards questions.  Were very interested in getting people with a health care background, particularly with Medicare and Medi-Cal experienced.  Leading provider of health services to the low-income population of Los Angeles County, over 1.8 million members are enrolled.  Made sure I know the position required hard work, as the organization is presently quite understaffed.  Generally a pleasant experience.", "Interview Questions": "If I was committed to helping low-income people gain access to health care."}, {"date": "16 Jul 2015", "title": "Compliance Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jun 2015", "Interview Descriptions": "Smooth process. My only complaint is that I went through 2 interviews for the position, had my final interview and they decided to\r\ncancel the position due to a strategy change 3 hours beforehand. In the end, I wouldn't want to work for an organization that can't even figure out its own strategic plan.", "Interview Questions": "Compliance is a sales position. True or False"}, {"date": "7 Nov 2014", "title": "Grievance and Appeals Case Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "I submitted my application online, a day later I received a request for a phone interview from a recruiter, I did the phone interview, I spoke about my experience and was told I would receive a request for a face to face interview. I did the face to face interview with the director and manager both friendly and professional, they asked about my current job duties and previous job duties, after the interview, I did a skills test which included, math, reading comprehension, microsoft word, a sample e-mail response and a thank you letter response.", "Interview Questions": "The Microsoft Word test was the most difficult part of the interview"}, {"date": "26 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in May 2014", "Interview Descriptions": "It was a rather informal process. I had 1 interview with someone who later went on to be my preceptor. Everyone was very friendly and made me feel comfortable. They asked typical interview questions. Overall, the interview was conversational and I enjoyed the experience.", "Interview Questions": "Why do you think you're a good fit for the position?"}, {"date": "8 Oct 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jan 2014", "Interview Descriptions": "HR and the departments responded very quickly  to interest. HR does an initial screening and then I was set up with an interview with the hiring manager and a subsequent interview with the hiring manager and hiring director.", "Interview Questions": "What are your current interests and healthcare?"}, {"date": "12 Jun 2014", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at L.A. Care Health Plan in Dec 2013", "Interview Descriptions": "Interview process was fine. Met with 4 people. Staff was helpful through the interview process. Well organized. Interviewers were on time and had the pertinent information readily available. Interviewers questions were clear and to the point. Overall interview experience was positive.", "Interview Questions": "No unexpected questions."}, {"date": "31 Aug 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "Was fair but lengthy because the job I applied for changed and I was hired to do a different job.", "Interview Questions": "Would you be happy doing this job?"}, {"date": "7 Jun 2013", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at L.A. Care Health Plan", "Interview Descriptions": "Very fair and thorough. 1st interview with recruiter, then 2nd interview with HR.", "Interview Questions": "What would your previous supervisor say about you? Discuss a problem that you faced in a previous position and how you addressed the problem.  "}], [{"date": "26 May 2013", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at L.A. Care Health Plan in May 2013", "Interview Descriptions": "The hiring manager was very friendly, and he mainly asked about what I wrote on my resume. He also asked about why I want to apply the position and salary expectation. Most of the questions were common and fair", "Interview Questions": "N/A"}, {"date": "1 Sept 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at L.A. Care Health Plan (Los Angeles, CA) in Jun 2010", "Interview Descriptions": "I was called back three times after the first interview. The recruiter was nice and she asked a series of questions that were relevant to the job. She seemed to understand what the job was (which is more than I can say for most recruiters).", "Interview Questions": "There were some \"what if\" situations presented for me to say what I would do. That was the most difficult in terms of direct expression of experience in action."}]]