[[{"date": "7 Jul 2023", "title": "Marketing Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Royal Society of Chemistry (Cambridge, England)", "Interview Descriptions": "1hour 30 min interview with a task to present. Short process and friendly tone from interviewers, they make you feel extremely welcome and you are able to showcase your skills.", "Interview Questions": "Tell us about your a campaign that you launched that went well."}, {"date": "7 Nov 2022", "title": "Publishing Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Royal Society of Chemistry", "Interview Descriptions": "The interview consisted of a 30 min task comprising of keyword determination, answering a difficult author email etc. The main interview ( conducted by an Editorial production manager and senior publishing editor) consisted mainly of behavioral questions. The interviewers note down everything you say.", "Interview Questions": "Standard behavioral questions: give me an example of a time when you resolved conflict"}, {"date": "29 May 2023", "title": "Director of People and Culture Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Royal Society of Chemistry (London, England) in Jul 2022", "Interview Descriptions": "Very thorough. The process gave me the opportunity to meet current colleagues, learn more about the RSC and ask questions. I appreciate the diversity of the panel - they were tough questions but clearly aimed at bringing out my experience in key areas for the role.", "Interview Questions": "Tell me about a time when you made a mistake, and what did you learn from it."}, {"date": "22 Jun 2022", "title": "Editorial Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Royal Society of Chemistry (Cambridge, England) in May 2022", "Interview Descriptions": "Began with general questions about why I applied for the role and what I could bring to the company. Then moved on to SHARE based competency questions (e.g., give me an example of when you had to deal with negative feedback).", "Interview Questions": "What is it about the company that attracts you to the role? "}, {"date": "6 Oct 2021", "title": "Publishing Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal Society of Chemistry in Sept 2021", "Interview Descriptions": "I applied online and was invited to an online interview (over Zoom) a few weeks later. It started off with a task in which I had 30 minutes to write a response to an email and read 4 papers, picking 5 keywords for 3 of them and writing a short summary for one. The tasks were ok but the time definitely passed very quickly. Then the interviewers (2 of them) asked how I thought I'd done and my strategy with the time limit etc. The next part was 45 minutes of interview which actually overran a bit but mainly due to them answering my questions very fully which was nice. They asked a few questions about why I wanted to work there and then some behavioural questions with follow ups to my examples. I tried to stick to the STAR method when answering. I was quite nervous but the interviewers were so friendly and I found that really improved the atmosphere of the interview. At the end they said they'd be in touch in about 2 weeks (regardless of outcome) but actually phoned me to let me know I was successful less than a week later.", "Interview Questions": "When did you fail to achieve a goal?"}, {"date": "12 Nov 2021", "title": "Publishing Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal Society of Chemistry (Cambridge, England) in Aug 2021", "Interview Descriptions": "Very standard competency questions like examples of working in a team and navigating difficult working relationships. I felt they wanted very specific and well-prepared answers with key words and a lot of detail.", "Interview Questions": "example situation: how would you deal with an unhappy author after rejecting their paper for publication"}, {"date": "10 Jan 2022", "title": "Publishing Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal Society of Chemistry in May 2021", "Interview Descriptions": "Virtual interview, started with 3 tasks to complete in 30 mins - summarise a paper, find keywords in 3 papers, and write an email to an author. Followed by generic interview questions.", "Interview Questions": "What do you think a publishing editor does?"}, {"date": "3 Jan 2021", "title": "Editorial Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Royal Society of Chemistry", "Interview Descriptions": "Interview day included a team work task, individual written assessment and interview questions.  The most difficult task were the written assessments which involved editing, finding keywords and summarizing academic articles,", "Interview Questions": "Describe a time you used your initiative to solve a problem?"}, {"date": "29 Apr 2021", "title": "Manager, Funder Relations Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Royal Society of Chemistry in Nov 2020", "Interview Descriptions": "A little slow (a long time between first and second interview stages without any information about status of application), but otherwise great.  Panel members were all friendly, but asked interesting but clear and relevant questions.", "Interview Questions": "Who do you think RSC's main competitors are?"}, {"date": "26 Nov 2019", "title": "Publishing Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal Society of Chemistry (Cambridge, England) in Feb 2019", "Interview Descriptions": "The application process involved the completion of their online application form. This form involved filling in details regarding personal information, employment history, and modules studied and their respective grades concerning your degree.\r\nI was invited to an assessment centre which included multiple stages. The first stage involved an ice breaker, which allowed you to get to know prospective employees and staff. The second stage was a group task solving a problem. The scenario involved preventing the spread of nuclear radiation via purchasing materials with a limited amount of money. The third stage involved two tests: One was editing a paper for chemical and grammatical errors; the other was writing a brief summary of 5 research papers. Both of these tests had to be completed within one hour. The final stage involved a competency based interview with two senior publishing editors.\r\nI also had the chance to meet staff from all departments at the Cambridge base.", "Interview Questions": "Why do you want to work for the RSC?"}], [{"date": "31 Jan 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal Society of Chemistry (London, England) in Jan 2019", "Interview Descriptions": "Gave my all to work for the RSC to only be told after lengthy interview my experience didn’t match. Could have been told this at cv input level rather than wasting emotional and time investment.", "Interview Questions": "Lengthy pitch process involving presentation "}, {"date": "21 Nov 2018", "title": "Publishing Editor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Royal Society of Chemistry", "Interview Descriptions": "There were about 7 of us who had turned up for the assessment centre.  We were split into halves; half would have their interviews first and the other half would have their tour first.  The interview process was alright, I was interviewed by two people.   The tour felt a bit long but it was interesting getting to talk to current publishing editors.  We then had lunch and carried out 3 tasks - writing an email, editing a poorly written paper and finding key words from 5 papers.  \r\n\r\nMy issue from the experience was that I did not get told whether I was successful or not.  I first sent an email which was ignored and had to call so that I could get some feedback.", "Interview Questions": "Tell me about a time you worked in a team "}, {"date": "17 May 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal Society of Chemistry (Cambridge, England) in May 2018", "Interview Descriptions": "The first interview was a 1.5 hours competency-based interview by the head of the intereted department and the editor of the relative magazine. The environment was relaxed and the interviewer were very nice.", "Interview Questions": "Tell me about a time when you have to solve a communication issue at work."}, {"date": "13 Apr 2018", "title": "Publishing Editor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 months. I interviewed at Royal Society of Chemistry (Cambridge, England) in Apr 2018", "Interview Descriptions": "Applied at the end of December, got an email saying someone would be in touch, but heard nothing until early April, when I was invited to an assessment day the very next week. Day was on Thursday, was offered the job next Friday, but had received another offer in the meantime, and had accepted that one.\r\n\r\nJob sounded fantastic on paper (and has a brilliant salary), however, it was a long way from home, and didn't enjoy the tests (which give a good indication of what the job would be like) on the day.\r\n\r\nAssessment day consisted of a practical group exercise (problem solving), a tour of the building with some talks from current employees, interview and individual exercises.\r\nIndividual exercises were last, and felt tougher than they needed to be, at the end of the very long day. Had to write a reply email to an author, edit a paper with mistakes and inconsistencies everywhere, and do a 'keywords' exercise, where we were given 6 journals, had to write summaries for 2 of them, and pick out key words from the other 4. Made it very obvious that science journals are exceptionally dry to read, and really cemented my decision not to take the job. \r\n\r\nWould recommend applying (and following up if you don't hear anything after a couple of weeks) and going to an assessment day if you get invited, as it really gives a good indication of what the job is like.", "Interview Questions": "How do you felt the group exercise went, and do you think there was anything you could do differently?"}, {"date": "26 Feb 2018", "title": "Publishing Editor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Royal Society of Chemistry (Cambridge, England) in Feb 2018", "Interview Descriptions": "I applied in late December and was invited to an interview in early February. The application process required filling in an online CV template and answering some questions about the RSC and my motivation to work for them. The assessment centre was held at their headquarters in Cambridge with 11 other candidates. I also interviewed for the Development Editor role. They reimburse expenses up to £100 and more if you notify them. The assessment centre was structured like so:\r\nAn introductory presentation on the RSC followed by an ice-breaker exercise.\r\nA tour of the offices and the opportunity to ask current Publishing Editors as well as other staff about the role, organisation and responsibilities etc.\r\nA group exercise where you are watched by a number of assessors.\r\nA lunch where you can talk to the assessors and other Publishing Editors.\r\nAn interview with two interviewers. This was probably around 40-50 minutes and started with questions such as \"why do you want to work for the RSC\", \"How do you feel you did in the group exercise\". Before moving on to my understanding of the role and key skills. Finishing with competency based questions.\r\nIndividual editing exercises, comprised of editing an article ( this contains numerous grammatical and chemical errors), composing an email response to an author and a keywords exercise (summarise in a few sentences two papers and then pick keywords for various papers).\r\n\r\nThe day was really enjoyable, the assessors and staff were very welcoming and approachable. I heard back a week after the assessment centre and was made an offer. They also provide feedback on how you did in each section which is very useful.", "Interview Questions": "Why do you want to work for the RSC?"}, {"date": "3 Oct 2017", "title": "Publishing Editor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Royal Society of Chemistry (Cambridge, England) in Sept 2017", "Interview Descriptions": "Application required a CV and filling in some question responses online. I applied in late July and was invited to an assessment day in September. \r\n\r\nThis assessment day took place at their HQ in Cambridge with 10 other candidates. The day was structured as follows: \r\n\r\n- An introduction presentation and a brief \"ice-breaker\" type game - very relaxed. \r\n- A tour of the offices and a chance to ask Publishing Editors and other staff questions about the role and organisation. \r\n- A group exercise in which we were watched by around 10 assessors. \r\n- A buffet lunch with some of assessors. \r\n- An individual interview with 2 interviewers. This was around 45 minutes and began with questions regarding the role and how much I knew about the RSC, followed by competency based questions. Competency questions were generally okay if you followed the 'STAR' approach to answering!\r\n- Individual tests (around 1hr 45). This involved editing part of an article (which was literally full of grammatical and chemical errors), writing an email response and a keywords exercise (which involved picking out keywords from various articles, in order to contact desired peer review members). \r\n\r\nAll in all, the day was really enjoyable. All the assessors were lovely and the company offices were very impressive. I heard back a week after the assessment centre and was made an offer.", "Interview Questions": "Tell us a bit about the role, what do you think you'd be doing as a Publishing Editor?"}, {"date": "24 May 2017", "title": "Publishing Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal Society of Chemistry (Cambridge, England) in Mar 2017", "Interview Descriptions": "Full day assessment centre:\r\n-Introductory presentation\r\n-Tour of offices with short talks by current editors\r\n-Group problem-solving task\r\n-Lunch with current editors with the chance to chat informally about the RSC, the role etc.\r\n-Competency based interview\r\n-Written tests\r\n\r\nInterviewers were friendly and made every effort to put interviewees at ease.  There were about 12 people at the assessment centre, split into two groups who take turns with the tour/group task in the morning and again with the interview/tests in the afternoon.", "Interview Questions": "What can you tell us about the role you are applying for"}, {"date": "21 May 2017", "title": "Editorial Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Royal Society of Chemistry (Cambridge, England) in Mar 2017", "Interview Descriptions": "Online application, two-week period to interview offer and then one week until the first interview. First-interview follows the traditional behavioral based questions with an added emphasis on the SHARE method of answering not STAR.  Interviewers take notes constantly so be prepared for that. Very pleasant, relaxed atmosphere with an emphasis on you as an individual.  Second round interview after six weeks from first application- which may be inconvenient. Editorial exercise and customer-based email responses to complete in a short time. Overall, very friendly staff and great looking office.", "Interview Questions": "What are our barriers to success?"}, {"date": "18 Feb 2017", "title": "Publishing Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Royal Society of Chemistry (Cambridge, England) in Feb 2017", "Interview Descriptions": "One day assessment centre consisting of a group exercise to assess teamwork and communication, a tour around the offices (v useful as helped with later questions in the interview), lots of time to chat to current publishing editors, an interview and a set of three individual exercises. The exercises consisted of editing a journal article for grammatical, spelling and chemical errors, a keyword test relating to six different journal articles and an exercise where the candidate had to write fictional emails to various contacts about grievances or complaints. I enjoyed the whole process - all assessors very friendly and welcoming, all tasks seemed relevant and helpful and plenty of time to find out more about the role itself.", "Interview Questions": "Describe a time in which you had to work to strict deadlines, and how did you cope with this?"}, {"date": "15 Aug 2016", "title": "Publishing Editor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Royal Society of Chemistry (Cambridge, England) in Jul 2016", "Interview Descriptions": "The interview process took a whole day and consisted of a group exercise, individual exercises, a competency based interview and a tour of the Royal Society of Chemistry in Cambridge.\r\nThe group exercise was a typical problem solving exercise and took roughly 45 minutes. This exercise was to test your ability to work in a team, general communication skills and ability to plan. This was a fun exercise and the best part of the day.\r\nThe competency based interview was the usual type of questions, \"Tell me a time when...\", but the company did not inform candidates in which style to answer the questions. Candidates were penalised for using a STAR not SHARE approach with the interviewers not correcting/prompting myself to switch style and explain the SHARE approach. The interviewers were also unresponsive and unfriendly and made the atmosphere hostile and unwelcoming.\r\nThe tour of the Royal Society of Chemistry, in principle sounds exciting, however consisted of a tour around several offices and was unnecessary as everyone knows what an office looks like. In addition, this tour added another hour onto an already long day. Although this tour would have been fine if done at the end of the day. The tour did allow the opportunity to ask staff about the company, but again was pointless as directly after the tour there was a 90 minute section to ask employees about the company!\r\nThere were three individual exercises at the end of the day which were: editing a journal, picking keywords from 6 full length journals and writing two emails, all within 90 minutes. \r\nThe editing a journal was a good exercise and allowed candidates to understand what the role would involve. However, the journal had been altered so significantly, by the interviewers, that it was almost impossible to follow and if had been received by a real editor would have been binned immediately. \r\nThe objective of the keyword exercise was not clearly explained and was an unfair attempt by the interviewers to ascertain whether candidates had a \"broad chemistry knowledge\" despite the fact the exercise was very subjective. An exam or writing an abstract would have been more appropriate, with most candidates being unhappy with this task. \r\nThe final exercise involved writing two emails to customers to understand if the candidates written communication was acceptable. Again the explanation of what to do was poor and candidates were given too little information to write an appropriate email response. This task also involved writing the email by hand, which is not the usual way of working, so candidates who have poor hand writing and spelling were penalised. Despite the fact these issues would not have been a problem if the exercise was done on a computer.\r\nFinally, the company failed to send me an email or phone me with their decision/feedback. I had to both email and ring the company to ascertain whether I had been successful.", "Interview Questions": "Tell me a time when you miscommunicated and how did it make you feel?"}], [{"date": "23 Jan 2015", "title": "Publishing Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Royal Society of Chemistry", "Interview Descriptions": "We had a full day interview consisting of a group assessment, an individual exercise, a tour of the RSC and then an individual interview.  The group assessment was a problem solving task that you had to work as a team to accomplish as you were being observed by a panel of employees.  The individual exercise involved proofreading an RSC article, finding keywords from a series of articles and responding to emails to the editor.  The individual interview last 45 minutes.", "Interview Questions": "They were all typical interview questions: tell me a situation when you worked in a group/when a problem arose?"}, {"date": "27 Sept 2018", "title": "Publishing Editor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal Society of Chemistry in Jan 2015", "Interview Descriptions": "The interview is a day-long process, with actual interviews, group activities as well well as personal exercises. The interview is very streamlined, which does not feel like a conversation, but rather like an oral exam. One has to say the relevant words/keywords to appeal to the interviewers.\r\nAlso, they present parts of the job in a more appealing way and sometimes fallacious way (as mentioning conference attendance as being part of the position)", "Interview Questions": "How would you solve a conflict?"}, {"date": "16 Jun 2017", "title": "RSC Graduate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Royal Society of Chemistry (Cambridge, England) in Jun 2013", "Interview Descriptions": "Assessment Day which included a morning team building activity, lunch with existing role holders, an individual task based around project management followed by a competency based interview. I was interviewed by two staff members. There was 11 other individuals on the assessment day and I was surprised at the range of backgrounds, feeling the most inexperienced myself.", "Interview Questions": "Give an example of a time you disagreed with someone and how you resolved it."}, {"date": "19 Jun 2017", "title": "Treasury Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Royal Society of Chemistry (Cambridge, England) in Feb 2013", "Interview Descriptions": "This was arranged through an agency but was organised very quickly. The first interview was very thorough and it was only a few days before the second interview was requested and arranged.\r\nThis included a tour of the building and gave me a chance to find out a lot about the company", "Interview Questions": "What did I know about the RSC"}]]