[[{"date": "30 Jun 2023", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Application Submission: The process usually begins with the candidate submitting an application, which includes a resume/CV and sometimes a cover letter. This is the initial step for the employer to evaluate the candidate's qualifications and decide whether to invite them for an interview.", "Interview Questions": "Panel/Team Interviews: In many organizations, candidates are subjected to panel or team interviews, where they meet with multiple interviewers at once. This allows different perspectives to be gathered and provides an opportunity for the candidate to interact with potential team members. The interviewers may ask a mix of technical, behavioral, and situational questions, as well as evaluate the candidate's ability to work well within a team."}, {"date": "23 May 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University", "Interview Descriptions": "The interview process can vary depending on the organization and the position being applied for, but I can provide you with a general overview of a typical interview process. Here are the common stages involved: Application: The process usually begins with submitting an application, either online or through other means such as email or postal mail. This typically involves providing a resume or CV and sometimes a cover letter. Screening: Once the applications are received, the hiring team or recruiters will review them to identify candidates who meet the basic requirements of the position. They may screen applications based on qualifications, experience, skills, and other relevant factors. First-round interview: The selected candidates are usually invited for a first-round interview. This interview can be conducted in various formats, such as in-person, phone, or video (e.g., Skype or Zoom). The purpose of this interview is to assess the candidate's suitability for the position, their experience, skills, and cultural fit within the organization.", "Interview Questions": "Tell me about yourself will be the first Question"}, {"date": "20 Feb 2023", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Drexel University", "Interview Descriptions": "2 part interview. 1st part was a general screening call. 2nd part was a group interview, but it took awhile to get an invite because of heavy application volume. The 2nd interview was a group interview via zoom.", "Interview Questions": "Name a time that you were placed out of your comfort zone and what did you learn from it."}, {"date": "2 Feb 2023", "title": "Assistant Teaching PRofessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Phone Interview - 1st round, general screen Group Interview - 2nd round, with team and more behavioral based questions 1v1 Interview with Directors - 3rd round, questions specific to job", "Interview Questions": "How would your past co workers describe you?"}, {"date": "23 Jan 2023", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Drexel University", "Interview Descriptions": "Very common PhD interview questions. Three questions were asked. Why do you want do phd? Why do you choose our school? What’s your Research interests? And do you have any questions?", "Interview Questions": "Very common PhD interview questions. Three questions were asked. Why do you want do phd? Why do you choose our school? What’s your Research interests? And do you have any questions?"}, {"date": "21 Jan 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Drexel University", "Interview Descriptions": "There was a phone call, a zoom session, a zoom session with their colleagues of 3 people, and then another phone call. It lasted two months, but communication between each interview was greatly delayed.", "Interview Questions": "How do you keep organized?"}, {"date": "9 Jun 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University (Philadelphia, PA) in Jan 2023", "Interview Descriptions": "Sign up online, schedule an interview, meet up and talk for 30 minutes, they will let you know immediately afterwards, Its more like an greeting than an actual interview so dont worry about it at all, just talk about what you like and etc", "Interview Questions": "Why do you want to work at drexel"}, {"date": "7 Dec 2022", "title": "Athletics Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Was well-planned and thought out Kept it very conversation based and enjoyed the process from interviews 1 to 3. The interviewers were kind and asked a diverse set of questions.", "Interview Questions": "What makes you the right candidate for this role? What innovative ideas will you bring to drive engagement?"}, {"date": "27 Sept 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University", "Interview Descriptions": "The Interviews were great. They let you know everything about the job. They set you up with an interview with your primary coworkers so you get a feel for the work environment. They kept the interviews very casual yet professional. They were open and honest about the applied position. You can tell the people/current staff cared for their work.", "Interview Questions": "What are you looking for in this job?"}, {"date": "5 Oct 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Drexel University (Delran, NJ) in Sept 2022", "Interview Descriptions": "I filled out the online application for Drexel University and about the next week I got an e-mail to see when we could talk for a phone interview.  On the day we had scheduled for the interview, about 50 minutes before the time I was scheduled the woman called and apologized for being a few minutes tardy ( I think she must have had our interview time on her calendar an hour early).  I was available then, so I didn't say anything and just went about doing the interview early.  We spent about 20 minutes talking about the position and made sure I would be willing to travel as this is a key responsibility of admissions.  Towards the end of the interview, we discussed the salary for the position as well as the work location and potential hybrid work.  She shared that the next step would be with a team via Zoom and I would be contacted within the next couple of weeks.  About 3 and a half weeks later I received an e-mail from HR that another candidate was chosen.", "Interview Questions": "If I were to speak to a previous supervisor of yours how would they describe your strengths and weaknesses?"}], [{"date": "29 Oct 2022", "title": "Associate Director of Corporate Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Drexel University (Philadelphia, PA) in Sept 2022", "Interview Descriptions": "Furst interview with HR was great. Second interview was cancelled because the director didnt show, then in the rescheduled interview never apologized and proceeded with unprofessional responses to my answers during the interview. I am sad for whoever got the job to work with this director.", "Interview Questions": "What is your 5-10 plan for your career."}, {"date": "8 Aug 2022", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Drexel University", "Interview Descriptions": "We interviewed in a group setting and they described our job duties in the equipment room. They gave us a tour of the whole building and the office and asked us about our work experience in sales and questioned our customer service skills.", "Interview Questions": "What is your biggest strength and your biggest weakness?"}, {"date": "10 Jul 2022", "title": "Grader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Drexel University", "Interview Descriptions": "It was a friendly interview. Asked about interests and my program. Got back with response soon after the interview. Received an interview request after two or three days of emailing my resume", "Interview Questions": "What are you majoring in"}, {"date": "31 Jul 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Drexel University (Phila, PA) in Jun 2022", "Interview Descriptions": "Three interviews. The first was a 20 minute phone screen with HR. I assumed I didn't do well because I didn't hear back for awhile. Then, I did hear back! My second interview was a scheduled 3-hour interview over Zoom where I met with 6 different people (it ended up lasting 2 hours). The final interview was a one-hour phone call with the hiring manager. The entire process, from sending in my resume to receiving the offer was almost 3 months.", "Interview Questions": "What does diversity and inclusion mean to you?"}, {"date": "24 May 2022", "title": "Assistant Research Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "It was a simple 30 min interview with questions regarding skills related with the work. There were three people involved with the interview, and one of them was a manager of the team.", "Interview Questions": "1. Can you tell me the skills related to this position?"}, {"date": "4 May 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Positive Experience, easy interview. Must be able to talk about topics on your resume. Make sure you have research experience if you are going to do STEM or have an internship under your belt.", "Interview Questions": "When are the ideal hours for you to come to the office?"}, {"date": "19 Jan 2022", "title": "Research Support Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Drexel University", "Interview Descriptions": "i applied for the co-op stuff and i got an offer for the interview and then I talked with some professors and current workers. Talk about my interest and answer some question for around 30 minutes", "Interview Questions": "how do you think of bitcoin"}, {"date": "9 Mar 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Drexel University (Philadelphia, PA) in Jan 2022", "Interview Descriptions": "In order to get the TA position in next quarter, You have to email the professors of the department that you are interested in the last two weeks of your current quarter. You can also email the departmental heads. If there is a vacancy then the professor will reach out to you directly to have a zoom call. If he finds you as a perfect fit then he can finalize you as his/her TA.", "Interview Questions": "do you have previous teaching experience?\r\nWhat is your background?\r\nDo you know how to use BB learn?"}, {"date": "23 Nov 2021", "title": "Instructional Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "The hiring manager reached out to me to ask my salary expectations. Based on this, I assumed I was a candidate they would interview however it turns out I was their \"second choice\".  They need to be more forthcoming about this in the future. There's no point in reaching out to candidates if you're not going to actually interview them.", "Interview Questions": "N/A"}, {"date": "18 Oct 2021", "title": "Behaviroal Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Drexel University", "Interview Descriptions": "Great process, they were very present and created an atmosphere that was welcoming. Asked a decent amount of questions and were open to answering all of mine. Short process, only 2 interviews total needed.", "Interview Questions": "what was your past experience working with children?"}], [{"date": "15 Sept 2021", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "The interview was comfortable and relaxed. I was asked a series of questions and was able to ask questions to the faculty in return. The entire interview lasted between 30-45 minutes.", "Interview Questions": "What draws you to Drexel? "}, {"date": "5 Aug 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "what is your research interest? and whether could endure the high stress during the work, also the English level whether good enough or not, and the personality, whether could be a good colleague in the future", "Interview Questions": "what is your research interest?"}, {"date": "20 Jul 2021", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University in Jul 2021", "Interview Descriptions": "Called me for a phone interview. The hiring manager talked about soo many random this other than the actual position. Said they would reach out in a week for the next steps but never did. No follow up or anything. Very misleading", "Interview Questions": "Why did you choose to go into higher Ed?"}, {"date": "23 Jun 2021", "title": "Admissions Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Applied online, had a phone interview, then called in for an in-person interview. Conversation was straight forward and focused on the culture of higher education. Seemed like a good work environment.", "Interview Questions": "Why do you want to work in higher education?"}, {"date": "27 Apr 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Drexel University (Phila, PA) in Jun 2021", "Interview Descriptions": "The PI seemed incredibly interested in my skills, but seemed to overestimate what I was capable of, even after I corrected him during the interview. He asked mainly about academic experience and my future goals.", "Interview Questions": "How do you think this job will contribute to your future plans?"}, {"date": "20 May 2021", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Drexel University", "Interview Descriptions": "Submit a resume and talked about my qualifications and how I performed in that subject matter and overall it was a easy interview.  The staff and interviews were very nice and straight forward as well as to what they were looking for.", "Interview Questions": "Why do I want to be a TA "}, {"date": "5 May 2021", "title": "Tech Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "Very laid back interview, they want to get a chance to get to know you more and what your background and skills are. As a very well known prestigious university, do NOT ghost interviewers, it makes you look really unprofessional. Never heard back from them.", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "21 Nov 2021", "title": "Financial Aid Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Drexel University (Philadelphia, PA) in May 2021", "Interview Descriptions": "The only time that I could schedule a video interview was during my current work hours. I took PTO in order to stay home and interview for this position. All four people on video said I could reach out with in questions. I followed up a week later with no response and then another week and silence. Finally, after one month I got an email HR informing me I did not get the position. I was great full to finally get a response but I was disappointed to be so blatantly ignored by all four people in the interviewing process. The job has been re posted so beware the lengthy interview process and the unprofessional communication.", "Interview Questions": "What do you think the most challenging part of this job would be?"}, {"date": "13 Apr 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Drexel University", "Interview Descriptions": "The process was very simple. I had a virtual, informal interview with the professor I was to assist. They asked me about my qualifications and why I wanted to TA for their class.", "Interview Questions": "Why do you want to be a TA? "}, {"date": "5 Mar 2021", "title": "Associate Diretor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "They called me after we emailed a bit. I think Drexel is a nice place and I have heard others work there who like it. Definitely worth a look if you want to be in higher ed.", "Interview Questions": "Basic and straight forward interview"}], [{"date": "26 Feb 2021", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Got an email and called in for a phone screen. Hiring manager said that she will follow up in a week - did not hear from them again. Word of advice: Don't go into the interview blind. Know the experience of your candidate. And don't ghost, it looks bad on you and the University.", "Interview Questions": "How does your experience fit into this role?\r\n"}, {"date": "27 Oct 2021", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Drexel University (Philadelphia, PA) in Mar 2021", "Interview Descriptions": "The interview process was straightforward and the HR reps were kind. After an initial screening call I received a brief follow-up interview call with another HR representative. I did not advance after that point.", "Interview Questions": "Most of the questions I received were not about the actual job, the department, or even my experience. This was surprising since the first two calls were basically screening interviews. There were (what felt like trick) questions like \"define diversity without using the word 'different'\" which felt like there was an implied right/wrong answer. This made the early interview process feel more like playing taboo rather than a mutual conversation about determining if there's enough fit between the candidate and the position in order to move forward. \r\nOther questions tested my knowledge on the priorities of the broader units that the office I applied to was located in.  Although I did my research, I could only glean superficial information about the university's larger development goals for example. Ultimately, I was a bit surprised that none of the questions were about the actual work, skills required, or my experience or approach to the work. "}, {"date": "19 Jan 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University in Jan 2021", "Interview Descriptions": "Initial interview with supervisor, and then an interview with the search committee. Standard questions, and great communication about the process. All interviews virtual due to the pandemic. The process was swift for this position.", "Interview Questions": "What does diversity mean to you?"}, {"date": "20 Nov 2020", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Develop Front end help with other tasks required by the manager. Using a framework like ReactJs and Angular. Also using bootstrap and other css framwork. After all, it is not that diffficult. As long as you prepare well, you will be fine", "Interview Questions": "Describe about yourself and what is ur major"}, {"date": "16 Jan 2021", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA) in Nov 2020", "Interview Descriptions": "Apply from Drexel website then HR contact. They set up a phone call. Jump in experience right the way, don't care anything about yourself. Then if you don't have any question will just hang up", "Interview Questions": "Tell me about your experience in the past"}, {"date": "10 Sept 2020", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Drexel University", "Interview Descriptions": "I was an internal hire, so it was pretty simple.  I was brought in for an in-person interview with the individuals on the team I was being hired to.", "Interview Questions": "How do I see myself contributing to the team a year from now?"}, {"date": "19 Jan 2021", "title": "Associate Director of Digital Strategy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA) in Sept 2020", "Interview Descriptions": "I applied in May and didn't hear back about an interview until around September. From there, the interview process took about a month and a half. Past the HR screening, the interviews with the team consisted of 10+ people. Some questions were serious and some were silly. Overall it was a neutral experience. Job interviewer was poor at responding to emails.", "Interview Questions": "If you had to take a historical figure to dinner, where would you take them?"}, {"date": "21 Aug 2020", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "There were 3 stages in the interview. First I talked with the Ph.D. Coordinator. Then I met some more faculty members and current Ph.D., students. Last, I talked with the Graduate Coordinator.", "Interview Questions": "Do you understand what the Ph.D. life is going to be like?"}, {"date": "30 Jul 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "The interview process is very comfortable.  The manager is very kind and professional. you can ask a lot of questions.  The first screen is very important. you have to prepare what you need to do.", "Interview Questions": "Why did you choose Drexel"}, {"date": "11 Mar 2020", "title": "Orientation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "I had submitted an online application and then was contacted via email to come in for an interview . It was a group interview where we completed various activities and tasks together. We were split into groups of about nine or ten people. They were looking for people who stood out within the groups. They called and emailed to let us know who was selected as either orientation leaders and orientation assistants.", "Interview Questions": "Come up with a welcome packet for incoming students. What would we put in it?"}], [{"date": "27 Feb 2020", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "An email was sent if you signed up. You go over your work ethic and are trained if the RDC thinks you can be trained. Your student benefits determine if you are work study (hourly salary goes directly towards tuition) or if you are wage (can do direct deposit for paychecks). They're relatively short staffed so they're usually looking for applicants.", "Interview Questions": "Do you regularly go to class on time?"}, {"date": "18 Dec 2019", "title": "Coordinator of Events Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Drexel University (New York, NY)", "Interview Descriptions": "Two phone call interviews and an in person interview with a panel of 4 people. The entire panel just wrote down my responses the whole time and hardly looked me in the eye. They told me afterwards that my responses were not extensive enough. I feel like that was partly due to the fact that there is no conversation being held with the interviewers. It's basically like having a video interview with prompts, but in front of real people. Probably a good idea to have several stories prepared for typical interview questions.", "Interview Questions": "Do you have experience working with diverse populations?"}, {"date": "1 Oct 2019", "title": "Drexel Central Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Had a phone screen with the hiring manager first. Next step, met with a team of peers and then supervisors (90 minutes total). Never heard back after the interview (yes or no).", "Interview Questions": "What is something about you we don't know from your resume? "}, {"date": "20 Sept 2019", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Drexel University", "Interview Descriptions": "Phone call with HR, during the same phone call an in person was set up.  During in person interview, I was interviewed by a group which included individuals from various departments (one of which was only at Drexel for 1 month- which I thought was a bit strange).  They asked me scripted questions and they all wrote while I spoke - not one person really looked at me while I spoke.  Not sure why it's important to have all 6 people writing my answers.", "Interview Questions": "You are in the middle of a project and you've been asked to  take on another project that would take priority over the one you are currently working on.  How do you go about getting the project off the ground?"}, {"date": "8 Jul 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "I first had an in person interview with representatives at a professional conference. I was then called for a 1/2 hour interview over the phone. Following that, I had a job site interview that lasted an entire day, where I presented my research in a formal presentation, met with the selection committee, dean, and assistant dean, and met with a wide number of faculty members. After the daylong interviews and presentation, I was taken out to dinner and then dropped off at my hotel.", "Interview Questions": "What makes your research unique?\r\nWhy do you want to work at Drexel?\r\nWhere do you see your research program  in 5 years, 10 years?\r\nWhat is your teaching style?"}, {"date": "10 Jun 2019", "title": "Recreation Center _ Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University (Philadelphia, PA) in Feb 2019", "Interview Descriptions": "A brief 45-minute interview where were discussed my experience in the world of social media marketing. They placed an emphasis on my knowledge about the Drexel Recreation Center. They were looking for specific skills so it is better to email them to ask them exactly what they are looking for.", "Interview Questions": "Tell us about yourself."}, {"date": "13 Dec 2018", "title": "Ph D Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "the process was cool I got introduced to a lot of different professors and was able to see the facilities then i sat with some staff and they asked me question and i talked about my previous research then i had lunch with some of the students", "Interview Questions": "What line of research are you interested in. "}, {"date": "28 Oct 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Drexel University (Philadelphia, PA) in Aug 2018", "Interview Descriptions": "Great people!! Very smooth and informative interview. The questions weren’t to difficult to answer at all.  The team I spoke with seem to be extremely nice and aware of the type of employee they wanted to join their team. Overall a very nice experience.", "Interview Questions": "Why do you want to work for Drexel, specifically. "}, {"date": "28 Jul 2018", "title": "Assistant Dean/Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "Phone screen first. Got called for an in person interview a few weeks later - was an all day interview (9am-3pm). Interviewed with several different panels - appx. 15 people in total. Included a one on one lunch as well. Was told would hear back either way - but after 6 months and a few follow up calls and emails (no answer to any) I have not heard back. Job is still listed as open and in process in my application portal.", "Interview Questions": "A variety of different questions were asked by the panels"}, {"date": "27 Jun 2018", "title": "Residential Desk Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Drexel University", "Interview Descriptions": "The interview could be either 2 separate interviews  on the same day or one interview with 4 people.  In the interview there could be your potential supervisor or co-worker for that building.", "Interview Questions": "What is your work style? \r\nAre you able to work in a diverse workplace? If so, How and what do you like about it. \r\n"}], [{"date": "18 Nov 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Drexel University in Mar 2018", "Interview Descriptions": "Very open and easy questions, they sus out whether you are interested in the work, technical aspects are questioned to a minimum, your background is asked for as well. Prepare a good code base if it is technical and they wont ask more than that", "Interview Questions": "Q: What past research exp do you have?"}, {"date": "26 Jan 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Drexel University", "Interview Descriptions": "The hiring process is quite easy. You must show the passion and interest in the ongoing project. You must convince that professor that you will go beyond your comfort zone to deliver the project", "Interview Questions": "What background do you have related to this position?"}, {"date": "29 Jun 2018", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Drexel University (Philadelphia, PA) in Jan 2018", "Interview Descriptions": "Professors talked about their research, then she asked me why I wanted to work here, what my skills are and if I'm willing to dedicate time to learn. She then told me what I had to learn if I would want to work here", "Interview Questions": "Why do you want to work in this lab?"}, {"date": "27 Oct 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University in Nov 2017", "Interview Descriptions": "The interviews were virtual with staff, standard one phone and one video chat. Interviewed over the course of two sessions with leadership from the department and students who would interact with the role", "Interview Questions": "What was my experience working with college students "}, {"date": "10 Oct 2017", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Drexel University", "Interview Descriptions": "Good, very informative . The recruitment coordinator was very friendly and answered all of my questions with no problem.  They gave more information beyond what I asked.  There was a phone screen, in person interview with the director of enrollment and another interview with the president.", "Interview Questions": "How does your current role translate to the position applied for"}, {"date": "16 Apr 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Drexel University (Philadelphia, PA) in Oct 2017", "Interview Descriptions": "It took almost a week. Regular follow-ups are necessary. Questions will be technical, it's better to be prepared on technical stuff in your resume. There will not be any behavioral type questions.", "Interview Questions": "Do you have experience working with filters?"}, {"date": "26 Sept 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Drexel University", "Interview Descriptions": "It was a brief interview and I was selected by my professor who was impressed with my work in lab and classroom.  I was asked how to manage a class, conduct tests, evaluate papers and prepare food samples.", "Interview Questions": "Can you manage a whole class?"}, {"date": "24 Aug 2017", "title": "Director, Program Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Drexel University (Phila, PA)", "Interview Descriptions": "Very straightforward, was based on several years of experience with Drexel as an adjunct faculty member.  Interview was held in-person, lasted approximately 2 hours.  Focused on growth in enrollment in the program up to the date of interview, and ways to grow enrollment if hired.  Coverage of certain benefits, as affected by part-time status, was also discussed in detail.\r\nAlso met the staff (Program Manager), and other members of the College of Engineering.", "Interview Questions": "When are you available?  What are your salary requirements.  Are you available for full-time or part time?  How amenable are you to business travel?  How confident are you that you can develop a marketing plan to increase enrollment.  Can you continue to teach courses while you serve as Program Director?   Are you aware that Part-Time status may impact your eligibility for certain benefits?  Are you aware that full-tae employment for 10 or more years will make you eligible for health care coverage after you retire from Drexel University?"}, {"date": "16 Aug 2017", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "I submitted my application and waited maybe a day or two before my boss called me. I came in a few days later to interview. I took a test to demonstrate that I knew how to use Microsoft Office Suite, but I think HR has told everyone at Drexel that they can no longer do that in the interview process. Then I met with my boss. We went over salary expectations at the end of the interview and she said the position paid $6,000 more than what I told her I wanted, which was great. Obviously, I took the job.", "Interview Questions": "What are your salary expectations?"}, {"date": "24 Jul 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University in Jun 2017", "Interview Descriptions": "I applied online and was contacted for an interview within a week.  I had my interview over the phone with the director of clinical research services, the director of research from the hospital site the position was assigned to, and another research coordinator.  They asked the standard research questions about my skills, type of studies I had previously worked on, and different trainings I had.  They said they would get back to me within a week about their hiring decision but I never heard back from the director at Drexel.  I emailed her twice and called 3 times and she never returned any of my emails or calls.  I finally had to call the director at the hospital to finally hear that they had already made a hiring decision. She seemed surprised that the director from Drexel never got back to me.", "Interview Questions": "Have you had IATA training?"}], [{"date": "9 Mar 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Drexel University (Philadelphia, PA) in May 2017", "Interview Descriptions": "Two interviews over a week-long period. One casual interview with the former graduate assistant and one formal interview with the program manager. Job offer was given the same day as the second interview.", "Interview Questions": "Why do you think this job will be a good fit for you?"}, {"date": "21 Jun 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA) in Feb 2017", "Interview Descriptions": "Simple and direct. Asked about experience with the given task at hand. Overall a positive experience. But didnt get paid till date. so thats the caveat. Interview experience was good though", "Interview Questions": "Project experience "}, {"date": "16 Nov 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Drexel University (Philadelphia, PA) in Jan 2017", "Interview Descriptions": "In person, test, 3 rounds.  It is not very hard, but should take time to prepare all the standard test and the interview. It normally take 3-4 weeks.", "Interview Questions": "Why you? Why this position?"}, {"date": "1 May 2018", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University in Jan 2017", "Interview Descriptions": "3 part process: phone screening, panel interview, interview with VP and Executive Director. Panel interview was most intense part, it was with 4 people, a mix of future coworkers and future direct supervisors.", "Interview Questions": "How do you keep up with news of the Higher Ed industry? "}, {"date": "28 Sept 2016", "title": "Assistant Director of Recreation Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Drexel University", "Interview Descriptions": "wasn't considered for the position after doing it without the title for 2 years. Was then asked to be part of the interview process since I knew exactly what was needed. Finally after choosing someone they wanted me to train the new hire.", "Interview Questions": "How do you connect wth students"}, {"date": "17 Apr 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Drexel University (Philadelphia, PA) in Sept 2016", "Interview Descriptions": "Interviewed in three parts: phone interview with position's supervisor, in-person interview with position's reports and other departmental directors, in-person interview with position's supervisor.\r\n\r\n\r\nRecommended - be extremely careful before accepting a position here. No one is going to answer your question about company culture with, \"Well, there's a lot of pressure, some hazing, frequent conflict that escalates to the next level of managers, and a lot of people getting asked to resign or be fired.\"\r\n\r\nSeverely regretted taking this job, but it was impossible to know that there would be little to no investment in new hires, a supreme sense of mid-level staff being expendable, frictional interdepartmental politics, gaslighting tactics, student prejudice in administration, and the termination of 3 new hires within their first five months.\r\n\r\nInterview process does not do enough to give you the information you need before you decide to accept or decline the job offer. Do your research and please do not leave something good for this place. It is better to be patient.", "Interview Questions": "What can you tell us about your approach to customer service?"}, {"date": "25 Sept 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University in Sept 2016", "Interview Descriptions": "Basic application needs to be sent - prepare resume indicating teaching exp as well as subject knowledge and corresponding grades .\r\n\r\nIf they are interested they will contact you and organize a meeting with the Professor . If the timelines, duties and responsibilities match then they usually confirm your employment.", "Interview Questions": "What are you studying at Drexel?"}, {"date": "17 Feb 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Drexel University (Philadelphia, PA) in Sept 2016", "Interview Descriptions": "Email with professor individually. If lucky enough then professor will schedule a meeting with you in person, or program head in the department. Academic background will be checked. After interview, immediate hire will be conducted, but specific courses to teach can be rearranged based on department's need and professors preference", "Interview Questions": "Academic experience, research experience "}, {"date": "8 Aug 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "There was no interview process, really. I applied and the professor took me because I did great on the subjects at my first year. Some subjects may need PhD students who might need interview. As long as you show that you are good at communication and have a good understanding about the subject, I think you will be fine.", "Interview Questions": "What was your GPA last year?"}, {"date": "29 Jun 2016", "title": "Instructional Design Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University in Jun 2016", "Interview Descriptions": "First, the HR rep sent out a mass email to \"undisclosed recipients\" asking for a time for a phone interview. Before I had a chance to respond, the HR rep called me asking for a time. I said, \"Any time after noon\" and she replied, \"So how does 10:00 am sound?\" I had to accept because I was desperate for a job.\r\n\r\nSo, the next morning, she calls. It was one rapid fire question after another! It was horrible!\r\n\r\nA notable conversation: She asked about my salary range, and I asked her what the position paid. She said that she didn't know, the position was just opened and this specific question is to weed people out. I replied that I didn't want to price myself out of a job, and she told me that my application would go to the bottom of the pile for not answering the question.\r\n\r\nAnd after a few more rapid fire and invasive questions, I stopped the phone screen and said I was no longer interested.", "Interview Questions": "What is your salary range?"}], [{"date": "8 Feb 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Drexel University in Jun 2016", "Interview Descriptions": "A lot of people in the interview. Asked a lot of questions that were standard interview questions. Having that many people in the interview was overwhelming but most were nice and understanding", "Interview Questions": "How would you handle (sample situation)? "}, {"date": "10 Jul 2017", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Drexel University (Philadelphia, PA) in Jun 2016", "Interview Descriptions": "I had interviewed for internal projects. Very supporting staff and very good projects are going on.  I am not sure if this review is applicable. There are many good grants that this university has received recently.", "Interview Questions": "Your experience in a qualitative analysis? Any initiative you had taken as a student"}, {"date": "16 Feb 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Drexel University (Phila, PA) in Jun 2016", "Interview Descriptions": "It was a very relaxed setup for the interview. The professor was waiting ahead of time for me and he was very congenial and pleasant. He inquired about my current work and how I manage my education along with it.  He invited me to have a look around in the lab and introduced me to the syllabus before starting the interview.", "Interview Questions": "Ability to manage a classroom, Previous experience in teaching, Proficiency with the subject matter"}, {"date": "30 Jul 2017", "title": "Student Lactation Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Drexel University (Philadelphia, PA) in May 2016", "Interview Descriptions": "There was no interview -- I found out about this program because I was working on my degree in Nutrition & Dietetics. Full background check will be conducted and updated vaccinations are necessary as you are working in a hospital for part of your internship.", "Interview Questions": "N/A"}, {"date": "28 Feb 2017", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Drexel University (Philadelphia, PA) in May 2016", "Interview Descriptions": "I had an initial interview on Skype with two of the faculty. I later had a visit to Drexel to meet the group members and give a talk about my research. I had one-on-one talks with all faculty members of the group and lunch with some of the students.", "Interview Questions": "Do you like working with students?"}, {"date": "21 Apr 2016", "title": "Lab Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University (Philadelphia, PA) in Apr 2016", "Interview Descriptions": "Underwent a 30 minute phone interview with the PI. We discussed my background in research (I am graduating from undergrad) in the two labs I have worked in. I was asked basic questions about my experiences in research and challenges I have faced in research. Along with questions about what I have most liked and disliked about research.", "Interview Questions": "Can you describe what you did in your other research positions?"}, {"date": "16 Aug 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA) in Apr 2016", "Interview Descriptions": "Questions with the professor on the subject. Questions on MATLAB and Excel. It was a phone interview with the professor and a meeting with the head of department. I went very well. They asked about my availability and the experience.", "Interview Questions": "Do you know MATLAB..? Write a pattern recognition code ..?"}, {"date": "17 Jan 2017", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Drexel University (Philadelphia, PA) in Mar 2016", "Interview Descriptions": "there were a few email correspondences before the first interview, me requesting an interview, them responding then setting up the interview date (for me the next day) i only had 1 interview he asked me about my passions and interests research related and went through my resume. then i was offered the job on the spot and asked to start that day", "Interview Questions": "What are your research passions"}, {"date": "6 Mar 2016", "title": "Student Services Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Drexel University (Philadelphia, PA) in Feb 2016", "Interview Descriptions": "I was contacted by Director to attend an interview. Interview was two parts... first interview was with my peers in the department. Second interview was with managers and director of the department. The interview lasted an hour and half altogether.", "Interview Questions": "What do I consider success for a student?"}, {"date": "3 Dec 2015", "title": "Computer Lab Operator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University", "Interview Descriptions": "The interview was one interview with 30 minutes long. It was relaxed interview process. The interview were was nice and straight forward about what he wants to know. No tricky questions", "Interview Questions": "How does your previous experience help to do this job?"}], [{"date": "12 Jul 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University (Philadelphia, PA) in Dec 2015", "Interview Descriptions": "The advertisement was short notice, between the fall and winter terms. I applied and was notified that I would be interviewed in short-order. The interview was with the head of the subject matter I was to teach, and they were straightforward with me about the nature of adjunct employment at Drexel. Beyond the low pay and lack of benefits, the department has been good to me.", "Interview Questions": "Do you think you are able to adequately address a course topic in a 10-week quarter?"}, {"date": "21 Oct 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Drexel University", "Interview Descriptions": "Interview was conducted by conference call via phone with the program directors. It took approximately 1 hour with a productive conversation where not only were they trying to get to know me better, but allowed me plenty of questions to better understand what is expected of the position. Also, offered plenty of support with the understanding that I would be new to the online teaching model.", "Interview Questions": "What was your experience with online teaching?\r\nWhy are you interested in teaching?"}, {"date": "6 Aug 2019", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Drexel University (Philadelphia, PA) in Oct 2015", "Interview Descriptions": "One on one with department manager, informal. Small departments, no real upward movement, benefits heavy and good co-workers. Tuition Remission after year of employment sealed the deal. Typically older co-workers, people with families and roots in Philly. Not a great place to start a career but definitely the kind of place to settle down.", "Interview Questions": "What element would you compare electricity to."}, {"date": "11 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University (Philadelphia, PA) in Sept 2015", "Interview Descriptions": "It was a 20 Min short interview where we mainly talked about the the role and my research. There were some basic interview questions like strengths and weaknesses and how do i manage my time as i am working on a couple of projects and consulting classes. So it was pretty easy and straight forward.", "Interview Questions": "How do I manage my time?\r\nHow do i prioritize things?\r\nMy past research experience?\r\nHow am i at multi tasking?\r\n"}, {"date": "3 May 2017", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA) in Aug 2015", "Interview Descriptions": "-Initial 15 minute phone screening\r\n-1 hour long in person panel interview\r\n-1 hour long in person interview with VP\r\n-Questions were very standard\r\n-Be sure to review the website in depth and also look up the people you will be interviewing with beforehand.", "Interview Questions": "How would you handle a challenging situation with a student?"}, {"date": "31 Jul 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Drexel University (Philadelphia, PA) in Jul 2015", "Interview Descriptions": "Was contacted via email to set up a phone interview. Following the phone interview, I had two additional in-person interviews. The in-person interviews took place within the same week and I was offered the job the following week. All communications were done via email, except for the job offer, and I was given a very explicit timeline during the entire process. Overall great experience.", "Interview Questions": "Why do you think you're a good fit for this position?"}, {"date": "29 May 2015", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "Initially, I interviewed with the Director of Marketing & Recruitment, who would be my direct boss. During the second interview, I was also interviewed by the Dean and Associate Dean of the college at which I was interviewing (within the university).", "Interview Questions": "Define \"Marketing\""}, {"date": "21 Dec 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Drexel University (Phila, PA) in Mar 2015", "Interview Descriptions": "Group interview with a teaching presentation. Collegial atmosphere. Each member asked different questions. Salary and benefits were explained. Consisted of directors and faculty members who asked questions and provided information to applicant", "Interview Questions": "Why do you want to work at Drexel"}, {"date": "2 Feb 2015", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "The interview was very smoothy. and I personally enjoy it very much. The interviewers are very friendly. It took 2 weeks to process the entire hiring and interview process. But we have a very good communication between each other.", "Interview Questions": "Some technical questions are not easy to answer. Such as what is your understanding of material mechanical behavior at higher temperature."}, {"date": "28 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA) in Feb 2015", "Interview Descriptions": "very quick and to the point one interview, checked references short and sweet have to pay for parking but very friendly people only one interviewer and was taken on tour of lab.", "Interview Questions": "do you have any questions?"}], [{"date": "24 Sept 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Drexel University (Phila, PA) in Jan 2015", "Interview Descriptions": "The process was very straight forward for applying for a research position. We submitted requests online and were followed up with by head professors. We were contacted on where our interview would take place and met usually at a coffee shop on campus.", "Interview Questions": "What's do you do in your free time."}, {"date": "20 Nov 2014", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Interview process consists of 3 stages: 1 phone, 2 face-to-face. Phone screening was quite easy and a lady was very friendly and easy-going. I was notified the following week that I was selected to proceed with one-on-one interview with the Assistant Director for Finance and Administration. The final interview was with the head of the department I was being interviewed for. Hiring process did not take too long. I evaluate my overall experience through hiring and interview process quite highly.", "Interview Questions": "Can you think of a situation in your life when you had to go against your own will?"}, {"date": "24 Oct 2014", "title": "Fraternity and Sorority Life - House Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "The Hiring and Interview process was normal. Every graduate student received an email asking anyone if they were interested in becoming a House Director. I applied by sending in my cover letter and resume and received a phone call two weeks later. I had an in-person interview and received a call saying I received the job!", "Interview Questions": "What do you do to relieve stress?"}, {"date": "5 Aug 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Selected for summer internship. No interview required -- applied through email and was offered the position as a result of school work previously completed on an associated project. Internship paid about a hundred dollars per week, which was not bad considering it was just an internship, although it would have been nice to be paid more considering the engineering work involved.", "Interview Questions": "No interview questions required to become hired."}, {"date": "25 Aug 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Drexel University (Philadelphia, PA) in Aug 2014", "Interview Descriptions": "Heard about the job opportunity from a classmate. I emailed the Professor in-charge of the recruitment. She got back to me scheduling an interview. Mostly discussed the my past work experience, especially research and laboratory skills.", "Interview Questions": "why do you want to a TA"}, {"date": "31 Aug 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Drexel University (Philadelphia, PA) in Aug 2014", "Interview Descriptions": "Interview process starts with a paper application with recommendation letters from faculties. Once you invited for the interview, it started with general questions regarding your teaching experiences and all. Then moved forward towards the specific questions and challenges from hypothetical scenarios.", "Interview Questions": "What is your previous teaching experience?"}, {"date": "12 Feb 2016", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Drexel University in Aug 2014", "Interview Descriptions": "Contacted the PI that I am looking for a job as a post-doc. Replied to me in few days, that he is looking for someone. We agreed on Skype interview and prior the interview I sent him my CV, cover letter and statement of research philosophy. I also attached a list of projects I worked on with brief description what the project was about and what was my role in it. The interview took about an hour, both some questions about projects I worked on and my experience (he focused on projects that were related to the upcoming project). We also discussed the project and if I had any idea (based on my experience) what to avoid and what to include. Very friendly atmosphere. More like a brainstorming ideas.  In few days got a positive response and we had another Skype about my start date and salary negotiations. All with the PI. When we agreed on that, I submit all required documents to the RH.", "Interview Questions": "Can you perfomr the field measurements on your own"}, {"date": "15 Jul 2014", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Drexel University", "Interview Descriptions": "Took forever.  Months, actually.  I originally applied in the beginning of June and didn't even get in for an interview until August.  I came in for one interview with the Program Manager and Department Head, and then another Interview with the Program Manager and Department Head about two weeks later.", "Interview Questions": "Weren't really any.  Very standard"}, {"date": "30 Mar 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Drexel University", "Interview Descriptions": "Submitted resume/cover letter online, called in for in-person interview with team and a few weeks later, an in-person interview with the rest of the department. Less than a week after the second interview, I was offered the position. \r\nHR department was extremely friendly and helpful throughout the entire process. \r\nFrom applying for job online to receiving offer, it was about two months.", "Interview Questions": "Mainly questions about why I'd like to work there and questions regarding my most recent position experience. A few fun and out-of-the-box questions, which weren't super difficult, but involved thinking creatively (something required in the position every day anyway)\r\nNot the typical \"what's your biggest weakness\" sort of thing"}, {"date": "19 Jun 2017", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University (Philadelphia, PA) in Feb 2014", "Interview Descriptions": "Group interview with relevant questions. Team accurately described day to day work process. Skills and responsibilities were clearly outline. Performance management was discussed. Overall interview process was average and expected.", "Interview Questions": "Where do you see yourself in five years"}], [{"date": "18 Jan 2014", "title": "Clinical Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Drexel University", "Interview Descriptions": "Network with existing staff to get interviews", "Interview Questions": "N/A"}, {"date": "21 May 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Drexel University (Philadelphia, PA) in Jan 2014", "Interview Descriptions": "I submit an application to my advisor for teaching assistant. And the professor who needs one contacted me to have an interview. Basically they decided if they want you form the resume. The whole interview was talking about my experience on the resume. The most helpful thing is to have a high GPA and be good at communication. Also be patient to the students and have a great control in timeline.", "Interview Questions": "Nothing specific. Just talking about things on the resume."}, {"date": "27 Sept 2017", "title": "Student Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Drexel University (Phila, PA) in Jan 2014", "Interview Descriptions": "The hiring process was really fast and easy. I sat down for an interview and most questions were about how hard I was willing to work, and if I could handle working while being a full time student. He asked a couple things about my background to determine my best fit.", "Interview Questions": "Describe to me your knowledge on HFOSS projects."}, {"date": "21 Dec 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "Presented the rich knowledge of the background and excellent hands-on abilities.", "Interview Questions": "I met some difficulties when test my results in vivo study."}, {"date": "22 Jun 2015", "title": "Tutor At Lindy Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Drexel University (Philadelphia, PA) in Dec 2013", "Interview Descriptions": "The interview was more of putting forward the thought process as to how can one handle kids at the underprivileged schools and help them understand their subjects in a meaningful, subtle and efficient manner. They showed a video where the kids were difficult to handle and I was asked to react if I was in that situation of a teacher.", "Interview Questions": "How would you handle the questions posed by kids at school in the most efficient manner"}, {"date": "15 Nov 2013", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Drexel University", "Interview Descriptions": "Hiring and interview process is friendly and nice", "Interview Questions": "The rental is high in big city"}, {"date": "5 Aug 2015", "title": "STAR Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Drexel University (Philadelphia, PA) in Nov 2013", "Interview Descriptions": "Had to submit a resume online along with a tentative idea of what I would like my research to be, who my advisor would be, a faculty recommendation, and an essay outlining why I would be a good fit for this program. You need to have a minimum GPA required to apply, and those in the Honors College do have an advantange.", "Interview Questions": "N/A"}, {"date": "10 Oct 2014", "title": "Marketing Communications Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Drexel University in Jun 2013", "Interview Descriptions": "Took about 2-3 weeks. Came in for an in-person interview. Staff and managers are very friendly, asked basic behavior questions. All in all, if you have what they are looking for in that particular position, you should be fine. Asked about your skills, experience and how you will be able to apply it to higher education. Drexel is on a mission of growing exponentially so you need to convey that you are interested with growing the Brand as much as possible.", "Interview Questions": "Why Drexel?"}, {"date": "10 Mar 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "I got the job by discussing my experience with a professor without intending to apply for a job", "Interview Questions": "Just discussed my experience. No real questions"}, {"date": "26 Feb 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Drexel University", "Interview Descriptions": "The hiring process was long considering the unimportance of the role", "Interview Questions": "N/A"}], [{"date": "28 Nov 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Drexel University in Feb 2013", "Interview Descriptions": "30 mins long.  Friendly talk. Basic questions like why do you choose Drexel, why do you like your major, what's your career goal...Asked about previous research experience. Basically, you are judged for your communication skills and logical thinking.", "Interview Questions": "Basic questions like why do you choose Drexel, why do you like your major, what's your career goal...Asked about previous research experience."}, {"date": "7 Sept 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Drexel University in Jan 2013", "Interview Descriptions": "I was interviewed at ASSA in January for the initial interview. Then I was invited to campus for additional interviews and paper presentation. Overall, the entire interview process was pleasant even though the campus interview was exhausting.", "Interview Questions": "Why did you apply for a job with this organization?"}, {"date": "6 Apr 2017", "title": "Senior Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Drexel University (Philadelphia, PA) in Jan 2013", "Interview Descriptions": "Quick phone interview and two in person interviews. Overall process was very fast and I went from phone interview to offer in less then 1 week. Interview was easy and I felt that they didnt really know what they were looking for.", "Interview Questions": "Basic Skills questions about security tools and coding experiance"}, {"date": "30 Sept 2012", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Drexel University (Philadelphia, PA)", "Interview Descriptions": "Submitted online application with resume and cover letter.  Had one interview with the director (was casual and friendly) and another more formal one with the dean, associate dean, and director .", "Interview Questions": "Kept asking me if I knew about marketing, since my degree was in communication."}, {"date": "24 Sept 2015", "title": "Climbing Wall Manager Co-op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Drexel University (Phila, PA) in Jul 2012", "Interview Descriptions": "very professional yet fun because climbing became part of it. Later found out I was being interviewed by the person I was replacing. Was able to act like myself. Didn't feel pressure. Very fun", "Interview Questions": "Tell me about yourself."}, {"date": "19 Jun 2015", "title": "Student Leadership Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Drexel University (New Philadelphia, PA) in May 2012", "Interview Descriptions": "Pretty straight forward. 1 on 1. relaxed setting. They had a sheet to read off questions. They went off  on their own with freestyle questions at times. Nothing too hard. Just come prepared and confident", "Interview Questions": "Tell us you one of your weakness and what you're doing to improve.."}, {"date": "22 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Drexel University (Phila, PA) in Aug 2011", "Interview Descriptions": "Find the professor you are interested in working with and get an appointment with them. Prof is usually the decision maker for offering the RA position in his research group. They usually look for your past research experience and your passion for research.", "Interview Questions": "Why do you want to pursue this research? "}, {"date": "4 Dec 2011", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Drexel University (Philadelphia, PA) in Jul 2011", "Interview Descriptions": "The interview process was very long and not very organized. It took months for everything to be official.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "5 Jan 2012", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Drexel University (Philadelphia, PA) in Mar 2011", "Interview Descriptions": "I had a brief initial phone screen, followed by two panel interviews.  The phone screen was very simple, with just a few questions about my interest in the position, availability (there were some weekends required for the roll) and resume.  The first panel interview was somewhat casual.  They asked a few warm-up questions (we talked about the weather, the Phillies, etc.) and then a variety of questions, mainly based on my resume.  The panel took turn asking questions that they had each developed, so they will a little all over the place in terms of style.  The second interview was a little more formal, but also unique.  The first half hour was mainly behavioral style questions.  Then, the manager left, and I was asked more personal questions about my work style to test my fit as a member of the team.", "Interview Questions": "Why should we hire you?"}, {"date": "22 Mar 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Drexel University (Philadelphia, PA) in Mar 2011", "Interview Descriptions": "Interview with the professor. Make sure you know your concepts of Physics right. If you have worked on any Physics related projects, ensure that you talk in detail about it.", "Interview Questions": "Conceptual question regarding electromagnetism"}], [{"date": "5 Oct 2010", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Drexel University (Philadelphia, PA) in Sept 2010", "Interview Descriptions": "I was asked some simple technical questions like how to find the intersection of two sorted lists, MVC model,etc, and some behavioral questions like what my top 3 strengths are.", "Interview Questions": "What is MVC model?"}, {"date": "19 Sept 2013", "title": "Graduate Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Drexel University (Philadelphia, PA) in Jul 2010", "Interview Descriptions": "I applied in response to a call for applications for the graduate research fellowship position. Heard back from them 2 months after then was interviewed after 2 weeks. Three research professors were in the panel while a secretary was also present and sometimes asks questions as well.", "Interview Questions": "There was one required instrument that they expected every applicant would know how to use. They asked if I am familiar with it."}, {"date": "20 May 2011", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Drexel University (Philadelphia, PA) in Mar 2010", "Interview Descriptions": "I applied for the GRA position of the bussiness deparment of Drexel University. One of their professors called some day in March and told me that I was accepted by their department and provided with a GRA.\r\nHe asked me to make a decision whether to accept this offer in one week.", "Interview Questions": "Which other graduate schools have you applied and have they provided any financial aid?"}, {"date": "11 Aug 2012", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Drexel University (Philadelphia, PA) in Nov 2009", "Interview Descriptions": "I was called in for an interview about three weeks after I'd submitted my application.  I was interviewed by two people initially - my immediate supervisor and the program assistant.  The questions asked were fairly basic and most stemmed directly from my resume.  The second interview was a one on one with the program director.  Again the questions stemmed mainly from my resume.", "Interview Questions": "The most difficult question was the open ended \"tell us about yourself\" question."}, {"date": "20 Jun 2011", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Drexel University (Philadelphia, PA) in Jun 2009", "Interview Descriptions": "professor asked me what is my interest and tell me what project he is doing now, asked me about my ideas and understanding of his projects also about my final career plan and lifetime.", "Interview Questions": "your former projects"}, {"date": "20 Dec 2011", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Drexel University (Philadelphia, PA) in Jan 2009", "Interview Descriptions": "the interview process started with a phone interview.  Shortly thereafter an in-person interview was scheduled which lasted 6 hours.  This was a mix of 1 on 1 interviews and group interviews with various constituents around the institution.", "Interview Questions": "What skills do you bring that will allow help us to achieve our strategic plan."}]]