[[{"date": "6 Apr 2023", "title": "Telemarketer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Comic Relief", "Interview Descriptions": "The interview process was very easy and straightforward. no need to overthink, be confident and answer about yourself. What it means for you to have the job and why you applied.", "Interview Questions": "what made you apply here?"}, {"date": "24 Jan 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Comic Relief (London, England) in Jan 2023", "Interview Descriptions": "Given a choice to choose an interview that suits your commitments. Questions sent before interview. Friendly interviewers who gave you sufficient time to answer each question. Great process all together", "Interview Questions": "What questions do you have for us?"}, {"date": "2 Oct 2021", "title": "Media Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Comic Relief in Sept 2021", "Interview Descriptions": "Provided with a sample of the questions the night before a 45 minute interview. One of the panel spent much of this looking outside at whatever was going on elsewhere, and throughout one question was laughing at something on her screen. \r\nPerhaps they thought this shows a happy spirit; it’s actually just very disrespectful to someone who had been considering working for the charity.\r\nIt would have been average difficulty, but the attitude made it very difficult and uncomfortable.", "Interview Questions": "Talk about how you keep a digital focus for a campaign."}, {"date": "18 Apr 2021", "title": "Community Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Comic Relief (London, England) in Nov 2020", "Interview Descriptions": "The interview was held online via Zoom and involved a task (prepare a presentation and deliver it to the panel at the start of the interview) followed by competency-based interview questions.", "Interview Questions": "Why would you be the perfect candidate for this role?"}, {"date": "16 Jan 2020", "title": "Creative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Comic Relief (London, England)", "Interview Descriptions": "I interviewed with the Creative Service Lead and Marketing Manager. Taking them through the work, the Creative Service Lead pointed to a particular campaign and asked me a question which gave me pause: she asked me when the campaign was created. \r\n\r\nI suspected that, out of the ten campaigns presented, she only asked about the date of particular campaign as a way to gauge my age (it was the only one in the portfolio that indicated it was done over ten years ago by the celebritys in the ads) which is discriminatory, goes against their values and, despite being Comic Relief, not a laughing matter.", "Interview Questions": "What can Comic Relief do to stay relevant?"}, {"date": "31 Oct 2019", "title": "Schools Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Comic Relief (London, England)", "Interview Descriptions": "Application with be applied- 5 online questions. \r\nPre interview task of looking over past materials given to schools and evaluating and then interview with two people which last about 15 minutes", "Interview Questions": "Why do you want to work for the company "}, {"date": "28 Jul 2018", "title": "Creative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Comic Relief", "Interview Descriptions": "I found the person who was interviewing me very unorganised and unfocused. But as needs must I pressed on with the second interview. He was always late meeting me for our interviews and never improved once I was hired.", "Interview Questions": "What is my favourite film for example. They actually used clipboards to hold their documents."}, {"date": "17 Mar 2018", "title": "Head of Data Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Comic Relief (London, England) in Feb 2018", "Interview Descriptions": "Very strange interview. Both of the interviewers were leaving the company. In the case of the CTO he wasn’t being replaced, which I found very odd, but apparently the board had decided that the company didn’t need a CTO. Based on what they said I’m not entirely sure they know what they want for the data department either, but I wasn’t able to find out more on this as there was no time allotted for questions from candidates. The interview started slightly late and I was rushed through every question. Typically I would start answering, and then the CTO would interject and ask a follow up question before telling me that we were behind schedule. The CTO checked his phone on a few occasions and  told me that he had to reply to a business message that was sent otherwise there would be an outage. I found this to be unprofessional, but to be fair he did apologise.  It seemed to me that he was very much needed after all. \n\nMy main frustration was that there were too many questions for the time allotted. The fact that they didn’t even have my cv in front of them, made it more difficult. Their feedback to the recruitment consultant was that my answers were not concise enough, indicating that I would struggle with their stakeholders. My feedback to them would be - it is impossible to give top three career highlights in 2 minutes when you are asked follow up questions almost as soon as you start answering. Frustratingly even before the interview, they questioned my suitability as they said that it wasn’t obvious from my cv that I had the skills and experience to deal with their apparently difficult stakeholders. This is despite my nearly 20 years experience with the technology stack they are using, and the fact that my current job title is Product Manger. Obviously stakeholder management is a big part of my role. The equally frustrated rec con told me that the feedback about me was almost identical to feedback to the previous candidate, who had said the same thing about his interview, and they had said the same thing about him.\n\nIt was difficult to set up a time for the interview in the first place as both the interviewers and myself were very busy with work. I moved a few things around to fit into one of the few time slots that they could make, but I don’t feel I had their full attention or that I got a fair crack at it. They were obviously preoccupied with the sport relief campaign and maybe it was a bad time for them. I have a very good record at interviews and am confident that I could have been successful in the job. The suggestion that I didn’t have the skills or experience is frankly ridiculous. If anything it would have been a step down from what I am currently doing, as the development team at comic relief is half the size of my current team and my responsibilities in my current role outweigh those of the job advertised.  Without revealing where I work, I can’t  imagine comic relief stakeholders being more difficult than my current stakeholders, and would have welcomed a chance to talk to them and let them make a call instead of two people who were leaving the company. Before the interview I was very keen to work there and would have been prepared to take a pay cut to work for a charity such as this, but it’s possible that I’ve dodged a bullet.", "Interview Questions": "List your top 3 career highlights"}, {"date": "25 Nov 2015", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Comic Relief", "Interview Descriptions": "30 minute task, writing an email reply. Lovely people interviewing, good questions and we had a good rapport. Obviously it is very competitive. Seemed like a great office and nice place to work.", "Interview Questions": "Why do you want to work for Comic Relief?"}, {"date": "21 Nov 2015", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Comic Relief", "Interview Descriptions": "Was invited to an interview where I was made to sit a brief initial task. The task involved forming a reply to a supporter enquiry and then I was given a list of tasks to put in order of priority and why I chose this order. I was put in front of a panel of 2 people, and was asked competency based questions, asking what qualities and skills are needed for the position and how I felt I matched these skills.", "Interview Questions": "What is your experience of working under pressure?"}], [{"date": "17 Nov 2015", "title": "Email Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Comic Relief (London, England) in Sept 2015", "Interview Descriptions": "Three strong team of ex employee, head of something, and HR. \r\n\r\nHr was on the ball. Head of something wanted to be somewhere else. Soon to be ex employee was very nice. \r\n\r\nHead of something looked out of the window behind me. And although I caught her three times, as I looked up from my presentation, so just looked on.\r\n\r\nIt was obvious that email was not on her list of favourites. Soon to ex employee had a real passion for email and single handed my built up procedures and (stuff that cannot be mentioned for legal reasons.)", "Interview Questions": "Favourite and best practice emails."}, {"date": "30 Mar 2017", "title": "Human Resources Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Comic Relief (London, England) in Mar 2015", "Interview Descriptions": "Applied online and was interviewed a week later. Did panel interview with 2 members of staff and written test, followed by one to one. All in all really good, have to do your homework as they will ask about CR history and values.", "Interview Questions": "Tell us what know about Comic Relief? (talk about values)"}]]