[[{"date": "9 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Duke-NUS (Bedok New Town, )", "Interview Descriptions": "After a simple exchange of information on the Internet, we communicated in the PI's office for about 30 minutes. Everything is easy and fun. On the second day after the end, I received a notification whether there was a follow-up.", "Interview Questions": "Self introduction, previous research project and future plan. Focused on the tools I use and how to use them."}, {"date": "2 Mar 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Duke-NUS (Singapore) in Feb 2023", "Interview Descriptions": "Two rounds of interview, the first one with the Associate Professors and the second-round interview was with the Executive Directors. No offer after 3 weeks exactly from HR, hence I am guessing I have not been shortlisted.", "Interview Questions": "How do you see yourself in 5 years?"}, {"date": "11 Nov 2022", "title": "Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Duke-NUS", "Interview Descriptions": "Fast interview arrangement between HR and hiring manager. Interview process is smooth. Had to go through 2 rounds of interview. Overall process took about 2 to 3 weeks before HR comes back on the offer.", "Interview Questions": "What's your strength and weakness?"}, {"date": "29 Sept 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Duke-NUS", "Interview Descriptions": "2 rounds of interview. First with a post doc and then an in-person interview with the Principal investigator. \r\n\r\nYou can only proceed to the second round of interview if you are shortlisted.", "Interview Questions": "Experience in research and what i did before. "}, {"date": "4 Aug 2022", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Duke-NUS", "Interview Descriptions": "Process was relatively straightforward, and it was more like a chat than an interview.  Everything was arranged conveniently via email, and process was smooth and fast. The interviewer was very friendly, and provided a comfortable environment.", "Interview Questions": "What can you value-add to the organisation? "}, {"date": "8 Jul 2022", "title": "Senior Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Duke-NUS (Singapore) in Jul 2022", "Interview Descriptions": "Applied for the Senior Executive role under the Office of Education (OoE) on 20 May via NUS Careers portal, 1st initial communication from HR via phone on 9 June, confirmed 1st interview on 20 June via email.\n\n The HR is very persistent to have  1st interview face to face and not via online. Emailed me a application form to fill up past education and employment history (including previous/current drawn salary and bonuses), 2x references. It's very time consuming as the details they want is mostly stated in the resume. Asked to attach educational cert, transcript, latest payslip, testimonials as well. \n\nOnly 1 interview with Deputy director and Assistant manager (Direct RO) at Duke NUS (Outram) . Friendly and pleasant interview experience. \n\nThe AM shared alot about the job in detail, the female Deputy director is gentle and soft spoken.\n\nHR offered me on 1st July (8 working days after the interview), quite fast, it's a little less that what I'm expecting. 13% more than my current drawn base salary.", "Interview Questions": "Introduce yourself"}, {"date": "5 Jun 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Duke-NUS", "Interview Descriptions": "Generic interview and a lot of questions asked about past experience. Scenario questions also included to identify if the candidate is suitable for the position. Overall a pleasant experience.", "Interview Questions": "Describe your past work experience and how would it contribute to the position you are being offered "}, {"date": "16 Jun 2021", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Duke-NUS (Singapore) in Apr 2021", "Interview Descriptions": "I had 3 interviewers ( Dean, Deputy Director and my Reporting Manager). They were really nice and the interview was a 2-way street. They got to know about me and I also got to know about their department. Overall was a very pleasant interview :)", "Interview Questions": "Tell me about yourself, Strengths, Weaknesses"}, {"date": "9 Dec 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Duke-NUS in Apr 2020", "Interview Descriptions": "3 rounds of interview - 1 phone interview and 2 in-person interviews. Be prepared to explain your resume and how past experience match to current job expectations. Also having past research experience helps.", "Interview Questions": "How can you contribute to our team? "}, {"date": "29 Jan 2020", "title": "Senior Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Duke-NUS", "Interview Descriptions": "Directly contacted the supervisor in charge of the lab. He asked me to meet for an interview and I was selected. HR prepared the contract within a few weeks. Quick and efficient process.", "Interview Questions": "Why work at an academic institution?"}], [{"date": "14 Jan 2020", "title": "Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Duke-NUS", "Interview Descriptions": "searched for opening on their careers website and applied for the job online. 2 rounds of interview conducted on separate days. follow up after interview not as quick as desired", "Interview Questions": "Tell me more about yourself"}, {"date": "27 Aug 2019", "title": "IP Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at Duke-NUS (Singapore)", "Interview Descriptions": "A 1 hour interview on my expertise areas, motivations to join the company, what my career plan was and what I wanted to achieve here and in life. I was also able to ask questions in the end and got clear answers.", "Interview Questions": "Where do you see yourself in 5 years ?"}, {"date": "6 Mar 2019", "title": "MD Programmer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Duke-NUS (Singapore) in Feb 2019", "Interview Descriptions": "I submitted my application and received an invitation for Applicant Day. Applicant Day was indeed like what was described in the invitation, a TeamLEAD session first followed by 2 interviews with a doctor/researcher and then finally a short ethics video questionnaire.", "Interview Questions": "What was the most challenging event you have experienced in your previous internships?"}, {"date": "12 Jul 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Duke-NUS (Singapore) in Dec 2018", "Interview Descriptions": "Employer asked about my previous experience as well as my future goals. Employer talked about his/her field of interest and discussed topics in relation to the field. Employer talked about his/her expectations of me and described my job scope as well.", "Interview Questions": "What are your future goals "}, {"date": "16 Jul 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Duke-NUS", "Interview Descriptions": "Smooth process; usually 3 rounds of interview with the assistant PI and senior PI followed by HR interview. If you are a foreigner, selection process may take up to 3 months", "Interview Questions": "Highlight the key skills relevant to the job description; can ask technical questions to verify your academic or work-experience"}, {"date": "1 Jun 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Duke-NUS (Singapore) in Apr 2018", "Interview Descriptions": "Had 2 people that were younger than me who were both research assistants interview me with very typical questions that I felt were already pre-determiend. For example: What are your weaknesses + example, and what are you strengths + example. Or, \"oh you say one of your qualities is ---, would you please provide an example?\" They clearly were not used to interviewing and were nervous themselves. \r\n\r\nIn the end when I asked for feedback, they said they rejected me because I didn't know my work well. Sure. \r\n\r\nThe interviewers, however, seemed like great people. Maybe I didn't sell myself properly, or described how I'd fit in there, but I feel that they googled some interview questions beforehand instead of really trying to get to know me and what I may have potentially offered.", "Interview Questions": "What was your previous research about/What was the research question?"}, {"date": "20 Feb 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Duke-NUS (Singapore) in Jan 2018", "Interview Descriptions": "Had a brief Skype interview with the associate professor for a role in her laboratory. Promised that she will get back to me with the results of the interview after 2 weeks. However, its been over almost a month and she has yet to get back to me. I just assumed that I did not get the role.", "Interview Questions": "What's my research interest and how do I see myself in 5 years time. "}, {"date": "7 Mar 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Duke-NUS (Singapore) in Jan 2016", "Interview Descriptions": "There were two sessions of interview in total. The final interview was with the lead researcher- although questions raised was repetitive of the first interview (e.g. why the interest to join us? what are your career goals? what are your relevant past experiences)?", "Interview Questions": "What are your relevant past experiences?"}, {"date": "5 May 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Duke-NUS (Singapore) in Apr 2015", "Interview Descriptions": "General  question on tell me about yourself and your career prospect. Sharing information about the research work/ experiment.  Was introduced to the manager, lab staff and other research assistant. They were very friendly.", "Interview Questions": "Tell me about yourself?"}, {"date": "11 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Duke-NUS (Singapore) in Feb 2015", "Interview Descriptions": "The interview process was just with PI. No HR involved. It was a one to one discussion with the PI on your research project and an explanation of your job scope as a research assistant. There was no mention of your role as a laboratory manager (you get the shock on the first day of work and when you questioned about it, he insisted that he informed you and the whole lab was updated with your dual role) when you start working as a research assistant under him.", "Interview Questions": "Describe your research project experience."}], [{"date": "3 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Duke-NUS (Singapore) in Jan 2015", "Interview Descriptions": "Meet up with the Principal investigator. Had a 1-1 interview session.\r\nBrief discuss what is the project going to be about.  We they discuss about the salary package. After all is agreeable, we proceeded to Hr to verify the necessary documents", "Interview Questions": "Why do you want to pursue science  "}, {"date": "8 Sept 2014", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Duke-NUS (Singapore) in May 2014", "Interview Descriptions": "The hiring and the interview process really depends on the team and department for which you have been hired. Generally the interview has around 2 rounds. One with the existing technical team or technical team manager and other will be with the business manager", "Interview Questions": "Tailor your experience to their needs"}, {"date": "4 Sept 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Duke-NUS", "Interview Descriptions": "No interview", "Interview Questions": "No question asked. Based on qualification and experiences."}, {"date": "30 May 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Duke-NUS (Singapore) in May 2013", "Interview Descriptions": "Postdoc asked some questions about my previous project and gave some scenarios to answer. The professor gave an overview of his projects in his lab and what I should expect.", "Interview Questions": "What is my field of interest"}, {"date": "16 Jun 2015", "title": "Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Duke-NUS (Singapore) in Feb 2013", "Interview Descriptions": "I was asked to do some kind of \"reading comprehension test\" which was what they told me beforehand.  It was NOT a reading comprehension test at all.  It was an open-ended question that was abstractly related to the job but they never mentioned anything about it in the interview, for some reason.    I was not impressed that they weren't transparent about what I would be tested on and what it would be measuring.  That was red flag number one.  Then i was taken to the main interview room and was interviewed by three people.  One of them was very condescending towards me and was reading my \"test answer\" while I was talking (very rude).  I wasn't impressed with her overall tone.  I feel I answered the questions well but the interviewers were the ones who let me down with their \"secret test\" and rude tone.   I did get called back for a second round with three people as well.  One of the interviewers, after having listened to all my answers finally had a question for me which was :  \"Do you have any children?\"  That is an illegal question and I could not believe that after having sat there for a whole hour, that was the only thing this interviewer wanted to know.  So, so bad.  So unprofessional.  I was not happy with the whole process.  It was a shame because I know I could have done this job well and I was totally qualified to do it.  Their loss.", "Interview Questions": "Why are you applying for this job?  What skills can you bring? Why aren't you applying for a faculty position?  Do you have any children?  \r\n"}]]