[[{"date": "15 Nov 2022", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Metrocare", "Interview Descriptions": "Smooth and Seamless. The people were very nice and bounced ideas off of one another. You can conduct the interview in person or on zoom. It is not a scary experience and it just feels like you are casually talking to one another. In the end, they will ask you if you have any questions for them. I would strongly suggest that you ask them a question regarding the position. It shows them that you care and you are interested!", "Interview Questions": "How will you contribute to metrocare?"}, {"date": "17 Nov 2022", "title": "Housing Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Metrocare (Dallas, TX) in Oct 2022", "Interview Descriptions": "The process was the most unorganized interview process that I have ever experienced. I did not hear back for a week, and got an offer for another position that I did not even apply/interview for. They seemed very pushy with waiting me to take that position instead, which was a read flag. Their entire process took 3 weeks, only for them to push the process for another month, because I missed the new hire orientation deadline. I rescinded my offer acceptance, as the process was very unprofessional with absolutely no communication. Very embarrassing.", "Interview Questions": "Q: Where do you see yourself in 5 years?"}, {"date": "26 May 2022", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metrocare", "Interview Descriptions": "The interview was very relaxed and straight forward. The standard tell me about you self and what makes you a great fit for this roll. Talked about job duties and how an average work week will be.", "Interview Questions": "Tell me about yourself and are you aware of what a care coordinator does"}, {"date": "16 Nov 2020", "title": "QMHP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Metrocare", "Interview Descriptions": "Simple and welcoming.  The interviewers asked questions and gave enough time to answer. They made me feel comfortable. Would recommend to anyone looking to get into field one hundred percent.", "Interview Questions": "Why do you want to work here? "}, {"date": "14 Aug 2020", "title": "Case Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Metrocare", "Interview Descriptions": "It was very smooth. I applied. Got a call for an interview. I interviewed. I was then offered a position and told a start date. This was a pleasant process.", "Interview Questions": "Are you familiar with the community we serve?"}, {"date": "28 Feb 2019", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Metrocare in Dec 2018", "Interview Descriptions": "I interviewed for a wraparound facilitator and a QMHP. I took the QMHP job but in retrospect should have taken the wraparound facilitator. They called me in to interview at the Westmoreland and Skillman sites. Be prepared that these sites are not well kept or well run. Three individuals interviewed me for the QMHP position and within the span of 2 months, one of those employees left the department, the other quit his job, and the female is still at Metro.", "Interview Questions": "How do you deal with clients."}, {"date": "2 Feb 2019", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Metrocare (Dallas, TX) in Oct 2018", "Interview Descriptions": "Three individuals interviewed me. Two months later one individual resigned and the other individual transferred to another department. That’s obviously not a good sign. The individual who resigned conducted most of the interview as well as the individual who transferred out of the department. I believe they knew that the department had many problems.", "Interview Questions": "Tell us about a difficult client situation and how you handled it?"}, {"date": "18 May 2018", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Metrocare (Dallas, TX) in Oct 2017", "Interview Descriptions": "Interview process takes forever!!!! Inhad to call them to see what was going on.  3 months!!! Its 3 interviews a drug test , reference check and background checks.  Background checks are done by paper to about 5 people.", "Interview Questions": "Did you review glassdoor  ? (Red flag there)"}, {"date": "27 Mar 2019", "title": "QUALIFIED MENTAL HEALTH PROFESSIONAL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Metrocare (Dallas, TX) in Sept 2017", "Interview Descriptions": "The interview process was quick and easy. The managers are very good about conducting professional interviews and getting people in the door. Keeping them, on the other hand, is more difficult.", "Interview Questions": "What kind of experience do you have working with this population?"}, {"date": "30 Jun 2017", "title": "QMHP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Metrocare (Dallas, TX) in Apr 2017", "Interview Descriptions": "Relaxed,  but a panel format. You are interviewing with another candidate! For someone like me who is more introverted this is extremely uncomfortable. The staff was very nice though!", "Interview Questions": "How do  you manage your time?"}], [{"date": "17 Jan 2017", "title": "Service Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Metrocare (New York, NY)", "Interview Descriptions": "I applied yesterday and today my profile for the job was updated and a message of \"your application is being considered\" showed up. Looking forward to know if this job is worthwhile as far as building my resume and if it pays decent.", "Interview Questions": "N/A"}, {"date": "5 Mar 2017", "title": "QMHP Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Metrocare (Dallas, TX) in Jan 2017", "Interview Descriptions": "Panel interview with 3 people. Standard questions takes about an hour. Can be stressful with a room full of people all asking questions. They write down what you answer and score your response.", "Interview Questions": "What do I know about Metrocare?"}, {"date": "25 Dec 2016", "title": "QUALIFIED MENTAL HEALTH PROFESSIONAL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Metrocare (Dallas, TX) in Aug 2016", "Interview Descriptions": "Group interview process, open forum; you go from desk to desk asking questions & answering questions. It's not difficult to get hired if you show interest & some work experience that can translate to the job.", "Interview Questions": "Tell me a little about your professional background? "}, {"date": "31 Jul 2016", "title": "QUALIFIED MENTAL HEALTH PROFESSIONAL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metrocare (Dallas, TX) in Jul 2016", "Interview Descriptions": "Three person interview, good flow between the interviewers. The interviewers made me feel comfortable. The room was a little small, really close to the interviewers. They answered my questions well. Overall, good interview environment.", "Interview Questions": "How do you handle schedule changes?"}, {"date": "31 Dec 2015", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Metrocare", "Interview Descriptions": "The whole process took about a month or so. I had already worked at the company before. I was referred by one of the Doctor's there. It is easier when you know someone who works at the company. However, I did go through the process as if I was a new hire.", "Interview Questions": "What kind of experience do I have?"}, {"date": "4 Dec 2015", "title": "QMHP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at Metrocare (Irving, TX) in Oct 2015", "Interview Descriptions": "The interview was professional with three people interviewing. Questions pertained to experience within the mental health field. Main question was on how you manage time and several cases working around the clients time. Each person explained various roles you may take on expecting compliance with patients toward the consumer.", "Interview Questions": "Are you a team player?"}, {"date": "17 Jan 2015", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Metrocare", "Interview Descriptions": "Interview was average.  Hiring process took forever, maybe six weeks.  I checked in numerous times, and no one returned my calls.  Interviewer could not inform me of the status, or even if she had submitted my name for approval.  The initial training before I went to work on campus was sorely lacking in true instruction, leaving me to fend for myself on how to operate the software, as well as knowing how to document utilization reviews without having them returned.  No one explained that you had to hit a certain mark of productivity to keep your job, regardless of whose fault the shortcoming may be.", "Interview Questions": "Can't think of anything out of the ordinary."}, {"date": "25 Aug 2015", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Metrocare (Dallas, TX) in Aug 2014", "Interview Descriptions": "You send in your resume online through the website or job board such as Indeed. You do not know which clinic you will be applying to there are a number clinics in different areas. You go in for an interview w/ both the Clinical Manager/Director and/or the clinical manager II similar to an assistant manager, they go over your resume & ask questions about your experiences.", "Interview Questions": "What is your theoretical orientation?"}, {"date": "12 Oct 2015", "title": "Support Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Metrocare (Dallas, TX) in Jun 2014", "Interview Descriptions": "I was hired entirely over a phone interview. They guy who interviewed me was not a manager or a supervisor, just a guy who had been there for a while I guess. He asked me some vague questions about what technologies (nothing he couldn't have found on my resume) and the next day I was working at Metrocare.", "Interview Questions": "Have you ever worked with Active Directory?"}, {"date": "15 Oct 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Metrocare (Dallas, TX) in May 2013", "Interview Descriptions": "Interview was efficient and to the point.  However, it was months after I applied before I was contacted for the job. Interviewer was very pleasant and process was not particularly stressful. This was before new HR Manager so not sure if process remains the same - very slow when I was hired.", "Interview Questions": "Scenario questions to see how you \"think on your feet\"."}], [{"date": "24 Aug 2014", "title": "Discharge Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Metrocare in Oct 2012", "Interview Descriptions": "There were three interviews. First was with a Clinical Manager for another program who referred me to a different Clinical Manager. I had two interviews with her and then got a call and offer from the HR department.", "Interview Questions": "Questions were typical interview questions."}, {"date": "15 Jul 2012", "title": "QMHP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Metrocare (Dallas, TX)", "Interview Descriptions": "2 ppl interviewed me and then got hired a week later.", "Interview Questions": "N/A"}]]